[
  {
    "start": 3.473,
    "end": 3.773,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3.794,
    "end": 4.395,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.715,
    "end": 10.605,
    "text": "It is July 11th, and we're in the second discussion on Chapter 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.526,
    "end": 22.124,
    "text": "So before we go into any of the questions, does anyone just want to bring up anything or just start with anything about Chapter 2?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.973,
    "end": 28.234,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.895,
    "end": 30.257,
    "text": "And then anyone else who raised their hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.667,
    "end": 55.722,
    "text": " Amit Singer- Thank you yeah I just uploaded the equation 2.5 walkthrough in the I guess I put it in the equations table if i'm not mistaken, but equation 2.6 needs a little bit more fine tuning before it's ready, but i'm sure it will be ready for the next week so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.702,
    "end": 63.572,
    "text": " I think I put it at the top of the notes section of equation 2.5.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 63.732,
    "end": 70.241,
    "text": "So if anyone wants to, but yeah, that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.339,
    "end": 84.679,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.313,
    "end": 97.352,
    "text": " looks awesome can we maybe uh go over it or can you just walk through it or yeah sure yeah uh well first of all um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.497,
    "end": 106.446,
    "text": " We began with just basic definitions, such as some fundamental definitions, such as the Shannon entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 107.527,
    "end": 122.985,
    "text": "And then to derive the first line, we substitute the Shannon entropy term into the first line of equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 122.965,
    "end": 141.514,
    "text": " uh we can see there's uh an interesting parallel between uh this kind of formulation between energy and entropy and also the path integral formulation of variation free energy but the essential difference here is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 142.0,
    "end": 150.792,
    "text": " Here, the first term represents only the energy, but for the path integral, it can be best described as the energy constraint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.894,
    "end": 155.118,
    "text": "So that's more of a side note there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.138,
    "end": 167.535,
    "text": "And then for the second line of equation, 2.5, we get, but before going into the equation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 167.515,
    "end": 168.558,
    "text": " The second line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 168.618,
    "end": 172.267,
    "text": "Just let me unpack the first line a little bit more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 172.748,
    "end": 184.478,
    "text": "So for for the people who who are not familiar with callback libeler diversions, we put the definition of callback libeler at the top of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 184.88,
    "end": 186.883,
    "text": " or at the top of the page one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 188.045,
    "end": 206.213,
    "text": "And then by using Jane's inequality, we get the callback Leibler divergence bounded by the expectation of the log p over q.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 206.193,
    "end": 234.529,
    "text": " and that allows us to substitute the shannon entropy term into the expectation of the log p over q so that was the essential move for unpacking the first line of equations so i mean without jensen's inequality we wouldn't exactly get the the exact term of the first line of the equation because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 234.509,
    "end": 243.003,
    "text": " Obviously, the order of the log operator and the expectation operator is different than we need here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 244.665,
    "end": 252.518,
    "text": "So yeah, that's basically straightforward algebraic manipulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.78,
    "end": 266.676,
    "text": " And the second line of equation 2.5, or the terms, the trade-off between complexity and accuracy, similarly can resolve from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 267.449,
    "end": 285.492,
    "text": " uh substituting uh i mean by uh expanding uh the first line of the equation and then substituting some of the term as the callback libler divergence and then we get the complexity term",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 285.472,
    "end": 288.418,
    "text": " and the rest will be the accuracy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 288.939,
    "end": 305.775,
    "text": "So what it means is that, as pointed at the bottom of the page, the greater complexity is, in other words, the more one needs to change beliefs to explain observations, the lesser predictive accuracy will become.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.755,
    "end": 317.171,
    "text": " So in this case, variational free energy would be just the minimization of the complexity or at the same time, maximizing the accuracy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 318.373,
    "end": 324.522,
    "text": "And again, it can be compared to the path integral formulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 324.722,
    "end": 331.712,
    "text": "It's almost identical to the path integral formulation of the tradeoff between complexity and the accuracy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 332.755,
    "end": 337.939,
    "text": " All right, so for the third line of equation 2.5,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 339.269,
    "end": 366.964,
    "text": " uh we've tried to somehow get the trade-off between the divergence and the evidence but in this case evidence is just something that acts as as the bound or the evidence lower bound so it's something that's always greater than or equal to surprising right so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.552,
    "end": 384.987,
    "text": " uh by unpacking the um the last line of equation 2.5 into these two distinct terms or this trade-off between divergence and evidence uh we are allowed to have this um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.967,
    "end": 406.57,
    "text": " elbow or evidence lower bound or in other words the negative upper bound that would enable us to regard BFE as the optimization parameter or the parameter to be optimized rather than trying to achieve the exact value of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 407.022,
    "end": 420.459,
    "text": " free energy, but just some optimization parameter, which would be much more tractable than trying to achieve the exact amount of the free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 426.106,
    "end": 426.746,
    "text": "Awesome work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.688,
    "end": 428.048,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.651,
    "end": 431.292,
    "text": "Cool stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.056,
    "end": 460.857,
    "text": " anyone want to ask a question or or make a comment on this could you maybe explain a little more like zoomed out from this document what does the variational free energy uh do in the model like in the textbook okay so a variation free energy is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.562,
    "end": 481.03,
    "text": " variational technique that, sorry, as I mentioned, allows us to do the approximate computations of Bayesian inference in terms of optimizing a certain parameter, namely the variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 481.751,
    "end": 491.164,
    "text": "Because computing the exact Bayesian inference of, or Bayesian output, sorry, Bayesian inference,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 491.144,
    "end": 503.318,
    "text": " with regard to both posterior and prior would be almost impossible, especially in complicated situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.418,
    "end": 510.527,
    "text": "And by complicated, I mean everything that's not a trivial, simple situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.587,
    "end": 517.455,
    "text": "So that would basically are all real-time situations that we encounter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 517.435,
    "end": 521.84,
    "text": " And obviously we're interested in modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 521.86,
    "end": 536.596,
    "text": "So this approximate Bayesian inference technique is a very useful way to overcome this shortcoming of exact Bayesian inference in terms of its intractability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.276,
    "end": 546.987,
    "text": "And it makes the computation or the optimization of the variation of free energy much more computable and tractable as compared to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.287,
    "end": 569.7,
    "text": " um exact bayesian inference uh which would obviously have uh many practical um i mean it can have uh many practical benefits uh and not just something uh that's described in theory and doesn't have any practical applications and modeling and so on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.187,
    "end": 599.468,
    "text": " So yeah, that's basically the idea behind using the variational technique and using a certain parameter as the upper bound, or in other words, the negative of a lower bound that needs to be optimized, whether maximized or minimized, instead of just trying to compute the exact value of interest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.988,
    "end": 614.99,
    "text": " So variation-free energy, on the other hand, includes all the established frameworks for doing Bayesian inferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 615.511,
    "end": 625.185,
    "text": "So for example, the techniques developed by James Kahneman and others that I think it was...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.228,
    "end": 645.191,
    "text": " which table was, which figure, in one of the figures in the book, I suppose it was in chapter two, I guess, there's a nice comparison between the different terms of variation of free energy and all the other theories of Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 645.231,
    "end": 646.012,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 647.313,
    "end": 655.543,
    "text": "So we can see that it's more generalized theory of optimizing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.962,
    "end": 670.359,
    "text": " the Bayesian inference than risk sensitive KL control and other techniques of Bayesian inference that have been developed throughout, I mean, the past several decades.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 671.04,
    "end": 682.493,
    "text": "And so each of those terms can be accounted for by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 682.878,
    "end": 700.429,
    "text": " Roozbeh Gharakhloo, Including or, let me put it this way by vomiting some of the terms and we can basically get the exact same formulation or the exact same previous formulations we had before, but, as we see this is the much more general way of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.79,
    "end": 705.358,
    "text": "Roozbeh Gharakhloo, calculating the approximate bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 712.308,
    "end": 712.629,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.51,
    "end": 718.418,
    "text": "Anuj, do you want to answer a question or do you want me to read it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.438,
    "end": 734.265,
    "text": "Yeah, I just had this curious, like, is there a case, like, when we already know that, like, I cannot do exact inference, but are there cases when I should also avoid optimizing this variation-free energy, given that in any case I cannot do exact inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.92,
    "end": 740.422,
    "text": " I'll give a first thought on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.982,
    "end": 741.843,
    "text": "You always could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.983,
    "end": 751.815,
    "text": "You could choose your models however you want, but you will be doing strictly worse with respect to the accuracy complexity trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.835,
    "end": 766.311,
    "text": "But you can invent an arbitrary statistical method, but you will not outperform the information geometric maximum possible performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.865,
    "end": 794.34,
    "text": " okay okay yeah thank you in any given free energy that you do compute the the model may just be rolling to the bottom of the hill and you might just be way off base for a real system so this isn't the model adequacy problem this is the model optimization problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.573,
    "end": 799.701,
    "text": " So it's analogous to the L2 norm in the linear regression framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.282,
    "end": 809.996,
    "text": "Like every scatter plot, you always converge to the one L2 norm regression, R squared, p-value, all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.08,
    "end": 822.235,
    "text": "So this plays somewhat of an analogous role by enabling these different generative models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.299,
    "end": 826.166,
    "text": " to be optimized in a real-time sequential way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.652,
    "end": 840.012,
    "text": "And it turns out that it's the same optimization strategy that variational autoencoders use and just variational methods in physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.033,
    "end": 845.742,
    "text": "So it's not like variational methods comes from FEP or ACT-INF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.194,
    "end": 865.596,
    "text": " It's just using Bayes optimal model fitting, just like L2 regression, let's just say is optimal linear regression fitting, optimal Bayes fitting with the variational free energy, which is a functional because it's a function of a function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.557,
    "end": 873.585,
    "text": "It's a function of Q, the function that you're optimizing over and Y, the data that are coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.358,
    "end": 889.719,
    "text": " So generative model of vision and sensory incoming data, which is what is like the thing that is getting the best trade-off of accuracy and variance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.356,
    "end": 902.676,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.696,
    "end": 904.078,
    "text": "Okay, and then...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.105,
    "end": 923.282,
    "text": " Ali or oh and yeah go for it uh sorry yeah and one um i think crucial point here is uh the reason for using the callback library divergence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.566,
    "end": 926.729,
    "text": " for comparing the two distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 927.17,
    "end": 951.615,
    "text": "So I suppose the justification for using KL divergence is not explicitly stated in the textbook, but it derives from the Neyman-Pearson lemma, which basically says something to the effect that the most efficient",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 951.95,
    "end": 960.742,
    "text": " Roozbeh Gharakhloo, way to compare two distributions would be to compare the logarithm of their I mean to compute the logarithm of their likelihood ratios.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 961.403,
    "end": 976.303,
    "text": "Roozbeh Gharakhloo, So that's basically what's meant by callback Leibler so it's not just an arbitrary technique for comparing to district distributions it's actually a proven theorem or lemma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 976.587,
    "end": 1006.105,
    "text": " uh that uh that this is actually actually the most uh efficient way to compare to distribution so uh yeah I wanted to point that out as well yeah thanks and just adding one piece I'll put this in the notes there this is uh with nor Sajid and others and Carl and they use the rainy divergence so in principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.401,
    "end": 1030.337,
    "text": " you could use different divergence or distance measures but the kind of um I mean it's a it's definitely an interesting question about where one might have different properties but KL is kind of like the go-to in at least this sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.607,
    "end": 1067.108,
    "text": " yeah alexi and then anyone else this may seem like a silly question and i think ali gave a fantastic mathematical uh road but is there a metaphor for variational free energy versus free energy as free energy is explained in the book well but variational cell this one is intractable this one is tractable this is an estimation but uh i don't know in terms of you know uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1067.678,
    "end": 1073.485,
    "text": " Is there an example or a metaphor that you bring home of the variational free energy specifically?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1073.505,
    "end": 1074.326,
    "text": "Does anybody have one?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1078.491,
    "end": 1080.234,
    "text": "Yeah, I'll think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.454,
    "end": 1081.495,
    "text": "I'm happy to say one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.976,
    "end": 1085.32,
    "text": "But does anyone else want to give a thought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.5,
    "end": 1090.426,
    "text": "Like, what is free energy and variational free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.247,
    "end": 1092.308,
    "text": "How can we think about these?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.673,
    "end": 1095.993,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.173,
    "end": 1097.635,
    "text": "And then anyone else who wants to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.18,
    "end": 1118.644,
    "text": " Yeah, I'm not sure about a particular metaphor, but you see, I mean, the optimization approach, as opposed to calculating the exact value of something, basically comes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1119.316,
    "end": 1146.37,
    "text": " or can be likened to the situation we have when in a very simple situations, we have a function that can get an exact value of something as compared to the asymptotes of getting increasingly close to the value but never reaching the value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.704,
    "end": 1165.743,
    "text": " By optimization, we allow for even the exact, even for the situations for which we don't have any information with which we would be able to calculate the exact value of something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.183,
    "end": 1174.872,
    "text": "But instead, we can get closer and closer to the exact value with the information we have, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1175.037,
    "end": 1197.653,
    "text": " nonetheless we can reach a very good approximation and obviously we can define what do we mean by the good approximation based on the error we want to reach but yeah in most situations we don't have enough information to calculate the exact value of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1197.633,
    "end": 1199.815,
    "text": " the parameter we want to calculate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.215,
    "end": 1205.6,
    "text": "So it's more than the question of intractability versus tractability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.981,
    "end": 1214.748,
    "text": "In some cases, it is impossible to compute the exact value based on the information we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1215.189,
    "end": 1227.64,
    "text": "So I believe in these cases, the optimization technique or variational technique is the only way we can get close enough to the real value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1227.62,
    "end": 1229.952,
    "text": " or to the exact value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1242.655,
    "end": 1259.685,
    "text": " that's a great point um that like even if the the variational model is just woefully not structurally mapping onto the real external uh generating function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.138,
    "end": 1263.223,
    "text": " like the generative model is a unimodal distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.263,
    "end": 1267.79,
    "text": "And then out there in the world, there's like five bins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.852,
    "end": 1276.184,
    "text": "And so then there would be different patterns of model fit, like it might just fit the one that has the most or the one that not the most or blur the whole thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.244,
    "end": 1285.318,
    "text": "But according to its generative model, it would never get worse in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.885,
    "end": 1290.47,
    "text": " all of the considerations in equation 2.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.731,
    "end": 1301.266,
    "text": "It will never get worse on the complexity minus accuracy frontier, or it will learn that trade-off manifold optimally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1303.109,
    "end": 1314.445,
    "text": "So those are some fairly good statistical aspects just of any Bayesian model that's fit this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.213,
    "end": 1324.606,
    "text": " So that doesn't guarantee like adequacy in the real world, because again, you could just have an inadequate generative model then cease to get to the charging station or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.666,
    "end": 1331.416,
    "text": "So it's not a success or a function guarantee, but it's a model fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.538,
    "end": 1342.373,
    "text": "Or it doesn't mean that you'll have adequately balanced, you know, or had a memory window that's optimal or all these other things, unless you've really taken them all into account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.428,
    "end": 1348.233,
    "text": " And, and then just to Alexi's question or Bronwyn, do you want to add anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.586,
    "end": 1363.074,
    "text": "Equation 2.6 is the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.334,
    "end": 1367.82,
    "text": "Ali, maybe do you want to summarize how is equation 2.5 different than 2.6?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.876,
    "end": 1385.337,
    "text": " Yeah, so basically they're very, very similar structurally, but obviously we need to take into account the pie or the policy that needs to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1385.317,
    "end": 1401.714,
    "text": " I mean, in variation-free energy, we only deal with the situation in which the perceptual data is, we only deal with perceptual data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1401.814,
    "end": 1411.684,
    "text": "So we don't need to act upon the environment in order to fit the data better to our generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1412.205,
    "end": 1414.547,
    "text": "But in expected free energy,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1415.152,
    "end": 1436.13,
    "text": " uh we delve into the action domain of the uh i mean action perception loop so obviously in this case we need to take into account uh the effect of the policies on our both priors and posteriors so uh the point of commencement uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.549,
    "end": 1453.495,
    "text": " for derivation of equation 2.6 from equation 2.5 is exactly how applying the policies to those prior and posterior terms can affect the whole equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1453.735,
    "end": 1462.168,
    "text": "And that's where we get equation 2.6 and its variance in other lines of the equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1465.507,
    "end": 1485.76,
    "text": " awesome one point about equation 2.6 is uh first off it's g not f and it is uh like the argument that it takes is pi which is the vector the list of all of the policy trajectory possibilities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.786,
    "end": 1503.306,
    "text": " So variational free energy, which was described really comprehensively earlier, is basically that trade-off frontier between accuracy and variance estimator according to a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.866,
    "end": 1510.414,
    "text": "That's the Q and the Y. On the variational free energy, this is like a sense-making or perceptual model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.394,
    "end": 1533.195,
    "text": " real time and the self-evidencing component of variational free energy is like if you're repeatedly measuring your body to be at homeostasis and you expect and prefer that then like things are working out and that's sort of the closure of the adaptive organism is like by fitting the variational free energy about homeostasis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.8,
    "end": 1560.465,
    "text": " then it stays within homeostatic bound but expected free energy uses this pi or policy variable and so whereas variational free energy is more like signals processing expected free energy is more like control theory because it's an explicit evaluation of different possible futures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.753,
    "end": 1570.082,
    "text": " Does anyone have any other thoughts or ways of thinking about variational and expected free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.968,
    "end": 1582.018,
    "text": "I did have a, this is more in the form of a question, sorry, but I thought it might be useful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1582.078,
    "end": 1593.473,
    "text": "So we have here in chapter 2, page 34, when evaluating the free energy of outcomes, the outcomes are the consequences",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1593.959,
    "end": 1605.517,
    "text": " However, when evaluating the expected free energy, the outcomes play the role of causes and sense their variables that are in the future, but explain decisions in the present.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1606.258,
    "end": 1615.532,
    "text": "As you said, everything you said thus far has kind of gotten to that, kind of explaining what that quote means.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1617.655,
    "end": 1620.76,
    "text": "Can you maybe paste the quote here just so we can see it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.933,
    "end": 1623.394,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.355,
    "end": 1629.56,
    "text": "Meanwhile, let's look at this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.721,
    "end": 1631.302,
    "text": "Can anyone throw some light on these terms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.883,
    "end": 1632.744,
    "text": "Both are posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.824,
    "end": 1639.712,
    "text": "So indeed, sometimes the initial prior d is called the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.453,
    "end": 1647.0,
    "text": "But technically, every variable that gets an observation coming to it in a Bayesian framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.98,
    "end": 1675.148,
    "text": " is a prior an observation and a posterior update on something it's not like a free floating prior so every distribution that's bayesian that's why it's like prior on state space or prior on policy which is like habit that gets sharpened by expected free energy so then the output of this um operation is like habit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.735,
    "end": 1676.517,
    "text": " Matthew Evertson, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1676.497,
    "end": 1686.963,
    "text": ": policy prior sharpened by G into policy posterior, and then that policy posterior can be sampled from or just selected with the best option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.168,
    "end": 1690.391,
    "text": "Matthew Evertson, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.371,
    "end": 1691.955,
    "text": ": Then about the specific",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.34,
    "end": 1709.539,
    "text": " Matthew Shollin- Interesting as you paste it in all um we'll look at it, but just now to these two terms mentioned so Q X given pie and Q X given wine pie, so this is a question about the kale diversions um so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.354,
    "end": 1722.891,
    "text": " the computation of the expected free energy for a given policy, everything is conditioned on that policy happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.392,
    "end": 1727.899,
    "text": "And so between these two things, two sides of the double line,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.065,
    "end": 1733.699,
    "text": " they're both conditional policy and they're both have an aboutness of the hidden state through time, X tilde.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.22,
    "end": 1739.413,
    "text": "So the only difference is that there's this Y tilde observations through time on the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.095,
    "end": 1745.027,
    "text": "So if the observations that you expect under that course of action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.593,
    "end": 1773.276,
    "text": " aren't going to update your hidden state beliefs then the divergence between these two cues is zero the information is meaningless there's no information gain you're not learning anything you're not updating your hidden state model based upon the observation whereas if it was a epistemically informative course of action and you expected to reduce your uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.256,
    "end": 1795.045,
    "text": " um on this course of action then y tilde um would lead to an update on x tilde so there would be a divergence here so that policy would have epistemic value whereas the pragmatic value is about the alignment of preferences with the observations that you expect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.93,
    "end": 1805.232,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1806.72,
    "end": 1811.245,
    "text": "Does anyone have a thought on or on this quote from Andrew?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1838.225,
    "end": 1854.071,
    "text": " I'll just give one reading, not sure if this is the full or only way, which is like when we're talking about the sensory data themselves, which are sometimes just called outcomes, sensory outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.892,
    "end": 1862.865,
    "text": "So like when we're talking about the why that we're, the outcomes that we're actually observing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.385,
    "end": 1868.189,
    "text": " Those are the consequences of hidden states that are like emitting those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.03,
    "end": 1878.339,
    "text": "So we're doing equation 2.5, where the consequences of the causal model are what we're trying to fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.54,
    "end": 1887.427,
    "text": "In contrast, in 2.6, those observations in y tilde have not happened yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.488,
    "end": 1892.312,
    "text": "So they're projected observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1892.883,
    "end": 1895.467,
    "text": " So they are unobserved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.369,
    "end": 1898.512,
    "text": "It's the opposite of time travel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.553,
    "end": 1909.851,
    "text": "Say you and I haven't observed the temperature in two hours, but I can have a tight or a wide prior on that variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.573,
    "end": 1919.127,
    "text": "But it's a type of hidden cause analysis to say, well, if this happens under this condition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.41,
    "end": 1922.635,
    "text": " and then basically kind of backpropagate that into the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.098,
    "end": 1927.544,
    "text": "So it's a causal impact of an informational state that's expected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.584,
    "end": 1930.869,
    "text": "And that's not like a paradox or anything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.372,
    "end": 1936.879,
    "text": "So there are the outcomes of a causal process, but then in the EFE,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.943,
    "end": 1949.518,
    "text": " they also have a causal Force because differences in them lead to differences different differences in expected observations lead to different action selection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.028,
    "end": 1965.59,
    "text": " Anyone else want to ask a question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.87,
    "end": 1970.435,
    "text": "Or it looks like there's at least one that's from the cohort.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1980.165,
    "end": 1982.808,
    "text": "Alexi, yeah?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1983.069,
    "end": 1990.937,
    "text": "So I was really happy to read this paragraph where they talk about generative process and generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1991.698,
    "end": 1993.68,
    "text": "And they're saying that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1994.015,
    "end": 1995.677,
    "text": " They could be in different state spaces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1995.837,
    "end": 1997.599,
    "text": "One could be five dimensional.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1997.659,
    "end": 2000.221,
    "text": "One could be two dimensional, continuous, and categorical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2000.822,
    "end": 2002.644,
    "text": "I think that's a very profound statement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2003.144,
    "end": 2013.454,
    "text": "And for example, if I talk about temperature outside, and I use words, and I say things like hot and cold, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2013.474,
    "end": 2018.92,
    "text": "So I place a continuous outside variable in my two categories.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2019.641,
    "end": 2023.144,
    "text": "So I could model this way, but it's a bit of a distortion, if you wish.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2024.052,
    "end": 2025.474,
    "text": " I don't know if you have any comments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2025.514,
    "end": 2039.291,
    "text": "I'm just thinking out loud about this, that this is, I think, it's just mind blowing that, you know, we're modeling something, but we will be in a completely different state space and different variables, different variable structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2041.574,
    "end": 2043.657,
    "text": "Yeah, that's a great insight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.738,
    "end": 2052.608,
    "text": "One thing I'd add to that is like, if you measure the height of the people in the classroom,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.499,
    "end": 2058.686,
    "text": " you can optimize a binary classifier, tall or short.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.507,
    "end": 2068.678,
    "text": "And then you can do optimal model fit to make the line between tall and short optimize some trade-off, like recall or something like that, accuracy minus complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.079,
    "end": 2071.402,
    "text": "You could do a three-category model, four-category model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2071.422,
    "end": 2075.106,
    "text": "You can do a continuous model, all these statistical distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.948,
    "end": 2078.891,
    "text": "And they're all going to not complain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.392,
    "end": 2081.835,
    "text": "They're all going to get optimized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.322,
    "end": 2096.405,
    "text": " So that's kind of the blindness, but the power of essentially just Bayesian statistics is that once it's all lined up, it just is going to get optimized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.846,
    "end": 2098.749,
    "text": "Now, it may be hard to optimize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.789,
    "end": 2099.47,
    "text": "It may be easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.53,
    "end": 2103.236,
    "text": "Again, it may be adequate or not, but it's kind of like within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.537,
    "end": 2106.602,
    "text": "So just that, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.285,
    "end": 2108.565,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.895,
    "end": 2124.388,
    "text": " It just, this is what the strengths and the weaknesses of empirical modeling, which is that modeling doesn't have to reflect the structure of the modeled system at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.35,
    "end": 2130.714,
    "text": "And it doesn't for scientists and it doesn't for the models that are made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.256,
    "end": 2134.137,
    "text": "But some of them are adaptive still.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.498,
    "end": 2135.759,
    "text": "So those are the lifelike ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.66,
    "end": 2139.042,
    "text": "But pedagogically, they don't have to be lifelike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.397,
    "end": 2145.781,
    "text": " That's a very great example, Nithya, that helps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2145.962,
    "end": 2148.044,
    "text": "And one more question, if I may, and then I'll be silent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2148.685,
    "end": 2151.649,
    "text": "At the end of the chapter, they use the word intention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2151.729,
    "end": 2164.186,
    "text": "And I posted in the chat the exact quote where they say, in psychological terms, this implies that creature's belief about policies directly corresponds to its intention, which it fulfills by acting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2164.767,
    "end": 2171.796,
    "text": "I'm just a little puzzled by the use of the word intention, which typically means motive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2172.721,
    "end": 2174.283,
    "text": " of an agent, you know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2174.303,
    "end": 2176.385,
    "text": "I don't know how it's meant here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2176.685,
    "end": 2180.93,
    "text": "This is where I got really lost in what exactly do they mean by intention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2182.872,
    "end": 2184.714,
    "text": "Seems an unconventional use of the term.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2187.718,
    "end": 2189.079,
    "text": "Anyone want to give a thought on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.531,
    "end": 2199.831,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.752,
    "end": 2201.513,
    "text": "I, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.906,
    "end": 2204.828,
    "text": " Oh yeah, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.413,
    "end": 2224.8,
    "text": "Yeah, this is just a speculation, but maybe the meaning of the word intention here, and particularly in this paragraph, is related to the way it's used in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2225.911,
    "end": 2229.838,
    "text": " some of the literature on action philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2230.64,
    "end": 2249.995,
    "text": "So for instance, Alicia Huarero has developed a theory of intention as kind of the process that results from the causation of constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2249.975,
    "end": 2261.693,
    "text": " So by intention, she means basically the process that puts the system of interest in its causal constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.314,
    "end": 2266.06,
    "text": "So it's not necessarily",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2267.322,
    "end": 2292.3,
    "text": " maps onto or at least precisely maps onto the psychological sense of the term so but that's just as i said only a speculative thinking i may be wrong okay another um angle is from the paper um active inference models do not contradict folk psychology",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2293.259,
    "end": 2314.086,
    "text": " it was live stream 46. does anyone who participated in that or was there want to just like summarize what they thought this paper's argument was about that issue so basically they use the belief desire intention framework BDI",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.505,
    "end": 2341.727,
    "text": " um which i i had not heard of but it's a commonly used framework um and it actually came up in the um first lecture by avell in the um active inference for the social sciences ben white mentioned folk psychology and avell kind of like followed up was like what do you mean by like by this basically um but the belief desire intention model is just widely used to um explain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.26,
    "end": 2345.522,
    "text": " everyday behavior and intentionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.562,
    "end": 2352.77,
    "text": "It's like what people kind of slip to, you know, this enzyme wants to bind to this or, you know, prefers to bind to this in a way, just kind of broadly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.53,
    "end": 2363.761,
    "text": "And they identified those constructs, belief, desire, and intention with different constructs in the active inference generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.683,
    "end": 2370.047,
    "text": "So they just basically said, like, you're not wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.748,
    "end": 2372.71,
    "text": "It's just a description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.107,
    "end": 2379.813,
    "text": " But the beliefs are the hidden state beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.394,
    "end": 2396.993,
    "text": "And they kind of unpack this in the context of also distinguishing between the discrete time active inference, Chapter 7, and the continuous time active inference, Chapter 8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.108,
    "end": 2417.496,
    "text": " And so they kind of do simulations that pull out the belief, desire, and intention pieces in the context of someone who's going to the fridge and getting ice cream, which Dean had a field day with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.399,
    "end": 2450.824,
    "text": " um yeah but but another more deflationary way not necessarily like an experienced intentionality like the set point of a thermostat or the set point of a motor limb you can call it what you and it's just as long as you understand the map territory then such such an intentionality is is not massively metaphysical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.102,
    "end": 2468.831,
    "text": " I found the use of the word intention there just like from within the confines of the models is described as far as.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2468.851,
    "end": 2479.602,
    "text": "To just be referring to like we're, including a C vector that is preferences like those are included along the way, like there's a yes, something like desire or.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2480.463,
    "end": 2489.012,
    "text": "You know direct the agent is heading, as opposed to just total free form, you know going for anything right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2492.57,
    "end": 2510.031,
    "text": " Yeah, good point about how these intentions or preferences or expectations for observed outcomes, that those form kind of like explicit intentions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.051,
    "end": 2514.156,
    "text": "Like if you have, in terms of the directionality and the amplitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2515.469,
    "end": 2541.223,
    "text": " and uh yeah there's a lot to say on on that this is what goal oriented or um adaptive behavior would look like not saying that every single um implementation of such a system is like you know or taking on any of that like we don't really talk about reward um or goal in the active ontology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.553,
    "end": 2548.641,
    "text": " So that's why some people have very broad views on like intentionality and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.342,
    "end": 2561.197,
    "text": "But the deflationary and instrumental answer is always, it's a variational Bayesian model with action, signal processing plus control theory, Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.881,
    "end": 2570.89,
    "text": "That's not even including free energy principle or Bayesian mechanics or going into any of that part at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.376,
    "end": 2574.7,
    "text": " So it's purely defensible even without FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.9,
    "end": 2575.681,
    "text": "Just thought I would say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.859,
    "end": 2594.143,
    "text": "Did whoever added this question want to explain it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.944,
    "end": 2610.929,
    "text": " Or anyone else who's here want to ask something just while they're here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.969,
    "end": 2620.487,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.507,
    "end": 2624.935,
    "text": "So about equation 2.6 and epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.297,
    "end": 2628.501,
    "text": "So value of new information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.679,
    "end": 2636.212,
    "text": " Instead of minimizing the divergence, we want to select policies that maximize the expected diversions, hence information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.914,
    "end": 2646.152,
    "text": "Okay, so only with respect to the epistemic value, more informative observations is more epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.959,
    "end": 2654.609,
    "text": " That doesn't mean that those highly informative policies are going to have a pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2655.31,
    "end": 2662.22,
    "text": "Like discovering what's at the bottom of the ocean may disrupt pragmatic value about your body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.422,
    "end": 2665.204,
    "text": "But it is an epistemic policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.635,
    "end": 2679.548,
    "text": " How can we reconcile the above statement with page six all facets of behavior and cognition living organisms follow unique imperative minimizing the surprise and the approximate variational free energy of their sensory observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.572,
    "end": 2684.533,
    "text": "Anyone have a thought on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.224,
    "end": 2695.444,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.977,
    "end": 2706.357,
    "text": " models of perception and action that do surprise minimization have the best possible generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.678,
    "end": 2711.067,
    "text": "Minimization of surprise is equivalent to maximization of model evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.087,
    "end": 2713.753,
    "text": "If you knew exactly what to expect, how much to expect it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.155,
    "end": 2716.599,
    "text": " That's the same thing as saying that you have the best fitting model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.74,
    "end": 2720.005,
    "text": "So maximization of model evidence is surprise minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.027,
    "end": 2723.512,
    "text": "That can't be exactly solved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.532,
    "end": 2726.397,
    "text": "That's the exact Bayes issue that we discussed earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.358,
    "end": 2736.214,
    "text": "The most modern way to solve it is variational accelerated optimization on the Bayesian evidence lower bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.342,
    "end": 2740.347,
    "text": " Now, you could do that about any variable in principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.228,
    "end": 2751.225,
    "text": "But what this imperative does is it connects it back to sensory observations, which can be interpreted as, for example, homeostatic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.167,
    "end": 2763.265,
    "text": "So minimizing surprise on homeostatic variables, minimizing surprise via FE of any variable is doing the optimal Bayesian inference on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.953,
    "end": 2779.227,
    "text": " You could do strictly worse on accuracy or variance estimation, but if you want to use the Bayes optimal, Bayes information criterion optimal model, this is just how it's done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.968,
    "end": 2789.977,
    "text": "But this connects it to the homeostatic potentially adaptive imperative, but it doesn't have to be seen as like super adaptive and strategic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.678,
    "end": 2793.741,
    "text": "It can be seen also for like an inert object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.358,
    "end": 2799.124,
    "text": " That's the variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.705,
    "end": 2806.055,
    "text": "So that's the kind of unified imperative of real-time self-evidencing behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.756,
    "end": 2811.263,
    "text": "But as was mentioned, it does not address action selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.205,
    "end": 2821.399,
    "text": "It's a functional of beliefs Q and the data Y. So we need the expected free energy, which is explicitly prospective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.138,
    "end": 2831.851,
    "text": " Now, within the expected free energy, there's the two terms that different policies are evaluated based on, epistemic value and the pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.612,
    "end": 2840.162,
    "text": "That's just one of the decompositions that we'll all look forward to the breakdowns on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.103,
    "end": 2851.757,
    "text": "But yes, it is the case that for a given evaluation of a policy, the more divergent the sensory information are,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.872,
    "end": 2854.315,
    "text": " the higher the epistemic value would be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.677,
    "end": 2860.544,
    "text": "But that doesn't mean that it would be associated with a pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.806,
    "end": 2872.581,
    "text": "So an adaptive agent would, you'd hope, avoid extremes of both extreme information seeking that risk pragmatic value or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.582,
    "end": 2881.373,
    "text": "So that's the model fitting, questioned, balancing all the parameters so that the strategy is actually adaptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.568,
    "end": 2912.541,
    "text": " um okay alexi and then we'll continue with this question i wanted to add to what you just said uh daniel which is a very nice way to summarize it that um seeking epistemic value seeking knowledge is for humans pleasurable you know this is an effective neuroscience called the seeking drive literally the dopaminergic exploratory system we enjoy that this is the enthusiasm curiosity that drives scientists and artists and other things and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2912.842,
    "end": 2918.909,
    "text": " When all our biological needs are met, when we're not hungry anymore, when we're safe, we default back to that system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2918.929,
    "end": 2934.046,
    "text": "We start exploring the environment around us to see what's out there, to gain epistemic knowledge, to maximize evidence, to decrease the surprise, the negative surprise in the future so that we're not killed and we're not dying from hunger.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2934.427,
    "end": 2942.376,
    "text": "Once we explore the environment and find out where's the orchard and where are the predators, that helps us in the future to avoid unpleasant surprises.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2946.406,
    "end": 2946.807,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.356,
    "end": 2957.02,
    "text": "So the divergence for the variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.869,
    "end": 2964.85,
    "text": "Let's look at two point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.05,
    "end": 2968.274,
    "text": "Well, we've seen them previously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.457,
    "end": 2974.843,
    "text": "Maximizing divergence to maximize information gain appears logical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.279,
    "end": 2986.212,
    "text": " However, maximizing information gain would maximize ambiguity and risk, which is the uncertainty about consequences of action in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.954,
    "end": 3000.308,
    "text": "Or this could be describing risk in these two lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.84,
    "end": 3006.425,
    "text": " which are two very similar representations of equation 2.6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.067,
    "end": 3012.471,
    "text": "Like the left term is the same, and here is observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.633,
    "end": 3025.145,
    "text": "So this is the risk of like sort of conditional policy about how much uncertainty there is about observation sequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.986,
    "end": 3028.168,
    "text": "And here is about hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.279,
    "end": 3039.549,
    "text": " And I believe that this number is always less than this number because you're always more certain of proposing something hidden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.55,
    "end": 3042.772,
    "text": "You're always more uncertain about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.393,
    "end": 3048.317,
    "text": "I believe there may be a different reason, but it's like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.357,
    "end": 3053.001,
    "text": "You're always more uncertain about proposed latent causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.061,
    "end": 3056.805,
    "text": "Above and beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.338,
    "end": 3084.328,
    "text": " surprise uh bounding of observables maybe there's another way to think about that too thank you lexi wouldn't beliefs assign low probability to policies that will maximize discrepancy expected free energy ambiguity and risk well kind of yes and no um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.519,
    "end": 3111.447,
    "text": " what would be the the most epistemically salient would be something where you were sure about the outcomes and they were going to contribute to information gain like I have a trusty book and I know that so I have 100 certainty about how opening the book to this page about kind of like the epistemic quality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.372,
    "end": 3119.419,
    "text": " So it's a salient in the mapping between the underlying semantics and the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.722,
    "end": 3131.331,
    "text": "So this representation just, maybe there's another way to see it too, or I mean, I'm sure there are, but just like, this isn't like risk, like danger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.351,
    "end": 3141.822,
    "text": "This is, as far as I understand, looking at,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.084,
    "end": 3151.779,
    "text": " how your action maps cleanly and preferably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.687,
    "end": 3161.355,
    "text": "And here's the more sensory mapping, not to get too deep in that one point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.377,
    "end": 3167.185,
    "text": "But yeah, anyone else have any questions or thoughts on chapter two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.074,
    "end": 3183.798,
    "text": " Ali, that was awesome work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.858,
    "end": 3185.34,
    "text": "How are you going to continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.823,
    "end": 3209.305,
    "text": "Well, we'll continue to unpack all the other, at least essential equations, if not all the single equations in the textbook, but we're focusing on developing similar derivations for all the central equations in the textbook and particularly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3209.622,
    "end": 3220.076,
    "text": " from chapters two, three, and four, which I believe constitute the most fundamental chapters of the textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3220.096,
    "end": 3234.736,
    "text": "So I hope we can prepare it in time so it can be hopefully useful for anyone who wants to understand them a bit better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3239.002,
    "end": 3239.342,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.988,
    "end": 3243.29,
    "text": " Anyone else have any thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.841,
    "end": 3257.267,
    "text": "Well, we will head next into Chapter 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.189,
    "end": 3269.261,
    "text": "So, why do we seem interested only in discrete state space, discrete actions policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.702,
    "end": 3271.624,
    "text": "Discrete time is fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.739,
    "end": 3297.24,
    "text": " yeah um well chapter eight you're gonna love but uh it is presented as as um there there's always a um discrete and continuous time are just two options or two two families of models that can be hybridized in chapter eight but yeah 100 the book focuses on both um and thomas parr's book stream",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.862,
    "end": 3306.534,
    "text": " is he describes the history and the differential focus between continuous and discrete time models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.816,
    "end": 3311.461,
    "text": "And it's a big topic that we talk about in chapter seven and eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.105,
    "end": 3316.689,
    "text": "Do you have any other comments on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.709,
    "end": 3325.101,
    "text": "And even before those chapters, we encounter preliminary formulation for continuous time active imprints in chapter four as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3325.672,
    "end": 3328.255,
    "text": " Yeah, and five with a spinal reflex arc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.275,
    "end": 3331.778,
    "text": "So they're just different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.08,
    "end": 3350.818,
    "text": "And I mean, the figure 4.3, the kind of Rosetta Stone figure is about the structural similarities between discrete time and continuous time models, but also understanding their differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.853,
    "end": 3357.618,
    "text": " So chapter three is going to be the high road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.639,
    "end": 3359.54,
    "text": "So figure 1.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.822,
    "end": 3362.584,
    "text": "Chapter two was the Bayes theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.664,
    "end": 3374.54,
    "text": "So that's why we were talking a lot about like the fundamentals of Bayesian statistics, because up until this point, this is the same thing as just saying variational Bayes with perception and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3375.881,
    "end": 3382.51,
    "text": "That is exactly, someone can implement the variational Bayes with perception and action differently, but kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3384.16,
    "end": 3395.672,
    "text": " Thinking cybernetically, that's what they would need to make any kind of active inference agent, whether it's using Fristonian active inference or not, but if it has to do perception and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.154,
    "end": 3411.99,
    "text": "Chapter three is going to take a very different approach that's not going to focus as much on the how as on the why of self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3412.055,
    "end": 3415.942,
    "text": " and the way that this is modeled with different Bayesian architectures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.984,
    "end": 3419.008,
    "text": "This kind of prepared us on how it's going to be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.669,
    "end": 3428.225,
    "text": "Chapter 3 is a focus on the why and the free energy principle, and then also it's going to arrive at active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.407,
    "end": 3435.919,
    "text": "Chapter 4 is more about the generative model, discrete time or continuous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3436.473,
    "end": 3442.756,
    "text": " Chapter five is neurobiology, kind of a sampling of different kinds of generative models, how they connect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.342,
    "end": 3446.972,
    "text": "That's kind of the next three chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.416,
    "end": 3451.679,
    "text": " All right, so enjoy everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.959,
    "end": 3452.379,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.399,
    "end": 3456.124,
    "text": "Thanks again, Ali, and everyone else who helps with the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.304,
    "end": 3460.028,
    "text": "Oh yeah, there will be math learning groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.949,
    "end": 3463.753,
    "text": "I believe they are Wednesdays at 13 UTC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.973,
    "end": 3464.934,
    "text": "They're on the calendar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3466.356,
    "end": 3477.769,
    "text": "So, you know, whether there's one person or more than one person, I hope people enjoy studying there and connecting and just improve the documentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3477.749,
    "end": 3481.016,
    "text": " do whatever people feel like doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3483.141,
    "end": 3489.536,
    "text": "But there's not a specific focus or facilitation around these sessions at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.157,
    "end": 3493.785,
    "text": "But if someone wants to, whether they're familiar with math or not, they're welcome to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.825,
    "end": 3498.115,
    "text": "But just good luck in the math learning group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.638,
    "end": 3499.879,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.102,
    "end": 3501.443,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.327,
    "end": 3503.487,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.507,
    "end": 3504.109,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.67,
    "end": 3505.191,
    "text": "See you.",
    "speaker": "SPEAKER_00"
  }
]