[
  {
    "start": 29.534,
    "end": 54.844,
    "text": " great hello and welcome everyone it is just adjusting things it is may 4th may the 4th of 22 be with you and we're here in actin flab live stream number 43.1 blue i don't know how you do it with always joining during the theme song welcome to the actin flab",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.991,
    "end": 76.612,
    "text": " a participatory online lab that is communicating learning and practicing applied active inference you can find us at links on this slide this is recorded in an archived live stream so please provide us with feedback so we can improve our work all backgrounds and perspectives are welcome and we'll be following video etiquette for live streams",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.462,
    "end": 88.865,
    "text": " check out ActiveInference.org if you wanna learn more about what's happening in the lab and get involved and participate in the live streams or any other activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.006,
    "end": 94.687,
    "text": "All right, well, we're here in live stream number 43.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.02,
    "end": 107.332,
    "text": " and are continuing the discussion of the paper predictive coding a theoretical and experimental review by baron millage neil seth and christopher buckley in 43.0 with maria",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.6,
    "end": 139.943,
    "text": " we went over some of the background and context and did like a first pass on various aspects of the paper but by no means exhausted it because it's a long and very intricate paper and also it touches on a ton of other areas of more general interest so there's a lot to discuss and in the 43.1 today we'll see where things go if you're watching live it would be awesome to have any questions in the live chat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.823,
    "end": 149.008,
    "text": " Otherwise, we will just start with some introductions and pick up with whatever people are finding salient and exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 149.889,
    "end": 153.331,
    "text": "So we'll just start by saying hello and going from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.351,
    "end": 158.594,
    "text": "I'm Daniel, and I'm a researcher in California, and thanks a lot, Blue, for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.9,
    "end": 162.36,
    "text": " I'm Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.38,
    "end": 165.223,
    "text": "I'm a researcher in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.543,
    "end": 168.325,
    "text": "And yeah, I'm excited to be here today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.345,
    "end": 191.123,
    "text": "This paper was really intricate and detailed and provided a lot of background that I don't have because, you know, there are so many active papers that I want to read, but I don't have time to get to them all because I like to read things very thoroughly and slowly and carefully and look up the things that I don't know and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.656,
    "end": 195.538,
    "text": " back references, travel down the scientific rabbit hole, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.698,
    "end": 213.426,
    "text": "So yeah, this was a good paper that kind of helped me, you know, shirk all those act-inf responsibilities that I have and came out with more like questions than answers, which is always a good sign of a good paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.276,
    "end": 215.576,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.596,
    "end": 220.238,
    "text": "Well, how about going into the paper, what questions did you have?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.278,
    "end": 228.501,
    "text": "And maybe we'll get to how our questions evolved, but what were you expecting to find in the paper and what questions were motivating you to seek it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.001,
    "end": 239.365,
    "text": "So I always have had a hard time, like, what is the difference between predictive coding, variational Bayes, and Act-Inf?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.912,
    "end": 240.152,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.312,
    "end": 246.156,
    "text": "And like, I was really hoping that the paper would kind of lay that out for me and like, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.897,
    "end": 260.005,
    "text": "So, like, I mean, I kind of got a good historical overview of how they all are interlocking and overlapping, which I didn't know before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.004,
    "end": 266.511,
    "text": " because, you know, all these things, none of them are simple and there are intricate details in all of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.711,
    "end": 277.405,
    "text": "Like, you know, that I don't know all the details ins and outs, but I think that this gave a very good, like historical overview of how these things kind of layer into a nice little sandwich.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.704,
    "end": 285.106,
    "text": " Great, definitely a good starting place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.406,
    "end": 305.218,
    "text": "Let's also add Bayesian Brain there to the mix and start to look at maybe some similarities too, because they're not exactly like addressing the same area and they're compatible, often more compatible than not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.318,
    "end": 310.021,
    "text": "So getting at what distinguishes them is very important and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.57,
    "end": 326.393,
    "text": " like one way that that happened and it came up in the dot zero was so much of the paper was dealing with inference on the relationship between observations and unobserved latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 326.953,
    "end": 332.134,
    "text": "So think like trying to infer the temperature of the room given the thermometer readings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.794,
    "end": 334.055,
    "text": "And that was so much of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.615,
    "end": 338.616,
    "text": "And then action comes into the picture in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 342.017,
    "end": 357.205,
    "text": " uh section four or five it's like predictive coding the author's right can also be extended to include action allowing for predictive coding agents to undertake adaptive actions without any major change to their fundamental algorithms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.336,
    "end": 359.977,
    "text": " but that's 50 equations deep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.397,
    "end": 365.641,
    "text": "And so it was very interesting to see if those 50 equations are kind of like the stem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.062,
    "end": 377.09,
    "text": "I know that the equations are not sequential and building on each other in all of these cases, but then action gets tucked into a bigger picture very seamlessly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.59,
    "end": 382.554,
    "text": "And I think that speaks to the relevance of distinguishing how they're similar",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 383.294,
    "end": 386.015,
    "text": " and difference and why it matters, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.635,
    "end": 388.556,
    "text": "So how should we even begin to look at that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.716,
    "end": 393.997,
    "text": "So even action actually came up earlier in the paper before 4.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.238,
    "end": 402.72,
    "text": "So action came up in section 2.3 with dynamical predictive coding and generalized coordinates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.14,
    "end": 406.802,
    "text": "And this I thought was a really good example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.162,
    "end": 408.122,
    "text": "Like I was craving",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.92,
    "end": 413.163,
    "text": " and still I'm craving like a really simple example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.223,
    "end": 431.635,
    "text": "Like, like it's one thing, you know, we talk about the equations, we go through all the letters, we compare this and that, but it would be really great to see a super simple example works through like from start to finish using all of these observable states, latent states, complexity, accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.735,
    "end": 435.057,
    "text": "Like it would be really great to see that at some point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.417,
    "end": 436.137,
    "text": " point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.037,
    "end": 454.321,
    "text": "And if you're listening to this live stream and want to come on and give like a guest tutorial on like how do we actually work these equations into some very simple problem that we can solve in real life, like I would be more than happy to facilitate that presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.341,
    "end": 457.422,
    "text": "Yeah, because I can't even like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.133,
    "end": 463.495,
    "text": " I can't jump from like all these equations into like, how does that apply?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.256,
    "end": 484.044,
    "text": "But even in 2.3, this was kind of a good, a good, a good-ish example, a real life example about like inferring, you know, the velocity and the acceleration and the jerk just given the observed coordinates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.784,
    "end": 488.026,
    "text": "So that was kind of, and it talks here about also free action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.717,
    "end": 491.339,
    "text": " which I've not heard before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.039,
    "end": 499.404,
    "text": "So instead of minimizing the variation of free energy, it says we must instead minimize the free action, which is F bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.665,
    "end": 501.786,
    "text": "And I've not,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.282,
    "end": 508.564,
    "text": " seen or heard it referred to in that way, but it's modeling like time series of observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.624,
    "end": 514.207,
    "text": "So like, you know, you know the coordinates at time one, time two, time three of a swinging pendulum, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.827,
    "end": 523.09,
    "text": "If you know those coordinates, then you can kind of guess, you know, how fast is the object moving and you can infer these other variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.39,
    "end": 526.471,
    "text": "So I haven't seen that free action, but it did even come up before four or five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.952,
    "end": 529.252,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.173,
    "end": 531.253,
    "text": "And it speaks to that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.28,
    "end": 539.445,
    "text": " expected free energy, EFE, which is what do you expect the free energy to be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.605,
    "end": 547.491,
    "text": "And then there's the free energy of the expected future, which one of the authors has worked on, which is kind of a slightly different variant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.571,
    "end": 553.996,
    "text": "And then here's another way to look at the free energy of some future time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.137,
    "end": 561.522,
    "text": "And it speaks to that difference between the variational free energy, which is like what you're able to calculate right now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.13,
    "end": 564.772,
    "text": " with the information at hand and looking backwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.572,
    "end": 572.977,
    "text": "And so the more perceptual aspects of inference can be calculated using the variational free energy approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.803,
    "end": 588.068,
    "text": " But then anytime the future is coming into play, there's uncertainty about the observations as well as even uncertainty about what actions one will take, let alone the consequences of the actions that one will take in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.508,
    "end": 590.989,
    "text": "So we do need a different way to calculate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.089,
    "end": 598.591,
    "text": "And then as you're kind of getting at, this is a different way than we've seen it before with the minimization of free action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.451,
    "end": 600.592,
    "text": "But let's return to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.872,
    "end": 614.044,
    "text": " this page and think about how we can distinguish with like a Venn diagram or something that helps us understand how these core ideas are linked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.167,
    "end": 623.013,
    "text": "One couple that we can highlight is predictive coding and predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.033,
    "end": 625.616,
    "text": "Do you have any thoughts or questions on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.176,
    "end": 638.481,
    "text": " Yeah, so maybe not a Venn diagram, but, like, maybe we should build perhaps, like, a pyramid or, like, a multi-level building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.961,
    "end": 650.445,
    "text": "Because I think, you know, based on what I read in the paper, I think really predictive coding kind of starts it all off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.585,
    "end": 650.985,
    "text": "And also...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.873,
    "end": 663.976,
    "text": " it makes sense to make a layer cake, like being that these all kind of start off with the layers of cortical processing that happen quite literally in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.456,
    "end": 668.417,
    "text": "So I think making a layer cake maybe makes the most sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.798,
    "end": 670.118,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.478,
    "end": 671.298,
    "text": "So we're in the kitchen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.938,
    "end": 674.579,
    "text": "We're in the Actif restaurant kitchen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.279,
    "end": 681.161,
    "text": "And what are we going to build in or what is the bottom of this layer cake?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.873,
    "end": 693.378,
    "text": " So I think the bottom at least, um, so, so there might be two layers on the bottom, um, one from Helmholtz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.119,
    "end": 708.426,
    "text": "So we can start with like the, the perception as unconscious inference view of Helmholtz, um, and then predictive coding, um, as described by Rao and Ballard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.626,
    "end": 714.108,
    "text": " in their description of the visual system and the visual cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.468,
    "end": 715.748,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.609,
    "end": 736.516,
    "text": "And again, kind of calling back to the dot zero, the two qualitative philosophical ideas that the authors invoke and that Maria helped us unpack were Helmholtz's notion of perception as unconscious inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.816,
    "end": 746.519,
    "text": " and Kant's notion that a priori or beforehand structure, like prior structure is needed to make sense of sensory data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.139,
    "end": 758.023,
    "text": "So we're gonna have one bottom layer of the cake with Helmholtz and then also with the Kantian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.163,
    "end": 763.625,
    "text": "So this is gonna be our qualitative philosophical layer of the cake, these two notions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.708,
    "end": 791.696,
    "text": " then you mentioned another critical work which was rowan ballard's 1999 work building on a broader history of applying predictive and anticipatory approaches to different neural systems and in the dot zero the two neural systems that we looked at were first the retina system with the shrinivasan 1982 and this is looking at retinal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.012,
    "end": 797.237,
    "text": " physiology and like the electrophysiology of photons hitting the retina.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.098,
    "end": 800.38,
    "text": "And then another area where predictive approaches",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 801.345,
    "end": 813.416,
    "text": " especially early on, were getting built out around and towards was the cortical hierarchy and the different layers in the mammalian cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 813.476,
    "end": 825.126,
    "text": "So we have these two anatomical exemplars of some microcircuitry, some histology that is compatible with a predictive approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.346,
    "end": 826.487,
    "text": "Okay, so we have these two,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 828.052,
    "end": 857.334,
    "text": " um basal layers but we might even add more basal layers but we have biological systems that are doing predictive things and that includes the retinal as well as the cortex also of course if anyone has like questions we'll get to it in the right way so please ask any questions or doing any comments so we have the retina the cortex",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.46,
    "end": 862.342,
    "text": " as examples, but there's others, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.822,
    "end": 883.494,
    "text": "And then if there's a third layer that we can add to the bottom, I think it would just be Bayesian statistics, because- So I think it comes maybe before that also, or maybe like, maybe now, maybe Bayesian statistics is like a layer two, but like, I think before the Bayesian statistics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.619,
    "end": 893.385,
    "text": " And even before biological systems doing prediction, there's the information theory component that I think is important also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.686,
    "end": 894.966,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.367,
    "end": 900.41,
    "text": "So, well, we have, this is qualitative and philosophical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.471,
    "end": 904.953,
    "text": "Then we have biological and actual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.874,
    "end": 909.897,
    "text": "And then we have a formal area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.277,
    "end": 913.119,
    "text": "And that'll be information and base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.139,
    "end": 913.319,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 917.695,
    "end": 925.461,
    "text": " Yeah, the information goes under the bays, I think, just like the Helmholtz comes under the Kant, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.301,
    "end": 945.014,
    "text": "I think it's really the relationship between information and probability, which we started to explore in, or we explored a lot in the FEP of Generic Quantum Systems livestream, number 40.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.354,
    "end": 946.435,
    "text": "That was 40, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.421,
    "end": 970.98,
    "text": " so many streams ago okay this is fun and i think we're we're gonna start building this into a tasty structure so we have the philosophical coming in on the left and that's one on-ramp that just like we had discussed earlier like this is something that has been almost",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.734,
    "end": 988.76,
    "text": " imminently available to thinkers for thousands of years these are the kinds of qualitative claims that anyone can experience whether by thinking about the blind spot or about how they're sense making in response to some stimuli this is just the idea that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.27,
    "end": 1016.207,
    "text": " the sensory observations are first off not the direct contact with the world like we're not seeing the lightning strike event we're seeing photons hit the retina and sound hit the eardrum and so we're receiving sensory input that's that kind of plato's cave angle and then kant and helmholtz elaborated on that to include this idea of unconscious inference that requires a priority structure or like what we would call like a bayesian prior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.093,
    "end": 1025.259,
    "text": " Then we have this biological area, and these are just reflecting natural systems that are exhibiting some kind of behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1025.539,
    "end": 1030.522,
    "text": "Like we can think about the 1999 paper of Rao and Ballard themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.256,
    "end": 1050.717,
    "text": " about the functional interpretation of extra classical receptive field effects and we talked about that in the dot zero like the classical effects are kind of the simple normative ones like the joke is it's classical because of the papers and the order they were published but that doesn't like make it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.738,
    "end": 1072.917,
    "text": " even true let alone the best model the classical is just like it's like classic rock you might like other genres but then there's the classics or whatever so that's the biological systems that are exhibiting certain kinds of outcomes and then we have these two formal or quantitative areas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.148,
    "end": 1081.213,
    "text": " And those are the Bayesian statistics and probability as well as information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.953,
    "end": 1088.881,
    "text": "And they're definitely linked as well, but we'll just leave them as kind of two conjoined layers here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.662,
    "end": 1089.922,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.603,
    "end": 1092.805,
    "text": "Now, where do we go from here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.89,
    "end": 1098.472,
    "text": "Well, isn't that the question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.784,
    "end": 1111.727,
    "text": " So maybe predictive coding and predictive processing and really what's the difference between these two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.747,
    "end": 1116.429,
    "text": "I think predictive coding came from neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.249,
    "end": 1123.551,
    "text": "So maybe that layers on top of the biological part, the biological piece of the cake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.871,
    "end": 1129.373,
    "text": "And then predictive processing might go on to the quantitative piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.566,
    "end": 1153.538,
    "text": " awesome yeah and it really is what maria highlighted and and drew out in the dot zero which was using a quote from an andy clark book and clark wrote that predictive processing is not simply the use of the data compression strategy known as predictive coding so at least in this take",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.653,
    "end": 1157.894,
    "text": " Predictive coding is like MP4.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.314,
    "end": 1163.957,
    "text": "It's like an encoding strategy, which is also why we connected it to frame differencing and video encoding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.477,
    "end": 1173.501,
    "text": "But predictive coding is gonna be something that's data oriented and it's related to information theory, compression, information encapsulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.121,
    "end": 1178.643,
    "text": "And then Clark is writing predictive processing is not simply that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1179.503,
    "end": 1203.697,
    "text": " and so marina spoke to how another way to think about the difference between predictive coding and predictive processing is to use coding for the formalisms and implementations and processing for the philosophical understanding that prediction is the basis of signal interpretation as opposed to merely recognition or descriptive models so if anyone has like a thought on that then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.517,
    "end": 1222.508,
    "text": " know put it in the live chat or come get involved but let's work with that delineation going forward so predictive processing is going to be um somehow related to the formal or sorry predictive coding is going to be more close to the formal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.373,
    "end": 1233.778,
    "text": " whether it's predictive coding in a biological context or whether it's gonna be in a philosophical context or something, it's gonna be more on the formal side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.798,
    "end": 1237.72,
    "text": "Whereas predictive processing is gonna be where?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.54,
    "end": 1240.141,
    "text": "A little bit closer to the philosophical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.011,
    "end": 1241.911,
    "text": " Yeah, I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.111,
    "end": 1260.354,
    "text": "And then maybe like, does the Bayesian brain like make up the third part of our, like if predictive coding layers over the Bayesian statistics and predictive processing layers over the philosophical, then does the Bayesian brain somehow make the in-between sandwich that goes over the biological?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.975,
    "end": 1265.335,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.476,
    "end": 1266.756,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.076,
    "end": 1267.696,
    "text": "So let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.336,
    "end": 1268.696,
    "text": "We have...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1270.011,
    "end": 1289.115,
    "text": " predictive processing as being a philosophical approach and consideration of these philosophical memes and themes in the biological case, which we're certainly bound to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.175,
    "end": 1295.876,
    "text": "Then we can have predictive coding as kind of the formal way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.125,
    "end": 1303.828,
    "text": " that these predictive anticipatory systems are implementing predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1305.108,
    "end": 1307.649,
    "text": "And then what is the Bayesian brain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.929,
    "end": 1314.712,
    "text": "Seems pretty fair to put it at like the intersection between Bayesian and brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.972,
    "end": 1316.713,
    "text": "But what is the Bayesian brain to you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.855,
    "end": 1325.036,
    "text": "So to me, the Bayesian brain is kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.886,
    "end": 1340.931,
    "text": " you know, I'm trying to look back through the paper to their description, but in my recollection of the Bayesian brain, which was probably my first introduction to Bayesian statistics, I was like, oh, this is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.791,
    "end": 1344.652,
    "text": "And it wasn't even the Bayesian brain, it was like the Jaynesian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.484,
    "end": 1356.011,
    "text": " interpretation of the Bayesian brain paper, but like that paper was like probably the, my like turn on to Bayesian statistics and, and implementing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.131,
    "end": 1368.52,
    "text": "And, um, so, so in my mind, the Bayesian brain is, is just this idea that, um, the brain uses Bayesian reasoning or, or Bayesian updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.099,
    "end": 1371.981,
    "text": " to process information and go forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.782,
    "end": 1375.484,
    "text": "But that's probably a very simplified interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.245,
    "end": 1387.052,
    "text": "I think there's going to be one more realist interpretation, like the brain is doing Bayesian stuff, and then there's the more instrumentalist interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.633,
    "end": 1392.476,
    "text": "We can use Bayesian statistics to model what it is that the brain is doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.636,
    "end": 1393.957,
    "text": "So is Bayesian...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.131,
    "end": 1399.855,
    "text": " the territory or the map of the brain, but we'll just leave it as an edge for now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.676,
    "end": 1408.562,
    "text": "So I'll read a question from Dean, and then I think we're gonna be exploring a lot where action and active inference comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.842,
    "end": 1414.507,
    "text": "So blue, Dean writes, what do you think of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.588,
    "end": 1418.43,
    "text": "As coding, you are doing something in coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1419.451,
    "end": 1422.874,
    "text": "As processing, you determine by comparing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.758,
    "end": 1427.52,
    "text": " processing and or not processing as you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.861,
    "end": 1431.802,
    "text": "So process entails processing types.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.286,
    "end": 1445.051,
    "text": "What I'm hearing there is encoding doesn't require two arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.851,
    "end": 1448.653,
    "text": "It just takes one, you take one file and you zip it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.813,
    "end": 1451.214,
    "text": "You've encoded that in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.875,
    "end": 1451.995,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.356,
    "end": 1461.681,
    "text": " predictive coding can encode or implement some type of informational algorithm without a reference or a comparator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.422,
    "end": 1475.85,
    "text": "Whereas Dean's saying, as processing, you determine, not with this single argument plug and chug, but you determine by comparing as you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.53,
    "end": 1480.233,
    "text": "And so predictive processing, it does have that sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.109,
    "end": 1494.345,
    "text": " top-down and bottom-up, as it's often visually represented, but processing is entailing that full stack, and therefore the processing is requiring something like a minimum of two to have consideration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.786,
    "end": 1495.627,
    "text": "If you're processing...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.406,
    "end": 1503.248,
    "text": " nuts, then you're sorting them into two different kinds or you're removing something from something else about those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.288,
    "end": 1510.17,
    "text": "Like you're doing something that has compositionality or some type of multiplicity to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.23,
    "end": 1514.471,
    "text": "It's not just something you can take that one file and just zip it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.932,
    "end": 1516.912,
    "text": "So that's a great point, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.392,
    "end": 1520.593,
    "text": "I think I'll add two little arrows here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.794,
    "end": 1523.454,
    "text": "Yes, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.994,
    "end": 1525.575,
    "text": "Yes, Blue, let me share the slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.223,
    "end": 1527.544,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.144,
    "end": 1529.085,
    "text": "I'm left in the dark here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.125,
    "end": 1537.05,
    "text": "I definitely agree with Dean's point about the coding versus processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.71,
    "end": 1540.312,
    "text": "I can write a whole lot of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.792,
    "end": 1543.353,
    "text": "I can take a whole lot of notes, and that's coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.473,
    "end": 1545.835,
    "text": "That's encoding the information from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.417,
    "end": 1548.359,
    "text": " our conversation, this live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.779,
    "end": 1562.872,
    "text": "But until I do something with those notes, like turn them into elements of a paper that I want to write or something like this, I have not processed what I have encoded until I take them forward to a forward step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.972,
    "end": 1568.397,
    "text": "So I think there is kind of this temporal implication with processing versus coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.509,
    "end": 1589.022,
    "text": " yeah also like the timeliness of processing like you want to process the food before it has become you know bad or something so okay we have predictive coding again these are just tentative slide play if anyone thinks differently they can join or write a comment but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.043,
    "end": 1595.105,
    "text": " predictive coding might entail something of a unidirectionality, just like a .zip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.245,
    "end": 1602.488,
    "text": "And you say, well, somebody will unzip it later, but we can encode it without that part of the loop being required.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.069,
    "end": 1611.372,
    "text": "And then we have this two directional relationship with predictive processing being like top down and bottom up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.193,
    "end": 1615.574,
    "text": "Okay, what do you see now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.814,
    "end": 1617.135,
    "text": "Or I can bring up something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1619.371,
    "end": 1619.592,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.252,
    "end": 1622.974,
    "text": "So I'm not really seeing anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.054,
    "end": 1627.598,
    "text": "So why don't you bring up what is on your mind or what you're thinking of?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.239,
    "end": 1629.56,
    "text": "Where is action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1630.741,
    "end": 1634.524,
    "text": "And then I think that'll start to walk us towards where active inference is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.115,
    "end": 1652.38,
    "text": " because of the temporal nature of processing, I think action might start in the processing, um, element, like even in something like mental action, like people do like thought correction or thought remediation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.4,
    "end": 1663.224,
    "text": "Um, so like if you're, uh, you know, you have this prediction and it like surfaces in your mind, but then like you correct the prediction or, or like you, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.837,
    "end": 1667.898,
    "text": " you know, you think you see a snake on the floor and then you say, Oh, that's a snake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.938,
    "end": 1670.199,
    "text": "But then like, you look, let me see that snake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.299,
    "end": 1673.78,
    "text": "Like, and then you have to zoom in, look at it closer and it ends up being like a coiled up rope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.26,
    "end": 1674.48,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.56,
    "end": 1682.262,
    "text": "And so it's not really a snake, but like you direct your attention because of some prediction and then can continue to process that prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.302,
    "end": 1690.705,
    "text": "So, so possibly action starts in the processing, in the processing area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.609,
    "end": 1721.95,
    "text": " maybe it's there in the middle well i'm gonna start it in the middle we can see where it goes because i think it's gonna have an important edge to each of these three areas so there's a few ways to represent it of course so how does action relate to biological systems or first let's let's um start with some philosophical frameworks that highlight the importance of action so this includes an activism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.672,
    "end": 1746.999,
    "text": " embodied the four e's five e's seven e's etc etc etc everything involving like this sort of embodied enacted and cultured extended etc approach to cognition and philosophy and those can be qualitative so i'm putting that edge here these are different qualitative and philosophical areas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.12,
    "end": 1749.2,
    "text": " Yes, they can be formalized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.22,
    "end": 1749.98,
    "text": "We'll get to that edge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.44,
    "end": 1757.622,
    "text": "But these are qualitative memes that come from this philosophical area, and they're going to draw us to action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.622,
    "end": 1758.882,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.382,
    "end": 1763.403,
    "text": "Now, how about biological systems and action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.203,
    "end": 1766.804,
    "text": "What do you think about when you think of biology and action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.664,
    "end": 1770.044,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.144,
    "end": 1774.385,
    "text": "I think those things are kind of inextricably linked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.12,
    "end": 1779.944,
    "text": " In my mind, because like you can't have life without having some action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.004,
    "end": 1781.685,
    "text": "I mean, cells replicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.705,
    "end": 1784.607,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1786.949,
    "end": 1796.476,
    "text": "I think this is going to be just something that doesn't demand to be said, but is totally true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.827,
    "end": 1822.282,
    "text": " biological systems are active there it's active matter and life is this multi-scale organization of activity so there's many ways biological systems are doing action and what are some areas that are formal whether or not they have to do with biology or any philosophy can you name a few areas of like formal theory and science that you think relate to action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.432,
    "end": 1850.784,
    "text": " so i mean i think um just that's maybe more related to processing um but but as i said earlier i think processing is related to action but like bayesian inference and and variational inference i think um which also tie in a lot to active inference um i think that they come in there uh in the processing slash processing through action or action through processing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1852.27,
    "end": 1874.795,
    "text": " okay great so um bayesian planning as inference as well as areas like cybernetics control theory and um different formal ways of modeling active systems and modeling decision making these could be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.97,
    "end": 1883.969,
    "text": " related to a biological system or not, and they can be drawing on a philosophical framework implicitly, explicitly, or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1885.282,
    "end": 1888.704,
    "text": " All right, so now this is starting to get fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.984,
    "end": 1898.731,
    "text": "You added another term there, and I think this will merit a detour, but then I return to here, which is the variational Bayesian approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.451,
    "end": 1906.376,
    "text": "So what do you think variational is meaning or doing here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.035,
    "end": 1926.859,
    "text": " So it's interesting and part of what makes this complicated paper and also like a complicated detour, that like the authors cast predictive coding as variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.279,
    "end": 1932.32,
    "text": "Like even though we've kind of made this distinction between predictive coding and predictive processing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.668,
    "end": 1945.512,
    "text": " where coding is like a one-way street and processing is like a two-way street, the authors nevertheless use the term predictive coding as variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.793,
    "end": 1955.696,
    "text": "And this predictive coding or this variational inference, I think the key...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.423,
    "end": 1969.932,
    "text": " construct here, and that's probably, I don't know, it overlaps with Bayesian brain maybe too, is the idea of having a model of the data generating process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.112,
    "end": 1978.418,
    "text": "And so I think variational inference kind of throws the idea of a model into the loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.359,
    "end": 1980.78,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.56,
    "end": 1985.503,
    "text": "So let's zoom in on this blue corner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.061,
    "end": 1990.363,
    "text": " of formal and quantitative areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.084,
    "end": 1994.167,
    "text": "And so these can be taken in an action independent way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1996.069,
    "end": 2000.513,
    "text": "They can be explicitly about action, like planning as inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.492,
    "end": 2005.273,
    "text": " or they could just more implicitly rest on inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.813,
    "end": 2008.294,
    "text": "I'm sorry, more implicitly rest upon action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.454,
    "end": 2014.857,
    "text": "For example, in the case of we're inferring the hidden state of the temperature of the room, and we're observing the thermometer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.477,
    "end": 2020.318,
    "text": "That doesn't have pi, it doesn't have a, it doesn't have action in that model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.719,
    "end": 2026.521,
    "text": "It might just have those two parameters of like the room's temperature, hidden state, and the observations of thermometer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.821,
    "end": 2029.882,
    "text": "But then we can kind of take a step back and see, all right, well, there's the person,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.382,
    "end": 2052.166,
    "text": " who's engaging in this experimental action the person's ocular motor zooming in on the thermometer maybe we can just abstract away but action is always baked into it because we're talking about active systems but let's just put some of that aside for a second and take a quick detour to talk about variational inference because it's a really important topic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.257,
    "end": 2079.754,
    "text": " let's think about and we've also explored this in active live stream 26 and 37 and a lot of other times so let's look at three different ways of doing bays bays ways bays areas as they were so and maybe there are more but the three that we can list up here are exact bays monte carlo",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.044,
    "end": 2082.245,
    "text": " and variational Bayes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.365,
    "end": 2087.228,
    "text": "So pick one, and then what is something important to know about that way of doing Bayesian statistics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.211,
    "end": 2096.594,
    "text": "Well, so I'm by no means an expert in Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.614,
    "end": 2101.577,
    "text": "I actually cracked out my Bayesian data analysis book while I was reading this paper, because...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.466,
    "end": 2107.312,
    "text": " it was, uh, one of those papers, like I said, I'm, I'm a, I'm anal retentive and, and detailed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2107.332,
    "end": 2108.293,
    "text": "And I'm like, what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.333,
    "end": 2110.295,
    "text": "I have to look up every little thing I don't understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.315,
    "end": 2114.279,
    "text": "Um, so like, okay, so let me start with exact base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.98,
    "end": 2119.866,
    "text": "Um, so exact base, when I think about exact base, it's like, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.492,
    "end": 2126.401,
    "text": " the probability of a given B, like the probability of rain given clouds or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.021,
    "end": 2134.492,
    "text": "Um, and so it's like, uh, uh, an alternate alternative to frequent test statistics where, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.731,
    "end": 2145.797,
    "text": " the probability of rain and the probability of clouds or, or like a coin flip is easier to talk about, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.837,
    "end": 2149.62,
    "text": "Like, so each flip of the coin is half.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.9,
    "end": 2160.128,
    "text": "And so like, you know, the idea that what, what are the chances that you're going to get heads, um, you know, five times in a row is half times, half times, half times, half times, half.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.749,
    "end": 2164.672,
    "text": "So, um, in Bayesian statistics, there's, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.319,
    "end": 2168.779,
    "text": " or the probability that you're going to get rain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.939,
    "end": 2169.639,
    "text": "Here, this is it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.919,
    "end": 2178.761,
    "text": "In frequentist statistics, the probability that you're going to get rain and the probability that you're going to get clouds is the probability of rain times the probability of clouds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.001,
    "end": 2180.261,
    "text": "That's a great way to put it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.361,
    "end": 2188.663,
    "text": "And then in Bayesian statistics, it evaluates the probability of rain with clouds, like given what you already have observed before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.803,
    "end": 2192.983,
    "text": "Like if it's rained, it's usually cloudy this percent of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.144,
    "end": 2196.624,
    "text": "And it takes into consideration the probability of rain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.153,
    "end": 2201.256,
    "text": " rain with clouds, the probability of rain, the probability of clouds, all those things separately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.336,
    "end": 2203.718,
    "text": "So it gives you a prior estimation, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.438,
    "end": 2205.159,
    "text": "So I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.179,
    "end": 2206.44,
    "text": "That's probably super confusing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.621,
    "end": 2207.861,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2208.081,
    "end": 2215.767,
    "text": "No, you mentioned a lot of really important points, which is it's an alternative to frequentist statistics analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.167,
    "end": 2218.689,
    "text": "So we're not getting a p-value out of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2219.649,
    "end": 2223.012,
    "text": "And we're able to explicitly say our priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.812,
    "end": 2223.952,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.933,
    "end": 2246.166,
    "text": " not to go down this rabbit hole but a lot of frequentism implicitly has a uniform prior and we'll just leave it at that for now so the exact base is using the base equation essentially as written and just as you said it there's the probability of something given something else and then you kind of find the probability of that other thing given the first thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.279,
    "end": 2271.254,
    "text": " multiplied by these other terms and then you fill out all of those variables and you literally do that division and so we explored like this in the case of axel constant's paper with the bacteria and so there was the exact bayesian bacteria that was having its prior and then taking in new information and updating how it thought about what was out there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.014,
    "end": 2287.235,
    "text": " based upon the new incoming information and it was like in a formula and it was like dividing exactly the numbers that you see here in this way okay so that's exact base now what are some issues with exact base",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.365,
    "end": 2304.237,
    "text": " It might be straightforward when you're talking about that coin flip, but if you're talking about a high dimensional space or something that is just bigger than the RAM or whatever of your computer, when it comes to the implementation, there's often challenges with exact base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.758,
    "end": 2315.846,
    "text": "And so there's several techniques that have been developed to approximate what an exact Bayesian approach would be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.032,
    "end": 2336.313,
    "text": " in a more tractable way so there's two alternatives to exact base implementation and the spirit is going to be exactly the same of taking in new information and updating our priors as specified but it's going to be done in a few different ways so first what about monte carlo what is monte carlo",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.193,
    "end": 2347.882,
    "text": " So Monte Carlo, you probably know more about the history than I do, but Monte Carlo is like a sampling technique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.423,
    "end": 2358.432,
    "text": "So, you know, instead of trying to calculate the probability of rain and clouds using exact bayes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.218,
    "end": 2366.283,
    "text": " you just sample out of 1,000 rainy days, how many of them were cloudy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.624,
    "end": 2369.526,
    "text": "And out of 1,000 cloudy days, how many of them were rainy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.086,
    "end": 2380.954,
    "text": "And so instead of getting an exact measurement of your distribution, like where is the overlap between clouds and rain, you just randomly pick out from all of the possible days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.254,
    "end": 2383.436,
    "text": "You estimate your sample that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.23,
    "end": 2390.49,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.831,
    "end": 2396.572,
    "text": "So it's based upon sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.452,
    "end": 2403.974,
    "text": "And so it's like we might not know one of these terms, but we can at least draw a sample.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.994,
    "end": 2405.614,
    "text": "And so this does a few different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.134,
    "end": 2414.477,
    "text": "It connects us first to empirical and specific data as implemented in a row of a program, not just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.558,
    "end": 2423.942,
    "text": " b sub i or some sort of analytical representation, but like this is where we're getting into this specific sample was pulled by this algorithm at this time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.943,
    "end": 2428.225,
    "text": "And one method that's a common",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.235,
    "end": 2454.383,
    "text": " thing is the markov chain monte carlo and this is using a local resampling approach like assessing local maneuvers of a given chain that's engaged in sampling and you kind of drop these chains into different parts of the probability distribution and then have them evaluate different aspects of that distribution so it's as easy or hard as dropping those paratroopers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.083,
    "end": 2482.403,
    "text": " into different parts of the physical landscape and then having them accept or reject different proposed moves so that's sort of a two-dimensional landscape with the height being elevation and maybe that's what you want to map because you might want to know is there one central peak are there two peaks that are very similar and take that into the statistical case and this is especially helpful for when there's no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.802,
    "end": 2493.706,
    "text": " Well, I don't want to say no idea, but there is not the desire to explicitly formalize what shape the distribution looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2494.106,
    "end": 2503.211,
    "text": "So we might want to do like Bayesian phylogenetics, and so we need to talk somehow about the likelihood of a given DNA sequence being that way, but like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.951,
    "end": 2505.132,
    "text": " Where do you go from there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2505.812,
    "end": 2509.974,
    "text": "And so that's where the Monte Carlo sampling based approach really comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.554,
    "end": 2517.818,
    "text": "And then because it's based upon sampling, the advantages are you can run that sampling for three iterations or three million.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.298,
    "end": 2524.081,
    "text": "So it's very flexible with the amount of computing power that you bring to bear on this challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.302,
    "end": 2529.204,
    "text": "But also there are the risks of oversampling, which is that you have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.254,
    "end": 2537.884,
    "text": " use some unneeded electrical power and computational power, which is really non-trivial, but also there's the risk of under sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.605,
    "end": 2546.535,
    "text": "And you might even be like in a regime where you think that you've sampled because you're getting samples that are just confirming what you already know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.256,
    "end": 2551.379,
    "text": " But there's a whole other island that you didn't do the paradrop to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.839,
    "end": 2561.446,
    "text": "So one can be lulled into a false precision with bootstrapping and sampling-based approaches because they can give ultra-high precisions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.386,
    "end": 2569.234,
    "text": " but that can be based upon actually more like a biased sampling approach or all these other features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.314,
    "end": 2581.608,
    "text": "And just the one anecdote that I have on that is in the Bayesian phylogenetics case, I remember this one professor in undergrad, Professor Moore, and he'd always say, fuzzy caterpillar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2582.128,
    "end": 2606.99,
    "text": " you want it to look like a fuzzy caterpillar and there's some technical details but it's like you want it to be exploring the full range of a parameter like if something could be zero to one you want to be exploring the full range but returning to the best estimate and that shows that you're sampling like the diversity of what that parameter can be but also spending more or most of your time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.831,
    "end": 2625.25,
    "text": " in the most likely and in the best regions and so if the value were at 0.5 and the range of what's possible was like zero to one that looks like a fuzzy caterpillar with more thickness in the middle and then a lot of fluctuation but it's not like it's spending a ton of time at one and then it drops suddenly to zero because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.63,
    "end": 2628.432,
    "text": " that would suggest that you're not converged yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.852,
    "end": 2638.197,
    "text": "Whereas when you see that fuzzy caterpillar, it's like you're sampling the extremes and getting novelty and testing different combinations, but you're also returning to something that is working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.577,
    "end": 2645.52,
    "text": "So Monte Carlo sampling based approach brings in all of these opportunities and challenges associated with sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.421,
    "end": 2652.704,
    "text": "Well, so I was under the impression, like you talked about over sampling, but I think, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.988,
    "end": 2665.121,
    "text": " over sampling, like as you, as sampling goes to infinity, like your, your accuracy increases, like you're, you're closer able to get the true posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.942,
    "end": 2668.245,
    "text": "But I think it's, it's uneven sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.385,
    "end": 2670.828,
    "text": "That's the danger in the Monte Carlo method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.848,
    "end": 2672.87,
    "text": "Like if you're sampling too far in one end or the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.976,
    "end": 2681.584,
    "text": " And perhaps like asymptotically, if you exhausted the state space, then you would know that you had the right answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.624,
    "end": 2688.532,
    "text": "But the whole reason why we're using any kind of heuristic approach rather than exact Bayes is because like we don't have the full state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.032,
    "end": 2693.557,
    "text": "So yeah, there's relatively low cost to oversampling,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2694.568,
    "end": 2695.949,
    "text": " but we don't always know when that is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2695.969,
    "end": 2702.932,
    "text": "And then under sampling can be just totally misleading if we take that as our only,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.417,
    "end": 2708.218,
    "text": " representation of that distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.698,
    "end": 2713.28,
    "text": "And so there's all kinds of cool techniques that involve like multiple chains happening in parallel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.621,
    "end": 2716.002,
    "text": "And some of them are like higher temperature and less temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.082,
    "end": 2719.844,
    "text": "So for one of those paratrooper teams, it's very cold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2720.444,
    "end": 2723.545,
    "text": "And so they're only making the best, very local moves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.665,
    "end": 2725.927,
    "text": "It's like the elevation is sharpened for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.287,
    "end": 2729.008,
    "text": "It's very hard to get out of a local rut.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2729.448,
    "end": 2731.95,
    "text": "And there might be another team that's very high temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.41,
    "end": 2734.391,
    "text": "And for them, the landscape is flat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.091,
    "end": 2736.692,
    "text": " maybe even completely flat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.272,
    "end": 2742.614,
    "text": "And then they're like a hot molecule that's able to move over something that might be a barrier for another team.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.994,
    "end": 2749.136,
    "text": "So that team is going to like fill in the details and locally explore quality solutions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.176,
    "end": 2751.877,
    "text": "Whereas there's another team that's like, or another chain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.377,
    "end": 2754.858,
    "text": "And so that's the multiple chain solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.839,
    "end": 2781.965,
    "text": " monte carlo approach and there's a lot to that in phylogenetics which is where i've seen it the most but also probably many other areas okay so i've i've run it in phylogenetics too and like i mean the programs can take forever to run because you know i mean you're too many parameters and and whatever they can really take a long time um the computational power is no joke like what goes into um the monte carlo sampling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.406,
    "end": 2786.33,
    "text": " So we have exact base, which is calculating the true posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.81,
    "end": 2791.595,
    "text": "And then we have the Monte Carlo, which is estimating the true posterior through sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.236,
    "end": 2805.228,
    "text": "And then we come to the variational, which is trying to minimize the divergence between the true posterior and your approximation of the posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.85,
    "end": 2807.03,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.113,
    "end": 2816.775,
    "text": " minimizing divergence between the true posterior, like what we would really have wanted to actually know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.691,
    "end": 2823.696,
    "text": " what is the actual temperature in the room conditioned upon the noisy thermometer estimates that we're getting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.336,
    "end": 2826.298,
    "text": "So are we gonna sample our way out of that one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.958,
    "end": 2828.94,
    "text": "The variational approach is gonna be very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.28,
    "end": 2836.025,
    "text": "And in 26, I think we had like the cat and then one approach was like the Monte Carlo was like pointillism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2836.406,
    "end": 2837.206,
    "text": "It was like dots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.226,
    "end": 2846.133,
    "text": "So we were sampling pixels from the cat and then it becomes like a pointillist picture of a cat that if you do sample densely enough, it looks like a cat or it's recognizable as a cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.045,
    "end": 2850.988,
    "text": " And the variational approach was like a clip art template.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.649,
    "end": 2857.033,
    "text": "And so let's just say that you had a template of different curves or of like, you knew that it wanted to be a cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.293,
    "end": 2858.334,
    "text": "You knew you were looking at a cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.875,
    "end": 2864.479,
    "text": "So then you have like a cat template that can get stretched or zoomed in or out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.36,
    "end": 2876.148,
    "text": "And so that might be very straightforward to optimize because you're just trying to minimize the divergence between these very limited parametric changes that you can implement",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.136,
    "end": 2881.839,
    "text": " And of course, you run into a situation which will explore various aspects of variational inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.561,
    "end": 2889.405,
    "text": "What if you try to stretch that cat emoji onto a different animal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.665,
    "end": 2891.626,
    "text": "Or what if it's a totally different kind of data set?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.026,
    "end": 2896.49,
    "text": "So you will find some divergence minimizing solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.537,
    "end": 2900.799,
    "text": " That doesn't mean it's sufficient or even in the right ballpark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.919,
    "end": 2910.844,
    "text": "Just like doing an L2, least squares, minimizing linear regression, we'll always find a best fitting linear regression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.789,
    "end": 2917.133,
    "text": " But that best fitting linear regression can be like hilariously inaccurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.233,
    "end": 2925.679,
    "text": "Like if the data are like a parabola, like a U, the best fitting regression might be like a flat line through the middle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.339,
    "end": 2931.863,
    "text": "Or if 80% of the points are here and 20% are over here, there might be a regression that's very misleading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.184,
    "end": 2934.085,
    "text": "That's like the Simpsons so-called paradox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.626,
    "end": 2938.289,
    "text": " In variational, we're not going to use sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.809,
    "end": 2953.323,
    "text": "We're going to use the minimization of a divergence, which is a KL divergence, but they mention in this paper it can also be a different kind of divergence, and the Raney divergence has been explored in some recent work of Sajid et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.984,
    "end": 2959.609,
    "text": "So we're going to minimize the divergence between the true posterior and a distribution Q,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.826,
    "end": 2967.57,
    "text": " that we control and is tractable to optimize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.393,
    "end": 2981.339,
    "text": "So it's like, instead of that sampling-based approach, we were dropping the teams at different parts of the landscape, and then they were going to report back on information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.999,
    "end": 2990.385,
    "text": "Here in the variational approach, it's like we have a template, and then we're gonna just do stretching and bending",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.168,
    "end": 2998.198,
    "text": " again, this is kind of a torture metaphor, but we're gonna stretch and bend, and there's only a few parameters on the stretching and bending.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.839,
    "end": 3003.847,
    "text": "And we're gonna find the best fit of those stretching and bending parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.268,
    "end": 3006.011,
    "text": "Like if it were a linear regression,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.089,
    "end": 3027.38,
    "text": " y equals mx plus b the two dials that you get to change are like the m the slope of x and b like how high or low the regression is and then you're finding m and b that are the best fitting about the data y and so you're kind of like minimizing the least squares error term",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.26,
    "end": 3048.848,
    "text": " here it's not a linear regression that we're fitting by minimizing the least squares it's a variational bayesian approximation that we're fitting by minimizing the divergence between the true posterior and the distribution q that we control and is optimal or is able to be optimized what else would you add on that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.084,
    "end": 3057.804,
    "text": " I think that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.924,
    "end": 3068.052,
    "text": "So the true posterior and the distribution that is tractable and we can optimize over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.112,
    "end": 3068.692,
    "text": "Yeah, that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.293,
    "end": 3078.479,
    "text": "So let's close this little... Computational intensity on variational is like much less, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.68,
    "end": 3086.265,
    "text": "Because instead of calculating all of the parameters for every little",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.57,
    "end": 3106.708,
    "text": " dot every little point on the sample we are calculating for like a big blob it's like one big blob instead of several little points but we calculate for that big blob this is the density for of that of that function um and these are the parameters of that so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.338,
    "end": 3116.266,
    "text": " So now we're gonna back out of this formal cul-de-sac that we've been in and just remember to ourselves, even if it's your first time hearing variational inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.503,
    "end": 3141.79,
    "text": " and or your kind of like bluer eye where it's like we've read it in how many papers but still every time we kind of start on square zero so why do we use variational bayesian inference so the first thing is it allows us to use bayesian statistics and probability which we might prefer over for example frequentism okay variational base then allows us to use a heuristic bayesian implementation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.972,
    "end": 3151.258,
    "text": " So if there's something that's too challenging or implausible for exact Bayes, now we can approach it like Monte Carlo or variational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.278,
    "end": 3152.299,
    "text": "These are both heuristics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.9,
    "end": 3156.382,
    "text": "Unlike Monte Carlo, it's not based upon sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3156.822,
    "end": 3160.665,
    "text": "Variational is based upon a family of equation fitting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.305,
    "end": 3165.308,
    "text": "And so it can be implemented very efficiently, which isn't always the case for Monte Carlo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.489,
    "end": 3170.552,
    "text": "It rests upon inappropriate factorization of the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.582,
    "end": 3177.724,
    "text": " And one other piece is this connects to analytical equations in physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.145,
    "end": 3183.026,
    "text": "So it's almost like Monte Carlo is like a computer scientist's approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.627,
    "end": 3185.547,
    "text": "It's like, how much RAM do we have?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.607,
    "end": 3187.108,
    "text": "How many processors do we have?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.188,
    "end": 3188.689,
    "text": "How big is this data set going to be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.189,
    "end": 3194.091,
    "text": "And then there's no analytical equation or closed form for Monte Carlo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.131,
    "end": 3194.951,
    "text": "It's like engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.431,
    "end": 3202.175,
    "text": " It's kind of like you have to have some art and skill and science coming together for the Monte Carlo to be the best it can be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.816,
    "end": 3208.76,
    "text": "And then it's more about like an adequacy and an efficacy question because you're not converging to the infinite asymptote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3209.16,
    "end": 3210.841,
    "text": "Again, otherwise you could have done something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.441,
    "end": 3218.463,
    "text": " And then the variational is like the physicist's approach and it draws on the variational calculus of Feynman and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.963,
    "end": 3226.725,
    "text": "And this is the part that's very amenable and connected to the equations of least action and all these other things like factorizing equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.725,
    "end": 3233.067,
    "text": "So it's funny that you bring up the computer scientist approach, um, in Monte Carlo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.167,
    "end": 3234.607,
    "text": "And like, so, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.84,
    "end": 3239.041,
    "text": " I am a horrible computer person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.121,
    "end": 3245.944,
    "text": "I mean, I will brute force wrangle my data, like just give me more RAM, just give me more processing power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.004,
    "end": 3248.785,
    "text": "Like I just want to make things work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.446,
    "end": 3252.387,
    "text": "I don't have any patience for finesse, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.487,
    "end": 3258.789,
    "text": "So in my mind, I think about the Monte Carlo, like the brute force, just shove your data through the algorithm, no matter how much RAM it takes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.209,
    "end": 3260.73,
    "text": "I think about Monte Carlo like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.11,
    "end": 3265.352,
    "text": "And I think about the variational bays more like the people that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.239,
    "end": 3283.191,
    "text": " can do like, you know, very simple things in code to make it run much faster than have that like very good skill with like, Oh, well we can just, you know, run this little factorization or, or, or, you know, we can make the problem run so much better on the computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.771,
    "end": 3287.093,
    "text": "So I think about it about the variational like that, but you, but you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.133,
    "end": 3291.576,
    "text": "It does have that connection to statistical physics and to definement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.616,
    "end": 3294.138,
    "text": "But I think about it as like a highly optimized tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.831,
    "end": 3296.794,
    "text": " way to run Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.874,
    "end": 3300.158,
    "text": "But why, Daniel, would someone want to run Bayesian statistics in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.719,
    "end": 3302.361,
    "text": "So maybe you want to give us an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.481,
    "end": 3303.423,
    "text": "Why would that happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.949,
    "end": 3305.37,
    "text": " Well, yeah, we will pull back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.41,
    "end": 3318.337,
    "text": "Just the last point there is the variational methods, we might even have a heuristic for those or an algorithm or approximation of those, for example, message passing and Forney factor graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3318.957,
    "end": 3325.581,
    "text": "Those draw an equivalence between Bayes graphs, where nodes are random variables and edges are statistical relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3326.381,
    "end": 3330.484,
    "text": "Bayes graphs can undergo variational inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3331.94,
    "end": 3336.868,
    "text": " and there's a tractable way to use toolkits like that developed by the BIAS Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3337.955,
    "end": 3345.221,
    "text": " and use message passing and a 40-factor graph representation to have a level of implementability for even the variational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3345.582,
    "end": 3349.465,
    "text": "Whereas it's not possible to imagine a heuristic for Monte Carlo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.685,
    "end": 3351.227,
    "text": "It is the heuristic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.347,
    "end": 3352.608,
    "text": "Sampling is sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.648,
    "end": 3356.511,
    "text": "You can do better sampling, but that's the game that you have chosen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.032,
    "end": 3362.616,
    "text": "Whereas in variational, even this question of minimizing divergence does require kind of like a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.277,
    "end": 3372.963,
    "text": " proximate or an operational approach, because how can we minimize the divergence between the true posterior and something we control when we don't know what the true posterior is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3373.463,
    "end": 3383.289,
    "text": "So there have to be a little bit more added, but this is like a very awesome discussion because it's helping us pull out like, this is the sort of exact approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.79,
    "end": 3391.354,
    "text": "And then there's a more computer science like sampling approach, and then a more analytical and physics related approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.474,
    "end": 3391.675,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.395,
    "end": 3394.616,
    "text": " So why do we want to do base?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.036,
    "end": 3399.339,
    "text": "Let's pull back to our triangle here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3401.04,
    "end": 3404.862,
    "text": "Why do we want to do base and thinking about the concepts here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.222,
    "end": 3406.282,
    "text": "Why do we want to do base?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.543,
    "end": 3409.084,
    "text": "I asked you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.164,
    "end": 3410.845,
    "text": "You're not allowed to turn the question around on me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.105,
    "end": 3411.905,
    "text": "That was me asking you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.925,
    "end": 3413.586,
    "text": "You're not allowed to just talk and then ask me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3417.506,
    "end": 3419.727,
    "text": " Well, there's a few ways to take it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.847,
    "end": 3423.93,
    "text": "I guess one would be, what is the alternative policy selection?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.69,
    "end": 3433.075,
    "text": "If we're doing research or application, what is our alternative to picking some Bayesian approach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.456,
    "end": 3438.859,
    "text": "So if we take the Bayesian road, we know that there's going to be some sort of trivergence later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.199,
    "end": 3441.901,
    "text": "Exact Bayes, Monte Carlo, Variational Bayes, something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3443.195,
    "end": 3446.719,
    "text": " or we could go down a different statistical path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3446.859,
    "end": 3454.027,
    "text": "Like we could use frequentist statistics and maybe that's totally adequate and effective for the situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.728,
    "end": 3456.29,
    "text": "And both are just maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.81,
    "end": 3461.836,
    "text": "So a well-fitting linear model of height and weight doesn't make height and weight a linear model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.97,
    "end": 3482.987,
    "text": " really good fitting action perception loop whether it rests upon a kernel of frequentist statistics or bayesian statistics doesn't make those systems that way that you modeled it um so i would say bayesian statistics is useful when we want to do some kind of formal or quantitative inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.991,
    "end": 3494.517,
    "text": " where we want to be specific and explicit about our prior beliefs and how we want incoming information to update those beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.418,
    "end": 3497.639,
    "text": "So I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.819,
    "end": 3508.245,
    "text": "And it's what I always try to tell people, you know, when I'm explaining like, what is Bayesian statistics, which a lot of people have never heard of, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.698,
    "end": 3512.901,
    "text": " in college, at least when I graduated, there's no Bayesian statistics course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.961,
    "end": 3524.949,
    "text": "Now many schools have them and, you know, I'm outdated already, but it's really like when you're doing frequent statistics, you go out to the desert and count mice every year, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3525.049,
    "end": 3529.172,
    "text": "Every year you go and count how many mice you see in the desert or something like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.973,
    "end": 3535.076,
    "text": "And if you, I mean, you expect to see some mice in the desert, otherwise you wouldn't be there counting them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.636,
    "end": 3537.878,
    "text": "So you expect a non-zero count.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.539,
    "end": 3539.14,
    "text": " answer, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.18,
    "end": 3544.166,
    "text": "So every year you go out, you find 10 mice, 20 mice, 50 mice, 30 mice, 20 mice, 10 mice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.226,
    "end": 3545.267,
    "text": "And every year you go count mice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.727,
    "end": 3550.713,
    "text": "So if you were to go, like you have some expectation that you will find mice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3551.294,
    "end": 3558.062,
    "text": "Um, you also have some expectation that there is going to be less than a thousand mice because every year you go sample this one place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.122,
    "end": 3558.342,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.442,
    "end": 3558.882,
    "text": "And so, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.069,
    "end": 3566.092,
    "text": " What Bayesian statistics does is it takes actually that prior, like frequentist statistics, they don't care if you ever found mice there before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.532,
    "end": 3571.715,
    "text": "Like your probability of finding zero mice and 30 mice and 50 mice and 100 mice and 1,000 mice is all the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.735,
    "end": 3573.796,
    "text": "It doesn't matter how many years you've been there before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.136,
    "end": 3577.057,
    "text": "Like you are starting with nothing in frequentist statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.077,
    "end": 3580.879,
    "text": "You don't get to have any guess that there's even going to be one mouse in the desert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.52,
    "end": 3588.623,
    "text": "Where with Bayesian statistics, like obviously you think that there are going to be some mice and you think it's going to be some number you can count reasonably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.116,
    "end": 3590.78,
    "text": " So with whatever area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3591.08,
    "end": 3598.316,
    "text": "And so what Bayesian statistics allows for is that prior belief or that expectation that you have as the experimenter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3599.853,
    "end": 3625.389,
    "text": " awesome and that's kind of what we were getting at with that idea of frequentism having this implicit uniform distribution you flip the coin 10 times you get three heads your maximum likelihood estimate is it comes up 30 of the time on heads 0.3 however if you want to take like a bigger picture view you might have some sort of precision about where it's likely to be like is it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.533,
    "end": 3633.08,
    "text": " likely to be 0.5 and you're going to be surprised if it were 0.3 because you just pulled it out of a cash register.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3633.661,
    "end": 3637.625,
    "text": "And then in that case, you still might say, I want to have a uniform prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.186,
    "end": 3640.288,
    "text": "And if it is 0.3, then it's 0.3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.889,
    "end": 3644.072,
    "text": "Or you might want to say, I'm very confident it's something else, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.853,
    "end": 3658.562,
    "text": " Bayesian statistics opens up the space to be specific about how we want to use our priors, how confident we want to be, how much precision we want to have in those priors, and then how we want to incorporate new information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3659.022,
    "end": 3660.022,
    "text": "So any other thought on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.143,
    "end": 3662.764,
    "text": "Or let's continue on that and connect it to some formalisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3663.425,
    "end": 3667.487,
    "text": "So I have one more thought on the coin flip with the Bayesian idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.587,
    "end": 3669.809,
    "text": "Like if you know it's a fair coin and the probability is 50%,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.061,
    "end": 3675.405,
    "text": " And like, if you're, we're flipping coins and we're betting each time, like, you know, a dollar, a dollar, a dollar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.745,
    "end": 3686.015,
    "text": "If we flipped that coin, like you flip the coin 10 times in a row and it's heads every single time, like on the 11th time, like my bet is on tails because like, it's not, it's a fair coin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.035,
    "end": 3687.957,
    "text": "Like it's not going to come up, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.436,
    "end": 3689.497,
    "text": " every single time heads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.877,
    "end": 3695.882,
    "text": "And so frequency statistics like does never allow for that previous information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.902,
    "end": 3698.524,
    "text": "And also like, where is that information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.985,
    "end": 3700.606,
    "text": "Which is something that always baffles me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.646,
    "end": 3708.352,
    "text": "Like, does the coin already know that it's been flipped 10 times and it's come up heads all those times and that it then has to come up tails sooner or later?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.372,
    "end": 3714.457,
    "text": "I mean, the probability is so low that you're going to get like a thousand coin flips of a fair coin in a row that is heads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.497,
    "end": 3716.859,
    "text": "Like, I don't know if it's ever happened to anyone ever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.304,
    "end": 3725.274,
    "text": " So like as we increase in the number of flips and if it's heads, heads, heads, heads, heads, like it becomes increasingly probable that the next flip is going to be tails in my view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.355,
    "end": 3725.535,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.555,
    "end": 3726.856,
    "text": "Which is maybe totally wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3726.917,
    "end": 3729.28,
    "text": "But but where is that information stored?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.54,
    "end": 3734.046,
    "text": "And the Bayesian kind of allows for that to be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.005,
    "end": 3759.957,
    "text": " i wonder if this even connects to where is that information stored in the quantum reference frame of the observer and nowhere else but let's look at how that gets implemented in these formalisms so you just described that setting where somebody has like a belief that the coin is fair maybe that's an empirically grounded belief like previously they flipped it a thousand times and they got 50 50.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3761.724,
    "end": 3765.586,
    "text": " or they have just an a priori belief that is fair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.186,
    "end": 3781.052,
    "text": "If that belief were generated by a real other data set, we would call that parametric empirical base because it's the process where you set the priors as well as their confidence based upon some collected data set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.854,
    "end": 3783.595,
    "text": " That's parametric empirical base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.656,
    "end": 3793.183,
    "text": "Or one could just take that a priori, Kant's synthetic a priori, and just say, coins ought to be 50-50.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.824,
    "end": 3796.225,
    "text": "And that's what I'm sticking with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3797.966,
    "end": 3799.527,
    "text": "Let's just say that then we play this game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.607,
    "end": 3802.31,
    "text": "We flip it 10 times and likely or not,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.369,
    "end": 3828.578,
    "text": " 10 heads happen that's the trace of behavior in the niche it actually happened now that might be seen as a totally likely outcome by somebody who believes that it always comes up heads hence they're unsurprised or depending on what your priors were that could be variably surprising and then you talked about well when and how should you update your beliefs on that coin",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3829.358,
    "end": 3831.619,
    "text": " Like maybe something changed while you weren't looking at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.759,
    "end": 3838.18,
    "text": "And so you want like your best estimate to very heavily reflect the recency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3838.721,
    "end": 3845.102,
    "text": "And maybe that should be like a moving average of the most recent three flips or maybe the most recent 30.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.622,
    "end": 3849.864,
    "text": "So let's look at two places in the paper where they do something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3851.204,
    "end": 3858.626,
    "text": "The first one has to do with predictive coding and frame differencing algorithms in video compression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.662,
    "end": 3872.348,
    "text": " And so in this area, we can think about the way that the video looks, people who are watching this video, the way that the video looks is like the output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3872.908,
    "end": 3877.37,
    "text": "And then we want to encode like how surprised are we, what is happening when the frames are changing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.01,
    "end": 3882.993,
    "text": "And so the simplest method is just count where it's different and convey that information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3883.753,
    "end": 3887.675,
    "text": "But it might also be important to use, as they write,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.84,
    "end": 3898.207,
    "text": " more advanced methods that predict each new frame using a number of past frames weighted by a coefficient in approach known as linear predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.268,
    "end": 3909.396,
    "text": "So that's one case where you're determining how many frames back, how many coin flips back should we use for that now casting and how should we weight them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.077,
    "end": 3911.057,
    "text": "So that's one area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3911.778,
    "end": 3916.802,
    "text": "And then a second area that they bring up and connect is the Kalman filter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.755,
    "end": 3924.04,
    "text": " So here's the Kalman filter and this is their formalisms 33 and 34.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.602,
    "end": 3928.905,
    "text": "And it has a lot to do with Bayesian statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.226,
    "end": 3933.13,
    "text": "So on this, and Bayesian Kalman filter is very common",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.554,
    "end": 3938.355,
    "text": " We can see it in two different ways, so on the left side of this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3939.216,
    "end": 3948.279,
    "text": "The top image shows a prior prediction, that's the prediction, and then two is the measurement, and then there's the fusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.919,
    "end": 3953.461,
    "text": "So we have the prediction, the measurement here with like GPS, and then there's the fusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.221,
    "end": 3967.686,
    "text": " so that is very similar to having a prior and then some updated sensory information and then the posterior so it's just labeled slightly differently but we can already see how this is like totally related to bayesian statistics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3968.871,
    "end": 3974.815,
    "text": " What this also brings into the picture is like a pseudo code that unrolls through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3975.736,
    "end": 3979.078,
    "text": "So Bayesian statistics approach doesn't have to be about time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3979.598,
    "end": 3982.08,
    "text": "It can be about a static data set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.78,
    "end": 3992.066,
    "text": "And then you could be modeling like, okay, per extra sample of the population of their height and weight, we're going to update our inference on that relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.627,
    "end": 3995.089,
    "text": "But that's a timeless analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.549,
    "end": 3998.631,
    "text": "It doesn't incorporate some sort of unfolding through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3999.771,
    "end": 4006.033,
    "text": " That can be incorporated into the Kalman filter using this pseudocode down here on the left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4006.393,
    "end": 4014.376,
    "text": "There's some prior knowledge of state, and this is like two dimensions, and then there's a cloud representing a distribution of precision or uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.876,
    "end": 4022.739,
    "text": "So a more precise estimate would be like a tighter cloud there or a sharper peak or a sharper valley, depending on how you want to think about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.649,
    "end": 4030.452,
    "text": " And then less precision would be like a broader basin or like a more diffuse ink drop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.993,
    "end": 4039.617,
    "text": "And then there's a prediction, then a measurement occurs, which can be precise or can also have an associated measurement error term",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4041.069,
    "end": 4047.514,
    "text": " which could be fit with parametric empirical Bayes based upon testing, or it could be determined on the fly with expectation maximization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4048.154,
    "end": 4053.699,
    "text": "And then that prior gets juxtaposed in this update step and that outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.559,
    "end": 4064.287,
    "text": "So this takes sort of this timeless Bayesian update scheme and specifically adapts it to the case of something happening through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4065.328,
    "end": 4070.432,
    "text": "And that's shown on the right side here with this image of like time is happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.465,
    "end": 4074.387,
    "text": " and we're getting these noisy x measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4075.467,
    "end": 4080.891,
    "text": "And the true temperature is the purple, and let's just say it's unchanging in this case, but that could also be changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.451,
    "end": 4090.176,
    "text": "One can just imagine that, especially if it's very noisy, it's hard to get increasingly complex dynamical patterns, but that's all part of the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4090.736,
    "end": 4096.82,
    "text": "And then the prior starts high, and then the prior is weighted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.84,
    "end": 4098.201,
    "text": "It's kind of like a spline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.141,
    "end": 4099.722,
    "text": "It's weighted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.776,
    "end": 4101.937,
    "text": " through all of these Xs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.417,
    "end": 4108.081,
    "text": "And you could imagine one extreme case is like move to the last one that you saw.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4108.881,
    "end": 4113.024,
    "text": "And so that would be like basically recapitulating the measurements distribution through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.281,
    "end": 4122.01,
    "text": " The other extreme case would be wait all the time points evenly so that like we're kind of converging to a moving average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4122.05,
    "end": 4134.003,
    "text": "So if we have 100 hours of video that is like at a two and then all of a sudden it switches to an eight and then your moving average would very, very slowly start moving up from a two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.106,
    "end": 4149.159,
    "text": " And then one could imagine that there's some intermediate solution that doesn't use like the whole data set because that's too slow to adapt and maybe takes up too much memory, but isn't just like a one step instantly switched to the nearest measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4149.74,
    "end": 4157.607,
    "text": "And that parameter of how fast should you update your Kalman filter is a parameter in the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4158.388,
    "end": 4168.091,
    "text": " And so that is exactly what is being statistically optimized is how much through time should we update our ongoing estimate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4168.511,
    "end": 4173.333,
    "text": "And so in the static or the timeless Bayesian case, that's where we talk about precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4174.033,
    "end": 4195.248,
    "text": " how much should we update our inference as new information is added to our data set but that doesn't mean appended in a temporal way the common filter is making it explicit that these data points are being added sequentially and that is providing us with this pseudocode by which the latent state is updated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4198.985,
    "end": 4204.188,
    "text": " not just as a function of adding data, but actually adding data in a sequential and unrolling way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.588,
    "end": 4205.228,
    "text": "What do you think, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4208.93,
    "end": 4209.49,
    "text": "Yeah, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.911,
    "end": 4214.753,
    "text": "I think that that was a super good explanation and very clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4214.853,
    "end": 4221.837,
    "text": "And yeah, my first interaction with common filtering was in imaging and image processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.897,
    "end": 4222.437,
    "text": "And so I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4223.578,
    "end": 4231.484,
    "text": " That's maybe where people come across that a lot, especially like doing laser scanning microscopy or video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4231.604,
    "end": 4234.907,
    "text": "I guess the video update also is like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.728,
    "end": 4235.988,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.368,
    "end": 4239.931,
    "text": "So let's just look at some of their writing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4240.391,
    "end": 4243.133,
    "text": "But these are like the smaller the formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.315,
    "end": 4249.839,
    "text": " the less we've paid attention to it and the more that we would love to know about what it actually means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4250.459,
    "end": 4252.921,
    "text": "But let's kind of pick up above there, 35.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.061,
    "end": 4255.843,
    "text": "They write, Kalman filtering proceeds in two steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4256.403,
    "end": 4262.107,
    "text": "First, the state is projected forwards using the dynamics model or prior, and that's the P,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.468,
    "end": 4288.076,
    "text": " of mu t plus one that's the mean at the next time step conditioned upon the mean at this time step so that's like what is going to happen next conditioned upon how it is now these estimates are corrected or sort of compromised coming to a compromise by new sensory data by inverting the likelihood mapping",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.312,
    "end": 4296.701,
    "text": " P of observations at the next time point, conditioned upon our estimate of where the latent state will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4297.282,
    "end": 4301.947,
    "text": "So this is what temperature will the room be conditioned upon how it is now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4302.916,
    "end": 4325.265,
    "text": " the next time step what will it be conditioned upon what it is now this likelihood mapping which is like the a matrix in the pomdps is what is the probability of the outcome in the next time step being a certain way conditioned upon how we think the room's temperature is going to be and so these are the equations and some of the variables",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.638,
    "end": 4349.706,
    "text": " and then they kind of conclude or in this little section the derivation of the rules is relatively involved and that's in appendix a and some other places but also the common filtering can be interpreted as finding the optimum of a maximum a posteriori estimation problem so this is almost like we have Kant with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.746,
    "end": 4368.232,
    "text": " the exhortation of the a priori what information are we bringing to the table qualitatively Kant or quantitatively Bayes that's the a priori and then Bayes kind of bridges the a priori the prior with a posteriori",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.492,
    "end": 4398.602,
    "text": " not sure if that's the latin for that one but it's the posterior what happens after the sensory update and then that space between like the before and the after is the during and that's the during of the now that we're doing action and inference within let's look at how they introduce oh anything otherwise we'll look at how they introduce action and then connect it back to active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.918,
    "end": 4406.741,
    "text": " So I think the common filtering and the, the updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.221,
    "end": 4428.469,
    "text": "So I think we, we kind of skipped over updating when we were talking, when we were making our layer cake earlier and just how, how messages in the nervous system biologically and in predictive coding are passed forward and backward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4428.549,
    "end": 4429.089,
    "text": "So it might,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.468,
    "end": 4445.538,
    "text": " be helpful to back up and talk about error propagation and propagation of back propagation and propagation of signal through time just as like a very basic way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.558,
    "end": 4450.121,
    "text": "Because I think the Kalman filter is kind of an advanced way to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.281,
    "end": 4451.882,
    "text": "Can we detour?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.162,
    "end": 4453.162,
    "text": "Can we backtrack?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.503,
    "end": 4454.343,
    "text": "We're back at the triangle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.843,
    "end": 4458.466,
    "text": "And so now we've added variational as like a little badge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4459.42,
    "end": 4461.581,
    "text": " to the Bayesian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.302,
    "end": 4464.703,
    "text": "And also we're gonna add Kalman as a badge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.023,
    "end": 4467.405,
    "text": "Where have we visited on this journey?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4468.345,
    "end": 4475.29,
    "text": "And one can imagine that they could take a Monte Carlo or a variational or an exact approach to Kalman filtering and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4475.61,
    "end": 4484.995,
    "text": "And then you mentioned a few more biologically inspired or compatible features like error propagation and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.015,
    "end": 4488.978,
    "text": "So what is a area in the paper or an idea that's relevant here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4491.363,
    "end": 4508.984,
    "text": " So I think that the signal propagation and bottom-up prediction error, like how does error propagate through visual systems, through neural networks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.104,
    "end": 4510.546,
    "text": "I think that there's applications here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.47,
    "end": 4514.813,
    "text": " And is it the error that's fed forward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.993,
    "end": 4516.756,
    "text": "Or is it the signal that's fed forward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.016,
    "end": 4519.579,
    "text": "Or where does the error go in the system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.08,
    "end": 4528.75,
    "text": "So I think these are some confusing things that maybe they touched on in the beginning of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4528.83,
    "end": 4530.552,
    "text": "So let me see if I can find exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.187,
    "end": 4535.95,
    "text": " Or there's some debate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.351,
    "end": 4537.753,
    "text": "Okay, while you're looking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4537.793,
    "end": 4542.642,
    "text": "So I've pulled out this right edge of the triangle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4542.662,
    "end": 4543.803,
    "text": "So we're going to just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4544.946,
    "end": 4554.93,
    "text": " leave some of the baggage at home and take out to the table, just this link between Bayesian statistics and probability and biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4555.53,
    "end": 4560.592,
    "text": "And then you raised this really important question about like, how do we think about error estimation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4561.312,
    "end": 4568.154,
    "text": "And also some related terms there would be like precision, ambiguity, risk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4569.035,
    "end": 4569.555,
    "text": "Compression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.506,
    "end": 4575.128,
    "text": " And so those are error estimates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.888,
    "end": 4580.291,
    "text": "And then how are error estimates propagated and communicated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4580.311,
    "end": 4583.533,
    "text": "How are they propagated and communicated in language?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.494,
    "end": 4585.194,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.515,
    "end": 4596.602,
    "text": "If I had to guess, how are error estimates communicated in systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.082,
    "end": 4600.945,
    "text": "And so we might be interested in mathematical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4602.381,
    "end": 4606.964,
    "text": " So then the way that you communicate the error is just you multiply the two variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4607.004,
    "end": 4611.747,
    "text": "You have a precision matrix, and then you have like some sort of hidden state matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.928,
    "end": 4619.273,
    "text": "And then you basically just fuzz this kind of pristine matrix by some error matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4619.973,
    "end": 4629.139,
    "text": "And so if your error on something is like zero, this is not exactly how the multiplication would work because multiplying by zero, but if the error were zero on something,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.311,
    "end": 4634.536,
    "text": " one would want their estimate to be passed through without being blurred.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4635.477,
    "end": 4638.3,
    "text": "If the estimate of the uncertainty were super high,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4639.662,
    "end": 4651.03,
    "text": " in the extreme approaching total noise and uncertainty and variance estimate, then no matter where that pristine estimator were, you'd want it to be like totally fuzzed over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.45,
    "end": 4659.916,
    "text": "And then one could imagine that in a per variable ongoing way, you'd want to be updating these variance estimators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4660.557,
    "end": 4665.981,
    "text": "And that is exactly what happens in the Kalman filter, which is this unrolling and ongoing estimate of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.721,
    "end": 4671.423,
    "text": " observations, latent states, and the variance that links them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4671.503,
    "end": 4673.744,
    "text": "And that's done through matrix multiplication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.205,
    "end": 4677.126,
    "text": "But how does it happen in biological systems is a different question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.428,
    "end": 4694.575,
    "text": "So I think some things come into play here, like redundancy and signal compression and then error propagation forward and backward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.917,
    "end": 4707.667,
    "text": " And so there is this in predictive coding slash predictive processing, because I'm still like not 100% on the difference there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4708.787,
    "end": 4717.714,
    "text": "But I do think this is a predictive, it seems like it's a predictive processing thing, but the authors do say predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4717.955,
    "end": 4723.379,
    "text": "There is like a bottom up construction of a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.119,
    "end": 4742.774,
    "text": " So the authors say that perception is not the result of an unbiased feedforward or bottom-up processing of sensory data, but is instead a process of using sensory data to update predictions generated internally by the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.555,
    "end": 4747.117,
    "text": "So there's the idea of a model comes in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4748.191,
    "end": 4749.252,
    "text": " Yeah, generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.432,
    "end": 4753.714,
    "text": "Where do you see generative model in these discussions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4758.037,
    "end": 4759.858,
    "text": "I mean, it's kind of threaded throughout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4760.058,
    "end": 4774.187,
    "text": "So I think the idea of variational inference brings in a model because the model constructs the estimate of the posterior, like where there's a consistent effort to update",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.806,
    "end": 4784.47,
    "text": " the estimate of the, or to, sorry, to minimize the divergence between the actual posterior and the estimate of the posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.17,
    "end": 4791.113,
    "text": "So the estimate of the posterior is like, you know, trying to make the model match reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4791.553,
    "end": 4799.176,
    "text": "So trying to make the picture of the cat match, stretch, bend, fold into, you know, the model of the cat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.417,
    "end": 4800.677,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.017,
    "end": 4801.317,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.798,
    "end": 4803.799,
    "text": "So generative model with no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4805.944,
    "end": 4809.489,
    "text": " complications is being put into the Bayesian statistics area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4809.949,
    "end": 4813.454,
    "text": "Because if you specify a model that's generating thermometer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4814.423,
    "end": 4817.506,
    "text": " outputs given the temperature, it's quite literally the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.806,
    "end": 4819.227,
    "text": "And we know that there's kind of two directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.247,
    "end": 4821.57,
    "text": "There's like the recognition model and the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4821.67,
    "end": 4827.094,
    "text": "That's the tail of two densities because a distribution can also be understood as a density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4827.675,
    "end": 4839.586,
    "text": "And so in the realm of statistics, generative model is quite literally the approach that is taking parameters of a model and using it to generate, for example, observations in this case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.546,
    "end": 4841.967,
    "text": " No need to complicate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4842.627,
    "end": 4853.513,
    "text": "But then there's a few ways that we hear different people in different papers talking about the relationship between biological systems and generative models, as well as recognition models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.573,
    "end": 4855.274,
    "text": "But we're focused on the generative model here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4855.874,
    "end": 4856.935,
    "text": "And sometimes these are even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4858.348,
    "end": 4872.33,
    "text": " coherently or incoherently used differently in the same paper or the same sentence, which is our favorite and will eagerly await the kind of automated detection systems that will enable us to do high throughput analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4872.531,
    "end": 4876.671,
    "text": "But here's just a few of the kind of ways that people can talk about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4877.291,
    "end": 4886.213,
    "text": "We hear sometimes that the biological organism or cell is a generative model, has a generative model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4887.409,
    "end": 4909.548,
    "text": " enact a generative model or the more instrumentalist we can model that system with a generative model and so this bottom one is kind of like saying i'm just planning to use bayesian statistics to model a biological system and perhaps we could say that this is the least",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4910.779,
    "end": 4915.201,
    "text": " bringing assumptions to the table of what that system is doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.581,
    "end": 4932.268,
    "text": "Because by saying we can model it using a generative model, or we can use or fit, derive a generative model for this behavioral cognitive system, we're just remaining purely with both feet in scientific instrumentalism and empiricism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4932.728,
    "end": 4934.729,
    "text": "We're making only claims about the map",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.28,
    "end": 4950.512,
    "text": " and not about the territory per se which might be throwing out the um whatever with the whatever however these ones are when people are making claims that are about the territory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4951.212,
    "end": 4952.693,
    "text": " what is the brain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4953.113,
    "end": 4956.275,
    "text": "Is Bayesian brain what the brain is doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.775,
    "end": 4960.958,
    "text": "Well, it's not passing around screenshots of Bayes equation like we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4960.978,
    "end": 4963.239,
    "text": "So what is it that it is doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.94,
    "end": 4965.781,
    "text": "Or again, is it on the instrumental side?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.821,
    "end": 4967.702,
    "text": "It's just something that we can use to model the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4968.122,
    "end": 4970.444,
    "text": "So yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4971.864,
    "end": 4972.565,
    "text": "So, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4974.215,
    "end": 4983.682,
    "text": " Going back to predictive coding and also linking to what is the brain doing, and really this is why I wanted to stop here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4983.702,
    "end": 4986.264,
    "text": "I found the spot in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4987.605,
    "end": 5001.575,
    "text": "But when we were talking about common filtering and image processing and then error propagation in a system, they talk early in the paper about predictive coding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5002.367,
    "end": 5011.27,
    "text": " as a means to remove redundancy and applied it to signal processing to reduce transmission bandwidth for video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5013.21,
    "end": 5029.635,
    "text": "And the authors say here, Barlow applied this principle to signaling in neural circuits, arguing that the brain faces considerable evolutionary pressure for information theoretic efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5030.157,
    "end": 5038.183,
    "text": " since neurons are energetically costly and redundant firing would be potentially wasteful and damaging to an organism's evolutionary fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.803,
    "end": 5044.227,
    "text": "Because of this, we should expect the brain to utilize a highly optimized code, which is minimally redundant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.807,
    "end": 5055.875,
    "text": "And they say predictive coding minimizes this redundancy by only transmitting errors or residuals of sensory input that cannot be explained by top-down predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5056.348,
    "end": 5059.369,
    "text": " And so they remove redundancy at every point in the layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5059.409,
    "end": 5069.274,
    "text": "So it's like when you're watching a video and, um, or even like the flip book, like, so we see like, you know, the, the, the flip book that likes of a little figure kicking a ball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.155,
    "end": 5083.481,
    "text": "The point that changes is the point that's prioritized the point that's different in each frame, not the point that stays consistent because that is where the action is here, um, where the motion is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.062,
    "end": 5086.263,
    "text": " So that's what's prioritized here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5087.584,
    "end": 5090.986,
    "text": "And that totally connects to information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5091.306,
    "end": 5098.95,
    "text": "Informative updates are the ones that update your prior to move it to a different posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.99,
    "end": 5103.813,
    "text": "That's the Bayesian information concept, as opposed to, for example, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.177,
    "end": 5108.439,
    "text": " Shannon entropy, which is like based upon symbol entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5108.459,
    "end": 5109.739,
    "text": "So they're totally compatible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.999,
    "end": 5119.224,
    "text": "And if this seems like a technical detail, it is, but also this is the Bayesian concept of surprise and information, but that was a great section you pulled out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5119.324,
    "end": 5129.689,
    "text": "So here we're really highlighting as following Barlow, applying this principle of redundancy removal, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5131.437,
    "end": 5140.465,
    "text": " Already we can caveat how much redundancy to remove because a more redundancy removed system is also potentially more fragile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5141.205,
    "end": 5147.01,
    "text": "Like if we only have one copy of each saved file, now our threat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5148.254,
    "end": 5149.734,
    "text": " of losing it is very high.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.355,
    "end": 5154.516,
    "text": "So redundancy is always in a trade-off with like resilience and other system features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5154.636,
    "end": 5157.917,
    "text": "So this is one principle, but it's not the only principle at play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.977,
    "end": 5160.798,
    "text": "So redundancy doesn't mean we're gonna pare it down to nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5161.418,
    "end": 5170.341,
    "text": "It just means that for an organ like the brain, which is using like 20% or however much of an organism's energy budget,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5171.121,
    "end": 5175.342,
    "text": " changes in its efficiency by several percents can be really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.882,
    "end": 5179.383,
    "text": "So that principle of redundancy removal is being applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5180.403,
    "end": 5185.664,
    "text": "And the argument is that the evolutionary pressure is for information theoretic efficiency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5186.444,
    "end": 5196.766,
    "text": "So if you don't have anything to update, you don't want to spend the energy to do something extraneous, nor do you want to spend any more energy than you might have to on updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.728,
    "end": 5202.894,
    "text": " And that's again, because of the wastefulness of potentially excess signaling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5202.914,
    "end": 5205.797,
    "text": "And then with evolution, there's always a twist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5205.837,
    "end": 5210.963,
    "text": "Like what if it is wasteful and that's just some second level reason why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5211.083,
    "end": 5212.665,
    "text": "So it's not the whole story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5212.705,
    "end": 5214.527,
    "text": "This is just sort of short sentences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5215.949,
    "end": 5216.65,
    "text": "Because of this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5218.152,
    "end": 5243.847,
    "text": " should expect the brain to utilize a highly optimized neural signaling neural firing code which is minimally redundant and then they connect it back from what the brain ought to be doing normatively at a first pass to the formalisms that were being described with predictive coding so in the frame differencing case it was like only tell me about the pixels that are changing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5245.117,
    "end": 5259.001,
    "text": " And then if nothing's changing, just send me like a little beep and I'll just know with just one piece of information, just to keep it exactly the same, even if it's 4K video and it's a gigabyte per second or whatever, but we don't have to change anything for that video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5259.581,
    "end": 5265.023,
    "text": "And then as pixels are changing, update me on how to change them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5265.888,
    "end": 5270.571,
    "text": " And so that would be like the maximum efficiency encoding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5271.491,
    "end": 5275.214,
    "text": "And so you would give a full resolution of the first frame in the movie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5275.594,
    "end": 5284.96,
    "text": "That's the prior, that's D. And then all one has to do is think about how to encode how the subsequent frames change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5285.802,
    "end": 5287.983,
    "text": " And sometimes they introduce things like a key frame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5288.323,
    "end": 5291.805,
    "text": "So every second or every minute, it starts with a fresh prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5292.325,
    "end": 5298.668,
    "text": "And so these are the kind of computational things that one can do when they're not bound by the constraints of biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5298.828,
    "end": 5300.129,
    "text": "But this is an awesome connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5301.91,
    "end": 5304.771,
    "text": "Any other thoughts on that theme?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.831,
    "end": 5307.132,
    "text": "Or where does error propagation come into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5307.412,
    "end": 5308.793,
    "text": "Or we'll turn back to the triangle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5311.033,
    "end": 5335.118,
    "text": " So, I don't know, the error propagation is interesting, and it'd be great to have, like, the input of somebody who is more, like, versed in machine learning, because I think the idea of, like, back propagation, like, this is an error, and, like, sending that back to the previous, like, layer in the neural network is super interesting, and part of what, like, enhances the efficiency of neural networks, like, hey, fix this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5335.518,
    "end": 5338.939,
    "text": "And so I think, and I can't really find in the paper where they say that, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5339.431,
    "end": 5344.532,
    "text": " but there's like a local correction for error within each layer of processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5345.052,
    "end": 5356.114,
    "text": "So in the visual system and yeah, in signal processing itself, it's like each layer prioritizes just fixing their own error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.374,
    "end": 5363.636,
    "text": "And then that contributes to the overall efficiency and accuracy of the system at large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5364.372,
    "end": 5378.975,
    "text": " yes back propagation is mentioned 45 times in the paper with a quick search so it's definitely an important concept and also something the authors have worked in a lot so good error propagation and back propagation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5382.418,
    "end": 5404.949,
    "text": " also that reminds me of um when professor levin was here in 40.2 with the back propaganda and the imperatives for like the different parts of the neural network and the kind of information that they want or expect or prefer and then how they want to escape being trained and engage in learning but not being trained but still updating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5405.689,
    "end": 5411.191,
    "text": " So this learning and being trained both involve like updating priors potentially, appropriately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5411.791,
    "end": 5429.636,
    "text": "But in the case of training, there's a feeling like another entity or agent is imposing their will versus learning can also be associated with behavioral and cognitive changes, but has a different sense potentially than being trained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5432.457,
    "end": 5435.318,
    "text": "Anyways, let's go back to the triangle as we're sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5436.738,
    "end": 5439.86,
    "text": " not quite landing the dot one play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5439.981,
    "end": 5446.245,
    "text": "The check has not arrived at our restaurant, but maybe we're working our way up to our first star.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5448.187,
    "end": 5450.889,
    "text": "Where do we sit on where action is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5451.269,
    "end": 5456.974,
    "text": "And then we have a few terms that we wanna put, which is message passing and then active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5457.694,
    "end": 5458.034,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5458.355,
    "end": 5460.917,
    "text": "So what is another term that we can add in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5462.549,
    "end": 5465.09,
    "text": " or something that we're seeing differently in a new light?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5465.79,
    "end": 5467.951,
    "text": "Or where do you see message passing or active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5475.954,
    "end": 5479.096,
    "text": "So I think, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5480.696,
    "end": 5483.437,
    "text": "So we have action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5483.637,
    "end": 5485.258,
    "text": "Are we happy with where action is sitting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5490.951,
    "end": 5492.052,
    "text": " Do we have enough arrows?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5492.392,
    "end": 5499.676,
    "text": "I think it's... I've used every feature of Google Slides sufficiently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5499.696,
    "end": 5507.821,
    "text": "I like action as sort of a fulcrum in the center of the merry-go-round is action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5507.862,
    "end": 5510.643,
    "text": "And yes, more arrows could be drawn, but we'll keep it a little sparse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5511.043,
    "end": 5511.504,
    "text": "But go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5513.125,
    "end": 5519.689,
    "text": "So I think maybe message passing sits between...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5521.226,
    "end": 5524.048,
    "text": " predictive processing and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5524.968,
    "end": 5529.771,
    "text": "And then that's exactly where I was going to put active inference was right where you just typed in inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5530.592,
    "end": 5548.543,
    "text": "Um, because I think, uh, if we're, or yeah, it's hard to say, um, where active inference really goes, maybe like not right where inferences, but like somehow if action and the Bayesian brain and biological systems could form a, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5549.079,
    "end": 5553.661,
    "text": " a triad, maybe active inference would sit in the middle of those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5555.661,
    "end": 5563.704,
    "text": "So I added message passing to Bayesian statistics and probability because it's something that we can do on a Bayesian graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5564.964,
    "end": 5578.429,
    "text": "It's a implementational approach, but it's also leaning a little bit towards the biological because when people talk about like, how does a given piece of information or signaling or stimulus in a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.956,
    "end": 5585.559,
    "text": " the toe end up having an effect on the other side of the body or on the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5585.579,
    "end": 5607.19,
    "text": "Like there's some kind of, now it's being used in a technical Bayesian sense with message passing, whereas in a more just sort of like conversational way with biological message passing, but whether it's a synapse, an immune synapse, or a neural glial synapse, or it's a mechanotransduction, or it's a hormone,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5608.883,
    "end": 5619.412,
    "text": " broadly, we can just consider these different biological mechanisms that convey information or updates or anything to be like past messages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5619.953,
    "end": 5628.34,
    "text": "So message passing is going to be a formal technique, but it does lean towards modeling the ways in which different biological nested entities are exchanging information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5628.64,
    "end": 5628.82,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5629.641,
    "end": 5636.427,
    "text": "And so why I would put it with predictive processing is because when I think about the things that we were talking about, like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5637.23,
    "end": 5638.51,
    "text": " How are signals compressed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5638.75,
    "end": 5640.751,
    "text": "How is redundancy eliminated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5640.771,
    "end": 5644.372,
    "text": "How is error propagated through a system or back propagated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5645.392,
    "end": 5656.415,
    "text": "Which is why I liked it there in the processing because you can't legitimately process that information without knowing how the message is going to be passed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5656.535,
    "end": 5664.357,
    "text": "If you're only going to get every fourth letter of the message I pass, well, I'm going to encode my message in every fourth letter, not in every",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5664.992,
    "end": 5672.807,
    "text": " single letter um and that that changes right okay thanks yes so we have message passing now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5674.386,
    "end": 5688.336,
    "text": " as part of the philosophical concept of systems that engage in holistically considered predictive processing, because it connects what biological systems are doing with some idea about like information sharing without any formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5688.716,
    "end": 5696.502,
    "text": "But then message passing via the Forney factor graphs is gonna be in the Bayesian side because that's like the implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5696.522,
    "end": 5700.385,
    "text": "So maybe message passing here, yeah, it's like on the sort of predictive coding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5701.997,
    "end": 5703.42,
    "text": " implementational side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5703.921,
    "end": 5712.977,
    "text": "Whereas we're not saying biological systems are doing 40 factor graphs and message passing in that technical sense, but for sure we can think about it in this qualitative way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5713.478,
    "end": 5713.679,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.185,
    "end": 5727.607,
    "text": " So we have action in the center and then kind of bifurcated it to include action and inference, AKA active inference for a few reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5728.347,
    "end": 5734.448,
    "text": "First off, action is not just blind flailing action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5735.388,
    "end": 5744.19,
    "text": "When we talk about planning as inference and inference on action and inference about future latent states and observations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5745.438,
    "end": 5750.8,
    "text": " that aren't explicitly about action, but we know in active inference that they actually do condition on action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5751.24,
    "end": 5765.565,
    "text": "So inference and action, how we think and how we act, how the entity's cognitive model is, and how the entity's behavior is through time, those two are like an inseparable dual, and that's why active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.465,
    "end": 5767.905,
    "text": " says it all in the title.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5768.705,
    "end": 5773.086,
    "text": "It's about action and inference and all of the ways that they are related to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5773.446,
    "end": 5795.031,
    "text": "Again, whether it's like planning as inference about future action or inference on the consequences of action, or it's inference about something that isn't explicitly action itself, like what is the temperature, but it requires or is conditioned upon policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5795.831,
    "end": 5822.299,
    "text": " in this framework not the only way to look at it but that's how they come together in active inference and like let's peep over to 4.5 where they introduce action formally the basic approach to including action within the predictive coding framework is to simply minimize the variational free energy with respect to action free energy is not explicitly a function of action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5823.672,
    "end": 5830.759,
    "text": " up until equation 51, it can be made so implicitly by noticing the dependence of sensory observations on action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5831.419,
    "end": 5841.348,
    "text": "So if your future sensory observations don't depend on action or don't depend on that kind of action, this is like an extraneous calculation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5841.869,
    "end": 5843.931,
    "text": "Like if you have a coin flip and you're rolling a dice,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5845.109,
    "end": 5848.711,
    "text": " and they don't influence each other, then they're conditionally independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5849.271,
    "end": 5858.977,
    "text": "And so there's no need to calculate the joint distribution if you're just interested in the coin flip, because it's not having a causal relationship with the rolling the die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5860.337,
    "end": 5869.783,
    "text": "However, if we're going to have agency or model systems that appear to have agency, then there's some kind of dependence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5870.76,
    "end": 5874.061,
    "text": " on future sensory observations related to action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5874.821,
    "end": 5883.464,
    "text": "In the visual case, the visual input is conditioned upon the ocular motor decisions, and those are actions of a musculoskeletal system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5884.464,
    "end": 5892.186,
    "text": "And then the way that it gets tucked into the equations is the change in action with respect to time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.433,
    "end": 5900.161,
    "text": " is gonna be related to a gradient, so like a partial differential equation, but then it's amenable to gradient descent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5900.842,
    "end": 5906.949,
    "text": "It's gonna be like a partial derivative of free energy and how it changes with respect to action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.089,
    "end": 5914.512,
    "text": " So like, am I minimizing free energy by steering the wheel more to the left or by steering the wheel more to the right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5914.872,
    "end": 5921.014,
    "text": "That's like DF over DA, change in free energy over change in action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.775,
    "end": 5923.716,
    "text": "And then free energy F here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5924.816,
    "end": 5936.519,
    "text": " is a function not just of the joint distribution of O and mu, not just a joint distribution of the observations on the thermometer and the mean estimate of temperature in the room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5937.159,
    "end": 5939.62,
    "text": "That's kind of the pure inference take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5940.22,
    "end": 5947.982,
    "text": "But again, we're suggesting that sensory observations have a dependence, could be partial, could be complete, on action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5948.382,
    "end": 5952.983,
    "text": "And so now observations themselves are a function of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5953.905,
    "end": 5956.826,
    "text": " And then that can be unpacked a little bit more in 51.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5957.987,
    "end": 5961.208,
    "text": "And they discuss it further, of course, in the paper and elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5961.749,
    "end": 5968.212,
    "text": "But that's like how this inferential framework gets built in predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5969.452,
    "end": 5975.155,
    "text": "And then action becomes introduced as something that inference can be about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5976.095,
    "end": 5979.477,
    "text": "And that's what they say allows for predictive coding agents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5980.714,
    "end": 5984.957,
    "text": " to undertake adaptive actions without any major change to their fundamental algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5985.858,
    "end": 5997.526,
    "text": "It's not like there was the temperature thermometer module and then now there's this totally ad hoc decision-making module that's bringing in all this thing about, well, what is the reward of different temperatures?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5997.827,
    "end": 6000.308,
    "text": "What is the reward of different thermometer observations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6001.266,
    "end": 6012.732,
    "text": " Rather, within this same parsimonious and first principles inference framework, we can model active inference, which is inference including action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6019.655,
    "end": 6023.277,
    "text": "Let's kind of continue on this action theme, but then we'll end in a few minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6024.417,
    "end": 6027.339,
    "text": "So under such a scheme, the prediction error",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6028.703,
    "end": 6032.986,
    "text": " becomes the difference between the current observation and the target or set point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6034.187,
    "end": 6037.91,
    "text": "That raises the question of where these set points and targets come from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6038.959,
    "end": 6046.121,
    "text": " And that's where they just sort of have that road leading off into the distance saying, well, in the evolutionary case, it's inherited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6047.062,
    "end": 6050.063,
    "text": "In the computational case, it's just simply there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6050.463,
    "end": 6055.144,
    "text": "It could be just a priori speculated or it could have been a parametric empirical base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6055.845,
    "end": 6065.548,
    "text": "So that's one really interesting point is like when you do introduce action, you have to discuss not just the target or the set point and how it's generated,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6066.368,
    "end": 6073.832,
    "text": " But also, you have to make explicit in the forward model, as they write, the dependence of the observations upon action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6074.332,
    "end": 6076.213,
    "text": "And that has to be provided or learnt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6076.853,
    "end": 6086.738,
    "text": "Because just that temperature thermometer model is not going to include a forward model of what happens when you turn on the heater or when you put on a jacket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6087.118,
    "end": 6088.199,
    "text": "So that's something that has to be learnt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6089.019,
    "end": 6095.623,
    "text": " And then a second interesting thing that starts to come out of their framing here is like the costs of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6096.143,
    "end": 6116.514,
    "text": "And that closes the loop really well with a discussion that you raised of like Barlow and the information efficiency argument for why the brains ought to be doing something, something like predictive coding, efficient signal transfer, and hence why it's either what they ought to or are doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6117.99,
    "end": 6146.051,
    "text": " or and how we ought to or could model it so that's why the costs of this are important cost of action are important and then just one last piece in four or five was active inference in the pid control which is related to the generalized coordinates of motion and we unpacked that a lot in live stream number 26 with the bayesian mechanics paper of da costa at all and this connects",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6146.929,
    "end": 6163.414,
    "text": " control in active inference systems to a very commonly used engineering framework for controlling processes, which is PID control, which is framing action through time as being related to these three terms, which are described above.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6166.345,
    "end": 6182.857,
    "text": " That's how they brought action into this paper was by spending many of the early sections providing like the single layer predictive coding model and connecting that to variational Bayes that was in like sections two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6183.905,
    "end": 6201.861,
    "text": " And then in section three, and also in section two, they explored all these different interesting generalizations, the spatial case, the hierarchical case, and then they also connected it to biological systems and reviewed some evidence for predictive coding of different kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6202.562,
    "end": 6204.003,
    "text": "And then in section four,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6204.884,
    "end": 6217.988,
    "text": " when they connect to several other inference algorithms, like predictive coding and the back propagation of error, linear predictive coding and the Kalman filter, normalization and the normalizing flows, which we didn't talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6218.708,
    "end": 6222.049,
    "text": "Predictive coding as biased competition, also something we didn't talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6222.509,
    "end": 6230.011,
    "text": "And then after all of that action gets tucked into the picture, and it's just like very clean in a very elegant way,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6230.911,
    "end": 6238.187,
    "text": " to think about it and helps us understand like maybe even how active inference is similar or different to some of these other frameworks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6241.531,
    "end": 6256.137,
    "text": " So in the spirit of our layer cake, I think today like we covered, if this paper is a sandwich, we covered both slices of bread, like the very beginning and the very end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6256.497,
    "end": 6260.238,
    "text": "But we left out like all of the things that kind of come in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6260.258,
    "end": 6261.939,
    "text": "The meat and potatoes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6263.379,
    "end": 6265.1,
    "text": "Have you had potatoes on a sandwich ever?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6265.12,
    "end": 6270.542,
    "text": "They do it with some French fries sometimes, but I know what you mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6272.264,
    "end": 6272.844,
    "text": " Go to Subway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6272.884,
    "end": 6276.107,
    "text": "I'm going to go to Subway and be like, yeah, can I get some potatoes on my sub?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6277.668,
    "end": 6279.329,
    "text": "Can I have a predicting coding special?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6279.349,
    "end": 6285.213,
    "text": "And then they go, what do you expect is going to be on this sandwich?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6286.954,
    "end": 6295.56,
    "text": "It would be cool next week to really kind of dive in more to error, back propagation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6295.58,
    "end": 6299.543,
    "text": "Predictions are sent up and errors sent down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6299.563,
    "end": 6301.865,
    "text": "Or is it the other way around?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6303.255,
    "end": 6307.796,
    "text": " and really kind of discuss these computational graphs that they start to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6308.257,
    "end": 6313.338,
    "text": "So I think next week would be really cool to kind of dive into what's inside of the sandwich.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6313.958,
    "end": 6314.498,
    "text": "Oh, awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6314.658,
    "end": 6316.959,
    "text": "Okay, so we'll definitely go into some.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.139,
    "end": 6320.38,
    "text": "So what's inside the sandwich?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6322.44,
    "end": 6328.922,
    "text": "Backpropagation of error, biological evidence and examples,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6330.359,
    "end": 6335.344,
    "text": " So I think there's a ton of exciting stuff that we'll be able to talk about next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6336.425,
    "end": 6345.153,
    "text": "Like the different paradigms, like we could cover figure three, the paradigms of predictive coding and the normalizing flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6345.673,
    "end": 6348.576,
    "text": "So we definitely, we covered the bread today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6348.596,
    "end": 6348.656,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6353.002,
    "end": 6372.329,
    "text": " um well anyone who's listening we really appreciate it look forward to your comments on the video or joining us next week if that's gonna work and blue this was like super interesting and very helpful so i think it's a great dot one and it's funny because like dot one it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6373.889,
    "end": 6396.849,
    "text": " it's the meat and potatoes of the 012 sandwich so it's like our middle of the bottom of the bathtub phase the dot one where we're opening up all these ideas and just trying to like give a second coat of paint on a few things go into a few technicalities re-represent some knowledge it's like that was in a very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6398.373,
    "end": 6405.934,
    "text": " paradoxical or delightful way about not the potatoes itself, but rather about the beginning and the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6406.615,
    "end": 6415.136,
    "text": "Well, to be fair, for those of you who haven't yet read the paper, there's like 60 equations and like 55 pages plus an appendix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6415.756,
    "end": 6425.338,
    "text": "So no surprise that we covered the bread, but it would be cool to tear apart a little bit of what's inside of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6425.948,
    "end": 6429.031,
    "text": " the paper, because I think that these layers are cool and important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6429.171,
    "end": 6431.933,
    "text": "And the paradigms of predictive coding were super interesting to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6432.033,
    "end": 6437.857,
    "text": "And I love like the intersection between the brain and machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6437.877,
    "end": 6443.141,
    "text": "And I learned a lot, um, reading this paper, especially like I was taking neuroscience classes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6443.201,
    "end": 6447.845,
    "text": "I'm going to say how old I am right now, but I was taking like neuro in college at like, at like in 2003, probably maybe 2004.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6452.192,
    "end": 6464.645,
    "text": " With no idea, learning about, you know, the work of Rao and Ballard and Hubel and Wiesel and all of these, you know, centers around like visual experiments with no idea like how new they were.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6464.665,
    "end": 6469.69,
    "text": "No idea like how new of an idea it was like the processing process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6470.06,
    "end": 6476.086,
    "text": " through the visual cortex, really like I didn't know how cutting edge the work I was learning about was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6476.386,
    "end": 6484.895,
    "text": "So it's cool to kind of have that framed for me and put in perspective and yeah, all the building upon that that's been done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6485.195,
    "end": 6485.656,
    "text": "It's nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6485.676,
    "end": 6487.377,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6487.958,
    "end": 6493.083,
    "text": "Thank you very much Blue and everybody else who's participating and see you next week.",
    "speaker": "SPEAKER_01"
  }
]