[
  {
    "start": 26.971,
    "end": 28.733,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.514,
    "end": 40.867,
    "text": "It's April 28th, 2022 and we're here in Act-Inf Lab live stream number 43.0 discussing predictive coding, a theoretical experimental review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.366,
    "end": 65.363,
    "text": " welcome to the actinv lab we're a participatory online lab that is communicating learning practicing applied active inference you can find us at links here on the slide this is recorded in an archived live stream so please provide us with feedback so we can improve our work all backgrounds and perspectives are welcome and we'll be following video etiquette for live streams",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.827,
    "end": 76.104,
    "text": " Head over to ActiveInference.org if you want to learn more about how to participate in the live streams or anything else happening in Act In Flat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.288,
    "end": 78.529,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.502,
    "end": 102.848,
    "text": " we're here today to learn and discuss the paper predictive coding a theoretical and experimental review by baron millage anil seth and christopher buckley the video is just an introduction and a contextualization for some of the ideas and some of the details of the paper and the broad sense it's not a review or a final word",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.568,
    "end": 125.983,
    "text": " It's, as with some of these other technical dense papers, it's like an opening for those who have technical questions at the learning side of things or at the more advanced research side of things to come get involved because this is a technical paper, but also hopefully as we'll unpack, it has a lot of cool biological and philosophical implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.608,
    "end": 139.694,
    "text": " So in 43.0, we're going to say hello and introduce some big questions, then cover the aims and claims of the paper, the abstract and the roadmap, and then pretty much just jump right in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.714,
    "end": 146.617,
    "text": "And we're going to focus a lot on the introduction, the context, and the single layer predictive coding model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.117,
    "end": 156.502,
    "text": "And then we'll go a little bit faster through the later sections of the paper, talking about some generalizations of predictive coding and some important points that the authors raise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.102,
    "end": 162.726,
    "text": " So if you want to participate in 43.1 or 43.2 in the coming weeks, just let us know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.047,
    "end": 178.657,
    "text": "Okay, so we can say hello and give any information that we'd like and also just maybe something that we thought was exciting or something that motivated us to get involved in this quite involved paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.457,
    "end": 196.307,
    "text": " So I'm Daniel, I'm a researcher in California, and I was curious to learn more about how predictive coding and predictive processing related to active inference, and also just about how different models framed anticipatory systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.968,
    "end": 198.189,
    "text": "So over to you, Maria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.071,
    "end": 203.572,
    "text": "Hello, Daniel and everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.276,
    "end": 214.204,
    "text": " I have a bachelor degree in psychology and I am a master's candidate in philosophy of science in the University of São Paulo, Brazil.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.105,
    "end": 222.712,
    "text": "And I am researching the relationship between predictive processing and illusionist theories of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.453,
    "end": 225.975,
    "text": "And I think what brought me here today was...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.843,
    "end": 251.128,
    "text": " my wish to start learning about the formalisms because I don't really see it in philosophy and I don't actually need it for my dissertation but eventually I wanted to continue my work on predictive processing so eventually I had to start it and I just thought well maybe that's a good idea to come here and minimize my uncertainties",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.443,
    "end": 255.524,
    "text": " Awesome, through inference and or through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.944,
    "end": 258.865,
    "text": "And also thanks a lot, Brock, for helping in the dot zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.185,
    "end": 262.186,
    "text": "So we'll just start with the big questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.266,
    "end": 270.228,
    "text": "And these are the kind of questions that might motivate someone or interest them in this paper without even mentioning active inference per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.248,
    "end": 272.528,
    "text": "But these are like some big questions that get touched upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.288,
    "end": 275.549,
    "text": "What is the formal basis of predictive coding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 276.409,
    "end": 278.95,
    "text": "How is predictive coding used or useful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.89,
    "end": 282.651,
    "text": " What are some areas of current and future development?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.331,
    "end": 287.112,
    "text": "And what is the relationship between predictive coding and active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.733,
    "end": 290.073,
    "text": "And hopefully we'll draw out more questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.734,
    "end": 292.534,
    "text": "Anything else to add about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.096,
    "end": 297.676,
    "text": "No, not really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.623,
    "end": 304.726,
    "text": " The paper is Predictive Coding, A Theoretical and Experimental Review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.126,
    "end": 313.711,
    "text": "I think the first version was from 2021, but the second revised version was 22 by Millage, Seth, and Buckley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.172,
    "end": 328.321,
    "text": "And just to review the core claim and then some of the aims and directions they set out, they write that no comprehensive review of predictive coding theory and especially of recent developments in the field exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.701,
    "end": 329.722,
    "text": "That's their claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.297,
    "end": 338.722,
    "text": " And then they aim towards providing a comprehensive review, both of the core mathematical structure and logic of predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.302,
    "end": 344.746,
    "text": "So there's a mathematical review and summarization aspect to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 345.547,
    "end": 360.977,
    "text": "And then they also review a wide range of classic and recent work within the framework, ranging from biologically realistic microcircuits that could implement predictive coding to the close relationship between predictive coding and the widely used back propagation of error algorithm,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.657,
    "end": 367.383,
    "text": " as well as surveying the close relationship between predictive coding and modern machine learning techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.026,
    "end": 372.508,
    "text": "That's how they set out where they want to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.809,
    "end": 376.973,
    "text": "Would you like to read the first slide of the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.956,
    "end": 380.256,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.725,
    "end": 395.89,
    "text": " predictive coding offers a potentially unifying account of cortical function, postulating that the core function of the brain is to minimize prediction errors with respect to a generative model of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.11,
    "end": 407.334,
    "text": "The theory is closely related to the Bayesian brain framework and, over the last two decades, has gained substantial influence in the fields of theoretical and cognitive neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.031,
    "end": 430.416,
    "text": " A large body of research has arisen based on both empirically testing improved and extended theoretical and mathematical models of predictive coding, as well as in evaluating the potential biological plausibility for implementation in the brain and concrete neurophysiological and psychological predictions made by the theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 431.314,
    "end": 445.278,
    "text": " Despite this enduring popularity, however, no comprehensive review of predictive coding theory and especially of recent developments in this field exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.938,
    "end": 455.581,
    "text": "Here we provide a comprehensive review of both of the core mathematical structure and logic of predictive coding, thus complementing recent tutorials in the literature,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.753,
    "end": 464.26,
    "text": " And we also review a wide range of classic and recent work within the framework, which is what we had read previously in the aims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.5,
    "end": 466.442,
    "text": "So that's how the authors describe their own work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.102,
    "end": 472.047,
    "text": "And now we're going to see their roadmap, see how they went about getting there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.507,
    "end": 476.811,
    "text": "And then we're going to jump right into the introduction and then the formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.833,
    "end": 480.574,
    "text": "So here we see the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.704,
    "end": 485.046,
    "text": " and the rough outline of the paper is as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.847,
    "end": 495.592,
    "text": "Section one provides an introduction that contextualizes predictive coding and we'll also be unpacking it in a philosophical and historical view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.053,
    "end": 510.742,
    "text": "Section two provides an initial pass on the one level predictive coding model, sort of the kernel or the archetype or the motif of predictive coding and connects it importantly to variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.587,
    "end": 518.111,
    "text": " Then predictive coding is generalized or extended or elaborated in a few important directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.651,
    "end": 523.033,
    "text": "So like in section 2.2, it's generalized into a multi-level case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.594,
    "end": 527.656,
    "text": "In section 2.3, the concept of generalized coordinates are introduced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.056,
    "end": 531.478,
    "text": "In section 4, precision is introduced as a concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.918,
    "end": 534.66,
    "text": "And in section 2.5, it's connected back to the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.28,
    "end": 547.17,
    "text": " Section three discusses paradigms of predictive coding, both unsupervised and supervised, and also connects it through those sections and others to some research in machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.971,
    "end": 554.436,
    "text": "And then in section four, there's connections between predictive coding and some other algorithms,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.56,
    "end": 568.605,
    "text": " both those algorithms that are common in machine learning and computational statistics, like the error backpropagation, linear predictive coding and common filtering and normalizing flows and biased competition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.305,
    "end": 570.365,
    "text": "And then in section 4.5,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 572.066,
    "end": 581.492,
    "text": " explicit connection is drawn between predictive coding and active inference, which brings in the cost of action as well as the idea of PID control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.032,
    "end": 588.176,
    "text": "And the discussion section closes with just a few other thoughts and summaries and directions and challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 589.096,
    "end": 614.925,
    "text": " there's several appendices so it's a long ish paper or monograph but it's an excellent paper and we're just going to cover more of an emphasis on the context and the beginning and then sort of skip over or trail off over a few things but there's a lot to unpack so i hope that we can like learn more in the coming weeks if the authors want to join or if anybody else wants to join",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.102,
    "end": 620.304,
    "text": " Anything to add on roadmap or ready for introduction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.286,
    "end": 622.606,
    "text": "Let's go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.626,
    "end": 623.547,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.807,
    "end": 624.047,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.112,
    "end": 633.854,
    "text": " So I'll just add some notes from this section of the introduction and then Maria, feel free to add anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.514,
    "end": 636.995,
    "text": "So how do they introduce predictive coding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.595,
    "end": 647.558,
    "text": "They introduce predictive coding theory as an influential theory in computational and cognitive neurosciences, which proposes a potential unifying theory of cortical function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.898,
    "end": 649.999,
    "text": "That's like related to the cortex of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.058,
    "end": 662.091,
    "text": " Namely, that the core function of the brain is to minimize prediction error where the prediction error signals mismatches between predictive input and the input actually received.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.612,
    "end": 667.738,
    "text": "Minimizing the divergence between expectations and observations is going to be a big theme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.795,
    "end": 675.278,
    "text": " And approaching that minimization, it can be achieved in multiple ways, and they're colored differently here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.139,
    "end": 685.084,
    "text": "Through immediate inference about the hidden states of the world, like I thought the ball was over here, I'm getting evidence it's over here, so I should just update how I think about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.064,
    "end": 706.902,
    "text": " which can explain perception like the perception of a ball moving across the visual field through updating a global world model to make better predictions which could explain learning like learning a little bit higher level than just where the ball is in the visual field but like where balls tend to be in the visual field or how fast they tend to move around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.603,
    "end": 734.755,
    "text": " and finally through action to sample sensory data from the world that conforms to the predictions and that's when we'll introduce action into predictive coding in the latter sections of the paper and then just last point they say that predictive coding boasts an extremely developed and principled mathematical framework in terms of variational inference as well as many empirically tested computational models that have close links to machine learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.737,
    "end": 746.504,
    "text": " So that's how they introduce this is as a unifying theory that integrates inference as well as action, inference of different kinds, more like perceptual and more like learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.225,
    "end": 756.011,
    "text": "And they're saying that it has a very rich mathematical framework and it's been connected to insights in biology and in machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.092,
    "end": 759.033,
    "text": "Anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.516,
    "end": 763.716,
    "text": "Nope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.325,
    "end": 784.791,
    "text": " so they write predictive coding as a theory also offers a single mechanism that accounts for diverse perceptual and neurobiological phenomena such as end stopping by stable perception like illusions repet repetition suppression illusory motions and attentional modulation of neural activity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.251,
    "end": 793.42,
    "text": " So they're pointing to the integrative nature of this theory or framework to model all of these diverse phenomena as being an advantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.56,
    "end": 800.008,
    "text": "Like we could have a special theory for just bistable perception, a special theory for just repetition suppression, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.448,
    "end": 805.354,
    "text": "But this is a framework by which those outcomes are occurring as kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.761,
    "end": 812.009,
    "text": " outcomes of an underlying framework predictive coding rather than needing special theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.089,
    "end": 818.48,
    "text": "So that kind of like parsimony or consilience is pursued in the areas like cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.592,
    "end": 839.495,
    "text": " And they write, as such, and perhaps uniquely among neuroscientific theories, predictive coding encompasses all three layers of Mars hierarchy by providing well-characterized and empirically supported view of what the brain is doing at all of the computational, algorithmic, and implementational levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.316,
    "end": 864.988,
    "text": " so mars very influential hierarchy it's kind of like tinbergen's questions or a little bit like maslow's hierarchy you can think of it as like an organizing or a sense making framework again to the question what are brains doing and so we're going to have like three different kinds of answers to what brains are doing there's going to be an answer at the level of computation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.928,
    "end": 867.729,
    "text": " algorithm and implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.489,
    "end": 874.191,
    "text": "And so here with the example of a bird flying, the computational level is like flight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.652,
    "end": 875.452,
    "text": "It's like the why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.972,
    "end": 877.072,
    "text": "What is the algorithm doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.273,
    "end": 878.613,
    "text": "It's a sorting algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.173,
    "end": 881.034,
    "text": "What is the brain doing in this situation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.614,
    "end": 883.275,
    "text": "It's tracking a moving object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.773,
    "end": 894.759,
    "text": " Then there's the flapping level, which is the algorithm, which is kind of like pseudocode, and that's suggesting the what of how that why is realized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.799,
    "end": 897.441,
    "text": "Like what is happening in this sorting algorithm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.801,
    "end": 899.942,
    "text": "Well, it's doing this, this, this, this, this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.463,
    "end": 902.804,
    "text": "What is the flight function being realized by?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.204,
    "end": 905.145,
    "text": "It's being realized by flapping of the wings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.846,
    "end": 907.687,
    "text": "And then there's the implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.047,
    "end": 910.569,
    "text": "So it's not just the flapping of anything,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.289,
    "end": 931.943,
    "text": " it's the flapping of something specific and so that's the implementational details and those levels of analysis have been helpful and provocative in connecting computational cognitive theories to neurobiological theories so it's been a very influential and um discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.752,
    "end": 941.423,
    "text": " provoking framework that has helped people connect as well as challenge some of the similarities and differences between computers and brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.389,
    "end": 945.549,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.663,
    "end": 959.045,
    "text": " This is still in the introduction and they're going to kind of give us a qualitative perspective on predictive coding and then we're going to be diving into a lot more historical and technical detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.645,
    "end": 961.306,
    "text": "But how does predictive coding work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.106,
    "end": 972.848,
    "text": "The core intuition behind predictive coding is that the brain is composed of a hierarchy of layers which are each making predictions about the activity of the layer immediately below them in the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.348,
    "end": 980.672,
    "text": " So there's two directions in this predictive coding multilayer scheme, which we're just introducing here as kind of a heuristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.252,
    "end": 984.954,
    "text": "And then we're going to zoom in to just what's happening at one level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.335,
    "end": 989.357,
    "text": "And then we're going to pull back out to kind of recovering this multilevel formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.356,
    "end": 999.7,
    "text": " The downward descending predictions at each level, that's the blue arrow, are compared with the activity and inputs of each level to form prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.261,
    "end": 1004.242,
    "text": "This is the information in each layer which could not be successfully predicted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.243,
    "end": 1015.728,
    "text": "These prediction errors are then fed upwards, that's the red arrow, to serve as inputs to higher levels, which can then be utilized to reduce their own prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.809,
    "end": 1018.45,
    "text": " So that's kind of the bigger picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.63,
    "end": 1026.133,
    "text": "Like the idea at the top level is like, I'm tracking a soccer ball that's moving from the left to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.974,
    "end": 1029.315,
    "text": "And then that gets transduced in certain ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.755,
    "end": 1038.559,
    "text": "And that is in this case, resulting in kind of a visual perceptive level prediction about what one should expect to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.4,
    "end": 1045.783,
    "text": "And this is again, just the multi-level predictive coding scheme that is often used, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.735,
    "end": 1052.539,
    "text": " We're going to zoom back to just what's happening at a single level, and then what is happening at multiple levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.201,
    "end": 1057.462,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.542,
    "end": 1065.667,
    "text": "Here's a fun 2018 paper by Carl Friston, Does Predictive Coding Have a Future?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.667,
    "end": 1070.55,
    "text": "And this is going to provide just a little bit of context, and then we're going to jump more into, though,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.701,
    "end": 1076.125,
    "text": " Carl wrote, in the 20th century, we thought the brain extracted knowledge from sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.586,
    "end": 1078.087,
    "text": "That's like the recognition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.287,
    "end": 1082.131,
    "text": "And that's sort of the incoming sensory processing model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.911,
    "end": 1093.461,
    "text": "The 21st century witnessed a strange inversion in which the brain became an organ of inference, actively constructing explanations for what's going on out there beyond its sensory epithelia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.222,
    "end": 1097.104,
    "text": "One paper played a key role in this paradigm shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.865,
    "end": 1107.937,
    "text": " and carl goes on to write that a 1999 paper by rao and ballard which we're going to talk more about for him was one of those papers that's a once in a decade find",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.491,
    "end": 1137.774,
    "text": " So we're going to talk more about it, but this is just kind of connecting it early to Carl Friston's line of research, the connection between active inference and predictive coding, and the idea that sometimes it's these early transdisciplinary papers that can stitch two different fields together, and that that can have long-term consequences for essentially perennial questions like how do perception, learning, attention, and sensation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.354,
    "end": 1142.857,
    "text": " all work together and under what imperative might they work together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.76,
    "end": 1155.327,
    "text": "And then the authors provide a very preliminary discussion that they're going to go into more later about how predictive coding matters for machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.327,
    "end": 1166.255,
    "text": "And so they write, predictive coding proposes that using a simple unsupervised lost function, such as simply attempting to predict incoming sensory data,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.685,
    "end": 1172.55,
    "text": " is sufficient to develop a complex general and hierarchically rich representations of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.07,
    "end": 1184.356,
    "text": " They're suggesting that this has found support in the successes of modern machine learning models that are trained on unsupervised predictive or autoregressive objectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.076,
    "end": 1186.998,
    "text": "So here's some of the papers that they cite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.038,
    "end": 1189.779,
    "text": "This is the Brown et al and the Kaplan et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.5,
    "end": 1199.285,
    "text": "And these both have to do with the training of what are increasingly becoming important modern machine learning methods, which are the language models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.99,
    "end": 1207.238,
    "text": " In contrast to modern machine learning algorithms, which are trained to end with a global loss at the output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.26,
    "end": 1214.148,
    "text": "So, given the total big dataset, give me the lowest total error on the whole dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.717,
    "end": 1224.979,
    "text": " In predictive coding, prediction errors are computed at every layer, which means that each layer only has to focus on minimizing local errors than global loss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.799,
    "end": 1234.201,
    "text": "This property potentially enables predictive coding to learn in a biologically plausible way using only local and Hebbian learning rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.821,
    "end": 1238.702,
    "text": "And this is going to connect to common filtering and PID control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.562,
    "end": 1246.586,
    "text": " So they're kind of laying out the land and showing where they're going to connect in the introduction very, very qualitatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.146,
    "end": 1258.753,
    "text": "And then again, we're going to zoom back down to find out what's happening at one level of predictive coding, and then try to rebuild some of the formalisms related to Kalman filtering and PID control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1259.853,
    "end": 1286.017,
    "text": " and the bigger questions that people might be curious about asking would be like what does it mean for computation to be biologically inspired what is possible when we're thinking about some of the similarities and differences and complementarities between biological and different kinds of conventional and unconventional computation the next",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.236,
    "end": 1297.977,
    "text": " heart maria please take it away i'll be changing slides so thanks a lot for adding a lot of the historical context and looking forward to learning about what you have to share here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.0,
    "end": 1311.228,
    "text": " Okay, so this is actually the paragraph that is in the paper, okay, that they start talking about the history of predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1311.728,
    "end": 1323.297,
    "text": "So, while predictive coding as a neuroscientific theory originated in the 80s and 90s with Monfort, Rowe and Ballard, Schneveson...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.178,
    "end": 1338.342,
    "text": " or something, Laughlin and Dubs, and was first developed into its modern mathematical form and comprehensive theory of cortical responses in the mid-2000s with Friston, it has deep intellectual antecedents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.042,
    "end": 1351.066,
    "text": "These precursors include Helmholtz's notion of perception as an unconscious inference and Kant's notion that a priori structure is needed to make sense of sensory dictum, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.855,
    "end": 1358.257,
    "text": " and as well as early ideas of compression and feedback control in cybernetics and information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.537,
    "end": 1374.302,
    "text": "And on the next slides, I will be talking a little bit more about history and philosophy of predictive coding, and then some core formalisms and various generalizations and elaborations of predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.823,
    "end": 1381.484,
    "text": "If there is anything you want to say, Daniel, just feel free to jump in, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.192,
    "end": 1388.536,
    "text": " So, the historical and philosophical background of perception is huge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.397,
    "end": 1396.962,
    "text": "However, seen in the context of predictive coding framework, authors usually come up with a similar reasoning about perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.283,
    "end": 1406.069,
    "text": "And then we can start thinking with the Greek philosopher Plato on his Allegory of the Cave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.443,
    "end": 1422.757,
    "text": " from 514 to 520 before Christ, which he said basically that some people would be trapped in a cave forever watching shadows cast by objects moving near a fire behind them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.417,
    "end": 1429.963,
    "text": "And then they would like be there forever, have children that would grow like that inside the cave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.083,
    "end": 1433.486,
    "text": "And, you know, eventually these shadows would,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.086,
    "end": 1440.512,
    "text": " from the objects near fire behind them would be the real thing and the only thing for these people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.852,
    "end": 1446.257,
    "text": "They wouldn't believe that there is anything outside the cave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.437,
    "end": 1448.939,
    "text": "So this would be it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.38,
    "end": 1450.841,
    "text": "These shadows would be the only thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.882,
    "end": 1466.054,
    "text": " So what Plato would claim here is that our own conscious perceptions are just like these shadows, meaning that they are indirect reflections of hidden causes that we can never directly encounter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.137,
    "end": 1473.66,
    "text": "A few centuries later, the Arab medieval scholar",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.173,
    "end": 1479.596,
    "text": " Al-Hazen wrote a lot of interesting notes on visual perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.676,
    "end": 1499.686,
    "text": "Actually, he wrote six volumes, if I'm not mistaken, of his book of optics, where he explored the view that human perception often depends on mechanisms of judgment and inference instead of providing access straight to the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.207,
    "end": 1514.114,
    "text": " You can see that very early in our Western thinking, we have this notion that we do not have direct access to the world, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.134,
    "end": 1516.736,
    "text": "That there is some inference going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.917,
    "end": 1520.177,
    "text": "Okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.799,
    "end": 1523.999,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.2,
    "end": 1524.48,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.32,
    "end": 1537.664,
    "text": " Jumping to the 18th century, we can find two important philosophers, the English David Hume and the German Immanuel Kant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1537.684,
    "end": 1544.066,
    "text": "Hume, in 1739 to 1740, explored the inductive inferences and causation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.986,
    "end": 1552.909,
    "text": "The problem of induction that he brought was an analysis of cause and effect in perception and the conclusion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1554.245,
    "end": 1576.992,
    "text": " that he gets is that all our mental life could be traced back to the effects of such experience because since we do not have direct contact with the world we could never have one-to-one relationship with the objects there and therefore it is possible to have one effect with many possible causes and one cause with many effects",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.746,
    "end": 1595.469,
    "text": " The solution here would be then extracting statistical regularities and imagining what happens when the world is intervened upon a controlled manner, as the philosopher Jacob Howie developed in his book, The Predictive Mind, in 2014.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.169,
    "end": 1607.451,
    "text": "Equally important in the critique of pure reason in 1781, Kant will add an important element to this story among",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.776,
    "end": 1610.077,
    "text": " you know, countless other elements to this story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.638,
    "end": 1624.887,
    "text": "He will add that the brain uses existing information regarding space and time to make sense of the chaotic sensory data it constantly receives to provide an organism the perception as they know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.889,
    "end": 1644.741,
    "text": " So all of these scholars would tell us right in the early ages that we do not have direct access to the things in the world and we need pre-existing information to make sense of all the data we constantly receive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.922,
    "end": 1647.743,
    "text": "Lots of predictive coding stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.788,
    "end": 1671.417,
    "text": " It really makes me wonder why it's sometimes still so ineffable or poorly understood or even seen as controversial, some of these perspectives which have been, as you are describing, thought of and convergently come to for many thousands of years in different cultures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.517,
    "end": 1672.497,
    "text": "So really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.879,
    "end": 1676.079,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.235,
    "end": 1689.583,
    "text": " In the late 19th century, the German scientist Hermann von Helmholtz in 1860 depicted perception as involving probabilistic inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.704,
    "end": 1694.206,
    "text": "He is one of our gods in the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.748,
    "end": 1698.85,
    "text": "He was really inspired by Kant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.992,
    "end": 1712.319,
    "text": " With that inspiration, he developed the idea of the brain as a hypothesis tester and that perception is a process of unconscious inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1712.379,
    "end": 1724.868,
    "text": "More specifically, this idea that he developed in experiments was that perception has to be inferred by combining sensory signals with the brain expectations and beliefs about their causes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.44,
    "end": 1729.921,
    "text": " Such inferences happen without the subject's awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.221,
    "end": 1733.661,
    "text": "I mean, it has to happen without the subject's awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1733.941,
    "end": 1743.723,
    "text": "Because, you know, imagine all the chaotic sensory data coming and you open your eyes and you have to try to organize everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.743,
    "end": 1745.343,
    "text": "I mean, it doesn't happen that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.423,
    "end": 1749.244,
    "text": "You just open your eyes and everything is still stable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.324,
    "end": 1752.485,
    "text": "And so, it's unconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.265,
    "end": 1753.405,
    "text": "And...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.986,
    "end": 1764.492,
    "text": " it needs to keep track of the causes in the world by updating perceptual best guesses, or you can say hypothesis, as new sensory signals arrive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.333,
    "end": 1782.704,
    "text": "So here he built the idea that we use sensory signals with the brain expectations to update the hypothesis we make for the causes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.669,
    "end": 1786.219,
    "text": " of the effects we receive in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.448,
    "end": 1804.7,
    "text": " And this means that he somehow turned Hume's and Kant's insights scientific, claiming that we can only infer things out there in the world behind a sensory veil, which, if I'm not mistaken, will be eventually called Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.801,
    "end": 1806.681,
    "text": "Is that right, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.362,
    "end": 1807.682,
    "text": "Not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.824,
    "end": 1810.504,
    "text": "Maybe unveiled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.325,
    "end": 1815.948,
    "text": "Hamholtz was crucial to many different works in machine learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.528,
    "end": 1819.53,
    "text": " one that was even nicely named as Helmholtz machine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1820.11,
    "end": 1824.112,
    "text": "He was crucial in psychology, neuroscience, cognitive science, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.972,
    "end": 1845.403,
    "text": "Particularly in psychology, Helmholtz's insights inspired Yuri Schneisser in 1967 and later Richard Gregory in 1980 and Yves Arvin Roque in 1983 to develop the analysis by synthesis approach, which is the process that analyzes a signal or image by reproducing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.167,
    "end": 1847.389,
    "text": " it using a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.532,
    "end": 1857.323,
    "text": "There is a picture of analysis by synthesis approach with some schema available in this link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.316,
    "end": 1876.188,
    "text": " In fact, Gregory built some kind of neurohypothesis testing model based on his Helmholtzian understanding of the brain as continually formulating perceptual hypotheses about the world and testing them by acquiring data from sensory organs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.261,
    "end": 1902.897,
    "text": " okay so many things happened after the analysis by synthesis stuff but i will just jump to what we have in philosophy today because we will touch the formalisms and the computation stuff afterwards okay so i'll just make a jump and go to what we have in philosophy today so uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.461,
    "end": 1913.403,
    "text": " Recent works in philosophy and cognitive neuroscience have contributed to the expansive predictive coding framework and the Bayesian paradigm in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.423,
    "end": 1927.606,
    "text": "And many of the seminal works we have in the field addresses predictive coding as predictive processing without, you know, any relevant difference in the first instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.107,
    "end": 1930.287,
    "text": "And, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.351,
    "end": 1946.231,
    "text": " For instance, the philosopher Jacob Howey, that is based in Monash University, Australia, aimed on the improvement of prediction error minimization mechanism and the concept of winning hypothesis for conscious perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1947.392,
    "end": 1954.618,
    "text": " Also, he is interested in what PPE, predictive processing studies, can bring to people with mental disorders such as autism and schizophrenia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.118,
    "end": 1966.627,
    "text": "Actually, the three of them, of the philosophers here, are interested in what PPE can bring to improvement in psychiatry and medicine in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.147,
    "end": 1975.133,
    "text": "So, in 2014, he published an important textbook on the matter, that is, The Predictive Mind, the red book you can see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.021,
    "end": 1984.328,
    "text": " where he tries to solve the problem of perception inspired on humans' induction problem with Bayesian inference and predictive processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.164,
    "end": 2004.352,
    "text": " Later, in 2016, the philosopher Andy Clarke, based on University of Sussex, England, carefully developed what he called action-oriented predictive processing in his book, Surfering Uncertainty, where he adds and advances the crucial role of action in our perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.393,
    "end": 2014.657,
    "text": "And he makes lots of interesting connections between recent works in computational neuroscience and artificial intelligence and his eclectic philosophy of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2016.036,
    "end": 2037.581,
    "text": " And last year, in 2021, the neuroscientist and USF, one of the authors of this paper we're talking here, and also based at the University of Sussex, made an amazing contribution to the field with his book Being You, where he claims that we are beast machines whose perception is a controlled hallucination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2038.464,
    "end": 2058.852,
    "text": " And he improves consciousness descriptions using predictive processing framework and establishing the real problem of consciousness that, in his own words, requires explaining why a particular pattern of brain activity or other physical process maps to a particular kind of conscious experience, not merely establishing that it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.672,
    "end": 2062.273,
    "text": "Two, you know, philosophers and scientists work on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2063.694,
    "end": 2066.815,
    "text": "And they, here they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2071.138,
    "end": 2071.658,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.04,
    "end": 2074.34,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.4,
    "end": 2081.525,
    "text": "So I was talking about predictive coding, and then I went to predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.585,
    "end": 2082.966,
    "text": "Is there a difference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.087,
    "end": 2089.25,
    "text": "Well, many authors would use the terms freely, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2089.33,
    "end": 2098.376,
    "text": "But then I found Clark saying in his book the difference that he understands from predictive coding to predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2098.962,
    "end": 2108.834,
    "text": " So he puts as the fact that predictive processing is not simply the use of the data compression strategy known as predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2109.375,
    "end": 2115.503,
    "text": "Rather, it is the use of that strategy in a very special context of hierarchical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.024,
    "end": 2120.366,
    "text": " multi-level systems deploying probabilistic generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.106,
    "end": 2135.711,
    "text": "Such systems exhibit powerful forms of learning and deliver rich forms of context-sensitive processing and are able flexibly to combine top-down and bottom-up flows of information within multi-layer cascade.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.042,
    "end": 2152.208,
    "text": " Predictive processing does combine the use within a multi-level bi-directional cascade of top-down probabilistic generic models with the core predictive coding strategy of efficient encoding and transmission.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.209,
    "end": 2155.529,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.53,
    "end": 2166.414,
    "text": "From this, I'm not sure if you agree with me, Daniel, but reading this paragraph makes me wonder, I mean,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2167.378,
    "end": 2177.705,
    "text": " Okay, predictive coding is a local bottom-up, top-down cascade and stuff, but it also is multi-layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.245,
    "end": 2180.947,
    "text": "Yes, it also has some hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.027,
    "end": 2184.569,
    "text": "So I'm not sure what he means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.65,
    "end": 2191.214,
    "text": "I mean, I'm not sure if I understand the difference between predictive coding and predictive processing as he puts it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.618,
    "end": 2195.28,
    "text": " Yeah, very insightful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.362,
    "end": 2198.725,
    "text": "And it made me think about the difference between like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.946,
    "end": 2209.951,
    "text": " coding like programming and like data coding, like Python coding for data and data processing, which is a little bit like it could be multiple computer languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.511,
    "end": 2227.979,
    "text": "And so you're really highlighting something important, which is that when the data are compressed according to a strategy where the errors are being transmitted rather than the actual sort of estimate itself, that's like that information channel is in a predictive coding way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.66,
    "end": 2241.665,
    "text": " And then this helps us use predictive processing for the bigger picture, for systems that implement predictive coding modules, but that's not the only module they're deploying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.186,
    "end": 2245.827,
    "text": "So that'll be something cool to hear people's perspective on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.867,
    "end": 2247.748,
    "text": "Really nice distinction here, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2250.209,
    "end": 2250.429,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2251.43,
    "end": 2258.693,
    "text": "And OK, so I wrote something here that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.121,
    "end": 2273.726,
    "text": " just like you said, that maybe coding would be better to use for formalisms and implementations and processing for the philosophical understanding that prediction is the basis of signal interpretation, e.g.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.766,
    "end": 2275.107,
    "text": "as opposed to descriptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2281.049,
    "end": 2282.07,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.39,
    "end": 2287.672,
    "text": "So, jumping back to formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.675,
    "end": 2293.719,
    "text": " predictive coding in information theory and signal processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.739,
    "end": 2307.811,
    "text": "Okay, so another deep intellectual influence in predictive coding comes from information theory from Shannon in 1948, and especially the minimum redundancy principle of Barlow in 1961, 89, and 61, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.256,
    "end": 2320.38,
    "text": " Information theory tells us that information is inseparable from a lack of predictability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.141,
    "end": 2327.205,
    "text": "If something is predictable before observing it, it cannot give us much information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.345,
    "end": 2328.806,
    "text": "I loved this sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.728,
    "end": 2340.614,
    "text": "Conversely, to maximize the rate of information transfer, the message must be minimally predictable and hence minimally redundant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.38,
    "end": 2353.775,
    "text": " Predictive coding as a means to remove redundancy in a signal was first applied in signal processing, where it was used to reduce transmission bandwidth for video transmission.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.338,
    "end": 2358.16,
    "text": "And do you want to say something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.789,
    "end": 2384.99,
    "text": " i'll just describe this without reading it it was a a common uh and effective although it can be improved on by other methods it's a method for video encoding known as frame differencing where basically uh one frame gets described and then subsequent frames only the pixels that change have to be described so that is a lot like an analogy to predictive coding in the sense that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.811,
    "end": 2392.955,
    "text": " it's able to connect the differences between subsequent time steps and use that to give really only the informative pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.256,
    "end": 2397.778,
    "text": "Like I have a 100-digit number, and then I'm just going to tell you the third digit changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.079,
    "end": 2398.459,
    "text": "Now it's an 8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.439,
    "end": 2406.904,
    "text": "Instead of having to repeat the same number and then 99 of those digits, they're informative, like in the sense that they're good info.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.984,
    "end": 2414.869,
    "text": "It's true, but they're not informative in the information theory context because they were quite predictable before observing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.127,
    "end": 2443.481,
    "text": " Initio Schemes used a simple approach of subtracting the new-to-be-transmitted frame from the old frame, in effect using a trivial prediction that the new frame is always the same as the old frame, which works well in reducing bandwidth in many settings where there are only a few objects moving in the video against a static background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.421,
    "end": 2455.509,
    "text": " And more advanced methods often predict each new frame using a number of past frames weighted by some coefficient, an approach known as linear predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.935,
    "end": 2471.581,
    "text": "OK, so now predictive coding in the eye and the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.035,
    "end": 2482.863,
    "text": " The first concrete discussion of predictive coding in the neural system arose as a model of neural properties of the retina, with Srinivasan .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.6,
    "end": 2503.031,
    "text": " specifically as a model of center-surrounded cells which fire when presented with either a light spot against a dark background on center of surround or alternatively a dark spot against a light background of center on surround cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.991,
    "end": 2514.478,
    "text": "It was argued that this coding scheme helps to minimize redundancy in the visual scheme specifically by removing the spatial redundancy in natural visual scenes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.552,
    "end": 2522.997,
    "text": " that the intensity of one pixel helps predict quite well the intensity of neighboring pixels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.238,
    "end": 2527.84,
    "text": "And then the first picture related to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2527.86,
    "end": 2532.963,
    "text": "Do you want to talk about it or just?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.995,
    "end": 2541.08,
    "text": " We're just going to look at two different tissues of the nervous system that have some predictive elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.94,
    "end": 2546.824,
    "text": "And this is referring to some of the photosensitive cells that are on the retina.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.404,
    "end": 2555.97,
    "text": "And that's work that had been done qualitatively and empirically for hundreds of years, but then was connected to predictive perspectives in the 80s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.171,
    "end": 2564.588,
    "text": " then we're also going to look as you'll now unpack at what's happening in the cortex of the brain amongst different layers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.452,
    "end": 2579.943,
    "text": " with Manfred in 1992, was perhaps the first to extend this theory of the retina and the LGN to a fully fledged general theory of cortical function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2580.603,
    "end": 2587.229,
    "text": "His theory was motivated by simple observations about the neurophysiology of cortico-cortical connections.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.37,
    "end": 2592.794,
    "text": "Specifically, the existence of separate feed-forward and feed-back paths",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.254,
    "end": 2603.227,
    "text": " where the feedforward pathways originated in the superficial layers of the cortex and the feedback pathways originated primarily in the deep layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.829,
    "end": 2609.812,
    "text": " So we kind of had this philosophy development happening over thousands of years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.552,
    "end": 2619.718,
    "text": "And then in the 1900s, people were starting to connect the neuroanatomy and the histology to some of these predictive ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.878,
    "end": 2627.102,
    "text": "And then now let's kind of close the loop and bring it back to the critical work that Friston highlighted in his 2018 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.264,
    "end": 2630.464,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.885,
    "end": 2634.647,
    "text": "And now predictive coding in the brain gets computational, mathematical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.54,
    "end": 2653.988,
    "text": " While Montfort's theory contained most aspects of classical predictive coding theory in the cortex, it was not accompanied by any simulations or empirical work, and so its potential as a framework for understanding the cortex was not fully appreciated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.029,
    "end": 2662.452,
    "text": "And so again, the similar work of Rao and Ballard in 1999 had its impact precisely by doing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.742,
    "end": 2669.625,
    "text": " And so they created a small predictive coding network according to the principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.645,
    "end": 2672.766,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.066,
    "end": 2693.034,
    "text": "They created a small predictive coding network according to the principles identified by Mumford and empirically investigated its behavior, demonstrating that the complex and dynamic interplay of predictions and prediction errors could explain several otherwise perplexing neurophysiological phenomena, specifically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2693.507,
    "end": 2697.63,
    "text": " extra-closical receptive field effects such as end-stopping neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2699.411,
    "end": 2711.559,
    "text": "Yeah, this is pretty interesting because even the idea that the neurons that are active while a certain stimuli is being presented, that those are neurons that are receptive to that stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.019,
    "end": 2715.061,
    "text": "That's within the paradigm of signal reception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.801,
    "end": 2718.743,
    "text": "And then it's like there's classical signal reception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2718.823,
    "end": 2721.585,
    "text": "You know, the pitcher throws the ball, the catcher catches the ball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.905,
    "end": 2722.426,
    "text": "It's classic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.106,
    "end": 2727.711,
    "text": " But unfortunately, or not, there's all these so-called extra-classical effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.332,
    "end": 2738.243,
    "text": "And so this paper proposed a simple architecture that was able to encompass the so-called classical as well as some of the important extra-classical effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.42,
    "end": 2767.172,
    "text": " effects under this predictive processing framework and so that really led to a lot of developments in neuroscience in the last 20 plus years and that's exactly what we're going to go into now so thanks for providing that that awesome context like it really helps i think situate some of the details that we're about to look into okay so let's get a little technical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.454,
    "end": 2796.829,
    "text": " what happened after round ballard's 1999 synthesis so remember that carl friston said that that was like one of those once in a decade papers for him so how did he change his action selection publication policies after reading that paper well anyone could guess but what friston did was that he cast the predictive coding algorithm as approximate bayesian inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.992,
    "end": 2799.613,
    "text": " upon Gaussian generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.333,
    "end": 2802.254,
    "text": "And this is going to be connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.294,
    "end": 2825.623,
    "text": "This is all in the paper for people to read, but this connects basically all of the previous themes that we had been talking about, like the information theory, minimum redundancy, and the Helmholtzian idea of perception as inference come together in the Bayesian perspective on the predictive coding architecture by Rao and Bollard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.523,
    "end": 2852.095,
    "text": " so the authors write friston's approach reformulates the mostly heuristic round ballard model in the language of variational bayesian inference which we're going to look more at and friston showed that the energy function in row and ballard can be understood as a variational free energy of the kind that is minimized through variational inference so that really connected the dots between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.981,
    "end": 2859.946,
    "text": " predictive coding architectures, and the empirical biological findings to all this work on variational Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.687,
    "end": 2862.789,
    "text": "And those are the 2003, 5, and 8 single-authored papers by Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.809,
    "end": 2862.869,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.516,
    "end": 2884.85,
    "text": " what is variational and bayesian and variational bayesian approaches and we're just going to look at the author's words and there's many many awesome places to look for educational materials and also check out some of the live streams like 26 32 34 37 and 39. so to be brief about it the author's right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.755,
    "end": 2899.785,
    "text": " Variational inference approximates an intractable inference problem with a tractable optimization problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.366,
    "end": 2906.534,
    "text": "So like a super hard problem to solve just by thinking about it and then guessing at the right answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.535,
    "end": 2909.677,
    "text": " with a tractable optimization problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.277,
    "end": 2911.418,
    "text": "So it's like 20 questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.478,
    "end": 2918.904,
    "text": "It's going to be hard to guess on your first question, but if you take this iterative optimization approach, maybe there's a way to actually resolve it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.385,
    "end": 2931.475,
    "text": "So it's not exactly like that, but it's like kind of, again, flipping out something that's hard to solve in one shot with an approach and this iterative gradient descent type improvement that actually gets you to a good solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.881,
    "end": 2937.717,
    "text": " And so this is where we're gonna introduce some of the variables and the letters that we're going to use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.209,
    "end": 2955.281,
    "text": " Following a lot of perceptual work in Bayesian statistics, we're gonna use O for observations, which are like data, either the actual data that the sensor provides us or generated data of the kind that we would expect the sensor to give us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.121,
    "end": 2960.905,
    "text": "And then X are the latent or the unobserved states of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.205,
    "end": 2967.029,
    "text": "So like X would be the temperature in the room and O is what the thermometer reading is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.11,
    "end": 2982.202,
    "text": " And that's sort of a Bayesian approach that helps us have a generative model of the data generating process, which is also known as the joint distribution because it is jointly over both the observations and the latent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.813,
    "end": 2991.755,
    "text": " Where variational inference comes into play is hinted at in this paragraph on base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2992.156,
    "end": 2999.178,
    "text": "So in order to do exact base, one would have to find this normalizing factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.858,
    "end": 3006.661,
    "text": "However, that can be intractable because it requires basically integrating or summing over all latent variable states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.341,
    "end": 3009.862,
    "text": "And that's not always easy or known.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.602,
    "end": 3012.503,
    "text": "And so the approach of the variational method",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.303,
    "end": 3021.756,
    "text": " is aiming to approximate the posterior using an auxiliary posterior using a different set of parameters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.215,
    "end": 3037.549,
    "text": " So the Q is going to be reflecting the distribution, the variational distribution that we control that is of a family of functions that is more amenable to optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.149,
    "end": 3046.898,
    "text": "So P could be like a super messy function, but Q is going to be constructed by the modeler to be a lot simpler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.779,
    "end": 3050.3,
    "text": " And so it is going to have its own parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.7,
    "end": 3054.441,
    "text": "And those parameters phi are mu and sigma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.161,
    "end": 3065.443,
    "text": "And so it's kind of like we would be interested in the mean and the variance of the x, the actual temperature in the room, given the thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.063,
    "end": 3068.424,
    "text": "But what if it were too hard to even get that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.164,
    "end": 3078.512,
    "text": " Well, what we might want to do would be imagine that the temperature were normally distributed like a Gaussian distribution with this mean mu and the variance sigma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.872,
    "end": 3084.597,
    "text": "So even if the temperature in the room weren't actually Gaussian distributed, maybe it's approximatable enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.217,
    "end": 3095.446,
    "text": "And so the variational approach to the Bayesian method is to introduce this variational distribution Q that's going to have like a lot of good features moving forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.674,
    "end": 3100.075,
    "text": " Here's how that cue comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.235,
    "end": 3106.516,
    "text": "This equation one is expressing using the variables that we've seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.597,
    "end": 3114.819,
    "text": "It's saying, and also introducing this divergence D. So first just the definition of D and then what this formalism says.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.956,
    "end": 3122.019,
    "text": " So D of P and double line Q. So any double line means between this and that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.52,
    "end": 3125.962,
    "text": "D is a function that measures the divergence between two distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.122,
    "end": 3136.408,
    "text": "So for example, P and Q. And here, the divergence is going to be calculated as the KL divergence, although other divergences are possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.253,
    "end": 3151.118,
    "text": " So when the divergence between the one that we simplified and controlled Q and that intractable true posterior, if that divergence were minimized to zero, we would be like fitting P as well as we could with Q.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.739,
    "end": 3161.544,
    "text": " And this is saying in one, it's saying Q star, the best Q of X, the latent states, given the data and the variational parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.285,
    "end": 3173.472,
    "text": "So the best possible room temperature prediction given thermometer readings and variational parameters are a minimization over all the variational parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.893,
    "end": 3190.868,
    "text": " of the divergence between the Q distribution that we control of exactly what we want the best answer for and the P generative model of exactly what would be the best to compute, like the temperature given the observations on the thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.179,
    "end": 3196.84,
    "text": " And so that goes a long way towards rewriting an inference problem as a divergence problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.48,
    "end": 3207.303,
    "text": "But they write, however, merely writing the problem this way does not solve it because the divergence that we need to optimize still contains the intractable true posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.943,
    "end": 3215.065,
    "text": "So it's rewritten as a divergence between like something we control and something that we kind of set out to do this because we couldn't calculate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.145,
    "end": 3218.846,
    "text": "So we have prepared it, but still this is intractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.886,
    "end": 3220.286,
    "text": "So this is not usable alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.581,
    "end": 3231.233,
    "text": " They write, the beauty of variational inference is that it instead optimizes a tractable upper bound on this divergence called the variational free energy, VFE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.054,
    "end": 3238.682,
    "text": "To generate the bound, we apply Bayes' rule to the true posterior to rewrite it in the form of the generative model and the evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.463,
    "end": 3250.31,
    "text": " So here's that P of X given O. That's rewritten as now not of X given O, but P of O comma X. That's the joint distribution divided by the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.071,
    "end": 3256.154,
    "text": "So this, by the Bayes rule, P of X given O is equivalent to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.254,
    "end": 3257.735,
    "text": "That's why this is the first line here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.039,
    "end": 3273.498,
    "text": " They provide some rewritings and then they write, in the third line, the expectation around P of O, so the actual likelihood of the observations themselves, like how likely is the thermometer saying 21?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.538,
    "end": 3273.799,
    "text": "It vanishes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.761,
    "end": 3288.411,
    "text": " since the expectation is over the variable X, which is not in P of O. So it's like, what is the expectation of this coin flip over the temperature tomorrow?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.012,
    "end": 3297.199,
    "text": "It's like, because they're different variables, it makes them very easy to separate out if we're only interested in one of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.562,
    "end": 3319.769,
    "text": " then they write that this f the free energy is a very is a tractable quantity since it's a divergence between two quantities we assume that we as the modeler know the variational approximate posterior q of x given o that's the distribution that we control and the generative joint distribution p of o comma x",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.689,
    "end": 3326.275,
    "text": " So we traded out this intractable true posterior, where it's like, if we knew it, then we would just stop there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.855,
    "end": 3327.656,
    "text": "But we don't know it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.276,
    "end": 3342.67,
    "text": "So we've traded it out for a divergence between something that we totally control, q of x conditioned on these other parameters, and a joint distribution, which we might have uncertainty over, but at least can be modeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.331,
    "end": 3345.872,
    "text": " So that's one of the key pieces of variational Bayes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.233,
    "end": 3347.994,
    "text": "And that's not specific to predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.034,
    "end": 3350.915,
    "text": "It's just an important way that the authors are introducing it here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.036,
    "end": 3352.756,
    "text": "Anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.776,
    "end": 3357.259,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.719,
    "end": 3359.1,
    "text": "So let's kind of continue on this theme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.78,
    "end": 3367.424,
    "text": "Since f is an upper bound, by minimizing f, we drive the variational distribution that we control closer to the true posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.405,
    "end": 3372.107,
    "text": "As an additional bonus, under certain conditions,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.519,
    "end": 3375.401,
    "text": " f can be used for model selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3375.962,
    "end": 3386.553,
    "text": "So that means it can be used not just to kind of fine tune a model that we've already chosen, but it can actually do choosing from parametrically or structurally different models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.235,
    "end": 3394.202,
    "text": "They write, we can gain an important intuition about f by showing it can be decomposed into a likelihood maximization term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.768,
    "end": 3399.991,
    "text": " in the KL divergence term, which penalizes deviation from the Bayesian prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.571,
    "end": 3408.816,
    "text": "These terms are often called accuracy and complexity, and this decomposition is often used in different machine learning algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.197,
    "end": 3423.486,
    "text": "So that's one rewriting of free energy as this divergence between the Q and the P, and then rewriting that as an accuracy and a complexity, which we'll go into maybe more another time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.385,
    "end": 3434.088,
    "text": " And they write, in many practical cases, we must relax the assumption that we know the generative model P of O and X, the joint distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.928,
    "end": 3436.149,
    "text": "Luckily, this is not fatal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.309,
    "end": 3447.153,
    "text": "Instead, it is possible to learn the generative model alongside the variational posterior on the fly and in parallel using expectation maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.113,
    "end": 3451.034,
    "text": "So this is basically the alternation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.722,
    "end": 3480.278,
    "text": " shown by equations three of how we can be setting one side of this kl divergence fixed and optimizing the other side and then going back and doing it the other way and so that kind of back and forth expectation maximization we're going to be like reducing this divergence from both sides and so formalism 3 are saying the variational parameters phi at the next time step t point t plus one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.397,
    "end": 3490.545,
    "text": " are an optimization argmin of those parameters holding the theta constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.428,
    "end": 3495.65,
    "text": " And then the second part of formalism three is the exact opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.33,
    "end": 3506.996,
    "text": "Now the generative model parameters, theta at t plus one, are minimization over literally the same thing, but holding the variational parameters constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.376,
    "end": 3515.04,
    "text": "So there's a lot more to say about expectation maximization, but this is like converging to a small variable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.314,
    "end": 3529.288,
    "text": " divergence by whittling away at both sides and kind of alternating there so that's how expectation maximization can be used as a heuristic algorithm for variational Bayesian optimization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.919,
    "end": 3543.906,
    "text": " How do we go from variational inference, which all of those previous slides are things that we've basically talked about before and that are not applying to predictive coding specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.066,
    "end": 3546.188,
    "text": "So how are we going to get to predictive coding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.571,
    "end": 3554.494,
    "text": " They write, having reviewed the general principles of variational inference, we can see how they relate to predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.254,
    "end": 3562.898,
    "text": "First, to make any variational inference algorithm concrete, we must specify the forms of the variational posterior and the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.138,
    "end": 3567.0,
    "text": "It's like if you want to do formalism three, those are the two pieces you need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.32,
    "end": 3569.521,
    "text": "You need like the phi stuff and the theta stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.694,
    "end": 3571.955,
    "text": " And so they specify it here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.975,
    "end": 3578.578,
    "text": "N means a normal distribution with like a mean comma variance format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.599,
    "end": 3583.841,
    "text": "And so they're gonna define a Gaussian form for the generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.865,
    "end": 3609.594,
    "text": " mean of this likelihood gaussian is assumed to be some function of hidden states which can be parameterized with theta while the mean of the prior gaussian distribution is going to be a g of mu so we're going to have like f of theta and g of mu the variances of these two gaussian distributions of the generative model are sigma 1 and sigma 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.694,
    "end": 3623.964,
    "text": " This is a slight technical detail, but they're going to assume that the variational posterior is a Dirac delta, which is like a spiking function distribution that's centered at the mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.924,
    "end": 3629.068,
    "text": "However, they explore that differently with Laplace assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.009,
    "end": 3638.276,
    "text": "So this is basically taking what we discussed about variational inference and preparing it to be entered into a predictive coding way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.949,
    "end": 3647.736,
    "text": " So they're setting up the problem with which parameters you're going to want to do variational inference on in order to implement predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.137,
    "end": 3651.6,
    "text": "And there's of course more to say, but we're just giving a first pass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.163,
    "end": 3661.968,
    "text": " In Appendix A is where they describe the difference between using the Laplacian approximation and the Dirac delta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3662.068,
    "end": 3669.173,
    "text": "So it's footnote eight, which suggests moving to Appendix A and looking at the Buckley 2017 for a walkthrough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.434,
    "end": 3678.862,
    "text": " But this on the bottom right is kind of like a summary of the difference between the Dirac delta approach and the Laplace method approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3679.402,
    "end": 3687.41,
    "text": "So the Dirac delta is like we're trying to find the spike that's at the mean or the median.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.51,
    "end": 3690.413,
    "text": "There's some other details in play that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3691.434,
    "end": 3719.402,
    "text": " is where the bulk of the probability distribution mass is whereas the laplace method tries to fit a polynomial like just a second degree polynomial like a quadratic over the probability distribution also in the way that is best fitting so there's some similarities and some differences and it's explored more in the buckley 2017 paper on the fep for action perception mathematical review",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.049,
    "end": 3727.651,
    "text": " So let's continue with our exploration of how we do variational Bayes and make it a predictive coding model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.329,
    "end": 3757.603,
    "text": " the top they write we define the prediction errors epsilon o that's like the error on observation and epsilon x that's the error on the mean states so the epsilon o is like o minus f of some function you know f of some parameters and then there's also the epsilon x so how much prediction error do you have about the observation how much prediction error do you have about the hidden state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3759.58,
    "end": 3765.405,
    "text": " Epsilons are the prediction errors, and they're parameterized by these theta 1 and 2 variances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.583,
    "end": 3772.124,
    "text": " Given all of this, we can derive dynamics for all the variables of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.644,
    "end": 3779.645,
    "text": "So that's the actual underlying hidden state, the temperature in the room that we want to be actually predicting, mu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3780.706,
    "end": 3782.706,
    "text": "And then, well, the variational parameter of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.406,
    "end": 3787.147,
    "text": "And then theta one and theta two, which are the variances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.407,
    "end": 3791.468,
    "text": "You can think of it as like the variance of the room temperature and the variance of the thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.488,
    "end": 3791.848,
    "text": "I hope that's not...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.062,
    "end": 3822.139,
    "text": " wrong or an oversimplification but those are like the two variances and we want the real temperature of the room they write we can derive dynamics for all these variables of interest by taking the derivatives of the variational free energy f the update rules are as follows and so this is change in mu theta 1 and theta 2 over time d mu dt d theta 1 over dt and d theta 2 over dt",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.24,
    "end": 3846.756,
    "text": " and that has some equivalences with some f's so it's going to be going from just the change in the mu estimate through time to something involving free energy and then that's defined more formally importantly these update rules are very similar to the ones derived in rao and ballard 1999 and therefore can be interpreted as recapitulating core predictive coding update rules",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3847.875,
    "end": 3856.339,
    "text": " For instance, the mus are typically interpreted as rapidly changing neural firing rates, while thetas are slowly changing synaptic weight values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.099,
    "end": 3863.062,
    "text": "So they're weaving together, connecting the biology with the formalisms here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.902,
    "end": 3868.864,
    "text": "And they write also that that mu can be understood as the process of perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.905,
    "end": 3872.126,
    "text": "That's like, how hot is it in the room?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.482,
    "end": 3879.747,
    "text": " since mu is meant to correspond to the estimate of the latent state of the environment generating the observations on the thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.467,
    "end": 3889.834,
    "text": "And by contrast, the dynamics of thetas can be thought of as corresponding to learning, since theta effectively defined the mapping between the latent state and the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.695,
    "end": 3897.822,
    "text": " So it's like you think you know how the thermometer is related to the temperature in the room, and then you see your thermometer changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.942,
    "end": 3899.663,
    "text": "You're changing how hot you think the room is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3900.064,
    "end": 3901.825,
    "text": "That happens over a shorter time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.406,
    "end": 3910.193,
    "text": "And then over a longer time scale, you might come to learn the variability of the temperature or how noisy the thermometer is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.573,
    "end": 3913.456,
    "text": "But that's more like learning than perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.856,
    "end": 3916.218,
    "text": "However, they're on a continuum using this model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.299,
    "end": 3944.627,
    "text": " so actually this up to formalism 9 completes the core formalism of predictive coding which is it's a variational Bayesian approach to having this ongoing prediction error minimizing approach to latent state estimation that is the heart of predictive coding and now we're going to jump into like a few different elaborations that we're going to be moving through a little bit more quickly anything to add Maria",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.805,
    "end": 3948.065,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.666,
    "end": 3955.71,
    "text": "The previous examples focused on predictive coding with a single level of latent variables, mu1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.251,
    "end": 3961.253,
    "text": "However, the expressiveness of such a scheme is limited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.434,
    "end": 3976.803,
    "text": "Deep neural networks in machine learning have demonstrated that having hierarchical sets of latent variables is a key to enabling methods that learn powerful abstractions and handle intrinsically hierarchical dynamics of the sort that humans intuitively perceive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.915,
    "end": 3987.278,
    "text": " Predictive coding schemes introduced can be straightforwardly extended to handle hierarchical dynamics of arbitrary depth, equivalent to deep neural networks in machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.398,
    "end": 3997.721,
    "text": "This is done through postulating multiple layers of latent variables, X sub 1 through X sub L, and then defining the generative model as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.441,
    "end": 4003.423,
    "text": "So like P, the generative model is going to be basically over all the layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.27,
    "end": 4020.9,
    "text": " So just as the generative model and the variational distribution had to be defined for the single layer model, here they're going to define the P distribution and now they need the Q. We define a separate variational posterior for each layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.46,
    "end": 4025.443,
    "text": "So they define the P's and the Q's just like they did in the single layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.063,
    "end": 4033.308,
    "text": "And then that allows them to calculate the variational free energy, which is a sum of the prediction errors of each level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.762,
    "end": 4062.311,
    "text": " so this is f now not just over one layer but multiple levels so the variational posteriors that need to be calculated are partitioned across the layers which allows them to be summed in a very straightforward way given that free energy divides nicely into the sum of layerwise prediction errors it comes as no surprise the dynamics of the mu and the theta are similarly separable across layers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.817,
    "end": 4070.065,
    "text": " that allows different layers of this prediction hierarchy to be precise or imprecise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.471,
    "end": 4088.934,
    "text": " and allow those movements to happen in a way that's uncorrelated, which is not just because the real world presents itself with settings where there's like confidence at lower and higher and vice versa, but it makes this calculation of the free energy of the whole system more like a simple sum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.194,
    "end": 4098.696,
    "text": "Whereas if there was these like really complex interactions with the first layer by the third layer, if the fifth layer is this way, then doing the statistics would be a lot more challenging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.046,
    "end": 4102.018,
    "text": " So visually, here's what that looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.898,
    "end": 4108.181,
    "text": " We have the mu, which is the mean estimate of what's happening at that level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.982,
    "end": 4113.824,
    "text": "And then there's passing of these epsilon error terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.885,
    "end": 4123.71,
    "text": "So they write, this is the architecture of a, in figure one, multi-layer predictive coding network, shown here with two value and error neurons in each layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4124.771,
    "end": 4131.495,
    "text": "The value neurons project to the error neurons of the layer below, and the error neurons represent the current activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.443,
    "end": 4146.307,
    "text": " So this is like starting to walk us back towards that cortical layout where there's a cortical column, where there's some so-called upwards and downwards signaling, but also there's lateral signaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.625,
    "end": 4161.126,
    "text": " So this is a graphical model that's reflecting the way that predictive coding can be arranged almost like in series and in parallel to have like wide models and deep models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.366,
    "end": 4163.709,
    "text": "Just like you could have a neural network where it was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.25,
    "end": 4189.671,
    "text": " um four neurons four neurons four neurons four neurons or you could have 64 and then 64. that would be like a shallower but wider model and so that notion of shallowness and depth is also going to come into play with predictive coding here we're in formalism 12 and 13. and so now we're looking at the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.559,
    "end": 4212.576,
    "text": " rate of change the derivative of mu sub l so the estimate of the mean at that layer and theta l the variance at that layer so these are the update rules the gradients for the mean and the variance of different levels and they're also written as free energy functionals of those layers and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.533,
    "end": 4220.401,
    "text": " The dynamics of the variational means depends only on the prediction errors at their layer and the prediction errors on the layer below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.081,
    "end": 4225.246,
    "text": "So again, we don't have this epsilon at L minus one connecting up all the way to mu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4225.787,
    "end": 4231.373,
    "text": "It's only through these local connections within and between layers by which we're needing to calculate anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4233.237,
    "end": 4244.639,
    "text": " We can think of the muse as trying to compromise between causing error by deviating from the prediction from the layer above and adjusting their own prediction to resolve error at the layer below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.239,
    "end": 4248.56,
    "text": "So it's kind of like a hierarchy of bosses or tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.08,
    "end": 4254.421,
    "text": "And there's like top-down expectations and there's the bottom-up reality, which might be like ahead or behind schedule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4254.841,
    "end": 4258.742,
    "text": "And then it puts each person like in this compromise situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.455,
    "end": 4277.665,
    "text": " Crucially for conceptual readings of predictive coding, and this is where there's like a doorway to the philosophy and some of the broader discussions, this means that sensory data is not directly transmitted up through the hierarchy as is assumed in much of perceptual neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.427,
    "end": 4282.669,
    "text": " And so it totally returns us to these questions like, what is perception?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.049,
    "end": 4283.969,
    "text": "What is cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.089,
    "end": 4284.789,
    "text": "What is action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.97,
    "end": 4289.311,
    "text": "What is coming from the eye to the brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.351,
    "end": 4291.052,
    "text": "Or what goes from the brain to the eye?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.132,
    "end": 4292.072,
    "text": "What is the eye doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.232,
    "end": 4294.733,
    "text": "What is the brain doing with respect to the eye?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.674,
    "end": 4297.314,
    "text": "And how does it relate to predictive coding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.035,
    "end": 4300.095,
    "text": "Any quick answers on those?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.537,
    "end": 4304.017,
    "text": "Not really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.975,
    "end": 4305.215,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4305.756,
    "end": 4317.165,
    "text": "So after introducing that kernel of the predictive coding formalism and taking it into the multi-level context, now we can look at another elaboration or generalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.506,
    "end": 4331.216,
    "text": "So they write in 2.3, we have considered the modeling of just a single static stimulus O. However, most interesting data that the brain receives comes in temporal sequences O bar, which is O through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.236,
    "end": 4340.782,
    "text": " To model such temporal sequences, it's often useful to split the latent variables into states, which can vary with time, and parameters, which cannot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.883,
    "end": 4352.891,
    "text": "In the case of sequences, instead of minimizing the variational free energy, we must instead minimize the free action, which is the path integral of the variational free energy through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4354.019,
    "end": 4365.224,
    "text": " We're not going to go into the formalisms related to the generalized coordinates 14, 15, 16, and 17, but it's something that we can explore later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4366.085,
    "end": 4368.386,
    "text": "And just as a reminder, just to kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.754,
    "end": 4372.654,
    "text": " excite somebody who might want to explore it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.335,
    "end": 4381.537,
    "text": "We explored the idea of the generalized coordinates of motion a lot in Acton Livestream number 26 with DaCosta et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4382.437,
    "end": 4387.818,
    "text": "And so here was a model where we have from left to right time at different time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.618,
    "end": 4391.999,
    "text": "And then there's the observables of something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4392.779,
    "end": 4398.321,
    "text": "And then it is part of this like column of higher derivatives of its motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.501,
    "end": 4399.461,
    "text": "So it's like position, it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4401.09,
    "end": 4403.331,
    "text": " its velocity, its acceleration, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.932,
    "end": 4411.856,
    "text": "And so at each time step moving forward, you're computing the generalized coordinates of motion for like the movement of a baseball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.516,
    "end": 4418.88,
    "text": "And that is what ties generalized coordinates of motion to PID control, which will also come back at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.6,
    "end": 4432.864,
    "text": " also known as integrator chains, and this is all happening within this discussion of Bayesian mechanics, just like if we had been talking about the baseball, we would be talking about physical mechanics or statistical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4433.324,
    "end": 4438.545,
    "text": "Well, it's Bayesian, so it's Bayesian mechanics and the physics of action and control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.446,
    "end": 4440.926,
    "text": "That's what they explore in Section 2.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.527,
    "end": 4447.348,
    "text": "Section 2.4 introduces and goes into a little bit more detail on precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.607,
    "end": 4453.424,
    "text": " One core aspect of predictive coding absent in the original Rao and Ballard 1999 formulation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.098,
    "end": 4459.701,
    "text": " is the notion of precision or inverse variance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.542,
    "end": 4464.465,
    "text": "So precision and variance are like one over each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.986,
    "end": 4474.093,
    "text": "So if someone said it's very high precision, that's a very narrow, very sharp distribution, and one over the variance is another way to write that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4474.253,
    "end": 4478.297,
    "text": "So sometimes it's used with like a beta and a gamma in other models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4479.67,
    "end": 4489.136,
    "text": " Precision serves to multiplicatively modulate the importance of the prediction errors and thus possess a significant influence in the overall dynamics of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.217,
    "end": 4502.905,
    "text": "And so we won't go into every detail with how the precisions are themselves fit, but just wanted to note that this big sigma is the free energy being summed over the layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.546,
    "end": 4508.149,
    "text": "So big sigma is a multiplicative sum",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.761,
    "end": 4534.737,
    "text": " oh sorry it's just a sum but then this smaller Sigma inside is Sigma as the precision Matrix at a given level so it's kind of like different uses of Sigma but this is a way where the variances and the prediction errors at a given level are being summed across levels and that's helping fit these precision terms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.136,
    "end": 4557.322,
    "text": " statistical detail but it's important for making it work in real inference okay in section 2.5 they they pull back from elaborating on predictive coding and they talk more about how it has some biologically plausible bases so this was quite interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.339,
    "end": 4574.962,
    "text": " While technically predictive coding is simply variational inference and filtering algorithm under Gaussian assumptions, from the beginning it has been claimed to be biologically plausible theory of cortical computation and also for other brain regions like the eye and for other cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.155,
    "end": 4581.939,
    "text": " The literature has consistently drawn close connections between the theory and potential computations that may be performed in brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.559,
    "end": 4593.606,
    "text": "For example, Rao and Ballard explicitly claimed to model the early visual cortex, and Friston explicitly proposed predictive coding as a general theory of cortical computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.406,
    "end": 4597.328,
    "text": " This is like the realism and instrumentalism discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.889,
    "end": 4602.212,
    "text": "Are we just modeling these systems and the kind of data that they provide us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.873,
    "end": 4613.121,
    "text": "And it just fits really well as a model, but we're not saying that the architecture of the statistical model has anything to do with the architecture of the physical pieces of the brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4614.062,
    "end": 4621.108,
    "text": "Or is it a little bit in the gray zone where it's kind of like, wow, that model fits so well and the anatomy looks so good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.608,
    "end": 4623.17,
    "text": "Maybe there's something there to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4624.335,
    "end": 4636.124,
    "text": " And so in this section, they review empirical work that has attempted to validate or falsify key tenants of predictive coding in the cortex, as well as some issues with the approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4636.685,
    "end": 4642.109,
    "text": "So it's mainly focused on the mammalian brain and the neural cell type, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.576,
    "end": 4652.804,
    "text": " As always, we can sort of think about what is the adjacent here, like what are the roles of other cell types in predictive coding in the mammalian brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.824,
    "end": 4661.571,
    "text": "And then how might like the insect nervous system or how might other nervous systems or non-nervous systems perform predictive coding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.032,
    "end": 4668.717,
    "text": "And then they just provide one example where they take what they had shown in figure one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.253,
    "end": 4683.506,
    "text": " with this multi-level predictive coding scheme that was sort of predictively programming, as they say, one to think about cortical cognition, and now they're gonna make that connection clear in figure two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.947,
    "end": 4690.553,
    "text": "So on the right side is their figure two, and that's the canonical microcircuit model of Bostos et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4691.374,
    "end": 4709.565,
    "text": " mapped onto the connectivity of a cortical region and so then in red are those parameters that we've been discussing the mus and the epsilons the means and then the prediction errors and then here's just a few other representations of what others have written",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4710.746,
    "end": 4735.871,
    "text": " about like that cortical column so here's like an evolutionary perspective that connects some of the mammalian cortex with the avian pallium brain region and so just the way that people work out these kinds of circuit diagrams like by looking at the actual tissue and then here's the statistics and so how does the tissue um relate to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4737.407,
    "end": 4757.733,
    "text": " statistical model but that's what they explore in figure two okay any thoughts okay in section three they continue to review empirical work but with more of a focus on machine learning of the unsupervised and supervised setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4759.008,
    "end": 4771.763,
    "text": " And they're going to also explore how the predictive coding architecture can be made more biologically plausible by relaxing certain assumptions implicit in this canonical model and introduce action into the picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4773.545,
    "end": 4774.146,
    "text": "Figure three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4775.56,
    "end": 4779.383,
    "text": " They summarize a few different, what they call paradigms of predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4780.925,
    "end": 4784.408,
    "text": "Summary of the input output relationships for each paradigm of predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.269,
    "end": 4790.093,
    "text": "So it's the input and the prediction, the output of different paradigms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4790.714,
    "end": 4792.515,
    "text": "So here's the classical predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.576,
    "end": 4798.32,
    "text": "Observation data are coming in, predictions about those observations are coming out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4798.721,
    "end": 4800.943,
    "text": "It's an instantaneous real-time snapshot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4802.642,
    "end": 4815.124,
    "text": " the real-time anticipatory unfolding is still getting data as input, but it's predicting the observation at the next time step, which is a similar problem to predicting it at this time step, but it's like a little bit different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.263,
    "end": 4822.725,
    "text": " That can happen not just through time, but also in the context of space with like a spatial predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4823.626,
    "end": 4837.631,
    "text": "And then these two on the right, supervised predictive coding in the generative and in the discriminative direction, have to do with the relationship with reading in labels and giving out observations or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.271,
    "end": 4838.991,
    "text": "Make me a cat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.791,
    "end": 4840.892,
    "text": "Here's a picture of a cat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4841.872,
    "end": 4842.552,
    "text": "Here's a picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.193,
    "end": 4843.753,
    "text": "That's a cat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4844.69,
    "end": 4850.111,
    "text": " So these are some of the ways that predictive coding models have been applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.131,
    "end": 4856.233,
    "text": "3.1, they explore the way that unsupervised training relates to predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.253,
    "end": 4861.474,
    "text": "So that is machine learning on unlabeled data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.035,
    "end": 4862.935,
    "text": "Like here's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4864.102,
    "end": 4867.384,
    "text": " 100,000 hours of human speaking, learn how to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4867.884,
    "end": 4869.585,
    "text": "That's like an unsupervised approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.025,
    "end": 4879.569,
    "text": "Whereas the supervised approach would be, here's 1,000 hours of human speaking, here's 1,000 hours of a river, here's 1,000 hours of some other noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.13,
    "end": 4886.673,
    "text": "And so by the label, then the algorithm would learn what is speech versus non-speech versus the unsupervised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4887.033,
    "end": 4890.695,
    "text": "But there's also a lot of continuum and complexity and it's a whole topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.695,
    "end": 4905.087,
    "text": " In some of the subsections of 3.1, they go a little bit deeper into the temporal predictive and the auto-encoding aspects, but we're not going to go into those right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4906.883,
    "end": 4916.03,
    "text": " In figure four, in section three two, they look at supervised predictive coding and look at it in that forwards and backwards direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.57,
    "end": 4926.858,
    "text": "And so here they're looking at the classic MNIST dataset for evaluation, where there's some pictures of handwritten digits and then it's predicting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4927.379,
    "end": 4932.423,
    "text": "And so here's the generative predictive coding and the discriminative direction,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.103,
    "end": 4943.59,
    "text": " where here the data are coming in, like the picture of the five with the pixel intensities, and that is relating to the more high-level estimate of it being a five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.19,
    "end": 4947.152,
    "text": "So this is observation in, label out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.612,
    "end": 4948.192,
    "text": "That's a five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4949.053,
    "end": 4953.696,
    "text": "Here's label in, pixels reflecting it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.957,
    "end": 4958.779,
    "text": "So that's connecting machine learning to predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4961.138,
    "end": 4986.773,
    "text": " section three three they're also exploring some um relaxed predictive coding and it has to do with relaxing certain mathematical assumptions that they had introduced earlier for simplicity and for clarity we're not gonna go into it but it has to do with making it more useful in the real world by relaxing certain assumptions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.369,
    "end": 4994.352,
    "text": " And then in 3.4, they explore deep predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.132,
    "end": 5004.038,
    "text": "So they write, so far in this review, we've only considered direct variations on the Friston, Rao, and Bollard models of predictive coding, which are relatively pure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.214,
    "end": 5027.412,
    "text": " use only local biologically plausible learning rules there also exists a small literature experimenting with these models often achieve better performance on more challenging tasks than the pure models can achieve so pure again here meaning that it uses only local biologically plausible learning rules so only connected entities locally and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.615,
    "end": 5035.577,
    "text": " These models, they suggest, provide a vital thread of evidence about scaling properties and performance of deep and complex predictive coding networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.657,
    "end": 5048.581,
    "text": "And they write, the first major work in this area is PredNet, which uses multiple layers of recurrent convolutional LSTMs, neural networks, to implement a deep predictive coding network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5049.301,
    "end": 5052.342,
    "text": "So here is what PredNet looked like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.563,
    "end": 5057.564,
    "text": "This is the original PredNet architecture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.942,
    "end": 5067.597,
    "text": " And so they have convolutional LSTMs that are passing information in a top-down way and in a bottom-up way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.735,
    "end": 5070.817,
    "text": " So maybe we could look at it more later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.837,
    "end": 5084.228,
    "text": "And then I also just found this 2019, 2020 paper where they also explored like whether PredNet actually is doing predictive coding, but again, a whole nother rabbit hole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.989,
    "end": 5095.918,
    "text": "So section three reviewed through figure three and some discussions on the subsections, a few of the different paradigms and the ways that this predictive coding architecture has been applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5098.001,
    "end": 5101.244,
    "text": " In Section 4, they're going to connect it to other algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5101.584,
    "end": 5105.827,
    "text": "So we're going to basically speed through all of the connections except for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5107.448,
    "end": 5112.012,
    "text": "First, they connect predictive coding in Section 4.1 to the back propagation of error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5113.313,
    "end": 5121.219,
    "text": "This is really important for neural network training, but we're not going to talk about it here, but it sounds really interesting to discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.852,
    "end": 5131.095,
    "text": " One that we'll introduce but then skip over most of the details is the relationship between linear predictive coding and Kalman filtering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5131.755,
    "end": 5141.419,
    "text": "So we can remember that the linear predictive coding is not just the frame differencing, it's where there's like that coefficient of how much you should forget each of the previous frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.679,
    "end": 5146.401,
    "text": "And this is known in signal processing as the Kalman filter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.421,
    "end": 5156.087,
    "text": " The Kalman filter, as this slide shows, is an iterative mathematical process to quickly estimate true values, position, and velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5156.607,
    "end": 5159.849,
    "text": "So that's also like getting towards the generalized coordinates of motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.49,
    "end": 5162.651,
    "text": "And so the Xs are like our observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.991,
    "end": 5163.832,
    "text": "That's the thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.572,
    "end": 5170.717,
    "text": "And then here's the red is our Kalman filtered temperature unfolding through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.497,
    "end": 5173.498,
    "text": "So our initial estimate gets quickly corrected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.039,
    "end": 5176.721,
    "text": "And then even though there's a lot of noise in the observations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5178.257,
    "end": 5181.581,
    "text": " the Kalman filter is like giving a good prediction on the actual temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.982,
    "end": 5186.966,
    "text": "And this has been implemented in a ton of Bayesian approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5187.147,
    "end": 5190.69,
    "text": "It's a totally standard signal processing Bayesian approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.792,
    "end": 5199.08,
    "text": "And in the following sections in 4.2, they have a lot of formalisms about the Kalman filter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5200.55,
    "end": 5206.453,
    "text": " And in Appendix D, they provide even more formalisms on the Kalman filter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5207.214,
    "end": 5209.215,
    "text": "So we're not going to really go into either of those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5211.296,
    "end": 5217.04,
    "text": "In Section 4.3, they introduced this idea of normalization and normalizing flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.0,
    "end": 5223.523,
    "text": "And so they wrote, the deep link between predictive coding and normalization has been extended by Marino 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5225.106,
    "end": 5246.583,
    "text": " situating predictive coding with general recipe for building or representing a complex distribution from a simple and tractable one so we encourage people to look at this merino 2020 paper if they want to learn more about predictive coding variational auto encoders and biological connections but not going to discuss today",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.211,
    "end": 5253.796,
    "text": " One other model that they connect predictive coding to is known as the biased competition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5255.037,
    "end": 5263.325,
    "text": "And that is unpacked in 4.4, but I just wanted to pull up one example of this biased competition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5264.326,
    "end": 5292.419,
    "text": " and so this is from the sprotling paper of 2008 within each processing stage nodes compete to be active in response to the current pattern of feed forward activity received from the sensory input or previous processing stage so it's like there's competitions amongst the subunits to be activated by certain kinds of inputs and then there's some technical details okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5293.484,
    "end": 5298.106,
    "text": " Now, finally, to active inference as we're near the end of the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5301.087,
    "end": 5304.448,
    "text": "This will be a little fun to explore also in the coming weeks, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5304.908,
    "end": 5309.99,
    "text": "So they write in 4.5, predictive coding can also be extended to include action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5313.789,
    "end": 5320.274,
    "text": " allowing for predictive coding agents to undertake adaptive actions without any major change to their fundamental algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5321.355,
    "end": 5325.418,
    "text": "The key insight is to note there are two ways of minimizing prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5326.418,
    "end": 5332.083,
    "text": "The first is to update predictions to match sensory data, which corresponds to classical perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5334.184,
    "end": 5337.467,
    "text": "I thought that the ball was gonna be here, but I guess it's over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5338.687,
    "end": 5339.088,
    "text": "Perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.165,
    "end": 5345.309,
    "text": " The second is to take actions in the world to force the incoming sensory data to match the prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5346.149,
    "end": 5353.074,
    "text": "I'm going to move the ball to where I expect it to be, or I expected the ball to be in the left side of my visual field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5353.775,
    "end": 5358.598,
    "text": "So I'm going to move my eyes to the right so that it's in the left side of my visual field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5358.859,
    "end": 5362.301,
    "text": "So action is not always like reaching out and moving the ball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.022,
    "end": 5366.684,
    "text": "It can also be the action of choosing where to look, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5368.243,
    "end": 5377.308,
    "text": " And this is what is really fascinating because we spent so long in the earlier sections, in the first 50 equations, you know, without action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5377.968,
    "end": 5383.511,
    "text": "So it's like, oh no, are there going to be like another 250 equations with action coming into the picture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5384.111,
    "end": 5386.893,
    "text": "But actually it's quite a simple introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.793,
    "end": 5394.357,
    "text": "The basic approach to including action in predictive coding is to minimize the variational free energy with respect to action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.43,
    "end": 5404.476,
    "text": " Although free energy is not explicitly a function of action, it can be made so implicitly by noticing the dependence of sensory observations on actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.216,
    "end": 5409.039,
    "text": "So what you see is gonna depend on where you look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5410.4,
    "end": 5415.503,
    "text": "We can make this implicit dependence explicit using the chain rule of calculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5417.444,
    "end": 5420.006,
    "text": "Active inference, it's inference about action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5421.447,
    "end": 5424.229,
    "text": "So here's the rate of change of action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5425.23,
    "end": 5435.956,
    "text": " through time is the rate of change of a free energy functional of, previously it was of observations and of states through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5436.916,
    "end": 5442.139,
    "text": "And now O is O of A. Observations are a function of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5442.659,
    "end": 5445.281,
    "text": "They're partially or completely dependent on action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5446.281,
    "end": 5450.964,
    "text": "And that is being understood as a derivative of change in action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5453.135,
    "end": 5464.982,
    "text": " O of A over A, partial O of A over A, is a forward model, which makes explicit the dependence of the observation upon action and must be provided or learnt by the algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.842,
    "end": 5473.947,
    "text": "Because that is, how do observations, which are a function of action, change as actions change?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5474.808,
    "end": 5477.549,
    "text": "So that is like a layer that hadn't been brought up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5477.649,
    "end": 5481.772,
    "text": "So they're saying, because you do need to solve that ratio or that derivative,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.574,
    "end": 5485.076,
    "text": " you do need to like learn that or be provided that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5486.036,
    "end": 5491.5,
    "text": "And it's a separate thing to learn in addition to this standard generative model for perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5492.361,
    "end": 5502.068,
    "text": "So we tuck action as being like a dependency of observations, which is also what connects active inference to perceptual control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5502.708,
    "end": 5507.792,
    "text": "So that's how we introduce action into the picture just from a first pass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.609,
    "end": 5516.693,
    "text": " Let's go one more level in and then any thoughts you have would be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5517.193,
    "end": 5529.28,
    "text": "So if we were talking about just the inference case, prediction error minimization would be like the picture that we're seeing is exactly the one that we're predicting or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5529.761,
    "end": 5531.702,
    "text": "So what does that look like for action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5533.339,
    "end": 5542.783,
    "text": " The prediction error simply becomes the difference between the current observation and the target or set point, already bringing in this kind of homeostasis, allostasis perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5543.343,
    "end": 5546.504,
    "text": "However, this raises the question of where the set points comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5547.544,
    "end": 5549.945,
    "text": "Where do the targets come from and how are they computed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5550.666,
    "end": 5551.386,
    "text": "Wentz-Priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5553.055,
    "end": 5564.585,
    "text": " A generic answer to the question is that set points can be inherited from evolutionary or ontogenetic imperatives, or supplied by other neural circuits involved in goal-directed behavior and planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.246,
    "end": 5569.69,
    "text": "For present purposes, we can simply take them as exogenously given variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5570.33,
    "end": 5576.932,
    "text": " So what isn't addressed in this review is this big question of priors and learning on preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5577.292,
    "end": 5579.572,
    "text": "Like how do you know what to prefer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5580.112,
    "end": 5582.413,
    "text": "How do you know how much to change how you prefer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5582.893,
    "end": 5584.594,
    "text": "How tight should your preferences be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.054,
    "end": 5590.575,
    "text": "Those are like really, really important areas, but they're just like opening the door, but not gonna go into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5592.916,
    "end": 5598.337,
    "text": "In 4.5.1, it's also straightforward to model the potential costs of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5599.6,
    "end": 5602.644,
    "text": " In biological organisms, there's different costs of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5603.405,
    "end": 5605.368,
    "text": "And so how can that be modeled mathematically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5608.206,
    "end": 5613.808,
    "text": " Well, they say by explicitly including action within the generative model as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.588,
    "end": 5618.549,
    "text": "And so now they've added in this extra term with a cost of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5619.369,
    "end": 5632.473,
    "text": "So it just shows how like once action has been introduced as a dependency of the observation function, then there can be like other things that can be calculated related to action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5635.074,
    "end": 5650.044,
    "text": " Any thoughts on action or like in your readings, where has action been integrated well or not with predictive coding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5651.185,
    "end": 5663.413,
    "text": "Well, I think that from my perspective, predictive coding wasn't really about action before this text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5663.753,
    "end": 5664.674,
    "text": "So it was,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5665.586,
    "end": 5674.129,
    "text": " new to me because I always relate action to predictive processing and active inference, not really predictive coding, so it was new.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.27,
    "end": 5692.657,
    "text": "And from all of this that we've been through, I found fascinating how the complexity grows and how many different applications predictive coding can be found on, especially in machine learning and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5693.513,
    "end": 5709.257,
    "text": " You know, all of this mathematical heaviness brings many, many different solutions to problems that we faced for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.317,
    "end": 5710.697,
    "text": "So fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5711.277,
    "end": 5711.538,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5711.958,
    "end": 5712.418,
    "text": "Yeah, agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5712.478,
    "end": 5713.578,
    "text": "It's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5714.198,
    "end": 5718.099,
    "text": "So just one more take on active inference, which we explored in 26 as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5721.505,
    "end": 5730.153,
    "text": " Like predictive coding, PID control optimizes a system towards a set point and is ideal for simple regulatory systems like thermostats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5731.174,
    "end": 5743.825,
    "text": "Action, A of T, so we're taking that same notion of A as being like something that influences observations, so that's how we introduce action into the model, is we make observations depend on action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5745.47,
    "end": 5746.991,
    "text": " Action is determined by three terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5747.712,
    "end": 5762.301,
    "text": "A proportional term, which minimizes the distance between the current location and the set point, P. An integral term, which minimizes the integral of this error over time, I. And a derivative term, which minimizes the derivative of the error, D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5763.442,
    "end": 5785.75,
    "text": " combination of the three terms produces a robust and simple control system which can be applied with some tuning to control almost any simple regulatory process and higher coordinates of motion could do even better but as we explored in 26 like often the pid is sufficient and so that's a very common engineering method and so it connects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5786.61,
    "end": 5796.523,
    "text": " the Bayesian mechanics of action and perception and cognition of active inference on generalized coordinates to PID control in the engineering setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5797.143,
    "end": 5799.346,
    "text": "And then they provide a bunch of other formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5801.449,
    "end": 5802.43,
    "text": "In Appendix B,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5803.697,
    "end": 5812.962,
    "text": " They give some detail on this idea of natural gradients, which I think we could go into in the dot one and in the dot two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5813.622,
    "end": 5826.309,
    "text": "So we won't talk about it here, but Appendix B is about precision as natural gradients, and Appendix C are providing some challenges for the neural implementation of backpropagation by predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5826.669,
    "end": 5831.672,
    "text": "So also we're not gonna explore it here, but those are both really interesting, short,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5832.452,
    "end": 5853.715,
    "text": " and very topical appendices in section five it's uh of quite good length and we're not going to cover actually any of it today because it's been a great and long enough dot zero but in the dot one and the dot two and beyond we hope to unpack the discussion and the future directions so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5854.738,
    "end": 5857.92,
    "text": " We have a lot of room and space for questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5858.721,
    "end": 5863.324,
    "text": "And I think we both or all walk out of this with more questions than answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5864.224,
    "end": 5867.646,
    "text": "But what would be your closing thoughts, Maria?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5873.29,
    "end": 5875.331,
    "text": "I'm not sure what to think now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5875.411,
    "end": 5878.994,
    "text": "I have to digest all the information we have here today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5879.854,
    "end": 5880.335,
    "text": "But...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5881.77,
    "end": 5888.693,
    "text": " I have this wish to continue with the understanding of formalisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.713,
    "end": 5893.535,
    "text": "I want to understand better what you said here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.855,
    "end": 5903.5,
    "text": "And I'm really excited about the biological part of predictive coding implementation and predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5904.24,
    "end": 5911.163,
    "text": "So as it is not really developed in this paper, I think that the author said",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5911.932,
    "end": 5914.953,
    "text": " that it's not really explored, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5916.233,
    "end": 5929.336,
    "text": "I have this idea of looking to it to see what's been doing in the past years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5931.377,
    "end": 5931.637,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5933.018,
    "end": 5936.002,
    "text": " Yeah, I think it'll be some fun upcoming discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5936.082,
    "end": 5941.33,
    "text": "Thanks so much for all the help and for this .zero and to Brock as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.911,
    "end": 5943.814,
    "text": "So see you around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5944.154,
    "end": 5944.615,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5946.257,
    "end": 5946.778,
    "text": "See you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5947.359,
    "end": 5947.519,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]