[
  {
    "start": 11.118,
    "end": 31.568,
    "text": " hello and welcome everyone to the active inference live stream i believe we are live it is active stream 9.0 and it is november 18 2020 i am daniel friedman and i will be doing a solo active stream today so welcome to team com everyone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.537,
    "end": 38.7,
    "text": " We are an experiment in online team communication, learning, and practice related to Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.44,
    "end": 49.964,
    "text": "You can find us on Twitter at Inference Active, at ActiveInference at gmail.com, our public Keybase team, at our YouTube channel, or through any other mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.484,
    "end": 56.147,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.324,
    "end": 59.606,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.346,
    "end": 69.393,
    "text": "And for video etiquette on live streams, make sure to mute if there's noise in the background, raise your hand so that we can hear from everyone on the stack, and use respectful speech behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.273,
    "end": 74.757,
    "text": "So just a quick announcement before we jump into the paper discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.397,
    "end": 79.32,
    "text": "You can find on our Twitter information about the rest of our discussions for 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.62,
    "end": 83.903,
    "text": "We have six more group Act Imp streams in 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.187,
    "end": 94.652,
    "text": " On November 24th and on December 1st, we're going to be in ACT-INF 9, discussing the Projective Consciousness Model and Phenomenal Selfhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.112,
    "end": 99.455,
    "text": "And that will be the paper that this ACT-INF Stream 9.0 is context for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.282,
    "end": 107.666,
    "text": " In Act Inf 10 on December 8th and 15th, we'll talk about the paper, A Variational Approach to Scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.426,
    "end": 118.694,
    "text": "While in Act Inf 11 on Sophisticated Affective Inference, we'll talk about more modeling and math again, and that will be on December 22nd and 29th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.754,
    "end": 120.435,
    "text": "So that will close out 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.235,
    "end": 126.479,
    "text": "And then we look forward to a whole new panel of events and projects, collaborators for 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.999,
    "end": 130.222,
    "text": "So find out more on our Twitter that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.161,
    "end": 135.703,
    "text": " Let's talk about what we're going to do in ACT-INF Stream 9.0, which is right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.363,
    "end": 145.426,
    "text": "So the goal of ACT-INF 9.0 is going to be to set the context for 9.1 and 9.2, which are going to be the group discussions that we have on these papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.186,
    "end": 154.669,
    "text": "And the paper that we're going to be discussing for 9.1 and 9.2 is called The Projective Consciousness Model and Phenomenal Selfhood by Willa Ford et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.689,
    "end": 154.669,
    "text": "2018."
  },
  {
    "start": 154.749,
    "end": 156.05,
    "text": "And there's a link that people can see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.511,
    "end": 167.278,
    "text": " The video that we're about to jump into right now is an introduction to the context of some of the ideas presented by the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.338,
    "end": 169.54,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.34,
    "end": 178.407,
    "text": "It will contextualize some of the ideas, math, and vocabulary that might be interesting or important to know for reading Williford et al. 2018.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.689,
    "end": 196.581,
    "text": " And the punchline that they're going to work their way towards is that we might be able to combine fields such as geometry, cybernetics, and neurophenomenology using the framework of active inference and the free energy principle to potentially understand or explain consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.822,
    "end": 204.828,
    "text": "So that's going to be up to you, up to us, how we feel about these kinds of claims that they're going to get to in the paper, but that's where we're headed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.649,
    "end": 208.491,
    "text": "And the sections of 9.0 will be as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.824,
    "end": 218.851,
    "text": " First, we'll go through the keywords and hopefully provide some background on the different keywords, whether it's your first time hearing one of these words or whether you're in one of these fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.631,
    "end": 225.055,
    "text": "And then we'll talk about the aims and claims of the paper, go through their abstract and the roadmap, the sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.116,
    "end": 229.759,
    "text": "Then we'll talk a little bit about consciousness from the author's perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.899,
    "end": 236.024,
    "text": "Just what do the authors say is important about consciousness and what do they think are invariant aspects of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.783,
    "end": 241.944,
    "text": " We'll then walk briefly through the figures, just try to understand what are these figures even doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.144,
    "end": 245.585,
    "text": "How are we going to get a first pass on understanding what these figures are all about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.265,
    "end": 251.686,
    "text": "And then in 9.1 and in 9.2, we're going to stay with this exact same paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.146,
    "end": 262.168,
    "text": "So save and submit your questions and feel free to get in touch with us if you'd like to participate, whether that's in 9.1.2 or in a future endeavor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 263.129,
    "end": 264.709,
    "text": "Let's talk about the keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.015,
    "end": 273.667,
    "text": " The first keyword is actually not on the paper keywords, but is what we're about here is active inference and the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.609,
    "end": 276.852,
    "text": "That's what we'll try to tie so much of this back to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.253,
    "end": 280.158,
    "text": "And here were the keywords that were listed, cybernetics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.018,
    "end": 289.72,
    "text": " projective geometry, consciousness, neurophenomenology, first person perspective, and perspectival imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.28,
    "end": 306.824,
    "text": "So cool terms, maybe it's your first time thinking about math and geometry in the context of consciousness, maybe it's not, but hopefully as I go through these following keywords, I hope that this is interesting and exciting, whatever level of familiarity you have with these concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.952,
    "end": 313.076,
    "text": " So first keyword is cybernetics, and it's also written there in Russian as Kubernetes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.836,
    "end": 327.567,
    "text": "And there's many resources to read on for the history of cybernetics, some of which we're going to talk about here, because in a lot of other active streams and other locations, you can probably hear about the mathematics underlying cybernetics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.127,
    "end": 351.466,
    "text": " and about how it's related to control theory both things that we've talked about on this stream but let's talk a little bit about just more historically or from a cultural perspective what is cybernetics what is it trying to do cybernetics is a school of thought tradition of action however you want to think about it that's related to the action policy selection and control of goal-oriented systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.526,
    "end": 357.192,
    "text": " Now, there's various orders of cybernetics, which we can sort of walk through here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.873,
    "end": 367.325,
    "text": "And I'll go through a couple of different resources on cybernetics, and hopefully you'll see soon why I put a history citation on the bottom left and a little bit of Russian on the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.465,
    "end": 370.909,
    "text": "And it's not just because we have great Russian colleagues in TeamCom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.71,
    "end": 373.231,
    "text": " Here are the orders of cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.691,
    "end": 376.072,
    "text": "There's probably different ways to state them or think about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.632,
    "end": 381.293,
    "text": "First order cybernetics might be thought of as self-regulation without detailed observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.774,
    "end": 387.636,
    "text": "So this could be like a negative feedback system that is able to maintain a semblance of homeostasis,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.456,
    "end": 390.798,
    "text": " in virtue of being an isolated or a closed process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.138,
    "end": 397.883,
    "text": "Like there's something that gets triggered when it's too hot, and then as soon as it's triggered that it's too hot, it instantly kicks in a cooling program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.544,
    "end": 404.308,
    "text": "Second-order cybernetics is self-regulation that can be influenced by observers within a domain of control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.808,
    "end": 415.036,
    "text": "So that could be, for example, a continuously varied thermometer that's able to enact different kinds of control policies as a function of continuous inputs from the thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.357,
    "end": 424.646,
    "text": " Third order cybernetics is self-regulation that is influenced by observation with a relational basis or an ecological grounding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.986,
    "end": 431.674,
    "text": "So the system in this third order cybernetic loop is able to acknowledge its surroundings and learn, develop, and evolve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.674,
    "end": 447.859,
    "text": " And fourth order cybernetics is when self-regulation involves the enactment of multiple different realities or adjacencies, affordances, counterfactuals, a lot of ways you can think about that in terms of a functioning creative observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.179,
    "end": 453.941,
    "text": "So these are deeply contextualized and integrated systems that are doing higher orders of cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.541,
    "end": 456.902,
    "text": "And I'm not a stickler about which order is which number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.262,
    "end": 462.064,
    "text": "I also on purpose drew the parallel with the one, two and three loop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.185,
    "end": 469.471,
    "text": " which is related to some decision-making theory from innovation and the entrepreneurship space, but I just thought it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.111,
    "end": 476.197,
    "text": "Here's a figure from the book chapter, Cybernetics in the 20th Century, on the bottom left there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.897,
    "end": 480.581,
    "text": "And it shows a map of concepts and how they're related to cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.221,
    "end": 489.804,
    "text": " So on the left are sort of two inputs to cybernetics, which are control theory and the idea of control, and then communication theory and the idea of communication and information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.124,
    "end": 504.589,
    "text": "And so those are two branches that we've talked a lot about on this stream and we will continue to be talking a lot about because control of action and communication and message passing, these kinds of things, inference is the thread that runs through them all, these kinds of things are critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.929,
    "end": 508.934,
    "text": " for control theory, for cybernetics, for the kinds of systems we want to get into working with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.454,
    "end": 519.085,
    "text": "On the right side, we see cybernetics branching back out into the machine area with the engineering sciences and the planning of, for example, complicated factory operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.006,
    "end": 522.068,
    "text": " but as well as into the animal and the social levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.568,
    "end": 530.974,
    "text": "So the animal cybernetics is about, for example, the self-regulation of behavior, and the social cybernetics could be about the way that our governance is run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.295,
    "end": 536.298,
    "text": "And there's a really interesting book, Red Plenty, that's kind of like historical fiction about cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.199,
    "end": 558.86,
    "text": " speaking of history this is such an interesting plot and it was in the cybernetics book figure one six it is the usage of the term cybernetics and control by years in the text of populations publications indexed by google scholar so caveats maybe people are speaking about it with different words or it's being used a different language not english or there's some other way of saying it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.4,
    "end": 573.957,
    "text": " But look at how similar these things are in terms of their trends, where both of them ramp up gradually, leading to, in early 2000s, a lot of discussion of cybernetics and of control, potentially looking backwards a couple years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.997,
    "end": 578.503,
    "text": "So think about these peaks in the early 2000s as potentially reflecting something at the close of the 1900s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.764,
    "end": 581.425,
    "text": " and then how they both start to drop off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.525,
    "end": 589.31,
    "text": "And this is consistent with something that a lot of us have experienced, which is that cybernetics is a term that a lot of at least English speakers may not be too familiar with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 589.69,
    "end": 592.452,
    "text": "But we can look at the journals that Fristin and others have published in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.692,
    "end": 594.594,
    "text": "We find a lot of connections to cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.726,
    "end": 616.056,
    "text": " what is going on there so to get a little sense of what is going on two other resources to look into would be this big history understanding of complexity information in cybernetics and then this book which i'll read a quote from right now which is called from newspeak to cyberspeak a history of soviet cybernetics by slava garevich and the author writes in this book from 2002",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.757,
    "end": 636.258,
    "text": " the history of soviet cybernetics followed a curious arc in the 1950s it was labeled a reactionary pseudoscience and a weapon of imperialist ideology with the arrival of khrushchev's political thaw however it was seen as an innocent victim of political oppression and it evolved from a movement for radical reform of the stalinist system of science",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.261,
    "end": 637.701,
    "text": " pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.362,
    "end": 649.387,
    "text": "In the early 1960s, it was hailed as a science in service of communism, but by the end of the decade, it had turned into a shallow, fashionable trend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.268,
    "end": 665.816,
    "text": "Using extensive new archival materials, Gerevich argues that these fluctuating attitudes reflected profound changes in scientific language and research methodology across disciplines, in power relationships within the scientific community, and in the political role of scientists and engineers in Soviet society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.596,
    "end": 674.642,
    "text": " His detailed analysis of scientific discourse shows how the newspeak of the late Stalinist period and the cyberspeak that challenged it eventually blended into cyber newspeak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.203,
    "end": 681.107,
    "text": "So maybe there was a book summary of this work, but pretty interesting how that plays out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.227,
    "end": 687.852,
    "text": "And so definitely we'd love to learn more about this, whether we have Russian speaking colleagues who could fill us in or anyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.933,
    "end": 689.474,
    "text": "Next keyword.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.438,
    "end": 691.478,
    "text": " Projective geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.199,
    "end": 693.84,
    "text": "What is projective geometry about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.0,
    "end": 701.783,
    "text": "Well, of course, you could go down the rabbit hole with this topic, but let's just try to keep it constrained to what the authors are going to use it for in terms of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.183,
    "end": 714.989,
    "text": "They write, the concept of a 4D, four-dimensional, projective transformation is central to the model as it yields an account of the link between perception, imagination, and multi-point of view action planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.529,
    "end": 721.551,
    "text": " Great, okay, so what is happening here and how can we understand this and its relationship to projective geometry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.391,
    "end": 725.552,
    "text": "I'm gonna introduce just two ideas here with this visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.992,
    "end": 731.454,
    "text": "The first by looking at the bottom is the distinction between the Euclidean and the non-Euclidean types of spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.254,
    "end": 742.537,
    "text": "And then the second idea with a purple arrow is this idea of a map or potentially you could call it a mapping because it's actually a process and it's actually a certain type of process, it's a projection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.177,
    "end": 751.48,
    "text": " So when we're talking about projective geometry, we're talking about geometry, which means the shape of things and the spaces that they're existing in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.74,
    "end": 759.362,
    "text": "So as opposed to topology, which is how things are connected with nodes and edges, geometry is about things and their shapes and their spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.083,
    "end": 769.886,
    "text": "We're going to talk about projections amongst different geometries, specifically, potentially this one between Euclidean and non-Euclidean geometries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.851,
    "end": 772.952,
    "text": " And here's a quote that they write, authors do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.493,
    "end": 788.223,
    "text": "They write, this perspectival phenomenal space, so the space in which they're going to say that experience occurs within, phenomenology occurs within a space, allows us to locate ourselves and navigate in an ambient space that is nevertheless essentially Euclidean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.763,
    "end": 797.929,
    "text": "However, in a Euclidean space, there are no privilege points, no points at infinity, no horizon, and an arbitrary origin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.089,
    "end": 800.451,
    "text": "They say there's no non-arbitrary origin, same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.112,
    "end": 816.108,
    "text": " This very strongly suggests that a non-Euclidean frame must be operating in the phenomenal space with the help of sensory motor calibrations to preserve the sense of the invariance of objects across the multiple perspectives adopted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.009,
    "end": 838.006,
    "text": " and relate the situated organism to the ambient euclidean space so what is it that allows me to continue thinking about this as a pen even as it comes very close to my face and looks very weird so what is that generative model that allows me to act like everything's normal as objects maintain their invariances as the eye travels through the space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.706,
    "end": 842.707,
    "text": " And so we can contrast this Euclidean space that they're supposing that we exist in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.867,
    "end": 848.169,
    "text": "They're saying we exist in a space that doesn't have privileged points of access, no points at infinity, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.289,
    "end": 860.772,
    "text": "And they're saying the space that an organism, for example, moves through is Euclidean, while the space that their consciousness is being projected into experientially is non-Euclidean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.292,
    "end": 862.713,
    "text": "What about it is non-Euclidean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.853,
    "end": 865.393,
    "text": "Well, let's just take the opposite of what's in red and put it in blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.874,
    "end": 867.434,
    "text": "So there are privileged points,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.734,
    "end": 868.956,
    "text": " from the point of view of the observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.117,
    "end": 871.501,
    "text": "That is the privilege point of view, quite literally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.302,
    "end": 873.745,
    "text": "There can be points at infinity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.025,
    "end": 877.812,
    "text": "There can be points that sort of just like, they're so far away, they're infinitely far away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.053,
    "end": 880.878,
    "text": "And not just from an affordance point of view, but from a perception point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.233,
    "end": 883.414,
    "text": " There can be a horizon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.834,
    "end": 884.815,
    "text": "In fact, we see it every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.635,
    "end": 892.14,
    "text": "And there can also be a non-arbitrary origin, which is a little bit of a restatement, the idea that there could be a privileged point, but basically it's privileged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.24,
    "end": 893.341,
    "text": "It's a non-arbitrary origin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.361,
    "end": 894.842,
    "text": "These are pretty similar concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.422,
    "end": 898.284,
    "text": "Now, non-Euclidean, it's like saying non-linear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.825,
    "end": 901.567,
    "text": "And the joke about this is things that are not elephants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.887,
    "end": 903.348,
    "text": "That's the non-elephant class.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.588,
    "end": 904.429,
    "text": "You'll know it when you see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.889,
    "end": 908.672,
    "text": "So that's about how helpful it is to say it's non-Euclidean or it's non-linear model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.412,
    "end": 910.252,
    "text": " Okay, we get it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.352,
    "end": 911.472,
    "text": "It's not a linear model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.853,
    "end": 913.853,
    "text": "It's not Euclidean geometry, but there's many choices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.373,
    "end": 921.575,
    "text": "And the reason why, even though it sounds like, wait, you're barely ruling anything out, we're actually ruling out very specific parts of the geometry of the Euclidean space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.895,
    "end": 928.536,
    "text": "So in the Euclidean space, parallel lines don't intersect, but that's not necessarily the case for certain types of geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.936,
    "end": 935.638,
    "text": "Or a triangle with three edges and three angles is 180 degrees from the sum of the angles, but on a sphere, it's not that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.198,
    "end": 944.724,
    "text": " So that is what is happening with these geometric projections is we're going to be projecting from sort of the grid they want to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.784,
    "end": 950.828,
    "text": "Now, you might want to ask Bucky Fuller if we're actually in a Euclidean space or if it just seems that way because of public education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.248,
    "end": 965.698,
    "text": "But for the purposes of this paper, we're in a Euclidean space as action, and that's the space we want to be making our perception simulate, so to speak, and to act like everything is normal and to decrease our uncertainty about a Euclideanly mapped space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.458,
    "end": 977.986,
    "text": " while also relating it to, through a projection, something that does have a privileged point of access and something that is, as they put it, informed by sensory motor calibration and relates to our action affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.446,
    "end": 984.71,
    "text": "So that's how you can have a Euclidean concept of, for example, a gap in the ground that you can't jump over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.211,
    "end": 991.455,
    "text": "So it's a very complex estimation of what you can do and how big the gap is and where you are, how much run-up you would need, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.995,
    "end": 995.858,
    "text": "All of that is going to come together by doing what they're going to talk about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.879,
    "end": 998.08,
    "text": " Now, consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.141,
    "end": 1006.087,
    "text": "It's great to talk about consciousness and I'm gonna go into a little bit of detail soon about some of my own thoughts on the issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.507,
    "end": 1010.51,
    "text": "But when talking about consciousness, it's important to be really clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.991,
    "end": 1020.579,
    "text": "Even though it's something that we're not always sure about, it's always important to at least use language very carefully and use our scholarship and our intercultural respectfulness very importantly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.679,
    "end": 1023.742,
    "text": "Because as I'll hopefully come back to a few points soon,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.202,
    "end": 1045.778,
    "text": " it's just a critical issue and we can't think of it um just flippantly the authors write when talking about consciousness because i want to just go with what they think about consciousness for here they write we might divide contemporary neuroscientific and psychological theories of consciousness into three main types the biofunctional the cognitive neurofunctional and the information theoretic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.279,
    "end": 1058.721,
    "text": " As should be clear, the projective consciousness model, the PCM, incorporates the emphasis on self-awareness common to many approaches to consciousness, as well as an emphasis on the biological functions of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.242,
    "end": 1061.962,
    "text": "So they're defining the space a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.982,
    "end": 1065.123,
    "text": "I'm going to define it a different way soon, but they're defining it that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.703,
    "end": 1067.423,
    "text": "Then we're going to insert the PCM here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.903,
    "end": 1075.265,
    "text": "And then they write at the end, the PCM thus subsumes and unifies the main insights in all of these approaches to consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.249,
    "end": 1087.374,
    "text": " Above all, what we add to pre-existing theory is a geometry, the thesis that projective transformations and projective frames necessarily subtend the appearance and workings of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.914,
    "end": 1102.18,
    "text": "So whatever we're going to learn in this Actim stream or whatever we think the PCM is doing, and we want to evaluate it not by what it doesn't do, but what it does do and what it claims to do, what it sets out to do, that's where they're trying to step in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.6,
    "end": 1118.811,
    "text": " their understanding of literature and consciousness is that they broke consciousness down into these three kinds, which citations exist there, you can read the paper, and then they're going to step into that gap, and then they're going to make the claim that they're subsuming and unifying the main insights from these approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.491,
    "end": 1121.973,
    "text": " Where does that leave these approaches from a theory perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.674,
    "end": 1123.535,
    "text": "Question for another day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.915,
    "end": 1127.218,
    "text": "But that is where the authors understand their work to be fitting in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.758,
    "end": 1134.544,
    "text": "So if you don't know what the PCM is, or it's kind of trippy to think about what it means to do mathematics and geometry of consciousness, that's perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.904,
    "end": 1137.507,
    "text": "Here is the blank that they're going to fill in with their work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.689,
    "end": 1160.278,
    "text": " what do i think about consciousness though and i want to be clear about what my stance is or at least just give the tip of the iceberg on my stance because this is a first person active stream and there's some relevant research i'll discuss in a few minutes and also i've just for a long time been interested in the science of consciousness but also this second layer of how it's communicated especially from scientists",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1161.297,
    "end": 1165.379,
    "text": " So there's a lot of places to go here and a lot of places to start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1165.839,
    "end": 1170.601,
    "text": "I'm just going to walk through a few general thoughts and raise a few questions, really more questions than answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1170.901,
    "end": 1176.403,
    "text": "And then I'll discuss a paper from the last couple of years with a colleague, Eric Sobik.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.637,
    "end": 1191.026,
    "text": " All right, so there are many ways to think about studying consciousness, and one path that you could go down, this is sort of, you know, across cultures through the time, one path you can go down is thought experimentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.226,
    "end": 1198.991,
    "text": "So this could look like meditation, it could look like a specific thought experiment, or some other sort of insight approach or a Gedanken approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.551,
    "end": 1203.254,
    "text": "And whether it's culturally called one thing or another is not as much my concern here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.434,
    "end": 1211.357,
    "text": " The thought experiment approach doesn't involve making interventions, for example, in the outside world, just thinking about consciousness, you know, hearing TED talks and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.997,
    "end": 1219.78,
    "text": "So the issue is that whatever is actually happening, if that's what we're pursuing, we could just be led to the wrong conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.241,
    "end": 1230.545,
    "text": "And then if there is some element of free will or interventionary role of consciousness, then we could intervene to end up believing that we couldn't intervene or any of these combinations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.445,
    "end": 1242.691,
    "text": " never quite understand the relationship between what one directly feels convinced about with respect to a thought experiment or a thought or an idea and how that might relate to how it actually is for people who aren't that person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.271,
    "end": 1249.955,
    "text": "And one aspect of this is that it's really impossible to know which aspects of thought experiments can be transferred to other situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.515,
    "end": 1257.599,
    "text": " So for example, one of the most famous papers in this area, most cited papers, is a 1974 paper by a philosopher named Nagel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.16,
    "end": 1260.881,
    "text": "And that raises the question, what is it like to be a bat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.042,
    "end": 1264.404,
    "text": "I don't think he invented that question, but he's the one who got famous for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.064,
    "end": 1273.009,
    "text": "And in that paper, it's written, an organism has conscious mental states if and only if there is something that it is like to be that organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.889,
    "end": 1276.191,
    "text": "Something it is like for the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.871,
    "end": 1277.792,
    "text": "Now, you might think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.264,
    "end": 1280.565,
    "text": " what are philosophers doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.305,
    "end": 1284.127,
    "text": "Because it sounds like a sort of a weird question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.527,
    "end": 1289.09,
    "text": "And I understand that many careers and a lot of good thinking has come out of this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.17,
    "end": 1291.932,
    "text": "So I want to optimistically see it as a catalyst and a seed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.712,
    "end": 1294.713,
    "text": "It's always good to have simple questions to return to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.813,
    "end": 1298.415,
    "text": "It's good that it's such a simple question and it opens to so many perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.796,
    "end": 1301.237,
    "text": "It initiates students into our knowledge traditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.537,
    "end": 1304.079,
    "text": "There's so many advantages to having these kinds of classic works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.679,
    "end": 1317.624,
    "text": " But to be blunt, I guess, I find the phrasing of this question of consciousness to be quite unhelpful because it is so informal, it's so hypothetical, it's untestable, it's ambiguous, but it's specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.704,
    "end": 1319.145,
    "text": "It brings a bat into question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.645,
    "end": 1321.125,
    "text": "And then you can imagine, oh, it's a dog.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.145,
    "end": 1322.046,
    "text": "What is it like to be a dog?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.506,
    "end": 1328.072,
    "text": " Now, these are all good things to imagine, but again, they don't really bring us closer to addressing real frameworks for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.673,
    "end": 1337.343,
    "text": "And the reality is there's been now a vast wasteland of literature that's just not comparable to other work in the same exact space across different species that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.523,
    "end": 1347.888,
    "text": " essentially amounts to speculation and appealing to what it might be like to be a certain type of animal, thinking, well, if I was really a bat and I grew up as a bat, would I ever thought what it was like to be a human?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.908,
    "end": 1352.73,
    "text": "So it ties up to all these second level questions that aren't super relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.511,
    "end": 1363.315,
    "text": " We've always wondered through time, every culture, everyone has wondered what other systems experience, whether that's in a person or an animal or a fictional character or a physical object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.715,
    "end": 1370.038,
    "text": "So the speculation and the think pieces, they don't really add something substantial to the literature, which is what the scientific literature is about for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.618,
    "end": 1371.479,
    "text": "So the bigger issue though,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.259,
    "end": 1381.482,
    "text": " with thought experiments of any kind is that we can always imagine things that are just not making sense within a framework or any framework, or just don't relate to the world that we live in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.182,
    "end": 1385.303,
    "text": "We all know that we can be wrong about an idea, but believe that we're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.923,
    "end": 1394.445,
    "text": "And so to kind of rephrase that in an active inference framework, we can say that these are situations where the precision parameter is very high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.725,
    "end": 1399.807,
    "text": "There's a belief, a metacognitive belief that the precision is high, that some question has been resolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.088,
    "end": 1409.695,
    "text": " This represents that, for example, someone's model of consciousness, whether it came from a knowledge tradition or their own thinking, they believe that they're onto it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.735,
    "end": 1411.497,
    "text": "They got it figured out, it's resolved for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.098,
    "end": 1417.643,
    "text": "But that doesn't mean that your S, your estimate, is related to S hat, the actual state in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.163,
    "end": 1426.666,
    "text": " And I'm not passing judgment on being overconfident or being wrong, because sometimes it can be very important and powerful to have these kinds of beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.166,
    "end": 1429.287,
    "text": "But that's not what being correct is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.747,
    "end": 1438.33,
    "text": "And so if you actually don't care about being correct, being right, going towards the truth, and you really don't care about that, then I'd love to hear where you're coming from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.811,
    "end": 1442.792,
    "text": "The rest of the scientific literature, although with many...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.752,
    "end": 1472.668,
    "text": " shades and many differences is moving towards what actually would be general as generalizable through truth so let's go back to consider experimental approaches which is something that comes up a ton in the philosophy and the science of consciousness literature now it would be awesome to do experiments on consciousness and in some way don't we all we could study humans as they behave and sleep and daydream take psychedelics or they wake up for anesthesia and they develop and there's so many things that could be exciting to learn about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.388,
    "end": 1476.949,
    "text": " Also, if we can do experiments on consciousness, we could do experiments on animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.409,
    "end": 1483.752,
    "text": "Now, we could do experiments that are interventive, like manipulating the brain of an animal or the body or the situation of an animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1484.152,
    "end": 1489.314,
    "text": "These experiments might be seen as inhumane or just to massively violate ethical standards for humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.054,
    "end": 1502.64,
    "text": " And so there's a bit of irony in doing these potentially invasive non-consensual experiments with captive or wild animals when we're studying potentially their capacity to not consent to our discussions with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.121,
    "end": 1505.381,
    "text": "It's an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.421,
    "end": 1515.006,
    "text": "I won't go down the ethics route here, but a non-ethical question that's related to experimentation is that we just don't know which systems to study or what observables to measure for experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.686,
    "end": 1525.451,
    "text": " And so we're studying something that isn't really measurable or observable, but we'll come back to this idea of observability in a few minutes when we're talking about neurophenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.392,
    "end": 1543.22,
    "text": "And the reality is no matter what you do measure, even if you come up with this one special measurement that hasn't been done before, all experiments are interpreted within a cultural and a scientific milieu in terms of what measurements, conclusions, interpretations are ethical, correct, accepted, valid, discussed, all these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.041,
    "end": 1544.121,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.061,
    "end": 1550.787,
    "text": " Even going another layer back about experiments, even assuming that we can measure what we want to know and measure and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.568,
    "end": 1565.163,
    "text": "Experiments, especially if they're disconnected from grounding in theory, it's difficult to know what is really being uniquely tested or demonstrated or falsified by different kinds of experiments or what we can learn from different kinds of measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.265,
    "end": 1584.26,
    "text": " there's a lot of ambiguity a lot of levels the ambiguity can enter into but just to give a few examples an experimental result could be consistent with many different frameworks or potentially all frameworks or a set of frameworks for consciousness so when we really want to be identifying what frameworks we're wanting to work with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.921,
    "end": 1588.783,
    "text": " it doesn't narrow the space as much to do experiments, which we'll return to soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.223,
    "end": 1599.408,
    "text": "And that's kind of related like the neural correlates of consciousness debate, which is, do you put somebody in a neuro imager and then have them do a no report paradigm where they don't say, yep, I heard the sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.788,
    "end": 1603.77,
    "text": "So you play sounds of different notes, but what if it just subconsciously",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.21,
    "end": 1620.684,
    "text": " influence their brain there still could be a neural signature of that how would you know they experienced it well that's called a report paradigm you ask them did you experience it but in some sense you're just asking them if they remember or if they hit the button so it gets messy but that really gets into some of the weeds about what you're measuring and another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.605,
    "end": 1643.752,
    "text": " example or area where we see limitations on experiments related to consciousness is in animal behavior so animal behavior seems naturally like it'd be adjacent to human consciousness studies and we see a wide variety of things being used here like pulley tests can two of the same animal pull a pulley so they get a reward looking in a mirror can one recognize themselves and take an action pattern to clean themselves in the mirror",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.372,
    "end": 1656.289,
    "text": " And the first thing to note is that whatever kind of setup you're dealing with, a visual illusion, a cooperation task, a recognition task, memory, planning, they're always going to be based upon the affordances of that animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1656.849,
    "end": 1661.155,
    "text": "And again, it might be ambiguous as to whether they're using some cue that you actually expect,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.196,
    "end": 1664.878,
    "text": " or if it doesn't see, it's not going to be able to be in the mirror test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.118,
    "end": 1678.825,
    "text": "So at the very least, these tests for consciousness, which we'll get back to, don't help us really study the ground rock of this frameworks for consciousness question, because all you could say is, okay, this bird can do the pulley test, but we don't even know what that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.865,
    "end": 1687.43,
    "text": "And then of course, if we find out that potentially experience isn't related as much as we thought to behavior, or one has a model that it's not related to behavior,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.85,
    "end": 1690.771,
    "text": " then you can say, yeah, it's a robot that just acts like it's a crow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.291,
    "end": 1691.531,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.551,
    "end": 1693.772,
    "text": "I think I'm still streaming, but it looks like my camera froze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.812,
    "end": 1695.372,
    "text": "I'm going to just re-plug it in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.953,
    "end": 1698.333,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1698.914,
    "end": 1705.916,
    "text": "Actually, I'll just see if... I don't know what it's about, but that happened last time as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.316,
    "end": 1708.137,
    "text": "But c'est la vie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.417,
    "end": 1710.177,
    "text": "I'll just close the camera for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.781,
    "end": 1739.965,
    "text": " actually let me just see if i can remove the source and then add the camera back in we're going to find out live whether it is obs being weird or whether it is um the actual usb connection and turns out it was obs we now know and we're right back in it so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.458,
    "end": 1749.514,
    "text": " to the point about potentially robots or zombies, as Dennett might put it, doing complex behavioral tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.727,
    "end": 1757.21,
    "text": " You wouldn't know whether the experience was being had even if the behavioral experiment you had lined up for this animal was enormously complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.05,
    "end": 1766.754,
    "text": "And robots might be able to do things that we might not expect them to be able to do already, such as learning language or being culturally embedded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.235,
    "end": 1776.219,
    "text": "And so yet another point here is that before you get too excited about any single experiment that might prove or disprove a model of consciousness,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.299,
    "end": 1780.121,
    "text": " consider it just another grain of sand on a sand heap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.681,
    "end": 1786.724,
    "text": "And any single grain of sand that you're adding to this heap now could be the one that sets the whole cascade in motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.084,
    "end": 1789.105,
    "text": "So by all means, I encourage experimentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.666,
    "end": 1804.374,
    "text": "But that being said, let's not fool ourselves in pretending that many of the data points we already have are out there in the world already, and that just one more experiment is unlikely to provide any type of knockout evidence for or against a model of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.174,
    "end": 1827.593,
    "text": " so to kind of um recap there there's the thought experiment branch the philosophy meditation insight route and there's the experimentation interpretation route and uh those are connected of course experiments are ideas too but that being said they both have pros and cons and people will often argue one or the other as if they have um the answers from one branch or the other i hope i've demonstrated that that isn't true and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.034,
    "end": 1846.919,
    "text": " one reason i think that it's important to have this viewpoint is that we're living in a world just as a prima fascia observation where there's some people humans who say that they think all things are consciousness or that all things are consciousness in their own special way or that nothing is conscious including humans",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.719,
    "end": 1852.623,
    "text": " And of course, there's many flavors to each of these viewpoints that could be held or at least communicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.283,
    "end": 1858.707,
    "text": "And there's many things about beliefs about consciousness that might not be verbal or expressible in a certain language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.308,
    "end": 1870.256,
    "text": "So the point is we're in a total state where the evidence in the world has resulted in people believing different things through time, different things, even within the same family.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.856,
    "end": 1895.667,
    "text": " and so let's be humble the table has mostly been set for us in terms of observations about ourselves and about our world though it doesn't mean we can't reimagine much of our own experience or the world but um it would really have to be quite the thought experiment or quite the experiment uh in the real world if it can resolve these long-standing and philosophically grounded differences in worldview between schools of thought and between people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.207,
    "end": 1903.611,
    "text": " And even if it did this, even if the experiment were so good that it just convinced everyone, it wouldn't even mean it was right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.951,
    "end": 1906.112,
    "text": "It would just mean that it was convincing as a meme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.573,
    "end": 1920.64,
    "text": "And so if we're really trying to find out what's right rather than how can we shape our own reality and other people's, which isn't always the worst task, if we want to be right, then as far as I know, it's not going to be the experiment or the thought experiment route alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.461,
    "end": 1921.521,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.947,
    "end": 1935.687,
    "text": " One last point on this slide, because there's a lot to say here is that there's academics who believe different things and you can see these slides and citations and see that they cite different work that says one thing about the global workspace or another thing about information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.792,
    "end": 1950.222,
    "text": " There's also different views on consciousness from different world traditions, from artists, from practitioners, from non-scientists, from non-philosophers, from all kinds of people, children, adults, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.042,
    "end": 1957.327,
    "text": "This is just to say that we should be very cautious about any kind of hegemonic, especially scientific, effort",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.127,
    "end": 1982.37,
    "text": " Define consciousness whether it comes from academia or from some other source There's just way too much on the table here for people to be making sweeping claims about what is or is not conscious And there's a lot that is downstream of that It's really a personal and a cultural thing what somebody believes about consciousness what they want to say or what they want to commit to and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.117,
    "end": 1988.504,
    "text": " Also, while some people might find these topics exciting, I think they're exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.585,
    "end": 1995.82,
    "text": "If you're listening, you probably find them to some extent exciting as well, but many people are not interested in considering it and don't,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.062,
    "end": 2000.605,
    "text": " perhaps want to be told this is how their consciousness or experience is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.546,
    "end": 2005.05,
    "text": "And other people are simply okay not knowing whether they're curious about it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.831,
    "end": 2012.237,
    "text": "And so I'm always skeptical about science says type thinking, which can be often how scientific papers are written.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.917,
    "end": 2016.801,
    "text": "Even if it's written in an author's say type thinking, it's about how it's communicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.101,
    "end": 2021.265,
    "text": "We've all seen the misuse of science says policy related to everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.086,
    "end": 2025.268,
    "text": " And consciousness would be the next level on that, wouldn't it be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.588,
    "end": 2026.549,
    "text": "So fill in the blanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.989,
    "end": 2035.874,
    "text": "Think about what kind of power is held by the people who can say what or who is consciousness or evaluate conscious states such as suffering or pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.575,
    "end": 2038.056,
    "text": "So there's just a lot to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.556,
    "end": 2046.441,
    "text": "And then the last point really here is that people can change their beliefs during their own lifetime and go deeper and shallower into different ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.881,
    "end": 2049.683,
    "text": "And that probably doesn't change the underlying nature of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.023,
    "end": 2051.084,
    "text": "So it will never be enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.584,
    "end": 2054.765,
    "text": " how we think at one moment, or for a group of people to believe something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2055.245,
    "end": 2059.887,
    "text": "I've gone down these discussions and roads many times with people alone and in conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.347,
    "end": 2065.889,
    "text": "And people will tell me, well, you know, we're working with our best possible understanding of consciousness given the research at this time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.61,
    "end": 2068.25,
    "text": "And it's just simply not true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.45,
    "end": 2080.775,
    "text": "There's so much to know and respect in terms of the research and also the non-scientific literature on consciousness that there is just a lot more to the discussion than, well, let's just tell the kids something simple to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.909,
    "end": 2092.932,
    "text": " Now, to go beyond that, and thanks for bearing with me, it was just, I wanted to say a few of those things because a lot of times consciousness papers are approached from non-scientists with excitement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.292,
    "end": 2105.555,
    "text": "So I wanna provide a little bit more of a nuanced scientist's take here on how we can really respectfully study consciousness, because this isn't just like Fristin at all figuring it out in a paper, but I love the paper and it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.715,
    "end": 2108.256,
    "text": "So how do we hold this yes and perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.039,
    "end": 2112.741,
    "text": " through nuance, hearing multiple people's perspective, having participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.522,
    "end": 2128.172,
    "text": "So what I'm going to talk about here is this paper that I worked on with my colleague Erik Sovik, who's a professor in Norway, and the paper is called The Ant Colony as a Test for Scientific Theories of Consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.452,
    "end": 2131.654,
    "text": "So this is how I came to be thinking about a lot of these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.476,
    "end": 2137.859,
    "text": " Professor Sovek's background was in neurobehavior and in genetics of the honeybee.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.139,
    "end": 2140.341,
    "text": "Mine was in similar areas, but related to ants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.261,
    "end": 2144.964,
    "text": "Eric is also a very pragmatic and a philosophical thinker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.605,
    "end": 2152.649,
    "text": "His PhD advisor, who is Andy Barron, at Macquarie University in Australia, is a honeybee biologist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.31,
    "end": 2160.215,
    "text": "And Professor Barron has also written philosophy papers that are related to entomology, as well as to experience and consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.153,
    "end": 2172.205,
    "text": " Uh, on my side, my PhD advisor, professor Deborah Gordon at Stanford is an ant behavioral ecologist who also wrote a lot of philosophy works broadly construed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.866,
    "end": 2180.594,
    "text": "And so both Eric and I had really positive mentors and role models for how we could combine entomology with philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.954,
    "end": 2196.228,
    "text": " So that's where we were coming from with this paper was how could we combine our direct ethological, behavioral ecological experience with the social insects, with what we knew about neurogenetics and molecular biology, and then tie that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.909,
    "end": 2200.89,
    "text": " through respectful engagement with some of the philosophy of consciousness literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.59,
    "end": 2203.691,
    "text": "Here's what we didn't do in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.071,
    "end": 2212.693,
    "text": "What we didn't do is make a claim or a bet on whether ant colonies are conscious or not, whether ant workers are conscious or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.333,
    "end": 2217.215,
    "text": "If people have feelings on that, let's hear about them on the ACT-M stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.255,
    "end": 2218.435,
    "text": "Let's find an ant stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.495,
    "end": 2219.455,
    "text": "Let's do something fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.835,
    "end": 2220.395,
    "text": "Let's hear about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.435,
    "end": 2222.396,
    "text": "But that's actually not what we did in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.735,
    "end": 2225.036,
    "text": " We do a few things in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.316,
    "end": 2233.202,
    "text": "The first thing is that we proposed this terminology of a forward and a reverse test for consciousness, which I'm gonna return to in a second with this image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.923,
    "end": 2242.429,
    "text": "The second thing we did was to review the literature on consciousness from scientific literature and make classification schemes for different kinds of theories of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.829,
    "end": 2251.076,
    "text": "So you can see why I was interested in the breakdown of this paper's understanding about the fields of different scientific studies of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.636,
    "end": 2272.863,
    "text": " and then the third part of the paper we used empirical findings from entomology so observations of morphology or of behavior of individuals or of colonies from entomology and we asked whether different frameworks for consciousness that we found during the literature review might come to the conclusion that ant colonies and or workers had consciousness or awareness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.863,
    "end": 2297.514,
    "text": " and we as authors remained neutral on the issue to the extent we could as far as just presenting hypothetical evaluations of colony consciousness from the point of view of these different frameworks which is something that's so intrinsic to consciousness so it's kind of fun and it turns out that frameworks just simply wildly diverge in their claims about ant colony consciousness and it's really not a surprise that it turned out to be that way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.314,
    "end": 2312.331,
    "text": " because the same frameworks uh diverge in their claims pretty plainly and people diverge in their opinions and so if the frameworks are going to disagree about humans being conscious or electrons then they're going to disagree about ants and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.686,
    "end": 2325.054,
    "text": " It was just interesting to experience this, though, and ask how we could have a reconsideration of what we're really doing here with the consciousness studies area, because there's thousands of speculative papers about consciousness and animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.114,
    "end": 2326.135,
    "text": "But are we moving the needle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.275,
    "end": 2327.796,
    "text": "And if we are, in what direction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.816,
    "end": 2329.177,
    "text": "Is that where we want to be moving it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.265,
    "end": 2331.045,
    "text": " What did we do in the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.625,
    "end": 2336.787,
    "text": "So we introduced this idea of a forward and a reverse test for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.147,
    "end": 2341.548,
    "text": "And we thought about forward and reverse just from the point of view of the observer, the experimenter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.968,
    "end": 2348.47,
    "text": "So that's very related to this phenomenological invariant idea that the PCM model is going to return to in a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.19,
    "end": 2351.811,
    "text": "And this idea that everything in consciousness should be relational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.111,
    "end": 2356.072,
    "text": "Let's take this perspectival and this relational approach very seriously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.832,
    "end": 2358.633,
    "text": " So what is a forward and reverse test?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.053,
    "end": 2366.595,
    "text": "A forward test is when you trust your test and it describes the mode of usage of a tool where you're measuring systems and drawing conclusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.096,
    "end": 2369.837,
    "text": "So for example, in the figure, it says, I trust my test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.977,
    "end": 2371.077,
    "text": "How heavy are these boxes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.177,
    "end": 2372.277,
    "text": "And we have this gray test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.758,
    "end": 2376.439,
    "text": "It says it is an unknown whether the box is conscious or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.119,
    "end": 2378.661,
    "text": " We put it on there, it says, yep, one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.161,
    "end": 2384.726,
    "text": "And then we go out in the world and we investigate whether different boxes are different weights or I have consciousness or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.367,
    "end": 2388.29,
    "text": "And that is for validated, calibrated instrumentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.75,
    "end": 2395.576,
    "text": "And it's important for the normal in a paradigm vocabulary, the normal science, which is advancing science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.437,
    "end": 2418.377,
    "text": " and a reverse test is a different phase a reverse test is when you don't trust your test yet and this is like calibration and calibration is when you take things that you do know about like we know that the meter is this much relative to this and we know that the wavelength of this is going to help us calibrate this tool but really just when you use a scientific instrument it has to be calibrated and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.838,
    "end": 2422.641,
    "text": " If we want to have a science of consciousness, we have to have a calibrated instrument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.101,
    "end": 2434.511,
    "text": "And so the reverse test is when you don't trust the test and you don't know what the machine is going to read out, but you put on the one pound block and you say, I'm going to fine tune this machine so that it comes out with one when I put the one on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.591,
    "end": 2437.914,
    "text": "And then we'll know that this scale or this spectrophotometer works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.575,
    "end": 2441.777,
    "text": "And it's kind of this back and forth, this two stroke engine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.438,
    "end": 2443.738,
    "text": " that we've seen so much about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.358,
    "end": 2449.499,
    "text": "And we've been talking about the back and forth between action and inference, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.019,
    "end": 2462.142,
    "text": "We've been talking about that from the framework of computationalism, from the Bayesian perspective, the Bayesian structuralist perspective, in activism and ecological psychology, and just cognition in general, agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.482,
    "end": 2469.963,
    "text": "How do we do this forward and backwards of more tool-like based upon affordances and more inference based upon observations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.905,
    "end": 2476.868,
    "text": " Okay, so it's kind of a two-stroke engine for studying consciousness from a field perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.088,
    "end": 2480.229,
    "text": "So this is like, what should the field of consciousness researchers be studying?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.73,
    "end": 2485.352,
    "text": "Now, wouldn't it be great if we had a forward test for consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.812,
    "end": 2491.915,
    "text": "If we had a scale that we could go, yep, we hooked up this person's brain or this Wi-Fi router or this beetle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.335,
    "end": 2493.556,
    "text": "And yeah, it's a two out of four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.616,
    "end": 2494.696,
    "text": "It's a 2.9 out of whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.613,
    "end": 2498.014,
    "text": " Yeah, sounds great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.495,
    "end": 2502.419,
    "text": "I understand why people want to mathematize and why they want to measure a consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.019,
    "end": 2517.373,
    "text": "But if you meet somebody who has a good test for consciousness, then, you know, get the Tesla tech, get the perpetual motion machine, get everything you can from that person because we don't see it within the current space we're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.614,
    "end": 2524.677,
    "text": " we want to have this test, prefrontal cortex, language, whatever it happens to be, no caveats, just a test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.097,
    "end": 2526.318,
    "text": "Of course it doesn't exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.678,
    "end": 2528.338,
    "text": "And so that's kind of what this issue is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.939,
    "end": 2535.922,
    "text": "And so when we don't have a forward test for consciousness, even though people might think they locally have one, I hope I've sort of dispelled that with a previous slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.822,
    "end": 2544.846,
    "text": "If we don't have a forward test to operate in the action mode, do we have a reverse test to help us work in the inference mode?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.606,
    "end": 2556.02,
    "text": " So that is where Professor Sovik and I wanted to think about different kinds of forward tests for consciousness, and then how could the ant colony be a reverse test for consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.46,
    "end": 2561.287,
    "text": "So here's the framework that we loosely organized into for our literature framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.102,
    "end": 2564.902,
    "text": " in terms of forward tests for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.982,
    "end": 2567.963,
    "text": "So this is like what other people might call frameworks for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.723,
    "end": 2581.345,
    "text": "We said, look, all these models, what they have in common is that there's some measurements, some tool-like intervention or intervention into the process or measurement that could be done that would help us have a forward test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.725,
    "end": 2583.246,
    "text": "So like, is this system conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.346,
    "end": 2584.286,
    "text": "Does it have X?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.506,
    "end": 2585.406,
    "text": "Does it have language?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.426,
    "end": 2586.706,
    "text": "Does it have a prefrontal cortex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.006,
    "end": 2587.226,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.786,
    "end": 2591.407,
    "text": "Now the reverse test for consciousness would be like, we know humans are conscious, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.727,
    "end": 2593.87,
    "text": " So any theory that says that is fine with me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.251,
    "end": 2596.114,
    "text": "Or we know humans are not conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.234,
    "end": 2598.457,
    "text": "So I rule out any theory that says that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.298,
    "end": 2601.822,
    "text": "Whichever one you think you believe, fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.109,
    "end": 2605.532,
    "text": " So we separated into a few different categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.572,
    "end": 2607.273,
    "text": "The first one was neurobiological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.333,
    "end": 2613.079,
    "text": "So remember that they had three categories, biofunctional, cognitive neurofunctional, and information theoretic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.86,
    "end": 2622.349,
    "text": "What we did with our slightly different breakdown of the categories in the space, not a final word, this is just what we had found out about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.75,
    "end": 2640.673,
    "text": " is we divided neurobiological models into the following categories which were structural models that were based upon macro or micro uh structure so macro structure would be like the cerebral cortex is this size or it has this brain region so gross anatomy macro structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.434,
    "end": 2665.579,
    "text": " microstructure is like wow there are so many connections on the dendrites or this cell type has this shape so things that you'd need a microscope to see macro macro to micro so you need the microscope for the micro histology or oh the architecture of these neural networks is a feedback that means that it could be implementing something so macro microstructure of the brain neurobiology or of the brain in the body for that matter because it's not always about the brain so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.579,
    "end": 2690.311,
    "text": " functionalist models for consciousness would be like there is a function that does egocentric navigation in crawfish and crows and humans so these are conscious entities so because there's a functional element of something that's being done even if it's being done in non-homologous brain regions or two different ways by two different species or in somebody who is born with vision or who wasn't born with vision it's the function that matters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.911,
    "end": 2698.055,
    "text": " And then another neurobiological assessment that people often make in terms of forward testing is dynamical features of brain function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.415,
    "end": 2713.103,
    "text": "So they'll say, well, because the brain is a complex adaptive system with winnerless competitions and leaky integration and action policy selection and lock and Voltaire, you know, predator prey type dynamics or chaos and landslides catastrophes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.683,
    "end": 2720.895,
    "text": " power tail of noise, all of these dynamical features coming from usually a complexity or a signal processing perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.416,
    "end": 2725.263,
    "text": "So those are the kinds of appeals that people make to the brain and the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.125,
    "end": 2733.431,
    "text": " There's also the egocentric and relational frameworks for thinking about what counts as a model of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.052,
    "end": 2743.08,
    "text": "And in this category, there's a bunch that we could go into, but just to make it kind of clear what I mean by egocentric and relational, which is actually the first invariant principle of the PCM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.14,
    "end": 2744.601,
    "text": "So totally agree, it's critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.302,
    "end": 2766.696,
    "text": " it's um the idea of spatial awareness and perception which is um whether it's the lived experience or just the acting as if of things being closer to you being more accessible but everything in consciousness is experienced in relation to something that's agreed upon even when people don't even agree what that relationship is or what that something is so that's kind of cool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.32,
    "end": 2770.722,
    "text": " Then there are cognitive and behavioral frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.762,
    "end": 2781.968,
    "text": "So these are cognitive being broadly understood as like things that computers might be able to do or computer networks or extended cognition, embedded, enacted, and cultured, all this stuff that we talk about every week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.569,
    "end": 2784.51,
    "text": "Let's take that broadly to cognitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.63,
    "end": 2791.934,
    "text": "So here by cognitive, I don't just mean what people think of happening between the student's eye and them filling in the multiple choice test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.374,
    "end": 2793.375,
    "text": "That's not just cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.635,
    "end": 2799.499,
    "text": " We want to have a broad understanding of cognition, multiscale, message passing, Bayesian nets, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.22,
    "end": 2810.367,
    "text": "And the categories here are, there's multiple, but examples are like emotional or affective states, kind of foreshadowing the sophisticated affective inference, which will be Actim 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.368,
    "end": 2817.654,
    "text": " but emotional states like regret or optimism bias and cognitive biases more general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.054,
    "end": 2826.842,
    "text": "So everything from visual illusions to other types of illusions that are not visual, but can be related to the order of things being presented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.523,
    "end": 2831.864,
    "text": " These are sort of cognitive effects that potentially like a neural network might fall victim to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.424,
    "end": 2838.786,
    "text": "And so what we've experienced is that there's this runaround and people will say, well, this bird has this brain region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.866,
    "end": 2840.187,
    "text": "So it's a macro structural claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.227,
    "end": 2840.727,
    "text": "So it's conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.867,
    "end": 2844.368,
    "text": "And then somebody brings up a shortcoming of the idea of macro structuralism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.688,
    "end": 2873.712,
    "text": " like well does it really mean that it's aware just because it has this brain region what about sleeping people or what about you know daniel dennett or something like that and they go well right it's actually the brain region and the microstructure okay so it's microstructural great well then would anything with that microstructure have that kind of a characteristic um like if you made a model in a computer would it have awareness well no it has to be evolved or it has to have language or it has to be implementing something ecologically great so we want to chase that rabbit down",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.352,
    "end": 2876.173,
    "text": " because we're serious about answers here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.693,
    "end": 2877.954,
    "text": "And so we want to chase it down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.014,
    "end": 2880.695,
    "text": "Someone says, oh, well, when I said language, I didn't just mean a chat bot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.155,
    "end": 2883.236,
    "text": "I meant they feel emotion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.656,
    "end": 2886.197,
    "text": "You say, well, but what if the chat bot says it feels emotion too?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2886.257,
    "end": 2886.898,
    "text": "What are you going to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.498,
    "end": 2893.781,
    "text": "And then all of a sudden that whole feeling emotion, communication of a feeling emotion, all of a sudden they have a new explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.201,
    "end": 2896.942,
    "text": "So let's keep on chasing down these rabbit holes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.523,
    "end": 2902.025,
    "text": "And one other category that is closest to what is described in this paper is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.965,
    "end": 2904.285,
    "text": " is the mathematical framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.305,
    "end": 2914.668,
    "text": "So we took a step beyond the authors in the 2018 paper, the projective consciousness model, where they said there's the information theory category of consciousness models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.068,
    "end": 2918.729,
    "text": "We actually separated a few of these models of mathematical frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.789,
    "end": 2924.771,
    "text": "So we have decision-making and long-term planning, as well as information theoretic and geometrical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.111,
    "end": 2937.94,
    "text": " So there have been some, maybe it was published similar or slightly after this paper, but there have been some geometric theory of consciousness, info theory, and then also a lot of times the information theory approaches deal with information geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.341,
    "end": 2939.502,
    "text": "So which one is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.549,
    "end": 2948.876,
    "text": " I agree that it's enough to call it mathematical and just say it includes topology, information theory, thermodynamics, geometry, just a lot of math stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.897,
    "end": 2959.045,
    "text": "Another area of mathematical frameworks for consciousness could be like cybernetics, which is why it was one of the keywords for this paper, because a mathematical framework for consciousness might involve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.625,
    "end": 2964.552,
    "text": " decision-making or agency or ability to plan at a certain level of coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.012,
    "end": 2975.847,
    "text": "And in fact, in the 2018 interview that was with Carl Fristin, myself, and our passed away colleague, Martin Forger, in the last question of that interview, I asked him,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.508,
    "end": 2987.377,
    "text": " whether he thought the ant colony was conscious, because I was working on this paper with Eric, and I was writing the interview with Carl, and then I just thought, wow, we could figure out what Carl thinks about ant colonies being conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.878,
    "end": 2995.544,
    "text": "And if you're interested in either Fristinology or in ant colony consciousness, then definitely review Carl's answer on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.945,
    "end": 2997.526,
    "text": "But just to kind of close this slide off,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.627,
    "end": 3024.62,
    "text": " we're committed to long-term clarity on these issues about the study of the science of consciousness so we really welcome collaboration or improvement on these questions let's work with it let's make an ontology for consciousness or how are we going to get organized on this issue because as i said there's just too much on the table to let this one slide and we have to enter this space and do it right because otherwise just it goes off the rails",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.153,
    "end": 3031.156,
    "text": " Okay, let's get to neurophenomenology, which is one of the keywords of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.336,
    "end": 3032.177,
    "text": "Oh yeah, the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.677,
    "end": 3035.679,
    "text": "And on the bottom here, I have a couple just fun images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.019,
    "end": 3043.684,
    "text": "The left side is the book GEB by Douglas Hofstetter, 1979, but reads as crisply as ever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.725,
    "end": 3064.752,
    "text": " and uh really an insightful book and then on the other side uh of uh is the tree of knowledge this yellow cover by varela and maturana and that's a book about autopoiesis and a few other topics that are really cool related to complexity and just very deeply related to the ecological and activist semantic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.712,
    "end": 3067.534,
    "text": " Biobehavioral, a lot of great stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.934,
    "end": 3071.978,
    "text": "Also, potentially the work of Fritjof Capra is one thing to look into here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3072.038,
    "end": 3074.701,
    "text": "But then some images, because it's not all about language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.041,
    "end": 3077.043,
    "text": "So here's some images by Magritte and by M.C.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.123,
    "end": 3080.346,
    "text": "Escher that have to do with sort of what is this self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.027,
    "end": 3083.61,
    "text": "Let's look at how the authors define neurophenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.19,
    "end": 3109.155,
    "text": " they define it as one observation and description of the phenomenological invariance at the appropriate level of abstraction so maybe the appropriate level of abstraction um for the experience of drinking water is not uh you know a throat cell maybe it's uh not a whole nation maybe it's a person the classification two classification of the behavioral cognitive and biofunctional aspects of consciousness so some drugs like you know you take",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.975,
    "end": 3112.619,
    "text": " acetaminophen and it doesn't make you feel that different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.679,
    "end": 3118.668,
    "text": "There's other drugs that are psychoactive or that have long-term changes to your brain, whether you experience it in the short term or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.828,
    "end": 3125.518,
    "text": "So how are we going to get a behavioral, cognitive, molecular, genomic understanding of that mechanism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.701,
    "end": 3131.324,
    "text": " Three, identification of the neuroanatomical and neurophysiological correlates of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.704,
    "end": 3140.85,
    "text": "So I see neuroanatomy as the structural, whether it's structural at the macro or the micro, neuroanatomy is what Sovic and I called structural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.451,
    "end": 3149.696,
    "text": "Then neurophysiological is referring to the dynamics and the processes, molecular, informational, whatever they may be that are in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3149.736,
    "end": 3152.278,
    "text": "So those are the functionalist models to me of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.098,
    "end": 3171.501,
    "text": " four development of mathematical and computational models of consciousness which i would consider to be in the mathematical category that a faithfully integrate all the invariants described in one which we'll get to soon b provide unifying explanations of intestinal hypotheses about the biofunctional aspects of consciousness described in two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.242,
    "end": 3172.722,
    "text": " all on board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.123,
    "end": 3178.446,
    "text": "And C can be physically implemented in the hardware identified in three, as well as perhaps in non-biological hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.826,
    "end": 3181.268,
    "text": "So I don't subscribe to computationalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.288,
    "end": 3186.05,
    "text": "I don't believe in a hardware software distinction, except as a useful metaphor in biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.15,
    "end": 3189.773,
    "text": "I think the book Wetware is pretty interesting on this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.513,
    "end": 3217.617,
    "text": " and the reason why i intervened right after the mathematical and computational models is because i think it's actually a different domain i think there could be a mathematical model that's extremely agnostic to the biology or our biological model could just be like it is what it is and it doesn't matter what the math or what anyone thinks the math is it is what it is because of evolution or um because it passed through some sort of historical filter and any equation you put on it is just like a linear regression it just it doesn't matter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.237,
    "end": 3242.19,
    "text": " so those to me they they can kind of fly together and that would be great or not it could be something totally off base which is why i think again it's important that even though we have the citations and the ways that we can sort citations into keyword clusters let's not think that we've mapped out the space of the possible in consciousness because there's people in other cultures who don't feel the same way as scientists",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.039,
    "end": 3246.161,
    "text": " First-person perspective is, I think, the last keyword.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.081,
    "end": 3249.823,
    "text": "And they write about that in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.923,
    "end": 3265.855,
    "text": "They say, ideally, this method of the PCM would give us a theory of consciousness that intelligibly links the phenomenology of a first-person conscious experience with its realization in the brain or other substrate via mathematical and computational model simultaneously accounting for its biofunctional properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.135,
    "end": 3270.219,
    "text": "So the biofunctional properties is kind of where you got the neuro part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.059,
    "end": 3300.043,
    "text": " mathematical computational model they're saying wouldn't it be good for purposes of describing it predicting it controlling it designing it um explaining variance reducing our uncertainty why not that's the mathematical computational side and then pull it all the way back phenomenology so computational neurophenomenology we're going to be doing mathematical computational neurophenomenology in this paper and we're going to be using geometric tools like projection mapping to think about how cybernetics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.703,
    "end": 3305.133,
    "text": " and active inference are related to classic work in neurophenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.986,
    "end": 3331.743,
    "text": " okay one more um keyword perspectival imagination so they quote on this one they write this perspectival space of the field of consciousness foc is organized around an elusive implicit origin or zero point and includes a horizon with vanishing points at infinity that mark its limit so right there there's the two of the violations of euclidean geometry point of privilege that's the point of view and then the vanishing horizon points out infinity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.423,
    "end": 3341.26,
    "text": " The FOC embeds vectorized directions that frame the orientation of attention and action along three axes, vertical, horizontal, and sagittal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.441,
    "end": 3343.966,
    "text": "So like, you know, this one, this one, and then that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.222,
    "end": 3349.163,
    "text": " These are given in perspective with respect to these same points at infinity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.744,
    "end": 3351.944,
    "text": "So pretty interesting stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.264,
    "end": 3367.15,
    "text": "They continue and they write, since we are dealing with a 3D perspectival space with an elusive origin, point of privilege, point of view, and vanishing points at infinity constituting a horizontal plane, a horizon plane that happens to be in the horizontal axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3367.71,
    "end": 3368.83,
    "text": "It doesn't have to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.85,
    "end": 3370.351,
    "text": "If you're on your side, it's not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.23,
    "end": 3378.294,
    "text": " The PCM postulates that the field of consciousness has the structure of a 3D projective space in the sense of projective geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.594,
    "end": 3380.516,
    "text": "Nice, thanks for giving it as a keyword too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.736,
    "end": 3381.636,
    "text": "It helped me learn about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.257,
    "end": 3386.3,
    "text": "The FOC can thus partly be understood in terms of a 3D projective frame.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.389,
    "end": 3391.292,
    "text": " Let's look at a few just kind of cool examples related to perspectival imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.953,
    "end": 3395.115,
    "text": "So this is an example of a non-Euclidean geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.135,
    "end": 3396.757,
    "text": "It's an Escher artwork.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.217,
    "end": 3399.679,
    "text": "And it's like these bats that kind of fractal off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.52,
    "end": 3404.283,
    "text": "And sometimes this could be related to hyperbolic geometry or other geometries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.863,
    "end": 3408.226,
    "text": "But the point is like each bat might be flying off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.406,
    "end": 3413.991,
    "text": "And so that kind of maps onto our experience of a bird or a bat flying away from us and slowing down perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.271,
    "end": 3421.554,
    "text": " But how is that going to get mapped onto another space that may or may not have three dimensions spatially?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.954,
    "end": 3425.015,
    "text": "Again, Bucky Fuller might claim there are four spatial dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.075,
    "end": 3428.476,
    "text": "So let's not assume there are three spatial dimensions and that the fourth one is time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.237,
    "end": 3434.519,
    "text": "That being said, it makes sense to talk about XYZ coordinates from a Cartesian perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.532,
    "end": 3439.035,
    "text": " Another example about this perspectival imagination is Vanishing Point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.135,
    "end": 3449.183,
    "text": "So everyone who's done a fun drawing course or just looked down a city road or looked out of a car that was driving through fields, everything kind of vanishes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.483,
    "end": 3457.149,
    "text": "And so you can see the rows of a field and you know that they're all in parallel, but then you can see really deeply down one, other ones like kind of move towards it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.63,
    "end": 3459.811,
    "text": "And another way of seeing it in a cityscape is like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.532,
    "end": 3484.689,
    "text": " you can conceptually know that the street is straight but if you look at it it looks like a triangle that's disappearing from you with a point at the top so what is it that allows us to be like oh yeah buildings have 90 degree angles and they're going upright even though all the actual angles are kind of wacky so that's this perspectival imagination and that's what makes an artist who can make a lifelike drawing especially like an architecture or something look",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.888,
    "end": 3494.273,
    "text": " lifelike because they capture these extremely subtle features about vanishing point and perspective and all these different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.313,
    "end": 3497.195,
    "text": "So one drawing that I love on this is this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.615,
    "end": 3505.279,
    "text": "And it's like, for many people, it's like, okay, do a self-portrait of what you see when you are on the couch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.9,
    "end": 3512.964,
    "text": "And one approach might be like, I just, you know, draw like, okay, I see this, you know, here's this piece of art, here's my bookshelf, here's, you know, my bike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.911,
    "end": 3517.213,
    "text": " Then the next layer back is like, oh, I'm going to include my feet in the drawing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.393,
    "end": 3520.415,
    "text": "Like the kind of, you know, I'm on the beach, here's my legs type thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.715,
    "end": 3524.998,
    "text": "Like taking a picture from right in front of you with a phone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3525.298,
    "end": 3533.202,
    "text": "Something that we actually have an affordance to do now, but other people may not have seen in such a direct way, which is why they didn't take selfies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.723,
    "end": 3535.544,
    "text": "For example, oh, hey, here I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.403,
    "end": 3539.847,
    "text": " This drawing takes it back another layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.367,
    "end": 3543.692,
    "text": "Now this is actually, where are you really seeing from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.273,
    "end": 3552.746,
    "text": "Not what is canceled out with a binocular vision, but what happens when you look with one eye really, really far to the side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.487,
    "end": 3574.795,
    "text": " well you see this curving and it's just like a little bit beautifully accentuated but of course we're seeing that as a two-dimensional projection so that's just so cool and uh styles that play with our perception like optical illusions or cubism or abstract art they often incorporate some invariant features",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.615,
    "end": 3589.098,
    "text": " of perspectival imagination but then violate expectations on other ones so like um half of the person's body is as if they were lit from this side and half is after if is as if they were lit from a different side that was a classic technique of the cubists and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3590.347,
    "end": 3618.415,
    "text": " very rich space very open for honest collaboration with artists and philosophers and practitioners so we hope that this is kind of an opening for those who might have thought active inference okay it's an engineering framework we're talking about optimization we're talking about socio-cultural things but kind of from an abstract point of view how are we going to take this into our experience of consciousness and of perspective so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.375,
    "end": 3623.178,
    "text": " I'm going to return to this slide again and again, which is that it's a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.679,
    "end": 3629.804,
    "text": "What does free energy principle and active inference say about the relationship between the world and agents?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.464,
    "end": 3633.967,
    "text": "So that's this feedback between the world and the agents and the nested agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.608,
    "end": 3638.931,
    "text": "And here we're adding on this level of the agent is having conscious awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.312,
    "end": 3646.077,
    "text": "It's thinking I am a strange action perception loop, or at least it's acting like it says it or it's thinking that it's saying it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3646.838,
    "end": 3655.471,
    "text": " And just as we've talked about before with this slide, we want to be building on the fields of action, of inference, of physics, of experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.852,
    "end": 3662.221,
    "text": "We want to be tying these threads together while also being aware that just being convinced will never be enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3662.561,
    "end": 3674.788,
    "text": " So that's why it's such a fun area, why it's so great to do research in this area and to learn about it and also to welcome collaboration and to welcome people sharing their perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.208,
    "end": 3678.931,
    "text": "Because I really believe that no matter how many papers you've read about consciousness,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3679.671,
    "end": 3682.514,
    "text": " it does not make that opinion any more valid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.855,
    "end": 3689.362,
    "text": "There's other topics where potentially you couldn't say that as flippantly, but in the area of consciousness, it can't be a counting game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.803,
    "end": 3690.564,
    "text": "It's just not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3691.044,
    "end": 3693.146,
    "text": "It's something that is so essential to our experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.247,
    "end": 3697.812,
    "text": "And so it's such a deep area, a perfect area for transdisciplinary synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.124,
    "end": 3699.364,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.965,
    "end": 3704.167,
    "text": "Let's get to the paper because it's also all about the specifics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.227,
    "end": 3726.783,
    "text": "We want to be really specific about what the authors say and do so that we can build off of it with other specific work so that we can actually use their perspectives as catalysts for our own development, not push ideas out of our head and replace it with the Fristin update, but rather be catalyzed and spurred to new culturally informed creative states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.423,
    "end": 3729.465,
    "text": " by reading and by discussing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.746,
    "end": 3745.923,
    "text": "So that's why really, especially for 9.1 and 9.2, for the last home stretch of 2020 and for 2021, just if you're listening to it, we want to know your experience and we want to hear your questions in the YouTube chat or have you on live, however it has to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.663,
    "end": 3747.644,
    "text": "This paper is called",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3748.522,
    "end": 3751.162,
    "text": " The Projective Consciousness Model and Phenomenal Selfhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.322,
    "end": 3759.724,
    "text": "It was published in December of 2018 in the Frontiers in Psychology Journal in the Division of Theoretical Philosophical Psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.584,
    "end": 3763.625,
    "text": "And the authors are Williford, Benequin, Friston, and Rudroff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.225,
    "end": 3771.606,
    "text": "So that's kind of giving you some information on when this paper was published and on what areas the authors want to place their work within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.406,
    "end": 3776.527,
    "text": "Let's take some quotes from the paper and look at the main aims and claims of the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.347,
    "end": 3777.707,
    "text": "They write,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.757,
    "end": 3807.678,
    "text": " can we describe this integrated multimodal and centered spatial structure of conscious experience in a rigorous way great question i love the setup and they write and can we give a good account of why it should be thus organized here we answer both questions in the affirmative great questions i love the setup and it's something we can evaluate whether that's a hearty affirmative or a half-hearted or a overly confident or underly confident or okay it's affirmative but then what do we do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.499,
    "end": 3810.081,
    "text": " These are all great questions to have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.542,
    "end": 3818.753,
    "text": "And I just love that the authors can be really clear about this great research and also a great suggestion by a community member to read this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.279,
    "end": 3841.431,
    "text": " Overall, the PCM delivers an account of the phenomenologically available, generic structure of consciousness, and shows how consciousness allows organisms to integrate multimodal sensory information, memory, and emotion in order to control behavior, enhance resilience, optimize preference satisfaction, and minimize predictive error in an efficient manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.091,
    "end": 3843.132,
    "text": "Sounds chill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.932,
    "end": 3845.213,
    "text": "If we could, we should.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.853,
    "end": 3846.074,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3847.154,
    "end": 3862.269,
    "text": " way that i would rephrase it without any of the jargon of act inf is how can we apply active inference to the study of consciousness in all of its unified yet coherent mysterious dynamic and profound facets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.83,
    "end": 3872.855,
    "text": " So there, for the purposes of scientific writing, highlighting a lot of the vocabulary, keywords, and research fields related to control theory, information signaling, geometry, math, computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.275,
    "end": 3886.662,
    "text": "Those are some heavy-hitting ideas, but let's also not lose sight that some of the other heavy-hitting ideas include the mystery of consciousness and why we're the one that we are and whether cells have consciousness and...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.242,
    "end": 3894.864,
    "text": " whether ant colonies do and whether colonies do but not nest mates and nest mates but not colonies or ecosystems but not colonies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3894.944,
    "end": 3897.124,
    "text": "Just let's be open-minded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.564,
    "end": 3900.665,
    "text": "So let's answer questions in the affirmative and be open-minded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.065,
    "end": 3905.806,
    "text": "Let's have yes and and let's accomplish yes and with everyone's participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.606,
    "end": 3916.808,
    "text": "The abstract begins with saying, we summarize our recently introduced projective consciousness model and relate it to outstanding conceptual issues in the theory of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3918.766,
    "end": 3945.194,
    "text": " pcm combines a projective geometrical model of the perspectival phenomenological structure of the field of consciousness with a variational free energy minimization model of active inference yielding an account of the cybernetic function of consciousness viz the modulation of the field's cognitive and affective dynamics for the effective control of embodied agents long sentence double double points for um using uh affect and effect uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.273,
    "end": 3950.217,
    "text": " Long sentences, but slow it down, unpack it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.778,
    "end": 3958.007,
    "text": "I think that we've gone through the keywords well enough, at least a first pass to show you why it would be great to connect across all these areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.928,
    "end": 3959.549,
    "text": "Abstract part two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.745,
    "end": 3981.865,
    "text": " The geometrical and active inference components are linked via the concept of projective transformation, which is crucial to understanding how conscious organisms integrate perception, emotion, memory, reasoning, and perspectival imagination in order to control, behavior, enhance resilience, and optimize preference satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.586,
    "end": 3984.147,
    "text": " So sounds cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.887,
    "end": 3987.168,
    "text": "The PCM makes substantive empirical predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.608,
    "end": 3988.168,
    "text": "We'll see about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.829,
    "end": 3991.39,
    "text": "And fits well into a neurocomputationalist framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.59,
    "end": 3992.19,
    "text": "Of course it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.071,
    "end": 3997.693,
    "text": "It also helps us to account for aspects of subjective character that are sometimes ignored or conflated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.113,
    "end": 4004.936,
    "text": "Pre-reflective self-consciousness, the first person point of view, the sense of mindness or ownership and social self-consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.996,
    "end": 4020.435,
    "text": " and close the abstract with saying we argue that the pcm though still in development offers us the most complete theory today of what thomas metzinger has called phenomenal selfhood now i don't know metzinger's work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.996,
    "end": 4045.63,
    "text": " incredibly well or what this topic bridges out to kind of an interesting way to end the abstract but so it goes um that's what we might be getting to how are the authors going to get from all of these keywords like cybernetics and geometry to getting to potentially the most developed framework to date in their opinion of what is called phenomenal selfhood so phenomenology experience selfhood having a self",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.823,
    "end": 4052.267,
    "text": " Well, they start in section one with the introduction and go pretty directly to section two methodology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.547,
    "end": 4055.769,
    "text": "I think this is great because it really gets into the details quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.21,
    "end": 4058.752,
    "text": "You could philosophize for a thousand books people have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4059.192,
    "end": 4060.673,
    "text": "So what's the methodology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4061.033,
    "end": 4070.38,
    "text": "How can I identify what you're actually doing in this paper as a researcher without hearing 30 pages about your understanding of what Descartes did or didn't say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.957,
    "end": 4078.186,
    "text": " Three, they're going to talk about phenomenological invariance and the functional features of consciousness, which are also, we're going to go into them later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.207,
    "end": 4083.153,
    "text": "And they talk about the phenomenological invariance, what they are, the five of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.433,
    "end": 4083.954,
    "text": "We'll go through them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.415,
    "end": 4087.82,
    "text": "And then talk about how they're related to projective geometry in the PCM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.32,
    "end": 4095.764,
    "text": " So basically, they're going to start with their invariants, and if you have a qualm with an invariant, you want a sixth one, you want to collapse to four, great, let's write another paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.105,
    "end": 4107.071,
    "text": "But they're going to start with these invariant features, and then they're going to introduce that plus projective geometry to say, projective geometry is the bridge we're going to take to get these five invariant features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.188,
    "end": 4120.376,
    "text": " We see figure one, which has an account in the PCM model of psychological phenomena, and figure two, which shows projective geometry in relationship to the Necker cube, which is like kind of a cool illusion that I'm looking forward to showing you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.457,
    "end": 4126.1,
    "text": "Then they go to the five functional features of consciousness, which are also what we're going to address.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4126.98,
    "end": 4134.926,
    "text": "And they talk about the projective consciousness model, which is, remember, the phenomenological invariance plus projective geometry equals...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.851,
    "end": 4136.451,
    "text": " part of the PCM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.152,
    "end": 4152.964,
    "text": "Now we're going to talk about the PCM and the functional features of consciousness, the functional cybernetic functions that they talked about earlier, and fuse that in the capacity of using active inference and free energy minimization to get some of these functional dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4153.524,
    "end": 4160.389,
    "text": "Then they'll show figure three, a simplified 2D projective consciousness model based simulation of a pit challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.43,
    "end": 4165.173,
    "text": "And then figure four, give a overall sketch of the projective consciousness model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.503,
    "end": 4173.567,
    "text": " In section four, they talk about the hard problem of consciousness, representationalism and phenomenal selfhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.807,
    "end": 4184.154,
    "text": "The hard problem and computational functionalism is variously phrased by Professor Chalmers and others as basically being about what the substrate of consciousness is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.474,
    "end": 4189.878,
    "text": "Why is it that when you hit your hand, it hurts, but when you hit some brain regions, it doesn't hurt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4190.078,
    "end": 4195.081,
    "text": "And when you hit some other brain regions, you just pass out, but you come back or you die or something in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4195.642,
    "end": 4196.963,
    "text": "How is that happening in the brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4197.583,
    "end": 4215.626,
    "text": " or is it an antenna is it a generator these are the questions then they go from the computational functionalism to talking about the pcm and representationalism now all these terms computation function and representation are pretty loaded we've gone into them on a couple of other discussions but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.718,
    "end": 4220.88,
    "text": " be open-minded as to how they could recombine in the context of PCM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.821,
    "end": 4227.624,
    "text": "And then they're going to take those kind of more quantitative terms, computation, function, representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.385,
    "end": 4235.468,
    "text": "Representation is a little bit of a bridge, and they're going to bring that into the projective consciousness model's phenomenological components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.929,
    "end": 4241.352,
    "text": "So that's going to be about subjective character, subjective character being what it is-ness, the what is it about to be about, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.714,
    "end": 4248.181,
    "text": " And also the phenomenal selfhood of the philosopher that they concluded with discussing in their abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4248.641,
    "end": 4252.806,
    "text": "And then they conclude, so looks like a great roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.347,
    "end": 4257.011,
    "text": "Let's, in this introductory video, in the time that I've left here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.459,
    "end": 4268.563,
    "text": " let's go through the functional features and the invariances of consciousness, because we're not going to have time to go through them in 9.1 or 9.2 with all of you contributing your perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.063,
    "end": 4275.005,
    "text": "And it's good to get them out here because these are kind of like the big five for the functions and the big five for the invariances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.425,
    "end": 4282.508,
    "text": "And if you have a qualm with the model, you should first ask, is there a function or is there an invariant that I think is extraneous?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.488,
    "end": 4284.568,
    "text": " Is there one that I think is missing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.828,
    "end": 4286.249,
    "text": "Is there one that I think is just off base?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.589,
    "end": 4295.051,
    "text": "So if you have a question about one of these five things, you think this doesn't go far enough or this goes too far or, but some conscious systems don't have that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.212,
    "end": 4295.452,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.812,
    "end": 4297.512,
    "text": "That's the question you want to ask.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4298.052,
    "end": 4299.493,
    "text": "So there's five in each category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.873,
    "end": 4303.314,
    "text": "If you think there should be more or less or a different one, that's one entry point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.894,
    "end": 4321.278,
    "text": " Now, if you agree with all of them and you say, yep, those are the perfect five in each category, then you can evaluate, given what projective geometry is and what the PCM is, do they address the functional and the experiential invariance of consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4321.698,
    "end": 4324.059,
    "text": "So that's how we're going to read this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4324.499,
    "end": 4327.36,
    "text": "And that's where I hope there's a lot of footholds for people who",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.28,
    "end": 4333.868,
    "text": " maybe have thought about consciousness, but this is a new way to hear about it for them, it would be great to have their comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.11,
    "end": 4338.736,
    "text": "What are the five functional features of consciousness according to the authors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4340.33,
    "end": 4364.625,
    "text": " and the way that they sort of justify this is by saying um we claim that the overall function of consciousness is to address a general cybernetic problem or problem of control control theory consciousness enables a situated organism with multiple sensory channels to navigate its environment and satisfy its biological and derived needs efficiently this entails minimizing predictively erroneous representations of the world and maximizing preference satisfaction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.385,
    "end": 4367.986,
    "text": " A good model of consciousness must be able to explain how this is accomplished.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4368.306,
    "end": 4372.167,
    "text": "The PCM thus emphasizes the following interrelated functional features of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.567,
    "end": 4375.588,
    "text": "Here's why I paused before putting it up, but after justifying it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.129,
    "end": 4380.31,
    "text": "Because even things that do control theory might not have consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.85,
    "end": 4381.35,
    "text": "Full stop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.871,
    "end": 4385.252,
    "text": "That's the whole thing that I was getting into with the ant colony test is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4386.32,
    "end": 4398.113,
    "text": " Okay, so then if I have a robot and it has something that allows it to do multimodal integration across sensors with a generative model, with a deep, with a counterfactual, whatever it is, does it have consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.213,
    "end": 4400.296,
    "text": "And then that's where the person goes, oh, well, it needs a brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.796,
    "end": 4402.598,
    "text": "And so then they go down the rabbit hole a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.019,
    "end": 4407.423,
    "text": "So the function is important, but again, it's not the whole story, especially yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.084,
    "end": 4413.933,
    "text": " Here are what they characterize as the five functional cybernetic features of consciousness that we'd want to at least explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.334,
    "end": 4419.021,
    "text": "So maybe just passing these five is necessary, but it's not sufficient, but it's important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.063,
    "end": 4422.304,
    "text": " One, global optimization and resilience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.865,
    "end": 4431.509,
    "text": "Consciousness helps the organism reliably find the globally optimal solutions available to it given competing preferences, knowledge base, capacities, and context, making the organism more resilient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.19,
    "end": 4443.196,
    "text": "This is a mechanism of global or subjective, here in the sense of subjective Bayesian optimization, which does not always entail objective optimality, though it must approximate the latter reliably enough, or you die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.056,
    "end": 4448.978,
    "text": " If you don't objectively enough figure out how to walk down a staircase, you're not going to walk down many staircases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4449.438,
    "end": 4450.619,
    "text": "Now, a few things on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.899,
    "end": 4453.68,
    "text": "First, many people think consciousness is epiphenomenal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.96,
    "end": 4457.382,
    "text": "So whatever's happening in our awareness is not going back to guide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.022,
    "end": 4463.264,
    "text": "So this plays a little fast and loose because it's saying, well, consciousness helps your organism reliably find.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.105,
    "end": 4465.725,
    "text": "It sounds like consciousness is coming back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.065,
    "end": 4468.286,
    "text": "And this is the whole Cartesian dualism paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.627,
    "end": 4468.887,
    "text": "It's like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.847,
    "end": 4474.909,
    "text": " I know that Carl Fristen and others have many more nuanced works, including I Think Therefore I Am related works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.309,
    "end": 4481.491,
    "text": "So I'm not going to go into it, but it's like, if consciousness is something that reaches back into the physical, how is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.451,
    "end": 4494.195,
    "text": "Or if consciousness is purely a descriptive epiphenomenal, epiphenomena above the phenomena of mechanistically or materially defined components like neurons, message passing, whatever it has to be, ants,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4494.955,
    "end": 4502.642,
    "text": " No matter how emergent their properties are in the weak emergent sense, do they ever amount to strong emergence and actually cause the system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.243,
    "end": 4512.411,
    "text": "Even the downward causation and causal entropy and the renormalization group, that still is a very philosophically agnostic with respect to whether it's causal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.931,
    "end": 4513.071,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.852,
    "end": 4534.971,
    "text": " another thing to say here is that global optimization given the preferences knowledge base capacities affordances and context so so it's not global optimization so it's local optimization or it's global exploration of a conditional space conditional upon the things that we want it to be conditional on like how far you can reach but then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.152,
    "end": 4552.723,
    "text": " I don't know about you all, but my consciousness doesn't always help me get to the globally optimal points unless that global optimum is defined as this not objectively best space of like, well, you just didn't go the right way, but it seemed optimal given what you knew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.863,
    "end": 4554.083,
    "text": "It's like, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.524,
    "end": 4555.244,
    "text": "And then, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.384,
    "end": 4556.485,
    "text": "And it has to be reliable enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.685,
    "end": 4557.406,
    "text": "So I'm on board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.266,
    "end": 4559.707,
    "text": " Two, global availability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4560.108,
    "end": 4570.035,
    "text": "The contents of consciousness must be generally globally available in the sense of poised to be treated of, by, are effective cognitive and perceptual systems as the occasion requires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.496,
    "end": 4581.284,
    "text": "So for example, you know, here's idea one, idea two, memory four, the color, you know, the number, all these things are just apparently one layer away from accessing the workspace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.464,
    "end": 4586.628,
    "text": "This is drawing heavily on the global workspace theory, attention schema modeling of some other researchers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.449,
    "end": 4589.71,
    "text": " I would just point out global doesn't make sense to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.951,
    "end": 4590.891,
    "text": "The brain isn't the globe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4591.031,
    "end": 4593.313,
    "text": "Cognition isn't the globe availability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.453,
    "end": 4598.496,
    "text": "It's like, yes, but then again, you define available as like, I knew it yesterday, but I don't know it now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4598.576,
    "end": 4599.577,
    "text": "So it's not available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.597,
    "end": 4604.7,
    "text": "Um, or what if it's part of my extended cognitive process and it just takes me five minutes to find it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.08,
    "end": 4606.461,
    "text": "So, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.001,
    "end": 4608.942,
    "text": "Relevance, but globally available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.263,
    "end": 4609.343,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.529,
    "end": 4613.61,
    "text": " And also our awareness is hardly the tip of the iceberg.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4614.271,
    "end": 4616.552,
    "text": "Or maybe it's a whole iceberg and a half.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.912,
    "end": 4619.893,
    "text": "So I wouldn't even know what it would mean to be globally available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.314,
    "end": 4623.395,
    "text": "Motivation of action and modulation of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4624.659,
    "end": 4625.36,
    "text": " attention schema theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.12,
    "end": 4631.284,
    "text": "Consciousness is generally implicated in the motivation of action based upon affective dynamics in memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.544,
    "end": 4636.188,
    "text": "This drives the modulation of attention, though consciousness is not to be narrowly identified with attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4636.468,
    "end": 4643.373,
    "text": "So that's kind of attention schema theory breaking upwards out of the just like LSTM, like a neural network that has an attentional parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.953,
    "end": 4649.177,
    "text": "We want to go into the experiential dimension, not just the, oh, well, it's a laser that spends a lot of its time here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4649.697,
    "end": 4652.76,
    "text": "Or, you know, it's a camera that autofocuses on this level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4653.28,
    "end": 4663.108,
    "text": " We want to go beyond that and say whether or not it is getting input like a camera in some of its sensory organs, the experience is somehow generated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.228,
    "end": 4666.631,
    "text": "But I'd also point to this motivation of action and modulation of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4667.352,
    "end": 4668.473,
    "text": "It's very, very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.753,
    "end": 4673.477,
    "text": "These are phrased as if consciousness functionally, functions of consciousness, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.138,
    "end": 4676.82,
    "text": "Motivates action and modulates attention, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4677.717,
    "end": 4680.358,
    "text": " Or it could be epiphenomenal consciousness, that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4680.818,
    "end": 4685.56,
    "text": "And so it could be the experience of motivation of action and the experience of modulated attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.2,
    "end": 4694.983,
    "text": "So in that framing, we made consciousness epiphenomenal and we basically said, yeah, attention is something that happens with all the neurons and the firing patterns and whatnot and the drugs, everything that happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.464,
    "end": 4701.666,
    "text": "And then it gets to some synergetic compromise where it's like looking at this thing at this time and then you're just experiencing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4701.986,
    "end": 4703.988,
    "text": " It's not simply a Cartesian theater model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.328,
    "end": 4710.873,
    "text": "It's still a bottom-up, top-down situation, but there's no simple outs here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.233,
    "end": 4720.34,
    "text": "It's neither that consciousness is reaching back and motivating action, neither is it that it's modulating attention through what dials, you know, show them to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4720.76,
    "end": 4721.901,
    "text": "Oh, well, that's what meditation is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.301,
    "end": 4727.465,
    "text": "Yeah, but then all of a sudden you're getting into this area where I think a lot of stuff that's not related is pretty important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4728.749,
    "end": 4730.851,
    "text": " And then the fourth one, oh, whoops, I said big five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.911,
    "end": 4732.492,
    "text": "Well, let's just think of it as the big five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4732.532,
    "end": 4734.774,
    "text": "The big fifth function is going to be the secret function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4735.235,
    "end": 4737.977,
    "text": "But the fourth function is simulation enhancement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4738.097,
    "end": 4739.158,
    "text": "Maybe that gets us two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.079,
    "end": 4745.724,
    "text": "Consciousness facilitates the use of simulation in the broad sense of imagination, not the narrow sense like simulation theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4746.664,
    "end": 4747.905,
    "text": "But maybe that's a direction to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4748.786,
    "end": 4756.574,
    "text": " in the service of solving cognitive, perceptual, and affective problems, and more generally, in the anticipation and programming of actions and the response to their outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4757.134,
    "end": 4767.144,
    "text": "So simulation enhancement could be, for example, I wake up and it's very dark in my room, but I have a generative model or an accessible model, not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4768.085,
    "end": 4769.987,
    "text": " being too formal here, of my room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4770.428,
    "end": 4779.598,
    "text": "So even with my eyes closed or with very dim light, I can enhance my simulation and think, oh wait, if I open the door this way, it's going to wake up my roommate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4779.798,
    "end": 4785.905,
    "text": "Or if I do this at this time, then down the road, this is going to be a different sensory input that I don't want to experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.326,
    "end": 4787.547,
    "text": "So that kind of rich,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4788.508,
    "end": 4791.612,
    "text": " mechanistic understanding of the world is what humans excel at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4791.792,
    "end": 4795.336,
    "text": "And it's what the current machines that we deal with do not deal with well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4795.977,
    "end": 4800.542,
    "text": "You can ask it a question like, could this building wear ice skates?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4801.082,
    "end": 4807.89,
    "text": "And it might be able to parse whether those terms mean different things and whether they're keywords used by the same people or not on Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.23,
    "end": 4808.39,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.091,
    "end": 4834.714,
    "text": " will it be able to understand and address that question and that's kind of what the geb book really is fun to think about so again four functional features for consciousness should there be a fifth one are one of these extraneous do you have a different function for consciousness what is your understanding is consciousness have function or is consciousness something else how would it affect things if it had a function how would we measure the function what is dysfunction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4835.612,
    "end": 4842.396,
    "text": " All these questions, any questions that people want to have, maybe be cool for people who watch it, like to post questions they have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.456,
    "end": 4850.1,
    "text": "And we can have a norm of just asking the questions that we have out loud because let's ask the questions we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.641,
    "end": 4852.422,
    "text": "I don't know any other way to say it right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.022,
    "end": 4868.427,
    "text": " second thing that we'll talk about is the um invariance of consciousness the phenomenological invariance and here i believe there are five so these are the things that are really what their model is going to come down to with respect to phenomenology and philosophy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4869.167,
    "end": 4870.628,
    "text": " So this is what they're going to focus on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.908,
    "end": 4873.409,
    "text": "This is what the mathematical model needs to aim for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.829,
    "end": 4878.251,
    "text": "This is what their formalisms should explain, predict, integrate, encompass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.611,
    "end": 4889.636,
    "text": "So this is like the big core philosophy idea that we want to do all of the math and all of the computational stuff to get at with some type of bridge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.016,
    "end": 4892.177,
    "text": "The bridge is projective geometry, perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.037,
    "end": 4895.738,
    "text": "So what does it mean to be a phenomenological invariant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.239,
    "end": 4896.899,
    "text": "And they write,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.168,
    "end": 4903.25,
    "text": " The following are the deeply interconnected invariants that we think characterize consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.55,
    "end": 4910.993,
    "text": "We take them as postulates for mathematical treatment, citation that you could follow up on, and construct the PCM on their basis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.373,
    "end": 4916.755,
    "text": "So it's kind of like axioms, like they're taking these as like root statements that kind of don't need to be justified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.775,
    "end": 4918.016,
    "text": "They're kind of like observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4918.476,
    "end": 4920.877,
    "text": "But of course, this is something that we all want to know is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4921.897,
    "end": 4922.899,
    "text": " Could there be another one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.199,
    "end": 4924.281,
    "text": "Could one of these be redundant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4924.321,
    "end": 4925.283,
    "text": "What if you have four out of five?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4925.303,
    "end": 4926.865,
    "text": "Do you get 80% on consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4927.226,
    "end": 4931.072,
    "text": "Or what if we figure out or imagine a system that has three out of five?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.292,
    "end": 4933.536,
    "text": "Is it, you know, what does that mean for that system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4934.277,
    "end": 4936.1,
    "text": "What are these phenomenological invariants?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4937.111,
    "end": 4952.752,
    "text": " one relational phenomenal intentionality so break it down by the words all consciousness involves the appearance of a world of objects properties etc in various qualitative or representational worlds representational ways to an organism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4953.092,
    "end": 4958.015,
    "text": " So again, they're not thinking too much about worms and fruit flies and ants and ant colonies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.115,
    "end": 4958.676,
    "text": "Maybe they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.796,
    "end": 4961.678,
    "text": "I'd love to hear it from an author or from a colleague if they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.138,
    "end": 4975.747,
    "text": "But these are the debates that we're having, which is like, right, if you observe the worm moving away from the gradient as if it had a representational, relational, phenomenal intentionality, is that evidence enough?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.848,
    "end": 4978.169,
    "text": "And that's the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.991,
    "end": 4981.872,
    "text": " Two, situated three-dimensional spatiality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.252,
    "end": 4984.493,
    "text": "Of course, also there's time, sometimes called the fourth dimension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.173,
    "end": 4999.537,
    "text": "The space of the presented world, like objects or et cetera, is three-dimensional, again, big asterisk, and perspectival, unfolding in an oriented manner between a point of view and a horizon at infinity, where all parallel lines converge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.811,
    "end": 5005.072,
    "text": " The origin of this point of view is elusive, though normally it seems to be located in the head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.833,
    "end": 5008.814,
    "text": "The space is normally organized around the lived body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.894,
    "end": 5020.438,
    "text": "So this is like bringing us to embodiment, to inactivism, to ecological psychology, to intercultural and developmental psychology, to Ken Wilber's integral theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.298,
    "end": 5050.772,
    "text": " also connecting us to lived experience and to spatiality and to the ways that the spaces that we live in influence who and how we are so all of the awesome active stream participants who have taught us so much about embedded systems and embodiment we'd really love to hear what is work in this area that impinges on one of these invariants multimodal synchronic integration synchronic means at the same time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5052.165,
    "end": 5061.913,
    "text": " Consciousness involves the synthesis or integration into a unified whole of a multiplicity of qualitative and representational components from sensory modalities, memory, and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5062.234,
    "end": 5065.937,
    "text": "So diachronic means at a different time, synchronic at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5066.397,
    "end": 5067.859,
    "text": "So memory is diachronic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.359,
    "end": 5070.141,
    "text": " but it's of sensory modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.562,
    "end": 5073.185,
    "text": "So it could be a hearing event from six months ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5074.207,
    "end": 5083.879,
    "text": "And there's the whole question of imagination, obviously a big question, but just to a first pass, events from the past that influence us in the future are diachronic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.74,
    "end": 5110.572,
    "text": " or another way to think about it is they modify the system or they put it onto a different trajectory that's different than if that difference making cause to use the waters terminology hadn't occurred consciousness seems to be both diachronic and synchronic like when we're listening to music and seeing flashing lights there's like synchronization in the same moment that's also multi-sensory but there's some really interesting work about the time durations of different kinds of experience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5111.192,
    "end": 5133.345,
    "text": " so clearly something is happening there with sight and sound and just people who are born with or without hearing and born with or without sight all these different people can navigate in the same world so that says something about sight you know it's not just us watching a projector if there's people who can navigate without sight so that's kind of what they want to bring it back to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5134.229,
    "end": 5138.231,
    "text": " Four, temporal integration, which I just hinted at before, but this is a little deeper level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5139.352,
    "end": 5156.701,
    "text": "Consciousness involves at least the retention of immediately past experiences and pretension of immediately future experiences as integral elements of its specious present, the ever-present now, as it were, and the foundation for more expansive forms of temporal integration, such as distant memories and long-term planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5157.574,
    "end": 5158.998,
    "text": " distant past, distant future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.259,
    "end": 5164.272,
    "text": "Now, just to give one kind of funny note, when I was reading this, I thought, what is protension?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.833,
    "end": 5165.996,
    "text": "What does it mean in this context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.823,
    "end": 5173.169,
    "text": " So according to Google, protention is a philosophy word that means anticipation of a future event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.01,
    "end": 5183.459,
    "text": "So I dug a little deeper into the Merriam-Webster definition of protent, P-R-O-T-E-N-T, protent, like a professionally set up tent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5184.64,
    "end": 5189.225,
    "text": "It's an archaic transitive verb, meaning to stretch forth or to extend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5189.925,
    "end": 5190.025,
    "text": "Now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.132,
    "end": 5196.457,
    "text": " Nowadays, one might hear about portending future events, not protenting them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5197.838,
    "end": 5199.399,
    "text": "And the words actually have different meanings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5199.8,
    "end": 5212.23,
    "text": "So to portend, P-O-R-T-E-N-D, portend, is to convey something through like a symbol or an omen, like the owl portended difficult times or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5213.091,
    "end": 5214.673,
    "text": "But portending...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.771,
    "end": 5218.594,
    "text": " is something that the agent does in response to the symbol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5219.215,
    "end": 5224.961,
    "text": "So upon seeing the owl, the farmer portented that this was going to occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5225.782,
    "end": 5234.871,
    "text": "And so I would just kind of bring up this idea that maybe they're so similar sounding and they're so kind of close in their word usage that the English language just couldn't tolerate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.993,
    "end": 5241.339,
    "text": " that much ambiguity because portenting and portending, they sound like 99% identical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.92,
    "end": 5248.687,
    "text": "And so then maybe portending took popularity over protent because it removes agency from the actor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.727,
    "end": 5251.23,
    "text": "And so it's one way to remove action from language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5251.731,
    "end": 5253.633,
    "text": "And so now protenting or portenting...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5255.188,
    "end": 5256.509,
    "text": " It's now a philosophy word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.589,
    "end": 5257.149,
    "text": "It's archaic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5257.609,
    "end": 5260.71,
    "text": "It's an old word because we can't have action in speech, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.55,
    "end": 5265.872,
    "text": "No, but non-ironically, it is really interesting to think about how these words change in meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5266.092,
    "end": 5270.754,
    "text": "And the more action we can embed in our speech patterns and our interaction patterns, the better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5272.591,
    "end": 5273.311,
    "text": " Subjective character.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5274.351,
    "end": 5281.734,
    "text": "So subjective character is defined by the authors as involving a pre-reflective non-conceptual awareness of oneself and their individuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5282.134,
    "end": 5285.355,
    "text": "Now, one could be totally off base, so they could be wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5285.775,
    "end": 5290.836,
    "text": "Is that part of consciousness to be wrong about your individuality or is it just that you're having an individuality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5291.376,
    "end": 5293.837,
    "text": "Hard to say, but the authors have it as an invariant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5294.704,
    "end": 5299.365,
    "text": " They write also that two to five are in fact implicated in one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5299.925,
    "end": 5307.427,
    "text": "So relational, phenomenal, intentionality is really the most important key invariant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5308.047,
    "end": 5309.587,
    "text": "So that's the relational thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5309.688,
    "end": 5323.971,
    "text": "And that's why I feel like the active inference and free energy principle communities are very adjacent to complexity thinking, to systems thinking, relational thinking, design thinking, as well as team collaboration frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.551,
    "end": 5333.359,
    "text": " because so many of these social work and team relation frameworks, as well as other types of thinking, including complexity, they all deal with this relational insight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.779,
    "end": 5345.73,
    "text": "So there's so much to learn and to do here and to understand about what are the implications of relational thinking on consciousness, on our own experience, if not on actually making claims about consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5346.854,
    "end": 5347.074,
    "text": " cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5347.654,
    "end": 5353.936,
    "text": "Let's just kind of close out by going through and looking briefly at a few of the figures and just what they're about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5354.416,
    "end": 5359.637,
    "text": "Take a 30,000 foot view so that when you're reading through the paper, you kind of know where you're coming from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5360.197,
    "end": 5371.439,
    "text": "So figure one has A, B, and C. And A is a projective solution to a VR mediated disassociation in phenomenal selfhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.68,
    "end": 5372.54,
    "text": "So this is kind of like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5373.96,
    "end": 5377.102,
    "text": " from the experience of the Euclidean view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5377.323,
    "end": 5379.164,
    "text": "We're looking at Minecraft here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5379.184,
    "end": 5395.756,
    "text": "And then the person, their head is in this block in the lived space in the right side of figure A. But they're imagining the space as if it were on the left side of A. So I can imagine my office right now in terms of the right angles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.916,
    "end": 5398.198,
    "text": "Again, even when I look out, I don't see right angles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5398.478,
    "end": 5398.959,
    "text": "If I were to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5399.679,
    "end": 5412.885,
    "text": " Combined like this, and I look back down and I look at the angle that the room was just making, it's a not 90 degree angle, but it looks normal within my generative and usually verified experience that it is 90 degrees, because why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5413.205,
    "end": 5414.125,
    "text": "Projective geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5414.646,
    "end": 5416.266,
    "text": "So what do we have to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5416.566,
    "end": 5421.268,
    "text": "Well, it turns out to add in this element of the visual field in the projective geometry in B,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5422.549,
    "end": 5427.172,
    "text": " we're going to show this like sort of, they call it an anti-space beyond the plane.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5427.273,
    "end": 5438.801,
    "text": "I'm not even going to go into what that may or may not be because I don't want to go down too deep, but it's kind of like there's some mapping reflected in B and C, what they call God's eye vantage point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.461,
    "end": 5449.409,
    "text": "There's certain mappings from B and C, just like there's a mapping between the understanding that I'm in a Euclidean office and then my lived experience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5450.069,
    "end": 5454.514,
    "text": " where apparently wherever my eyes are or something like that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.534,
    "end": 5456.335,
    "text": "A little bit behind there, a little in front of there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.878,
    "end": 5467.166,
    "text": "How are we going to square the circle almost literally with the generative model of the Euclidean office with my lived experience of the wacky angles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.223,
    "end": 5471.085,
    "text": " And what's interesting here is the visual focus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5471.705,
    "end": 5473.826,
    "text": "And so where are all of these different centers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5473.906,
    "end": 5477.948,
    "text": "Is this kind of related to like, what if we feel like our emotional center is somewhere else in our body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.188,
    "end": 5487.513,
    "text": "Or what if we have the experience of not just a simple out of body, like floating above your body, looking down, but more expansive experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5487.613,
    "end": 5493.797,
    "text": "So we'd love to go into that phenomenology with someone potentially from Alias or any other colleague.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5495.663,
    "end": 5501.021,
    "text": " And so there's certain mappings, just like Euclideans, non-Euclidean office, there's this like God's eye mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5502.521,
    "end": 5529.677,
    "text": " can evaluate for yourself whether you think that's god's eye figure two is a projective solution to the necker cube and so here's what's happening in this image on the left side is like two versions of the so-called necker cube illusion so it's a cube visual illusion and it turns out it's illusion um first off just looking at these two for one or for both just ask yourself do i see them as um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5531.001,
    "end": 5531.862,
    "text": " How should I even say this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5532.823,
    "end": 5540.649,
    "text": "The biggest side that's close to you, is it on the top left of each square or is it on the bottom right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5542.11,
    "end": 5552.018,
    "text": "And you can flip sometimes, some people, different people in different ways can flip in their mind, seeing it as if the biggest side of the box were coming down to the right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5553.198,
    "end": 5556.983,
    "text": " or whether the biggest part of the box is kind of going up into the left, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5557.564,
    "end": 5564.192,
    "text": "Now, here is why they are suggesting that this visual illusion exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5564.993,
    "end": 5570.22,
    "text": "Because there's no perspectival cues, we're looking into a projection on a flat plane,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5572.011,
    "end": 5577.577,
    "text": " And so there's sort of like two optimal solutions to the perspectival question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.337,
    "end": 5593.633,
    "text": "And so because there's two such similar evidence competing models, free energy minimizing models, it's not, they say it's undecidable free energy based inference, which is to say that in our optimization perception, we continue just oscillating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5593.653,
    "end": 5594.353,
    "text": "It's like, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5595.234,
    "end": 5618.586,
    "text": " it's the old woman it's the young woman it's the old woman it's the young woman okay that's a visual illusion but this is one that has to do with projective geometry where it's like it's coming towards me like but i'm getting sensory evidence that's going that way in a different simulated frame and then you perceive it that way now it's top down so it's like this um back and forth resonance and there's a lot of interesting research on this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5619.366,
    "end": 5644.403,
    "text": " what breaks the symmetry quite literally and the answer is lived experience from the point of view simulation so here if i'm closer to one side of the square i don't have any little squares to pick up but it resolves it not absolutely you still know that square has a different side or the cube has a different side and you can even imagine what it might look like like oh i'm seeing the six is on the die it's closest to me",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5645.143,
    "end": 5669.503,
    "text": " if i were on the other side i would see a one and it would look bigger and i wouldn't be able to see the six but where i'm at i just see a big rectangle six or something like that and so that kind of captures a lot of these aspects of the geometry of consciousness where you can simulate being in different places but you're always in a certain spot visualizing it what is that spot that's the privilege point of view that's the point of reference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.203,
    "end": 5671.465,
    "text": " What about it is special?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5671.565,
    "end": 5674.97,
    "text": "Well, it's like a non-arbitrary point in a projective geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5675.45,
    "end": 5676.932,
    "text": "What kind of projective geometry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5677.293,
    "end": 5685.084,
    "text": "Well, something that takes our allegedly Euclidean world and maps it into this like vanishing point experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.584,
    "end": 5692.705,
    "text": " I think I got some of the main threads to link there, but that's kind of what they're suggesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5692.986,
    "end": 5707.289,
    "text": "And free energy is gonna be the optimization and action and inference paradigm within a simulation, broadly construed understanding about how symmetry is broken in terms of experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.769,
    "end": 5715.431,
    "text": "So big stuff, interesting topics, to be wanting to address this is big by the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5717.472,
    "end": 5722.196,
    "text": " Figure three is a PCM-based simulation of a pit challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5722.277,
    "end": 5724.519,
    "text": "And on the very bottom, you'll see this is like from another paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5724.739,
    "end": 5730.985,
    "text": "So if you're curious about this simulation, definitely go check out the other paper that they reference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5731.145,
    "end": 5735.409,
    "text": "But what we can look at here is starting on the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5735.689,
    "end": 5736.97,
    "text": "So there's like a bunch of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.751,
    "end": 5767.043,
    "text": " barbell shapes and basically the barbell uh has to do with it's like a map they can walk around in so they can wander around but they kind of have to make it across this pit to get to like a rewarding place um so there's an anhedonic uh in a safe space a challenge room and a goal room i believe is what they call them and then they're going to be thinking about that that moving circle like let's see if i can do this there you go this moving circle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5768.194,
    "end": 5770.336,
    "text": " is like the agent moving through the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5770.796,
    "end": 5773.398,
    "text": "Here's its expectations and where its prior beliefs are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5774.179,
    "end": 5786.528,
    "text": "And then here is it resolving its uncertainty in a, it's kind of like, looks like a radar dial, but that white spot in the middle is like the non-arbitrary origin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5786.608,
    "end": 5788.85,
    "text": "That's like the consciousness zone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5789.39,
    "end": 5796.496,
    "text": "And so from the POV point of view of this organism in its FOC, its field of consciousness,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5797.136,
    "end": 5804.083,
    "text": " which is like some geometry mapping from the experienced space into its generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5805.191,
    "end": 5809.492,
    "text": " It's navigating that mapping somehow through consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5810.312,
    "end": 5817.934,
    "text": "And then that's also able to bear on the difference between like having a weaker imagination and a stronger imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5818.374,
    "end": 5822.715,
    "text": "They have this active inference engine with multi-sensory integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5822.795,
    "end": 5829.556,
    "text": "And this looks like something definitely to go into for the 9.1 and for our own future research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5830.336,
    "end": 5832.077,
    "text": "But basically we can...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5833.536,
    "end": 5836.502,
    "text": " run model scenarios, we can say, yeah, I guess if it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5837.346,
    "end": 5838.206,
    "text": " It's a funny thing to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.087,
    "end": 5855.693,
    "text": "I can imagine that if you were to do this experiment, you might find informative results suggesting that enabling an agent to have imagination in an action-oriented geometry might enable it to do better than a model that doesn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5856.053,
    "end": 5864.076,
    "text": "Therefore, spending most of its time learning about relationships that may or may not be relevant in the geometrical frame that sensory data actually occur in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5865.365,
    "end": 5873.952,
    "text": " Again, long sentences abound, but I think that there's a lot there in figure three and also a lot to learn about how they're framing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5875.233,
    "end": 5877.035,
    "text": "All right, last figure, figure four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5878.407,
    "end": 5883.491,
    "text": " Figure four is an overall sketch of the PCM, the Projective Consciousness Model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5884.112,
    "end": 5886.514,
    "text": "And I think there's a few different dimensions here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5887.095,
    "end": 5892.88,
    "text": "So one is the observer at the center with their lived space, Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5893.16,
    "end": 5895.602,
    "text": "This really reminds me of the Perry personal space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5895.722,
    "end": 5899.265,
    "text": "So I hope that you'll have a lot to teach us in this domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5900.226,
    "end": 5924.829,
    "text": " and within this domain this field of consciousness field of affordances let's think about it from many different perspectives just by saying one thing i'm not always meaning to limit i'm just saying that this is one way we can think about it let's imagine that there are perceived and imagined events now observations are just models of observations so maybe there's less of a distinction there than might be seen but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5926.94,
    "end": 5937.849,
    "text": " In this geometry, observer-centric, with all of this projective geometry mapping happening, can we think about aligning your vector through time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5938.988,
    "end": 5962.9,
    "text": " down a gradient that goes from red to green so it's funny because it's a gradient that colorblind people of certain types may not be able to perceive which just so perfectly entails everything we're talking about here which is that um action in some like absolutist sense is moving downhill thermodynamically there's very few people who would say that action moves uphill thermodynamically bring them on the stream",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5963.78,
    "end": 5989.173,
    "text": " but it has to go uphill conceptually or symbolically in certain cases if not just simply logistically in terms of going uphill to go downhill later and so here we see a gradient reflecting the free energy going um from a culturally based green is okay and low surprise and then red is high surprise high alert high attention where have we seen that before",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5991.11,
    "end": 6008.859,
    "text": " Taking that kind of a culturally imbued color scale and then aligning a time vector as a dimensional projection onto that figure as a way to say that actually through space and time in the context of the projected geometry and affordance capacities of the organism, it is still downhill in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6009.764,
    "end": 6017.549,
    "text": " So I don't know where this necessarily fits in with all the mathematical formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6018.23,
    "end": 6023.814,
    "text": "Here looks pretty nice to talk about like the action, perception, prediction, imagination loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6024.214,
    "end": 6026.216,
    "text": "This is another loop we might want to learn about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.296,
    "end": 6036.323,
    "text": "We've talked a lot about loops related to like agent and environment, but now we're almost thinking like the agent within the agent is going from action, perception,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6036.963,
    "end": 6052.59,
    "text": " prediction imagination so that's something happening inside of us potentially and then um again on the right side is looking at time series that's the directions we want to take all free energy research is like through time through space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6053.55,
    "end": 6071.559,
    "text": " any other dimensions we come across we'll go through those too but that's definitely the cool dimension to think about is deep causal inference with a sound and what's visualized um in the figure so other people may see very different things in this figure and we welcome hearing about it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6072.577,
    "end": 6080.483,
    "text": " Let's close with some just final thoughts and questions to end on, which maybe we'll start ending with questions more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6081.444,
    "end": 6094.834,
    "text": "They write in their paper, Computationalist a posteriori, that means after the fact, identity theory allows that apparently contingent processing constraints may be essential to real consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6097.29,
    "end": 6115.314,
    "text": " As long as the computational model captures the phenomenological invariance, meets the functional constraints, and survives the tribunal of prediction and experiment, we should happily accept that some apparently contingent and only empirically knowable constraints pertaining to the physical realization of consciousness are actually essential to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6115.874,
    "end": 6122.816,
    "text": "So that is basically like saying, look, if we can explain and predict the invariance, the five invariants,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6123.536,
    "end": 6150.071,
    "text": " and we can capture these functional attributes there's four of them but again both of those sets the invariances and the functional attributes anyone is game to add remove or change it just needs to be justified and understood so they're saying look if it does both of those things which is why i spent so much time on it in this talk was because that's their claim it's not just broadly we could do active inference and think about consciousness it's saying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6150.911,
    "end": 6177.43,
    "text": " If we make these invariances part of our model and we at least get all the functional attributes that we want, then any model that is surviving unique explanation and predictions, the tribunal, the troika, as it were, if it does all of that, then it is basically going to come along with some wacky baggage, like a parameter we don't understand or the God's eye view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6177.63,
    "end": 6180.352,
    "text": "And then they're just saying, you're just going to have to accept that as contingent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6181.505,
    "end": 6188.409,
    "text": " So fun thought by the authors, just a really well-written and conveyed paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6189.189,
    "end": 6194.132,
    "text": "And I hope that it broaches onto many areas that we've talked about in other act in streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6195.133,
    "end": 6196.614,
    "text": "Here's my closing set of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6197.294,
    "end": 6200.856,
    "text": "One, how would we recognize a framework for consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6201.757,
    "end": 6205.139,
    "text": "And a related question is what might a framework for consciousness be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6205.859,
    "end": 6206.559,
    "text": "What if it's a poem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6206.88,
    "end": 6207.82,
    "text": "Oh, well, it can't be a poem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6208.2,
    "end": 6208.561,
    "text": "How do we know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.423,
    "end": 6210.483,
    "text": " Or what if it's a drawing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6211.204,
    "end": 6215.545,
    "text": "Or what if it's a set of ontologies, narratives, formal documents, and tools?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6216.225,
    "end": 6217.325,
    "text": "Could it be that, ONFT?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6217.785,
    "end": 6221.847,
    "text": "Could it be bolts, business, operational, legal, technical, social?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6223.227,
    "end": 6224.447,
    "text": "Could it be acceptance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.867,
    "end": 6226.808,
    "text": "Could it be fundamental agnosticism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6227.568,
    "end": 6228.989,
    "text": "Could it be free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6229.249,
    "end": 6230.009,
    "text": "How will we know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6230.689,
    "end": 6246.104,
    "text": " and that is really the key question for theories of consciousness is not do you feel right it's how will we know and do you hold yourself to that standard because we can do a lot better in this area and this paper is an example of great work in the space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6247.185,
    "end": 6250.289,
    "text": " A next question is what might a framework for consciousness enable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6250.789,
    "end": 6251.63,
    "text": "And that's pretty broad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.151,
    "end": 6254.293,
    "text": "What would it change in our action practice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6254.734,
    "end": 6257.758,
    "text": "Would we put more people in fMRI scanners or less?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6258.278,
    "end": 6263.745,
    "text": "Would we communicate with people who we don't think of as being able to communicate with at this point or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6264.045,
    "end": 6264.325,
    "text": "Why not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6265.547,
    "end": 6269.29,
    "text": " How might it change our legal systems or our social systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6269.45,
    "end": 6273.834,
    "text": "What if we could measure different kinds or types or levels of consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6274.534,
    "end": 6281.06,
    "text": "And then that's really why we need to get down to the brass tacks on what it might look like, what it measures, and what the predictions are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6282.54,
    "end": 6298.491,
    "text": " Because if we don't know the unique predictions or experiments, and this is alluding to earlier when I said that there's a lot on the table, someone's going to say, well, I have a consciousness o-meter, and this is a 2, and this is an 11, and this type of object that you care so much about is actually not conscious, so I'm just going to unplug it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6298.951,
    "end": 6303.614,
    "text": "But this other one that I care a lot about, I measured it with my device, and it was very conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6303.674,
    "end": 6305.095,
    "text": "It's very worthwhile to save.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6305.976,
    "end": 6306.056,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6306.856,
    "end": 6308.877,
    "text": " Where will people make a stand?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6309.397,
    "end": 6316.799,
    "text": "And the stand has to be on the common ground and the space of recognition of frameworks for consciousness, in my opinion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6317.379,
    "end": 6330.163,
    "text": "I'm open to changing my mind on that, but I think if we don't meet at how we'll recognize such a framework, what it might look like, and start with respecting world knowledge traditions and by respecting differences in our opinion, and we stay in a hegemonic mode,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6330.743,
    "end": 6344.673,
    "text": " in an absolutist mode, in a non-pluralist frame, culturally, methodologically, if we don't go down the pluralistic route, it's going to be, I think, very bad for practical implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6345.874,
    "end": 6351.398,
    "text": "And then lastly, what are the next steps for active inference in this domain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6351.898,
    "end": 6355.16,
    "text": "What do we want an active inference conscious agent to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6355.461,
    "end": 6358.503,
    "text": "Or how can we build on active inference now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6359.872,
    "end": 6362.653,
    "text": " Do we want it to go deeper into consciousness, deeper into action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6363.593,
    "end": 6366.414,
    "text": "We spoke about action policy selection and machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6366.454,
    "end": 6368.254,
    "text": "Could we put consciousness in machine learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6368.314,
    "end": 6370.895,
    "text": "What would be the philosophy and the implications of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6371.335,
    "end": 6377.597,
    "text": "These are all big questions, but how are we going to take this paper and develop in the directions of active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6378.519,
    "end": 6381.182,
    "text": " even if only making educational content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6381.983,
    "end": 6388.552,
    "text": "And then lastly, maybe always a good question to address is what is the goal of this research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6389.093,
    "end": 6392.897,
    "text": "Sure, we're curious about consciousness, but aren't we curious about so many things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6393.578,
    "end": 6396.682,
    "text": "What makes it worthwhile to do this research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6397.543,
    "end": 6399.365,
    "text": " Why are we doing it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6399.765,
    "end": 6401.387,
    "text": "How have we selected or how?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6401.607,
    "end": 6402.828,
    "text": "Why have we selected or how?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6402.928,
    "end": 6404.169,
    "text": "How have we selected or why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6404.189,
    "end": 6412.657,
    "text": "Every one of these combinations we really need to keep in mind, especially if it's about us, about our experience, about consciousness, about people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6413.197,
    "end": 6420.524,
    "text": "It's just, again, can't be said enough that there's too much on the table to not have this be participatory, inclusive,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6421.164,
    "end": 6424.845,
    "text": " cross-cutting, intercultural, the list just goes on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6425.365,
    "end": 6429.386,
    "text": "So everybody who's listening and thinking about it, thanks so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6429.546,
    "end": 6434.908,
    "text": "This kind of, I guess, went a little bit longer than one might have predicted, but c'est la vie, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6435.068,
    "end": 6436.589,
    "text": "When active streaming, why not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6437.669,
    "end": 6438.949,
    "text": "Thanks for participating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6439.749,
    "end": 6443.07,
    "text": "We will provide follow-up forms to the live participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6443.13,
    "end": 6444.651,
    "text": "We actually will, believe it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6445.663,
    "end": 6449.506,
    "text": " we will request your feedback, suggestions, and questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6450.086,
    "end": 6462.774,
    "text": "So if you have any thoughts, again, I tried to drop a bunch of times, really specific moments where somebody could just pause the video and say, yes, this thing right here, I do or don't agree with, or this does or doesn't resonate with my experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6463.235,
    "end": 6467.317,
    "text": "That would be epic because let's hear from a lot of perspectives on consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6467.438,
    "end": 6468.939,
    "text": "It's important to hear about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6469.479,
    "end": 6475.363,
    "text": "And then also just any feedbacks or suggestions or collaboration offers for the ACT InfoStream, always welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6476.224,
    "end": 6480.93,
    "text": " You can stay in communication with us, any of our channels or means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6481.53,
    "end": 6483.553,
    "text": "But thank you all for listening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6483.653,
    "end": 6490.241,
    "text": "Those of you who were listening live or those of you who will listen in replay because the future is always now, isn't it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6491.422,
    "end": 6491.763,
    "text": "See you later.",
    "speaker": "SPEAKER_00"
  }
]