[
  {
    "start": 8.166,
    "end": 9.426,
    "text": " Hello and welcome everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9.646,
    "end": 11.327,
    "text": "Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 11.967,
    "end": 14.788,
    "text": "Today it's October 1st, 5th, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 15.168,
    "end": 15.748,
    "text": "Greetings, Shannon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 16.448,
    "end": 26.131,
    "text": "And 2021, we're going to be discussing this awesome paper, How to Count Biological Minds, Symbiosis, the Free Energy Principle, and Reciprocal Multiscale Integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 27.739,
    "end": 29.521,
    "text": " Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 30.121,
    "end": 36.347,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 36.688,
    "end": 39.05,
    "text": "You can find us at the links on this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.431,
    "end": 45.636,
    "text": "This is recorded in an archived livestream, so please provide feedback so that we can improve on our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 46.826,
    "end": 49.189,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.87,
    "end": 57.158,
    "text": "And we'll be following good video etiquette for live streams, like muting if there's noise in the background and raising our hand so we can all speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.921,
    "end": 61.784,
    "text": "At this short link, you'll find the calendar of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.745,
    "end": 64.446,
    "text": " past and future live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.546,
    "end": 70.668,
    "text": "The first tab is the regular Tuesday live stream with two weeks per paper with the dot one and the dot two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 71.168,
    "end": 75.829,
    "text": "But then we have a few other series of streams related to different topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 75.989,
    "end": 81.611,
    "text": "So go to that link to check out what's upcoming and see if you wanna participate in one of these streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 83.372,
    "end": 86.373,
    "text": "Today in number 30.1, the goal is to learn and discuss",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.585,
    "end": 92.488,
    "text": " this awesome paper on counting biological minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 92.748,
    "end": 97.212,
    "text": "And we're really honored and appreciative that Matt Sims is here to discuss it with us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.993,
    "end": 98.874,
    "text": "So we're just going to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 100.222,
    "end": 104.704,
    "text": " introduce ourselves and walk through any of the figures, any of the formalisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 104.744,
    "end": 109.605,
    "text": "We also have a few other ideas and questions that lab participants have raised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 110.326,
    "end": 112.086,
    "text": "So this should be a great discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 112.126,
    "end": 113.367,
    "text": "Thanks everyone for joining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 113.867,
    "end": 123.891,
    "text": "We'll just go around and say hi and introduce ourselves, either just an introduction or feel free to say something that you were excited about with reading the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 124.611,
    "end": 130.574,
    "text": " And then all non-authors will go, and then we'll let Matt just provide a little context here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 131.154,
    "end": 132.255,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 132.515,
    "end": 135.276,
    "text": "I'm a postdoc researcher in California.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 136.176,
    "end": 147.902,
    "text": "And I think I'm looking forward to drawing out some of these threads about collective behavior and the timeless questions about collective behavior with some of the new approaches that are discussed in this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 148.582,
    "end": 150.343,
    "text": "So I'll pass it to Shannon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.07,
    "end": 155.331,
    "text": " Hi there, nice to see everyone again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 155.351,
    "end": 160.436,
    "text": "I'm Shannon, I'm a PhD candidate at the University of California in Merced.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 160.456,
    "end": 165.841,
    "text": "And I've blurred my background, but there is a dog rolling around, so hopefully it's not too distracting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 165.861,
    "end": 170.306,
    "text": "I will pass it to Steven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 172.844,
    "end": 174.245,
    "text": " Hello, I'm Stephen Sillett.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.305,
    "end": 175.805,
    "text": "I'm based in Toronto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.825,
    "end": 191.211,
    "text": "I'm doing a practice based PhD through the UK and around sort of psychological perspectives on practices, particularly around social topographies and spatial meaning making in participatory theatre and the arts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.032,
    "end": 193.852,
    "text": "And I'm really interested in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.872,
    "end": 194.393,
    "text": "I like the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.373,
    "end": 197.594,
    "text": " folk psychology questions that it brings up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.634,
    "end": 205.678,
    "text": "And I like this idea of a folk biology, which I found really interesting and the way that we have assumptions around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.378,
    "end": 213.141,
    "text": "It sort of ties in maybe with some of the folk quantum that came up in some of our previous sessions about what people think that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.161,
    "end": 218.304,
    "text": "So I'm really excited to see this folk idea being extended because I think that could be really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.624,
    "end": 219.104,
    "text": "So thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.025,
    "end": 221.465,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.585,
    "end": 222.286,
    "text": "And to Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.866,
    "end": 223.026,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.461,
    "end": 230.783,
    "text": " Dave Douglas, I'm retired from programming machine translation software.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 231.424,
    "end": 243.008,
    "text": "Now I get to get really busy working on a history of cybernetic learning theory project for a professor at Carnegie Mellon and all this good stuff here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 246.343,
    "end": 246.944,
    "text": " Thanks, Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 247.004,
    "end": 249.69,
    "text": "So Matt, thanks again for joining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.73,
    "end": 256.666,
    "text": "We'd be really happy to hear some context and we'll just take it from there and anyone can raise their hand or type in the live chat if they have a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 258.015,
    "end": 258.435,
    "text": " Fantastic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 258.455,
    "end": 259.416,
    "text": "Thanks so much for having me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 260.416,
    "end": 267.979,
    "text": "So the context in this paper, I suppose, it's like I wrote this paper during my PhD over at the University of Edinburgh.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 267.999,
    "end": 280.125,
    "text": "I was supervised by Dave Ward, who's an autopoetic and activist, Andy Clark, who I'm sure all of you know, and Julian Ketterstein, who's up over at the University of Amsterdam.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 281.145,
    "end": 308.568,
    "text": " And the focus of this paper was pretty much my obsession on the notion of collective intelligence and what collective intelligence might be and how cognition has developed, say, the evolution of cognition with a background of taking into account the fact that cognition is, in its most basic form, something that's going to be collective in the first place.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 309.629,
    "end": 329.405,
    "text": " So it does pull at, there is this kind of immediate tension with how we look at cognizers and how we look at cognition in the kind of folk field with typical cognitive scientific kind of research, I suppose, or traditional, should I say.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 330.586,
    "end": 343.731,
    "text": " And the point of this paper was to look at the kind of evolution of cognition, if you will, through a particular lens, using some of the conceptual tools that were provided by R.S.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 343.751,
    "end": 356.836,
    "text": "Murthy and John Bennett Smith, and see exactly how this can be formalized and looked at through the perspectives of the free nature principle with the process theory act of inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 359.847,
    "end": 361.248,
    "text": " So that's pretty much it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 362.729,
    "end": 364.49,
    "text": "Very concise summary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 364.71,
    "end": 369.093,
    "text": "Major transitions, which is the Zathmiri and Maynard Smith line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.693,
    "end": 373.075,
    "text": "Big qualitative changes over evolutionary history.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.235,
    "end": 375.477,
    "text": "And then just like you kind of brought",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 376.687,
    "end": 389.219,
    "text": " to at the end, how do we land that plane with maybe quantitative differences or structural differences in a microprocess theory, maybe active inference under the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 390.96,
    "end": 396.025,
    "text": "So Shannon or Dave or Steven, feel free to raise your hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 397.586,
    "end": 398.187,
    "text": "Otherwise, maybe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 399.389,
    "end": 406.714,
    "text": " a first question that came to mind for me was like, how do we research or understand these folk beliefs?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 407.035,
    "end": 408.856,
    "text": "Scientists are folk too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.757,
    "end": 413.279,
    "text": "And is this like sort of the mythical average citizen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.88,
    "end": 417.242,
    "text": "What are these beliefs and how do they come to be that way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 418.043,
    "end": 419.584,
    "text": "Why are they the way they are?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 419.644,
    "end": 426.469,
    "text": "These folk beliefs about biology, because that sets up a lot of the discussion and what's relevant of the contributions of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 427.719,
    "end": 428.099,
    "text": " Absolutely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 428.119,
    "end": 429.34,
    "text": "It's a very good question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 429.46,
    "end": 430.18,
    "text": "Very good question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 431.861,
    "end": 442.027,
    "text": "Folk beliefs, we have kind of obviously kind of folk psychological beliefs that take the form of actual folk psychological notions that take the form of, say, beliefs and desires.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 442.387,
    "end": 443.307,
    "text": "And these things, I think,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 444.648,
    "end": 460.085,
    "text": " give us a very good manner in which to actually approach the notion of folk biology also, with beliefs and desires being particular type of constructs which play an explanatory role, a psychological explanatory role.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 460.105,
    "end": 465.211,
    "text": "And these are successful in, for example, explaining or predicting behavior on a certain level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 466.172,
    "end": 481.896,
    "text": " And I think on a kind of first blush level, so to speak, and I think folk psychology and folk biology are kind of bed folk in the sense that folk biology is going to be based upon what we initially see via...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 484.597,
    "end": 489.098,
    "text": " like in our everyday experience of the world, for example, is what we initially see.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 489.578,
    "end": 505.261,
    "text": "So we're going to base the notion of an individual, for example, on the ideas of things that are going to be easily individuated and like biological systems that are going to be specifically reproducers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 505.541,
    "end": 512.483,
    "text": "And this is where you come into the notion of kind of the kind of Darwinian individual, as it was called by Peter Gladwell Smith.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 513.463,
    "end": 537.294,
    "text": " uh where individuals are going to be demarcated by their ability to be categorized under under three different types of with that combined or joint three different three different kind of categories which are going to be uh they have to involve variation uh heritability and uh some type of differential fitness which is just natural selection right and uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 538.484,
    "end": 546.914,
    "text": " And this type of individual has been kind of, we've invested into this notion of individual and the biological sciences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 548.843,
    "end": 559.206,
    "text": " up into a certain point, because it helps us approach certain questions and make certain inferences about systems over the long run.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 559.706,
    "end": 568.189,
    "text": "But it falls short, and I think this is again one of the grounding points of the paper, it falls short in explaining certain types of associations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 570.069,
    "end": 573.412,
    "text": " And these associations, namely, are going to be symbiotic associations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 573.812,
    "end": 589.706,
    "text": "And this is a quite important, I'd say, transition, as we spoke about before, for the simple fact that without symbiotic associations, we don't really have a manner, I think, of explaining multicellularity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 591.373,
    "end": 594.294,
    "text": " The transition from single-cellularity to multicellularity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 594.734,
    "end": 603.316,
    "text": "Now, we've had various theories, and I think one of the theories that kind of, one of the theorists that started this was Lynn Margulis over at the University of Madison, Wisconsin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 604.136,
    "end": 606.397,
    "text": "And her research was fundamental.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 607.037,
    "end": 620.04,
    "text": "And when she suggested that, for example, you have two prokaryotes, one enveloped the other through some type of phagocytosis, and they create some type of relationship over time that's just thought as ludicrous.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 620.86,
    "end": 624.523,
    "text": " And it did really push against this notion of Darwinian individual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 626.064,
    "end": 629.027,
    "text": "However, over time, we've come to accept something like this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 629.988,
    "end": 637.754,
    "text": "And I think this is like the idea that you have some type of bacteria that was enveloped by an archaea.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 638.655,
    "end": 645.64,
    "text": "And in order to explain, in order to actually think about what we have in terms of this particular type of unit,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 647.121,
    "end": 653.187,
    "text": " we really do need the notion of moving beyond, moving past our winning individuals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 653.287,
    "end": 660.654,
    "text": "And two ways of doing that, obviously, I think that the paper tries to point out this, and these are not the only two ways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 661.094,
    "end": 669.862,
    "text": "But one way of doing that is through kind of the metabolic individual, which is something that Peter Dr. Smith himself kind of tips his hat off to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 670.883,
    "end": 687.879,
    "text": " Which is just to say that metabolic individuals are individuals which they can be delineated by their metabolic machinery and having kind of autonomous metabolic machinery and other individuals can play a part of that machinery.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 689.028,
    "end": 695.99,
    "text": " And thus you have two systems that may be metabolically coupled to one another, making one system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 696.751,
    "end": 697.831,
    "text": "And that's one way to go about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 697.871,
    "end": 701.512,
    "text": "The other way to go about it was introduced by Thomas Pardue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 702.013,
    "end": 708.755,
    "text": "And this is kind of the immunological version of an individual or a physiological individual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 709.639,
    "end": 722.094,
    "text": " Now, again, these are only two types of individuals or two ways to delineate individuals outside of the kind of more traditional folk biological notion of individual, but maybe that's something that we can talk about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 722.435,
    "end": 724.397,
    "text": "Perhaps there are other ways that it might be interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 727.352,
    "end": 751.489,
    "text": " great points and so interesting how the map replaced the territory the map of the sort of darwinian triad defining an individual in the darwinian sense and then people project that back out and say reality is explained by this partitioning scheme yes so very cool steven uh with a raised hand than anyone else in here or in the live chat go for it steven thank you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 752.389,
    "end": 753.292,
    "text": " Yeah, I'd be interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.312,
    "end": 757.626,
    "text": "I think this is really good points about these different ways once you start to have...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.502,
    "end": 769.569,
    "text": " these interactions and these reciprocities across, you know, then pluralism starts to come into the picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.589,
    "end": 782.959,
    "text": "And I'm wondering how you see this moving between fields of practice, because I wonder if, like, people in the biological sciences and maybe those who work with agents would really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.88,
    "end": 802.836,
    "text": " be getting this right and then people who have a theory about thinking they know what biology is maybe physicists who maybe think they know what everything is um then have you know they have a they have a folk biology understanding of biology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.837,
    "end": 808.5,
    "text": " just like maybe other people have a folk physics understanding of quantum physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.08,
    "end": 810.942,
    "text": "So I'd be interested in that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.962,
    "end": 818.426,
    "text": "And this might even bring up some work of Chris Fields that we had on here as well in terms of other ways of approaching this multicellularity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.466,
    "end": 824.15,
    "text": "But I'd be interested in your thoughts first about that tension even within the sciences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.086,
    "end": 827.167,
    "text": " That's a really very good point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 827.827,
    "end": 836.512,
    "text": "I do think this is, before I hit that point directly, I do think this is a call for interdisciplinary work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 837.272,
    "end": 839.533,
    "text": "It's an absolute call for interdisciplinary work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 839.573,
    "end": 846.837,
    "text": "This is something that's, I think, trying to actually...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 848.227,
    "end": 857.458,
    "text": " use folk psychological notions or folk biological notions or folk physics notions, we will have some success doing these things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 857.878,
    "end": 865.127,
    "text": "However, once we run up, there are going to be certain constraints with doing that, and we'll run up to problems, run into problems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 865.307,
    "end": 866.949,
    "text": "These problems, I think, can only be...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 868.931,
    "end": 875.158,
    "text": " can only be avoided or actually addressed when using various disciplines together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 875.338,
    "end": 880.764,
    "text": "And I think this is one of the things that the Free Energy Principle actually offers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 880.884,
    "end": 888.893,
    "text": "It's an opportunity to work interdisciplinarily on various phenomena, various processes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 890.075,
    "end": 902.145,
    "text": " And you're absolutely right in saying that, like, okay, well, how can, for example, in biology, you might have a typical assumption about what cognition is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 903.126,
    "end": 905.488,
    "text": "So we'll have a lot of biologists, for example, there's a...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 907.992,
    "end": 919.14,
    "text": " There's a type of, as we were speaking about before this, there was a notion of basal cognition that has been kind of pushed within the last 15 years.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 919.22,
    "end": 936.632,
    "text": "And a lot of various kind of research programs, scientific research programs, whether it's going to be plant biology or microbiology, has kind of fed into this, which is, it's a lovely program in the sense that it's questioning how we actually look at cognition",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 938.872,
    "end": 961.798,
    "text": " And these biologists that are kind of taking these cognitive terms and using these cognitive terms, one of the things that I think that pushes against this is going to be kind of a traditional psychology that refuses to, with lack of better words, I suppose, refuses to actually engage in some type of interdisciplinary discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 962.915,
    "end": 973.063,
    "text": " So it's a psychology that's happy using, for example, more folk traditional and folk psychological notions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 973.944,
    "end": 980.329,
    "text": "And with these kind of limitations, I think, we're going to actually be stuck.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 980.85,
    "end": 981.95,
    "text": "We're really going to be stuck.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 984.272,
    "end": 989.537,
    "text": "So I guess to summarize the point is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 990.652,
    "end": 992.753,
    "text": " It is a call for interdisciplinarity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 993.153,
    "end": 1002.718,
    "text": "It is a call for questioning or putting aside the fact that we can give satisfactory explanations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1002.858,
    "end": 1010.342,
    "text": "But whether or not our satisfactory explanations are actually the explanations, or if there is just one explanation,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1013.438,
    "end": 1014.219,
    "text": " That's the question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1014.619,
    "end": 1015.319,
    "text": "That's the question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1015.359,
    "end": 1031.607,
    "text": "And I think that the whole notion of the whole idea about biological individuality is that you can be, once you take into account various angles from various disciplines, it's fine to be a pluralist.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1034.868,
    "end": 1035.789,
    "text": "It's fine to be a pluralist.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1037.025,
    "end": 1037.305,
    "text": " Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1038.046,
    "end": 1041.248,
    "text": "I was thinking of just a pluralism of what the word folk even means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.808,
    "end": 1044.47,
    "text": "Some people might think, oh, folk chemistry, that's being wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1044.53,
    "end": 1047.372,
    "text": "That's the middle school level of understanding chemistry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1047.752,
    "end": 1049.814,
    "text": "And then the experts, they know about chemistry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1049.854,
    "end": 1051.174,
    "text": "That's folk versus expert.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1051.575,
    "end": 1061.641,
    "text": "But also, it seems like folk is being used in a way, appeal to first principles, like appealing to directly intuitive, observable processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.422,
    "end": 1066.445,
    "text": "And what is active inference if not a first principles approach?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1067.265,
    "end": 1086.135,
    "text": " So there's a way to bring in some of the technical expertise, the computational backbone, but also fully retain the conversational and the casual approaches that appeal and spread to people in their understandings of different sciences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1087.536,
    "end": 1093.059,
    "text": "So Dave with a raised hand and then anyone else with a, and then yes, go for it, Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1093.993,
    "end": 1099.477,
    "text": " Yeah, there's been so much good work done by people outside their specialties.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1099.657,
    "end": 1104.701,
    "text": "I guess Erwin Schrödinger may be the most well-known in that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1106.542,
    "end": 1119.072,
    "text": "But Björn Merke, the Swedish neurophysiologist, wrote a lovely little paper from about 1999, I don't think it was ever published, about...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1120.049,
    "end": 1134.622,
    "text": " how the development of the mobile eyes in one extremity of the early vertebrates has forced neurological developments that have resulted in consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1135.783,
    "end": 1141.449,
    "text": "Simply because having mobile eyes creates such an enormous burden on us",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1144.478,
    "end": 1148.76,
    "text": " sensation that you can't just use a simple nervous system.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1149.06,
    "end": 1150.4,
    "text": "Otherwise, it's just overwhelming.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1150.94,
    "end": 1154.081,
    "text": "Have you looked at any of America's work?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1154.622,
    "end": 1154.862,
    "text": "No.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1155.202,
    "end": 1156.422,
    "text": "Okay, I'm going to have to send you that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1156.662,
    "end": 1157.583,
    "text": "Please do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1159.023,
    "end": 1159.483,
    "text": "Please do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1159.503,
    "end": 1160.504,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1161.344,
    "end": 1169.327,
    "text": "And also Mark Solms, who's a direct collaborator with Professor Friston, just wrote a popular account of...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1171.767,
    "end": 1188.772,
    "text": " active inference from the viewpoint of his own work with Merker and Jock Panksepp and Antonio Damasio on the affective foundations of consciousness and especially his own thesis that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1189.807,
    "end": 1208.014,
    "text": " In Freudian terms, it is the id that's conscious and the ego, the cortical and the neocortical processes only deign to become conscious when it really has to because it's so expensive metabolically and in terms of distraction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1210.615,
    "end": 1217.357,
    "text": "And he's one of the few people who's actually aggressive enough in trying to go out and market his dissidence",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1218.257,
    "end": 1220.959,
    "text": " from the received wisdom.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1223.14,
    "end": 1236.25,
    "text": "And he's also did an amazing update of the original project for scientific psychology in terms of Fristonian active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1236.75,
    "end": 1240.953,
    "text": "So first word to last word of that 1895 Freud essay is in 2017 terminology.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1246.618,
    "end": 1249.3,
    "text": " but still in exactly Freud's order of presentation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1250.981,
    "end": 1251.242,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1252.142,
    "end": 1253.623,
    "text": "Yes, please do send me that paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.643,
    "end": 1254.484,
    "text": "I would love to read it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1256.085,
    "end": 1256.385,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1256.626,
    "end": 1262.47,
    "text": "So, Stephen, with a raised hand, then Shannon or Blue, welcome, and anyone else in the live chat, of course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1264.692,
    "end": 1265.833,
    "text": "Yeah, just also...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.239,
    "end": 1283.526,
    "text": " this this idea of the folk psychology and i agree with your point about interdisciplinarity and it's i think it's really interesting is how the experts perceptions of the world then gets translated into a folk publication which then becomes the kind of landscape",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.286,
    "end": 1288.169,
    "text": " which pretty much everyone then starts to incorporate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.209,
    "end": 1300.44,
    "text": "And one that I found really interesting with active inference is I was looking back at older ideas of vision before they discovered the retina and the image on the retina.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.16,
    "end": 1307.165,
    "text": "And they actually thought of the eye as projecting out and sort of feeling the world, if you go back like 500 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.566,
    "end": 1314.39,
    "text": " And then we were told by the experts how it is with the retina and an image projected like a camera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.41,
    "end": 1320.193,
    "text": "So then folk psychology moved to that or folk perceptions moved to that because the experts said that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.593,
    "end": 1330.499,
    "text": "But actually it turns out that the original folk psychology or the original perceptions is actually more accurate now that we're looking at saccades and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.519,
    "end": 1336.403,
    "text": "So this is an interesting what is folk and what's expert and where does it come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.666,
    "end": 1367.909,
    "text": " absolutely it's a it's a both and because it's not like the retina emits the photons that it then senses back it's not doing echolocation but there is a tale of two densities there's a generative model and a recognition model and there's a process that's a conversation which we're going to get to with the users and resources distinction so it's like there is that bi-directional conversation and then if this direction is folk and then that direction is expert then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1368.249,
    "end": 1392.904,
    "text": " in certain social contexts which direction is going to be prioritized as an explanation and the other direction is going to be seen as a counter current literally going against the stream mainstream so how does pluralism allow us to recognize both directions in that case yes stephen yeah that's a good point daniel um that i do a bi-directional and one question i i wonder sometimes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1393.709,
    "end": 1410.323,
    "text": " I often work, I'm sort of connected to people who I'm seeing in the world of coaching and psychology as well in a way, and the arts where these things like Bayesian brains sort of did come through there about 10 years ago in a very, but it's normally come from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.573,
    "end": 1436.226,
    "text": " research which has been interpreted into a book by someone from that field which then gets picked which is still quite technical which interpreted by someone into something else and by the time it's rolled down into some other areas um these notions can be quite quite watered down you know um so yeah this this question about how to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.591,
    "end": 1450.435,
    "text": " you know, have that conversation when some of the stuff is quite cutting edge from even people in the fields themselves, um, and how to get it used in the real world is, is a big one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.115,
    "end": 1452.615,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1452.955,
    "end": 1454.076,
    "text": "Very true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.096,
    "end": 1456.156,
    "text": "So Dave with a raised hand and then anyone else?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1457.417,
    "end": 1460.278,
    "text": "I think it's in the panda's thumb where, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1462.449,
    "end": 1472.693,
    "text": " There's a rather exasperated essay about how you'll have an innovator, and if he's really lucky, he'll have a few people that work with him that fill in the gap.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1473.173,
    "end": 1478.376,
    "text": "But typically, he doesn't even have one level of competence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1478.436,
    "end": 1491.461,
    "text": "It just immediately goes into the folk press and becomes just a complete mush with almost all the original valid insights just buried under folk foolishness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1494.841,
    "end": 1505.014,
    "text": " possible so i guess just we paused on this slide because this concept of individuality is a central one here and we mentioned a few of these different",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1507.017,
    "end": 1527.004,
    "text": " ways of looking at individuality and kind of contrasted pluralism the idea that multiple perspectives can coexist and that that's okay versus i guess absolutism or monism that one of these or some other unlisted criterion of individuality is like the the broader category or the right one um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1528.28,
    "end": 1531.464,
    "text": " What is on the table with definitions of individuality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.905,
    "end": 1538.073,
    "text": "Like why would it matter in a technical capacity or for just all people?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1538.453,
    "end": 1546.023,
    "text": "What is being discussed or what matters depending on how we approach this question of individuality to Matt first and then to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1547.566,
    "end": 1547.706,
    "text": " Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1547.726,
    "end": 1550.768,
    "text": "I think there are a few things that we can say why it matters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1550.909,
    "end": 1576.468,
    "text": "One thing is that before we engage in some type of investigation about a particular type of phenomenon or process, it's quite good to know how to individuate what are involved in those processes or what that process belongs to, the relations between elements in a network, pretty much.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1577.877,
    "end": 1590.96,
    "text": " And in order to understand those elements or to locate those elements, we have to have some type of criterion in order to actually even think about the kind of larger structure of a network and the relationships between them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1591.22,
    "end": 1593.34,
    "text": "And I think this is biological individuals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1594.82,
    "end": 1596.581,
    "text": "They actually play this role.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1597.561,
    "end": 1602.982,
    "text": "And I'm reminded by something that Gregory Bateson said.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1605.229,
    "end": 1613.214,
    "text": " that in order to actually understand what the mind is, we have to actually understand how to delineate things with minds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1613.875,
    "end": 1622.16,
    "text": "But those delineations are going to be completely dependent upon the processes that we're studying.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1623.061,
    "end": 1625.803,
    "text": "Those delineations are going to actually involve the processes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1626.843,
    "end": 1631.707,
    "text": "So it's going to be a process-dependent or a phenomena-dependent individuation",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1632.879,
    "end": 1643.564,
    "text": " And that doesn't mean that these kind of individuals are going to actually, they might contrast or conflict with one another in any type of logical manner.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1644.184,
    "end": 1650.467,
    "text": "But it's just putting in place a type of pragmatism in terms of where we delineate things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1650.507,
    "end": 1653.589,
    "text": "And I think biological individuals provide us with a manner of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1655.329,
    "end": 1658.57,
    "text": " talking about, for example, specific phenomena.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1659.191,
    "end": 1670.254,
    "text": "Now, if we're talking about replication, or we're talking about, for example, competition with respect to something like replication, then we might want to actually focus upon Darwinian individuals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1670.554,
    "end": 1681.438,
    "text": "However, if we're talking about the evolution of cognition, or we're talking about the evolution of multicellularity, or these major transitions in evolution, we might want to think about individuals in a different way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1683.24,
    "end": 1684.36,
    "text": " So that's what I think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1685.48,
    "end": 1686.161,
    "text": "Thank you, Matt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.681,
    "end": 1689.881,
    "text": "Lou, and then Shannon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1689.901,
    "end": 1690.421,
    "text": "So hi, Matt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.481,
    "end": 1691.302,
    "text": "It's nice to meet you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.502,
    "end": 1694.662,
    "text": "I love this paper, found it super inspiring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.982,
    "end": 1707.105,
    "text": "And I think that the concept of an individual is closely related to maybe the concept of autonomy and also the concept of emergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.01,
    "end": 1722.111,
    "text": " And so as, and especially, I mean, it's also of course related to the concept of a cognizer, but cognizer aside, so I've heard a lot of definitions thrown around and an individual,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.453,
    "end": 1735.258,
    "text": " I liked in the paper how you described emergence with the circular causation because that echoes a lot of, I mean, it's the information theory of individuality paper by Krakauer and that group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.518,
    "end": 1740.179,
    "text": "And it just echoes a lot of, I mean, what's required for an individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.62,
    "end": 1742.881,
    "text": "So I just am thinking about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.321,
    "end": 1750.029,
    "text": " and it's one of the things that, I mean, it depends how you define it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.55,
    "end": 1755.737,
    "text": "And in like the artificial intelligence world, there's no such thing as an autonomous system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.757,
    "end": 1758.921,
    "text": "I mean, really we program in,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.522,
    "end": 1762.124,
    "text": " whether we want it to learn whatever it wants to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.184,
    "end": 1766.626,
    "text": "But I mean, they just don't, little baby robots aren't just set free with no goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.666,
    "end": 1773.37,
    "text": "There's always a self-directed or a human directed goal kind of programmed into this system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.93,
    "end": 1774.531,
    "text": "Or maybe I'm wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.591,
    "end": 1780.314,
    "text": "Maybe there's examples where it's, we just create robots for fun or artificial intelligence just to create it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.794,
    "end": 1787.54,
    "text": " but like an artificial intelligence system doesn't really have that same autonomy, or at least I don't think about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.6,
    "end": 1803.594,
    "text": "And so I just am kind of curious as to, you know, in the paper you kind of hinted at, or I don't know if you said explicitly, I was kind of flipping through looking for a quote, but you know, you hinted at like maybe a cell doesn't also doesn't have that same kind of autonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.394,
    "end": 1806.796,
    "text": "And like, so I, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.247,
    "end": 1809.128,
    "text": " I want to challenge that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.148,
    "end": 1818.395,
    "text": "In terms of active inference and the FEP, I think about it always as a scale-free architecture and a continuum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.955,
    "end": 1825.039,
    "text": "And so why is a cell not autonomous, but an organism is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.179,
    "end": 1826.36,
    "text": "Or maybe an organ is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.46,
    "end": 1827.461,
    "text": "Is an organ autonomous?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.741,
    "end": 1828.842,
    "text": "Or where do you draw the line?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1828.902,
    "end": 1834.066,
    "text": "And why are you making a line in the sand around a system like that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.495,
    "end": 1837.997,
    "text": " Fantastic question, and I agree with you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1838.657,
    "end": 1839.238,
    "text": "I agree with you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1839.258,
    "end": 1842.42,
    "text": "That's one of the things in the paper that I think that I pushed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1842.781,
    "end": 1843.661,
    "text": "I did draw a line.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1843.681,
    "end": 1847.044,
    "text": "I didn't try to draw a line that was too deep in the sand.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1847.985,
    "end": 1855.851,
    "text": "And I think in one of the footnotes, I do say something like, OK, well, I'm not suggesting that a mitochondria is going to be something that's non-autonomous.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1858.173,
    "end": 1863.297,
    "text": "However, autonomy is something that also varies in degree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1864.565,
    "end": 1882.296,
    "text": " that I think there's a certain level of autonomy that it's going to provide a different degree of, say, degrees of freedom with which some system can interact with its environment in ways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1883.536,
    "end": 1888.96,
    "text": "And that environment provides perturbations",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1890.963,
    "end": 1893.486,
    "text": " enough perturbations, enough surprise,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1897.386,
    "end": 1901.967,
    "text": " such that whatever that system is has various strategies.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1903.548,
    "end": 1912.61,
    "text": "It has to have various strategies, behavioral strategies, or we can talk about this in terms of active inference in order to actually adapt to that particular environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1913.15,
    "end": 1921.252,
    "text": "Now, this gets us into this notion of adaptive active inference versus kind of like the non-adaptive active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1922.265,
    "end": 1933.108,
    "text": " And I think the way that Michael and Julian have thought about, if I'm not mistaken, have thought about adaptive active inference is that it is based on a certain level, a certain degree of autonomy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1934.228,
    "end": 1939.249,
    "text": "And with respect to cells, I do agree with you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1939.849,
    "end": 1943.09,
    "text": "Cells do have a certain level of autonomy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1943.17,
    "end": 1947.711,
    "text": "However, cells are, again, dependent upon other cells",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1949.411,
    "end": 1954.435,
    "text": " in a way that other systems, other more autonomous systems, aren't dependent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1954.935,
    "end": 1957.437,
    "text": "Now, you'll say, of course, we're dependent upon our environments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1957.477,
    "end": 1958.958,
    "text": "We have to have oxygen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1959.799,
    "end": 1966.564,
    "text": "There are certain constraints in our environments that we have to, we really have to kind of like, our environments have to be a certain way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1966.584,
    "end": 1968.285,
    "text": "So we are dependent upon our environments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1968.685,
    "end": 1973.289,
    "text": "But it's the distinction, I think, between being dependent upon other systems",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1975.284,
    "end": 1985.872,
    "text": " And cells, for example, bodily cells are dependent upon other cells, not only say the plasma, but other cells in order to actually maintain themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1987.013,
    "end": 1988.354,
    "text": "And I think there's a difference in degree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1990.055,
    "end": 1995.459,
    "text": "And I shouldn't, again, I should impress upon this idea that I'm not saying that cells are not autonomous.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1996.735,
    "end": 2002.597,
    "text": " But most certainly, I think there's a difference in degree, and that difference in degree does matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2003.597,
    "end": 2007.238,
    "text": "Cells might even be cognitive to a certain degree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2007.258,
    "end": 2012.899,
    "text": "And this is something that someone like Michael Levin suggests, and I agree with him.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2014.02,
    "end": 2025.343,
    "text": "But I suppose the notion of adaptivity, there's a degree of adaptivity that comes along with the emergence of a certain amount of degrees of freedom.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2028.792,
    "end": 2033.315,
    "text": " So cells are dependent on other cells, but aren't humans dependent on other humans?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.635,
    "end": 2040.239,
    "text": "I mean, we're born as an infant and completely reliant upon our parents to provide everything for us for many, many, many years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.46,
    "end": 2043.622,
    "text": "And even as adults, I mean, still, we don't exist in a bubble.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.982,
    "end": 2047.444,
    "text": "I mean, perhaps we can go off to a cave and exist in isolation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.185,
    "end": 2051.767,
    "text": "But I think humans are dependent on other humans as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.267,
    "end": 2054.909,
    "text": "So maybe it's a degree of dependence or not, or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.89,
    "end": 2063.296,
    "text": " I mean, I really feel like there's a continuum here, even in terms of adaptive active inference and mirror active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2063.356,
    "end": 2067.741,
    "text": "I mean, and I fall in with Mike Levin in a lot of the ways that I think, so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2068.661,
    "end": 2070.843,
    "text": "Yeah, yeah, I think that's right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2070.984,
    "end": 2071.884,
    "text": "I do think that's right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2071.904,
    "end": 2079.552,
    "text": "I think there's a distinction to be made also, though, between kind of developmental dependence and homeostatic dependence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2082.092,
    "end": 2089.756,
    "text": " And I think homeostatic developmental dependence can have an effect on homeostasis, most certainly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2090.537,
    "end": 2095.86,
    "text": "But those are two things that might not actually always, always overlap.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2096.48,
    "end": 2107.907,
    "text": "And for example, sure, we as humans, absolutely, we have a long developmental period in which we're absolutely dependent upon our parents or being reared by some other human or some other animal.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2108.567,
    "end": 2109.048,
    "text": " Absolutely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2109.148,
    "end": 2115.054,
    "text": "And it happens that when we actually, when we get older, we probably are dependent also.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2115.995,
    "end": 2116.996,
    "text": "Absolutely agree with that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2117.737,
    "end": 2125.305,
    "text": "But there isn't any kind of development with a cell that can be mapped on to dependence or non-dependence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2125.345,
    "end": 2126.426,
    "text": "It's always dependent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2128.709,
    "end": 2129.45,
    "text": "Thanks, Matt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2130.03,
    "end": 2130.311,
    "text": "Shannon?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2133.834,
    "end": 2136.916,
    "text": " That actually flows really well into my question, Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2138.157,
    "end": 2143.922,
    "text": "I know in your paper you specifically say we might want to talk about humans or groups of humans, but we're not going to in this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2145.003,
    "end": 2146.163,
    "text": "But I'm going to ask about humans.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2147.164,
    "end": 2155.951,
    "text": "And so when you're talking about this squid and its bioluminescence,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2157.819,
    "end": 2173.182,
    "text": " and they form a temporary unit in which they are together an individual, and then it sheds the bioluminescent cells during the daytime, and then they breed again afterwards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2173.682,
    "end": 2183.684,
    "text": "I'm wondering if there is a time, like a critical time period at which units would have to be, have this,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2186.061,
    "end": 2195.013,
    "text": " symbiotic relationship with each other, or if there's a necessary strength of the coupling or a repetition of how many times the organisms need to meet up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2195.133,
    "end": 2201.041,
    "text": "And if that would change for this animal compared to systems of humans.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2201.462,
    "end": 2222.489,
    "text": " Because there's a certain way in which the humans that you interact with in everyday life, or if you're co-living with someone, even your metabolic states become co-regulated by your sleeping patterns with each other, or stress and hormones between different humans are affecting each other when you're together at a fairly regular rate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2222.549,
    "end": 2223.149,
    "text": "And so I wonder...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2224.585,
    "end": 2233.272,
    "text": " if we might define individuality or collectives slightly differently depending on the system we're looking at and the type of coupling that's occurring?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2234.153,
    "end": 2236.515,
    "text": "I think that's a great question, Shannon.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2236.555,
    "end": 2237.215,
    "text": "I would say yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2238.276,
    "end": 2246.263,
    "text": "I think there has to be some, obviously, you know about the empirical literature in terms of entrainment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2248.308,
    "end": 2254.393,
    "text": " And I think that's a really good point to make in terms of having those types of interactions with humans.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2256.435,
    "end": 2266.724,
    "text": "For the bobtail and vibrio, there's a chance that after the vibrio actually colonize the light organ, they're typically not taken in again.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2268.755,
    "end": 2277.698,
    "text": " Once they're expelled, they might be taken in by another squid, a juvenile squid, but the vibrio that continue to colonize are the ones that are left over.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2279.258,
    "end": 2286.541,
    "text": "And it might be the case that the ones that continue to colonize for that shorter period of time",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2288.542,
    "end": 2303.988,
    "text": " might become, the relationship with the squid might change to a certain degree, but I don't know any empirical evidence, and I'm ignorant about this point, that suggests that's the case, but I think that's a really good question to ask, a very good question to ask.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2306.71,
    "end": 2308.65,
    "text": "So, Blue, and then I'll make a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.251,
    "end": 2311.191,
    "text": "I think Dave was first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.471,
    "end": 2312.852,
    "text": "Oh yeah, go for it, Dave, and then Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.153,
    "end": 2314.593,
    "text": "Yeah, there's...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2315.779,
    "end": 2341.999,
    "text": " Dr. Alan Shore has done some, I think, controversial but really evocative work on the formation of the, not just the personality, but actually the neural functioning of the newborn in the dyadic relation, the intimate dialogue with the mother, face play, and the rhythm of moving in and moving back and",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2343.525,
    "end": 2351.409,
    "text": " regulate each of them regulating each other's expression of interest and each other's degree of involvement.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2352.429,
    "end": 2359.353,
    "text": "And at a really different scale, Gerald Edelman's",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2360.268,
    "end": 2383.162,
    "text": " topobiology talks about the cell and the tissue as being just so dependent he points out look we have almost no chromosomes we have almost no genes compared to how complex we are where does the regulation come from it comes from adjacent cells adjacent tissues right thanks dave blue",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2384.349,
    "end": 2401.773,
    "text": " So Shannon, kind of what she was saying about becoming co-regulated, say if you live in an environment with someone, like is a super nice transition to something that I have really been wanting to discuss in the context of this paper, which is like, okay, you become co-regulated with someone",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.173,
    "end": 2409.7,
    "text": " that you're roommates with and co-regulated perhaps by the environment, but also perhaps by the microbes that live in our environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.74,
    "end": 2416.687,
    "text": "So there's like that entire microbiome concept that is fundamental and key to humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.787,
    "end": 2421.891,
    "text": "And I don't know, I mean, I'm not like a huge studier of symbiosis, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.552,
    "end": 2433.84,
    "text": " I'm not sure if the microbiome, I know we depend on a healthy microbiome for healthy brain function and just regulation of our own internal metabolism and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.46,
    "end": 2436.962,
    "text": "And so is that a symbiosis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.742,
    "end": 2438.222,
    "text": " Or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.903,
    "end": 2445.585,
    "text": "Also, the concept of the holobiont, which is introduced by Fields and Levin, if you've read that paper, the scale-free biology paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.145,
    "end": 2448.866,
    "text": "I mean, it is like, to what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.886,
    "end": 2453.368,
    "text": "And they talk about physiological individuality there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.748,
    "end": 2455.069,
    "text": "So is that symbiosis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.209,
    "end": 2455.629,
    "text": "Is it not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.729,
    "end": 2457.53,
    "text": "Is symbiosis also a spectrum?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2457.61,
    "end": 2461.311,
    "text": "Or is it a discrete category of things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.411,
    "end": 2464.633,
    "text": "And I also think about symbiogenic viruses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.493,
    "end": 2472.219,
    "text": " which like, you know, the very early viruses, it's like, you know, effectively like instantiating speciation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.239,
    "end": 2476.663,
    "text": "Like the viruses insert into the genome and, you know, developing species and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.764,
    "end": 2480.227,
    "text": "And it's beneficial to the virus and the host, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.347,
    "end": 2485.492,
    "text": "So anyway, I just wonder, like, what are your thoughts on that or if you have any insight there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.172,
    "end": 2486.952,
    "text": " Absolutely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2487.112,
    "end": 2489.073,
    "text": "Again, a wonderful question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2489.573,
    "end": 2508.16,
    "text": "With respect to symbiosis, I think there's been some work on that and some very, I think, convincing work done by Queller and Strassman, who suggest a particular type of XY, locating symbiosis on an axis, pretty much.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2508.24,
    "end": 2510.281,
    "text": "So you have cooperation",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2511.451,
    "end": 2512.473,
    "text": " I believe on one part of that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2512.533,
    "end": 2514.095,
    "text": "I have to look it up again, actually.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2514.135,
    "end": 2516.098,
    "text": "I should look that up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2516.819,
    "end": 2519.823,
    "text": "But you have varying degrees of symbiosis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2521.456,
    "end": 2537.728,
    "text": " And again, symbiosis, in the particular paper that we're discussing now, I've concentrated on mutualisms, but you have various forms of symbiosis that I think you've actually pointed out previously that can be kind of modeled quite well with kind of game theoretic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2538.789,
    "end": 2546.494,
    "text": "And this is going to be, it's going to reign from parasitism to communalism to kind of mutualisms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2547.555,
    "end": 2551.117,
    "text": " And I think these are all, again, degrees.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2551.597,
    "end": 2553.419,
    "text": "And these degrees can change.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2554.599,
    "end": 2570.248,
    "text": "There have been quite a many theories, I suppose, and I think Qualer and Strassman have also suggested this, that depending upon the condition of a system, with respect to another system, say there's symbionts, a parasitic relationship can turn into a mutualism, and vice versa.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2574.377,
    "end": 2576.958,
    "text": " So these things move, these types of things move.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2577.838,
    "end": 2587.282,
    "text": "And if you think about, this is an automatic thing that we can even apply to this kind of cellular biology, when you think about something like the origin of cancer, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2588.002,
    "end": 2596.065,
    "text": "When you have cancerous cells, they've actually grown within a host, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2596.325,
    "end": 2601.267,
    "text": "They're part of a body, but end up being some type of competitor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2602.748,
    "end": 2607.23,
    "text": " And I think this is quite interesting to think about this through the lens of symbiosis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2607.33,
    "end": 2613.292,
    "text": "Obviously, that's not a symbiosis, but we can use symbiosis to think about that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2613.912,
    "end": 2621.135,
    "text": "But with respect to thinking about host cells and parasites or host cells and neutralisms,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2622.31,
    "end": 2643.527,
    "text": " uh, there's like, there's, there's many, many different kinds of, um, ways, uh, areas of the spectrum that one can actually analyze, uh, our relationship with, uh, our own cells and our relationships with, uh, with micro microbiota, microbiota, like Scott Gilbert, obviously, you know, and Scott's work is, is, is quite incredible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2643.547,
    "end": 2649.872,
    "text": "He's the one I believe who introduced the notion of the hollow biome, uh, the hollow genome, excuse me, and hollow biome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2650.553,
    "end": 2651.354,
    "text": "And, uh,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2652.409,
    "end": 2676.678,
    "text": " I think this notion of a hollow biant is specifically, it includes symbiosis, but it includes actually a kind of community, a particular kind of community of various systems that themselves qualify as one system, can qualify as one system, or having, you know, if you were to put it in a different way, they create a stable state, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2677.058,
    "end": 2678.299,
    "text": "A steady state themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2678.999,
    "end": 2681.46,
    "text": "And one that's kind of resistant to perturbation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2682.98,
    "end": 2691.142,
    "text": " And that's the manner in which I think, it's a very easy manner in which I can think of the holobiont as an individual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2692.283,
    "end": 2708.107,
    "text": "Whether or not one wants to call two symbiotic systems that are in a mutualistic relationship a holobiont, that's another question, but I think typically it's been applied to more than two systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2709.79,
    "end": 2710.611,
    "text": " Thank you, Matt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2711.171,
    "end": 2735.89,
    "text": "So for Shannon's questions about, you know, the co-regulation and humans and trust, it made me think about how one-off games lead to kind of community or population-like game theory, whereas repeated games over evolutionary time, like in the case of the squid and the vibrio, or in the case of the eusocial insects, that leads to organismal-like dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.05,
    "end": 2737.551,
    "text": "And then what you just described and what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2738.131,
    "end": 2748.117,
    "text": " Levin also got at in the paper is the breakdown of, for example, organismality into population of cell versus population of cell dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2748.257,
    "end": 2750.479,
    "text": "So it's absolutely a cool framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.939,
    "end": 2758.923,
    "text": "And then also a really important part on figure four is you have the peak of integration and then greeting Serval.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.924,
    "end": 2763.728,
    "text": " the peak of integration, and then that's the Y axis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2764.289,
    "end": 2777.443,
    "text": "So it's like, instead of saying, we're gonna say which organisms are tall or short out there in the world, it's like you do the population level survey and they range from two to four feet and you say, okay, it's in the upper 50th percentile, it's tall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2777.543,
    "end": 2780.586,
    "text": "Like we're renormalizing our comparison stick",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.147,
    "end": 2785.33,
    "text": " Two, the maximum integration of the squid bacteria.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.35,
    "end": 2787.672,
    "text": "So we're not comparing it to some other system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2788.293,
    "end": 2792.276,
    "text": "We're renormalizing and we're able to have a system-specific understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.676,
    "end": 2794.738,
    "text": "Here, it's relatively more integrated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2795.078,
    "end": 2796.359,
    "text": "Here, it's relatively less.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2796.779,
    "end": 2805.186,
    "text": "It's a second question whether the peak of integration of the squid and the vibrio is like the integration of some computer program with another computer program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2805.686,
    "end": 2830.953,
    "text": " maybe it's apples and oranges maybe we'll have the right framework that allows us to transmute apples and oranges but here you can just relativize to the system itself and that's like very specific and powerful so steven with a raised hand and then anyone else yeah i'll give you a chance to get a breath because we've thrown a lot at you but um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2833.444,
    "end": 2836.526,
    "text": " You mentioned allostatic and homeostatic forces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.587,
    "end": 2845.772,
    "text": "So you've got that difference there between something trying to maintain or trying to move forward and change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.593,
    "end": 2850.694,
    "text": "And I'm interested in how that reflects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.195,
    "end": 2858.339,
    "text": "So, for instance, I suppose you could have within a set of cells, you could have some cells or some cells",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.213,
    "end": 2887.503,
    "text": " organs you know trying to maintain homeostasis and others say even maybe a parasite is trying to allostatically enter that world and create a niche for itself and I think that that question about you know that balance between the two is a useful divide or a useful way to think about the same cell and of course in cells they change to become different types of cells so that's something that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.581,
    "end": 2917.121,
    "text": " whole organisms have less ability to be completely completely different types of organisms you know they can't um you are what you are i suppose that's one defining thing about but you can still change your focus from homeostasis to allostasis i think that is quite common and i wonder what your thoughts are around that um and how that that itself could be a useful way to frame things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.008,
    "end": 2919.968,
    "text": " That's really interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2921.629,
    "end": 2940.818,
    "text": "The manner in which I'm looking at homeostasis and the coupling of homeostatic regulatory systems to allostatic regulatory systems is based upon a more traditional idea that homeostasis might be considered more reactive, where allostasis is anticipatory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2941.718,
    "end": 2941.939,
    "text": " Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2941.999,
    "end": 2945.124,
    "text": "And allostasis takes a particular form.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2945.144,
    "end": 2951.414,
    "text": "It's quite interesting with respect to, in the context of active inference, because we talk about expected free energy minimization.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2952.095,
    "end": 2955.921,
    "text": "And this is something that one can tie together with the notion of allostasis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2959.548,
    "end": 2974.375,
    "text": " And when you start to think about the homeostatically coupled systems, one system with respect to symbiotic systems might be playing a larger role in being able to make inferences further and further into the future.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2978.377,
    "end": 2987.442,
    "text": " you've looked at previously actually on a slide, Mike Levin's cone slide that Daniel actually had up previously.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2987.462,
    "end": 2993.365,
    "text": "And I think this is a quite interesting manner of thinking about kind of a transition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2993.985,
    "end": 3002.17,
    "text": "Perhaps we've always been allostatic systems, living systems have always had certain capacity to anticipate",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3003.18,
    "end": 3011.586,
    "text": " However, when we start putting systems together, we have a larger capacity or more capacity to anticipate further and further in the future.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3011.606,
    "end": 3016.849,
    "text": "And I think one of the dimensions on this particular cone is this dimension of kind of out of static control.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3019.05,
    "end": 3021.271,
    "text": " This is my interpretation of Michael's work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3022.271,
    "end": 3024.751,
    "text": "And I think this is very important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3024.791,
    "end": 3041.075,
    "text": "And again, you'll see that there's that kind of balancing, that if one is given a type of approximate Bayesian inference that's going to be what we suggest is going on, you have to actually balance this with priors, which are going to be respective to the past.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3041.215,
    "end": 3042.836,
    "text": "So you have another axis on the cone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3044.816,
    "end": 3050.701,
    "text": " And as these things expand, sometimes the past is going to be a bit deeper on the cone than the future.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3051.142,
    "end": 3053.224,
    "text": "But allostasis is on the top there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3053.284,
    "end": 3070.98,
    "text": "And I think that with multicellularity, with the interactions, more interactions, perhaps we'll see a capacity, a larger capacity to go upwards in the future-oriented direction",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3072.625,
    "end": 3077.947,
    "text": " And this is something, again, and I appreciate Blue's bringing this out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3078.007,
    "end": 3081.869,
    "text": "This is something that's, again, a matter of degree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3081.929,
    "end": 3084.49,
    "text": "It's not a line that's cut.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3084.53,
    "end": 3086.111,
    "text": "It's a matter of degree, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3086.711,
    "end": 3095.695,
    "text": "And so just simply, we know that there are certain types of microorganisms that do anticipate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3096.732,
    "end": 3098.412,
    "text": " that do like, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3098.793,
    "end": 3108.555,
    "text": "And this is kind of outward anticipatory behavior, whether it's, I think it's going to be a physarum polycephalum, which is the kind of a plasmodial slime mold.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3109.636,
    "end": 3117.238,
    "text": "Various experiments in 2011 have suggested that, you know, physarum can actually anticipate",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3118.178,
    "end": 3123.34,
    "text": " various periodic bouts of dryness, this type of thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3123.36,
    "end": 3126.741,
    "text": "This is an outward periodic behavior, an outward anticipatory behavior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3128.862,
    "end": 3135.825,
    "text": "That's not to say that anticipation is not happening or occurring prior to that in the internal dynamics of systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3136.225,
    "end": 3140.346,
    "text": "That's just an outward manner of measuring it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3142.067,
    "end": 3146.729,
    "text": "Again, I do think that it's a quite important notion, allostasis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3148.129,
    "end": 3170.961,
    "text": " And perhaps all systems, again, I would be safe, at least my position now is that all systems are pretty much allostatic systems that kind of enslave homeostatic regulatory systems to maneuver and invest their metabolic machinery in metabolic capacities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3172.619,
    "end": 3183.58,
    "text": " to a particular type of state that perhaps they haven't reached yet, considering a manner of trying to avoid perturbation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3185.762,
    "end": 3187.004,
    "text": " Thank you, Matt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3187.224,
    "end": 3200.901,
    "text": "Very similar to mere adaptive inference being more homeostatic, more like the ball just in the bottom of the bowl, and then increasingly anticipatory Rosen's ecology, adaptive active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3201.482,
    "end": 3202.243,
    "text": "Stephen, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3204.491,
    "end": 3223.622,
    "text": " yeah this this ties in actually um a lot of work around um coaching funny enough the world of coaching and um team coaching is like and team coaching so and i think this also brings in you know these other types of clusters groups symbiotic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.802,
    "end": 3251.239,
    "text": " um relationships beyond maybe what we might just think of as a system you know um so the idea of a team um in a as a in a systemic context um is really interesting because they and this might be how allostasis in a social context starts to enable that larger horizon so each even allostasis is sort of stasis and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.503,
    "end": 3277.85,
    "text": " working together you may start to break your own need for stasis you know and it just becomes some other organization and i think it'd be really interesting and looking at how the way that team coaching either for performance because there's performance orientated team coaching or there's developmental orientated team coaching but that idea of and then the enabling context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.57,
    "end": 3291.498,
    "text": " becomes what we would call the ecological niche, I suppose, becomes as much the focus of attention as the system, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.558,
    "end": 3293.679,
    "text": "And I think this might tie into what you're saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.011,
    "end": 3295.491,
    "text": " Thanks, Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3295.832,
    "end": 3304.099,
    "text": "So Dave, I know that you had a little bit to share, but I'll just bring up one point related to this definitions of individuality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.179,
    "end": 3306.821,
    "text": "And then Saral, anything you wanna ask, feel free to raise your hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3307.882,
    "end": 3317.17,
    "text": "We hear a lot of terms like autonomous and self-organizing, which sort of highlight the ability to cleanly partition a system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3317.39,
    "end": 3320.312,
    "text": "Like people will say the embryo, it's a classic self-organizing system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3321.393,
    "end": 3324.014,
    "text": " except for the context of the womb.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3324.594,
    "end": 3333.556,
    "text": "And so there's sort of on one hand, the desire to individuate and partition and look at agentic systems, agent-based modeling, autonomous and self-organizing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.036,
    "end": 3339.878,
    "text": "And then that is critiqued by the ecological perspective or the relational perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3340.258,
    "end": 3345.839,
    "text": "So there's sort of a dialectic between like, it's all individuals all the way down and it's all relationships all the way down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3346.299,
    "end": 3348.62,
    "text": "We see that debate in particle physics,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3349.44,
    "end": 3353.101,
    "text": " We understand it less than we might some of the biological systems or in a different way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3353.581,
    "end": 3359.883,
    "text": "But it's like two pillars that we're navigating between, and it is a continuum in between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3359.923,
    "end": 3361.943,
    "text": "So that's why it's such a nice discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3362.683,
    "end": 3368.165,
    "text": "So Dave, if you're around, feel free to, anytime you're ready, you can go for the conversation theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3368.305,
    "end": 3369.385,
    "text": "Otherwise, Blue, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3371.606,
    "end": 3372.426,
    "text": "Okay, sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3373.066,
    "end": 3373.486,
    "text": "Now, sorry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3374.456,
    "end": 3380.637,
    "text": " Yeah, slides 18 and 19, we inserted that into the slideshow that we prepared for Dr. Sim's presentation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3381.277,
    "end": 3384.938,
    "text": "And these slides bring in some matters that he doesn't address in his paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3385.458,
    "end": 3402.121,
    "text": "So to justify that, but not to paraphrase the insertions, the free energy principle and active inference jointly constitute a relatively mature macro level framework for describing living psychological and other complex self-stabilizing systems.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3403.34,
    "end": 3414.403,
    "text": " As of the moment, no comparably mature micro-level framework has been both proposed for and coordinated with this macro level of analysis.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3415.343,
    "end": 3428.227,
    "text": "I suggest that the basis for such a needed micro-level framework was proposed by my teacher, the late cybernetist Professor Gordon Pask of Brunel University, in the form of conversation theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3429.679,
    "end": 3438.768,
    "text": " Matt's essay, How to Count Biological Minds, considers the puzzle of whether an individual can come into existence and pass out of existence repeatedly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3439.93,
    "end": 3453.103,
    "text": "Matt's account of this puzzle, and please excuse me if I stray from oversimplification into parity, his solution in terms of degrees of integration is a perfectly acceptable, insightful account",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3453.826,
    "end": 3456.828,
    "text": " at a macro or molar level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3457.489,
    "end": 3465.696,
    "text": "The metaphors of quantity and elsewhere probability nicely express falsifiable common sense attributes of real-world processes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3467.037,
    "end": 3481.008,
    "text": "But if one states this paradox, the paradox of emergent but transient individuals in terms of conversation theory, then one speaks of a conversation recurring over time between the same conversants.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3482.29,
    "end": 3488.535,
    "text": " This terminology makes the proposal more intuitive, less shocking, and more readily assimilable for readers.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3489.296,
    "end": 3500.766,
    "text": "Better yet, familiar ideas, attention, rhythm of discourse, punctuation of a conversation through understandings or through agreements to disagree, they all play their roles.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3502.607,
    "end": 3510.494,
    "text": "Now, what place would be occupied by the special disciplines that have enjoyed detailed treatment by conversation theory as a micro-theory?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3511.36,
    "end": 3531.364,
    "text": " During his career, Professor Pask carried out an array of experiments studying human learning of complex subject matters using configurations of software and hardware to administer and collect data from those experiments and developed a vocabulary allowing elegant description and restatement of the results of those experiments.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3532.324,
    "end": 3540.926,
    "text": "Moreover, he developed a theory of micro-level learning teaching as a single literally irreducible complex of activities",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3541.75,
    "end": 3549.037,
    "text": " regardless of whether they were realized by living organisms, by machinery, or by complexes of those two fabrics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3550.238,
    "end": 3555.062,
    "text": "I see many deep and broad analogies between conversation theory and active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3555.723,
    "end": 3566.373,
    "text": "Each addresses important aspects of real-world phenomena in a systematic way, such that each treats of matters that are not so well handled by the other.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3567.529,
    "end": 3590.416,
    "text": " i believe that active inference and conversation theory can enrich and streamline each other by carving natural science scholarship closer to its joints very nice thank you dave so maybe matt any thoughts on that and then we'll go to blue i have to i have to say that i'm absolutely uh the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3592.366,
    "end": 3599.027,
    "text": " The cybernetic theory that I've concentrated upon and been most influenced by, it's very limited.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3599.928,
    "end": 3609.71,
    "text": "And conversation theory, I'm absolutely interested in seeing more of this, I suppose, analysis and understanding more of this analysis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3609.73,
    "end": 3614.071,
    "text": "So I'm quite ignorant about conversation theory, and it's most certainly piqued my interest.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3616.721,
    "end": 3620.306,
    "text": " Yeah, let me think about this for a few minutes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3620.627,
    "end": 3622.67,
    "text": "I'm still kind of internalizing what you've just said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3624.124,
    "end": 3633.067,
    "text": " Yep, and one note on the conversation, a lot of times cybernetics falls into that individualism mode, like it's the one self-guided missile.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3633.527,
    "end": 3636.088,
    "text": "It's not the conversation between the flock of birds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.128,
    "end": 3639.989,
    "text": "So cybernetics isn't just about individuals, it can be about collectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3640.23,
    "end": 3652.514,
    "text": "And it was our colleague, Alex, who told us via one of his teachers, Levenchuck, just yesterday that cybernetics died when it could explain homeostasis, but it couldn't go beyond.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3653.334,
    "end": 3665.906,
    "text": " So we're talking about the transition from individuals to collectives and from mere homeostasis to adaptive allostasis over developmental and evolutionary timescales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3666.406,
    "end": 3675.695,
    "text": "And so it's sort of like you can have homeostatic individuals and then they can have emergence towards allostatic collectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3676.744,
    "end": 3681.128,
    "text": " And then what is that process of emergence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3681.808,
    "end": 3690.696,
    "text": "It's a conversation or potentially something like that using our folk understanding of interacting pieces, which are us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3692.598,
    "end": 3692.778,
    "text": "Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3696.073,
    "end": 3703.558,
    "text": " So my question is maybe technical, but also maybe Serval has some insight to provide as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.719,
    "end": 3711.283,
    "text": "So I wanted to ask, here in the beginning of your paper, you talk about free energy being an additive quantity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.864,
    "end": 3725.633,
    "text": "So the free energy that arises at the macro scale is only the free energy that there is for the ensemble and may be quantified by summing the free energy associated with each constituent micro scale Markov-flanketed system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.313,
    "end": 3727.815,
    "text": " So is that true?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3728.195,
    "end": 3731.218,
    "text": "And does that account for emergence?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.279,
    "end": 3737.624,
    "text": "Because I feel like there has to be some greater free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.704,
    "end": 3742.068,
    "text": "And so I'm not well-versed in the technical mathematics of the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.289,
    "end": 3744.09,
    "text": "Because I think about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.491,
    "end": 3748.473,
    "text": " just in terms of the bioluminescence of Vibrio fischeri, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.414,
    "end": 3757.08,
    "text": "There's like a criticality that happens, like almost like a phase transition that the system undergoes to become bioluminescent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.12,
    "end": 3760.902,
    "text": "Like after there's a certain concentration of bacteria in the light organ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3761.443,
    "end": 3768.808,
    "text": "And so like, does this criticality, this phase transition, does this not like minimize free energy to a greater degree?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.128,
    "end": 3771.29,
    "text": "Like, or is it really just the sum of its parts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3772.981,
    "end": 3774.802,
    "text": " Wonderful question, really wonderful question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3776.984,
    "end": 3794.094,
    "text": "I do think that, OK, there might be a distinction in terms, here, a distinction in terms of what the free energy of the actual constituents as a group have, as an ensemble have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3798.533,
    "end": 3809.719,
    "text": " And a distinction between that, for example, and bioluminescence as a particular type of free energy minimizing strategy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3811.32,
    "end": 3813.02,
    "text": "I think it's a fantastic question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3813.04,
    "end": 3821.445,
    "text": "I'm getting the notion of the summation of free energy from Palacios and Randstad.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3822.791,
    "end": 3829.639,
    "text": " And I think that pretty much the idea is that I'm not sure if there's going to be any... Well, I'd like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3829.679,
    "end": 3830.66,
    "text": "Maybe I can ask you, Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3830.96,
    "end": 3838.108,
    "text": "Do you see that there is some type of inconsistency between saying that, for example...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3840.017,
    "end": 3854.53,
    "text": " free energy is going to be an additive quantity and the fact that there can be some type of emergent property that is not going to be reducible to, say, the constituent relations and the elements.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3855.47,
    "end": 3858.053,
    "text": "Do you think that there's some type of inconsistency there?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3858.848,
    "end": 3863.774,
    "text": " Well, so I definitely do think that free energy across scales is additive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3864.134,
    "end": 3870.762,
    "text": "Like I agree with that wholeheartedly, but I don't think that it reduces to the mere sum of the parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3871.563,
    "end": 3878.212,
    "text": "And I mean, this also, it's the work, the recent work of Rosas and also Eric Hole looking at,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.672,
    "end": 3885.297,
    "text": " the partial information decomposition over the phi metric that's used in integrated information theory of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3885.598,
    "end": 3887.419,
    "text": "And so this kind of speaks to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3887.479,
    "end": 3897.187,
    "text": "There has to be some mathematical... I mean, I just feel like... I don't know that there has to be, but I feel like there should be some mathematical...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.008,
    "end": 3900.369,
    "text": " quantification of more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3900.789,
    "end": 3907.271,
    "text": "So it should be a greater degree of free energy reduction when the system is more than a sum of its parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3907.651,
    "end": 3915.594,
    "text": "And so I think that that's an argument that you make in the paper as well, that it can't be, it's not reducible to just the component parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.034,
    "end": 3919.855,
    "text": "So is the free energy then just reducible to the component parts here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3920.195,
    "end": 3922.376,
    "text": "Because that to me seems inconsistent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3923.041,
    "end": 3923.161,
    "text": " Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3923.181,
    "end": 3924.182,
    "text": "I absolutely see your point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3924.662,
    "end": 3927.503,
    "text": "The manner in which I'm thinking about this, though, is that,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3934.548,
    "end": 3936.89,
    "text": " There's a very informative paper by Santos.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3937.27,
    "end": 3938.031,
    "text": "He's a philosopher.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3938.111,
    "end": 3941.194,
    "text": "He actually deals with emergence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3942.535,
    "end": 3958.269,
    "text": "And it's a really nice way, I suppose, I really like this, the paper that you suggested about kind of using the phi metric and various manners in which to do information decomposition over various time steps.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3959.626,
    "end": 3965.551,
    "text": " in order to think about some metric for emergence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3966.232,
    "end": 3968.674,
    "text": "I think there's been various metrics for emergence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3969.255,
    "end": 3970.556,
    "text": "I haven't picked my favorite metric.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3970.616,
    "end": 3972.257,
    "text": "That's something that I'm still getting into.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3973.779,
    "end": 3978.783,
    "text": "But I think it's quite interesting to think about, okay, well, what makes an emergent system?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3978.903,
    "end": 3984.808,
    "text": "Is an emergent system going to be more than the kind of relationships and elements of a network?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3985.669,
    "end": 3987.31,
    "text": " And what makes it so?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3987.39,
    "end": 3998.358,
    "text": "Is it going to be the relationships themselves, or is it going to be the combination of the relationships, or is it going to be the interaction between the system, the emergent system, and the environment?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3998.758,
    "end": 4012.868,
    "text": "And I think when you start thinking about the interactions between the emergent system and the environment, there's a distinction between what free energy is going to be minimized and the free energy of the system itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4012.888,
    "end": 4015.01,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4017.368,
    "end": 4036.046,
    "text": " There's a distinction being made, and perhaps I'm wrong about this, but emergence is not something... One of the reasons why you have an emergence system is going to be for the simple fact, okay, well, you have... It's not only the interactions of the parts and the parts or the elements.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4036.466,
    "end": 4041.211,
    "text": "It's going to be the interaction of a particular type of persistent element",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4041.854,
    "end": 4043.375,
    "text": " And I think this is the idea.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4043.395,
    "end": 4048.377,
    "text": "You have a persistence with a particular environment or with an environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4048.938,
    "end": 4061.064,
    "text": "And it's the perturbations within that environment that occur along with that system in which kind of free energy is going to be, free energy that has to be minimized is going to arise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4061.544,
    "end": 4062.384,
    "text": "And I think it's like, so...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4065.177,
    "end": 4082.934,
    "text": " You might say, of course, that the system itself, when it has component parts and relationships between those component parts, that system can be thought about in terms of an additive or summation of the free energy of the various parts and relations in that system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4083.234,
    "end": 4088.138,
    "text": "But that's distinct from that system's engagement or interactions with this environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4088.459,
    "end": 4089.78,
    "text": "Then you'll have extra free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4092.005,
    "end": 4093.186,
    "text": " We have an additional amount of free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4093.206,
    "end": 4106.318,
    "text": "And maybe that's another way, a manner of thinking about, okay, well, an emergence as measured, I don't know if you can measure emergence in terms of free energy, but of course you're going to be able to measure it in terms of some type of mutual information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4107.611,
    "end": 4108.111,
    "text": " Very nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4108.451,
    "end": 4108.771,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4108.811,
    "end": 4109.392,
    "text": "That's super helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.412,
    "end": 4111.212,
    "text": "I think that was a question there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4111.272,
    "end": 4114.294,
    "text": "I don't know if you can measure emergence in terms of free energy, like you said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4114.894,
    "end": 4117.455,
    "text": "And you might have to look at something like mutual information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4117.535,
    "end": 4122.377,
    "text": "And I was thinking that perhaps the free energy that's minimized by each individual system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4123.528,
    "end": 4127.549,
    "text": " then when they become a symbiotic unit or something, it might end up being identical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4128.169,
    "end": 4139.391,
    "text": "And again, I'm thinking of humans again, but if humans are walking and they happen to start walking in step, that's going to look like an identical oscillation as they're coupling with each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4139.932,
    "end": 4145.713,
    "text": "So there might not be more free energy that's minimized by this coupled system walking in step together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4147.213,
    "end": 4150.974,
    "text": "But it might look like the same free energy once they're a coupled system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4152.731,
    "end": 4177.933,
    "text": " one thing that we talked about i think in the dot zero or around there is there's situations where the cooperation the coordination increases synchrony so just increases the mutual information of the humans walking in step but also you could imagine anti-phase relationships which is kind of like division of labor or task allocation where the emergence is not due to um copy and conform but the emergence is actually you know you go left i go right and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.593,
    "end": 4187.877,
    "text": " And so in both of those cases, there would be a change in the non-equilibrium steady state, which is what is introduced throughout the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4187.998,
    "end": 4192.88,
    "text": "And so that starts to build the road towards quantitative discussions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4193.58,
    "end": 4194.821,
    "text": "And you could take a system that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4195.521,
    "end": 4199.283,
    "text": " you suspect already has emergence in nature and remove a part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4199.523,
    "end": 4201.464,
    "text": "That's kind of like the gene knockout approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4201.844,
    "end": 4213.651,
    "text": "So gains of functions and loss of functions and all the other ways that we study function can now have something like a common grounding, potentially using these metrics here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4214.331,
    "end": 4218.113,
    "text": "So Dave, and then maybe Matt, if there's a response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4218.353,
    "end": 4219.354,
    "text": "Otherwise, Stephen, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4220.615,
    "end": 4224.757,
    "text": "Okay, now Blue asks, is free energy additive?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4226.067,
    "end": 4236.875,
    "text": " There's an exercise that I'd suggest that should bring that question to a more bound earth and more poignant focus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4237.696,
    "end": 4246.022,
    "text": "Take all the discussions you've heard of free energy and substitute for the phrase free energy the word anxiety.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4249.524,
    "end": 4250.565,
    "text": "It already is that way, Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4250.585,
    "end": 4251.686,
    "text": "What do you want me to do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4258.74,
    "end": 4259.981,
    "text": " What would that show though?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4260.001,
    "end": 4264.124,
    "text": "Do you think it's a natural fit or could we put any word there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4264.204,
    "end": 4265.085,
    "text": "What do you think it means?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4266.166,
    "end": 4273.251,
    "text": "Well, so just using anxiety, like it totally leads to the mob mentality and like ultra paranoia and conspiracy theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.291,
    "end": 4274.712,
    "text": "So like definitely additive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.595,
    "end": 4278.796,
    "text": "Yeah."
  },
  {
    "start": 4280.297,
    "end": 4281.578,
    "text": "Possibly multiplicative though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4281.958,
    "end": 4284.3,
    "text": "Like could be exponential.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4284.32,
    "end": 4284.4,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4288.058,
    "end": 4288.738,
    "text": " Yes, Steve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4290.398,
    "end": 4302.141,
    "text": "Yeah, there actually have been clinicians that have really used free energy, although they didn't use the term as probably before the usage was was coined.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4303.041,
    "end": 4313.663,
    "text": "It was William Glasser in control theory and his earlier work really has this quantum of anxiety.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4314.678,
    "end": 4316.219,
    "text": " that these patients had to manage.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4316.259,
    "end": 4320.841,
    "text": "These tended to be out-of-control criminal adolescents, so they were pretty screwed up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4321.741,
    "end": 4327.363,
    "text": "And he found ways to get them to rein themselves in and control themselves.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4328.324,
    "end": 4332.505,
    "text": "But think about the Blitz effect, London Blitz.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4333.406,
    "end": 4338.948,
    "text": "You had objectively tremendous stress on everyone all the time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4340.233,
    "end": 4352.728,
    "text": " But there was almost no hospitalization for shell shock among civilians, including the air raid wardens that were in digging, you know, a building beside them would get bombed and they'd rush in and try to find people and drag them out.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4353.108,
    "end": 4356.873,
    "text": "Extraordinarily low rates of psychosomatic disorder.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4358.447,
    "end": 4362.948,
    "text": " There's a certain, there's multiple paths, you know, people's brains are really complex.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4363.688,
    "end": 4367.59,
    "text": "There are certain ways that people actually do get shocked into rationality.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4367.93,
    "end": 4377.092,
    "text": "I've been in situations where the right thing had to be done right now with no hesitation, no anxiety, no blame, just do the right thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4377.672,
    "end": 4379.593,
    "text": "And there was no question, just do the right thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4380.491,
    "end": 4382.653,
    "text": " whether it puts me in danger or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4383.274,
    "end": 4385.015,
    "text": "A child's in danger, you do the right thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4385.435,
    "end": 4388.178,
    "text": "So it's not predetermined.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4388.578,
    "end": 4394.042,
    "text": "But typically, yes, what does happen is a thing called reorganization.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4394.423,
    "end": 4397.325,
    "text": "It's a technical term that Glasser uses.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4397.765,
    "end": 4399.607,
    "text": "It essentially means going crazy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4399.867,
    "end": 4409.715,
    "text": "And in the really worst case, the reorganizations get faster and faster and faster and more and more drastic as the personality becomes more and more simplified.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4410.307,
    "end": 4421.413,
    "text": " And that's something that Kurt Levin or Lewin worked through in his work on driving children crazy by giving them more and more complicated tasks and under more and more anxiety.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4421.513,
    "end": 4429.177,
    "text": "And he was able to make the kids' personalities and thinking degenerate and simplify more and more and become more and more infantile.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4429.457,
    "end": 4432.859,
    "text": "And you're right, Blue, that is one of the things that happens in a mob.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4433.679,
    "end": 4438.422,
    "text": "It's terrifying to be in an even unified,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4439.72,
    "end": 4444.321,
    "text": " angry mob where everybody's mad at the same thing and they're probably not going to attack each other.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4444.361,
    "end": 4445.022,
    "text": "It's terrifying.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4445.282,
    "end": 4449.183,
    "text": "And people that keep going into that situation, things happen.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4450.003,
    "end": 4466.328,
    "text": "Remember the presentation two weeks ago on the mutual suppression of the limbic system, the reticular activating system on the one hand and the prefrontal cortex on the other.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4467.782,
    "end": 4491.179,
    "text": " You get these things that look like beliefs, they sound like beliefs, they act like beliefs, but they're not beliefs because reason has never been invoked in the biological decision, whether to incorporate this magician's spell into my feeling and my actions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4492.04,
    "end": 4495.142,
    "text": "Do you have to have reason to have a belief, Dave?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4498.656,
    "end": 4504.098,
    "text": " Oh, yeah, in the sense that Philip Jarens uses it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4504.938,
    "end": 4506.498,
    "text": "Yeah, yeah, you have.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4506.538,
    "end": 4508.379,
    "text": "I mean, that's kind of the way he defines it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4508.399,
    "end": 4512.2,
    "text": "A belief is something where the prefrontal cortex has been involved.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4512.36,
    "end": 4513.74,
    "text": "It's been in the loop.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4514.1,
    "end": 4515.501,
    "text": "And there's a way to bypass that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4517.614,
    "end": 4523.136,
    "text": " I asked him whether he's worked on the social psychology of this or the ego psychologist.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4523.176,
    "end": 4535.682,
    "text": "He says, no, no, no, I have enough trouble worrying about people with damaged brains and how that shows the bypassing of rationality in the formation of delusions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4536.282,
    "end": 4538.223,
    "text": "But I think it works the other way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4539.223,
    "end": 4543.765,
    "text": "You may have seen my shotgunning of the apothemic brawl",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4546.815,
    "end": 4554.279,
    "text": " by Dr. Nathan Rosenberg, or rather Gabriel Nathan Rosenberg is an academic in, I think, Kentucky.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4554.819,
    "end": 4556.34,
    "text": "He says, look, this is what's happening.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4556.36,
    "end": 4567.645,
    "text": "You've got this person with a non-existent personality who's doing what the mob tells him to do through the mob's megaphone called Fox News.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4569.537,
    "end": 4570.858,
    "text": " Why do we like him so much?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4571.278,
    "end": 4574.439,
    "text": "Because he's less than any of us.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4574.879,
    "end": 4576.52,
    "text": "He will always obey us.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4577.08,
    "end": 4581.682,
    "text": "So we'll give him power, and then he'll give us what we feel like having.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4583.363,
    "end": 4585.124,
    "text": "Yeah, and there's no reason at all for that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4585.264,
    "end": 4586.225,
    "text": "It's very much a bypass.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4586.425,
    "end": 4593.508,
    "text": "Yeah, read Le Bon's study and Mackey's study on the madness of mobs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4594.861,
    "end": 4602.784,
    "text": " And the mass production of delusions and crazes and McCarthyism and all this unhealthy stuff.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4603.356,
    "end": 4604.256,
    "text": " Thanks, Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4604.276,
    "end": 4607.878,
    "text": "And that was the guest stream 10.1 with Philip Garens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4608.219,
    "end": 4613.541,
    "text": "And so just to highlight one point, and then Steven, we're really talking about control theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4614.282,
    "end": 4618.984,
    "text": "Maybe the first pass, the first term in the Taylor series is about control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4619.004,
    "end": 4621.525,
    "text": "I mean, come on, narrow the error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4621.946,
    "end": 4628.009,
    "text": "And that's kind of definition one, control as homeostasis, even if there's a shifting set point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4628.669,
    "end": 4640.065,
    "text": " But then again, it's the ecological and the relational insight and just the emergence of interactions that control takes on this broader anticipatory role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4641.187,
    "end": 4652.509,
    "text": " usage to control your body temperature is to sometimes do a lot of movements that from that first pass look like a non sequitur, like sprint so that you can get into the air conditioned room.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4653.329,
    "end": 4655.67,
    "text": "That's the expected free energy through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4656.47,
    "end": 4666.232,
    "text": "So now we have a common grounding for talking about control when it looks homeostatic as well as control when it looks allostatic or even innovative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4666.872,
    "end": 4687.166,
    "text": " so it's very important to pull out some of these threads and also recognize their cybernetic origins and other areas too so stephen and then anyone else yeah um these are all really good points i'm curious when we talk about free energy minimization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4688.959,
    "end": 4693.521,
    "text": " I think it's interesting to talk about that from a systems perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4694.582,
    "end": 4713.13,
    "text": "However, if we want to get back to the kind of organism, so the key thing with free energy minimization that occurs at different scales, physical scales, number of units scale, time scale, teleological scales, we think about these different scales, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.901,
    "end": 4723.387,
    "text": " That reduction, there has to be a way for that reduction to be meaningfully engaged through actions or interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.247,
    "end": 4732.913,
    "text": "The metric, ultimately, what's going to be filtering through, probably in some noisy, maybe backdoor way, is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.662,
    "end": 4739.385,
    "text": " if it's going to be sustained over time, there needs to be some meaningful engagement over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.545,
    "end": 4745.007,
    "text": "So, for instance, you know, the idea of the path that we walk starting to wear away the grass in our niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4745.647,
    "end": 4748.409,
    "text": "Well, it's because we walk on the path more than...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4749.489,
    "end": 4776.532,
    "text": " once that we have an ability to observe that you know if we only ever walk that path once it wouldn't have a way for any variation to be noticed but we notice the path being worn by agents over time so when we're talking about these different scales these variational dynamics in free energy it's not just a reduction because we don't get a number each time saying this was lower than last we just get",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.483,
    "end": 4803.653,
    "text": " some new state in the world and we have to infer if it's changed from some other state in the world and we it may go up it may go down so we may infer at times the free energies has has not been minimized and we might take but over allostatic processes for instance if we have a big room that's not tidy and we have a group of people and they want to organize it into a studio space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.804,
    "end": 4830.087,
    "text": " know they may work together initially putting in a lot of extra free energy time and and then eventually they know that they will be able to minimize their sort of systemic engagement as a group while it's not necessarily that they're each minimizing free energy as a system in the so this is almost where maybe challenging to get out of the biological sense and maybe come into some other disciplines where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.59,
    "end": 4832.591,
    "text": " it's not all a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.631,
    "end": 4837.175,
    "text": "It might be more of a systemic context, which is then more teleological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.455,
    "end": 4853.65,
    "text": "So I'd be interested that question, where does this crop through, this idea of being able to have a pragmatic metric that links the non-equilibrium steady state of the organism's phenotype or individual, so they're actually able to then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.571,
    "end": 4869.987,
    "text": " infer something from whatever's happening to the free energy out there or in in there or around them um and how that changes things if we if we frame it away from systems per se to something more systemic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4875.595,
    "end": 4879.577,
    "text": " Different uses of the highly polysemous word systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4879.697,
    "end": 4882.519,
    "text": "Systems of systems for some people are systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.539,
    "end": 4893.065,
    "text": "So that's why we increasingly will try to be exploring the active inference ontology so that we know which pieces of the puzzle we're talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4893.105,
    "end": 4897.888,
    "text": "And then that will unpack so interestingly into different disciplinary contexts, Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4897.988,
    "end": 4899.409,
    "text": "So nice points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.71,
    "end": 4904.112,
    "text": "So in the last half hour, I think there's a few different things",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4904.932,
    "end": 4916.494,
    "text": " Let's maybe get to one of the key pieces and specific contributions of the paper, which I would love to hear, Matt, your thoughts on, which is just first, what's going on with users and resources?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4917.114,
    "end": 4923.916,
    "text": "And second, what is the difference between unidirectional multiscale integration and reciprocal multiscale integration?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4925.596,
    "end": 4925.836,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4928.077,
    "end": 4928.317,
    "text": "Those two",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4930.447,
    "end": 4935.899,
    "text": " notions, I suppose, of unidirectional and multidirectional, or reciprocal.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4936.901,
    "end": 4939.868,
    "text": "And users and resources, they're very much so connected",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4941.547,
    "end": 4950.613,
    "text": " The idea of a user, we can think about this, and I think to use Stephen's example of an elephant path, I believe that's what these things are called sometimes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4950.653,
    "end": 4960.88,
    "text": "So you see these paths that are treaded and are typically used or referred to when we're thinking about kind of nice construction, like paths for nice construction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4962.984,
    "end": 4974.71,
    "text": " This is something that is in the environment that is being used, say, is a resource that's being used, and it's the effect of previous action on the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4975.851,
    "end": 4985.356,
    "text": "Returning to the notion of, so that would be a resource used by a particular cognitive agent or an agent that's engaging in adaptive active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4986.997,
    "end": 4989.579,
    "text": "So number one, it has to be recognizable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4991.616,
    "end": 4997.501,
    "text": " And in order for the system to engage with that particular resource, it has to be recognizable as such.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4998.402,
    "end": 5011.113,
    "text": "And that recognition can come through, for example, epistemic foraging, or actually just applying a model to a particular type of resource that has been applied previously.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5012.677,
    "end": 5015.238,
    "text": " This is also the case with something like stitchmergy, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5016.178,
    "end": 5034.601,
    "text": "Where you have something that's quite lovely, where you have, for example, ants leaving pheromones within the environment, and that pheromone acts as a particular type of mediator directing further behavior by agents of a similar type, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5035.541,
    "end": 5038.702,
    "text": "And that's, again, environmentally mediated communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5039.719,
    "end": 5049.81,
    "text": " or what they might call environmentally mediated conversation between various elements of a system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5050.891,
    "end": 5053.895,
    "text": "And the pheromones themselves, of course, are resources.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5054.949,
    "end": 5055.69,
    "text": " in the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5055.97,
    "end": 5066.858,
    "text": "That's going to be perhaps contrast with the idea that not all resources need themselves or are themselves, they have to be limited to being resources.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5066.878,
    "end": 5068.28,
    "text": "They can also be users also.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5068.36,
    "end": 5074.505,
    "text": "So to make a strange case, we can think about stytmergy actually.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5075.365,
    "end": 5082.351,
    "text": "What if it wasn't actually the pheromone that was being used, but the other ant, the presence of the other ant that was being used, the interaction with the ant itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5083.933,
    "end": 5094.121,
    "text": " So here, the two, using perhaps, and perhaps you have to tell me if I'm using this wrong, this terminology, but you have two discussants, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5094.742,
    "end": 5110.735,
    "text": "A sender and a receiver, but both act as senders and receivers, and actually they're communicating something, they're having a conversation, but there isn't any mediation in between the two that can be offloaded onto, in this particular situation, offloaded onto the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5111.516,
    "end": 5118.127,
    "text": " So the signal itself is going to be the direct kind of interaction between the two rather than a pheromone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5118.608,
    "end": 5124.118,
    "text": "Now that in that case, we can map that onto something that would be a kind of hypothetical case of reciprocal multi-integration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5125.256,
    "end": 5126.476,
    "text": " Right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5127.236,
    "end": 5137.899,
    "text": "And again, stigmergy just happens to be typically in each cases in the way that Pierre-Paul de Grasse suggested it when he was studying termites.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5139.159,
    "end": 5145.82,
    "text": "This is something that's actually involving a particular type of signal in the environment that's offloaded to the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5145.84,
    "end": 5152.842,
    "text": "So it's going to be naturally something that's going to be a unidirectional multi-scale integration between a system, between various systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5154.183,
    "end": 5168.974,
    "text": " Whereas, for example, when you have direct interaction between two cognizers or two systems, two adaptive systems, they can also, of course, use some type of resource that can be signaling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5168.994,
    "end": 5174.358,
    "text": "And this is something that, of course, happens with Vibrio fischeri and the bobtail squid.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5174.378,
    "end": 5178.0,
    "text": "But there is also going to be some kind of other direct interaction between two systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5178.14,
    "end": 5181.523,
    "text": "And that's kind of the reciprocal multi-scale integration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5184.088,
    "end": 5185.129,
    "text": " Awesome summary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5185.289,
    "end": 5189.954,
    "text": "I believe the technical term would be converse ants for that kind of a conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5191.555,
    "end": 5205.428,
    "text": "But it's a great point how when you have an adaptive active inference agent and then a niche that's being modified stigmatically that does mere active inference, like the spider's web, that's unidirectional, but still multi-scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5206.46,
    "end": 5221.872,
    "text": " Whereas when you have adaptive and adaptive in discussion, in conversation, even again, if only in a folk sense, you have adaptive on either end and it can allow for a new non-equilibrium steady state to arise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5222.372,
    "end": 5227.817,
    "text": "So not that there isn't a non-equilibrium steady state of spider plus web rather than them separate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5228.037,
    "end": 5231.099,
    "text": "In fact, there will be, but it still is a different type.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5231.159,
    "end": 5235.522,
    "text": "It's like a double directional or reciprocal Stigma G. So just such a cool way to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5236.284,
    "end": 5236.827,
    "text": " Connect that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5237.472,
    "end": 5237.754,
    "text": "Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5238.157,
    "end": 5238.741,
    "text": "And then Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5242.029,
    "end": 5251.156,
    "text": " So again, this line between mere active inference and adaptive active inference, it makes me want to attack it a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.337,
    "end": 5261.024,
    "text": "I think about the niche modification that, for example, humans do is extensive and transcends generations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5261.345,
    "end": 5267.249,
    "text": "And I mean, it contributes a lot to the collective intelligence of the human species and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5267.57,
    "end": 5269.331,
    "text": "And I also think about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5271.38,
    "end": 5273.962,
    "text": " in terms of like the Gaia hypothesis, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5274.002,
    "end": 5281.109,
    "text": "Like, so if the world is one giant organism, and this is something that we talked about with Mike Levin when he came to the live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5281.47,
    "end": 5287.296,
    "text": "So if the world is one giant organism, is the niche constantly changing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5287.936,
    "end": 5290.977,
    "text": " adapting to the species that are in it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5291.077,
    "end": 5294.478,
    "text": "Is this a continuous adaptive active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5294.618,
    "end": 5303.281,
    "text": "And just in terms of transcending timescales, you think about these symbiosis, I guess they're symbiosis, but relationships that develop between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.881,
    "end": 5307.563,
    "text": " orchids and their pollinators, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5307.603,
    "end": 5313.867,
    "text": "So, I mean, these are intense co-evolution things that happen over many, many, many timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5314.487,
    "end": 5317.729,
    "text": "And, I mean, we can think about the plant, is the plant a cognizer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5317.749,
    "end": 5318.93,
    "text": "I mean, that's debatable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5319.73,
    "end": 5321.051,
    "text": "I would say to a degree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5321.151,
    "end": 5323.833,
    "text": "Like, I'm not binary here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5323.933,
    "end": 5325.974,
    "text": "Like, yes, no is not really a good answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5327.155,
    "end": 5332.618,
    "text": "But is the niche maybe constantly adapting to systems to a degree?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5335.495,
    "end": 5338.116,
    "text": " I think that's a great point, really, really great point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5338.656,
    "end": 5340.977,
    "text": "I do think the niche is adapting to systems, absolutely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5341.457,
    "end": 5343.958,
    "text": "But I would say that the niche is adapting in a different way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5343.978,
    "end": 5350.701,
    "text": "And we can use, of course, we're going to have to be specifics because adaptation is a policy in that sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5353.075,
    "end": 5355.837,
    "text": " adaptation in terms of what the niche is doing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5355.957,
    "end": 5362.841,
    "text": "If the niche is not itself, okay, perhaps you want to, I can be accused of being biocentrist in one sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5363.401,
    "end": 5365.963,
    "text": "If the niche itself isn't a biological system,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5369.033,
    "end": 5377.318,
    "text": " then we can perhaps push against this idea that it's adapting in the same way that a biological system would adapt to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5377.338,
    "end": 5386.703,
    "text": "And maybe one way of phrasing this, and I'm not sure if this is going to hopefully make it a bit clearer, my point, is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5387.834,
    "end": 5391.436,
    "text": " Biological systems, one way of understanding them is that they have set points, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5391.676,
    "end": 5398.618,
    "text": "Moving set points throughout a particular trajectory, and this particular trajectory might be a trajectory across a phase space throughout their lives.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5398.658,
    "end": 5399.879,
    "text": "So you have a moving set.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5401.158,
    "end": 5409.589,
    "text": " And this moving set is something that's organized around a particular type of face-based organization.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5410.651,
    "end": 5418.461,
    "text": "And it's recapitulated within a particular type of phenotype, defines a phenotype, but characterizes a phenotype or a generative model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5419.669,
    "end": 5429.276,
    "text": " with a particular, say, a field of dirt, we might be able to actually walk across a field of dirt or a set of cement stairs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5430.897,
    "end": 5437.962,
    "text": "It might actually, over time, for a few hundred years, you have these interesting stairs at the castle of Edinburgh that actually dip.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5438.522,
    "end": 5444.887,
    "text": "And these dips in the cement are evidence that people have walked there before, but we tend to walk where other people have walked.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5445.447,
    "end": 5456.276,
    "text": " And this, perhaps one might call that an adaptation to a certain degree, but I think that might be pushing the limit on the word adaptation, given that that set of stairs does not have a set point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5456.476,
    "end": 5464.803,
    "text": "It doesn't have the same type of, it's not the same type, I suppose, of self-organizing system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5465.084,
    "end": 5468.066,
    "text": "It's not a self-organizing system in that sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5469.107,
    "end": 5472.21,
    "text": "And as such, I would think that, okay, well,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5473.881,
    "end": 5476.715,
    "text": " Maybe the niche does adapt to a certain degree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5478.048,
    "end": 5483.869,
    "text": " But there's an adaptation with biological systems that are self-organizing and have organizational closure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5483.909,
    "end": 5490.871,
    "text": "And I think this is quite important, that it's different than, say, abiotic systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5491.731,
    "end": 5494.872,
    "text": "I would love to talk about this in a bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5495.172,
    "end": 5505.494,
    "text": "It's a question that Blue brought up in the last livestream, was the manner in which we can actually understand",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5507.254,
    "end": 5514.479,
    "text": " systems or identify particular types of individuals that are involving the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5514.899,
    "end": 5519.382,
    "text": "So it's not actually saying that the environment is separate from the system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5520.002,
    "end": 5524.525,
    "text": "Otherwise, we wouldn't actually be able to actually talk about the emergence of actually living systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5524.785,
    "end": 5526.506,
    "text": "We can get into that later, though.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5527.312,
    "end": 5528.773,
    "text": " So I have to just push back on you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5530.633,
    "end": 5533.414,
    "text": "So think about the earth and the atmosphere of the earth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5533.675,
    "end": 5536.256,
    "text": "Okay, now this is not necessarily a biological system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5536.276,
    "end": 5540.317,
    "text": "This is nitrogen, carbon dioxide, water, clouds, et cetera, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5540.377,
    "end": 5552.262,
    "text": "But here we are humans releasing tons and tons of carbon into the atmosphere, totally changing the set point as you described it, like the homeostatic set point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5552.922,
    "end": 5559.985,
    "text": " or whatever, the non-equilibrium steady state density that the atmosphere of the Earth currently resides in and has resided in for X million years, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5560.425,
    "end": 5577.611,
    "text": "So, but we are changing that and we are seeing the Earth adapt to us and the changes that we're making in, just in terms of hurricanes, storms, I mean, the weather patterns are completely, and they're destroying large amounts of humans, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5577.671,
    "end": 5581.153,
    "text": "And drought, famine, all of the things that are going to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5581.753,
    "end": 5584.454,
    "text": " cascade through climate change as we see it progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5584.874,
    "end": 5589.236,
    "text": "So is this not adaptive active inference on the part of the Earth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5589.636,
    "end": 5590.736,
    "text": "Or what do you think of that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5593.297,
    "end": 5593.837,
    "text": "Really interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5593.857,
    "end": 5605.461,
    "text": "I think in order to make that particular type of assumption, one would actually have to ascribe to something like a Gaia hypothesis, like Lovelock's Gaia hypothesis, or the same type of thing that Lin Margulis was into later in her life.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5607.369,
    "end": 5618.276,
    "text": " And I think that's an assumption that has to be made given the fact that, okay, well, just because a response happens chemically doesn't necessarily mean that it's not actually an adaptive response.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5619.957,
    "end": 5623.379,
    "text": "Gene expression is biochemical adaptation, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5623.839,
    "end": 5635.947,
    "text": "So it's not about just being chemical, using chemical or something like this, composition, changing molecular structure as some type of criterion for adaptation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5636.587,
    "end": 5640.348,
    "text": " But I think there's an assumption that has to be made about what the system is there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5640.408,
    "end": 5648.351,
    "text": "And if you're thinking about the Earth as a system, maybe the Earth is adapting to its constituent parts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5651.272,
    "end": 5659.015,
    "text": "But that would involve intrinsically the Earth being a particular type of living system, given the fact that it has living parts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5662.031,
    "end": 5682.947,
    "text": " One other quick thought on that is as a model comparison framework, so go back to SPM, DCM, all of our categorical model comparison techniques in the toolkit, we can actually evaluate, should we have cells as the units and then organisms and then the ecosystem and then the world, or should we use a different partitioning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5683.387,
    "end": 5687.45,
    "text": "Which one of these models is explaining, predicting, designing, controlling better?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5688.331,
    "end": 5689.972,
    "text": " Or which one is more parsimonious?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5690.132,
    "end": 5692.073,
    "text": "I prefer simplicity over utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5692.593,
    "end": 5696.755,
    "text": "Or I have a function that balances simplicity and utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5697.035,
    "end": 5698.316,
    "text": "There's all kinds of frameworks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5698.716,
    "end": 5707.12,
    "text": "That's kind of part of pluralism is starting with and being with that multiplicity of answers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5707.881,
    "end": 5713.143,
    "text": "And then knowing who we are and what we use to decide on which models to use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5714.104,
    "end": 5714.604,
    "text": "So Stephen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5717.932,
    "end": 5723.016,
    "text": " Yeah, I'm very much like to keep that ecological niche in the picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5724.177,
    "end": 5740.692,
    "text": "So, you know, if it's organism in niche and groups of organism in niche, and then watershed and micro environment or micro climate as a niche, I think that kind of becomes like a defining organism or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5741.992,
    "end": 5770.441,
    "text": " unit in a way is like watch the watershed what's the kind of climate as experienced by that ecosystem and then of course you've got many ecosystems around the world from the arctic to the antarctic you know and it will be in between now they might all be collectively affecting the broader carbon dioxide levels of the broader ecosystem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5771.445,
    "end": 5779.25,
    "text": " But how that then jumps to make the whole world an organism becomes, for me, slightly challenging, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5779.29,
    "end": 5782.092,
    "text": "Because it was always a niche up to then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5782.172,
    "end": 5787.195,
    "text": "And then suddenly it jumps to be an organism because we look at it from space and we see a nice round ball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5788.015,
    "end": 5789.136,
    "text": "And it sort of looks alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5789.156,
    "end": 5793.339,
    "text": "So I wonder whether there's a... So one of the things I'm really interested in is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5794.358,
    "end": 5799.221,
    "text": " is like you're saying how things get into ascribed to the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5799.441,
    "end": 5811.448,
    "text": "And we, we talked about the path walking on the path and in a way like that dispersive thing, animals can sort of also intuit some of that as well from the affordances and the directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5812.769,
    "end": 5821.034,
    "text": "And again, bringing stuff in from systemic design type approaches is one thing that's interesting is if you then say humans like humans, what we do is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5822.219,
    "end": 5836.553,
    "text": " as a child and maybe some apes do this, but not many is we point at something as a child and then we went to the parent and that's becomes it's in the niche, but it becomes what they would call a boundary object in systemic design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5836.573,
    "end": 5839.936,
    "text": "So you're trying to bring together a team around something which is beyond one discipline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.956,
    "end": 5847.023,
    "text": "So what you need to do is you say, okay, we can't just use the variational free energy landscape of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5849.4,
    "end": 5856.849,
    "text": " domain ecosystem, which we have all attuned to in our sort of own way, because now people are running by different rules, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5856.889,
    "end": 5859.732,
    "text": "We're running by the physicists and the biologists, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5859.752,
    "end": 5863.576,
    "text": "They're just going to be, so you get a boundary object, which you point to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5863.677,
    "end": 5867.801,
    "text": "So it's something in the niche, and then you sort of work to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5868.895,
    "end": 5880.497,
    "text": " Um, so anyway, I just think there's something quite interesting then about like Daniel was saying there about, you know, what sort of language in do we use, but this scale problem comes back every time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5880.597,
    "end": 5892.34,
    "text": "But I, I wondered, um, like the difference between a boundary object or something which can be defined, which I'm not sure if other animals can really do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5893.396,
    "end": 5896.018,
    "text": " in the same way, maybe a dog when it urinates up a tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5896.078,
    "end": 5897.179,
    "text": "I was just thinking about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5897.519,
    "end": 5900.401,
    "text": "Does that become a boundary object in their world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5900.542,
    "end": 5904.645,
    "text": "I don't know, but yeah, it's something that comes to mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5905.726,
    "end": 5906.266,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5906.446,
    "end": 5908.508,
    "text": "And with transdisciplinarity,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5909.83,
    "end": 5917.217,
    "text": " In cancer biology, they've recognized the niche, the tumor and the stem cell niche and the micro environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5917.337,
    "end": 5920.82,
    "text": "And there's so much more to say on these very interesting topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5921.601,
    "end": 5926.985,
    "text": "Just in the last few minutes, we can go to a few of these final points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5927.706,
    "end": 5931.569,
    "text": "In the dot one, it's always awesome to have the author and unpack some of the ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5932.25,
    "end": 5945.359,
    "text": " And so this is kind of our little fractal dot two, setting us up for our discussion next week and thinking about implications and how does it influence how we act moving forward and what kinds of questions we're looking at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5946.3,
    "end": 5954.546,
    "text": "You wrote about some of the implications for thinking about individuality from a cognitive perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5955.692,
    "end": 5956.673,
    "text": " say it broadly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5957.554,
    "end": 5968.923,
    "text": "And it'd be awesome to hear your thoughts on the folk psychological notion of the cognizer and where does the FEP come into play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5971.185,
    "end": 5971.445,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5973.287,
    "end": 5974.047,
    "text": "Thanks for the question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5975.389,
    "end": 5981.794,
    "text": "So the folk psychological notion of cognizer, again, my argument is that it piggybacks on",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5982.549,
    "end": 5987.571,
    "text": " upon this idea of the folk biological notion of the individual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5988.532,
    "end": 6010.702,
    "text": "And once we kind of free ourselves from thinking about individuals specifically in terms of replication dynamics, that opens up a space for us to think about cognizers that are discontinuous with replication or replicators.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6011.704,
    "end": 6029.942,
    "text": " And I think that's going to be very important, again, when taking this particular route of thinking about the evolution of cognition, when thinking about, for example, OK, if cognition goes all the way down to a certain degree,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6033.528,
    "end": 6039.309,
    "text": " then what part does it actually play in the construction of larger systems?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6040.549,
    "end": 6048.471,
    "text": "And why would the construction of larger systems actually be some type of adaptation for each of the systems involved?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6049.591,
    "end": 6059.773,
    "text": "So when we're thinking about, for example, I think one particular thing that is quite important, will be quite important to think about this for is, okay, the manner in which we",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6061.477,
    "end": 6064.181,
    "text": " think about artificial intelligence, for example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6066.424,
    "end": 6073.413,
    "text": "One way, of course, or two ways, of course, of doing this is we go for various specific tasks",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6074.548,
    "end": 6086.213,
    "text": " whether it's going to be kind of computer vision or GPT-3 type tasks where we can actually analyze a large corpus of text and kind of recapitulate that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6087.614,
    "end": 6088.274,
    "text": "That's one thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6088.354,
    "end": 6093.977,
    "text": "The other thing, of course, is the task general or kind of domain general notion of AI.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6095.217,
    "end": 6112.372,
    "text": " And I think in order to perhaps tread into the department or tread into that field of more kind of task generality, we're going to have to think about even simpler questions as to how can a system actually start maintaining itself according to its own tasks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6112.432,
    "end": 6120.579,
    "text": "And again, we come back to this notion of how can we actually set a system up to have its own intrinsic motivation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6123.47,
    "end": 6127.031,
    "text": " And one way to do this is perhaps to piggyback on living systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6127.091,
    "end": 6140.435,
    "text": "So you introduce a living system to an artificial system and have them communicate in such a way that's analogous to some type of symbiotic system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6140.895,
    "end": 6146.037,
    "text": "And this is something, again, perhaps that Michael Levin has been thinking about doing, actually, in his lab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6148.457,
    "end": 6158.424,
    "text": " And I think this is quite an interesting kind of method to think about the importance of symbiosis in developing artificially intelligent systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6159.765,
    "end": 6165.789,
    "text": "A system that can identify, go to a room, an embodied intelligent agent that can like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6166.73,
    "end": 6169.551,
    "text": " traverse a room and identify all the dogs, that's great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6170.072,
    "end": 6172.893,
    "text": "With an accuracy, a high accuracy level, that's fantastic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6172.973,
    "end": 6185.179,
    "text": "But if they can't respond to the dog knowing that a dog is going to actually dismantle it, I'm not sure if I would want to call how intelligent that system would even be in terms of having basic intelligence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6185.839,
    "end": 6196.074,
    "text": " And I think that FUP, an active inference, allows a particular type of perspective on the notion of basic intelligence or intelligence that's surrounded or",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6198.086,
    "end": 6219.757,
    "text": " Yes, that's grounded in the notion of kind of a nest density or grounded in the notion of a type of a moving set point that's equivalent to a homeostatic moving homeostatic states and allostasis supporting states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6222.058,
    "end": 6223.219,
    "text": "Thank you, Matt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6223.619,
    "end": 6224.299,
    "text": "Shannon?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6226.06,
    "end": 6226.54,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6229.005,
    "end": 6245.443,
    "text": " How important, sort of drawing on what Flew said and Dave and Stephen, I think also earlier, how important some sort of affective or emotional state or awareness is in knowing and cognizing and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6248.015,
    "end": 6271.967,
    "text": " like how important that is for a symbiotic relationship to be called a cognizer and whether, you know, like the neural network that is working with the human, maybe to compose a piece of music, how important it is for that neural network to have cognizing capabilities of its own, or maybe some sort of effective awareness or some sort of effective processing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6273.047,
    "end": 6279.044,
    "text": " that it is able to develop in some way on its own or maybe only in symbiosis with a person",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6280.407,
    "end": 6288.353,
    "text": " Um, and I don't know if, if this bobtail squid and the vibrio, like, do they have sort of effective awareness together?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6288.393,
    "end": 6295.558,
    "text": "Or does the squid seem to, you know, experience something like pain, I suppose would be one of the most basic effective states we might have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6296.258,
    "end": 6304.384,
    "text": "So how important would basically is effective processing in delineating individuals or cognizers?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6306.839,
    "end": 6308.982,
    "text": " Great question, Shannon.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6309.783,
    "end": 6310.604,
    "text": "I'll take a go at it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6310.624,
    "end": 6318.434,
    "text": "I do think that at a certain level of complexity, affective states play a huge role.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6319.456,
    "end": 6321.258,
    "text": "But because I'm...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6322.83,
    "end": 6333.715,
    "text": " I suppose I'm making an assumption that cognition goes all the way down and not every system is going to be an affect, have that capacity to have some type of affectual awareness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6334.495,
    "end": 6342.378,
    "text": "One might actually think about some other type of sub component that plays a similar role as affect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6342.478,
    "end": 6347.88,
    "text": "And perhaps that just might be something like, you know, something that grounds,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6350.342,
    "end": 6357.626,
    "text": " that grounds a particular type of motivation to stay in homeostatic states or to remain in particular homeostatic states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6358.627,
    "end": 6365.131,
    "text": "And this can be, oh, Pamela Lyon has written about this just recently, actually.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6367.172,
    "end": 6375.517,
    "text": "And it's not affect necessarily, but it's valence, negative and positive valence that might not, and it has less to do with awareness",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6376.417,
    "end": 6394.562,
    "text": " or sentience in that sense, but more to do with actually a particular type of organism or particular type of system responding in ways that, again, are responding in ways that keep it centered.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6395.403,
    "end": 6403.225,
    "text": "And whether or not that kind of valence, a bacteria might climb a gradient of glucose, for example,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6404.699,
    "end": 6411.147,
    "text": " But bacterium might not have any type of experience of that glucose gradient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6412.488,
    "end": 6418.135,
    "text": "But somehow, we might say that bacterium is actually positively valenced.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6418.576,
    "end": 6420.478,
    "text": "It's something that it's attracted to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6420.498,
    "end": 6421.58,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6423.21,
    "end": 6434.338,
    "text": " And maybe in simpler systems, you have something more like the notion of valence rather than affect, but a certain period of complexity after a certain perhaps degree of complexity arises.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6435.999,
    "end": 6436.98,
    "text": "Affect is very important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6437.02,
    "end": 6447.367,
    "text": "And I think particularly when it comes into multicellular systems that perhaps that have to actually compute",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6449.549,
    "end": 6453.873,
    "text": " much more information, has to compete much more information and has to interact in their environments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6453.893,
    "end": 6459.598,
    "text": "Their environmental niches are much more, using a term by Kim Struell, much more opaque.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6461.22,
    "end": 6472.649,
    "text": " So affective information, the manner in which we can use affect and how that affects cognition, I think it becomes quite important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6472.669,
    "end": 6473.83,
    "text": "But I'm not exactly sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6473.85,
    "end": 6477.032,
    "text": "Number one, there's probably not a line.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6478.313,
    "end": 6479.214,
    "text": "It probably develops.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6480.775,
    "end": 6484.138,
    "text": "But just what that function is, is a different story.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6484.158,
    "end": 6484.418,
    "text": "I don't know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6484.438,
    "end": 6485.539,
    "text": "Do you have any ideas about that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6487.197,
    "end": 6490.901,
    "text": " I don't have an idea about where that would start, but I feel like it would fall off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6490.981,
    "end": 6498.047,
    "text": "So we might have the small-scale, like our bobtail squid and vibrio, who might have something like valence that they're responding to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6498.108,
    "end": 6505.635,
    "text": "And then as we get slightly larger organisms, you know, dogs, people, then affect will play a lot more of a role.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6505.655,
    "end": 6510.659,
    "text": "But then as we have bigger systems, like multiple humans, what is the affective, like...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6511.58,
    "end": 6537.391,
    "text": " state of a crowd of people like we can ascribe like they look angry or they sound angry but they as a crowd are they feeling something as a crowd kind of like group intentionality is there a group effective state it might kind of start falling off again so you might have this sort of u-shaped curve of where valence matters and then somewhere here in the sweet spot effective states or emotions really matter",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6539.615,
    "end": 6540.156,
    "text": " That's super.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6541.158,
    "end": 6543.544,
    "text": "Definitely something to, absolutely something I want to think about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6544.957,
    "end": 6569.545,
    "text": " wool and also reminiscent of the discussion of affect as well as higher order parameters in deep parametric active inference where we even talked about which states were opaque or not whereas opaque usually meaning like you can't see it you can't see in but actually the opaque mental states are the ones that we do experience so that was in the sanved smith paper and um whether",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6570.385,
    "end": 6571.986,
    "text": " Other systems feel things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6572.046,
    "end": 6573.207,
    "text": "What is it like to be a squid?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6573.247,
    "end": 6574.487,
    "text": "What is it like to be a symbiosis?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6574.888,
    "end": 6577.089,
    "text": "That's the phenomenology and the metaphysics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6577.649,
    "end": 6583.113,
    "text": "But what is it like for us to model that system as if there's a higher level control parameter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6583.893,
    "end": 6585.174,
    "text": "We can know what that's like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6585.414,
    "end": 6587.255,
    "text": "It's a lot like this conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6588.095,
    "end": 6588.396,
    "text": "So just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6590.43,
    "end": 6594.814,
    "text": " Everybody can provide a last comment on this awesome discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6595.134,
    "end": 6612.688,
    "text": "I think the takeaway for me is that in a post-Darwin biology, it's easy to use the simplified trifecta of evolution by natural selection, phenotypic variability, heritability of the phenotype, fitness correlation, and variation in fitness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6613.248,
    "end": 6637.417,
    "text": " and then project that onto all the kinds of individuality cognitive the rights and responsibilities the economic unit the sentient unit all of those as just simply under the coattails of the darwinian replicator and i think pluralism and a bevy of other perspectives suggest that that's just not the case blue and then anyone else with a last comment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6638.803,
    "end": 6641.104,
    "text": " I just wanted to say thanks for coming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6641.164,
    "end": 6648.407,
    "text": "I really enjoyed this discussion and I just started reading your paper, your 2021 paper with Pizzullo, the modeling ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6649.187,
    "end": 6651.869,
    "text": "And I hope you'd consider coming back to talk about it with us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6653.069,
    "end": 6653.649,
    "text": "Thanks so much.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6654.29,
    "end": 6657.311,
    "text": "It's been a really incredible conversation discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6657.391,
    "end": 6659.872,
    "text": "So thank you all for inviting me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6661.813,
    "end": 6663.914,
    "text": "Shannon or Steven or Dave, any last comments?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6665.532,
    "end": 6665.812,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6666.112,
    "end": 6669.254,
    "text": "Well, all participants, thank you so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6669.995,
    "end": 6674.917,
    "text": "And Matt, especially for writing the paper and coming to talk about it and seeing the .0 before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6675.058,
    "end": 6676.839,
    "text": "So peace out, everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6676.999,
    "end": 6678.059,
    "text": "See you next week.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6680.06,
    "end": 6680.381,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6680.541,
    "end": 6680.741,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]