[
  {
    "start": 8.442,
    "end": 12.926,
    "text": " Hello everybody, welcome to Act-Inf Lab live stream number 30.2.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 13.326,
    "end": 31.12,
    "text": "Today it is October 12th, 2021, and we're having our second discussion, group discussion, on the paper of Matt Sims, How to Count Biological Minds, Symbiosis, the Free Energy Principle, and Reciprocal Multiscale Integration.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 32.827,
    "end": 34.307,
    "text": " Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 35.288,
    "end": 40.969,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 41.449,
    "end": 43.97,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 44.85,
    "end": 49.891,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so we can improve on our work.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 50.832,
    "end": 56.173,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for livestreams.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 58.086,
    "end": 63.528,
    "text": " At this short link, you can see some of the past, present, and future live streams in the lab.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 64.508,
    "end": 69.349,
    "text": "And in the first tab, you'll see the Tuesday numbered live stream.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 69.369,
    "end": 74.651,
    "text": "So every Tuesday, we have a participatory group discussion, two weeks per paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 74.871,
    "end": 78.552,
    "text": "And then there's the dot zero video, which is just sort of a contextualizing video.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 79.372,
    "end": 89.238,
    "text": " And then these other tabs like guest stream, model stream and math stream are opportunities for just one-off events on any topic that people think is relevant for the lab.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 89.498,
    "end": 93.961,
    "text": "So get in touch if you want to join one or co-organize one of these streams.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 96.311,
    "end": 125.198,
    "text": " Today in 30.2 we're going to be continuing to learn and discuss this awesome paper by Matthew Sims how to count biological minds and we're just having fun and discussing last week we had Matt join which was a great discussion and we look forward to everyone's input and if you're watching in the live chat or if you're leaving a comment later look forward to continuing the discussion",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 126.331,
    "end": 138.399,
    "text": " Today we're pretty much just going to introduce ourselves and say hello, and then we will go wherever we feel relevant and explore different questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 138.499,
    "end": 147.325,
    "text": "People can ask about a figure or a section of the text, and then also Blue and others have prepared some discussion questions to get into.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 148.786,
    "end": 151.368,
    "text": "So we can start with the warm-up and introductions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 152.58,
    "end": 156.124,
    "text": " So I'm Daniel and I'm a researcher in California.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 157.064,
    "end": 169.857,
    "text": "And I think the thing I'm excited about today, just like with many DOT2s, is taking a lot of these cool ideas that came up in the paper and in the DOT0 and the DOT1, and then",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 171.528,
    "end": 192.411,
    "text": " synthesizing and consolidating and then asking okay well now what next how do we go from this conversation theory users and resources reciprocal multi-scale integration and then apply it to different systems so i think that will be a fun topic and i'll pass to stephen",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 194.585,
    "end": 194.965,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.005,
    "end": 195.886,
    "text": "Yes, Stephen here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.966,
    "end": 198.188,
    "text": "I'm in Toronto on a nice sunny day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.468,
    "end": 203.031,
    "text": "And I'm really interested as well, actually, in building on these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.092,
    "end": 207.515,
    "text": "I'm really excited that the folk psychology and folk biology was brought up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.595,
    "end": 220.485,
    "text": "And I think that gives permission, I think, to build that further and maybe extends into how our phenomenology connects to our folk psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.505,
    "end": 222.767,
    "text": "Because our folk psychology allows us all to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.632,
    "end": 248.31,
    "text": " inherent psychologists of ourselves maybe so that's interesting and we just enjoy it analyzing our own reality so i'm going to pass it over to dave um yep i'm in the mountains of the philippines and uh it's the end of the rainy season and so we'll have no weather until next year",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.084,
    "end": 278.35,
    "text": " I am pumped up about the multiple disciplines that are coming together in the discussion of the paper that we're doing now and also about Bobby Azarian who is not afraid to jump down into the trenches and face the lunatics with their machetes and even less pleasant arms and getting a note together to him to suggest some topics that we might want to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 279.173,
    "end": 291.118,
    "text": " talk about well two two things one off a question about bobby but first was when you said there's no weather it's kind of like what steven said about folk psychology",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 292.313,
    "end": 296.434,
    "text": " no experience, you know, just like, well, now I'm awake and now experience is going to stop.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 297.075,
    "end": 299.656,
    "text": "It's kind of like weather stopping, like weather's always happening.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 300.516,
    "end": 302.397,
    "text": "It's always changing in different ways.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 303.397,
    "end": 307.118,
    "text": "And our experience is also always happening and always in different ways.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 307.518,
    "end": 320.523,
    "text": "But just like weather sometimes only gets studied or discussed in the context of catastrophe or pathology or of extremely unusual events, there's this like baseline weather that's just the climate.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 321.323,
    "end": 338.901,
    "text": " and so that's very interesting about our day-to-day felt realities and then how everybody is in the driver's seat with respect to their experience so sort of the mundaneness of weather the mundaneness of experience but also it's something that can be really unpacked steven",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 340.993,
    "end": 341.873,
    "text": " Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.893,
    "end": 345.934,
    "text": "The mundaneness is interesting, especially when you think of the priors that set things up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.214,
    "end": 357.816,
    "text": "Because in some ways, it's like the psychologist in psychology gets to decide on the modeling that's going to be used to look at people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.297,
    "end": 364.678,
    "text": "Whereas in folk psychology, this is the implicit modeling that we are framing ourselves around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.729,
    "end": 371.092,
    "text": " And, of course, the same with the folk biology, which this paper brings up, and maybe the folk physics and the whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.633,
    "end": 378.817,
    "text": "So these kind of implicit priors, you can't get away from them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.917,
    "end": 391.065,
    "text": "And maybe, in a way, it brings us into this interesting, are those priors, how much of them are psychological, or are they more like practice-based phenomenological questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.125,
    "end": 392.766,
    "text": "So it's an interesting balance there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.985,
    "end": 394.225,
    "text": " Cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 394.865,
    "end": 396.466,
    "text": "And then the second question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 396.646,
    "end": 402.027,
    "text": "So Bobby Azarian is going to be doing a guest stream in November.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 402.287,
    "end": 406.929,
    "text": "We have a few guest streams coming up, so there's multiple.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 406.969,
    "end": 413.471,
    "text": "But Dave, what made you excited about his presentation or work with the universal Bayesianism?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 415.131,
    "end": 418.052,
    "text": "Well, it's not so much that particular approach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 418.192,
    "end": 420.193,
    "text": "It's that he's been doing a lot of work on",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 422.256,
    "end": 428.481,
    "text": " cult formation, cult dynamics, the growth of violent cults, especially in the U.S.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 428.621,
    "end": 429.401,
    "text": "right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 429.962,
    "end": 438.848,
    "text": "And that directly ties into Philip Guerin's work on the neuroscience of delusion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 438.868,
    "end": 442.992,
    "text": "Okay, very interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 443.012,
    "end": 446.674,
    "text": "And so I'm just showing on the screen, those are the dates.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 446.714,
    "end": 450.637,
    "text": "November 19th is with Bobby, but we'll have...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 451.82,
    "end": 456.301,
    "text": " Greg Henriquez on the 11th, or on October 22nd for number 11.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 456.862,
    "end": 459.663,
    "text": "Then Martin Boots for 12 on October 25th.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 460.323,
    "end": 461.843,
    "text": "Adam Saffron on November 8th.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 462.463,
    "end": 463.644,
    "text": "And then November 19th.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 463.684,
    "end": 465.544,
    "text": "So cool guest streams coming up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 465.605,
    "end": 467.565,
    "text": "And of course, everyone's always welcome to join.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 468.165,
    "end": 468.666,
    "text": "So let's return.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 468.686,
    "end": 470.366,
    "text": "Yeah, I didn't notice you'd gotten Boots.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 470.506,
    "end": 471.026,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 471.286,
    "end": 472.347,
    "text": "I am very pleased.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 473.927,
    "end": 474.167,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 474.728,
    "end": 476.328,
    "text": "Sometimes people just sneak in there, you know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 477.668,
    "end": 477.929,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 478.189,
    "end": 478.489,
    "text": "So let's...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 479.429,
    "end": 486.876,
    "text": " return to 30.2 and uh i'm sure blue will join so let's just save some",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 488.171,
    "end": 491.252,
    "text": " tasty pieces for her that she added in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 491.932,
    "end": 499.273,
    "text": "And then otherwise I think we can, maybe let's start with these questions on seven.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 500.153,
    "end": 508.555,
    "text": "So blue in absentee, asynchronous blue, our favorite shade contributing to the discussion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 509.375,
    "end": 516.276,
    "text": "So let's see what we think and if we can connect it to some of the ideas or sections or figures of the paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 518.897,
    "end": 543.753,
    "text": " at any given time can agents act autonomously as long as there is a defined prior and then I think maybe that's connected to the second question is there a difference between a cognizer and an autonomous agent so how are the terms of cognition agent slash agency and autonomy how do these terms connect",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 550.311,
    "end": 577.966,
    "text": " if we imagine a three-dimensional space and we think okay you could have you know ten zero zero you have ten cognition zero agency zero autonomy what is the space of the possible of cognition agency and autonomy and then how are these different terms linked are one out of necessity uh leading the other or lagging the other so stephen and then dave",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 580.481,
    "end": 603.906,
    "text": " mean this question about a defined prior I mean the other option is is it if they don't need a defined prior and they can build up their inference process without having that prior so I'm not sure which way that might be the most important is it is the autonomous agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.086,
    "end": 610.549,
    "text": " obviously we're assuming the agent can survive, you know, this is not a bolt of lightning or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.569,
    "end": 615.172,
    "text": "So it's something that can have some sort of non-equilibrium steady state over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.772,
    "end": 626.559,
    "text": "Is it more about the autonomous agent being able to act and process its active influence independently of others?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.239,
    "end": 628.54,
    "text": "And that's maybe more key.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.66,
    "end": 631.322,
    "text": "And maybe that's the sort of thing that happens with cancer as well, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.342,
    "end": 633.223,
    "text": "So I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 634.485,
    "end": 635.545,
    "text": " Welcome, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.585,
    "end": 640.107,
    "text": "We're just on slide seven, working through some of your interesting questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 640.367,
    "end": 640.667,
    "text": "Dave?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 642.908,
    "end": 663.276,
    "text": "Yeah, on that, the first question, in the dialogue between Friston and Mark Solms, they use prior basically to mean an affect or the other brainstem resident biological imperatives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 664.486,
    "end": 692.453,
    "text": " And I think Soms would tell you that except in anesthesia, you know, deep, deep anesthesia, and perhaps coma, there's always operative priors because you really can't dissociate the homeostatic goal seeking from the higher processes since the higher processes are",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 693.354,
    "end": 700.796,
    "text": " completely dependent on and shaped by the homeostatic activities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 701.336,
    "end": 719.222,
    "text": "And I wouldn't even accept coma without qualification because of the, I don't know if this research has been borne out, but there are therapists who have simply proceeded under the assumption that deeply comatose individuals actually are",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 721.141,
    "end": 723.342,
    "text": " taking something away from their experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 723.642,
    "end": 738.587,
    "text": "And they're finding that in recovery from coma that, yeah, if you talk to people on a daily basis or you talk about interesting things or unresolved problems, this shapes the way they're going to talk about their experience afterwards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 739.608,
    "end": 746.65,
    "text": "One thing that happens is that people's thinking becomes extremely slow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 748.03,
    "end": 749.391,
    "text": "Minutes rather than seconds.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 750.922,
    "end": 761.53,
    "text": " And that if you actually speed up videos of the response of comatose individuals, you'll see response.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 761.57,
    "end": 769.937,
    "text": "And just like if you slow down high-resolution videos of infants, you'll see that, yes, they're highly attuned to what's going on around them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 770.457,
    "end": 780.705,
    "text": "They do have their own priors through which they're responding to events and actually shaping them in a healthy diet.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 783.894,
    "end": 802.555,
    "text": " interesting so i think starting with uh with stephen's point and then anyone can of course can just raise their hand or write a question live chat so the question about starting with a prior and whether we start with a very defined prior like a domain specific prior or whether that's learnt",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 803.416,
    "end": 829.339,
    "text": " that is reminiscent of the difference between first order cybernetics and then higher order cybernetics like the first order cybernetics of chemistry is your priors on chemistry and the second order would be your approach to learning or your dynamics of flexibility around study habits or around updating your generative model of chemistry as well as the second order generative model of learning",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 830.06,
    "end": 849.322,
    "text": " so as we start to sort of meet in the middle with building active inference up to describe and model these increasingly recursive and symbolic cognizers we'll start to see the movement from models that merely describe the mountain car",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 850.33,
    "end": 874.098,
    "text": " into models of mental action into higher order cybernetic models of mental action so that will be very cool and then um i think you mentioned the lightning bolt and so i was coming back to this this um trilemma or these three terms if there's more terms could be added like um does lightning bolt have agency does it have autonomy",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 875.017,
    "end": 879.382,
    "text": " Well, it sure seems to just act the way that it's apt to.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 879.843,
    "end": 881.645,
    "text": "So it seems like an autonomous system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 881.685,
    "end": 884.669,
    "text": "It's not waiting for a Bluetooth connection with something else.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 884.749,
    "end": 885.71,
    "text": "So it's high autonomy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 886.738,
    "end": 888.839,
    "text": " And then does it have agency, though?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 889.059,
    "end": 891.26,
    "text": "And so how is there a difference?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 892.121,
    "end": 895.943,
    "text": "And then cognition, especially because the example of the lightning bolt, it's electricity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 896.623,
    "end": 910.59,
    "text": "So if what we've been talking about with Professor Levin and others is that bioelectricity is sort of the fundamental, that's where biotic and abiotic cognition come together or where they blur.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 911.49,
    "end": 913.931,
    "text": "So then is a lightning bolt cognitive?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 914.932,
    "end": 915.092,
    "text": "And...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 916.806,
    "end": 924.014,
    "text": " So that was, and then just a last comment was the speed of perception and cognition and action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 924.695,
    "end": 930.621,
    "text": "Well, active inference is about integrated modeling of perception, cognition, and action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 931.382,
    "end": 935.386,
    "text": "So then we're in a quasi computational framework.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 936.147,
    "end": 945.098,
    "text": " There are computationalists among us, people who think that cognition is computation, as well as people who take more nuanced steps or reject that notion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 945.679,
    "end": 947.321,
    "text": "But this is kind of like our clock speed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 947.701,
    "end": 949.764,
    "text": "This is like the speed of that loop.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 950.284,
    "end": 953.648,
    "text": "What's the tick speed of the generative model?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 954.409,
    "end": 961.631,
    "text": " And that relates to the thickness of our temporal experience, like flickering images at 30 per second are perceived as continuous.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 962.351,
    "end": 973.854,
    "text": "So we don't know exactly what the clock speed is or whether a clock speed is even the apt metaphor, but surely there are stimuli that are so close spatially or temporally, we cannot tell the difference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 974.814,
    "end": 979.415,
    "text": "So it was just cool to hear like that different ages and different conditions might have different, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 981.018,
    "end": 985.101,
    "text": " parameters for their internal generative model and perception action loops.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 985.842,
    "end": 986.983,
    "text": "Blue, and then anyone else.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 989.204,
    "end": 992.026,
    "text": "So going back to whether or not a lightning bolt",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 993.334,
    "end": 1006.056,
    "text": " has agency, it certainly seems that if there is a defined prior, like for a lightning bolt, there's a defined prior state that the dielectric constant has to break down for the lightning bolt to be able to occur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.596,
    "end": 1013.398,
    "text": "So as long as there's that defined prior, then yes, the lightning bolt acts autonomously.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1014.518,
    "end": 1016.258,
    "text": "But does it have agency?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1016.278,
    "end": 1020.099,
    "text": "Well, what's the goal of the lightning bolt?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.07,
    "end": 1025.156,
    "text": " Is it to minimize the electricity buildup in the cloud?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1025.537,
    "end": 1028.781,
    "text": "Or what would the goal of a lightning bolt be?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1029.823,
    "end": 1035.45,
    "text": "And so that's kind of what you think about, or what I think about,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1036.164,
    "end": 1045.675,
    "text": " When it comes to like cells, okay, the goal of a single cell organism is to maintain homeostasis at some, you know, set point or within some range.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1046.817,
    "end": 1050.02,
    "text": "So, but a lightning bolt, really, what's the goal of a lightning bolt?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1050.861,
    "end": 1052.063,
    "text": "And so I think about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.897,
    "end": 1054.357,
    "text": " I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.697,
    "end": 1056.378,
    "text": "So does a lightning bolt have a goal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1056.898,
    "end": 1061.499,
    "text": "And that's kind of where the sense of agency comes into play for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.1,
    "end": 1073.203,
    "text": "And yeah, if you define the goal in an autonomous car, your goal is to safely transport people from A to B without running anyone over or getting smashed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.163,
    "end": 1077.745,
    "text": "That's very simple, I know, but obeying all the traffic rules and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1079.372,
    "end": 1086.377,
    "text": " you can establish a goal for an autonomous car, but does the car come up with its own goal or is that like a human driven goal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1086.497,
    "end": 1089.599,
    "text": "And is the car then a tool for the human?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.699,
    "end": 1107.991,
    "text": "So, so there's like some fuzzy boundaries here that kind of always point toward the life mind continuity thesis, which I think we probably haven't gone to yet, but maybe we'll get there where life has to happen at some degree for, for,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1109.642,
    "end": 1112.104,
    "text": " cognition to occur, maybe, or maybe not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1114.926,
    "end": 1115.746,
    "text": "Very cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1115.927,
    "end": 1117.928,
    "text": "So the goal of the lightning bolt.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1118.549,
    "end": 1124.593,
    "text": "So let's think of a few physical systems we know and love, like a ball rolling down to the bottom of a bowl.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1125.394,
    "end": 1128.316,
    "text": "It's minimizing its kinetic energy differential.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1128.556,
    "end": 1136.301,
    "text": "That's one description, not to say that's the explanation, but it's minimizing something by rolling to the bottom of the bowl without fail.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1137.162,
    "end": 1152.628,
    "text": " Similarly, when there's an electric charge buildup between the cloud and the ground or between two electric components inside of a electronic device, there's like a zap of electricity that can also be understood in terms of minimizing some energy differential.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1153.968,
    "end": 1163.132,
    "text": "That's what's interesting about active inference is we're also thinking about minimizing differentials of information",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1164.096,
    "end": 1173.346,
    "text": " And so what stories are explanations or descriptions of the ball rolling down kinetically or the lightning strike electromagnetically?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1174.007,
    "end": 1181.455,
    "text": "And then are we gonna have the exact same template of explanation for action of biological entities?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1182.276,
    "end": 1189.438,
    "text": " So that's a, and where does teleology and directedness, like is the ball rolling into the bottom of the bowl?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1189.518,
    "end": 1190.739,
    "text": "Is that end directed?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1191.239,
    "end": 1195.92,
    "text": "Or is it just directed only by approximate teleology, like a next step only?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1196.34,
    "end": 1198.121,
    "text": "So people say evolution has no end.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1198.581,
    "end": 1201.542,
    "text": "It's just a local optimization process, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1202.082,
    "end": 1204.122,
    "text": "So it was behavior along those lines.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1205.603,
    "end": 1208.404,
    "text": "And then the second point, then Steven and Dave was like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1209.424,
    "end": 1221.27,
    "text": " is the system of interest the primary cognizer or is it being used in an extended or an instrumental fashion wasn't sure on the answer there but that speaks to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1222.392,
    "end": 1226.314,
    "text": " Matt's paper with the users and the resources.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1227.055,
    "end": 1234.68,
    "text": "And so there's cases where you have like an adaptive active inference agent utilizing a mere active inferencer as a tool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1235.42,
    "end": 1239.603,
    "text": "Like you could be using a thermometer as a tool as you investigate the cave.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1240.503,
    "end": 1248.288,
    "text": "But then there's this other reciprocal case where actually the primary cognizers are sort of adaptive on both sides.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1248.828,
    "end": 1250.709,
    "text": "So there's a lot to explore there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1251.25,
    "end": 1251.49,
    "text": "Steven?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1254.451,
    "end": 1256.626,
    "text": " Yeah, the idea of things being either...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.015,
    "end": 1286.611,
    "text": " frozen at a certain state or having the ability to be a whole to stay in that state I think about well I mean on a big scale the sun right the sun has got an energy differential but it's self-maintaining right because as it keeps going it more and more material can be fused in the middle and it keeps so you get into the broader question of complex adaptive systems of which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.081,
    "end": 1307.169,
    "text": " non-equilibrium steady state systems are a subset so you've got this um you know there's an interesting point there and and when you have something which dissipates and can't form a markovian sort of boundary um you so it will lose that but there are times when you can maintain that for instance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.471,
    "end": 1316.421,
    "text": " If you have a globule of molten silica, plunge it into cold water, you can freeze the liquid state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.481,
    "end": 1319.485,
    "text": "It's still a liquid, but it's glass now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.066,
    "end": 1325.412,
    "text": "So it's maintaining that over longer periods of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.606,
    "end": 1330.769,
    "text": " But is it still non-equal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.95,
    "end": 1331.81,
    "text": "Has it formed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.311,
    "end": 1335.815,
    "text": "Is it just waiting to allow its energy gradient to dissipate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.875,
    "end": 1339.198,
    "text": "Or has it now managed to hold its state more concretely?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.3,
    "end": 1357.892,
    "text": " very interesting has a true pattern or structural integrity been reached or are we just sort of pausing or freeze freeze thaw on the energy differential just sort of make the ball made of velcro so it's still stuck up there dave",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1360.273,
    "end": 1376.065,
    "text": " Yeah, there's a hilarious tour de force by Stuart Bartlett on life as a solution to the planet Earth's dilemma of having too much heat and needing to get rid of it faster.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1376.585,
    "end": 1386.813,
    "text": "And he breaks down all these amazing processes, culminating with the reverse Krebs-Citric acid cycle as increasing the efficiency with which",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1389.779,
    "end": 1401.729,
    "text": " Heat can be radiated by creating just the right kinds of molecules in enough concentration to catalyze that problem of, boy, it's hot in here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1404.465,
    "end": 1407.506,
    "text": " This it's kind of like the science fiction classification.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1407.826,
    "end": 1425.812,
    "text": "I don't know what class, you know, class one, class two, class three civilizations, whether their energy capacity is like less than a star, equal to a star, multiple stars, some thermodynamic perspectives on the emergence and the elaboration of life.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1426.933,
    "end": 1432.355,
    "text": "When we see living systems like Schrodinger or Scott David as",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1433.757,
    "end": 1460.377,
    "text": " entropic systems that are resisting dissipation and you realize that for every unit of order that is constituted inside of the markov blanket that more disorder must occur outside you know that it can't be um free lunch and it isn't going to be one-to-one either so you're making an excess of disorder which is what pulls chemical reactions forward when you order like for every you know one pound of muscle organized on your body",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1461.545,
    "end": 1467.135,
    "text": " more than one pound of muscle equivalents have to be dissipated.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1468.018,
    "end": 1478.881,
    "text": " And then it is actually this imperative that's thermodynamic for life to continue inventing potentially even increasingly seemingly inefficient mechanisms.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1479.541,
    "end": 1484.842,
    "text": "So that's sometimes what I think about when someone talks about the energy use of cryptocurrency.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1485.062,
    "end": 1492.364,
    "text": "I think, you know, if you went into the cell and you said, well, we already have the enzyme making the forward reaction, why do we need the one making the backwards reaction?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1492.424,
    "end": 1493.404,
    "text": "That's wasting energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1494.281,
    "end": 1501.027,
    "text": " Well, it gives flexibility to the cell and it pushes the reactions forward and it gives capacity to regulate very adaptively.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1501.487,
    "end": 1509.033,
    "text": "So it's not always like we can just look at the heat producing light bulb and say that that's the inefficient one.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1509.574,
    "end": 1510.935,
    "text": "So blue and then Steven.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1513.897,
    "end": 1542.491,
    "text": " so i wonder too thermodynamically um is like life ultimately causing like the heat death of the universe right like are we using up all of the the thermodynamic free energy that's available um with the process of life like we are like in the scott david sense um you know entropy secreting right we're the only entropy i mean life is the only entropy minimizing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1543.837,
    "end": 1551.34,
    "text": " thing that I can think of, but I mean, is this ultimately going to lead to the lack of free energy, thermodynamic free energy that's available to do work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.841,
    "end": 1554.842,
    "text": "Which is just an interesting thing to think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.942,
    "end": 1572.67,
    "text": "And then also I was listening to some older live streams and maybe Dave actually probably has the knowledge to kind of clarify for me, but I always thought that informational free energy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1573.342,
    "end": 1577.165,
    "text": " was fundamentally connected to thermodynamic free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1578.566,
    "end": 1587.873,
    "text": "And so someone had suggested that that was not the intention of the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.893,
    "end": 1591.455,
    "text": "It was never supposed to involve thermodynamics initially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1592.656,
    "end": 1602.283,
    "text": "And I just wonder, is that some abstract bridge that was formed, the connection between infodynamic and thermodynamic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.19,
    "end": 1603.65,
    "text": " entropy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1604.111,
    "end": 1608.113,
    "text": "Or is that a real concrete connection?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1608.474,
    "end": 1616.399,
    "text": "And so for me, it's something I've always thought about as like, you know, links through physics and statistical physics, like those two things go together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.419,
    "end": 1619.741,
    "text": "But is there a disconnect there that I'm perhaps not aware of?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.021,
    "end": 1624.124,
    "text": "And was the free energy principle not meant to include thermodynamics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.504,
    "end": 1627.506,
    "text": "So I would love to hear what you guys think about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1628.207,
    "end": 1629.247,
    "text": "Yeah, Dave, go for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1629.388,
    "end": 1629.948,
    "text": "And then Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1631.016,
    "end": 1640.423,
    "text": " Yeah, you know, I think both entropy and the free energy principle are higher order metaphors or analogies, at least.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1642.005,
    "end": 1646.468,
    "text": "I'm guessing an entropy is roughly a third level analogy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1646.648,
    "end": 1651.472,
    "text": "You have to go up to that level of ramification to cover the various cases.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1655.996,
    "end": 1657.697,
    "text": " But there are people working on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1657.737,
    "end": 1669.126,
    "text": "I think I sent you a paper by Sean Carroll on the thermodynamic interpretation of... What was it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1669.166,
    "end": 1670.287,
    "text": "The free energy principle?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1670.947,
    "end": 1672.288,
    "text": "I just sent that a couple of days ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1672.949,
    "end": 1673.849,
    "text": "I don't know if you saw that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1673.889,
    "end": 1677.352,
    "text": "I dropped it in one of the chats.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1678.433,
    "end": 1679.854,
    "text": "Dropped it in the corner of a labyrinth.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1680.855,
    "end": 1681.355,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1682.936,
    "end": 1685.298,
    "text": "Yeah, I'm going to have to go back to my borders.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1686.132,
    "end": 1689.115,
    "text": " I think I've left too much in his various labyrinths.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1691.337,
    "end": 1691.678,
    "text": "Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1694.06,
    "end": 1696.062,
    "text": "Yeah, there's a couple of good points there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.463,
    "end": 1702.049,
    "text": "I suppose one thing in terms of life, it's trying to stay in that Goldilocks zone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.269,
    "end": 1703.67,
    "text": "So there's times when it's trying to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.827,
    "end": 1711.753,
    "text": " well, in terms of heat anyway, reduce the heat, and sometimes it might want to gain heat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.173,
    "end": 1714.755,
    "text": "But it doesn't really care per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.795,
    "end": 1718.498,
    "text": "It's like the niche itself will have a greater fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1719.259,
    "end": 1730.849,
    "text": "And if there's enough fluctuations over time and enough feedback loops, in theory, you'll sort of gain the carbon dioxide levels as best can serve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.25,
    "end": 1736.233,
    "text": " the overall production of carbon mass in theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.314,
    "end": 1745.301,
    "text": "But in terms of the piece around, I think it's a good conversation around active inference versus the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.341,
    "end": 1748.003,
    "text": "Because the free energy principle, or variation of free energy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.563,
    "end": 1775.704,
    "text": " Geoffrey Hinton's work and the recognition models and work that just takes perceptual data coming in deep minds can work with reducing free energy information but when you bring action into the game that's the interesting thing because then it's the action that brings in the energy in a way because by the action being more efficient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.329,
    "end": 1802.386,
    "text": " the the energy serve becomes part of the landscape so and whereas the perception peace you kinda tied more to if there was no action active infuse just basing inferences kind of all information up and down but once you start bringing action into the game that's when it starts to get big interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.65,
    "end": 1811.391,
    "text": " It's a lot to think about.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1812.532,
    "end": 1820.496,
    "text": "Information is usually framed more on the inference side than the action side.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1821.237,
    "end": 1826.12,
    "text": "We know there are information theoretic approaches to control theory, and there's",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1827.222,
    "end": 1852.767,
    "text": " kinds of connections that you know 2021 we can look back at and say that have been made but information is very aligned with knowledge and inference whereas thermodynamics brings in physical constraints energy and action like what is temperature if not a summary descriptor of the actions of molecules",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1853.607,
    "end": 1871.761,
    "text": " Whereas information tends to be a little bit more abstracted and disembodied and thermodynamics, even if it hasn't been connected to 4E cognition, extended, embedded, encultured, et cetera, it at least is closer to it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1871.981,
    "end": 1882.009,
    "text": "Like the pressure volume relationships of a gas, they relate to its context and to how it is actually enacting",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1883.373,
    "end": 1905.969,
    "text": " physics so then if we think about in informational physics first off how far can we get with bringing thermodynamics into information big topic and then where is control and action in that kind of a model Stephen",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1908.871,
    "end": 1932.45,
    "text": " yeah this is interesting to bring in and also if you go back to gibbs free energy and the way it was traditionally used i mean you basically have reactants and you have products which is basically where we were in terms of an equilibrium state and where we ended up and then there's a force that's going to drive that there's an enthalpy force i.e an energy change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.598,
    "end": 1944.403,
    "text": " which will drive things and will succeed depending on the activation energy of whatever's in between, which can be calculated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.423,
    "end": 1951.866,
    "text": "And then there's this kind of entropic force, which is basically cough, cough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.446,
    "end": 1956.228,
    "text": "It's just inferred basically by what the reaction actually did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.328,
    "end": 1962.711,
    "text": "But because you're only going from equilibrium state to equilibrium state, whatever happens in the middle was just like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.76,
    "end": 1964.3,
    "text": " I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.161,
    "end": 1970.003,
    "text": "Basically, if the truth be told, it's just entropy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.463,
    "end": 1974.805,
    "text": "But it's not just this black box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.865,
    "end": 1981.428,
    "text": "In this case, it's actually all the stuff that's going on on the journeys is where active influence is sort of in the process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.448,
    "end": 1988.111,
    "text": "So entropy or thermodynamic entropy is kind of interesting because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.387,
    "end": 2012.306,
    "text": " There is somehow this enthalpy term in terms of energy that there's an entropic force, they call it in chemistry, which is like how the entropic shift sort of pushes the reaction and gives it a force, which then combines with the enthalpy force, which is basically just whether it's going to give off loads of heat or absorb heat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.067,
    "end": 2018.472,
    "text": " I'm sorry, I should say energy absorbable, you know, or emit energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.532,
    "end": 2027.339,
    "text": "So this is where the I think it's not entirely clear quite how that might mix up in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.779,
    "end": 2032.203,
    "text": "And maybe sometimes it's safer to not make the analogy because it's non equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.274,
    "end": 2041.041,
    "text": " And non-equilibrium chemistry has only really started to happen in any sort of coherent way since the 1990s in terms of research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.101,
    "end": 2046.045,
    "text": "It's all been equilibrium state, equilibrium state, and hand waving in the middle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.107,
    "end": 2048.588,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.688,
    "end": 2048.868,
    "text": "Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.815,
    "end": 2068.395,
    "text": " So I, like whatever happens in the middle, I only had abbreviated PCAM and like this kind of makes me wish that I had more and, you know, then like a full semester of thermodynamics to really like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.795,
    "end": 2075.461,
    "text": " be able to screw these pieces together, but maybe they don't all actually screw together with a perfect fit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.982,
    "end": 2080.526,
    "text": "So, I mean, I think about, okay, is it an exothermic or an endothermic reaction?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2080.586,
    "end": 2082.508,
    "text": "Does energy go in or does energy come out?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2083.289,
    "end": 2084.93,
    "text": "And essentially all life is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2086.031,
    "end": 2089.592,
    "text": " like all of life is endothermic, like some energy has to go in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.632,
    "end": 2092.053,
    "text": "And where is that energy in life?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.113,
    "end": 2096.694,
    "text": "Like because we exist in this non equilibrium point, like life isn't spontaneous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2096.774,
    "end": 2099.275,
    "text": "And so where is this like storage happening?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2099.295,
    "end": 2101.156,
    "text": "And like in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.396,
    "end": 2110.483,
    "text": " Some, like, maybe it's a very abstract link, but I think about the energy that goes into creating life as information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.944,
    "end": 2122.554,
    "text": "Because it's essentially this DNA blueprint that we all have that carries on from generation to generation that is the catalyst for the reactions that occur that create life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2123.635,
    "end": 2126.398,
    "text": "So that's just always, I don't know, how I think about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2128.507,
    "end": 2132.89,
    "text": " Here's one image that you'll see on your shared screen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2133.55,
    "end": 2135.511,
    "text": "So this relates to Gibbs free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2135.671,
    "end": 2139.333,
    "text": "I mean, you mentioned it, we've been talking a little bit about chemistry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2140.851,
    "end": 2149.235,
    "text": " And so this is already pre-adapted to, instead of the Gibbs free energy, it's like the pain axis.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2149.256,
    "end": 2160.742,
    "text": "So we can quibble with the specific metaphor, but the piece that I think is interesting is the difference between the thermodynamically favored and the kinetically favored reactions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2161.86,
    "end": 2164.941,
    "text": " So the green line is kinetically favored.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2165.601,
    "end": 2170.562,
    "text": "Like if there's a ball rolling, it's easier to climb the B hill.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2171.302,
    "end": 2172.303,
    "text": "So it's easier to get on that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2172.683,
    "end": 2175.843,
    "text": "There's less friction, less of a activation energy cost.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2176.584,
    "end": 2185.806,
    "text": "And therefore it's kinetically more accessible to take the green route to get you to product D. And then that A minus D is the delta free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2186.906,
    "end": 2195.672,
    "text": " Whereas the thermodynamically favored product, which is like A to E, this is like a complete combustion versus a partial combustion, more energy is released.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2195.732,
    "end": 2203.117,
    "text": "There's a bigger delta G, but that product may not be as kinetically accessible.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2203.717,
    "end": 2207.66,
    "text": "And so this is like classic OChem course questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2209.053,
    "end": 2232.304,
    "text": " some reactions you want to do them really hot because you just want to get over a kinetic barrier and wherever you end up is going to be okay other times you want to carry out the reaction very slowly so that you can be sure that the only high energy balls that come across are only going to take this green road and so it doesn't like combust so you keep the reaction cold and then in this example",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2233.044,
    "end": 2238.967,
    "text": " it's already been connected to sort of behavioral economics, like making a bad decision versus making a good decision.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2239.447,
    "end": 2240.968,
    "text": "You know, you're choosing what to eat for dinner.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2241.508,
    "end": 2247.931,
    "text": "Is it gonna be something with a low barrier, high kinetic accessibility, but maybe",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2249.713,
    "end": 2263.934,
    "text": " not healthy, but where do we transmute from the kinetic versus thermodynamics of chemicals to kinetics and thermodynamics of information and decision-making and action, and then",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2265.435,
    "end": 2274.022,
    "text": " closing the triangle would be like, is there a bioenergetic or a metabolic account for decision-making?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2274.182,
    "end": 2279.226,
    "text": "Like it literally uses more glucose in your brain to make taxing decisions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2279.886,
    "end": 2283.108,
    "text": "And that would sort of close the loop in an interesting way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2283.909,
    "end": 2285.03,
    "text": "So Steven, then Dave.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2287.406,
    "end": 2297.594,
    "text": " Yeah, so this is also quite a useful diagram because, I mean, you'd have that kind of activation transition state as being the kind of the hill, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.614,
    "end": 2304.58,
    "text": "So the higher the hill, the more energy is needed to make that transition state become available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.9,
    "end": 2308.443,
    "text": "But it is a case of it going from left to right within reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.463,
    "end": 2310.965,
    "text": "I mean, there is that idea that things can move both ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.686,
    "end": 2312.867,
    "text": "But what's interesting is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.141,
    "end": 2325.471,
    "text": " The more dilly-dallying, to use an English phrase, which I do a lot of, but the more dilly-dallying is not necessarily the better thing there, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.511,
    "end": 2329.054,
    "text": "Because the more dilly-dallying the molecules are doing, the less they're going to get over the hump.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.046,
    "end": 2346.154,
    "text": " Because it's really a case of this energy dynamic and entropy being maybe going to help because in certain cases, but normally it's a hindrance, it's something to slow it down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.694,
    "end": 2349.496,
    "text": "But the difference is when you're dealing with variations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.416,
    "end": 2355.239,
    "text": "See, when you've got variational free energy, now you can get information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.279,
    "end": 2357.64,
    "text": "The dilly-dallying gives you...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.155,
    "end": 2384.005,
    "text": " variation in entropy and that can give you like entropy itself doesn't necessarily well we don't entropy is a funny term but noise alone doesn't give you any information variations in noise can give you information and variations in noise need a reference of a non well they don't i don't know if they need that but let's say they it helps to have a non-equilibrium steady state to reference against",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.901,
    "end": 2392.345,
    "text": " That whole non-equilibrium piece and complex attractor states and all of that sort of stuff doesn't really feature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.765,
    "end": 2395.867,
    "text": "It's not an attractor state at the top, per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.748,
    "end": 2407.073,
    "text": "It's a transition state that some molecules go to or some configurations happen to by chance arrive at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.954,
    "end": 2411.416,
    "text": "But obviously, it's maybe not like that alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.476,
    "end": 2413.477,
    "text": "There's this kind of inference process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.734,
    "end": 2422.459,
    "text": " Yes, so this reaction would be reversible, but imagine if the ball gets to here, now it's a 50-50, it could roll either way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2422.78,
    "end": 2423.961,
    "text": "It's at the transition point.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2424.161,
    "end": 2427.403,
    "text": "That's what enzymes stabilize, transition state complexes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2427.463,
    "end": 2429.785,
    "text": "They reduce activation energy barriers.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2430.466,
    "end": 2431.947,
    "text": "But now if you were down here in P2,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2433.416,
    "end": 2442.005,
    "text": " it would be a positive delta G. So it'd be energetically uphill because this is what they call a thermodynamically irreversible reaction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2442.526,
    "end": 2450.174,
    "text": "So KEQ, like the coefficient of how complete the reaction is going to proceed is going to be way to the right on this one.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2450.875,
    "end": 2455.26,
    "text": "But if it just looked like a hump, then in the long run, you'd get",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2456.385,
    "end": 2457.486,
    "text": " an even number on both sides.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2457.506,
    "end": 2458.947,
    "text": "It's kind of like ergodicity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2459.507,
    "end": 2462.049,
    "text": "And so it is, there's a lot that can be seen here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2462.109,
    "end": 2463.409,
    "text": "So Dave, and then blue.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2464.61,
    "end": 2464.87,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2464.93,
    "end": 2476.678,
    "text": "The, uh, advertising meme for that expensive can opener that needs to be pushed that would, uh, bind to the, the hump.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2477.578,
    "end": 2481.881,
    "text": "And actually like you, I think you said, flatten the hump effectively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2482.982,
    "end": 2483.022,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2485.587,
    "end": 2486.988,
    "text": " And how does that happen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2488.609,
    "end": 2491.53,
    "text": "Presumably, you're getting a reduction of cognitive dissonance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2491.63,
    "end": 2503.336,
    "text": "It no longer looks dissonant to imagine, oh, spending all that money I feel so guilty about buying a $40 book the other day, how can I justify buying a $12 can opener instead of a $2 one?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2506.516,
    "end": 2517.874,
    "text": " and the point of sale oh just tap it's lower kinetic friction versus you know pull out your um your shells count them blue and then steven",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2519.847,
    "end": 2533.716,
    "text": " So one critical thing when you're talking about whether or not a reaction is reversible or not, so when you have the free energy of the product and the reactant, if the free energy is the same, it's completely a reversible reaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2534.136,
    "end": 2541.4,
    "text": "But the fact that it's an irreversible reaction is driven by the lower free energy of the product, of the reaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2542.141,
    "end": 2544.382,
    "text": "And so I think about things like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.514,
    "end": 2548.295,
    "text": " you know, even just the self-assembly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2548.455,
    "end": 2556.08,
    "text": "So we can talk about self-assembly of life of cells, but also self-assembly of molecules, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2556.12,
    "end": 2564.606,
    "text": "So, so molecules will spontaneously, like, you know, salt spontaneously dissolves in water and that's driven by charge, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.626,
    "end": 2568.128,
    "text": "And hydrogen bonds and, you know, the polar polarity of water.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.568,
    "end": 2570.069,
    "text": "And so when you have this, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2571.05,
    "end": 2582.741,
    "text": " you know, kind of spontaneous reactions that occur that are driven by like molecular charge, is that that's, again, like an information catalyst, because the charge is information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.781,
    "end": 2583.802,
    "text": "Is it positive or negative?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2583.842,
    "end": 2584.582,
    "text": "Is it a North Pole?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2584.642,
    "end": 2585.423,
    "text": "Is it a South Pole?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2586.224,
    "end": 2591.769,
    "text": "And so that without that kind of information, would these reactions push forward?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2594.116,
    "end": 2620.487,
    "text": " and one way that computers over the last hundred years have revolutionized this discussion is like if you just say well of course information has nothing to do with it we're talking about just chemicals tossing around in space and we're talking about thermodynamics there's no need to bring information into it and then someone says well i'm talking about the chemical components on my hard drive or i'm talking about the chemistry of this processor so it's like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2621.314,
    "end": 2623.575,
    "text": " There is an information thermodynamic link.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2623.675,
    "end": 2627.057,
    "text": "We are putting energy into this processor or hard drive.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2627.157,
    "end": 2628.718,
    "text": "There is chemistry happening.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2629.578,
    "end": 2630.739,
    "text": "Who will link it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2631.499,
    "end": 2636.362,
    "text": "It's no longer a tenable position to say that there just is no linkage or it wouldn't even be useful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2636.942,
    "end": 2643.025,
    "text": "At the very least, it would be extremely useful, if not beyond useful, to understand this nexus.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2643.425,
    "end": 2646.427,
    "text": "So it's kind of like that info thermodynamic link",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2647.938,
    "end": 2658.204,
    "text": " marriage is already well in progress and we're using devices that are empirical proofs, even if the conceptual details are not quite filled in yet.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2658.604,
    "end": 2659.305,
    "text": "Blue, and then Steven.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2661.243,
    "end": 2661.423,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2661.503,
    "end": 2662.644,
    "text": "Just to respond to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2662.784,
    "end": 2668.587,
    "text": "It's like Maxwell's demon is essentially can be replaced by a computer, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2668.667,
    "end": 2677.472,
    "text": "Like, so a computer can sit on top of the box and decide whether the, you know, big molecules go this way or the hot molecules go this way and the cold molecules go that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2677.752,
    "end": 2681.374,
    "text": "But then you'd have to put the computer in a fridge and you'd have to plug the fridge in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2681.394,
    "end": 2681.954,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2682.114,
    "end": 2690.679,
    "text": "So there's all this, like the thought experiment of, um, you know, the information separation or the information filtering taking place, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2691.192,
    "end": 2691.873,
    "text": " with computers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.013,
    "end": 2700.263,
    "text": "And so that's also like another direct link between the infodynamic and thermodynamic, you know, capacities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2701.184,
    "end": 2701.905,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.925,
    "end": 2705.126,
    "text": " Yeah, this is really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.527,
    "end": 2708.007,
    "text": "Yeah, this link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.388,
    "end": 2712.61,
    "text": "So what gets really interesting is when it when there's those endothermic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.85,
    "end": 2719.274,
    "text": "So, for instance, actually, we used to use this when we used to do reactions in the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.414,
    "end": 2726.538,
    "text": "So like if you want to get a load of ice, basically dump a load of salt into it and then your ice goes down to like minus 18 degrees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.859,
    "end": 2749.168,
    "text": " right so now you can start doing reactions at minus 18 degrees and your beaker because you can immerse it in this so you're um well what's just happened there right you've just dropped the temperature that doesn't make sense so this is where this entropic you know the ice the whole way the ice melts and thaws and if you know if you drop the temperature very very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.045,
    "end": 2778.105,
    "text": " drop the temperature drop the beat drop the video chat r.i.p steven we'll continue though he'll rejoin um this slide which i just put the image up this is like in the wikipedia article on kinetic versus thermodynamic control like one doesn't have to be a chemist to see that we're taking a few very interesting esoteric symmetrical molecules",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2779.212,
    "end": 2781.294,
    "text": " And then there's some transition state complex.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2782.235,
    "end": 2788.02,
    "text": "And then in the blue, if it's very cold, it's going to form this product.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2788.16,
    "end": 2790.662,
    "text": "If it's very warm, it forms a different product.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2791.403,
    "end": 2801.352,
    "text": "So the ratio and the temperature and the solvent, there's so many details to explore, but it's just an example about like thinking fast and slow.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2802.503,
    "end": 2807.045,
    "text": " Type one and type two, Kahneman, you know, decision-making frameworks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2807.845,
    "end": 2809.545,
    "text": "What's the type one decision?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2810.246,
    "end": 2812.286,
    "text": "Where is it really being thought through?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2812.306,
    "end": 2819.749,
    "text": "You know, hey, chill out, cool down, slow your horses, make the right decision versus, you know,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2820.814,
    "end": 2837.384,
    "text": " Buying under pressure, time pressure for decisions, that's one of the major threats to cognitive security and good decision-making is not having enough time or spending too much time on a decision, which is implicitly taking away time",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2838.365,
    "end": 2843.989,
    "text": " from another decision because in the lab, we can just heat things up, cool them down, but we only get one sequence of action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2844.53,
    "end": 2857.399,
    "text": "So in a broader sense, we can't just perform well on single decisions because we also need to do that sort of Bayesian estimation of how much time should we be spending on this decision, Blue?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2860.504,
    "end": 2888.341,
    "text": " so just thinking about time i mean time is always the fourth axis right time is always the other other thing but i mean we have these things that we say like time is money right like so so what is the cost of time um and like i think about things like time effort energy and money as all like things that i put in to drive a reaction forward like things that i put in to create a result right time effort energy and money",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2888.721,
    "end": 2909.103,
    "text": " and so is there some kind of um like quantifiable interchange between time and money or time and energy or time and effort or um i mean it's time always the entropy increasing thing but like so okay entropy increases with time right but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.703,
    "end": 2912.545,
    "text": " Like I put time into something, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2913.606,
    "end": 2917.909,
    "text": "So is this, am I putting entropy into something to create a result?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.269,
    "end": 2919.57,
    "text": "That seems very backwards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2920.991,
    "end": 2926.534,
    "text": "And it's just cool to think about time as like, you know, something that you put in to drive a reaction forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2926.654,
    "end": 2926.994,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.816,
    "end": 2931.437,
    "text": "And quality time, like attention.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2932.038,
    "end": 2937.081,
    "text": "Maybe it's like, you know, if we had a unit in erg or a calorie of attention and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2939.292,
    "end": 2947.639,
    "text": " You know, the calories, the temperature, heat of some metal sphere and a cloud, you know, there's different amounts of specific heat.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2948.44,
    "end": 2951.483,
    "text": "And so maybe individual's attention will be different.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2951.523,
    "end": 2955.567,
    "text": "It's different to get the attention of peer reviewer one versus peer reviewer two.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2956.467,
    "end": 2963.314,
    "text": "But is there a commonality for attention and does that help make decisions get pushed along the road?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2964.574,
    "end": 2970.618,
    "text": " Blue, maybe you could introduce this nice set of slides on life-mind continuity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2972.139,
    "end": 2972.399,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.039,
    "end": 2980.444,
    "text": "So there's maybe the first question first, and then we can maybe talk about the life-mind continuity thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2980.484,
    "end": 2983.266,
    "text": "So this is a quote from the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2983.406,
    "end": 2993.212,
    "text": "It says, adaptive active inference requires that a system autonomously engage in active inference, maximizing sensory evidence for its own existence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2994.17,
    "end": 3000.418,
    "text": " So this kind of is a different... Yeah, and they cited this reference, and this is from the Sims paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.159,
    "end": 3001.36,
    "text": "But...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3003.307,
    "end": 3007.83,
    "text": " I just thought about what is evidence for your own existence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3007.85,
    "end": 3013.934,
    "text": "Like when I pulled this quote out, and does that require self-awareness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3014.054,
    "end": 3015.955,
    "text": "Like, do I exist?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3016.115,
    "end": 3017.416,
    "text": "I think, therefore I am.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3017.476,
    "end": 3019.037,
    "text": "It's very like Descartes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3019.157,
    "end": 3022.559,
    "text": "And like, that's evidence for your existence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3022.639,
    "end": 3027.742,
    "text": "But like, does a little cell even, is it self-aware enough to know that it exists?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.282,
    "end": 3032.165,
    "text": "I mean, is like the desire to not be extinguished",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3032.745,
    "end": 3062.085,
    "text": " awareness of your own existence um so i think about you know it's sensory evidence for your model or for the validity of your model so so that's kind of always how i think about it model evidence is not evidence for my existence it's evidence for the validity of my model so that's kind of how i've always thought about it but it just was interesting this um this phrasing that was used by by sims uh um because i just was curious is there a difference between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3063.126,
    "end": 3066.751,
    "text": " evidence for your existence and model evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3067.432,
    "end": 3069.195,
    "text": "And just what do you guys think about that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3069.295,
    "end": 3072.28,
    "text": "Or am I the only one that was like, that's kind of weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3075.247,
    "end": 3077.148,
    "text": " There's a lot of pieces here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3077.388,
    "end": 3086.851,
    "text": "So one piece is that in active inference, the preferences are over sensory outcomes, not over hidden state estimates.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3087.631,
    "end": 3097.494,
    "text": "So instead of maximizing values of hidden state estimates, like making it maximally safe out there,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3098.74,
    "end": 3107.245,
    "text": " that situation of bodily safety would be reframed as maximizing evidence for observing our observations in their preferred states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3107.506,
    "end": 3118.152,
    "text": "So one little flourish that is active inference germane is this focus on the sensory evidence rather than inferred hidden states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3120.054,
    "end": 3124.777,
    "text": "And then that is an interesting question about is it the model of itself?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3124.977,
    "end": 3125.457,
    "text": "What is this?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3126.078,
    "end": 3127.559,
    "text": "How are we getting sensory evidence",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3128.706,
    "end": 3133.89,
    "text": " for ourself and is that the imperative for action?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3134.05,
    "end": 3136.932,
    "text": "And it just reminded me, cause you said, you know, I think therefore I am.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3138.403,
    "end": 3162.501,
    "text": " this is um uh Latin post hoc ergo pro proctor hook after this therefore because of this it's like the post hoc fallacy so I think therefore I am and then of course you know Q the 50 frist and papers I am therefore I think every possible inversion like is it that thought begets",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3164.147,
    "end": 3182.988,
    "text": " life or does life beget thought and then if we're only going to find both of them inextricably tied up in actual systems what is the partitioning or the compartmentalizing that is variously meaningful or true or",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3185.967,
    "end": 3187.488,
    "text": " So that inversion is really cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3187.668,
    "end": 3198.077,
    "text": "And, and also speaks to the podcast that was released yesterday, the podcast episode where it's clipped from, I think live stream five, six point, no 5.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3198.617,
    "end": 3203.181,
    "text": "So there was a lot of discussion about change your mind, change your life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.381,
    "end": 3207.024,
    "text": "And then the inversion of that is change your life, change your mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3207.645,
    "end": 3207.805,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3208.045,
    "end": 3214.991,
    "text": "I think therefore I am, I am therefore I think it's just, that's all this action perception loop of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3215.812,
    "end": 3216.773,
    "text": "Um, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3217.013,
    "end": 3218.414,
    "text": "Here's the Friston paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3218.514,
    "end": 3220.796,
    "text": "I am therefore, I think he, he, he did go there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3222.017,
    "end": 3222.558,
    "text": "He's been there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3224.639,
    "end": 3226.501,
    "text": "This is an interesting, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3228.519,
    "end": 3230.56,
    "text": " interesting paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3230.58,
    "end": 3243.066,
    "text": "It even begins, the first sentence is, how does Schrodinger's question, which is what is life, touch on philosophical propositions such as Descartes' famous proposition, cognito ergo sum, I think, therefore I am.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3243.846,
    "end": 3250.849,
    "text": "And then a little, not exactly a formal connection, but this weekend is cognitio 2021.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3251.91,
    "end": 3254.631,
    "text": "So kind of another illusion there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3255.471,
    "end": 3256.512,
    "text": "But yeah, what does it mean?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3257.412,
    "end": 3276.236,
    "text": " for sensory evidence of our own existence is that our um our proprioception and our our thermo perception and taste or is this referring to a higher level of mental activity like as we saw in um the sanford smith paper on mental action",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3278.004,
    "end": 3307.243,
    "text": " the observables of one level so like the outcomes of the higher order mental model can be plugged into the priors of a lower model or the hidden state estimates of a lower model so like is observing our attention maximizing evidence for a model which we pay attention to different things where does where does that play in with life mind continuity what is that question",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3311.109,
    "end": 3311.254,
    "text": " Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3313.206,
    "end": 3314.367,
    "text": " Got to hit unmute, I got it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3315.628,
    "end": 3326.277,
    "text": "So the distinction that Sims made in the paper between adaptive active inference and near active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3326.877,
    "end": 3338.346,
    "text": "So my question is whether this distinction follows the kind of evolutionary late comer path or if it's in line with the life-mind continuity thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3338.747,
    "end": 3342.51,
    "text": "And so we can kind of unpack all of those in the next couple of slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3343.484,
    "end": 3343.784,
    "text": " Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3344.825,
    "end": 3348.848,
    "text": "So the life-mind continuity thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3349.028,
    "end": 3363.458,
    "text": "So I pulled from this paper by Kirchhoff and Froese, where they asked the question, are mental phenomena restricted to living systems?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3364.458,
    "end": 3367.26,
    "text": "And there's several viewpoints here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3371.241,
    "end": 3380.144,
    "text": " that the first one is, obviously you can answer no, and there's a couple of different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3380.524,
    "end": 3390.948,
    "text": "And so the cognitivist viewpoint is that some cognitive systems can be living systems, but minds are really associated with computational processes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3391.508,
    "end": 3394.752,
    "text": " that have semantic, contentful properties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3395.552,
    "end": 3401.319,
    "text": "And minds can be realized independently from life, given the right kind of artificial support system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3401.799,
    "end": 3406.604,
    "text": "And so this allows mind to exist artificially, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3407.425,
    "end": 3412.01,
    "text": "And then there's the overly generous, non-cognitivist free energy principle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.852,
    "end": 3419.158,
    "text": " that all systems can maintain their variables within a limited range of values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3420.078,
    "end": 3433.232,
    "text": "All systems that do this can be understood as having some kind of mentality or proto-mentality, given that the FPP casts any system that maintains structural integrity in a fluctuating environment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3434.793,
    "end": 3437.636,
    "text": " as engaged in predicting its own future states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3437.716,
    "end": 3451.091,
    "text": "And this is kind of the pan-psychic take on, you know, that life can exist in, or not that life, but that mind can exist in things like molecules that are undergoing reactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3451.271,
    "end": 3453.353,
    "text": "So there's, I mean, in everything, there's a mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3454.926,
    "end": 3457.368,
    "text": " Thanks for this really helpful breakdown.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3457.828,
    "end": 3462.231,
    "text": "So huge topic, a lot of implications.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3462.491,
    "end": 3468.295,
    "text": "Is it okay just to throw out a cell phone that we're done using, or would that be a rights issue?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3468.896,
    "end": 3473.019,
    "text": "So are mental phenomena one-to-one, restricted, necessary, sufficient?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3473.539,
    "end": 3479.724,
    "text": "How is cognition related to life as we thermodynamically know it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3480.664,
    "end": 3495.153,
    "text": " and some strong shots from the no side, which is saying, which first off is always a somewhat easier position to defend because you can just say, look, it's a Venn diagram overlap and we don't know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3495.874,
    "end": 3507.922,
    "text": "So who's to say that it's restricted because maybe there's some overlap, maybe there's A but not B, maybe there's B but not A. So first it's a general claim that one can deny a restriction",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3509.178,
    "end": 3512.22,
    "text": " by just saying, we're not sure, or it might not always be that way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3512.841,
    "end": 3522.408,
    "text": "And then this is just really, it's clear and funny how you've written it, overly generous, like relative to the expectations of who, maybe someone's very stingy with their FEP interpretation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3522.908,
    "end": 3525.45,
    "text": "Maybe someone else- This is actually the authors, how they wrote it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3525.65,
    "end": 3529.052,
    "text": "So Kirchhoff and Froese, that's how, that was their terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3531.912,
    "end": 3532.132,
    "text": " Nice.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3532.413,
    "end": 3536.777,
    "text": "So maybe there's an FEP whale out there for whom this is still not generous enough.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3537.317,
    "end": 3541.642,
    "text": "But if it was a quote, I didn't mean to edit it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3541.802,
    "end": 3555.215,
    "text": "But like there's the integrated information theory people, their flavor of panpsychism would be like, because all systems are on this continuum of integrating information, panpsychism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3556.502,
    "end": 3570.005,
    "text": " Another approach is sort of this cybernetic panpsychism, which is like because all systems are on the continuum of maintaining their variables within a limited range of values, kind of like good regulator theorem.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3571.726,
    "end": 3581.588,
    "text": "So in other words, not because there's an information continuum, but because there's a cybernetic control continuum, dot, dot, dot, panpsychism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3582.426,
    "end": 3588.349,
    "text": " So there's an information centered inference, pan inference equals pan psychism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3588.989,
    "end": 3597.254,
    "text": "And here's like a pan control or pan resistance to dissipation equals pan psychism claim.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3597.874,
    "end": 3606.578,
    "text": "So that's pretty cool how that action and inference thread come back in different guises.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3607.199,
    "end": 3608.039,
    "text": "Welcome back, Steven.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3608.279,
    "end": 3610.7,
    "text": "Your surroundings are less...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3611.841,
    "end": 3630.494,
    "text": " blue but i hope that it will work thanks yep we're on 11 we just heard some of the no uh voices on the question are mental phenomena restricted to living systems and then blue who is on the other side of the table",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3632.318,
    "end": 3639.302,
    "text": " Well, and then there's a couple of different views that the authors put forward in the paper as well on the yes side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3639.942,
    "end": 3644.545,
    "text": "So there is the non-cognitivist FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3644.665,
    "end": 3647.087,
    "text": "So that's the second view from the no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3648.027,
    "end": 3648.567,
    "text": "But plus...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3650.967,
    "end": 3653.349,
    "text": " the evolutionary late-comer view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3653.789,
    "end": 3665.118,
    "text": "So this is, mind but not life requires sophisticated generative neural machinery that is not present in simple forms of life, such as single-celled organisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3665.558,
    "end": 3670.302,
    "text": "And that was my question about adaptive active inference versus mere active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3670.742,
    "end": 3673.024,
    "text": "Is that like putting mind above",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3674.851,
    "end": 3690.666,
    "text": " Is that at a certain evolutionary point, such as like higher level vertebrates or whatever, only perform adaptive active inference if they're evolutionarily at a certain point or in a certain, as Sims kind of implied, in a certain amount of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3693.287,
    "end": 3702.852,
    "text": " So in his paper, he said that whole organisms can do adaptive active inference, but not like cells within an organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3702.952,
    "end": 3710.775,
    "text": "And so that was kind of, it's along the lines, well, it doesn't necessarily link directly to sophisticated neural machinery.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3710.795,
    "end": 3713.837,
    "text": "It seems like sophisticated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3714.932,
    "end": 3721.721,
    "text": " collective autonomy or like what was the sophistication and where was this line?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3721.741,
    "end": 3729.532,
    "text": "And I kind of pushed Matt on that when he was here, but I just wonder, is that linked somehow to this way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3731.49,
    "end": 3733.292,
    "text": " And then, I don't know, Stephen, did you want to say something?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3733.752,
    "end": 3736.315,
    "text": "And then I can talk about the life-mind continuity views.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3736.876,
    "end": 3737.477,
    "text": "Yeah, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.238,
    "end": 3749.531,
    "text": "Yeah, I think actually it kind of continues what you're saying, continues a little bit with the graph that we had earlier there in the sense that I was thinking when...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.273,
    "end": 3756.015,
    "text": " something goes over that graph and goes down the other side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.295,
    "end": 3767.519,
    "text": "With active inference, like with normal reactions, right, you do it any time with the same reactants, it's the same basic curve every time, right, because it's a standard thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.559,
    "end": 3770.821,
    "text": "But with life, it gets a chance to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.781,
    "end": 3777.247,
    "text": " know what the final outcomes have been and start to maybe change the energy of the hump.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.728,
    "end": 3785.956,
    "text": "It can actually change, particularly maybe as well if there's non-equilibrium steady states in there, but there's an actual ability to infer backwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.976,
    "end": 3793.324,
    "text": "And I suppose that ability to infer backwards, well, in real time, which in real time could be chemical time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.145,
    "end": 3817.706,
    "text": " that that could kind of happen through enzymes or maybe through the mediation of enzymes and whether that's cognition or whether that's could be done through some real-time um you know chemical inference process um and then of course you've got that happening over longer times um and this then becomes when do you start to move from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.527,
    "end": 3844.055,
    "text": " a variational free energy into an expected free energy you know um but that ability to go backwards or forwards and start to sculpt the landscape of intermediaries um yeah i wonder i think that kind of ties into what you're saying i'm going to do a little life mind venn diagram",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.862,
    "end": 3869.367,
    "text": " what kind of a universe or world or simulation or whatever do life and minds look like partial overlap like in this world let's make this a little different color you know in this world there's things that are having mind but not life and vice versa",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3870.259,
    "end": 3878.125,
    "text": " So that is a strict refutation of the restriction claim.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3879.386,
    "end": 3880.727,
    "text": "Is it restricted to living systems?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3881.467,
    "end": 3882.188,
    "text": "This would be no.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3882.849,
    "end": 3885.15,
    "text": "But then let's just say it is restricted to living systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3885.891,
    "end": 3887.352,
    "text": "Well, it could be like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3887.532,
    "end": 3889.654,
    "text": "There's still living systems with no mind.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3890.714,
    "end": 3893.016,
    "text": "Or could they be the same?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3894.017,
    "end": 3894.157,
    "text": "So...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3896.303,
    "end": 3920.745,
    "text": " would we know what would be the observation or the experiments or the measurement to make especially keeping in mind or keeping in life that mind is a little bit of a uh potentially unobservable phenomena so how do we integrate sort of uh meat and potatoes with minds",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3921.88,
    "end": 3927.115,
    "text": " in a way that's going to lead to testable predictions and optimally informative experiments.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3927.256,
    "end": 3927.416,
    "text": "Blue?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3929.318,
    "end": 3937.443,
    "text": " Well, and so that is the life-mind continuity thesis is that it's 100% overlap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3938.023,
    "end": 3947.089,
    "text": "So the concept of a mind is grounded in the concept of life in terms of auto-poiesis and adaptivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3947.609,
    "end": 3954.994,
    "text": "But the problem that I have with that, the whole reason I brought this up is like back to Schrodinger's questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3955.374,
    "end": 3956.795,
    "text": "What is life, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3957.095,
    "end": 3957.415,
    "text": "And so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3958.656,
    "end": 3963.141,
    "text": " It's not binary necessarily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3963.561,
    "end": 3967.145,
    "text": "There's some continuum between life and...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3969.568,
    "end": 3989.947,
    "text": " not life there's a lot of gray area there's you know obligate parasites there's viruses there's a lot of things that fall into that like fuzzy area and then also like going into the origins of life theory somehow some self-replication and autopoiesis happened in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.648,
    "end": 3996.942,
    "text": " non-life that drove the transition to life at some point in our evolutionary history.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3996.962,
    "end": 3999.027,
    "text": "Where's the mind there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4002.509,
    "end": 4016.515,
    "text": " And that's one other reason that panpsychists implicitly or explicitly promote their viewpoints is there's no need for like abiogenesis, for amentogenesis, for the emergence of mind from non-mind.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4017.095,
    "end": 4021.657,
    "text": "You just say, nope, my belief is it's all continuums of mind.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4022.237,
    "end": 4024.598,
    "text": "So we're just like adding grains of sand to a pile.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4025.079,
    "end": 4030.401,
    "text": "There's a debate about when it's a heap versus when it's not a heap, but there's no qualitative evidence",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4031.121,
    "end": 4038.318,
    "text": " challenge with explaining the emergence of complex minds as described in girdle escherbach",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4039.278,
    "end": 4050.264,
    "text": " Whereas other people who are not panpsychist, implicitly, it's like saying, you do need to have an account for how minds, if you think they exist, arise from non-minds.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4050.944,
    "end": 4056.568,
    "text": "Or you can take the anti-psychic position and just say, there's never emergence of mind.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4057.248,
    "end": 4059.109,
    "text": "So not in the little, not in the big.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4059.689,
    "end": 4061.71,
    "text": "And so there's a few ways to be consistent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4061.75,
    "end": 4067.434,
    "text": "You know, panpsychism and then elaboration of mind, mental denialism,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4068.462,
    "end": 4083.152,
    "text": " which is its own answer, or some sort of qualified intermediate where you think that it emerges at a developmental stage or some evolutionary development or an ecological context or some informational requirement.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4083.192,
    "end": 4085.394,
    "text": "You have to be this many bits to have awareness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4085.414,
    "end": 4097.202,
    "text": "So there's a lot of views in the space, but this is just total fundamentals, what systems are living, which ones have mind, which ones deserve to be treated using respect.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4098.109,
    "end": 4098.389,
    "text": " Steven?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4101.591,
    "end": 4104.272,
    "text": "This also brings back the multi-scale question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4106.073,
    "end": 4107.213,
    "text": "Maybe not necessarily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.233,
    "end": 4114.577,
    "text": "I don't know if physical scale, but temporal scale, if something is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.315,
    "end": 4134.214,
    "text": " actively variationally enabling itself to maintain its steady state but it's purely doing it only at the level of maintaining a chemical gradient and that's that's the whole game",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4134.915,
    "end": 4141.642,
    "text": " I don't know if that's a bit... It depends where... It's not exactly clear where mere active influence sits, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.662,
    "end": 4144.105,
    "text": "So there is a slight ontological question there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.145,
    "end": 4154.376,
    "text": "But if something's maintaining itself, but it's just doing one thing, and it can do that maybe through chemical gradients or whatever, but then you've got this temporal depth of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.197,
    "end": 4173.749,
    "text": " okay doing that because it's inferring that by doing that it will allow it to do something else at what point do these kind of chain of events start to become more lifelike and does there then need to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.296,
    "end": 4201.401,
    "text": " is that in itself life and does then almost need to be a lifelike entity that is managing that and then that becomes mind and then this is this is that question that i suppose fungi raise a bit as well because they they mediate messaging part message passing and a lot of interesting stuff now are they kind of a mind or not uh i don't know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4203.928,
    "end": 4214.135,
    "text": " So we could definitely go to talking a little more about mirror and adaptive active inference, but it makes me think about, you mentioned a chemical gradient.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4214.615,
    "end": 4221.92,
    "text": "Well, what are neurons and glia doing if not shuttling around chemical gradients?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4222.02,
    "end": 4227.184,
    "text": "And so it's like, okay, is mind in the sodium ion?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4228.046,
    "end": 4229.527,
    "text": " Okay, you know, yes or no.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4230.467,
    "end": 4231.508,
    "text": "Garden of forking paths.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4232.048,
    "end": 4237.992,
    "text": "Is it in the system of the lipid membrane and the transport protein and the gradients?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4238.392,
    "end": 4243.175,
    "text": "It's like, nope, that still seems like a fairly no mind needed physical system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4243.335,
    "end": 4247.897,
    "text": "Okay, well now we're going to put some other bits of protein around it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4248.438,
    "end": 4248.938,
    "text": "And now we're going to,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4250.703,
    "end": 4256.106,
    "text": " verge towards biosemiotics with signaling at the membrane, but it's still a purely physical system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4256.606,
    "end": 4261.148,
    "text": "And so it's like you start building up and is there anything left to explain?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4261.528,
    "end": 4269.132,
    "text": "Is that reductionism to just sort of make everything literally reduced to the explanation of the chemicals?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4270.072,
    "end": 4281.939,
    "text": " And it reminds me of a Sapolsky article in 2004, where he says, if free will is lurking in the interstices of the brain, then the crawl spaces are getting smaller and smaller.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4282.64,
    "end": 4296.948,
    "text": "Because as we get tools that help us look closer and closer, we're finding there's less and less wiggle room, degrees of freedom, tilly-lally or whatever you called it, less and less of that potentially happening.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4297.97,
    "end": 4306.598,
    "text": " with deeper and deeper investigation and dissection, but are we just tearing something apart and not understanding how it's actually composed?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4307.198,
    "end": 4307.418,
    "text": "Blue?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4309.941,
    "end": 4315.285,
    "text": "So that just reminds me of going back to the live stream that we had with Mike Levin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4315.946,
    "end": 4318.789,
    "text": "It's like, if we are just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4319.944,
    "end": 4325.351,
    "text": " At any given point, our model essentially like dictates our action, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4325.411,
    "end": 4335.323,
    "text": "So under active inference, we have the degenerative model, the recognition model, and constantly these are updated based on what's happening in our world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4335.99,
    "end": 4344.199,
    "text": " can we in fact, or do we have a choice when presented with any given circumstances in life, in our environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4344.56,
    "end": 4352.548,
    "text": "Do we have a choice whether or not to steal a candy bar from a store or like random things that you think about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4353.809,
    "end": 4373.762,
    "text": " and this also goes to change your life and change your mind so it's only through like practicing piano do we learn to play piano but do I have any choice but to sit down and practice the piano given my existing model or and so is there like at what point where does free will come in like if",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4374.877,
    "end": 4400.633,
    "text": " right like does it play in and um mike's answer was awesome i think he said like no there's no free will but then he said okay there's some minuscule amount of free will that's non-zero but like the smallest possible non-zero number that you could have and so incrementally then you're able to affect changes on your model which then affect the decisions that you make given your model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4402.375,
    "end": 4417.309,
    "text": " so just two quick things then stephen so with a chaotic system with a big lyopunov exponent so small changes have non-linear effects all you need is a tiny tiny bit so let's not um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4417.869,
    "end": 4436.881,
    "text": " confused the fact that we have small potentially even infinitesimal or fractional free will whatever that means in the moment with our inability to have serious consequences through deep time because it is a chaotic massively interacting system and the second point is it's you mentioned like stealing something",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4438.277,
    "end": 4445.209,
    "text": " That 2004 paper with Zeki, Goodenough and Sapolsky is about the frontal cortex and the criminal justice system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4445.67,
    "end": 4449.496,
    "text": "And this paper is really fascinating because it's like, there's two modes to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4450.851,
    "end": 4466.675,
    "text": " just I believe centering on the American legal system, but replicated in many other cases, either somebody can be like a rational, sane actor, or they plead a defense, which basically amounts to being entirely incapacitated.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4467.135,
    "end": 4472.676,
    "text": "So like either you were fully, you should have known that the bank robbery would have gone this way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4472.696,
    "end": 4474.977,
    "text": "You should have really waited it out all the ways, or",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4477.426,
    "end": 4483.762,
    "text": " It was a situation of which there are multiple where you cannot be held to be responsible for the action, but we still need to...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4485.238,
    "end": 4487.98,
    "text": " It's not a get out of jail free card, but it is what it is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4488.64,
    "end": 4500.088,
    "text": "And so they're arguing for a more nuanced perspective that respects all the different timescales of changes that influence our decision-making.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4500.328,
    "end": 4505.411,
    "text": "So it's a really, and this is 20, almost 20 years ago.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4505.652,
    "end": 4511.836,
    "text": "So a lot has changed in neuroscience and in law and society, but this is a little bit of an older peep.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4512.596,
    "end": 4513.617,
    "text": "So Steven, then Dave.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4518.075,
    "end": 4522.516,
    "text": " Now I think this is a quite an interesting point that you're making here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4522.536,
    "end": 4530.077,
    "text": "I, on that slide, if you go back to that slide that has the mind on it, I'm just trying something here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.237,
    "end": 4532.878,
    "text": "If a little idea, I've just got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.838,
    "end": 4535.498,
    "text": "If, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4535.538,
    "end": 4540.139,
    "text": "So if I was to put life, you see this life there, put life over mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.159,
    "end": 4540.979,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.619,
    "end": 4544.3,
    "text": "So it's, I'll do actually, I just do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.46,
    "end": 4545.12,
    "text": "So it's like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.409,
    "end": 4547.829,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.929,
    "end": 4551.15,
    "text": "So say this is, I dunno, this is an idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.17,
    "end": 4567.073,
    "text": "So say you've got life as in the organisms body, and then you've got life in terms of the, the, the, the, the cognitive, um, neuronal life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.154,
    "end": 4574.455,
    "text": "And they're like, they're differentiated into two types of organism in the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.755,
    "end": 4603.572,
    "text": " the two organisms talk to each other and the boundary between the two talking to each other is mind as an emergent process something that is coming up as an idea very interactionist and relational and interfacial that maybe we shouldn't be looking for the reduced essence of atomic modular life but we should um relentlessly pursue it in the interfaces dave",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4607.49,
    "end": 4622.205,
    "text": " If mind is entirely a matter of memes, and memes need material processes to live in, and material processes need memes to keep themselves from falling apart, then things become a lot simpler.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4623.919,
    "end": 4626.84,
    "text": " But I actually want to make a comment on the insanity plea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4626.88,
    "end": 4634.204,
    "text": "I think it might have been Dershowitz who went back and looked at the statistics of successful and unsuccessful insanity pleas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4634.724,
    "end": 4641.988,
    "text": "And he found that when somebody is so completely berserk that you can't even begin to empathize with them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4642.426,
    "end": 4645.347,
    "text": " Juries say, he's just crazy, kill him.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4646.267,
    "end": 4660.131,
    "text": "But the places that people, the juries buy the insanity plea is the juror saying to himself, although he never quite comes out and says this, you know, under the circumstances, I could see killing the guy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4660.391,
    "end": 4661.031,
    "text": "That's all right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4661.111,
    "end": 4662.751,
    "text": "Whatever it takes to get him off.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4662.791,
    "end": 4663.732,
    "text": "You call that insanity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4663.772,
    "end": 4665.312,
    "text": "Okay, we'll get him off with insanity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4666.863,
    "end": 4669.185,
    "text": " So it's exactly the opposite of what you'd think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4669.225,
    "end": 4676.852,
    "text": "You know, the supposed Elizabethan argument that, well, the guy didn't know the difference between right and wrong, so you can't hold him responsible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4676.892,
    "end": 4678.694,
    "text": "American juries don't think that way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4681.777,
    "end": 4686.701,
    "text": "Big questions about what the legal system is for and what it does.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4686.721,
    "end": 4688.523,
    "text": "And then there's a question in the chat.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4690.353,
    "end": 4706.117,
    "text": " So just on to like the legal system, and I wasn't like meaning to start spawn this entire conversation with the stealing candy bar, but you know, so much of our creation of the model of the world occurs when we're young and in early development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4706.897,
    "end": 4716.039,
    "text": "And I think that, you know, at least in the States, the amount of unacknowledged childhood trauma that happens",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4717.423,
    "end": 4719.824,
    "text": " for poverty and for drug abuse reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4719.884,
    "end": 4725.627,
    "text": "I mean, there's an infinite number of reasons that people undergo some kind of abuse as a child.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4726.347,
    "end": 4733.35,
    "text": "All of that like really contributes to how well you're gonna function in society in later in life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4733.65,
    "end": 4734.631,
    "text": "And I don't think like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4735.191,
    "end": 4752.711,
    "text": " While there are people that plead insanity and there are some cases of severe abuse and whatever where the people get off, but so many of the people that are in our prison systems and go through juvenile systems have these horrible early experiences that really are...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4754.552,
    "end": 4756.933,
    "text": " happening when their model of the world is being solidified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4757.553,
    "end": 4766.537,
    "text": "And so for me, it really, it explains a lot of the choices that are made by people in those circumstances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4768.909,
    "end": 4785.702,
    "text": " it's helpful to think about it in terms of a trajectory we're not just um maybe taking a snapshot moment and just doing a snap judgment but we want a trajectory of healing and of um health steven and then dave and then we'll ask the question",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4787.133,
    "end": 4808.96,
    "text": " Yeah, this idea, because we talk about people being out of their mind, you know, and in some ways, like you say, if someone has an experience or something or some biological condition, the idea is that it's like, I suppose the biological architecture means that the person's ability to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4810.718,
    "end": 4814.799,
    "text": " mindfully choose isn't there in some ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4814.879,
    "end": 4830.703,
    "text": "It's almost like the, yeah, either the, the somatic priors are so skewed or the, uh, the, the mental architecture is so distorted that a coherent mind isn't available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.623,
    "end": 4833.183,
    "text": "Thanks Steve.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4835.424,
    "end": 4839.225,
    "text": "I met a lawyer, um, who worked with the, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4841.069,
    "end": 4846.952,
    "text": " criminal justice system in Chicago on child abuse cases.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4847.752,
    "end": 4856.977,
    "text": "And she found a huge number of these cases of serious abuse, like a three-month-old being put out on a fire escape in the middle of winter to toughen him up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4858.497,
    "end": 4865.361,
    "text": "And, you know, instead of just saying, oh, this is so horrible, you've got to put the mother in prison, they interviewed her and said, well, what do you do with babies?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4865.481,
    "end": 4867.161,
    "text": "And she had no idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4867.181,
    "end": 4870.383,
    "text": "She had never seen even minimally competent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4871.42,
    "end": 4895.266,
    "text": " child rearing from anybody and they found you explain to these folks and you give them you know the the supplemental education to understand why middle class people treat babies a certain way they think that's great oh that makes sense i just didn't know you could do that i thought you had to beat them they wouldn't stop crying if you don't beat them okay",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4895.968,
    "end": 4920.974,
    "text": " and say you know you put them on a long time probation that is not punitive at all it's just so you can keep track of them and keep the education going and keep them away from the crazies and she says it was working extraordinarily well thanks so here's a question from the chat i'll read the question and then i'll read one response in the chat already and then um anyone can jump in and we have some slides that speak to this so joseph wrote",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4922.386,
    "end": 4933.351,
    "text": " Could the extent of how conscious something is be measured on the basis of how far ahead in time an organism, cell, creature can plan or minimize expected free energy?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4933.971,
    "end": 4934.211,
    "text": "And then...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4936.226,
    "end": 4947.497,
    "text": " I know that some people will probably have things to say on that, but Tucker in the chat wrote, under this idea, then might the entropy chaoticness of the environment influence the degree of consciousness of a system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4948.078,
    "end": 4954.685,
    "text": "A more dynamic system or environment would require a more adaptive agent in order to maintain negentropic coherence through time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4955.425,
    "end": 4957.968,
    "text": "The more entropy, the need for a better model,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4959.941,
    "end": 4974.719,
    "text": " super interesting questions and responses so i guess just uh glancing off of that uh legal and choice discussion into more broader questions it's so fascinating how",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4975.822,
    "end": 4990.354,
    "text": " especially if we're going to be locating function in the interface between the agent and the environment, maybe depending on whether you're in an unmarked room or a very interactable space, consciousness is going to be different.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4990.434,
    "end": 4991.755,
    "text": "Are you more or less aware?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4991.775,
    "end": 5000.623,
    "text": "And then the other piece that comes to mind, and then Stephen and then anyone else, is from Livestream 25, Computational Boundary of a Self.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5001.773,
    "end": 5005.695,
    "text": " And there's the past and then there's the future below.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5006.196,
    "end": 5012.399,
    "text": "And so the past cone is kind of like the depth and the breadth of what has influenced the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5013.179,
    "end": 5017.542,
    "text": "And then the future cone is about the scope of planning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5018.142,
    "end": 5024.346,
    "text": "So it's a really interesting question about temporal horizon, but is it enough to just plan deeply?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5024.886,
    "end": 5030.589,
    "text": "Like if you just plan sparsely, but deeply over a hundred years versus a very rich system",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5030.629,
    "end": 5058.723,
    "text": " plan very thick plan for 10 minutes which one of those is there going to be a single currency that describes or compares those two how do we think about planning in heterogeneous systems that have different affordances or have different complexities of their internal generative model so there's a lot of great questions in this area steven then anyone else yeah these are really good questions um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5059.844,
    "end": 5069.868,
    "text": " I suppose if we're looking at measures, I mean, there's also this interesting question of not necessarily what you're able to do, but how far you're able to get with what you're not able to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.369,
    "end": 5085.555,
    "text": "Like when someone's really working hard cognitively, it's like, I mean, you know, if I want to predict what the inside of a jar is going to be like, I can just boil the liquid and it becomes sterile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5085.595,
    "end": 5087.376,
    "text": "And I know it would be like that for a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.343,
    "end": 5103.389,
    "text": " Um, the question becomes when you've got these intractable kind of multifaceted things, a bit like what's going to happen to a collection of family members when they all meet together for Thanksgiving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.589,
    "end": 5103.869,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5104.529,
    "end": 5110.712,
    "text": "Um, this, that, that, that, that temple depth is, is definitely a good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.952,
    "end": 5116.074,
    "text": "And I suppose there's, there's that question of, um, how to penetrate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5117.978,
    "end": 5123.439,
    "text": " time when it's hard to penetrate as much as how much are they able to plan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.479,
    "end": 5126.26,
    "text": "But I'm sure the two things are linked and you could do both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.741,
    "end": 5129.941,
    "text": "Lou?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5130.301,
    "end": 5130.981,
    "text": "And then I'll have a thought.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5133.342,
    "end": 5136.582,
    "text": "Give your thought first, Daniel, because I'm going to go on a tangent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5137.063,
    "end": 5137.303,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5137.503,
    "end": 5146.525,
    "text": "I wanted to connect it to the paper that we're allegedly discussing and this user resource and mirror and adaptive active inference",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5147.628,
    "end": 5169.046,
    "text": " model so on the unidirectional the left side you have like a more adaptive agent it's here a spider and then you have this less adaptive but doing mere active inference like a web okay so it's like a person with a thermometer or a spider with their web versus this reciprocal case where on both sides of the table there's a user",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5170.168,
    "end": 5180.656,
    "text": " And then we've heard before about how the time horizon of planning relates to the depth or the quality of the conscious experience.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5180.776,
    "end": 5194.386,
    "text": "For example, the 2018 Alias interview with myself and Martin and Carl Fristen in the final question, he even talks about the temporal scope and the existence of counterfactuals as being relevant for generating consciousness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5195.126,
    "end": 5196.767,
    "text": "So then it made me wonder,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5197.748,
    "end": 5204.01,
    "text": " What if by going reciprocal multi-integration, you actually shorten the timescale of planning?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5204.51,
    "end": 5209.972,
    "text": "Like if I'm going to set out a buffet for myself, it might take hours of planning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5210.732,
    "end": 5216.294,
    "text": "And so there's a lot of mere active inference happening on the stovetop, but it's a very complex process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5216.534,
    "end": 5220.756,
    "text": "One user and it takes hours of planning, but then to cook with a friend,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5221.724,
    "end": 5223.965,
    "text": " might be just a minute of planning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5224.265,
    "end": 5225.926,
    "text": "We're going to agree to cook together.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5226.626,
    "end": 5241.334,
    "text": "And so actually the temporal explicit depth of planning in an improvisational or interactionist context, the depth drops potentially because you might not need to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5242.856,
    "end": 5246.597,
    "text": " explicitly prepare for so many counterfactuals.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5247.557,
    "end": 5250.777,
    "text": "And it's not like you're just moving pieces on the chessboard.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5251.418,
    "end": 5256.959,
    "text": "You just need to take that first step, listen to what they're going to say, then think about what your response is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5257.059,
    "end": 5269.061,
    "text": "So then that almost challenges the simple time horizon or counterfactual basis of cognition or phenomenology, because",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5270.541,
    "end": 5291.629,
    "text": " and it's such a helpful distinction made by matt that i know we're going to use in other papers and research that these are really different kinds of systems this left system is stigmergic and it's still a collective system with immersion properties but then this kind of double stigmergy interactionism brings us into a new territory that's very important to delineate stephen",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5293.829,
    "end": 5305.676,
    "text": " yeah this and this takes us into that realm of sense making different types of sense making because it's action yeah being able to act and interact in appropriate ways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5306.784,
    "end": 5311.745,
    "text": " And in many ways, the more appropriate ways can be stimulated by things in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5311.845,
    "end": 5322.168,
    "text": "I mean, the fact that we have a very expressive face in a way puts our face out there as something we can inscribe and use in that process, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5322.188,
    "end": 5323.729,
    "text": "We just look at each other's faces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.491,
    "end": 5328.912,
    "text": " Now, for the psychology in the world, no one quite knows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.713,
    "end": 5331.773,
    "text": "It's all interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5332.293,
    "end": 5338.375,
    "text": "But the thing that I think this really highlights is the game in town is action policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5339.076,
    "end": 5347.938,
    "text": "The game isn't for us to walk around as humans with big cognitive capacities on the top of our skull or in our skull.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5348.419,
    "end": 5352.38,
    "text": "The game is that we can interact and sense make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5353.36,
    "end": 5376.762,
    "text": " um the ability to like you say to plan on our own is um is a nicety but actually it's been a bit of a we could say a wrong turn for the last 200 years because it's all been about thinking as being the game and feelings being this kind of artifact that we've",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5377.526,
    "end": 5385.332,
    "text": " we try and minimize as some sort of side product that somehow, you know, a weakness of the human mind or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5385.492,
    "end": 5391.297,
    "text": "And it's so far from the truth because it's pretty much what it was like before we took that wrong turn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5391.317,
    "end": 5393.899,
    "text": "It's actually about how to act and feel in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.019,
    "end": 5395.66,
    "text": "So this is a good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.541,
    "end": 5397.062,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5397.242,
    "end": 5397.402,
    "text": "Blue?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5399.286,
    "end": 5411.874,
    "text": " So I'm going to go off on my tangent now, but I really just want to address the first question in the chat about how consciousness relates to our ability to plan and how far out that we plan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5412.275,
    "end": 5421.321,
    "text": "And so I'm reminded of, and maybe Daniel, you can help me remember if it was deeply felt affect or sophisticated active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5421.881,
    "end": 5424.183,
    "text": "But in one of those papers, we talked about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5426.334,
    "end": 5431.976,
    "text": " actually anxiety as trying to plan too far out in the future, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5431.996,
    "end": 5439.038,
    "text": "So if you're trying to plan too many time steps ahead, then that, that is like the cause of a neuro atypical situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5439.578,
    "end": 5441.138,
    "text": "So I'm not sure I will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5441.178,
    "end": 5448.96,
    "text": "And then I think that they said that maybe depression was staying too many steps behind or thinking about too many steps in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5449.36,
    "end": 5450.801,
    "text": "So, so thinking about, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5452.285,
    "end": 5455.541,
    "text": " And so my takeaway from that was staying in...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5456.823,
    "end": 5458.023,
    "text": " the present moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5458.904,
    "end": 5476.089,
    "text": "And so I don't know that the, that, um, just briefly to respond to Steven's comment, I don't know that, um, having this big cognitive, um, giant capacity, giant cognitive capacity is for interacting as much as it is for adapting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5476.109,
    "end": 5482.511,
    "text": "Um, because humans like cockroaches adapt to, you know, infinite circumstances, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5482.871,
    "end": 5487.214,
    "text": " We live on all or are present on all continents in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5487.354,
    "end": 5494.539,
    "text": "And I mean, even Antarctica, there's some research scientists there right now, I'm sure digging holes in the glaciers to find out how much our ocean is going to rise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5494.619,
    "end": 5496.92,
    "text": "I hope that somebody is there doing that anyway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5497.621,
    "end": 5500.462,
    "text": "I'm not sure who's funding that research, but but hopefully somebody is doing that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5500.943,
    "end": 5502.284,
    "text": "So I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5502.304,
    "end": 5505.906,
    "text": "I think it's more adaptive, the cognitive capacity than than anything else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5507.836,
    "end": 5519.063,
    "text": " And so good throwback there with the sophisticated and deep active inference and the anxiety, the parametric investigations of anxiety that we've been on before.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5519.743,
    "end": 5524.386,
    "text": "And one day when we have better keyword indexing, if anyone is passionate about this,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5525.026,
    "end": 5543.027,
    "text": " They should collaborate with us because how cool would it be to have deeply, richly indexed keywords for these papers and artifacts and discussions and have them translated into multiple human languages and computer languages and graphics so that we can be really clear.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5544.248,
    "end": 5562.345,
    "text": " um so i mean there's a lot to say here and the only other throwback that i was going to add in was to way long ago in number 29 active in for ants we talked about the scaling relationship of the ant brains with a larger colony having a proportionally smaller ant brain",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5562.665,
    "end": 5574.655,
    "text": " Whereas larger mammalian societies have larger mammalian brains because mammalian sociality has to do with like memory of repeated interactions and theory of mind and the facial recognition, all these things that we're talking about here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5575.235,
    "end": 5583.722,
    "text": "Whereas potentially colony organismality means that the increased scope or ability",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5584.366,
    "end": 5603.433,
    "text": " capacity of the colony can occur over evolutionary times through a diminution of the scope or of the cognitive processing on board each ant so joseph's question it's sort of it's just such a great question so thanks again for asking it because we can sort of look at it at the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5604.465,
    "end": 5612.953,
    "text": " I mean, it's even asked across scales, but what if like the cell plans less because it's part of a high trust system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5613.554,
    "end": 5619.02,
    "text": "So now the beta cell in the pancreas doesn't have to have a deep temporal model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5619.2,
    "end": 5621.742,
    "text": "Its temporal model just has to be like one step.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5622.583,
    "end": 5628.225,
    "text": " but it's playing a role in a system that now has a circadian regulation of sleep or a blood sugar.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5628.965,
    "end": 5646.492,
    "text": "And so where do we ascribe consciousness or awareness or cognitive possibility across different systems, which again brings us back to from 25, these nested cones of cognition and their different shapes and their attributes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5647.012,
    "end": 5647.212,
    "text": "Blue?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5649.196,
    "end": 5655.724,
    "text": " I just wanted to shout out to Tucker as I was like, I don't know, drawing this big thing with the last question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5656.104,
    "end": 5661.19,
    "text": "So Tucker actually made the link between consciousness and adaptivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5661.25,
    "end": 5662.532,
    "text": "And I kind of just stole it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5662.552,
    "end": 5664.174,
    "text": "I stole all the thunder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5665.254,
    "end": 5669.157,
    "text": " But really, and are those two things linked, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5669.217,
    "end": 5677.022,
    "text": "So planning very far in the future versus having the ability to respond to whatever comes your way in one time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5677.462,
    "end": 5678.683,
    "text": "Those are really different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5678.723,
    "end": 5682.365,
    "text": "Like one seems very rigid and the other seems very fluid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5683.115,
    "end": 5693.48,
    "text": " And Tucker actually kind of used consciousness and adaptivity interchangeably, which is an interesting connection and thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5694.541,
    "end": 5700.784,
    "text": "I don't know, maybe resilience and that adaptivity is kind of what I would use, but it's interesting to think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5700.804,
    "end": 5703.665,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5706.092,
    "end": 5727.183,
    "text": " yeah and also i like that point you're making and suppose it ties with that adaptivity about the pancreas um you know you if you've got the pancreas gives you the affordance of modulating stuff in the body as do these other organs but like you say these cells and if i have a crude or multiple ways of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5729.064,
    "end": 5742.583,
    "text": " mindfully or livingly, I don't know if that's a word, adapting that, you can do something, but you got no pancreas or you got no cells that give you an affordance to actually change it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5742.884,
    "end": 5743.645,
    "text": "You can have all the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5744.466,
    "end": 5765.163,
    "text": " computational cognitive modeling whatever it is you can't do anything it's literally a conceptual framework without any way to do that sort of control so you know the more important thing is to have something which can follow through at these across the scales",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5766.323,
    "end": 5776.84,
    "text": " and change how they are maybe cybernetically integrated than it is to have the, like I say, it's not all about cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5776.98,
    "end": 5779.304,
    "text": "It's about action policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5779.685,
    "end": 5780.927,
    "text": "And I think that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5783.416,
    "end": 5800.473,
    "text": " so earlier we had just those three right just cognition agency and autonomy and then that was um being inspired by just some of the quotes from the paper where those terms were used but we're thinking about that three",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5801.374,
    "end": 5808.976,
    "text": " Then we've talked about like adapting and being flexible and learning over developmental as well as evolutionary timescales.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5809.636,
    "end": 5813.857,
    "text": "We can think about the past and the future, like the time cone illustration.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5814.497,
    "end": 5816.258,
    "text": "To what extent does memory matter?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5816.278,
    "end": 5823.179,
    "text": "I mean, can you have a memoryless awareness or is awareness requiring memory?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5823.699,
    "end": 5826.68,
    "text": "Or can you have awareness without planning?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5828.618,
    "end": 5831.159,
    "text": " Some meditation practices might lead one to think so.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5832.539,
    "end": 5833.879,
    "text": "Or is planning vital?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5835.619,
    "end": 5837.52,
    "text": "What about the capacity for interaction?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5837.86,
    "end": 5848.942,
    "text": "If we don't have interactions highlighted, paging Dean, are we falling victim into a modular reductionist nightmare?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5850.022,
    "end": 5852.763,
    "text": "Or how do we hold interactionism,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5854.269,
    "end": 5854.85,
    "text": " at every step.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5855.49,
    "end": 5863.237,
    "text": "What about kind of complex systems properties like resilience or anti-fragility or hysteresis, phase transitions?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5863.957,
    "end": 5866.699,
    "text": "Those are descriptors of various systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5867.54,
    "end": 5869.902,
    "text": "And are those just coming along for free with these?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5870.483,
    "end": 5872.304,
    "text": "Do they grant the ability for these?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5872.404,
    "end": 5874.246,
    "text": "Are they correlated dimensions?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5874.446,
    "end": 5875.767,
    "text": "Are they uncorrelated?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5876.407,
    "end": 5876.608,
    "text": "And then",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5878.588,
    "end": 5907.829,
    "text": " the million dollar question maybe we need to scale that for inflation you know the 10 bitcoin question where does consciousness come into play and is that something we can ever get a handle on or is consciousness always going to be at the fringes of our explanations and some of these more accessible or opaque features will be amenable to quantitative descriptions whereas this um might be always in a different category so blue",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5910.478,
    "end": 5912.522,
    "text": " Well, I think that they're quantifying consciousness already.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5913.183,
    "end": 5918.233,
    "text": "But memory is really what I wanted to talk about here, the keyword that's on this list.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5918.313,
    "end": 5918.594,
    "text": "And so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5919.815,
    "end": 5922.437,
    "text": " I mean, I don't know, I think about memory, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5922.477,
    "end": 5933.847,
    "text": "Like there's the ROM and there's the RAM and is memory or to what degree is memory required for a generative model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5934.567,
    "end": 5942.594,
    "text": "And so I just wonder, like, I mean, all of the experiences contribute to the formation of the model and what is contained in the model is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5944.095,
    "end": 5945.896,
    "text": " effectively like our action course?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5945.936,
    "end": 5947.357,
    "text": "I mean, what's in the generative model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5947.377,
    "end": 5947.958,
    "text": "Does anyone know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5948.938,
    "end": 5952.62,
    "text": "I think about it like what is the action?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5952.7,
    "end": 5956.042,
    "text": "I think about it like an action course or like the response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5956.683,
    "end": 5956.923,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5956.943,
    "end": 5959.965,
    "text": "I'd love to hear what other people think is in the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5960.205,
    "end": 5961.046,
    "text": "What's inside of that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5962.186,
    "end": 5964.788,
    "text": "And also whether or not memory is required.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5966.569,
    "end": 5966.809,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5969.082,
    "end": 5972.844,
    "text": " I think this also, you can bring in there, affordances coming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5972.864,
    "end": 5977.665,
    "text": "So like you say, interaction capacity with affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5979.066,
    "end": 5988.17,
    "text": "I suppose you could say memory is an interaction capacity with the affordances to whole priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5988.55,
    "end": 5990.871,
    "text": "So there's an interesting sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5999.813,
    "end": 6023.506,
    "text": " dynamic here between these processes and the affordances and normally affordances are well for practical purposes are normally thought of or used in terms of something a bit more concrete and at the human scale but when it kind of is multi-scale as well isn't it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6025.458,
    "end": 6031.324,
    "text": " You know, if we're gonna talk about mental action and thought as mental planning, then absolutely,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6032.711,
    "end": 6037.214,
    "text": " there are mental affordances in the model as formalized by Sanved Smith and others.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6038.054,
    "end": 6041.456,
    "text": "And then to Blue's memory question about where it's related to the generative model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6042.056,
    "end": 6044.558,
    "text": "So I thought of a few different options, not exhaustive.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6045.118,
    "end": 6055.504,
    "text": "So the generative model could have an implicit onboard memory like that D prior, that could just be a summary variable that summarizes memory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6055.824,
    "end": 6061.608,
    "text": "So you can just say the past moments temperature, here's my prior on the past moments temperature, or",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6062.839,
    "end": 6068.765,
    "text": " the past sequence of temperatures could be explicitly represented as like, kind of like a list or a vector.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6069.145,
    "end": 6080.235,
    "text": "So there could be onboard memory, like within the internal states, the internal generative model of the active inference agent could either have just sort of a snapshot summary, implicit memory,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6080.836,
    "end": 6082.238,
    "text": " which is good enough in many cases.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6082.338,
    "end": 6089.787,
    "text": "So we might just model it as if anyway, or there could be this explicit, just like a policy is a sequence of actions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6090.028,
    "end": 6096.015,
    "text": "You could have a multi-time step prior over previous states, AKA memory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6096.616,
    "end": 6098.318,
    "text": "But then the other thing",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6099.446,
    "end": 6104.189,
    "text": " Option is like this extended or stigmergic memory with a recognition model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6104.489,
    "end": 6109.332,
    "text": "Like, do I remember what I looked like at that one family dinner when I was three?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6110.333,
    "end": 6110.613,
    "text": "No.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6110.813,
    "end": 6112.274,
    "text": "Would I recognize the picture?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6113.174,
    "end": 6113.535,
    "text": "Yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6113.995,
    "end": 6115.876,
    "text": "Would I know where to look for the picture?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6116.336,
    "end": 6116.656,
    "text": "Yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6117.457,
    "end": 6117.857,
    "text": "Physically?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6118.177,
    "end": 6119.278,
    "text": "What about asking somebody?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6119.478,
    "end": 6126.643,
    "text": "So we're thinking, okay, affordances, social affordances, spatial temporal location of extended cognitive process, recognition model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6127.363,
    "end": 6128.564,
    "text": "But do I remember that?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6129.799,
    "end": 6137.465,
    "text": " or am I merely remembering or preferring certain affordances that bring me to the edge of that abyss?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6138.106,
    "end": 6142.949,
    "text": "And then the recognition model takes over once the picture has been physically presented.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6143.41,
    "end": 6144.27,
    "text": "That's the stigmergy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6144.851,
    "end": 6148.073,
    "text": "And then just using Matt's distinction,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6149.178,
    "end": 6151.5,
    "text": " There's you in the photo library.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6151.86,
    "end": 6156.264,
    "text": "That's the unidirectional multi-scale inference integration.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6156.904,
    "end": 6160.527,
    "text": "And then there's the conversation where we actually spur each other's memory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6161.488,
    "end": 6167.893,
    "text": "And that's where we get that sort of next level of reciprocal integration to kind of bring it back to that idea.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6168.073,
    "end": 6168.293,
    "text": "Blue?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6170.202,
    "end": 6173.985,
    "text": " Really nice with the extended stigma G recognition model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6174.585,
    "end": 6182.471,
    "text": "Um, and, and I think that like, there's some like Ram, some kind of Ram is required for any generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6182.511,
    "end": 6188.675,
    "text": "Like, like I think about the generative model a lot, like the software that we're running and in order to have software, you have to have some Ram.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6189.456,
    "end": 6193.599,
    "text": "Um, but, but is the long-term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6194.875,
    "end": 6196.997,
    "text": " Memory required also?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6197.017,
    "end": 6205.302,
    "text": "Or is the long-term memory just what goes into creating the generative model and then all of that can be forgotten?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6205.583,
    "end": 6210.606,
    "text": "And when I'm thinking about that, I'm thinking about people that have lost their memory for whatever reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6211.707,
    "end": 6215.249,
    "text": "So cases of amnesia, like the person can't remember anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6215.269,
    "end": 6217.471,
    "text": "I think about the old movie Memento.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6217.901,
    "end": 6222.305,
    "text": " And every day I can't remember anything, I can't remember anything, but I still know how to brush my teeth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6222.705,
    "end": 6227.869,
    "text": "Or I still know when I wake up in the morning, I need to brush my teeth, or I need to shower, or I remember what food is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6228.67,
    "end": 6231.432,
    "text": "So I don't need to try this or that to see if it's edible again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6231.452,
    "end": 6238.217,
    "text": "So there's some things that are maybe stored in the generative model, and maybe some things are irrelevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6240.359,
    "end": 6240.799,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6240.92,
    "end": 6241.22,
    "text": "Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6244.142,
    "end": 6245.884,
    "text": "Yeah, this ties into...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6248.888,
    "end": 6252.189,
    "text": " the action policies of remembering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.589,
    "end": 6271.233,
    "text": "Like, if all memories is an act of imagination, is an act of recapitulation, then what needs to be present, as you're saying, is a way to evoke affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6271.633,
    "end": 6274.614,
    "text": "And you could say that the affordances of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6275.991,
    "end": 6297.888,
    "text": " remapping sensory states you know maybe where you look with your eyes and maybe when someone's amnesic it's not that they haven't got the priors or the knowledge they haven't got the action capacity to recapitulate from whatever priors were there i mean this is a bit speculative but uh anyway",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6299.218,
    "end": 6310.909,
    "text": " It reminds me of the neuroscience on taxi drivers and spatial reasoning and general relationships between spatial memory and practice there and cognitive",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6311.823,
    "end": 6338.548,
    "text": " capacity and preventing cognitive decline and memory palaces like memory palace is kind of this weird quirk i mean how weird you can imagine a place with file cabinets and walk around it and have stories about that place and remember you know pi to 5 000 digits or remember the iliad how weird oh wait mental action spatial cognition narratives of action it's like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6339.81,
    "end": 6351.793,
    "text": " you can build that physical palace and have the photos there, or you can update your generative model to include a spatial context where those cues exist.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6352.754,
    "end": 6356.895,
    "text": "And so it's just a very interactionist way of thinking about",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6358.132,
    "end": 6360.333,
    "text": " architecture, including mental architectures.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6360.973,
    "end": 6362.634,
    "text": "Like you just need to have the exit sign.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6362.814,
    "end": 6366.395,
    "text": "And then when somebody wants to leave, they're going to recognize it and walk towards it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6366.495,
    "end": 6368.816,
    "text": "And then the next step will be there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6369.476,
    "end": 6373.598,
    "text": "And so the architect puts the next step there safely and accordingly to function.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6374.038,
    "end": 6380.501,
    "text": "But when we're the interior mental designer or architect, we can make spaces that also prompt us.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6381.221,
    "end": 6385.443,
    "text": "And so it's not like we're storing the memory itself in that location.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6386.348,
    "end": 6395.976,
    "text": " were remembering a very compressed version of the cues that interact with us to then generate upon demand.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6396.597,
    "end": 6396.837,
    "text": "Steven?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6398.803,
    "end": 6416.972,
    "text": " Yeah, that's a good example, the memory palace, because is the question that when something's laid down in such a palace, if you go to visit the palace and you get this, whatever sensory cues that come up, it's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6419.621,
    "end": 6423.764,
    "text": " it's solid enough that you will come back up with a particular answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6423.925,
    "end": 6424.405,
    "text": "You know what I mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6424.425,
    "end": 6427.547,
    "text": "You will remember X, Y, and Z from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6427.988,
    "end": 6436.835,
    "text": "So it appears like you've remembered the thing, so to speak, but actually it's just that that combination of Bayesian inferences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6437.998,
    "end": 6442.559,
    "text": " will lead you to act to recapitulate it in the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6443.16,
    "end": 6446.481,
    "text": "Now, obviously, the average person can't do it as well as these trained experts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6446.841,
    "end": 6450.502,
    "text": "And they can actually do it in a very sophisticated way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6452.222,
    "end": 6464.446,
    "text": "Because in terms of pure floating ideas, it's that whole, they say, six plus or minus one is all you can keep in your brain at any one time in terms of just a concept that's floating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6465.867,
    "end": 6471.392,
    "text": " But obviously that isn't what's the case when you can start to use memory palaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6471.452,
    "end": 6473.814,
    "text": "So it's a very different thing going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6475.916,
    "end": 6485.104,
    "text": "It reminds me of one class as we go to our closing notes, a class where just each week the homework and class was to memorize a poem and then recite it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6485.865,
    "end": 6488.868,
    "text": "That's kind of how education has often proceeded.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6489.588,
    "end": 6490.489,
    "text": "And it's something that...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6491.77,
    "end": 6510.77,
    "text": " is just fundamental for oral cultures and has been a skill that is less emphasized in literate cultures and uh there's that dense cross-linking of like rhyme and narrative and tonality and rhythm so that you really don't need to keep",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6511.791,
    "end": 6528.111,
    "text": " 50 things or 80 lines in your working memory in your ram with a computationalist metaphor what is being remembered or recalled or prompted and that investigation well if it's not being just stored as a text file what is it",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6529.099,
    "end": 6541.213,
    "text": " And then it's just so cool how it dovetails very nicely with deontic cues and ostentative cues in active inference and conversational theory and a lot of other areas.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6542.074,
    "end": 6544.257,
    "text": "Blue, and then we'll have last comments here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6546.334,
    "end": 6552.778,
    "text": " So just what you guys were both talking about reminded me of Cal Newport's book, Deep Work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6553.018,
    "end": 6555.399,
    "text": "If you haven't read it, I highly recommend it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6555.459,
    "end": 6555.899,
    "text": "It's awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6556.319,
    "end": 6566.085,
    "text": "But in that book, he talks about creating a memory palace and learning how to memorize a deck of cards as an old skill that people just don't have anymore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6566.465,
    "end": 6570.467,
    "text": "So you construct the memory palace, you learn to have a set of cards, memorize a set of cards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6570.967,
    "end": 6571.868,
    "text": "So you can literally...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6572.308,
    "end": 6589.554,
    "text": " memorize 52 things in your memory palace anytime so you can memorize the order of a deck of cards just like he says to build this as a skill because it's enhancing of memory and I wonder if this isn't going to be something you know as we're becoming more and more illiterate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6590.715,
    "end": 6596.102,
    "text": " which is, it's an interesting, I think we've reached like the crescendo of literacy, at least in the US.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6597.304,
    "end": 6601.569,
    "text": "And have we reached this crescendo because of technologies like this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6601.97,
    "end": 6603.432,
    "text": "Like, I don't need to read that paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6603.452,
    "end": 6606.175,
    "text": "I'm just gonna listen to this group of people talk about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6607.636,
    "end": 6611.277,
    "text": " and get the key points out of the paper and their summary and their discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6611.317,
    "end": 6614.057,
    "text": "And then I'll have some interesting things to say about that paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6615.057,
    "end": 6622.459,
    "text": "And so is it art kind of technology that's paving the way for illiteracy again and will memory become increasingly important?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6622.499,
    "end": 6625.519,
    "text": "It's great to think about and I'll just give my final thought here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6625.959,
    "end": 6634.441,
    "text": "Thanks for the interesting discussion today and to Matt also for the provocative paper and I'm looking forward to reading and discussing more of his work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6636.357,
    "end": 6636.937,
    "text": " Thanks, Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6637.478,
    "end": 6639.679,
    "text": "Stephen or Dave, any last comments?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6641.68,
    "end": 6642.36,
    "text": "Yeah, I do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6642.46,
    "end": 6644.521,
    "text": "Quickly, thank you again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6644.621,
    "end": 6645.802,
    "text": "Really good conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6645.902,
    "end": 6650.124,
    "text": "And yeah, I think there's definitely something here around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6652.321,
    "end": 6654.662,
    "text": " Maybe the idea of adjacent possibles as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6654.903,
    "end": 6659.325,
    "text": "So was there something about the memory palace that one thing is then an adjacency to the next thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6659.905,
    "end": 6666.689,
    "text": "When you have to hold something on its own, it's going to have to be supported by its own infrastructure, I suppose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6667.13,
    "end": 6668.49,
    "text": "And that's quite an overhead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6670.071,
    "end": 6677.936,
    "text": "So yeah, because there's also this thing of how long you can hold something in your memory without having a way to ground it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6678.98,
    "end": 6684.288,
    "text": " it just sort of fizzles maybe for some people quicker than others, but so yeah, all very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6684.328,
    "end": 6688.754,
    "text": "I'll have to go back and think I was a number of points came up here that we could expand on in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6689.715,
    "end": 6690.456,
    "text": "Thank you, Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6690.897,
    "end": 6692.499,
    "text": "Dave, any last comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6694.895,
    "end": 6697.677,
    "text": " Nope, just got to follow up on these references.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6697.717,
    "end": 6698.197,
    "text": "Thanks all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6698.717,
    "end": 6699.098,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6699.178,
    "end": 6707.483,
    "text": "Well, to Matt Sims for writing this great paper and joining our .1 and watching the .0.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6708.183,
    "end": 6713.507,
    "text": "For Dave and Blue and Steven for joining and for helping in different ways on the .0.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6714.187,
    "end": 6716.629,
    "text": "That brings us to the end of...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6718.467,
    "end": 6745.07,
    "text": " 30.2 and next week's at this same time we're going to be in 31 non-equilibrium thermodynamics and the free energy principle in biology by patricia palacios and mateo colombo so at least one author will join at least one week uh stay in touch let us know if you want to join for 31 or beyond and see you all later",
    "speaker": "SPEAKER_06"
  }
]