[
  {
    "start": 0.09,
    "end": 0.452,
    "text": " It's life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.157,
    "end": 11.198,
    "text": " Okay, it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.378,
    "end": 14.059,
    "text": "Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.239,
    "end": 17.561,
    "text": "Thank you to joining the Active Inference Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.661,
    "end": 22.023,
    "text": "It is October 1st, 2021 and I'm Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.123,
    "end": 32.247,
    "text": "I'm here with Blue and we're going to be talking about this paper, How to Count Biological Minds, Symbiosis, the Free Energy Principle, and Reciprocal Multiscale Integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.148,
    "end": 34.709,
    "text": "Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.782,
    "end": 41.085,
    "text": " We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.626,
    "end": 43.747,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.808,
    "end": 50.011,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can be improving our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.952,
    "end": 56.676,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for livestreams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.457,
    "end": 64.02,
    "text": "We are heading into October and the number 30 paper about biological minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.997,
    "end": 74.989,
    "text": " We currently have the author Matt Sims scheduled to come on the October 5th discussion, and then we'll have the 30.2, another participatory group discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.409,
    "end": 82.798,
    "text": "So check out the calendar here, as well as these other series if you want to join or suggest somebody who we can invite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 84.858,
    "end": 93.027,
    "text": " Today in Actum stream number 30.0, the goal is to learn and discuss this paper, How to Count Biological Minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.588,
    "end": 96.43,
    "text": "And it's by Matthew Sims.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.73,
    "end": 100.294,
    "text": "It's from 2020 in the journal Synthese.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.523,
    "end": 111.692,
    "text": " And just like all the other .Zero videos, this is just an introduction to some of the ideas, some background that Blue and I whipped together literally leading up to the time of now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.153,
    "end": 117.137,
    "text": "So it's just an introduction, and if you want to go deeper into an idea, then come to the discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.038,
    "end": 123.681,
    "text": " We're going to go over the aims and claims abstract roadmap of the paper and then the figures and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 124.862,
    "end": 127.804,
    "text": "So let's just get started with the introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.304,
    "end": 128.924,
    "text": "Greetings, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.044,
    "end": 131.886,
    "text": "And what makes you excited about this paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.627,
    "end": 144.613,
    "text": "You know, Daniel, I'm always interested in studying intelligence and how that scales from the subcellular to the systemic ecosystem level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.24,
    "end": 158.75,
    "text": " And so this is kind of an interesting take, and it echoes a lot of what we talked about in the discussion of Mike Levin's paper, The Computational Boundary of the South, back in July.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.85,
    "end": 171.6,
    "text": "So I was excited that Matthew agreed to come on the livestream, and I've been excited about this paper just because it takes active inference, the multi-scale aspect of active inference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.558,
    "end": 175.486,
    "text": " in a really enhanced integrative direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.669,
    "end": 177.029,
    "text": "How about you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.07,
    "end": 177.551,
    "text": "What did you like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.281,
    "end": 191.35,
    "text": " I liked that it combined some general ideas and questions in philosophy, philosophy of biology, and then tied it to the natural history of a specific species.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.07,
    "end": 206.541,
    "text": "So it's all good to, you know, make claims about distributed systems or the microbiome and the host in general, but then tying it to a system that can be studied and has a cool ecological history is a good approach, kind of grounds the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.522,
    "end": 237.963,
    "text": " here's the paper and how to count biological minds symbiosis the free energy principle and reciprocal multi-scale integration i'll read the first aim and then blue you can say something or read the other ones to support the notion of symbiotic minds and the notion of nested biological cognizers that falls out of it this paper will develop and deploy the notion of reciprocal multi-scale integration from within the free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.414,
    "end": 249.542,
    "text": " Reciprocal multiscale integration describes the case where each of two or more cognizing systems uses the other to provide evidence for its own model of the world and itself acting in that world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.904,
    "end": 260.091,
    "text": "As a case study in support of the notion of symbiotic minds, I will look at the symbiosis of Vibrio fischeri bacteria and the bobtail squid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.751,
    "end": 266.436,
    "text": "I will argue that the Vibrio squid assemblage constitutes a functionally integrated cognitive whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.994,
    "end": 271.376,
    "text": " the Markov blanket of which constrains those of Vibrio and the squid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.057,
    "end": 289.625,
    "text": "And in showing how the notion of a symbiotic mind can be supported by reciprocal multi-scale integration within the free energy principles, this paper contributes to the philosophy of cognitive science, demonstrating that our folk psychological conception of what cognizers are require rethinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.577,
    "end": 305.527,
    "text": " Moreover, if the account of symbiotic cognizers presented is tenable, by bringing it to relief and accounted for at least one possible transition in cognition, this paper contributes to a more complete understanding of the evolution of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.649,
    "end": 313.193,
    "text": "So, cool claims, and again, the kind of two halves to it of the general argument and the specific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.354,
    "end": 314.494,
    "text": "And...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.07,
    "end": 332.844,
    "text": " symbiosis and ecological association have been approached in the free energy principle framework, but I think this reciprocal component, it's approached a little differently here than probably in some works, but we'll get into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.626,
    "end": 337.948,
    "text": "Okay, I'll do the first abstract one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.639,
    "end": 353.971,
    "text": " The notion of a physiological individual has been developed and applied in the philosophy of biology to understand symbiosis, an understanding of which is key to theorizing about the major transitions in evolution from multi-organismality to multicellularity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 355.322,
    "end": 362.807,
    "text": " The paper begins by asking what such symbiotic individuals can help to reveal about a possible transition in the evolution of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 364.488,
    "end": 369.251,
    "text": "It makes me think about the transition from a solitary insect cognition to a colony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.952,
    "end": 375.115,
    "text": "So there's the change in the level of organization, and then is that purely cognitive?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.195,
    "end": 376.756,
    "text": "Do cognitive changes precede it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.297,
    "end": 377.997,
    "text": "Do they follow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.437,
    "end": 385.162,
    "text": "What is the relationship between the evolutionary, the physiological, and the cognitive changes is what the first part is getting at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.26,
    "end": 397.602,
    "text": " The second part, such a transition marks the movement from cooperating individual biological cognizers to a functionally integrated cognizing unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.202,
    "end": 403.423,
    "text": "Somewhere along the way, did such cognizing units simultaneously have cognizers as parts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.483,
    "end": 417.966,
    "text": "Expanding upon the multiscale integration view of the free energy principle, this paper develops an account of reciprocal integration, demonstrating how some coupled biological cognizing systems, when certain constraints are met,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.49,
    "end": 423.691,
    "text": " can result in a cognizing unit that is, in ways, greater than the sum of its cognizing parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.552,
    "end": 446.097,
    "text": "And yeah, this paper just shouts out a lot to Seth Mary, or Seth Mary, I can't say his last name, and Maynard Smith, and the major transitions in evolution, which is, if you haven't read that book or thought about those transitions, I mean, you can even probably pick up a summary, but it's really amazing to think about the evolution in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.53,
    "end": 451.633,
    "text": " the transition from single cell to multi-cell and, you know, from asexual to sexual reproduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.653,
    "end": 456.715,
    "text": "And there's, you know, I think seven major transitions that happened in the course of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.855,
    "end": 466.941,
    "text": "And I think that this kind of is hinting at a cognizing evolution or cognitive evolution, which, you know, we'll get into a little bit later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.961,
    "end": 469.242,
    "text": "Okay, perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.762,
    "end": 477.204,
    "text": " Symbiosis between V. fischeri bacteria and the bobtail squid is used to provide an illustration of this account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.924,
    "end": 483.125,
    "text": "A novel manner of conceptualizing biological cognizers as gradient is then suggested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.005,
    "end": 494.548,
    "text": "Lastly, it is argued that the reason why the notion of ontologically nested cognizers may be unintuitive stems from the fact that our folk psychology notion of what a cognizer is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.188,
    "end": 502.073,
    "text": " has been deeply influenced by our folk biological manner of understanding biological individuals as units of reproduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 503.434,
    "end": 522.527,
    "text": "So that's a really cool point because it involves how our understanding of biology and models of biology influence the way that we see the world, which just kind of sounds by definition, but it's really interesting because people have thought so many different things about different parts of biology, about animal biology,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.743,
    "end": 526.645,
    "text": " all of evolution, all of things we see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.665,
    "end": 537.27,
    "text": "So then how that intersects with our understanding of cognition and what cognitive levels exist, what levels of individuality exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.511,
    "end": 539.131,
    "text": "Cool topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 540.512,
    "end": 541.753,
    "text": "So just a thought here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.506,
    "end": 554.01,
    "text": " So what a biological individual, like what a cognizer is, has been influenced by our understanding of biological individuals as units of reproduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.391,
    "end": 557.492,
    "text": "So is a cognizing unit a unit of cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.832,
    "end": 566.535,
    "text": "Is there a corresponding to cognitive evolution as corresponding units as there are to biological evolution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.555,
    "end": 566.795,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.236,
    "end": 568.356,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 570.106,
    "end": 571.908,
    "text": " So those are the main pieces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.689,
    "end": 585.004,
    "text": "The roadmap, not that many subsections, starts with an introduction and goes through a nice description of the free energy principle, which we're going to use in multiple slides here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.766,
    "end": 589.009,
    "text": "There's a distinction drawn, which we'll also go into,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.225,
    "end": 592.646,
    "text": " about mirror versus adaptive active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.767,
    "end": 601.27,
    "text": "Multiscale integration will be discussed and different kinds of multiscale integration come up later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.311,
    "end": 606.513,
    "text": "But then there's two sections about this specific bacterial squid symbiosis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.233,
    "end": 616.298,
    "text": "And then that symbiosis is returned to with this enhanced background on the unidirectional and the reciprocal multiscale integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.298,
    "end": 618.939,
    "text": "So that's kind of the overall roadmap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.356,
    "end": 623.257,
    "text": " Keywords or anything to add on that, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.737,
    "end": 635.943,
    "text": "Keywords were free energy principle, active inference, symbiosis, nested Markov blankets, multi-scale integration, cognitive evolution, emergence, and physiological individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 637.543,
    "end": 639.824,
    "text": " So let's start with symbiosis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 641.084,
    "end": 654.948,
    "text": "So the quote from the paper was, symbioses are cooperative heterospecific associations in which each symbiont partner mutually benefits from, e.g.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.988,
    "end": 658.829,
    "text": "gaining nourishment, shelter, et cetera, from the presence of the other partners.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.909,
    "end": 662.31,
    "text": "So heterospecific means different species,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.73,
    "end": 672.015,
    "text": " And this is a graphic and also those interesting the footnote that just said kind of talking about the positive mutualistic form of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.579,
    "end": 701.691,
    "text": " co-living not commensalist or parasitic forms of co-living or co-existing but even just looking at pairwise interactions before more complex loops are taken into account there's a whole game theory space of interactions so what should our models include cooperative interactions adversarial interactions uh which which one of these edges or relationships",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.831,
    "end": 705.293,
    "text": " have what game theory, what cognitive theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.093,
    "end": 718.58,
    "text": "So it's a cool approach to take on symbiosis that respects all the ways that different systems like a lichen versus a eukaryotic cell with a mitochondria, all these different co-living styles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.281,
    "end": 721.502,
    "text": "So just a thought on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.103,
    "end": 731.768,
    "text": "All of these co-living styles are transactional, whether it's through a voluntary transaction or just straight theft.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.075,
    "end": 743.097,
    "text": " these kind of associations remind me of how we're starting to scale into studying cities and states and thinking about debt, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.157,
    "end": 751.399,
    "text": "So like the debt that we have to each other, like I borrow this or you borrow that, or I benefit you in this way and you benefit me in this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.479,
    "end": 760.761,
    "text": "And that scales from the very basic biological unit all the way through ecosystems, so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.776,
    "end": 764.358,
    "text": " Okay, physiological individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.499,
    "end": 772.667,
    "text": "So we're gonna come back to this idea of what's an individual, but one wrote in is this quote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.787,
    "end": 780.835,
    "text": "So one way philosophers have addressed this question of individuality is by conceptually developing and applying the notion of a physiological individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.756,
    "end": 798.827,
    "text": " A biological individual of this kind is a highly integrated functional unit, the heterogeneous parts of which cohere together through regulatory processes, like metabolic, immunotolerance, etc., so as to maintain the system's integrity and resist environmental forces of decay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 800.362,
    "end": 814.527,
    "text": " And the citation to Perot 2011 looks at the role of the immune system and the interaction with the foreign, with the other during development and uses that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.487,
    "end": 841.806,
    "text": " relationship to explore the notion of the interface between the organism and the environment and looks at like the physiological story involving the microbe and the social niche and all these other components can come into play and that that is in some cases a better explanation or prediction or description of a certain scenario so just cool another cool topic what do you think blue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.708,
    "end": 843.908,
    "text": " So this, this is cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.928,
    "end": 849.83,
    "text": "The end of this quote, I reject the idea that there's no possible distinction between the organism and its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.89,
    "end": 850.991,
    "text": "I just want to point that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.611,
    "end": 854.512,
    "text": "Because we'll come back to that in, in two slides, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.212,
    "end": 861.714,
    "text": "Yes, it's a qualification of the interface and the system, but it's not the rejection that we just give up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.834,
    "end": 865.875,
    "text": "So it's towards useful partitioning of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.31,
    "end": 874.172,
    "text": " Okay, so two models of individuality more generally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.253,
    "end": 877.234,
    "text": "There was a quote in the paper that said,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.666,
    "end": 892.217,
    "text": " The theoretical apparatus that falls out of the free energy principle may be used to arrive at an account of the kind of enrichment of living processes that are required for those processes to qualify as cognitive processes ascribable to physiological individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.798,
    "end": 902.366,
    "text": "So that's linking the cognitive perspective with the physiological perspective of individuality, making good on the project of strong life-mind continuity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.991,
    "end": 906.541,
    "text": " So what models of individuality exist?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.063,
    "end": 909.532,
    "text": "We have physiological and cognitive,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.058,
    "end": 919.862,
    "text": " We have the view that is going to be implicitly described as like folk biological, which is the Darwinian replicator evolutionary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.603,
    "end": 922.963,
    "text": "Just a few other ones that exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 923.283,
    "end": 934.168,
    "text": "There's like the teleological concept of individuality, which is the end directedness and the Kant's definition of the organism as an end in and of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.069,
    "end": 937.31,
    "text": "And that's when things are acting at the organismal level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 938.302,
    "end": 943.446,
    "text": " but there's probably a lot of distance between what was that simplification and what was written.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.587,
    "end": 953.294,
    "text": "The information theory of individuality, which I know, Blue, you have something to add on, and then integrated information theory, as well as pluralism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.232,
    "end": 967.36,
    "text": " and a sort of historical perspective that looks at shifting boundaries of the conception of individuality and then tries to find some organization that doesn't even use that as a central divider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.42,
    "end": 979.669,
    "text": "I mean, these are just some of the ways, but just also cool, like, you know, species, but then there's so many species concepts, but individual seems like that's the one that you can pick out, but then it's not always that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.03,
    "end": 984.152,
    "text": "Well, and I guess we'll come back to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.898,
    "end": 988.521,
    "text": " remark when we talk about Markov blankets here in a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.402,
    "end": 1008.836,
    "text": "So the information theory of individuality, I absolutely love, love, love, love this paper because for many reasons, but I just wanted to highlight in this paper, they talk about how individuality can be nested and it requires a bi-directional information flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.7,
    "end": 1012.983,
    "text": " which I think that this distinction is important, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.063,
    "end": 1017.448,
    "text": "So there has to be like control from the top down and from the bottom up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.808,
    "end": 1022.873,
    "text": "So information has to go both ways and that is what describes an individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.953,
    "end": 1032.482,
    "text": "So, you know, if you have, I'm trying to think of like a non-individual, like, okay, you can have someone broadcasting instructions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.046,
    "end": 1035.027,
    "text": " through a megaphone, you know, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.307,
    "end": 1039.328,
    "text": "Like shouting, you know, like, please move to the right, please move to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.388,
    "end": 1043.169,
    "text": "Like, so that's like top-down control, but there's no feedback from the crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.209,
    "end": 1048.651,
    "text": "Like the right is blocked, there's a path here, or there's, you know, a gap here, we can't walk through it or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.691,
    "end": 1052.593,
    "text": "If there's no, you know, feedback, then that's not an individual, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.873,
    "end": 1055.694,
    "text": "So you have this, you know, top-down control, but nothing comes back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.734,
    "end": 1059.495,
    "text": "So in an individual, there's always that reciprocal flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.174,
    "end": 1072.62,
    "text": " And then the forms of individuality that they highlight in this paper are an organism, which is like you and me, a colonial form of individual, which is like a biofilm, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.68,
    "end": 1074.02,
    "text": "And then a driven form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.08,
    "end": 1080.383,
    "text": "And this is the part that goes back to that quote about, I retract the idea that, you know, there can be no stuff or that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.201,
    "end": 1086.848,
    "text": " An organism is not distinct from its environment, and so in this in this is environmentally driven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.868,
    "end": 1098.964,
    "text": "And that's this last form of individuality that they highlight so so where like the nature of the individual is entirely dependent upon the environment and allowing for this type of individual to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.665,
    "end": 1103.027,
    "text": " really allows the formation of life in the very beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.548,
    "end": 1109.972,
    "text": "Because if you just have collections of molecules, you know, without a boundary or a barrier, that's environmentally driven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.312,
    "end": 1116.597,
    "text": "And so without that organism being able to arise from its environment, you don't get the origin of life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.857,
    "end": 1118.678,
    "text": "And so I just wanted to highlight that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.839,
    "end": 1121.06,
    "text": "Nice, great points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.424,
    "end": 1126.846,
    "text": " The next keyword is the free energy principle or FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1127.206,
    "end": 1142.653,
    "text": "And this is from actin live stream 14 from the illusion that Carl Friston made to the wood lice and his kind of observations of nature leading eventually to an integrative approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.433,
    "end": 1166.225,
    "text": " that includes some of these areas like considering how multi-scale systems work and how collectives work so how things work laterally within a level like across the nest mates and then multi-scale like the colony inside of the ecosystem information and thermodynamics and control theory and action selection as a type of inference we're going to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.105,
    "end": 1174.27,
    "text": " hear it here from the author and look through the four main points that they drew out of the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1176.872,
    "end": 1181.776,
    "text": "So this is again coming from the SIMS 2020 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.876,
    "end": 1183.477,
    "text": "So read for more detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1185.219,
    "end": 1190.583,
    "text": " The free energy principle starts from a particular view of life that is grounded in statistical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.905,
    "end": 1196.028,
    "text": "So that's an introductory claim, interesting way to start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.069,
    "end": 1201.272,
    "text": "And again, just pulling a few highlights out to get at this first key point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.353,
    "end": 1209.358,
    "text": " A biological system is one that self-organizes to a limited set of attracting states that is far from thermodynamic equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.958,
    "end": 1222.827,
    "text": "So there it's like our body temperature is kept above the room temperature, far from the sort of naive chemical equilibrium, and that's being maintained despite dissipation being prevalent in the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.167,
    "end": 1230.452,
    "text": "And that resistance to falling to equilibrium is called the non-equilibrium steady state density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.604,
    "end": 1238.37,
    "text": " Importantly, the nest density, towards which an organism's dynamics flow corresponds to its phenotype, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.43,
    "end": 1250.699,
    "text": "its regular patterns of behavior, morphology, and physiology, to find itself in its characteristic or phenotypic states, provides the organism evidence that its behavior is countering dispersive effects of random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.676,
    "end": 1262.785,
    "text": " So even static seeming phenotypes like the length of your femur, it's actively maintained by cells being renewed and the turnover rate and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.605,
    "end": 1272.652,
    "text": "So sometimes it's easier to think about some phenotypes like cognitive phenotypes as actually embodying parametric values that are being kept away from equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.633,
    "end": 1276.835,
    "text": " Other times for more static components of phenotype, it's not that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.315,
    "end": 1284.38,
    "text": "But it's just a cool way to think about phenotype as just these measurements that are stable over some timeframe about the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.0,
    "end": 1293.045,
    "text": "And the persistence of those measurements through time represent the implementation of some strategy that resisted dissipation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1293.745,
    "end": 1298.108,
    "text": "Hence, the maintenance of a non-equilibrium steady state through some kind of strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.051,
    "end": 1302.631,
    "text": "Anything to add, Luke?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.187,
    "end": 1306.109,
    "text": " No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.391,
    "end": 1312.536,
    "text": "This brings us to the second primary feature of FEP, the Markov blanket formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1313.858,
    "end": 1320.926,
    "text": "This is used in the context of FEP to describe a particular kind of statistical organization of a system relative to that which the system is not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.236,
    "end": 1328.461,
    "text": " Namely, it describes the statistical partitioning of internal states, and then using just the variable named as they are here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.361,
    "end": 1341.59,
    "text": "Internal states R, the external states phi, and the sensory states S, active states A, these latter states being in the Markov blanket, which are the sensory and the active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.331,
    "end": 1344.032,
    "text": "So what about this blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.115,
    "end": 1373.609,
    "text": " just i mean we've talked um well on the live stream a lot about markov blankets and how they can be used to describe um or or individuate individuals so really or to delineate the boundaries of an individual and technically the the markov blanket um defines conditional independence so like under what settings or under what settings are these two systems conditionally independent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.328,
    "end": 1383.332,
    "text": " Yes, so there's some interface that is being used and there's a conditional independence across either side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.392,
    "end": 1387.714,
    "text": "But yeah, a topic that's come up many times and I'm sure this is not the end of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.175,
    "end": 1394.157,
    "text": "This brings us to a third essential feature of FEP, the notion of a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.038,
    "end": 1403.542,
    "text": "A generative model is a probabilistic model that describes how the evolution of sensory states of a Markov blanket could be caused by external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.867,
    "end": 1414.359,
    "text": " It captures prior beliefs in the form of probability distributions about unobserved external states and a likelihood mapping external states to the evolution of sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.14,
    "end": 1418.745,
    "text": "Such models are, quote, implicit in the dynamics of internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1419.867,
    "end": 1420.708,
    "text": "Palacios et al., 2020.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.014,
    "end": 1436.343,
    "text": " So the mapping between external states and the evolution of estimates of internal states is this A matrix that is connecting the observations being made through time to the S matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.944,
    "end": 1440.966,
    "text": "So that's a bi-directional relationship with the generative and the recognition model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.026,
    "end": 1442.487,
    "text": "That's the tail of two densities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.168,
    "end": 1445.149,
    "text": "But that's the signal processing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.77,
    "end": 1456.537,
    "text": " sort of sampling the external world and then having an ongoing estimate of world states, which could be just unobserved world states or causes in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.137,
    "end": 1475.91,
    "text": "Then there's how those states change through time, B, how policy interacts with how those states change through time, pi, D, the prior over the states, and then the decision-making of pi with the C, G, and the E. So this is the partially observable Markov decision process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.71,
    "end": 1479.071,
    "text": " the POMDP framing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.591,
    "end": 1481.712,
    "text": "And it's not the only way we can look at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.772,
    "end": 1490.136,
    "text": "But this gets like many of the key variables down, which is why we and there's uncertainties on all of these as we've found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1490.616,
    "end": 1493.197,
    "text": "So this just gets a lot of the key pieces down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.877,
    "end": 1496.499,
    "text": "The generative model could have a different structure, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.719,
    "end": 1497.959,
    "text": "This is not the only structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1500.18,
    "end": 1500.4,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.741,
    "end": 1501.921,
    "text": "Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.716,
    "end": 1506.438,
    "text": " So here is from the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.519,
    "end": 1509.882,
    "text": "You want to read this one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.943,
    "end": 1511.184,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.704,
    "end": 1517.291,
    "text": "Importantly, a system's generative model may be cast in terms of its non-equilibrium steady state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.892,
    "end": 1524.82,
    "text": "To see how this is the case requires understanding the notion of dual information geometry of self-organizing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.544,
    "end": 1529.31,
    "text": " And he gives several citations, one of which I guess is this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.731,
    "end": 1529.911,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.592,
    "end": 1539.726,
    "text": "So this is just giving the first description, not like first in literature, just like a first introductory description on this dual information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1541.38,
    "end": 1547.903,
    "text": " This dual aspect concerns the intrinsic information geometry of the probabilistic evolution of internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.643,
    "end": 1557.067,
    "text": "So that's like the actual, if there's a million neurons and they can each take 10 states, that's the geometry of the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.267,
    "end": 1559.988,
    "text": "It's like that many neurons can take on that many values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.488,
    "end": 1564.85,
    "text": "That's the internal true state space of the actual internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.991,
    "end": 1566.611,
    "text": "And to separate,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.56,
    "end": 1590.475,
    "text": " in extrinsic information geometry of probabilistic beliefs about external states that are parameterized by internal states so that n neurons could be fitting a binary model is the light switch up or down or it could be a three-state model is it up down or not either or both whatever it's specifying that is a lower dimensionality than",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.721,
    "end": 1592.803,
    "text": " the actual state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.384,
    "end": 1601.857,
    "text": "So it's like, there's a lot of decisions in the whole computer, but then there's this external realized component that's a smaller state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.499,
    "end": 1605.079,
    "text": " the extrinsic information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.68,
    "end": 1607.04,
    "text": "We call these intrinsic, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.1,
    "end": 1610.261,
    "text": "mechanical or state-based, and extrinsic, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.301,
    "end": 1612.722,
    "text": "Markovian or belief-based information geometries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.542,
    "end": 1624.565,
    "text": "And Wanja has come on to discuss several papers, so definitely look at the work by all of these authors because it's an interesting topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.585,
    "end": 1626.566,
    "text": "We could probably learn more about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.126,
    "end": 1630.187,
    "text": "And I know there's people who are listening who know more about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.502,
    "end": 1633.742,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.025,
    "end": 1655.543,
    "text": "Here is those intrinsic and extrinsic information geometries being used in, I think, the Sims paper, but I'm not 100% sure, actually, but we can see either that or it's in this previous Friston paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.761,
    "end": 1659.243,
    "text": " So there's the probabilistic flow of the system states over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1659.624,
    "end": 1661.005,
    "text": "That's the intrinsic geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.886,
    "end": 1662.507,
    "text": "And that's that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.827,
    "end": 1663.027,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.187,
    "end": 1663.347,
    "text": "What?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.788,
    "end": 1665.089,
    "text": "I think this is the first in paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.169,
    "end": 1665.43,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.51,
    "end": 1665.73,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.83,
    "end": 1666.571,
    "text": "And here's the extrinsic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1666.591,
    "end": 1676.1,
    "text": "So then basically this is just a visual showing the higher dimensionality of the actual components of the system that can project onto like just two lower areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1676.981,
    "end": 1677.141,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.123,
    "end": 1690.655,
    "text": " The fourth part of FEP in the SIMS paper, this brings us to the fourth primary feature of FEP, active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.914,
    "end": 1696.516,
    "text": " I'll read the other and then you can give a thought on where you think Accident fits in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.497,
    "end": 1710.944,
    "text": "FEP proposes that living systems are able to resist the second law of thermodynamics in virtue of avoiding sensory states which are deleterious and actively bringing about those sensory states which allow them to maintain their structural and functional integrity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.784,
    "end": 1720.406,
    "text": " It is by engaging in this coupled process of active inference that an organism minimizes not only current free energy encountered, but expected free energy, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.426,
    "end": 1724.908,
    "text": "the free energy that would arise were a particular action policy selected and followed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.149,
    "end": 1732.99,
    "text": "So instead of giving a thought, I'm going to give an author's thought on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.943,
    "end": 1760.781,
    "text": " Just to read a quote from the paper, the reason for using the free energy principle to investigate and argue for symbiotic mind is not only because the quantity free energy provides a measure of cognition across spatio-temporal scales, but because the free energy principle and its various corollaries suggest a plausible criterion for identifying biological cognizers across various spatio-temporal scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.624,
    "end": 1766.386,
    "text": " So that's why they pitched the FEP, just for that reason, which I thought was nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.426,
    "end": 1786.373,
    "text": "I'm going to ask a nice question from the chat from Steven, wrote, is there a dual information geometry between intrinsic and extrinsic states of active inference and another dual information geometry between action states and niche spaces?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.787,
    "end": 1790.79,
    "text": " Can I give a first answer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.914,
    "end": 1792.255,
    "text": "Please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.275,
    "end": 1792.676,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.592,
    "end": 1806.659,
    "text": " I would say that the total state space, which includes the variables for the internal, the blanket, and the external space, that's the shape it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.32,
    "end": 1808.801,
    "text": "And then there's going to be sub-shapes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.341,
    "end": 1812.523,
    "text": "Like you could only look at the blanket and the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.583,
    "end": 1813.864,
    "text": "That's the particular states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.565,
    "end": 1817.527,
    "text": "So that's partitioning the system of interest away from the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.387,
    "end": 1820.769,
    "text": "Or you could look at it in a four-way or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.954,
    "end": 1828.799,
    "text": " There's probably a lot of other ways, but it seems like the full model is the full geometry, and then there's gonna be some reduced geometries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.3,
    "end": 1832.122,
    "text": "And then Steven clarified, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.182,
    "end": 1841.729,
    "text": "a dual information geometry in relation to the generative model and what it is modeling, and a dual information geometry between what actions are happening and the niche modification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.749,
    "end": 1851.116,
    "text": "I think that gets at also that sigma mapping function in the DaCosta paper with like, okay, after there's conditional independence,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.085,
    "end": 1864.816,
    "text": " of the kind that the Markov blanket partitioning provides, there's still some internal state partitions in the world that maybe do some prediction about or anticipation about external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.236,
    "end": 1867.318,
    "text": "So it's as if they're estimating external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1869.179,
    "end": 1871.722,
    "text": "Let's talk to somebody who knows information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.776,
    "end": 1873.096,
    "text": " That's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.136,
    "end": 1876.317,
    "text": "I was going to say, my guess would be it depends on where you put the mark on the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.437,
    "end": 1885.64,
    "text": "But definitely, I think anybody out there who's listening that knows a lot about information geometry, I'm curious to take a deep dive down that path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.22,
    "end": 1889.181,
    "text": "So I encourage you to get in touch and contact us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.221,
    "end": 1891.882,
    "text": "Come talk to us about information geometry because I would like to learn some more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.048,
    "end": 1917.704,
    "text": " there was a distinction drawn in the paper between adaptive and mere active inference so I actually don't think that this has come up we've we've seen several distinctions like instrumentalism and realism in terms of the interpretation but this is I think another relevance distinction FEP falls short of making the claim that all Markov blankets draw a line around cognizers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.454,
    "end": 1923.685,
    "text": " It has been suggested that what determines whether a living Markov-blanketed system is cognizer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.557,
    "end": 1932.661,
    "text": " is whether or not it is the kind of thing which engages in adaptive active inference, rather than mere active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1933.341,
    "end": 1933.761,
    "text": "Kirchhoff, 2018.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.442,
    "end": 1942.505,
    "text": "Adaptive active inference requires that a system autonomously engage in active inference, maximizing sensory evidence for its own existence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.186,
    "end": 1952.77,
    "text": "So there's been a coupled oscillator model, as well as the flywheel governor model, another classic kind of mechanical regulatory system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.831,
    "end": 1953.931,
    "text": "And...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.891,
    "end": 1960.614,
    "text": " as well as the discussion, well, does a rock have a Markov blanket, that type of question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.514,
    "end": 1974.242,
    "text": "And so this is from the Kirchhoff 2018 paper, just drawing the distinction between mere active inference, which is like the ability to draw a partition around a system at all, to distinguish it from its niche and its interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.383,
    "end": 1980.986,
    "text": "And then its generative model could be like nil or boring or just a coin flip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.915,
    "end": 1993.002,
    "text": " to contrast that with adaptive active inference, which is actually the inactive sensory motor affordance semantic coupling, I'm a strange loop type system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.482,
    "end": 1994.583,
    "text": "What do you think about that, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.503,
    "end": 2004.929,
    "text": "So I wonder, you know, when we talk about active inference and adaptive active inference, adaptive active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.155,
    "end": 2036.988,
    "text": " implies more than just mental action or maybe mental actions is sufficient but but i think um i feel like adaptive active inference implies that there's more of an action component and you know we've talked about situations where where you can have active inference occurring without necessarily taking an action or maybe a mental action you can actively infer what's happening in the environment without",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.762,
    "end": 2040.703,
    "text": " Performing some kind of action that's adaptive to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.723,
    "end": 2042.244,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.264,
    "end": 2043.685,
    "text": "Maybe that's that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.326,
    "end": 2046.946,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.166,
    "end": 2048.247,
    "text": "Action and non-action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.527,
    "end": 2050.168,
    "text": "It can be adaptive to not act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.308,
    "end": 2052.669,
    "text": "So is that mere waiting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.269,
    "end": 2053.709,
    "text": "Good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.729,
    "end": 2055.15,
    "text": "Right, right, right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2055.615,
    "end": 2058.598,
    "text": " And also like you can have adaptation that's occurring in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.638,
    "end": 2061.361,
    "text": "Like you adapt to a noise in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.401,
    "end": 2065.306,
    "text": "Like it's super loud and sounds super loud, but then eventually your brain adapts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.826,
    "end": 2068.729,
    "text": "So are you still, is that mirror or is that adaptive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.749,
    "end": 2070.792,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2071.152,
    "end": 2076.418,
    "text": "So emergence, do you want to read whatever or say whatever you'd like to say about emergence?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.268,
    "end": 2077.588,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.848,
    "end": 2080.93,
    "text": "So this is just the Wikipedia definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.01,
    "end": 2081.731,
    "text": "So I'll just read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.211,
    "end": 2085.212,
    "text": "Emergence in philosophies to systems theory, science and art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.233,
    "end": 2090.535,
    "text": "Emergence occurs when an entity is observed to have properties its parts do not have on their own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.016,
    "end": 2095.958,
    "text": "Properties or behaviors which emerge only when the parts interact in a wider whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.819,
    "end": 2101.061,
    "text": "And I just included these references.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.902,
    "end": 2105.804,
    "text": "So that definition kind of echoes integrated information theory of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.104,
    "end": 2114.069,
    "text": " consciousness, which again, implies that like consciousness is this emergent property when the parts are interacting and create something that's bigger than the whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.589,
    "end": 2117.931,
    "text": "And then, um, both of these, um, wait.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.431,
    "end": 2118.711,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.951,
    "end": 2129.717,
    "text": "So both of these papers, um, the Rosas paper, and then this paper by Varley and Eric hole, um, start to get into the mathematics of emergence and they use similar, um, metrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.797,
    "end": 2132.399,
    "text": "It's like they use the partial information decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.121,
    "end": 2140.044,
    "text": " over the phi metric that's used in the integrated information theory of consciousness to kind of quantify emergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.084,
    "end": 2147.386,
    "text": "Like what is this, how much is this emergent property, or to what degree is this an emergent property of these parts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.226,
    "end": 2152.908,
    "text": "And then this is a strong and weak emergence paper that you included, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.148,
    "end": 2153.388,
    "text": "Oh, yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.748,
    "end": 2157.69,
    "text": "So I just, I saw it was really cool that first that you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.618,
    "end": 2164.263,
    "text": " Chosen papers from people in the active inference community and that their recent papers like within the last year or two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.283,
    "end": 2167.586,
    "text": "So just shows that there's development on these topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2167.626,
    "end": 2169.227,
    "text": "And that's interesting to think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.867,
    "end": 2183.419,
    "text": "And then I just thought to throw in a third, like two truths and a lie, but like two newer citations and one older one, just the qualitative distinction between strong and weak emergence was influential by Mark Badao from 1997.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.459,
    "end": 2183.579,
    "text": "And, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.038,
    "end": 2192.659,
    "text": " That paper says, I conclude that the scientific and philosophical prospects for weak emergence are bright.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.279,
    "end": 2196.54,
    "text": "And so it's easy to be like, oh, I want like the best version of whichever thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.88,
    "end": 2213.543,
    "text": "But in the paper, it distinguishes between strong emergence as being sort of the metaphysical discussion about how holes take on meanings greater than the sum of their parts and sort of all versus none, like snapping into existence in this kind of semi-magical way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2214.523,
    "end": 2240.077,
    "text": " versus weak emergence like the ant colony the city the actual complex systems that can be modeled and so that kind of operationalized emergence while allowing a channel of metaphysical discussion like you just mentioned consciousness and other people bring up emergent properties consciousness all the time like integrated information theory it's an integrated information theory of consciousness so it's kind of just interesting how there's like a metaphysical thread",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.757,
    "end": 2248.283,
    "text": " in what this integration means, as well as an operational and a more empirical side of this discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.784,
    "end": 2259.831,
    "text": "And I also saw a recent 2021 paper, I can't remember the author, but dealing with fMRI and emergence in fMRI, which is kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.931,
    "end": 2262.793,
    "text": "I didn't include it, but I thought that that was cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.914,
    "end": 2263.214,
    "text": "It was 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.314,
    "end": 2264.695,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.756,
    "end": 2267.237,
    "text": "Best to mark all blankets, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.188,
    "end": 2268.548,
    "text": " That's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.668,
    "end": 2273.051,
    "text": "So again, this came, this comes from that, uh, here cough paper, 2018.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.332,
    "end": 2277.735,
    "text": "Um, and you know, this, this figure is cool blankets all the way down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.755,
    "end": 2285.92,
    "text": "Um, so, you know, here they show a single celled organism and they predict what they, they, they illustrate one Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.02,
    "end": 2286.781,
    "text": "I model the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.341,
    "end": 2292.505,
    "text": "Um, and then you have multi-cell organism, a blanket of blankets that says we model the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.514,
    "end": 2297.158,
    "text": " And then here it shows a pontiff that shows blankets within blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.198,
    "end": 2299.76,
    "text": "We model ourselves modeling the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.86,
    "end": 2305.706,
    "text": "And that was something interesting that David Krakauer actually said at the Summer Institute this last summer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.786,
    "end": 2313.913,
    "text": "He said, you know, humans, one of the things that makes us uniquely human is that we build models of our model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.494,
    "end": 2315.735,
    "text": "We build models of our models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.716,
    "end": 2318.097,
    "text": "So I thought that that was interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.916,
    "end": 2319.156,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.336,
    "end": 2325.799,
    "text": "And then on the right side, so there's the PPP example, protozoa, plants, pontiffs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.719,
    "end": 2334.843,
    "text": "And then another cyber-physical way that the Markov blanket concept and the partitioning of systems this way is being used is in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.933,
    "end": 2336.653,
    "text": " digital systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.414,
    "end": 2345.097,
    "text": "So this is like a team member, and then there's a certain type of blanket that they're interfacing through in terms of sense and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.817,
    "end": 2352.48,
    "text": "And the database can also be thought of as having different kinds of sensory and action states, as well as internal generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2353.001,
    "end": 2355.002,
    "text": "It's dealing with a different external set of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.662,
    "end": 2357.423,
    "text": "That's from the Vyotkin et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.963,
    "end": 2358.243,
    "text": "2020 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.904,
    "end": 2363.745,
    "text": "How about multi-scale integration?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.126,
    "end": 2364.786,
    "text": "You can go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.297,
    "end": 2368.018,
    "text": " So I'll just read the yellow here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.939,
    "end": 2371.461,
    "text": "And so this is from the Randstad et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.501,
    "end": 2375.003,
    "text": "paper 2019, which I think that that's where this figure is from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.023,
    "end": 2376.824,
    "text": "And then there's also the Hesp et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.844,
    "end": 2377.665,
    "text": "2019 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.205,
    "end": 2383.709,
    "text": "It says, the multiscale integrationalist view is a pluralist theory about cognitive boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.269,
    "end": 2393.916,
    "text": "It uses the notion of nested Markov blankets to demonstrate that cognitive systems have a plurality of ontological boundaries, each relevant to the study of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.087,
    "end": 2405.896,
    "text": " According to this view, each of the spatio-temporally nested components of this cognitive system may be ontologically picked out by deploying the Markov blanket formalism at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.717,
    "end": 2408.158,
    "text": "And that's what we were talking about earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.178,
    "end": 2414.883,
    "text": "We talked about individuality at different scales, and we talked about the Markov blanket individuating systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.223,
    "end": 2416.845,
    "text": "So this is just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.567,
    "end": 2421.43,
    "text": " one way that multi-scale integration can be approached.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.05,
    "end": 2429.216,
    "text": "But before the Markov blanket even was an idea, there was other approaches to partitioning multi-scale systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.157,
    "end": 2436.702,
    "text": "So let's just go right to the author's distinction in the paper of what uniscale integration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.087,
    "end": 2457.563,
    "text": " is and how it relates to the adaptive versus mere active inference discussion and this is a question steven also raised in the chat so multi-scale integration so that's that nesting of systems within one another just not i'm intentionally not adding any adjective just any kind of nesting systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.735,
    "end": 2471.244,
    "text": " Multiscale integration of living systems that fail to possess the high degree of autonomy required of adaptive active inference, and hence fail to be cognizers, continue to engage in mere active inference at fast timescale, e.g.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.384,
    "end": 2472.605,
    "text": "a mitochondria in a cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.786,
    "end": 2481.171,
    "text": "So that is visualized here before returning to the quote, like the circular nodes on the bottom, let's just say are doing mere active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.652,
    "end": 2484.333,
    "text": "They're simple sensors or actuators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.376,
    "end": 2496.906,
    "text": " and then they sort of just in a very clean way lead to increasingly weakly emergent behavior that starts approximating adaptive active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.406,
    "end": 2512.479,
    "text": "So for example, you have a Python script that is adaptive active inference, just so we don't have to even debate whether snails or birds are doing it, just you write a script that is adaptive active inference, the sub functions within it, even though they might have an input output structure,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.34,
    "end": 2525.274,
    "text": " and even a generative model, they're going to be a lot more mechanical or simple or linear, not displaying the properties of the actual active agent in the Python script at the higher level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.127,
    "end": 2529.329,
    "text": " So that's describing this process of uniscale integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.83,
    "end": 2549.043,
    "text": "And then just the paper describes more about how adaptive active inference at the slower scale of the cognizing system, that's the thought bubble here, drives the continued integration of the nested Markov blankets at scales below it and not vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.483,
    "end": 2550.244,
    "text": "So the pythons...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.403,
    "end": 2563.006,
    "text": " variables drive the patterns of the computation of the lower level functions, but those don't meaningfully feed back into higher level properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.786,
    "end": 2579.149,
    "text": "So adaptive active inference at the high end, and then that's just being merely explained mechanistically by unidirectional integration with systems that are decreasingly cognizer-like on some continuum of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.078,
    "end": 2589.104,
    "text": " So I like the term that's used here, and I think I'll highlight why when we come to the nested cone slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.084,
    "end": 2600.472,
    "text": "But he says, the behavior of constituent nested Markov blanket systems are enslaved to the slower dynamics of the autonomizing, cognizing organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.532,
    "end": 2605.095,
    "text": "So I like this concept of enslaving the subroutines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.556,
    "end": 2606.836,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.037,
    "end": 2609.098,
    "text": "Cognitive evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.478,
    "end": 2610.599,
    "text": "Do you want to say anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.186,
    "end": 2631.418,
    "text": " Sure, so this is, I'll just read this little excerpt from the paper because the author didn't technically use the term cognitive evolution and I thought that it might refer to a couple different things, but I'll read this quote because I think it maybe highlights the point that the author was getting at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.478,
    "end": 2638.462,
    "text": "So this is a question about the kinds of physiological individuals that we can reasonably ascribe the term cognizer to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.882,
    "end": 2641.384,
    "text": "It's a question about how to count biological minds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.943,
    "end": 2651.087,
    "text": " The significance of this question lies in the fact that its answer may be used to shed light upon possible major transitions in cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.648,
    "end": 2667.536,
    "text": "Perhaps there are many such transitions, the move from reflex behavior to sensory motor coordination, the move from non-sentience to sentience, the move from individual intentionality to group intentionality, which this again echoes the major transition of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.82,
    "end": 2673.382,
    "text": " So cognitive evolution, I thought about it in a couple of ways and we're coming to the cone slide next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.422,
    "end": 2674.922,
    "text": "So maybe we can flip there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.522,
    "end": 2676.963,
    "text": "Let's flip to the cone slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.003,
    "end": 2687.726,
    "text": "So, you know, I thought that that's one way that we can think about cognitive evolution from like the transitions in evolution from say multicellular to, or single cell to multicellular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.606,
    "end": 2693.088,
    "text": "But here, this is from Mike Levin's paper, The Computational Boundary of the Self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.989,
    "end": 2698.192,
    "text": " And you can see this is like the cognitive cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.413,
    "end": 2705.957,
    "text": "So this is the cognitive cone of an individual, the light cones that were inverted and used in this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.257,
    "end": 2714.202,
    "text": "But you can see that the cognitive cone of a tick is much smaller than that of a dog, is much smaller than that of a human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.562,
    "end": 2719.726,
    "text": "And so perhaps this cognitive evolution is, you know, in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.34,
    "end": 2727.123,
    "text": " scale of the organism or, you know, cognitive capacity of an organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.144,
    "end": 2735.407,
    "text": "But Mike here uses this idea of nested, kind of this multi-scale nested cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.328,
    "end": 2743.972,
    "text": "And here it's shown here, the cell, the organism, the colony to represent these compound intelligences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.668,
    "end": 2752.912,
    "text": " And when we talked on the stream back in July, we talked about the warping of the cone, the bigger cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.793,
    "end": 2758.756,
    "text": "So the colony enslaves the behavior of the organism, enslaves the behavior of the cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.836,
    "end": 2760.196,
    "text": "And so this goes all the way down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.216,
    "end": 2768.921,
    "text": "And that's why I liked what Matthew Sims, his term enslaving in these nested Markov structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.775,
    "end": 2778.186,
    "text": " And the idea that if you were to grab and twist the top of this cone, you would grab and twist all the cones in it, depending on how tight you twist it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.246,
    "end": 2784.155,
    "text": "So I like this idea of enslaving the behavior, and this was a good visual to kind of tie that all together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.595,
    "end": 2792.158,
    "text": " That terminology also arises from synergetics, from Haakon, not Fuller, as they say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.038,
    "end": 2793.999,
    "text": "And this is footnote 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.099,
    "end": 2799.821,
    "text": "An order parameter is a notion taken from synergetics and used in dynamic systems theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.622,
    "end": 2805.144,
    "text": "It denotes a measure of a global system's macro scale, unstable, slow dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.684,
    "end": 2806.885,
    "text": "That's like the sleep wake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.665,
    "end": 2814.512,
    "text": " that enslaves the fast dynamics of microscale component systems, that's like the EEG rhythm, and results in a globally emergent pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.953,
    "end": 2818.296,
    "text": "So it's about multi-scale systems organizing, but synergetics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.639,
    "end": 2822.9,
    "text": " Hacken, not Fuller, approaches it from a dynamic systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.32,
    "end": 2825.441,
    "text": "Fuller approaches it from a geometric perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.841,
    "end": 2827.762,
    "text": "So there's other ways to do this partitioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.142,
    "end": 2830.283,
    "text": "Markov blanket is not the only partitioning out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.923,
    "end": 2836.325,
    "text": "But this was cool about also Levin's partitioning, which we just got to learn about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2836.345,
    "end": 2839.606,
    "text": "All right, on to the squid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.727,
    "end": 2843.668,
    "text": "So I don't know if these are the exact right species, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.311,
    "end": 2851.115,
    "text": " one of the key empirical examples of the paper, the one that's followed up on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.135,
    "end": 2852.236,
    "text": "Do you want to describe the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2855.719,
    "end": 2856.199,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.279,
    "end": 2862.464,
    "text": "Well, so, I mean, the Vibrio fischeri are the bacteria that colonize the squid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.564,
    "end": 2864.785,
    "text": "And yes, it's the Hawaiian bobtail squid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.085,
    "end": 2871.71,
    "text": "And shout out to Michelle Nishiguchi and her lab that was the lab underneath my lab when I was working in a biology lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.594,
    "end": 2883.54,
    "text": " So the juvenile squid recruits the Vibrio fischeri into what's called a light organ and the bacteria are bioluminescent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.32,
    "end": 2887.342,
    "text": "And so it becomes essentially like inoculated with these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.163,
    "end": 2891.145,
    "text": "And so then it says, I'll just read this because it's easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.305,
    "end": 2893.246,
    "text": "It's probably a better description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.786,
    "end": 2899.45,
    "text": "So it's a nocturnal predator of the shallow reef that buries in the sands during the day and hunts at night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.163,
    "end": 2906.768,
    "text": " So it's always, whether or not it's preyed upon, it's always influenced with this association with these bioluminescent bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.129,
    "end": 2927.605,
    "text": "So the juvenile is inoculated into the light organ through seawater, and then the host promotes the colonization of Vibrio fischeri, and only Vibrio fischeri, through the production of mucus, which is bacteria in food, the elimination of competing bacteria through hemocyte defenses of its innate immune system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.12,
    "end": 2935.945,
    "text": " and the eventual shedding of the ciliated appendages and swelling of the crypt membranes, preventing further entry into the light organ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2936.325,
    "end": 2938.307,
    "text": "So the switch sucks up the Vibrio fischeri.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.367,
    "end": 2939.928,
    "text": "It says, we want you, we only want you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.748,
    "end": 2942.81,
    "text": "All of the other bacteria, we're not going to allow them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.83,
    "end": 2945.111,
    "text": "We're just not going to facilitate that interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.131,
    "end": 2957.079,
    "text": "And then it says, following gradients of chitin, which they feed upon, Vibrio fischeri migrate deeper into the crypts of the light organ, colonizing it and causing a biochemical reaction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2957.509,
    "end": 2960.411,
    "text": " resulting in their emission of bioluminescent light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.072,
    "end": 2964.495,
    "text": "This occurs just in time for the bobtail's nightly hunt for prey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.555,
    "end": 2970.28,
    "text": "Something else I thought that was important for this cycle is that they're expelled every morning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.08,
    "end": 2974.623,
    "text": "They just get out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.823,
    "end": 2977.826,
    "text": "The bobtail squid colonizes and sucks up all the bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.106,
    "end": 2981.609,
    "text": "They multiply and divide inside of the squid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.977,
    "end": 2988.642,
    "text": " And then it shoots about, so they're back in the seawater and they're available for recapture by other squid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.763,
    "end": 2990.983,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.383,
    "end": 3007.975,
    "text": "So we're going to return to the Markov blanket partitioning and then consider that squid system and how using the Markov blanket partitioning, we can distinguish between unidirectional and reciprocal multi-scale integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.795,
    "end": 3013.838,
    "text": " So the nomenclature in this paper, R is the internal states, maybe because there's R in the word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.499,
    "end": 3025.066,
    "text": "Then S and A are the usual words for the state of sensory sense states coming in to R, and then active action states going out of R, influenced by.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3025.086,
    "end": 3027.568,
    "text": "So these are like the set of isolating nodes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.388,
    "end": 3034.236,
    "text": " from which, knowing them, you're knowing as much as you can about R, the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.876,
    "end": 3040.624,
    "text": "And then here, phi, or phi, I don't know which one it is, is the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.465,
    "end": 3041.665,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.526,
    "end": 3042.887,
    "text": "It's both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.387,
    "end": 3043.547,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.109,
    "end": 3045.349,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3046.349,
    "end": 3058.693,
    "text": "Figure two is where we turn to these two different kinds of multi-scale integration and directly compare them using kind of the nomenclature and the contribution, I believe, of this specific paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.693,
    "end": 3068.356,
    "text": "So to understand the difference, I will deploy the terminology of users, you, and resources, R.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3069.438,
    "end": 3078.425,
    "text": " Users are living systems, the internal states of which inferentially generate sub-personal predictions that allow them to use other Markov-blanketed systems that are external to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.546,
    "end": 3082.428,
    "text": "So here is like the spider making its web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.289,
    "end": 3086.571,
    "text": "So it's a user of this extended cognitive resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.972,
    "end": 3094.737,
    "text": "And so we can imagine that there's a Markov blanket partitioning that's around these entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.731,
    "end": 3099.752,
    "text": " Like, we don't need to deny that there is a partitioning between the web and the spider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3100.693,
    "end": 3106.315,
    "text": "We can think about it using this U and R. Maybe this U and R is a partition we can ask the author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3106.795,
    "end": 3110.256,
    "text": "Like, is it a partitioning of just Markov blankets from each other?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.697,
    "end": 3112.637,
    "text": "Is there going to be some sort of interface?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.697,
    "end": 3113.718,
    "text": "Is that the niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.918,
    "end": 3116.339,
    "text": "That's the unidirectional case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.639,
    "end": 3122.141,
    "text": "The bidirectional case is where those two interacting systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.297,
    "end": 3135.583,
    "text": " in the same way that the spider can be thought of as the unidirectional user of the resource of the web, that the two interactants are sort of using and benefiting from each other as an extended cognitive resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.846,
    "end": 3155.155,
    "text": " So that is one of the main points of the paper, looking at that difference between kind of mere multi-scale systems and then ones where it's not just like a ladder, it's almost like a conversation that is giving some new emergent outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3159.937,
    "end": 3160.478,
    "text": "Very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.758,
    "end": 3160.998,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.326,
    "end": 3179.142,
    "text": " next slide just shows some more discussion on the new u and r relationships that arise and then how the new non-equilibrium steady state density arising from that interaction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.293,
    "end": 3205.655,
    "text": " then in the synergetic sense acts as a ordering parameter for u1 and u2 so the constituents are part of a new ordering regime because of the bi-directional relationship to be clear each constituent biocognizer continues to engage in adaptive active inference acting in ways that ensure it remains statistically separate from its environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.618,
    "end": 3217.627,
    "text": " So again, in the unidirectional case, it's mere active inference on the bottom that becomes increasingly cognitive as you go towards some level of autonomy, like a pyramid scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.328,
    "end": 3225.274,
    "text": "This is like a different structure where there's increasing levels of autonomy of different kinds of interacting systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.255,
    "end": 3229.337,
    "text": "And then there's sort of a bigger wrapper around that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.801,
    "end": 3234.001,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.842,
    "end": 3235.002,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.734,
    "end": 3240.179,
    "text": " It's like the interaction creates a new cone, a new tent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.279,
    "end": 3240.96,
    "text": "It builds a tent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.481,
    "end": 3243.502,
    "text": "Yep, makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3243.522,
    "end": 3244.844,
    "text": "So then this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.193,
    "end": 3257.555,
    "text": " brings this emergence from the functional, because it's one thing to say that the functional, you know, these two brain regions get coupled together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.995,
    "end": 3260.816,
    "text": "Now there's a functional difference in their firing rates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.156,
    "end": 3263.217,
    "text": "That's kind of a low mechanistic bar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.897,
    "end": 3268.138,
    "text": "The higher bar to pass is this concept of ontological emergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3268.218,
    "end": 3271.499,
    "text": "Like it really becomes a thing in and of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.099,
    "end": 3276.1,
    "text": "And the author writes that that's related to these two ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.0,
    "end": 3284.846,
    "text": " that first, that some properties of the macro system cannot be reduced to the structural properties of the component parts and their governing microdynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3285.506,
    "end": 3288.468,
    "text": "So that's sort of anti-reductionism or holism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.849,
    "end": 3292.952,
    "text": "Where that exists, there's a strong argument that you're kind of losing something if you keep on dissecting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.008,
    "end": 3299.392,
    "text": " And then two, because of this irreducible properties, a macro-level system has ontological status, e.g.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3299.513,
    "end": 3300.954,
    "text": "is an entity in its own right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.814,
    "end": 3305.437,
    "text": "So that just is a good question to think about and to ask the author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.118,
    "end": 3308.44,
    "text": "Just which systems are unidirectional integrators?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.241,
    "end": 3311.703,
    "text": "Which systems are bidirectional?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3313.204,
    "end": 3314.345,
    "text": "How do we know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3314.725,
    "end": 3315.606,
    "text": "Why does it matter?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.447,
    "end": 3318.889,
    "text": "Those are just all good questions to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.829,
    "end": 3322.672,
    "text": "So another question that I have is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.464,
    "end": 3328.866,
    "text": " to what degree do these new properties have to exist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.246,
    "end": 3336.228,
    "text": "Like if we're gonna quantify emergence in the very quantitative sense, is it any number greater than zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.968,
    "end": 3348.292,
    "text": "Or where are we drawing the line at what number of emergent properties or what quantity of new properties creates a new system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.284,
    "end": 3364.234,
    "text": " Yeah, it comes up with integrated information theory and a lot of other quantitative measures of integration and consciousness because it's like, okay, so if this system's one and this one's 100,000, are you going to have now a second level theory like 500 is the cutoff?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.914,
    "end": 3369.297,
    "text": "Or is it true that I could trade one of these for 100,000 of these?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.437,
    "end": 3376.282,
    "text": "Once you start putting everything on a numerical value and then that becomes your action selection metric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3376.502,
    "end": 3376.562,
    "text": "Oh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3377.512,
    "end": 3380.815,
    "text": " If it's worth the square root of this, then it's worth this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3381.575,
    "end": 3386.66,
    "text": "So it sets up a market for action based upon these metrics, which is pretty interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3386.76,
    "end": 3388.661,
    "text": "That's a bidirectional emergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.223,
    "end": 3397.368,
    "text": "Figure three is using the Markov blanket partitioning to look at the squid system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.331,
    "end": 3403.353,
    "text": " So the squid is like user one, resource two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.874,
    "end": 3406.775,
    "text": "So for species one, it's the squid, bacteria, system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.935,
    "end": 3411.878,
    "text": "So species pair one is the squid and its first user and second resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.438,
    "end": 3414.699,
    "text": "V Fisherize, you two are one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.719,
    "end": 3420.302,
    "text": "So these show the two kinds of interfaces, like they're encircling each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.363,
    "end": 3426.686,
    "text": " So it's kind of like embedded, one is embedded within the other from a causal perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.726,
    "end": 3439.074,
    "text": "They're the niche for each other because even though when you put them on the two-dimensional map, they're all just like flat there on the plane, their nearest neighbors are either themselves or the other one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.694,
    "end": 3449.24,
    "text": "So that's kind of a cool way to expand the topology of just the histology of the tissue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.205,
    "end": 3456.509,
    "text": " and then pull out like, hey, actually, you know, each beta cell in the pancreas is surrounded by other cells that aren't beta cells, something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.17,
    "end": 3463.694,
    "text": "And the other ones in a weird sense are also surrounded by the other kind of cell, even though there's a lot more of this non-beta cell type.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.214,
    "end": 3469.457,
    "text": "So just a cool way to look at tissue interactions from the Markov blanket perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.3,
    "end": 3473.48,
    "text": "Anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.5,
    "end": 3473.92,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3474.361,
    "end": 3474.521,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.021,
    "end": 3475.802,
    "text": "No, no, I'm good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.322,
    "end": 3476.522,
    "text": "Four?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.583,
    "end": 3479.404,
    "text": "You want to describe four or what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.137,
    "end": 3493.681,
    "text": " So here in this figure, it shows the squid cycle, which we have talked about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.061,
    "end": 3495.822,
    "text": "We just kind of talked about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.862,
    "end": 3502.185,
    "text": "So it shows at time zero, the squid is resting after venting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.205,
    "end": 3506.747,
    "text": "So there's some Vibrio fischeri left inside of the squid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.767,
    "end": 3508.588,
    "text": "They're not like, you know, sterilizing themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.808,
    "end": 3510.889,
    "text": "And so there's, this is the repopulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.833,
    "end": 3513.274,
    "text": " of Vibrio fischeri.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.354,
    "end": 3519.376,
    "text": "And so then after 12 hours, there's a high density of Vibrio fischeri.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.156,
    "end": 3528.419,
    "text": "And then it shows this degree of... So on the y-axis, this degree of integration is the degree of biocognitive individuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.02,
    "end": 3537.203,
    "text": "And so right here, when there's the most squid inside Vibrio fischeri, that's when there's the peak of integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.677,
    "end": 3542.759,
    "text": " Presumably because the squid with, you know, three vibrio fischeri inside of it is not going to light up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.179,
    "end": 3549.903,
    "text": "But when it concentrates and has a whole lot of the vibrio fischeri inside of the light organ, then that's when it's luminescent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.923,
    "end": 3564.149,
    "text": "And that's when, you know, the novel properties, so like the, you know, well, the, you know, vibrio fischeri alone wouldn't be sufficient to be, like there's not enough of them to be, you know, luminescent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.896,
    "end": 3571.14,
    "text": " And then the squid alone without the Vibrio fischeri doesn't light up and then is not capable of predation in the way that it normally does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.801,
    "end": 3575.143,
    "text": "And so it's the peak of integration happens right before the sun comes up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.263,
    "end": 3582.367,
    "text": "And then at dawn, the Vibrio fischeri are expelled and then the bioluminescence is over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.387,
    "end": 3591.353,
    "text": "So that's kind of when there's no integration between the two or limited or minimal integration between the two species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.322,
    "end": 3613.87,
    "text": " thanks for the explanation so a few things on this it's like there's no single cut off this dashed line it's kind of like how many grains of sand in a heap like one is usually you know too few but a hundred maybe you're getting there so it's this continuum of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.23,
    "end": 3619.131,
    "text": " cognitive embeddedness and of emergent function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.731,
    "end": 3623.692,
    "text": "And there is an actual time that that is most functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3624.212,
    "end": 3628.953,
    "text": "And that's just because the world has an actual structure where there's a certain time where there's the most light and it's the darkest outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3629.774,
    "end": 3631.174,
    "text": "And then there's a time where it's ineffective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3631.674,
    "end": 3634.915,
    "text": "So if we can discount it when it's ineffective and low density,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.836,
    "end": 3647.903,
    "text": " and we can say that this is like the peak of that natural variability when it's the most bright of the bioluminescence and the most dark outside, there's something that's varying between those two levels",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3648.891,
    "end": 3662.139,
    "text": " And so this was just a cool way to show that, that there's a smooth increase and that it's a little bit like model specific where we choose to draw the line with who's the biological cognizer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.959,
    "end": 3667.962,
    "text": "So this was a cool pattern and to include the environmental variation in the cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.503,
    "end": 3670.704,
    "text": "So it's not like, here's when you're good at taking tests or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.224,
    "end": 3673.085,
    "text": "It was like, here's the environment as it changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.185,
    "end": 3674.866,
    "text": "And then here's how the organism is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.467,
    "end": 3677.388,
    "text": "This reminds me of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.847,
    "end": 3680.008,
    "text": " you know, building a nightlight out of fireflies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.028,
    "end": 3682.328,
    "text": "So I don't know in California, do you guys have fireflies there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.368,
    "end": 3685.269,
    "text": "When I was a little kid, they were everywhere on the East Coast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.369,
    "end": 3688.93,
    "text": "And so we would catch fireflies, but like how many fireflies does it take to make a nightlight?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.21,
    "end": 3692.19,
    "text": "Like you can't have one fire, well, it depends on the size of your jar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.21,
    "end": 3695.471,
    "text": "And how many can you catch?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.491,
    "end": 3697.812,
    "text": "Like you can't create a nightlight with one firefly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.832,
    "end": 3698.852,
    "text": "Like there's just not enough light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.152,
    "end": 3702.673,
    "text": "But if you get like, you know, 20 in there, then you have a good like nightlight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.914,
    "end": 3705.354,
    "text": "So true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.834,
    "end": 3706.674,
    "text": "How many make a party?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3707.617,
    "end": 3707.937,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.878,
    "end": 3709.138,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3709.579,
    "end": 3710.279,
    "text": "This is fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.16,
    "end": 3714.943,
    "text": "Philosophical implications of the Vibrio squid symbiosis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.884,
    "end": 3722.829,
    "text": "So just a nice argument by nature approach that I'm sure we could learn more about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3723.169,
    "end": 3726.072,
    "text": "How do you go from an observation in the natural world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.512,
    "end": 3730.395,
    "text": "Oh, this bird, you know, the one with this chromosome set does this for this long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3730.515,
    "end": 3734.759,
    "text": "Ergo, this is possible, or this is something about nature in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.158,
    "end": 3745.384,
    "text": " So there are three philosophical implications that are exposed by this striking association between the vibrio and the squid that are significant to the account of symbiotic minds which follows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.084,
    "end": 3751.468,
    "text": "So the first one is that the vibrio squid is a clear example of a symbiotic physiological individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.64,
    "end": 3761.626,
    "text": " And that's distinguished from the other non-physiological individual systems like collections of physiological individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.086,
    "end": 3770.732,
    "text": "You know, if I eat food, the other person doesn't get the nutrients, but then you go, okay, but one person eating does provide the nutrients for another person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.792,
    "end": 3777.816,
    "text": "So it's gonna be a continuum and there's all, that's like sort of the complexity of it, but it's a great example of integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3779.137,
    "end": 3779.597,
    "text": " Like I like it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.118,
    "end": 3783.719,
    "text": "And then the second one is physiological individuals are matters of degree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.4,
    "end": 3788.642,
    "text": "Over time, the same living system can be more or less of a symbiotic physiological individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.682,
    "end": 3798.907,
    "text": "So I think that really takes that almost unsaid criticism of the first point and immediately builds on it to say like, yes, it is a continuum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.967,
    "end": 3805.43,
    "text": "And that's the whole interesting part is you can see how the system's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3806.633,
    "end": 3808.153,
    "text": " cognitive interfaces change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.193,
    "end": 3809.554,
    "text": "And that's the interesting story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.094,
    "end": 3816.776,
    "text": "Like for humans, certainly our ability to do something alone in a room is gonna change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.016,
    "end": 3818.117,
    "text": "When we're born, it's very low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.657,
    "end": 3822.278,
    "text": "And then there's an age range where you can do some task alone in a room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.078,
    "end": 3824.038,
    "text": " And then eventually there isn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.198,
    "end": 3826.639,
    "text": "So it's like, that is something that varies continuously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.699,
    "end": 3831.882,
    "text": "Just like there's the daily rhythm, there's a likely rhythm to some cognitive elements of all systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.602,
    "end": 3834.703,
    "text": "So it's not reducing them or explaining them away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.183,
    "end": 3839.084,
    "text": "It's actually looking at that variability and what it says about the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.925,
    "end": 3848.228,
    "text": "And then the last philosophical implication may be thrown into relief when asking the critical question, what is it that produces the bioluminescence?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.948,
    "end": 3852.19,
    "text": "The squid, the bacteria, or the temporary assemblage of these organisms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.05,
    "end": 3857.494,
    "text": " So is that a thing that deserves a noun of itself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.014,
    "end": 3866.221,
    "text": "Because we have nouns for assemblages of other things of one type, like a barrel of oil or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3866.401,
    "end": 3868.143,
    "text": "But is there a unit and a noun?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3868.683,
    "end": 3876.07,
    "text": "Or are we left to describe this only with a process and then default implicitly back to the Darwinian replicator of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3876.81,
    "end": 3880.372,
    "text": " oh, the squid is just trying to reproduce and the bacteria is doing competition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3880.812,
    "end": 3890.416,
    "text": "So they're the individuals, ergo, it's a tenuous relationship, or it's an inter interaction ecologically, but it's not a thing in and of itself, because it's not the replicator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3891.456,
    "end": 3894.317,
    "text": "So those are great questions raised by the author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.538,
    "end": 3898.979,
    "text": "So questions that I maybe have for the author.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.879,
    "end": 3904.781,
    "text": "So the bioluminescence is there in the Vibrio fischeri.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.562,
    "end": 3906.082,
    "text": "It's just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.664,
    "end": 3913.81,
    "text": " self-detectable by us or presumably by the prey that the Vibrio fischeri is hunting, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.95,
    "end": 3920.975,
    "text": "So I think it's, again, like it's a continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3921.095,
    "end": 3926.359,
    "text": "It's not there is bioluminescence or there's not bioluminescence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.379,
    "end": 3932.784,
    "text": "There's like more or less bioluminescence or detectable bioluminescence that occurs at, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.564,
    "end": 3949.331,
    "text": " ex lumens right so so what is the the um the the line there that is drawn good question so here's one of the last points in the discussion today it's again integrating cognitive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.39,
    "end": 3969.353,
    "text": " and functional and physiological individuality together and then um what is in the background of you why are those when we say individuality and we have to qualify it by saying well i mean informational or i mean physiological what are we qualifying it implicitly or explicitly against",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.221,
    "end": 3983.434,
    "text": " I think the materialist worldview might suggest that the individual is like just the one corpuscular entity, like the one thing that can be separated out, like the ant is the nestmate worker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3983.835,
    "end": 3991.443,
    "text": "Now, there's an argument for the ant being the colony and the nestmate being a tissue, but people say, oh, I saw 10 ants on the windowsill, not like I saw...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.443,
    "end": 3994.285,
    "text": " a thousandth of an ant on the windowsill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.785,
    "end": 4001.831,
    "text": "So there's, I think, a pure materialist argument for just separability and that having the more noun-like characteristic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.492,
    "end": 4011.039,
    "text": "And then the author is arguing that there's this folk biological concept that sometimes prevents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.88,
    "end": 4022.525,
    "text": " thinking about physiological individuals as real uh bona fide individuals and that's this like evolutionary individualism model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.724,
    "end": 4044.359,
    "text": " uh which can even have a collaborative or optimistic bent to it but it still draws lines around what levels of individuality exist in the world because they're the ones that most cleanly resemble darwinian replicators so not the systems that grow slowly outwards or transfer through different media in the same way and then the argument is that fep",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.68,
    "end": 4059.992,
    "text": " and its corollary active inference, the mirror and adaptive and the continuum between like we talked about offer an ideal program for bringing our folk psychological intuitions in line with the way nature has carved its own joints over evolutionary timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.053,
    "end": 4062.954,
    "text": "So that's an interesting claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4066.557,
    "end": 4067.098,
    "text": "Definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.399,
    "end": 4068.639,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.9,
    "end": 4071.181,
    "text": "Last slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.801,
    "end": 4072.922,
    "text": "This was like a William Blake",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.248,
    "end": 4082.551,
    "text": " that I thought of when I saw the unidirectional, the bird, a nest, the spider, a web, man, friendship, people, friendship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4082.851,
    "end": 4086.432,
    "text": "So it's a great description of kind of this modification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4086.452,
    "end": 4091.454,
    "text": "And I think it's getting at this idea that there's niche modification",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4092.955,
    "end": 4097.32,
    "text": " in nature and we do it, that's sort of the unambiguous part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.821,
    "end": 4101.224,
    "text": "We change our environment, but then we're also our own environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.226,
    "end": 4107.411,
    "text": "So then there's some dynamics of like culture and communication and being each other's niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4108.413,
    "end": 4112.636,
    "text": " that are very different than the bacteria changing the pH of a solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.656,
    "end": 4116.078,
    "text": "It can go up, it can go down, but it's still pH.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.779,
    "end": 4122.863,
    "text": "But then there's this different boundedness to what can happen with humans working together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4123.904,
    "end": 4131.029,
    "text": "So that just brought a close to these few questions like, where is the multi-scale integration happening?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.894,
    "end": 4140.359,
    "text": " And then how do we identify the unidirectional components and the reciprocal components and a great paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.8,
    "end": 4151.246,
    "text": "So just a final thought and something that I've thought about a lot in terms of reading this paper, because it's this colonization of the squid by this bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.426,
    "end": 4154.568,
    "text": "I think a lot about us and our colonization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.608,
    "end": 4159.391,
    "text": "I mean, there are more non-human cells in the body than there are human cells, which is fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4160.123,
    "end": 4169.906,
    "text": " So but we also have the ability to manipulate our niche, our internal niche, the niche of the microbes that reside within us through taking antibiotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.146,
    "end": 4180.669,
    "text": "But there are lots of other things, probiotics and not just antibiotics, but but just even what you eat and where you go and how whether you're breastfed or not or go through vaginal birth or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.729,
    "end": 4182.75,
    "text": "And all of these things contribute to your own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.348,
    "end": 4210.058,
    "text": " inoculation or how you inoculate your children and this is something that you can do like literally you can change the composition of your microbiota like through your lifetime so is that niche modification is it what is that exactly i think it's one reason why a um not neutral or um unbiased but flexible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.42,
    "end": 4225.649,
    "text": " integration model, like being presented here, we can just say, okay, rather than wondering whether it falls on one side or the other of a binary classification, like, yes, it's symbiotic or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4226.329,
    "end": 4232.573,
    "text": "We just have a descriptive framework first, and then you can think about the implications later or separate them somehow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4232.653,
    "end": 4237.696,
    "text": "But we hope that if you're listening in the right time, you'll join us for the 30.1 and 0.2, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4241.664,
    "end": 4250.27,
    "text": " The author hopefully will join for at least the first one, and it's cool topics, and we can do a little bit like we did in 29.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.051,
    "end": 4252.312,
    "text": "Let's think of some systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.653,
    "end": 4254.814,
    "text": "Are they unidirectional?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.074,
    "end": 4256.055,
    "text": "Are they reciprocal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4258.176,
    "end": 4260.258,
    "text": "What reciprocal systems could exist?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4260.318,
    "end": 4261.078,
    "text": "Like, what does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4261.098,
    "end": 4261.138,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4262.81,
    "end": 4263.251,
    "text": " Sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.411,
    "end": 4263.571,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.771,
    "end": 4268.036,
    "text": "Thanks, people who are listening and Stephen for the questions live.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4268.497,
    "end": 4270.599,
    "text": "Thanks, Blue, for collaborating on the slides here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4271.3,
    "end": 4275.425,
    "text": "And thanks to the author, too, for providing us such great food for thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4276.045,
    "end": 4276.826,
    "text": "Totally agreed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4277.567,
    "end": 4279.129,
    "text": "So thanks and see you later.",
    "speaker": "SPEAKER_01"
  }
]