[
  {
    "start": 7.27,
    "end": 9.197,
    "text": " Hello, welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.363,
    "end": 16.874,
    "text": " This is Active Inference Guest Stream number 121.1 on September 23rd, 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.934,
    "end": 28.291,
    "text": "We're with Mike Wiest, who will be presenting and then discussing OR on neuronal MTs is the quantum substrate of conscious active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.872,
    "end": 31.476,
    "text": "So Mike, thank you for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.616,
    "end": 36.223,
    "text": "Looking forward to your presentation and to the questions people write in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.344,
    "end": 37.766,
    "text": "So take it away, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.946,
    "end": 38.627,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.215,
    "end": 39.876,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.377,
    "end": 42.98,
    "text": "Okay, so yeah, here's my title.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.641,
    "end": 50.711,
    "text": "What I'm going to try and convince you of is, so ORCOR here stands for Orchestrated Objective Reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.751,
    "end": 52.634,
    "text": "I'll explain what I'm talking about there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.774,
    "end": 54.517,
    "text": "And MTs are the microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.298,
    "end": 58.602,
    "text": "And so here's an outline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.662,
    "end": 62.708,
    "text": "Uh-oh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.924,
    "end": 63.285,
    "text": " There we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.305,
    "end": 65.635,
    "text": "Here's an outline of what I want to talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.675,
    "end": 73.204,
    "text": "The second part here is the active inference proposal, but I want to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.353,
    "end": 88.066,
    "text": " start by talking about some evidence to make it plausible to you that microtubules may be the quantum substrate of consciousness before I go on to the specific active inference proposal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.026,
    "end": 102.718,
    "text": "I'm going to mention, I don't think we'll have time to talk about this, but there's another paper I published recently which addresses some of the more famous conceptual problems with regard to consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.884,
    "end": 106.472,
    "text": " I'm not sure if we'll get to those, but I'm happy to talk about those if we have time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.575,
    "end": 112.806,
    "text": "But I figured for this venue, we want to focus on the active inference side of the story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 113.448,
    "end": 116.134,
    "text": "And so before I start getting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.325,
    "end": 133.477,
    "text": " diving into these details of experimental evidence I want to talk about, let me just summarize the overall proposal we're making with regard to active inference that I'm going to be building up to so that you don't lose the thread of what I'm trying to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.497,
    "end": 139.489,
    "text": "So this is our graphical abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.705,
    "end": 144.45,
    "text": " where I've kind of got two columns here and three rows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.831,
    "end": 155.343,
    "text": "At the top is the most abstract level, the theory of active inference that describes optimal behavior of an agent in this mathematical formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.364,
    "end": 164.633,
    "text": "There is a coarse functional mapping of that theory onto parts of the brain, including",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.507,
    "end": 173.061,
    "text": " details like specific neuromodulators having specific functional roles in the active inference theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.141,
    "end": 183.561,
    "text": "So that match between neurophysiology and neuroanatomy and the theory supports that real brains do use active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.585,
    "end": 188.19,
    "text": "But then the bottom part is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.44,
    "end": 190.062,
    "text": " is about the implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.883,
    "end": 202.64,
    "text": "So, so far most active or all active inference process models, which attempt to say how neurons might implement active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.464,
    "end": 217.941,
    "text": "This X at the bottom of the picture there by the classical neural implementation is meant to indicate that it seems, or at least it has not been established that Hodgkin and Huxley",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.355,
    "end": 248.637,
    "text": " based classical models, meaning classical models that incorporate the actual conductances that generate action potentials in neurons have not established that those kinds of neurons, those kinds of models can perform the necessary sophisticated mathematical operations fast enough to implement active inference in real time for like sub-second decision-making and inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.022,
    "end": 250.063,
    "text": " and motor control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.545,
    "end": 263.541,
    "text": "The other side is our proposal saying that, you know, I want to emphasize that I'm accepting active inference as, at least the first approximation, a good description of what the brain does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.061,
    "end": 273.814,
    "text": "What we're questioning is the implementation of it in terms of classical neurons and proposing instead that we have to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.975,
    "end": 288.471,
    "text": " We have to resort to a quantum model of how neurons work, and in particular, taking into account quantum effects in microtubules inside neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.491,
    "end": 297.381,
    "text": "So that's the overall proposal that essentially microtubules are going to implement conscious active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.401,
    "end": 300.645,
    "text": "But before I come to the active inference part of the story, I want to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.693,
    "end": 310.885,
    "text": " I want to convince you that there is at least evidence that microtubules may be the substrate of quantum consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.346,
    "end": 324.021,
    "text": "I'll start from the point of view of how anesthetics render us reversibly unconscious and a bit of experimental evidence from my lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.782,
    "end": 328.607,
    "text": "To introduce this part about anesthesia,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.958,
    "end": 335.49,
    "text": " Here's a quote from Claude Bernard, one of the original investigators when we discovered anesthetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.271,
    "end": 339.978,
    "text": "And he made this bold conjecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.559,
    "end": 343.845,
    "text": "He said, what is alive must sense and can be anesthetized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.166,
    "end": 345.087,
    "text": "The rest is dead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.508,
    "end": 351.439,
    "text": "And so for him, the ability to be anesthetized was almost a definition of life itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 351.419,
    "end": 378.372,
    "text": " And he was basing that on the fact that the same anesthetic gases, I'm focusing on volatile anesthetics now, the same anesthetic gases that render us and other mammals reversibly unconscious also reversibly slow movement or stop movement in invertebrates, single-celled organisms with no neurons, and even plants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.55,
    "end": 392.511,
    "text": " This chart I got up here is a table from a recent review of mechanisms, potential molecular targets of these volatile anesthetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.572,
    "end": 396.538,
    "text": "You can see people have many candidates, targets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.54,
    "end": 406.114,
    "text": "In neuroscience, people tend to focus on ion channels and neurotransmitter receptors because those are what govern the electrical activity of neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.094,
    "end": 426.66,
    "text": " But there are other potential targets, and I'm going to focus on the cytoskeletal elements known as microtubules, which we have in common with everything else that is alive, as well as ion channels are present in single-celled organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.942,
    "end": 435.932,
    "text": "Moving forward, I want to present this context that I'm comparing two different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.958,
    "end": 444.187,
    "text": " types of model of what consciousness might be and how anesthetics might reversibly render us unconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.868,
    "end": 455.602,
    "text": "The classical network picture is that it's a pattern of neural activity across our brain, distributed across our brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 456.683,
    "end": 462.831,
    "text": "And something about when it is functionally integrated is what makes us conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.553,
    "end": 477.715,
    "text": " Both these types of models emphasize functional integration over raw neural activity as the neural substrate of consciousness, but the quantum picture suggests that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.201,
    "end": 490.835,
    "text": " The substrate of consciousness is actually, the physical substrate of consciousness is actually a physical state of oscillatory state of electric dipoles in microtubules inside neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.855,
    "end": 494.319,
    "text": "I'm going to tell you a little more about microtubules if they're not so familiar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.381,
    "end": 507.094,
    "text": "But these are the two types of models that we're comparing as we look at the evidence about how anesthetics work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.293,
    "end": 522.316,
    "text": " Because these volatile anesthetics bind to many different proteins in the body, contemporary researchers tend to assume that they work by acting on some combination of multiple targets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.937,
    "end": 530.989,
    "text": "However, there are some classical results that suggest instead that they might act primarily on one main target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 531.644,
    "end": 549.771,
    "text": " And this first panel here at panel A is showing the so-called Meyer-Overton correlation between solubility and olive oil and how much of that molecule you need to render someone or an animal unconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 551.236,
    "end": 563.994,
    "text": " The solubility in olive oil, we understand in terms of a hydrophobic binding, a lipophilic kind of binding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.174,
    "end": 577.834,
    "text": "So people think that these, or we know that these molecules bind into lipophilic or hydrophobic pockets inside many different proteins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.814,
    "end": 593.719,
    "text": " But the reason that this correlation suggests a one primary or so-called unitary molecular target is that all these molecules that you see in the chart are diverse chemically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 594.46,
    "end": 600.75,
    "text": "Some of them are even just single atoms, elements, xenon and nitrogen are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.54,
    "end": 604.823,
    "text": " anesthetics at sufficient concentration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 605.584,
    "end": 629.387,
    "text": "And so the fact that these are chemically diverse but having similar functional effects suggests that they are operating not by a chemical lock and key, key and lock kind of specific binding, but some more nonspecific physical interaction like van der Waals interactions among protein dipoles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.633,
    "end": 632.476,
    "text": " So that's thing one on this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.856,
    "end": 643.452,
    "text": "Panel B here is showing another fact that suggests it may not be many targets that are relevant, but one main one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.852,
    "end": 652.084,
    "text": "And what panel B is showing is the approximate additivity of doses of different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.064,
    "end": 669.769,
    "text": " um anesthetics so that half of a dose of benzene plus half of a dose of cyclopropene adds up to about one full dose and these pairs on this chart are chosen for having different effects on particular ion channels",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.749,
    "end": 680.605,
    "text": " Like I think isoflurane here interacts strongly with GABA receptors, the inhibitory receptors in the brain, but cyclopropane does not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.226,
    "end": 687.875,
    "text": "But nevertheless, when you add half of a dose of cyclopropane to half a dose of isoflurane, you get a full dose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.416,
    "end": 695.807,
    "text": "So these kind of data argue against the combination idea of how anesthetics work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.952,
    "end": 699.536,
    "text": " And in fact, well, yeah, I'll leave it there for now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.138,
    "end": 724.292,
    "text": "So in terms of what could this one primary molecular target be, you know, I'm gonna say microtubules, and we have a strong theoretical basis for saying that from this quantum chemical simulation study, which essentially reproduced",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.167,
    "end": 739.21,
    "text": " a correlation like this about the binding in terms of how well about seven of these anesthetics bind to particular spots on microtubules and disrupt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.949,
    "end": 742.051,
    "text": " oscillations in those microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 742.112,
    "end": 745.896,
    "text": "Tubulin here are the subunits that make up microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.497,
    "end": 763.877,
    "text": "And so this theoretical study essentially reproduces a Meyer-Overton correlation, predicts which molecules are going to be anesthetics and which ones are not by how well they disrupt these oscillations in tubulin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.379,
    "end": 768.943,
    "text": "So that cannot be said for any other candidate molecular",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.801,
    "end": 772.858,
    "text": " target of these volatile anesthetics so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.834,
    "end": 778.542,
    "text": " maybe microtubules really are the relevant functional target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.562,
    "end": 779.984,
    "text": "So quickly, what are they?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.945,
    "end": 786.975,
    "text": "They are literally tubes inside all cells, not just neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.995,
    "end": 801.158,
    "text": "But in neurons, they, well, and so in a biology class, you first learn that they're called part of the cytoskeleton because they're stiff and they act somewhat like bones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 801.138,
    "end": 812.133,
    "text": " but it is a stereotype to think of them as purely structural because they have many functional roles in single cells and in neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.393,
    "end": 822.788,
    "text": "And in neurons, they have special organizations and accessory proteins that are different in the axon and the dendrites.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.808,
    "end": 830.959,
    "text": "And I have this one slide just to stand for the general message that they are not just tent poles in there or railroad tracks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.192,
    "end": 838.842,
    "text": " They are participating in all kinds of dynamic information processing and coordination of movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 838.862,
    "end": 851.959,
    "text": "So in this beautiful dance of the chromosomes during mitosis, it's microtubules that are choreographing that dance and actually pulling things apart, doing the movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.039,
    "end": 859.208,
    "text": "And in single cells, they are responsible for swimming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.099,
    "end": 878.221,
    "text": " There's a lot of literature about these kinds of phenomena that I'm not going to go into, but this is to plant the idea in your head that we already know that microtubules are not just tent poles or railroad tracks in Iran.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.241,
    "end": 884.368,
    "text": "Okay, so now coming to my modest experimental contribution to this story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.007,
    "end": 901.598,
    "text": " we wanted to test whether microtubules were are a functional target of uh anesthetics in this case um isoflurane anesthesia that's used in people as well as in animals and we found so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.675,
    "end": 916.854,
    "text": " This drug, epothylon B, is a drug that binds to microtubules and that gets into the brain, a brain penetrant microtubule binding drug, unlike many of the other microtubule binding drugs that are out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.236,
    "end": 921.24,
    "text": "And when we gave that to our rats, the simple result was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.013,
    "end": 931.387,
    "text": " they were somewhat resistant to isoflurane anesthesia as measured by how long it took them to fall unconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.068,
    "end": 940.54,
    "text": "And so we used latency to loss of writing reflex as our proxy for time to fall unconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.92,
    "end": 946.789,
    "text": "The writing reflex is if you tip them on their back, if they're awake, they will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.769,
    "end": 967.36,
    "text": " flip themselves back over and so when they don't flip themselves back over that's how you know when they're unconscious and so here's our results showing a actually a large effect size 69 seconds longer to fall asleep with that microtubule binding drug than without it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.926,
    "end": 975.694,
    "text": " So this by itself does not at all mean that microtubules are doing anything quantum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.134,
    "end": 984.804,
    "text": "So we can consider how might microtubules contribute to anesthesia under these two different kinds of pictures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.525,
    "end": 998.68,
    "text": "And so under the classical picture, one of the important functions of microtubules in neurons is as train tracks for the cute little munchkins that carry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.66,
    "end": 1003.627,
    "text": " synaptic vesicles and other packages to where they need to go inside the neuron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.168,
    "end": 1025.92,
    "text": "So perhaps anesthetics disrupt that fast axonal transport, which could plausibly lead to synaptic malfunction, reduce activity levels, and reduce functional integration, which under the classical picture is necessary for consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.342,
    "end": 1028.464,
    "text": "However,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.545,
    "end": 1031.27,
    "text": " That doesn't seem to be supported by what we know so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1031.911,
    "end": 1044.853,
    "text": "So there are a couple studies showing that isoflurane does affect synaptic transmission, but those studies looked at the molecular mechanisms by which it did, and they did not involve microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.715,
    "end": 1048.9,
    "text": "In one case, it involved mitochondria instead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.825,
    "end": 1053.451,
    "text": " So at present, that picture doesn't seem supported.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.631,
    "end": 1061.183,
    "text": "And in any case, one might doubt if it would be a fast enough mechanism to account for falling unconscious in a few minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.228,
    "end": 1074.043,
    "text": "Before I go on to the quantum point of view, let me mention this cool result in tadpoles showing that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.842,
    "end": 1089.381,
    "text": " They engineered a drug that's not one of these volatile anesthetics to mess with microtubules, and they were able to reversibly stop their tadpole from swimming around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.082,
    "end": 1100.898,
    "text": "So this is evidence consistent with the idea that anesthetics might be acting on microtubules, and microtubules might be the substrate of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.539,
    "end": 1104.604,
    "text": "So here is the abstract from...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1104.871,
    "end": 1107.154,
    "text": " my rat paper that I was just talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.234,
    "end": 1111.078,
    "text": "I'm not going to read it, but just focus on this last sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.158,
    "end": 1119.248,
    "text": "This finding is predicted by models that posit consciousness as a property of a quantum physical state of neural microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.229,
    "end": 1128.178,
    "text": "So I want to take a moment to say what the motivation for this quantum point of view is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.462,
    "end": 1134.574,
    "text": " because it's often ridiculed as explaining one mysterious thing with another mysterious thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.316,
    "end": 1144.294,
    "text": "No, the motivation for the quantum view of consciousness is that a quantum model is going to solve a fundamental problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.118,
    "end": 1148.702,
    "text": " that cannot be solved by a classical model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.383,
    "end": 1154.089,
    "text": "And it's a problem that you don't need jargon or math to understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.529,
    "end": 1156.812,
    "text": "It's known as the phenomenal binding problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.232,
    "end": 1160.156,
    "text": "Here's a way it's expressed in a neuroscience textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.636,
    "end": 1169.607,
    "text": "Exactly how the parallel streams of sensory data are melded into or fused into perception, images, and ideas remains the holy grail of neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.004,
    "end": 1175.63,
    "text": " And I like this Dali painting as a way of illustrating that idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.691,
    "end": 1185.604,
    "text": "It's a portrait of his wife where she's made out of molecules, but somehow we have these unified conscious experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1185.664,
    "end": 1186.546,
    "text": "How do we explain that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.046,
    "end": 1196.339,
    "text": "And here's how the famous American psychologist William James expressed this problem already in his book around 1900.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.399,
    "end": 1200.505,
    "text": "He said,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1200.94,
    "end": 1216.401,
    "text": " So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.803,
    "end": 1219.325,
    "text": " If each one is thinking of a word, there's no sentence there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1220.246,
    "end": 1225.852,
    "text": "His point was this applies to neurons just as much as to people standing next to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.912,
    "end": 1228.675,
    "text": "And the neurons are not even touching each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.735,
    "end": 1230.376,
    "text": "There's a synaptic gap between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.476,
    "end": 1237.603,
    "text": "So how do we form these unified, holistic, conscious experiences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.663,
    "end": 1242.388,
    "text": "That is what I'm saying a quantum model can do because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.79,
    "end": 1254.77,
    "text": " Quantum physics is all about irreducible holes, W-H-O-L-E, like we experience, and there are no irreducible holes in classical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.458,
    "end": 1261.221,
    "text": "I'll pause in a moment, but let me...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.867,
    "end": 1264.769,
    "text": " say, the proposal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.069,
    "end": 1276.008,
    "text": "The proposal is that a quantum substrate of consciousness will provide that irreducible unity to account for the unity of consciousness and for its physical efficacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.89,
    "end": 1278.753,
    "text": "We can talk about that more if you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1279.755,
    "end": 1285.825,
    "text": "But so here's the Hameroff and Penrose hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.374,
    "end": 1290.4,
    "text": " I'll go fast about this review of quantum physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.601,
    "end": 1305.332,
    "text": "We know there's two parts to a quantum evolution, the local and deterministic part, and then a measurement where you find out what happens until then your wave function only describes probabilities of measurement outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.628,
    "end": 1330.442,
    "text": " And people often emphasize the non-deterministic nature of this, but what I want to emphasize is quantum physics is irreducibly holistic and involves non-local correlations that have been, and what I like to refer to as non-local coordination, which has been experimentally verified at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.232,
    "end": 1337.341,
    "text": " large macroscopic distances of kilometers and resulted in a Nobel Prize in 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.803,
    "end": 1358.252,
    "text": "So just illustrating the idea of wave function collapse and pointing out it's essentially a synonym for quantum state reduction when the distribution of possibilities we say collapses and one of those is actualized",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.481,
    "end": 1364.328,
    "text": " So quantum physics has a measurement problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.55,
    "end": 1370.737,
    "text": "It doesn't say what a measurement is or what causes the wave function to collapse or when it should collapse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.06,
    "end": 1381.633,
    "text": "Objective reduction is a theoretical point of view that says collapse is real, objective, not just epistemic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.653,
    "end": 1384.577,
    "text": "Okay, so it's a real physical process and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.873,
    "end": 1401.71,
    "text": " Schrodinger's cat is a fable to say that quantum theory without, if you try to leave out the measurements, that's ridiculous because then you should be, the theory predicts that there will be half dead cats and those are not observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.151,
    "end": 1408.658,
    "text": "So this story that people always talk about is to say, you can't leave out the measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.87,
    "end": 1435.084,
    "text": " um so uh here's a orchestrated objective reduction so objective reduction against against refers to a theory in which the collapse of the wave function is a real physical process and the orchestrated here is referring to in biology in animals this objective reduction has been orchestrated so that it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.195,
    "end": 1446.166,
    "text": " corresponds to our behavioral problems that we have to solve and helps us to solve them, helps to perceive the outside world and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.666,
    "end": 1455.816,
    "text": "So I'm saying OR associates quantum collapse events in nonliving matter with moments of so-called proto-consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.397,
    "end": 1459.08,
    "text": "It's not until you organize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.263,
    "end": 1470.608,
    "text": " larger chunks of matter like in a brain using microtubules and neurons to orchestrate those that you get something like our what we call consciousness rather than the proto-consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.432,
    "end": 1478.385,
    "text": "Okay, so far I haven't showed you much or any evidence for the quantum",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.513,
    "end": 1480.194,
    "text": " part of the story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1480.234,
    "end": 1483.979,
    "text": "Here's Hameroff and Penrose, the infamous Hameroff and Penrose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.84,
    "end": 1489.486,
    "text": "Penrose, everyone thinks he's a genius, but nobody believes anything he says.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1490.147,
    "end": 1490.788,
    "text": "What's up with that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.672,
    "end": 1507.09,
    "text": "OK, so now I'm going to get to some experimental evidence that microtubules can support quantum effects at room temperature here in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.217,
    "end": 1525.416,
    "text": " let me step back to say the reason this proposal has been around for 30 years, the reason people have considered it highly implausible and in fact ridiculed it habitually is that it was when we technologically try to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.396,
    "end": 1527.078,
    "text": " engineer quantum effects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.339,
    "end": 1531.362,
    "text": "It seems so far that we need things to be super cold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.403,
    "end": 1542.595,
    "text": "And so people thought the brain is just too hot to support quantum effects, functional quantum effects, functionally relevant quantum effects or macroscopic quantum effects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.615,
    "end": 1549.362,
    "text": "But now we have direct biophysical evidence in microtubules in vitro.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.692,
    "end": 1554.519,
    "text": " showing this quantum phenomenon called super radiance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1554.679,
    "end": 1557.023,
    "text": "It's analogous to lasing in a laser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1558.666,
    "end": 1559.988,
    "text": "It's at room temperature again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.048,
    "end": 1563.093,
    "text": "And moreover, the effect gets stronger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.134,
    "end": 1565.157,
    "text": "That's what this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.542,
    "end": 1568.007,
    "text": " this plot that's hard to read here is showing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.367,
    "end": 1572.135,
    "text": "The x-axis is number of tryptophan residues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.976,
    "end": 1578.186,
    "text": "You can think of that as essentially the size of the structure that you're making out of your microtubule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.228,
    "end": 1582.234,
    "text": "The basic result on this slide is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.619,
    "end": 1595.565,
    "text": " the quantum effect gets stronger as you make the microtubules into bigger structures which is the opposite of the usual prejudice which says that things as they get bigger they get less quantum",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.942,
    "end": 1607.232,
    "text": " So, so far I've shown evidence that microtubules can exhibit a quantum effect, a collective quantum effect at room temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.592,
    "end": 1609.414,
    "text": "Maybe it could happen at body temperature too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.096,
    "end": 1622.869,
    "text": "Now, this next slide is just to represent a whole bunch or a whole bunch of experiments and a series of papers from Anirban Bandiopadhyay's lab",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.537,
    "end": 1639.339,
    "text": " showing that, so he's measured microtubule, high frequency microtubule resonances, and he's able to stimulate them as well and show that they predict and control spiking activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.38,
    "end": 1647.37,
    "text": "So this is just a schematic to show he's measuring from multiple neurons in a dish now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.532,
    "end": 1652.518,
    "text": "And so without going into details here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.988,
    "end": 1678.843,
    "text": " the results I want to take are A, that microtubules interact with membrane voltage and spiking activity, and critically also, their effects span multiple neurons, which is going to be critical if this is going to be the basis of a solution for the binding problem, which is how do we unify neural activities that are happening centimeters apart in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.844,
    "end": 1681.847,
    "text": "Okay, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.489,
    "end": 1689.917,
    "text": " I take this to be important experimental work that not many people have heard about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.282,
    "end": 1696.63,
    "text": "And finally, for this part about experimental evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.771,
    "end": 1703.063,
    "text": "So here is evidence of a role for microtubules in living neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.465,
    "end": 1708.493,
    "text": "And here is one of a series of papers showing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.907,
    "end": 1715.612,
    "text": " an entangled quantum state in the alive human brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.313,
    "end": 1722.658,
    "text": "This made a little splash when it came out, but I don't hear people arguing about it anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.239,
    "end": 1724.179,
    "text": "They're just ignoring it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.621,
    "end": 1738.632,
    "text": "So these researchers just used a standard MRI machine, but dialed it to look for a different kind of signal that they argued would be a signal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.848,
    "end": 1741.01,
    "text": " representing quantum entanglement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.452,
    "end": 1753.004,
    "text": "They recorded a signal with their MRI machine that looked like an EMG of the heartbeat, which they argued should not be classically observable with an MRI machine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.044,
    "end": 1763.235,
    "text": "They saw the fidelity of this putative entanglement signal in the human brain correlate with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.924,
    "end": 1767.813,
    "text": " being awake versus asleep when one of their subjects fell asleep in their scanner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.295,
    "end": 1773.267,
    "text": "And they also correlated it with working memory performance in a different paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.667,
    "end": 1779.722,
    "text": "So that's direct biophysical evidence that we have a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.057,
    "end": 1787.231,
    "text": " macroscopic entangled quantum state in our brain, and it's actually related to our conscious function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.175,
    "end": 1802.2,
    "text": "In terms of people disbelieving this, there is one paper by one author who says he doesn't believe it, but he doesn't provide any alternative mechanism, classical mechanism to explain the signal that they observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.179,
    "end": 1831.697,
    "text": " here's a good place to pause and see if there are questions or clarifications objections sure i'll read one question from the live chat and then this is awesome so alex sabine wrote do the 12 people and the sentence integration gestalt of the sentence relate to the blind man and the elephant how um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.652,
    "end": 1835.837,
    "text": " It's a little different from The Blind Man and the Elephant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.878,
    "end": 1844.539,
    "text": "So The Blind Man and the Elephant is about how different people are getting different aspects of the reality and none of them see the full picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.738,
    "end": 1851.847,
    "text": " This example with the 12 men and the sentence, think of the men as representing neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.608,
    "end": 1863.803,
    "text": "And if each neuron represents one feature or word, let's change the example from a sentence to just seeing an orange chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.364,
    "end": 1867.708,
    "text": "The color orange may be represented by neurons in one place in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.975,
    "end": 1872.119,
    "text": " where the shape of the chair might be represented by neurons in another part of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.519,
    "end": 1880.027,
    "text": "So we can imagine two men standing next to each other or two neurons, one of them thinking orange and one of them thinking chair shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.389,
    "end": 1888.095,
    "text": "That does not add up to somebody having a thought of an orange chair or a perception of an orange chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.135,
    "end": 1895.502,
    "text": "That's what that example with the men thinking of a sentence is meant to illustrate, the binding problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.405,
    "end": 1916.477,
    "text": " That also reminds me of the Daniel Dennett thought experiment sequence that starts with a brain and separates it and continues to separate it and lump and split different components and get exactly at that, which is kind of like, but even this thought example of the 12 people, but already it's presupposed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.183,
    "end": 1935.698,
    "text": " each of them have a unity so then how do we how do we um approach that challenge of compositionality and and um unity and multi-composition systems yes so um this issue is um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.707,
    "end": 1953.139,
    "text": " I talk about in more detail in that other paper I mentioned, I'll just flash it up here, this one, where I describe how entanglement, quantum entanglement is the structure of that unity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.26,
    "end": 1958.53,
    "text": "So the entanglement among different parts of the brain,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.881,
    "end": 1967.055,
    "text": " which I'm hypothesizing, if that can happen, that provides a physical basis for which things are unified and which are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.156,
    "end": 1982.863,
    "text": "So in the Dennett experiment, if you start taking out or separating this neuron and that neuron or that brain area and that brain area, if they are no longer able to be quantum entangled, that's when this picture would predict you lose the unity of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.843,
    "end": 2005.83,
    "text": " so we don't have to it doesn't get all fuzzy and philosophical we can we have a physical basis for that unity of consciousness under this picture awesome carry on okay so i presented basically three lines of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.587,
    "end": 2020.706,
    "text": " three or four lines with the anesthesia story of evidence, experimental evidence for microtubules and for quantum effects in microtubules related to consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.689,
    "end": 2031.7,
    "text": "I'm just gonna mention here, there's a large literature that maybe people are not aware of about so-called quantum cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.439,
    "end": 2041.89,
    "text": " where people's answers to questions or judgments about things can appear irrational from a certain perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.732,
    "end": 2055.765,
    "text": "There are so-called question order effects and logical fallacies that can be explained if you do a quantum-like model of human cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.027,
    "end": 2061.872,
    "text": "That in itself doesn't mean the substrate has to be quantum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.105,
    "end": 2068.975,
    "text": " And this literature is largely agnostic about that or probably assumes it has a classical basis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.536,
    "end": 2071.259,
    "text": "But there's a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.44,
    "end": 2077.468,
    "text": "No one has shown you can get those kinds of effects from a classical model yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.85,
    "end": 2084.578,
    "text": "So I'm just pointing to that set of issues and that literature without a lot of discussion right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.281,
    "end": 2091.268,
    "text": "And now to make the transition to the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.552,
    "end": 2101.798,
    "text": " Active inference part of the story, I want to mention a paper by Fields et al., including Carl Friston and Michael Levin,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.96,
    "end": 2128.09,
    "text": " where they essentially derive that active inference and biology must be quantum physical i don't see people talking about that paper for some reason i maybe i get the impression that the first author chris fields is the only one who believes it and the other authors are just down there i'm not sure maybe maybe your viewers know more about that than i do um but so now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.711,
    "end": 2146.779,
    "text": " I'm going to come to the active inference part of the story and suggest that, among other things, this ORC-OR, orchestrated objective reduction in microtubules, can account for discrete cycles of perception and can implement active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.243,
    "end": 2153.269,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.349,
    "end": 2155.933,
    "text": "So here's a little bit of an expanded",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.943,
    "end": 2158.786,
    "text": " outline for the active inference part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.727,
    "end": 2168.599,
    "text": "I guess I will skim the introduction to active inference, but you can tell me if I should slow down for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.342,
    "end": 2173.166,
    "text": "But I'm assuming a lot of this audience has heard about that before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.907,
    "end": 2176.15,
    "text": "But then I'll spend a little time talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.108,
    "end": 2205.293,
    "text": " ways that it seems implausible that classical neurons classical neural models can actually implement active inference fast enough for real-time sub-second inference and then i'll talk about how orc or can solve so some of those problems potentially okay so um i want to approach this um active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.88,
    "end": 2212.178,
    "text": " with this quote referring to a quiet paradigm shift.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.198,
    "end": 2219.94,
    "text": "You know, in the last century, we had our Hodgkin-Huxley model, a deterministic Hodgkin-Huxley model of how neurons work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.612,
    "end": 2233.907,
    "text": " And then we had this quiet paradigm shift from that kind of deterministic signal processing to probabilistic inference and active inference, which is an outgrowth of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.968,
    "end": 2243.498,
    "text": "And I'm going to raise some questions about whether that works or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.305,
    "end": 2260.962,
    "text": " So in other words, there's a tension between the deterministic ways that we think neurons work, according to the Hodgkin-Huxley model, and the stochasticity that you need to assume in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.142,
    "end": 2269.671,
    "text": "And when I say that, I'm aware that the primary kinds of active inference models are deterministic as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.107,
    "end": 2271.689,
    "text": " but I'll clarify that in a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.05,
    "end": 2290.215,
    "text": "But so under active inference or probabilistic coding in general, our beliefs are represented by probability distributions that represent probabilities of different states of affairs being true, probabilities of different facts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.235,
    "end": 2296.945,
    "text": "And we update those beliefs by sensory observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.626,
    "end": 2299.388,
    "text": "And so here is Bayes'",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2300.262,
    "end": 2330.202,
    "text": " rule way of expressing this updating procedure where you have a prior belief about states of the world s and that is compared to some observations to generate an updated or so-called posterior belief based on the mismatch between or so-called prediction error the mismatch between your prediction and the observation and these um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.278,
    "end": 2335.044,
    "text": " The diagrams here are illustrating how this could be mapped onto neural anatomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.064,
    "end": 2356.257,
    "text": "If I just focus on the panel B here, it's showing three layers of cortex where the primary input from the thalamus that you can think of as sensory input comes into layer four, where those cells get sensory inputs on the purple lines and they get",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.304,
    "end": 2358.848,
    "text": " predictions from the black lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.348,
    "end": 2386.007,
    "text": "And so if those red cells can compare the predictions to the observations, that's how roughly we are imagining neurons computing prediction errors, the difference between what you thought was the case and what you observed, that are going to be used to update your beliefs, which again are these probability distributions saying how likely different things are to be true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.447,
    "end": 2396.678,
    "text": " Okay, so that was a general description of predictive processing, as it's called, or predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.46,
    "end": 2414.965,
    "text": "Inference generalizes that picture to include the agent's behavioral response among the states of the world that your probability distributions are modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.637,
    "end": 2422.214,
    "text": " And this picture shows a mapping of different variables in the active inference theory onto parts of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.234,
    "end": 2427.688,
    "text": "I won't dwell on this, but there's an impressive match between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.445,
    "end": 2458.063,
    "text": " variables in the theory and anatomy and also neurophysiology real neural responses and pathological responses can be accounted for all sorts of things can be accounted for behaviorally and neurally with this theory so it does so i want to emphasize that it's not this theory that i'm questioning it's the classical implementation okay given this uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.056,
    "end": 2485.958,
    "text": " normative theory or abstract algorithm about how an agent should behave or should infer perceptions or states of the world to be optimal we can consider how could we get neurons to do that and there's basically two broad strategies i won't go into too much detail but just make you aware um that there's a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.039,
    "end": 2498.357,
    "text": " a stream of the literature where neural activities represent expected values like means and variances of the probability distributions that we're trying to represent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.941,
    "end": 2514.561,
    "text": "And the alternative formulation is neural activities are just sampling each time they fire or at each moment they're sampling stochastically, randomly from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.908,
    "end": 2530.872,
    "text": " that probability distribution that represents your beliefs rather than representing it in terms of parameters of a parameterizable distribution like a Gaussian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.037,
    "end": 2538.244,
    "text": "Okay, and there are pros and cons to these that I'll skip for now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2539.346,
    "end": 2542.371,
    "text": "Now, this inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.009,
    "end": 2558.065,
    "text": " cycle that I outlined with this Bayes rule here is intractable for most real parameters in our model, in our beliefs, to optimize our beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2558.085,
    "end": 2559.647,
    "text": "Okay, so that's our first approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.508,
    "end": 2570.198,
    "text": "Before going on to more about the computations that you need to implement active inference, let me say how I'm thinking of consciousness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.853,
    "end": 2574.433,
    "text": " and I didn't make up this way of defining consciousness, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.067,
    "end": 2577.529,
    "text": " got it from the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2577.589,
    "end": 2584.258,
    "text": "But there are a few different ways that people in the active inference literature think of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.319,
    "end": 2588.624,
    "text": "One is in terms of boundary representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.525,
    "end": 2599.558,
    "text": "I won't try to describe what those are because I'm not going to use that definition, or this mid-level hierarchical representations might be postulated to be the conscious ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.119,
    "end": 2601.18,
    "text": "Instead,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2601.565,
    "end": 2602.326,
    "text": " Whoops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2602.346,
    "end": 2615.968,
    "text": "Instead, I am going to use this third concept, which is the most intuitive one, I think, and was endorsed by Carl Friston in at least one paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2616.468,
    "end": 2628.467,
    "text": "But so the idea here is conscious agents, as distinct from reflex acting agents or unconscious agents,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.768,
    "end": 2633.114,
    "text": " are ones that have what they call counterfactual or temporal depth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.657,
    "end": 2638.643,
    "text": "And that's really just equivalent to a fast, implicit planning function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.844,
    "end": 2656.429,
    "text": "Before each moment of consciousness, the agent needs to integrate over a bunch of possible interpretations and possible plans for what to do next to come up with the optimal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.915,
    "end": 2684.391,
    "text": " inference and perception and next action and so that corresponds this counterfactual word here is referring to considering things that might happen that haven't happened that aren't that fictitious uh things that you might do in the future and temporal depth here is referring to how much into the future you're implicitly considering before making your inference or your decision",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2685.552,
    "end": 2693.262,
    "text": " So that's my operational definition of consciousness in the context of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2695.024,
    "end": 2706.278,
    "text": "So I'm going to talk about what a agent with temporal depth needs, what computations it needs to be able to do according to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.815,
    "end": 2723.89,
    "text": " First, I want to point out briefly, and then I'll come back to this later, that although we hear it formulated in terms of the free energy principle, that formulation is equivalent to a formulation in terms of least action, the least action principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2724.651,
    "end": 2735.32,
    "text": "And under that formulation, you describe the inference cycle in terms of a path integral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.84,
    "end": 2741.189,
    "text": " which is just doing basically the implicit planning function that I just described intuitively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.209,
    "end": 2749.303,
    "text": "Here, x0 is some initial state, and xt is your state or position some later time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.484,
    "end": 2759.08,
    "text": "And the paths are all the different trajectories, actions you could take in between to get to that later state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.287,
    "end": 2789.674,
    "text": " active inference is equivalent or conscious or sentient active inference is equivalent to implicitly considering possible futures to decide on an optimal one and again this is not me making this up this is in the textbook and the literature it's well established but I also show it in the paper that the pair of papers that we're talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.392,
    "end": 2795.578,
    "text": " Okay, so now coming to some of the things that you need to compute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.82,
    "end": 2801.466,
    "text": "Well, maybe I'll pause a moment to see if that was too fast about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2803.609,
    "end": 2805.071,
    "text": "Nope, great, continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.091,
    "end": 2807.535,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.555,
    "end": 2810.699,
    "text": "Okay, so we're taking active inference for granted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.702,
    "end": 2814.244,
    "text": "See if I can make you see my face.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.562,
    "end": 2818.008,
    "text": " But I'm questioning a classical implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.749,
    "end": 2822.355,
    "text": "I'm going to focus on a few points listed here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.557,
    "end": 2826.642,
    "text": "But first, let me introduce the computations that we need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.662,
    "end": 2833.954,
    "text": "I already mentioned this first approximation in the top line there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.974,
    "end": 2841.666,
    "text": "This green row E refers to another approximation that I'm going to mention later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.102,
    "end": 2860.057,
    "text": " I've got a bunch of different computations that are needed to do the path integral, but I'm just going to focus on the need for linear sums, linear combinations of firing rates of different neurons that you need to do that path integral, and integral is a sum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.238,
    "end": 2872.007,
    "text": "I'm going to focus on that operation and the stochasticity or randomness in the neural dynamics that is also necessary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.713,
    "end": 2880.685,
    "text": " And then after that I'll talk about that problem of discrete perceptual moments that I mentioned earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.847,
    "end": 2886.995,
    "text": "Okay, so here is an example of an active inference process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.777,
    "end": 2894.667,
    "text": "Again, what they mean by process theories are hypothetical mappings onto neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.489,
    "end": 2900.256,
    "text": "And so I'm just highlighting here down at the bottom that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2901.012,
    "end": 2903.857,
    "text": " What I said before is in the literature, not just me saying it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.997,
    "end": 2910.067,
    "text": "It's equivalent to following Hamilton's principle of least action or path integral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.587,
    "end": 2914.874,
    "text": "But anyway, the neural models that they use are idealized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.398,
    "end": 2920.624,
    "text": "They are firing rate models that don't include spikes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.644,
    "end": 2925.231,
    "text": "Some of them do include spikes, but not by modeling the actual spikes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.667,
    "end": 2930.695,
    "text": " conductances that generate the spikes, just as with random number generators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.116,
    "end": 2940.271,
    "text": "So firing, another idealization is that firing rates are interpreted as probabilities, because remember, we're trying to use these neurons to represent probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.753,
    "end": 2949.185,
    "text": "And in the theory, I didn't show this, but in the equations of the theory, we need to consider logarithms of probabilities as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.906,
    "end": 2952.771,
    "text": "And so to get neurons to do that, they assume that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.578,
    "end": 2960.988,
    "text": " Post-synaptic potentials are proportional to logarithms of probabilities and firing rates are proportional to raw probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.229,
    "end": 2966.475,
    "text": "They have an idealized function to translate those potentials into firing rates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.316,
    "end": 2974.365,
    "text": "They assume they can add, that different neurons can add their firing rates linearly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.385,
    "end": 2983.197,
    "text": "And they assume that conscious inferences happen every cycle of a so-called theta rhythm in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2983.902,
    "end": 2991.451,
    "text": " but they do it by hand in the model without any mechanistic model of how neurons might do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.471,
    "end": 3009.572,
    "text": "Now, just because these are idealizations or approximations doesn't mean they're wrong, but I'm going to point out that they are not established as being right, and it's somewhat implausible that they are right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.957,
    "end": 3022.752,
    "text": " that they are sufficient to do these computations in fast sub-second time scales for real-time control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.643,
    "end": 3033.256,
    "text": " A problem I didn't mention on the outline, but it relates to adding together different possibilities of what might happen or what you might be seeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.537,
    "end": 3047.895,
    "text": "This is from a process model describing a simple behavioral task using active inference to describe, to make a neural process model of a simple behavioral task in a rat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3047.977,
    "end": 3056.512,
    "text": " And it had four positions of a behavioral target and four spatial positions the rat could go in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.153,
    "end": 3067.411,
    "text": "And that meant they needed a separate neural population for each combinations of all the different factors that are involved in the environment the agent is trying to represent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.752,
    "end": 3069.715,
    "text": "In this case, it was 16.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.302,
    "end": 3084.278,
    "text": " But this points to a potential combinatorial explosion if you need different populations of neurons to represent every possible combination of things that might be out there and things that you might do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.603,
    "end": 3100.409,
    "text": " Okay, so coming back to this quote to highlight the potential tension between the deterministic signal processing point of view and the new probabilistic point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3101.19,
    "end": 3107.582,
    "text": "The question is, how do deterministic Hodgkin and Huxley neurons do probabilistic inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.38,
    "end": 3112.562,
    "text": " So I'm not putting up these equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.903,
    "end": 3114.704,
    "text": "This is the Hodgkin and Huxley equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.285,
    "end": 3123.453,
    "text": "I'm not putting them up to go into details about what they're saying except to show they're all deterministic differential equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.513,
    "end": 3125.475,
    "text": "There's no random numbers over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.717,
    "end": 3129.119,
    "text": "This is a purely deterministic evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.639,
    "end": 3132.623,
    "text": "Over here, we've got a probabilistic algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3133.583,
    "end": 3137.287,
    "text": "How do you get deterministic neurons to do, classical neurons to do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.488,
    "end": 3140.05,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.127,
    "end": 3149.327,
    "text": " So I said one of the operations we have to be able to do is to add neural activities linearly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.989,
    "end": 3158.73,
    "text": "And so here's a paper from 2006 where they modeled neurons to see if they could get linear summation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.145,
    "end": 3189.578,
    "text": " straight line in this plot and in order to get that to achieve robust linearity with these integrate and fire neurons they had to average over more than a thousand neurons and more than a thousand trials and to get some randomness they had to assume randomness in the in the inputs so my point is showing this is that if you imagine how many neurons would it take to get",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.693,
    "end": 3206.115,
    "text": " robust linear summation like this in one trial, which we need in order to be able to use active inference in real time, it seems heuristically we would need a million neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3208.61,
    "end": 3209.071,
    "text": " Too many.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3209.271,
    "end": 3222.405,
    "text": "That's on the order of how many should be able to represent a whole range of different features, not just one linear combination pertaining to one of those features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.408,
    "end": 3228.072,
    "text": "So this is to say it appears to take too long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.772,
    "end": 3236.541,
    "text": "And this model is not even a realistic Hodgkin and Huxley based model that incorporates the real basis of the spikes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3238.377,
    "end": 3250.457,
    "text": " But the field of active inference seems to be relying on this paper and maybe one or two other models like this to establish that classical neurons could do these operations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.202,
    "end": 3263.76,
    "text": "So the other issue I said I was going to focus on a bit is the issue of neural variability, real neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3264.314,
    "end": 3288.988,
    "text": " exhibit stochasticity or randomness variability in their firing from trial to trial, even if you give them identical stimuli, the variability in stimuli, the input variability does not account for the neural variability, and neither does the known randomness at synapses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.521,
    "end": 3308.597,
    "text": " i'm sorry i don't have the references for that up here but they're in our papers um so from the remember i said there were two approaches to uh representing um probability distributions in active inference the deterministic version well they need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.577,
    "end": 3332.897,
    "text": " to somehow get this randomness or stochasticity into their model to match real to real neurons as we record them in real behaving animals and people because it's not there in the deterministic model and on the flip side um the sampling approach assumes stochasticity in their model but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.025,
    "end": 3342.545,
    "text": " If Hodgkin and Huxley neurons are presumed to be underlying that model, where does the stochasticity come from, since that model is deterministic?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.906,
    "end": 3351.105,
    "text": "And again, the stochasticity at synapses is not enough to account for the stochasticity of real neural activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.684,
    "end": 3372.332,
    "text": " So these are not to prove that a classical implementation is impossible, but to say it has not been demonstrated with neural models that incorporate the known Hodgkin and Huxley conductances that are the basis of the action potentials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.352,
    "end": 3383.488,
    "text": "Also, I mentioned that this formalism for a conscious agent is equivalent to a path integral considering perceptual",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.857,
    "end": 3396.803,
    "text": " interpretations and behavioral responses that path integral is also intractable computationally and so another",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.884,
    "end": 3413.274,
    "text": " Approximation is introduced into the classical process models called the mean field approximation where you assume each of the time steps of each of these hypothetical trajectories into the future paths or policies of what you're going to do in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3413.955,
    "end": 3420.647,
    "text": "You have to assume that each time step into the future is statistically independent of the other time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.876,
    "end": 3434.815,
    "text": " which is not really a good assumption intuitively because our behavioral plans should be coherent plans that are not random choices at each moment during that behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3435.436,
    "end": 3447.073,
    "text": "So this is not a great thing that we're being forced to do, but I'm mentioning it because the quantum model will not need to make this approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3448.596,
    "end": 3449.537,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.783,
    "end": 3462.953,
    "text": " We already saw the need for multiplication and addition because the active inference equations have matrix multiplication in them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.384,
    "end": 3481.462,
    "text": " Mean field approximation implies more need for multiplication because when you treat different factors as independent, you multiply their probabilities to get the overall probability of some path or trajectory in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.504,
    "end": 3485.687,
    "text": "And so that leads to a sort of catch-22.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.107,
    "end": 3493.075,
    "text": "If you postulate that your neural activities correspond to probabilities, then maybe it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.561,
    "end": 3500.47,
    "text": " relatively straightforward to add them, but multiplying them becomes non-trivial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3501.01,
    "end": 3511.724,
    "text": "And the flip side, if you postulate that neural activities correspond to logarithms of probabilities, then you just have to add them and that is equivalent to multiplication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.164,
    "end": 3516.369,
    "text": "But then if you need to add raw probabilities, that becomes non-trivial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3516.87,
    "end": 3521.396,
    "text": "So it seems like whichever way you choose, you have to leave out something that you need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.197,
    "end": 3523.298,
    "text": "And so the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.037,
    "end": 3549.893,
    "text": " solution that's been adopted in the the example process model there is that maybe the synaptic potentials are carrying are representing the log probabilities and the rates are the raw probabilities the firing rates of neurons we have some experimental evidence i won't dwell on this experiment just just showing that in the abstract they're showing that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3549.94,
    "end": 3574.497,
    "text": " neural activity in this area lip of a monkey was consistent with its integrating a variable that was proportional to a log likelihood ratio a log likelihood in other words a log probability so there's some experimental evidence that neurons do compute log probabilities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.303,
    "end": 3581.513,
    "text": " But that's not equivalent to a classical model that shows how a classical Hodgkin-Huxley neuron can do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3582.594,
    "end": 3586.581,
    "text": "To my knowledge, we do not have such a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3586.601,
    "end": 3600.923,
    "text": "Similarly, these models tend to almost universally rely on convergence into attractor states, which are quasi-stable patterns of activity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.021,
    "end": 3603.784,
    "text": " and that represent different possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3604.604,
    "end": 3630.808,
    "text": "And this has been criticized by people other than us because when we're talking about fast real-time inference, as opposed to learning on longer time scales, for fast real-time inference, attractors might be too slow because different areas have different conduction delays from the eyes or the ears to the cortex, to the visual or auditory cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3631.852,
    "end": 3634.756,
    "text": " And sensory inputs are changing from moment to moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.558,
    "end": 3642.909,
    "text": "So it's not so easy potentially to get a quasi stable pattern of activity going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.929,
    "end": 3651.362,
    "text": "And there's a question about how long do you have to keep it going in order for it to register or as that's the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.114,
    "end": 3660.906,
    "text": " So that's another doubt about whether classical models can account for these computations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.926,
    "end": 3668.598,
    "text": "So here's a summary of that critique of the classical implementations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.618,
    "end": 3671.943,
    "text": "And in the title there, I should have been more specific than realistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3672.464,
    "end": 3681.298,
    "text": "By realistic, I mean a classical model that incorporates the Hodgkin and Huxley conductances that are responsible for action potentials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3682.747,
    "end": 3697.515,
    "text": " So what these models, these classical process models have not established is that they have not established that Hodgkin and Huxley neurons can quickly add their firing rates linearly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3698.035,
    "end": 3700.157,
    "text": " in like 200 milliseconds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.177,
    "end": 3712.571,
    "text": "The fluent alternation that I was talking about, whoops, between multiplication and summation that is necessary for matrix multiplication, not been demonstrated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.611,
    "end": 3718.537,
    "text": "The log, some variables are logs of probabilities and some are probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.597,
    "end": 3719.799,
    "text": "How do you do that with neurons?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.259,
    "end": 3724.684,
    "text": "There's no, I don't know of a model that shows how to do that with realistic neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.217,
    "end": 3742.719,
    "text": " The papers that did show linear summation with neurons suggested it would take too long or too many neurons to get addition to work right, to do this in under a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.001,
    "end": 3755.076,
    "text": "And here I mentioned there's a problem accounting for the real stochasticity or variability in neurons given a determinant model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.19,
    "end": 3762.794,
    "text": " So I next want to go to the quantum picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.994,
    "end": 3770.703,
    "text": "I guess I'll flash one more thing before I pause to ask for questions, which is as a sort of segue to the quantum proposal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.723,
    "end": 3776.31,
    "text": "I mentioned earlier this paper from 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3778.112,
    "end": 3788.404,
    "text": "Based on these results at the bottom of the abstract here, we suggest that biological systems employ quantum coherence as a computational result, as a resource, and implicitly as a communication resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.57,
    "end": 3800.329,
    "text": " And here is a place where they're very sort of cryptically saying they think perception is quantum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3800.79,
    "end": 3807.321,
    "text": "One might imagine that a combination of quantum computing and neuromorphic engineering may be able to account for real human vision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.702,
    "end": 3819.714,
    "text": " The results obtained here suggest that quantum biology is far larger than we thought so far, and all biological systems are quantum systems and use quantum coherence as an information processing resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3820.475,
    "end": 3825.48,
    "text": "This has been suggested before, but here we showed that it follows from general principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.341,
    "end": 3827.843,
    "text": "That's what I underlined at the bottom there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3830.345,
    "end": 3833.028,
    "text": "Sounds like a big deal, but I haven't heard anybody else talking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.931,
    "end": 3837.493,
    "text": "Okay, so before I go on,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3838.081,
    "end": 3840.945,
    "text": " Any questions, clarifications, complaints?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.029,
    "end": 3844.351,
    "text": "There are a few questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.451,
    "end": 3848.577,
    "text": "I think continue on and close out, and then we'll all read them in the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.817,
    "end": 3849.398,
    "text": "Thank you, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.418,
    "end": 3849.739,
    "text": "Very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3850.54,
    "end": 3851.582,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3852.443,
    "end": 3866.805,
    "text": "Okay, so I talked about some problems with particular computations, and now let me introduce another issue that any theory of conscious active inference, any process model has to address,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3866.836,
    "end": 3882.769,
    "text": " which is that our moments of experience are non-overlapping discrete moments like frames of a movie um and i don't this does not seem to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3882.985,
    "end": 3887.551,
    "text": " largely appreciated, but it is well established.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.953,
    "end": 3897.605,
    "text": "So the kinds of experimental evidence that establish this are, for example, the large psychophysical literature on backward masking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3898.906,
    "end": 3906.837,
    "text": "So the bottom schematic there is illustrating a trial like that, where the schematic is showing what subjects would be looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3906.977,
    "end": 3909.921,
    "text": "They're fixating on the dot in the middle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.103,
    "end": 3920.057,
    "text": " The pair of bars here of unequal length are flashed very briefly and they're supposed to note which one was longer and that's to test whether they saw those bars or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3921.358,
    "end": 3931.793,
    "text": "But after those target bars are flashed very briefly, these sideways equal signs are the masks that are flashed briefly after the targets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3932.654,
    "end": 3934.997,
    "text": "And if you flash them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.281,
    "end": 3940.828,
    "text": " Soon enough, within a few hundred milliseconds of the targets, you can prevent the targets from being seen at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3942.069,
    "end": 3957.188,
    "text": "And so a large literature of effects like that appear to prove that our brain integrates some finite duration of time to generate each of our moments of perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.231,
    "end": 3967.544,
    "text": " And you can reflect that if that weren't true, we wouldn't be able to perceive movement because movement we perceive by noting something was in a different place at two different times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3969.968,
    "end": 3973.673,
    "text": "So there are a bunch of other experiments that come to a similar conclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.733,
    "end": 3982.045,
    "text": "I think I won't describe them now for time, but I think the backward masking is enough to establish",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.278,
    "end": 3987.567,
    "text": " that these cycles of perception are non-overlapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3988.168,
    "end": 3999.446,
    "text": "So it's not like a continuous update where new sensory information kind of breaks in whenever it gets, whenever it's observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3999.927,
    "end": 4007.038,
    "text": "Rather, you only get to be noticed at these discrete moments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4008.481,
    "end": 4009.382,
    "text": "And this is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.818,
    "end": 4013.043,
    "text": " also a requirement in conscious active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.365,
    "end": 4026.443,
    "text": "I think there's a little bit of confusion about this maybe in the literature, but it's clear that even when you go to a continuous description of active inference using differential equations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4027.773,
    "end": 4051.249,
    "text": " You still need to supplement that with, if it's going to be a conscious, temporally deep agent, you need to supplement that continuous instantaneous description with something that integrates over a finite window, the temporal depth, to generate the sentient or conscious inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4051.837,
    "end": 4062.271,
    "text": " We know in real life there are discrete moments of experience and conscious active inference requires discrete moments of experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.713,
    "end": 4068.179,
    "text": "The question is, how do you get neurons to generate discrete moments of experience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.561,
    "end": 4074.047,
    "text": "Before I go to that question, here's just another way of seeing this result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.407,
    "end": 4076.41,
    "text": "We can see neural correlates of these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.402,
    "end": 4105.89,
    "text": " moments of our the movie of our life during binocular rivalry experiments where you show two different pictures to the two eyes and instead of seeing a combination people alternate seeing one or the other and That the stimulus is not changing both eyes are still seen are seeing the same picture the whole time are being shown the same picture the whole time but your brain Decides what it's going to see at each moment and it alternates between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.832,
    "end": 4136.063,
    "text": " between the two pictures and what this study as 2009 study showed with EG electrical recordings from the scalp is Moments of neural synchronization rhythmic moments of neural synchronization That correspond to these moments of perceptual experience Okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.135,
    "end": 4167.754,
    "text": " so recall this was the orc or hypothesis and um here again is the statement of the idea quantum collapse events is what or refers to it doesn't become consciousness until the the objective reduction events are orchestrated by biological structures to be more complicated and informative now um coming back to the quant the path integral formulation i want to emphasize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4168.493,
    "end": 4175.622,
    "text": " the distinction between the path integral formulation in quantum physics and in classical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.544,
    "end": 4193.005,
    "text": "You can formulate classical physics and active inference in terms of the least action principle, which is expressed in terms of this path integral, but in classical physics, that's optional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.726,
    "end": 4195.108,
    "text": "It's redundant with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4195.46,
    "end": 4201.068,
    "text": " the instantaneous differential equation kind of description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.729,
    "end": 4203.151,
    "text": "It's equivalent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4203.311,
    "end": 4208.098,
    "text": "The system just follows the path of least resistance, they say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.741,
    "end": 4213.226,
    "text": "The situation is different in quantum physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.266,
    "end": 4215.068,
    "text": "That's why I say here it's mandatory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.89,
    "end": 4220.236,
    "text": "You can't get away with an instantaneous differential description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.419,
    "end": 4223.02,
    "text": "Instead,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.59,
    "end": 4235.693,
    "text": " And I want to also say this path integral formulation of quantum physics is the most fundamental formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.314,
    "end": 4249.255,
    "text": " Things like the non-relativistic Schrodinger equation that are introduced as postulates in introductory courses can be derived from the path integral formulation in the non-relativistic limit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.275,
    "end": 4262.878,
    "text": "So the general description of quantum physics is in terms of this path integral, where at each moment, nature decides what it's gonna do next, what it's gonna do at the next quantum measurement",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.192,
    "end": 4273.029,
    "text": " by considering every conceivable trajectory the system could take in between now and that future measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.79,
    "end": 4277.998,
    "text": "It integrates over all those possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.586,
    "end": 4284.679,
    "text": " without any approximation like we had in the classical case, the mean field approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.721,
    "end": 4298.89,
    "text": "And in the quantum case, again, this is not equivalent to the instantaneous description in terms of forces or derivatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4299.899,
    "end": 4302.283,
    "text": " That's why I'm saying it's a mandatory description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.004,
    "end": 4317.026,
    "text": "And so it's as if nature considers everything that it could do next at the next measurement event and picks an optimal one based on minimizing the action, the physical action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.066,
    "end": 4323.156,
    "text": "That's the least action principle that I said is equivalent to the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4324.537,
    "end": 4345.33,
    "text": " And that's why our proposal that orchestrated quantum objective reduction could implement conscious active inference is founded on a rigorous equivalence, mathematical equivalence, not a loose analogy as one of our reviewers called it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.191,
    "end": 4352.076,
    "text": " Maybe I'll pause there because this is the proposal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4352.116,
    "end": 4356.083,
    "text": "Before I flesh it out, this is the proposal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.828,
    "end": 4360.31,
    "text": "If you want to clarify anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.532,
    "end": 4363.656,
    "text": "Indeed, that there's a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.695,
    "end": 4389.947,
    "text": " path that can be splined or interpolated that's based upon the biological time cycle and cognitive or computational capacity and frequency of actual mechanistic processes that are known where necessity and sufficiency and non-human models and relevant human data exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.805,
    "end": 4403.163,
    "text": " to come together to provide a mechanistic how, along with the kind of full Marr levels of analysis, or even more of like a Tinbergen style four questions analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.964,
    "end": 4409.111,
    "text": "That's what theory integration looks like in biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4409.131,
    "end": 4412.817,
    "text": "That's where it's at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.837,
    "end": 4418.044,
    "text": "Okay, so yes, on this slide, I'm at the algorithmic level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4418.716,
    "end": 4426.943,
    "text": " and I need to specify what is gonna implement it at the bottom level, the implementation level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.984,
    "end": 4439.435,
    "text": "And I'm saying microtubules can do that, but this formalism applies to nature at large, in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4440.236,
    "end": 4448.503,
    "text": "Nature does this, and we're saying it does it in a particular way in brains where it's been orchestrated so that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.31,
    "end": 4452.794,
    "text": " what is represented is something that's useful to the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4453.415,
    "end": 4458.1,
    "text": "Here's just to make it a little more concrete how I'm picturing this happening in neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.58,
    "end": 4462.905,
    "text": "So these are cartoon neurons where I've got these fat dendrites with microtubules in them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.886,
    "end": 4466.309,
    "text": "And here are some axons with synaptic terminals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4466.969,
    "end": 4472.095,
    "text": "And I'm pointing out there's a lot of actin in the synaptic terminals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4473.83,
    "end": 4483.07,
    "text": " Actin can exist in a liquid crystal state, which is used as logic gates in optical computers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4483.712,
    "end": 4489.925,
    "text": "And we've got a quantum optical, I'm hypothesizing a quantum optical computer in the microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4490.366,
    "end": 4492.21,
    "text": "So the actin at the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.573,
    "end": 4505.103,
    "text": " that the synapses could be acting as gates that modulate synaptic release probabilities based on the quantum state in the microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4506.224,
    "end": 4517.733,
    "text": "And the quantum state in the microtubules reflects neural activity on the membrane because there are voltage-gated calcium channels all over the neural dendrites.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4518.354,
    "end": 4523.158,
    "text": "And microtubules and microtubule-associated proteins are sensitive to calcium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4524.202,
    "end": 4540.894,
    "text": " A critical requirement for this hypothesis to be viable is that this hypothetical quantum state in the microtubules must be able to communicate with action potentials on the membrane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.65,
    "end": 4559.035,
    "text": " both ways because we know action potentials is how our sensory inputs are represented and we know action potentials is how we act uh contract muscles to behave including talking so the if this is true the microtubules have to be able to talk",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.251,
    "end": 4585.832,
    "text": " the membrane potential and the way we can imagine that concretely is that the way the membrane potential talks to the microtubules is via calcium the pattern of intracellular calcium mirrors the pattern of electrical activity across the membrane so it can imprint that onto the microtubules oscillatory state that's how the microtubules find out what you're looking at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.065,
    "end": 4589.411,
    "text": " And now how do the microtubules modulate what you do in response?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.092,
    "end": 4602.896,
    "text": "By modulating synaptic release probabilities at the axon terminals where we know where in the central nervous system synaptic vesicle release is notoriously unreliable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4603.377,
    "end": 4608.867,
    "text": "They say noisy and they speculate about why would you want unreliable neurons?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4608.847,
    "end": 4622.165,
    "text": " that provides a point where the microtubule state can modulate the neural activities without violating the known Hodgkin and Huxley dynamics that we know about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4624.768,
    "end": 4637.385,
    "text": "It's interesting that that's also called quantized release, and it really does come down to the discrete packets of vesicles themselves with discrete composition of molecules and neurotransmitters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.855,
    "end": 4663.035,
    "text": " that's true that could muddy the issue i'm not claiming that discrete packets we do call them quanta but they are not quanta in the quantum physical sense necessarily uh yeah but yeah it is it is kind of funny that we use that word um i think um yeah i want to emphasize uh that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.775,
    "end": 4675.015,
    "text": " This gives an advantage to beings that can evolve such a conscious dynamic, whereas consciousness appears epiphenomenal and useless in classical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.399,
    "end": 4685.513,
    "text": "The capacity... So there's a tendency to say quantum computation is hyped, overhyped, because, you know, there's only a few...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4686.691,
    "end": 4690.538,
    "text": " Quantum algorithms, and they're mostly useful if you're trying to rob a bank.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4692.101,
    "end": 4697.892,
    "text": "So maybe it's all hype, but speed is not the only potential advantage of quantum computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4698.313,
    "end": 4700.076,
    "text": "Memory capacity is another one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.849,
    "end": 4717.307,
    "text": " And this is a significant issue for neuroscience because our models of memory are linear models, like the Hopfield model, if you've heard of that, their capacity, how many memories you can store, is linear in the number of neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4717.847,
    "end": 4726.857,
    "text": "So if 10 neurons can store two memories, 100 neurons might only store 20 memories, and it goes up linearly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4728.659,
    "end": 4737.133,
    "text": " That's a severe constraint, and there's a question about whether that's enough to account for our massive memory capacity over decades and 100 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4738.074,
    "end": 4748.271,
    "text": "In contrast, by marrying the quantum algorithm, search algorithm called Grover's algorithm with a neural network architecture,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4748.335,
    "end": 4757.989,
    "text": " These guys in 2000 came up with a quantum associative memory whose capacity was exponential in the number of neural units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4758.67,
    "end": 4775.153,
    "text": "Since then, there's been further development of related models where the advantage is polynomial or the capacity is polynomial or even exponentially better than the classical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.217,
    "end": 4800.837,
    "text": " so there's potentially a huge memory advantage if we're just looking for the bottom level what would what would it how would it help to have such a quantum system to use in your brain potentially it can account for our ability to remember things over a hundred years and use single episodes from decades ago in our momentary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4802.69,
    "end": 4805.796,
    "text": " inferences about what to do in sub-second time scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.906,
    "end": 4825.474,
    "text": "I don't have a slide for it, but I want to briefly mention that there is also a concrete model by Behera and Elitzer in 2005 showing how you can program",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4825.606,
    "end": 4826.448,
    "text": " neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4827.972,
    "end": 4829.896,
    "text": "It's basically a quantum process model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4830.297,
    "end": 4844.29,
    "text": "You can program neurons assuming a quantum state inside the neurons, which they don't speculate about what it might do, but when they assume that, they get eye-tracking behavior that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4844.27,
    "end": 4872.1,
    "text": " dramatically outperforms the classical common filter type models and introduces discrete jumps in the eye movements when when you're trying to follow a moving target with your eyes that match real qualitatively match real eye tracking data but are not present in the classical models so that was back in 2005 i i don't specialize in that field but i i'm not aware of any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4872.232,
    "end": 4874.655,
    "text": " newer developments or models superseding those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.236,
    "end": 4897.385,
    "text": "So because the quantum description is equivalent to the path of integral formulation, as I tried to emphasize earlier, that quantum model is an example of how you could neurally use a quantum system for active inference for a concrete behavior of tracking something with your eyes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4897.845,
    "end": 4902.171,
    "text": "And so that simple model could potentially be generalized to more complex behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4905.037,
    "end": 4909.523,
    "text": " Okay, so there's that model illustrating concretely how you could use this in a brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4910.224,
    "end": 4914.269,
    "text": "I'm saying there's also the potential memory advantage of a quantum model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.05,
    "end": 4929.188,
    "text": "And so given the experimental evidence that I reviewed at the beginning, that's why I say quantum collapse on the microtubule state inside of neurons is actually experimentally supported.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4929.387,
    "end": 4935.937,
    "text": " It's consistent with what we know about neurophysiology in a way that arguably these classical models are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.298,
    "end": 4955.968,
    "text": "Even though I admit this is a speculative model, it is consistent with the deterministic function, Hodgkin-Huxley function of the neurons and doing the quantum modulation through the stochastic synaptic release method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.235,
    "end": 4957.957,
    "text": " as a potential example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4960.22,
    "end": 4963.144,
    "text": "So here, I'll wrap up now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.204,
    "end": 4973.197,
    "text": "This table just summarizes different issues for theories of consciousness, the classical theory or quantum theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4973.978,
    "end": 4985.112,
    "text": "I've been emphasizing issues around probabilistic optimization and active inference and this discrete decisions moments issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4986.931,
    "end": 4992.559,
    "text": " But I brought up the unity of consciousness, the binding problem, epiphenomenalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4992.879,
    "end": 4999.809,
    "text": "I didn't even mention affect, whoops, or an arrow of time, subjective arrow of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5000.129,
    "end": 5005.978,
    "text": "But these are some other issues where the quantum model may have an advantage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5006.478,
    "end": 5009.162,
    "text": "So I'm just throwing those up there for completeness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5011.545,
    "end": 5014.93,
    "text": "So I think to finish, I'll just put my...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5015.011,
    "end": 5019.078,
    "text": " outlined so you can point at stuff that you would like to ask about or talk about more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5021.401,
    "end": 5021.782,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.964,
    "end": 5031.197,
    "text": "Okay, there's a bunch of written questions and anyone else can write some questions while I just compile them and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5032.561,
    "end": 5054.89,
    "text": " move into the discussion just maybe a little bit how did you come to work on the empirical work and the the animal biology and the theoretical biology and and just how has that come to be that way in 2025 yeah um well i got interested in this idea way back in the 90s when i was a physics grad student uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.14,
    "end": 5058.806,
    "text": " high energy theory, elementary particle physicist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5059.367,
    "end": 5074.131,
    "text": "So I got excited about these ideas and got my foot in the door to neuroscience through computational neuroscience, and then decided I needed to learn to do experiments so I wouldn't be begging experimentalists for their data to analyze.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.112,
    "end": 5079.78,
    "text": "And I learned to do multielectrode recordings in behaving rats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5080.115,
    "end": 5101.498,
    "text": " and my motivation there was interest in the binding problem um to address that from the main from a classical neuroscientific point of view you want to be able to look at multiple neurons at the same time and see how they're coordinating in real time or synchronizing um but it's not till the past few years that i've",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5102.339,
    "end": 5129.663,
    "text": " managed to join the discussion about the quantum hypothesis by I noticed that so these microtubule binding drugs have been known for a long time as anti-cancer drugs because they interfere with mitosis and cancer is runaway cell division and that is governed by the microtubules so messing with the microtubules apparently helps to slow down cancer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5130.773,
    "end": 5135.279,
    "text": " But most of those drugs, as I mentioned, don't penetrate well into the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5136.441,
    "end": 5146.894,
    "text": "But more recently, I came across a review describing people developing brain penetrant microtubule stabilizing drugs to go after brain cancers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5147.716,
    "end": 5154.064,
    "text": "And that made me think maybe that's an opportunity to test whether anesthetics target microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5155.951,
    "end": 5156.432,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5156.572,
    "end": 5156.952,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5156.972,
    "end": 5159.736,
    "text": "I'm going to ask a bunch of questions that have been written in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.876,
    "end": 5163.101,
    "text": "They're all over, but it should be fun and associative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5163.241,
    "end": 5163.542,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.062,
    "end": 5174.297,
    "text": "First, your colleague Ernesto Soares wrote, is there an analogous phenomena for qualia to the collapse of the wave function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.577,
    "end": 5179.964,
    "text": "In other words, is the collapse of some wave function in the brain what makes us aware of a qualia?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.488,
    "end": 5183.149,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5183.93,
    "end": 5185.452,
    "text": "Under the Orgo R theory,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5186.343,
    "end": 5191.871,
    "text": " we're equating moments of consciousness with moments of orchestrated collapse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5192.773,
    "end": 5205.031,
    "text": "And so the way I would phrase it to try and be philosophically careful is the consciousness, the conscious experience is a property of that physical collapse process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5206.413,
    "end": 5214.966,
    "text": "And the collapse is when the irreducible unity or coordination or non-local, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5216.853,
    "end": 5219.162,
    "text": " correlations manifest themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5219.684,
    "end": 5227.757,
    "text": "And so that's how it can be the physical objective basis to the unity of consciousness that we experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5229.931,
    "end": 5233.095,
    "text": " Great transition to the next question from Benjamin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5233.115,
    "end": 5234.177,
    "text": "Good to hear from Ernesto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.397,
    "end": 5234.978,
    "text": "Hi, Ernesto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.999,
    "end": 5236.099,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5236.119,
    "end": 5237.401,
    "text": "There's more coming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.421,
    "end": 5253.762,
    "text": "Benjamin G. wrote, if the Penrose-Hameroff work OR model is a helpful model, I wonder if that increases the likelihood of the Fuller-Bohm-Penrose-Hameroff model and other David Bohm-isms, not just Penrose-isms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.661,
    "end": 5269.199,
    "text": " I have not heard of a Bohm-Penrose model because I think the Bohm model is a different model that's not consistent with objective reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5269.66,
    "end": 5278.112,
    "text": "Now, there are a number of different theories of objective reduction, and Penrose has a particular one, but the Bohmian",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5278.328,
    "end": 5286.74,
    "text": " interpretation or theory of quantum physics, in my understanding, does not have actual collapse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5288.141,
    "end": 5290.525,
    "text": "You just find out what happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5290.605,
    "end": 5292.327,
    "text": "It still has the nonlocality though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5292.407,
    "end": 5298.135,
    "text": "So in that respect, it might still provide a basis for binding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5298.796,
    "end": 5305.365,
    "text": "But in this picture, this picture is totally distinct from the Bohmian picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5306.155,
    "end": 5306.856,
    "text": " Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5306.956,
    "end": 5309.7,
    "text": "Yes, with the implicit order and the pilot wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5311.142,
    "end": 5312.584,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5312.604,
    "end": 5324.202,
    "text": "Benjamin asks, my understanding is that tubulin and microtubules are not only in human or mammal neurons, but eg are similarly found in fungal hyphae.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.684,
    "end": 5328.969,
    "text": "And, you know, editorial note, all all cellular life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5328.989,
    "end": 5333.395,
    "text": "So what are implications of this on fungal computation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5335.248,
    "end": 5345.741,
    "text": " I am not prepared to talk about fungi, but I have learned about single-celled organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5345.821,
    "end": 5349.665,
    "text": "I mean, yeah, almost all life has microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5349.986,
    "end": 5356.133,
    "text": "I think there are some exceptions, and even they may have microtubule-like proteins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5357.334,
    "end": 5364.563,
    "text": "But speaking broadly, yeah, cellular life tends to have microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5364.728,
    "end": 5393.858,
    "text": " in line with that i mean that's related to my point earlier that volatile anesthetics that reversibly make us unconscious have analogous effects at comparable concentrations on single-celled paramecia that swim around without any neurons but they do have microtubules and they use them to swim with um so this picture i would say unlike the classical picture that emphasize that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5394.023,
    "end": 5398.07,
    "text": " is all about the skin only of neurons or the membrane of neurons only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5398.771,
    "end": 5408.647,
    "text": "This picture makes it understandable how our consciousness is continuous with similar stuff earlier in biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.667,
    "end": 5413.956,
    "text": "I don't know if a paramecium is conscious, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5414.392,
    "end": 5416.796,
    "text": " It appears to be, it's sensitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5417.177,
    "end": 5417.898,
    "text": "I've done it myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5417.978,
    "end": 5420.803,
    "text": "I've anesthetized paramecia with isoflurane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5421.404,
    "end": 5435.309,
    "text": "And I'm trying to do the same experiments that we did in rats on tetrahymena and paramecia, single cells, to implicate microtubules in the anesthetic effect on them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5436.37,
    "end": 5439.015,
    "text": "But what I'm suggesting is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5440.244,
    "end": 5447.627,
    "text": " Evolutionarily, microtubules already had a function of integrating sensory information and coordinating movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5448.289,
    "end": 5450.235,
    "text": "We've just built on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5452.563,
    "end": 5453.646,
    "text": "Maybe also just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.352,
    "end": 5462.905,
    "text": " There are microtubule stabilizers and destabilizers, different mechanics of how they bind, different places, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.386,
    "end": 5467.872,
    "text": "So dissolving seems to remove their function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.012,
    "end": 5479.63,
    "text": "But also you talked a lot about microtubule stabilizing, which I know over longer timescales can influence the pool of subunits and the assembly dynamics, even through the stabilizing kinetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5480.151,
    "end": 5481.793,
    "text": "But in the shorter term...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.908,
    "end": 5490.937,
    "text": " Is that what is being hypothesized to matter or is it about them being, obviously again, breaking them down just dissolves the substrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5490.957,
    "end": 5496.323,
    "text": "So that's easy for a loss of function on transport as well as any other features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5496.403,
    "end": 5503.33,
    "text": "But does stabilizing remove the function or does it modify, what matters, the phosphorylation state, just their sheer assembly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.791,
    "end": 5507.494,
    "text": "Yeah, thanks for asking that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5507.626,
    "end": 5522.561,
    "text": " and some new results have made me question how I was thinking about this, but the way I was thinking about this initially is not, the stabilization I think was kind of, I thought was a red herring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5523.022,
    "end": 5526.31,
    "text": "That is, our experiment was just showing that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.543,
    "end": 5530.608,
    "text": " the binding by this drug was maybe getting in the way of the isoflurane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5531.208,
    "end": 5537.075,
    "text": "And so it's certainly not that we're completely dissolving or depolymerizing the microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5537.155,
    "end": 5539.338,
    "text": "Maybe, well, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5539.478,
    "end": 5540.98,
    "text": "So the drug is the stabilizer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5542.121,
    "end": 5548.348,
    "text": "So maybe that could have interfered with transport without actually breaking them apart under a classical picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5548.749,
    "end": 5554.896,
    "text": "But under the quantum picture, it's interfering with their collective vibrations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5557.154,
    "end": 5570.302,
    "text": " Okay, but so the way I was interpreting our result was simply that it took the rats longer to fall asleep when we gave them the microtubule drug because the microtubule drug was getting in the way of the isoflurane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5571.364,
    "end": 5574.37,
    "text": "So it was kinetically blocking a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5574.89,
    "end": 5585.443,
    "text": " In a way that there's also like GPCR binding drugs or molecules that will sterically hinder a psychoactive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.744,
    "end": 5596.758,
    "text": "So they'll reduce the effects of an ion channel, but not have a direct phenomenological effect or even a kinetic effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5596.798,
    "end": 5602.585,
    "text": "And so something similar that sterically hinders something that would interfere with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5603.273,
    "end": 5625.788,
    "text": " with reducing the the quantum action right that's how i was interpreting it but since then i've seen some results so under that interpretation you kind of would expect that the more the the microtubule binding drug you would get that you gave the more resistance to the anesthesia you would get however um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5626.78,
    "end": 5631.486,
    "text": " This is preliminary now, but I saw a paper that did this in mice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5632.007,
    "end": 5638.375,
    "text": "And when they gave the drug for two weeks, we just gave it one time and looked what happened the next couple of days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5638.815,
    "end": 5645.944,
    "text": "When they gave it for two weeks, they saw an opposite effect where the mice were more sensitive to anesthesia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5646.565,
    "end": 5654.475,
    "text": "And I think I may have seen something like that in my single cells too, when I left them in the microtubule drug for multiple days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5654.692,
    "end": 5658.402,
    "text": " that they became more sensitive instead of less sensitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5658.422,
    "end": 5663.476,
    "text": "So that's making me question the just steric blocking interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5663.556,
    "end": 5670.996,
    "text": "And maybe it does have to do with how stiff the microtubules are and how well they vibrate or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.634,
    "end": 5700.038,
    "text": " yeah it's it's always getting interesting yeah there's there's a lot going on there's phosphorylation and there's uh there's a lot going on down there but i don't think it's i i think it's more of a direct or like the modeling study and other uh considerations lean me away from things like phosphorylation to just direct physical interactions like van der waals induced dipoles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5700.305,
    "end": 5724.996,
    "text": " interfering with the the dipole oscillations directly it that's a detail you know interesting of course we're just raising possibilities but for for years i have seen that ideas that the combinatorics of the phosphorylation states could also it's and this kind of relates to a uh one one question that was in the chat of uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5728.672,
    "end": 5734.018,
    "text": " Ernesto, what about electrical stimulation of the cortex, which elicits repeatable qualia?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5734.298,
    "end": 5734.819,
    "text": "Does it really?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5735.38,
    "end": 5738.583,
    "text": "But do different areas of the brain become transiently entangled?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5739.384,
    "end": 5745.932,
    "text": "And then just one thought that I wrote in there was, seems like there could be multilateral causality, electromagnetic, quantum material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5746.392,
    "end": 5747.934,
    "text": "Changing one can change others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5748.014,
    "end": 5752.519,
    "text": "So the fact that there's experiments where one is upstream causally of another...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5753.545,
    "end": 5769.89,
    "text": " When ultimately it's part of the same causal nexus, like if you were to deplete nitrogen, that would influence microtubule dynamics over some timeframe, but that doesn't mean that nitrogen plays a proximate mechanistic role, but so everything can kind of reenter the same causal nexus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5769.91,
    "end": 5774.457,
    "text": "And that's why it is important to do the experimental work that you're discussing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5776.208,
    "end": 5779.071,
    "text": " Okay, so the question, remind me the question now again?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5780.172,
    "end": 5784.556,
    "text": "What about electrical stimulation of the cortex, which elicits root canal polio?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5785.316,
    "end": 5795.926,
    "text": "Okay, I think before I comment on that, I wanted to, you said, you mentioned the microtubule associated proteins and how they, their states are changed by phosphorylation and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.506,
    "end": 5805.034,
    "text": "And so I think it might be helpful for me to bring up the metaphor of a guitar, where the microtubules are like the guitar strings,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5805.183,
    "end": 5811.632,
    "text": " And you can imagine microtubule associated proteins being placed on like fingering different frets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5812.413,
    "end": 5818.141,
    "text": "And that's how you get different chords playing, which represent different perceptions or experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5819.283,
    "end": 5825.411,
    "text": "And that's how you could store them as memories as well, if you can hold on to those frets for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5826.333,
    "end": 5829.537,
    "text": "And then the actual strumming, I guess,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5831.002,
    "end": 5846.544,
    "text": " stretching the metaphor a little bit, is the calcium coming in to affect the microtubule state and encode the neural activity state into the microtubules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5846.765,
    "end": 5851.892,
    "text": "Okay, so that was just to relate to the microtubule-associated proteins and how they could be involved in learning for sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.932,
    "end": 5856.739,
    "text": "There's evidence that they are involved in learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5857.445,
    "end": 5880.841,
    "text": " As far as microstimulation, yeah, under this picture, if you activate those neurons and you have a conscious experience because of that, it means those microtubules got excited into a state such that they, a coherent state such that when they collapsed, you experienced it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5881.923,
    "end": 5886.169,
    "text": "And I was gonna relate that to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5890.03,
    "end": 5891.031,
    "text": " Something else, but I forgot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.194,
    "end": 5894.236,
    "text": "All good?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5894.616,
    "end": 5897.901,
    "text": "Maybe in sort of close... Oh, I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5897.921,
    "end": 5898.281,
    "text": "I remember.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5898.301,
    "end": 5913.341,
    "text": "So I was just going to relate that to how in the EEG binocular rivalry experiments, I flashed up for a moment there that sort of illustrated the moments of conscious experience as moments of synchronization across the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5913.361,
    "end": 5919.75,
    "text": "A detail I didn't mention is that the synchronization at each moment incorporates...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5920.22,
    "end": 5923.604,
    "text": " neurons that are representing what you are perceiving at that moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5923.624,
    "end": 5947.172,
    "text": "So if you're at that moment, you perceive a house, then your house area becomes active at that moment and enters the, under the quantum picture, enters the coherent, the entangled state, or under the classical picture or both pictures, it enters the synchronized state that is the neural correlative consciousness as already measured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5948.738,
    "end": 5952.451,
    "text": " Yeah, and when you do it artificially, you're just inducing the same state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5954.036,
    "end": 5956.785,
    "text": "Neural correlate, neural causate, who's on first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5957.729,
    "end": 5958.551,
    "text": "Neural substrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5958.571,
    "end": 5960.538,
    "text": "I prefer neural substrate to neural correlate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5961.441,
    "end": 5961.702,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5962.66,
    "end": 5969.57,
    "text": " Well, in sort of closing, what are your empirical and theoretical directions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5969.69,
    "end": 5976.139,
    "text": "What milestones or kind of landmarks or reductions of uncertainty could be ahead?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5976.179,
    "end": 5982.809,
    "text": "How could people learn about this area or get involved or just take it from here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5985.593,
    "end": 5989.478,
    "text": "Yeah, so definitely needs more testing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5990.69,
    "end": 6001.49,
    "text": " And so avenues for testing, one avenue that more people seems to me should be trying is imitating the MRI experiments of Kerskens and Perez.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6001.51,
    "end": 6003.273,
    "text": "It only, it takes a regular scanner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6003.614,
    "end": 6007.0,
    "text": "You just have to turn the dials in a different way than you normally do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6007.02,
    "end": 6014.554,
    "text": "And so you could try microtubule binding drugs or other kinds of drugs to try and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6016.087,
    "end": 6020.931,
    "text": " isolate the molecular basis of that entangled state that they appear to have measured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6021.952,
    "end": 6046.093,
    "text": "Another experimental avenue would be to try to do spectroscopy experiments on living brain tissue, which people have already done, where you'd be looking for peaks that correspond to microtubule resonances, and you would be looking to see them either get reduced or shifted or something under anesthesia or other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6046.073,
    "end": 6048.157,
    "text": " drugs that affect consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6048.999,
    "end": 6064.369,
    "text": "Although people have done experiments like that, it will be technically challenging because the signal, I think, will be small in a large background signal, but that's a possible avenue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6064.568,
    "end": 6071.341,
    "text": " I'm trying to replicate our rat results in mice, and we think we see that happening in mice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6072.083,
    "end": 6078.555,
    "text": "And this week, I think I saw it happening in tetrahymen, a single-celled swimmers, which was quite exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6082.623,
    "end": 6083.425,
    "text": "Epic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6083.445,
    "end": 6087.252,
    "text": "Any last words?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6090.421,
    "end": 6113.138,
    "text": " I hope that this hypothesis starts to be discussed more seriously by serious mainstream researchers now, especially since the authors of Active Inference, Carl Friston, has written a paper saying Active Inference must be quantum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6114.721,
    "end": 6134.991,
    "text": " yes we had a 2023 course on physics as information processing with chris fields and have had a series of discussions on some of those quantum active inference and bayesian mechanics papers yeah there's there's so much there and how exactly that theory becomes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6135.933,
    "end": 6149.531,
    "text": " improved in its accessibility, rigor, applicability, how the broader cultural paradigm, et cetera, meta-science environment continues to evolve all things of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6151.233,
    "end": 6151.714,
    "text": "Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6152.455,
    "end": 6154.277,
    "text": "I'll close with a Blake-ism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6155.138,
    "end": 6160.666,
    "text": "If the doors of perception were cleansed, if the doors of perception were cleansed, everything would appear as it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6161.787,
    "end": 6162.568,
    "text": "Discreet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6162.588,
    "end": 6162.909,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6163.289,
    "end": 6165.332,
    "text": "In the same poem, he said...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6165.65,
    "end": 6168.497,
    "text": " What is now proved was once only imagined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6170.502,
    "end": 6171.123,
    "text": "Amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6171.143,
    "end": 6171.785,
    "text": "Thank you, Mike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6172.867,
    "end": 6176.135,
    "text": "Good luck and hope people enjoyed that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6176.155,
    "end": 6176.496,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6176.857,
    "end": 6178.04,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6178.06,
    "end": 6178.461,
    "text": "Take care.",
    "speaker": "SPEAKER_00"
  }
]