[
  {
    "start": 7.674,
    "end": 36.458,
    "text": " hello and welcome it's active inference guest stream number 42.1 on may 10 2023 we're here with juan diego bogota and zach shabara we're going to have a presentation time consciousness in computational phenomenology a temporal analysis of active inference by the authors followed by a discussion so thank you both very much for being here we'll look forward to your presentation and off to you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.046,
    "end": 38.186,
    "text": " Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 38.486,
    "end": 38.846,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 39.467,
    "end": 40.707,
    "text": "So I should start now, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 42.308,
    "end": 42.628,
    "text": "Brilliant.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 42.648,
    "end": 43.688,
    "text": "So hello everybody.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 43.748,
    "end": 44.789,
    "text": "My name is Juan Diego Bogota.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 45.389,
    "end": 47.37,
    "text": "I'm one of the coauthors of this paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 47.41,
    "end": 63.116,
    "text": "I'm a PhD student at the University of Exeter in the UK and kind of my broad interests are philosophical phenomenology and how it can be related to the empirical sciences and more specifically to cognitive science and to our understanding of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 63.88,
    "end": 69.068,
    "text": " So what we're going to do now is I'm going to give a broad context of our paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 69.088,
    "end": 77.081,
    "text": "I'm going to talk about the theoretical and philosophical context that motivated our paper, and then Zach will talk about kind of the specifics of our analysis of active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 77.802,
    "end": 78.643,
    "text": "So let me start now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 79.73,
    "end": 98.635,
    "text": " So to kind of situate ourselves in the broader literature, I guess there's a big, big cluster of discussions and topics and approaches within cognitive science and consciousness studies that, as its name suggests, is trying to explain consciousness scientifically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 99.275,
    "end": 110.398,
    "text": " Within that kind of big category of approaches, there's a very specific set which is trying to connect philosophical phenomenology with the natural sciences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 110.418,
    "end": 113.199,
    "text": "So we may call this the naturalization of phenomenology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 113.219,
    "end": 114.74,
    "text": "I'll talk about all this in a bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 114.76,
    "end": 117.921,
    "text": "I just want to kind of situate ourselves within a broader context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 118.681,
    "end": 128.104,
    "text": "One of these approaches is quite popular in some circles, which is called neurophenomenology and was first introduced and proposed by Francisco Varela in the late 90s.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 129.704,
    "end": 157.056,
    "text": " But recently Varela's project has been kind of elaborated on by people within the FEP and active learners community and they're talking about what is called computational neurophenomenology or computational phenomenology which as we'll see tries to connect the original project of neurophenomenology of bringing together cognitive science and phenomenology but it gives an active inference twist to this whole story.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 157.976,
    "end": 159.857,
    "text": " And this is where our project is situated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 161.097,
    "end": 171.842,
    "text": "Our main purpose in the paper was to give a temporal analysis of the structure of active inference and in a bit I'll explain you why we thought this was important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 173.348,
    "end": 180.771,
    "text": " So, as you probably know, consciousness is a bit of a difficult phenomenon to explain scientifically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 181.451,
    "end": 200.298,
    "text": "We have nowadays a lot of models and theories, scientific theories, to try to address consciousness, but there's always this kind of lingering worry that there is a gap, an explanatory gap, between our empirical understanding of nature and consciousness, because how we usually do science is try to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 201.218,
    "end": 210.965,
    "text": " address and to capture empirical phenomena from a third-person perspective, whereas consciousness is something that is allegedly given only from a first-person perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 210.985,
    "end": 220.672,
    "text": "So we're always experiencing the world from our first-person perspective and allegedly we don't really have access to consciousness as this empirical phenomenon we can see in the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 221.693,
    "end": 228.538,
    "text": " So that's kind of an epistemological gap between how we do science and how we understand consciousness without doing much science.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 228.858,
    "end": 239.205,
    "text": "There's also the so-called problem of consciousness, which is to say that we don't really know how something like consciousness may arise from, say, neurobiological phenomena or empirical phenomena more generally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 239.645,
    "end": 244.788,
    "text": "So this is kind of a general context which shows that consciousness is quite difficult to understand.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 245.269,
    "end": 251.433,
    "text": "I don't think we would want to say that it's impossible to explain it from a scientific perspective, but it's somewhat difficult.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 252.653,
    "end": 272.381,
    "text": " In the broader context of consciousness studies, since the early 90s there's been some proposals within cognitive science and philosophy of mind that is trying to connect this whole idea of explaining consciousness scientifically with what is known within philosophy as phenomenology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 273.021,
    "end": 279.148,
    "text": " So importantly here when we talk about phenomenology we're using a very specific and technical term.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 279.368,
    "end": 283.052,
    "text": "So in the literature you may distinguish two different ways of talking about phenomenology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 283.392,
    "end": 291.561,
    "text": "There's the usual broader sense in which we may mean kind of the what it's like to experience something or the qualitative contents of experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 292.282,
    "end": 293.764,
    "text": "This is not what we're talking about here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 294.761,
    "end": 312.385,
    "text": " Rather, we're referring to phenomenology, which is a very specific philosophical tradition, which was first proposed by Edmund Husserl in the early 20th century and was further developed by people like Maurice Merleau-Ponty, Martin Heidegger, Simon de Beauvoir, and there's a long, long tradition going on there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 312.885,
    "end": 320.81,
    "text": " And what's interesting about phenomenology is that it's simply a philosophical method and way of studying the invariant structures of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 320.91,
    "end": 333.357,
    "text": "So what all these phenomenologists are trying to say is to capture what they call the essential kind of characteristics of what it's like to be conscious of our lived experience through which we experience the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 334.414,
    "end": 338.297,
    "text": " We do this by describing and analysing precisely these experiences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 339.057,
    "end": 355.649,
    "text": "And you may think that this is pretty much what the broader sense of phenomenology is trying to get to, this idea of what it's like to experience something, but actually phenomenologists are not really interested in the what of experience, they're not really interested in the context of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 356.169,
    "end": 366.939,
    "text": " So when an epidemiologist is talking about, say, perceptual experience, they're not really interested in the redness of the red or, you know, the flavor of an apple, this kind of what philosophers call qualia.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 367.44,
    "end": 371.804,
    "text": "Rather, they're actually interested in how is it possible that these experiences come to be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 372.244,
    "end": 375.307,
    "text": "So this how refers to these structures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 375.347,
    "end": 379.171,
    "text": "We may talk about, for example, the temporal structure of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 379.471,
    "end": 381.273,
    "text": "We may talk about activity, embodiment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 384.226,
    "end": 388.448,
    "text": " But the important thing here is that we're focusing on the how we experience, not what we experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 388.808,
    "end": 395.671,
    "text": "And that's very important because at least how I see it, I don't know about Zach, this how actually constrains the what.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 396.011,
    "end": 400.193,
    "text": "So it's very different to imagine an apple than to experience it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 400.593,
    "end": 407.597,
    "text": " So there's a difference between the how we're experiencing the world and that constrains the specific contents of our experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 408.098,
    "end": 419.184,
    "text": "And this is important for the broader context of explaining consciousness scientifically, because arguably if we're focusing on the how, we're trying to capture the essentials of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 419.504,
    "end": 421.746,
    "text": "And this is a project that was one of the kind of...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 422.446,
    "end": 433.369,
    "text": " This project was spearheaded by Francisco Varela in the 90s, but we can actually trace back this idea to the works of Merleau-Ponty and Adam Hurwicz in the Phenomenological Tradition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 433.649,
    "end": 435.909,
    "text": "We can also talk about Hubert Dreyfus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 436.369,
    "end": 447.652,
    "text": "And more recently, there's a kind of a very broad discussion about whether and how can we connect these philosophical considerations with scientific perspectives of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 448.615,
    "end": 458.52,
    "text": " And this brings me to the so-called project of the naturalization of an aminology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 458.84,
    "end": 468.384,
    "text": "When we do science and we try to work through the lens of natural science, we have a critical understanding of the world.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 468.444,
    "end": 476.788,
    "text": "Instead of metaphysical and epistemological commitments, such as that there is a material world out there, we just get to know",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 477.619,
    "end": 480.1,
    "text": " through somatics or doing empirical tests.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 480.821,
    "end": 483.823,
    "text": "That's how we use science, very broadly speaking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 484.663,
    "end": 494.249,
    "text": "But when you go and look at the literature, the phenomenological literature, what phenomenologists provide are not causal explanations of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 494.309,
    "end": 500.412,
    "text": "They are simply describing a set of what they call motivational connections, which not really",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 501.793,
    "end": 507.859,
    "text": " identify with causality, which is the main thing that science is trying to capture, causal relationships.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 508.499,
    "end": 512.643,
    "text": "Also, there's the issue that phenomenology is not positing empirical entities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 512.723,
    "end": 518.848,
    "text": "So when we talk about, say, time consciousness, we're not talking about an empirical thing, an empirical object, arguably.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 519.229,
    "end": 528.197,
    "text": "We're talking about a set of processes which, and this is kind of the shift from the scientific issues to the philosophical ones, we're talking about something that is arguably",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 528.797,
    "end": 530.844,
    "text": " prior to objectivity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 531.185,
    "end": 535.558,
    "text": "So phenomenologists are often reminding the readers",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 536.596,
    "end": 559.515,
    "text": " that before we're doing science like we're doing theoretical science we're experiencing the world and we're therefore this is something that is prior epistemologically to science and to try to capture uh consciousness scientifically is almost to uh commit a category mistake um so given these worries the question is whether we can actually link",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 559.995,
    "end": 563.68,
    "text": " phenomenology with empirical science, such as cognitive science?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 564.0,
    "end": 575.895,
    "text": "And this question is precisely what we talk about, what we call the so-called project of naturalization of phenomenology, which is to mean, how are we to make phenomenology continuous with empirical science?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 576.596,
    "end": 578.538,
    "text": " There's a lot of proposals in the literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 578.978,
    "end": 593.87,
    "text": "There's a very important book published in 1999, edited by Jean Petitot, called Naturalizing Phenomenology, which the editors and several authors discuss how and whether we can actually naturalize phenomenology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 595.091,
    "end": 603.878,
    "text": "But one of the most famous proposals is precisely Francisco Varela's proposal of the naturalization of phenomenology, which is called neurophenomenology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 604.867,
    "end": 612.853,
    "text": " So, put very simply, what neurophenomenology is all about is to provide a non-reductive approach to the study of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 613.413,
    "end": 627.643,
    "text": "This non-reductive approach takes seriously both the analysis and descriptions made by phenomenologists, as well as the scientific understanding we have of the neurobiology that underpins our lived experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 628.65,
    "end": 635.934,
    "text": " These two kind of domains are put in relation to one another by means of what Varela calls reciprocal constraints.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 635.974,
    "end": 651.643,
    "text": "So the idea is that phenomenology can constrain our understanding of the neurobiological underpinnings and these neurobiological underpinnings can also constrain our understanding of experience, our phenomenological understanding of experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 652.603,
    "end": 677.399,
    "text": " Interestingly, and this is where kind of the computational and mathematical aspect comes in, Varela also suggested that in order to achieve this kind of circulation between phenomenology and empirical science, we have to have some sort of bridge or what he calls a generative passage that allows us to go from these very abstract phenomenological descriptions of experience to the more concrete",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 678.219,
    "end": 682.764,
    "text": " the concrete descriptions of somatic and neural processes that underpin lived experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 683.225,
    "end": 696.819,
    "text": "And this very abstract level that allows for this passage, for this bridge, for him, for Varela, was the use of dynamical systems theory, and more specifically models of non-linear dynamics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 697.97,
    "end": 711.478,
    "text": " So if you look at his 1999 paper on time consciousness, what he does is to connect Edmund Husserl's analysis of temporality with certain neural processes by introducing dynamical models into the picture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 712.098,
    "end": 715.18,
    "text": "This is what neurophenomenology is all about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 716.18,
    "end": 720.983,
    "text": "More recently, and inspired by this whole project of neurophenomenology,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 721.918,
    "end": 735.853,
    "text": " Maxwell Ramsted and colleagues have proposed to further elaborate on this project by employing generative modeling techniques such as active inference to provide this passage between phenomenology and the neurobiology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 736.508,
    "end": 752.557,
    "text": " And what is interesting about it is that if you do so, if you introduce generative modeling techniques, what you get is the idea that this how experience, how experience the world or what phenomenology is called constitution, can be modeled or described in terms of Bayesian inference or approximate Bayesian inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 753.198,
    "end": 757.6,
    "text": "An important bit here is that there's different ways of interpret this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 757.8,
    "end": 765.525,
    "text": "One way would be to say that constitution or how we experience the world is literally a matter of Bayesian inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 766.065,
    "end": 779.598,
    "text": " Or there's a more kind of instrumentalist or non-realist conception of this project, which would say we can actually just model or describe our lived experience and how we experience the world in terms of approximate patient inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 781.05,
    "end": 797.033,
    "text": " In this context, what happens is that what we experience in the world is constituted through a set of inferences, which are informed by likelihood mappings and all these matters that come in place into generative modeling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 798.689,
    "end": 811.122,
    "text": " So, this is kind of the broader context that informs our proposal, but you may ask why we're focusing on time consciousness, and I think Zach is going to say something about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 811.802,
    "end": 817.588,
    "text": "But for now, I just want to say that there's good reasons, both phenomenological reasons and scientific reasons, to...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 819.413,
    "end": 822.355,
    "text": " apply these kind of models to time consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 822.595,
    "end": 832.261,
    "text": "On the one hand, importantly, time consciousness is simply what we mean by time consciousness, our experience of time, so how we subjectively experience the passage of time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 833.522,
    "end": 840.666,
    "text": "And this phenomenon, time consciousness, enjoys a sort of privileged position within philosophical phenomenological literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 840.967,
    "end": 842.688,
    "text": "For example, Husserl, Heidegger, Merleau-Benty,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 843.692,
    "end": 850.419,
    "text": " are some prominent phenomenologists who take time consciousness to be the most basic structure of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 851.04,
    "end": 856.086,
    "text": "The point is that all that we're experiencing all the time is always experienced in time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 856.106,
    "end": 859.729,
    "text": "There's always this kind of temporal flow to the way we experience the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 860.45,
    "end": 865.333,
    "text": " And this is kind of essential to the way we engage with the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 865.773,
    "end": 876.759,
    "text": "So if this is the most basic structure of consciousness and we're trying to understand consciousness scientifically by modeling through, say, generative models or dynamical system theory models,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 877.279,
    "end": 881.641,
    "text": " then probably we should start by the most basic level, time consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 882.042,
    "end": 885.263,
    "text": "And this is something that several authors have actually tried to do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 885.323,
    "end": 895.068,
    "text": "So there's, for example, both Van Gelder's and Varela's dynamical models of time consciousness, which borrow from Edmund Husserl's phenomenological analysis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 895.408,
    "end": 898.87,
    "text": "There's also Grus' computational model of the same processes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 899.33,
    "end": 903.172,
    "text": "More recently, there's Vanevis' predictive processing model of time consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 903.533,
    "end": 905.534,
    "text": "So if you see, there's also a...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 906.594,
    "end": 912.698,
    "text": " relatively long tradition of trying to capture the dynamics of time consciousness in terms of mathematical modeling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 913.279,
    "end": 931.192,
    "text": "So now, moving on to our temporal analysis, our main question is whether actually active inference is capable of modeling these dynamics in a way that makes justice to the original phenomenological analysis made out by Fustrow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 932.172,
    "end": 933.173,
    "text": "And that's it for me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 933.213,
    "end": 935.975,
    "text": "Now I'll give the floor to Zach.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 947.093,
    "end": 950.495,
    "text": " Here I am, and I hope you can hear me and see me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 952.916,
    "end": 953.716,
    "text": "Yep, thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 953.736,
    "end": 956.458,
    "text": "I'm going to share my screen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 958.839,
    "end": 965.963,
    "text": "All right, so I'm going to pick up here from where JD left, Juan Diego left.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 966.423,
    "end": 976.248,
    "text": "And basically, like you said, we started talking about, well, there was this problem, right, with the flow of experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 976.923,
    "end": 984.088,
    "text": " and this discreteness in which we model, well, whatever phenomenon really, especially in cognitive science.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 986.75,
    "end": 999.378,
    "text": "So there is this relationship and this claim that we are in fact modeling features of human experience like perception, memory, and so on, but it's very few, if any of them, really take seriously the flow of human experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1000.639,
    "end": 1005.842,
    "text": "So phenomenology is for philosophers and not for scientists, apparently.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1006.448,
    "end": 1014.653,
    "text": " So computational phenomenology, like JD just talked about, is like this new subfield that takes both seriously the computational approaches, but also phenomenology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1014.733,
    "end": 1017.555,
    "text": "And it's trying to sort of find this middle ground in which we can have a conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1018.495,
    "end": 1022.758,
    "text": "And of course, big kudos to Maxwell for this fantastic milestone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1023.178,
    "end": 1027.34,
    "text": "I should say before I start that I'm very happy that JD's Juan Diego is here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1029.011,
    "end": 1040.796,
    "text": " Because I think that there is a lot of thought and he has this very cautious way of thinking and basically formulating his sentences that I do not have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1041.476,
    "end": 1042.497,
    "text": "So it's good that he's here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1042.557,
    "end": 1047.719,
    "text": "And I should probably also say explicitly that I will not be speaking for his behalf at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1048.719,
    "end": 1050.1,
    "text": "But we agree on basically all of this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1051.06,
    "end": 1051.841,
    "text": "So just to be sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1053.701,
    "end": 1054.022,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1054.282,
    "end": 1057.263,
    "text": "So before I dive into the whole",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1058.143,
    "end": 1065.987,
    "text": " temporality and active inference aspect of our paper, I would just like to start with a small thought experiment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1066.027,
    "end": 1070.59,
    "text": "And I usually give this to those who don't understand why I personally think in time all the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1073.53,
    "end": 1085.154,
    "text": " Let's imagine that we have to understand our own experience of space B. This is the space B, this is the space A, this is the space C. So these are all very, very different spaces, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1085.294,
    "end": 1087.435,
    "text": "And imagine there's two, like a parallel universe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1087.475,
    "end": 1091.676,
    "text": "In the first universe, in the first scenario, you approach space B from space A, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1091.716,
    "end": 1095.437,
    "text": "So this is you and you're basically moving in this direction and you're experiencing this space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1095.778,
    "end": 1097.058,
    "text": "Now in another universe, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1097.918,
    "end": 1098.678,
    "text": "Complete the fictional.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1099.419,
    "end": 1100.119,
    "text": "You're in this person.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1100.981,
    "end": 1108.063,
    "text": " You're this person and you're approaching space B. Now, I usually ask my students, do you think that this experience of space B will be the same?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1110.864,
    "end": 1116.165,
    "text": "And usually they all go like, well, by far, the majority says no.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1117.586,
    "end": 1122.887,
    "text": "It's two very, very different experiences and they have nothing to do with each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1123.368,
    "end": 1127.869,
    "text": "And this is basically what I am, what I'm sort of asking people to sort of start thinking about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1128.595,
    "end": 1134.378,
    "text": " There is no one-to-one isometric relationship between space and experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1135.259,
    "end": 1141.002,
    "text": "And I think this is a very, very important and very, I wouldn't say obvious, but to me, it's very clear that it cannot be like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1141.042,
    "end": 1147.905,
    "text": "It cannot be that one space or one specific type of content will make me experience the content the same way every time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1148.746,
    "end": 1151.807,
    "text": "And I think that the reason for that is change, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1152.528,
    "end": 1154.469,
    "text": "Time dynamics, everything changes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1155.209,
    "end": 1157.03,
    "text": "This is sort of what brings me into.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1157.54,
    "end": 1162.522,
    "text": " This will bring us into the discussion about substance philosophy and process philosophy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1163.282,
    "end": 1167.964,
    "text": "I will not unfold that at all, but I will mention from time to time a few things about them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1168.484,
    "end": 1184.871,
    "text": "So here I'm just going to try to make the point that even intuitively, which is usually what we reason with these thought experiments, it's basically why they're here, it just appears to us that space is not necessarily directly mapped to an experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1185.734,
    "end": 1187.235,
    "text": " Because we have to consider time, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1187.315,
    "end": 1189.777,
    "text": "So I'm asking three questions here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1190.057,
    "end": 1193.299,
    "text": "And the first one will be, how does the continuous flow in human experience emerge?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1193.959,
    "end": 1198.742,
    "text": "And I will try to answer that through the differences and similarities between what we call objective and subjective time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1199.623,
    "end": 1200.503,
    "text": "I will elaborate on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1201.204,
    "end": 1205.726,
    "text": "And then I will try to answer, can we extract principles from Husserlian temporality?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1205.766,
    "end": 1209.929,
    "text": "So Edmund Husserl that Juan Diego just talked about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1210.959,
    "end": 1218.044,
    "text": " And to answer that, I will talk a bit about the enduring present and the integration of two types of temporalities, that's the objective and subjective one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1218.644,
    "end": 1230.373,
    "text": "And then finally, I will try to answer, does active inference comply with these principles, sort of, you know, using phenomenology to come up with principle constraints and see whether active inference is sort of playing by those rules or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1231.093,
    "end": 1239.279,
    "text": "And for that, I will try to give you our temporal analysis of active inference as a partially observable Markov decision process computational model, so a POMDP.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1241.929,
    "end": 1244.711,
    "text": " So first things first, objective and subjective time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1244.811,
    "end": 1246.812,
    "text": "So the objective time, what do we mean by this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1246.892,
    "end": 1255.659,
    "text": "And I like to think of them as roughly what corresponds to substance and process philosophy, respectively, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1256.039,
    "end": 1264.945,
    "text": "Because objective time sort of deals with spatial features and everything that is rooted in the space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1266.086,
    "end": 1270.369,
    "text": "Whereas subjective time, I like to think, has more to do with how things change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1272.059,
    "end": 1278.384,
    "text": " So to give an example, a substance philosopher would say that the sun is simply the sun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1278.524,
    "end": 1279.845,
    "text": "It's a thing, and it's the sun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1280.225,
    "end": 1283.828,
    "text": "Whereas a process philosopher would say that, no, it's a burning planet.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1284.128,
    "end": 1284.849,
    "text": "It's doing something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1285.289,
    "end": 1287.711,
    "text": "And so the river is not just a river.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1287.911,
    "end": 1288.772,
    "text": "It's running water.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1289.392,
    "end": 1290.533,
    "text": "And you are not you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1290.593,
    "end": 1292.155,
    "text": "You are always changing, and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1292.635,
    "end": 1294.216,
    "text": "It's Heraclitus all over.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1294.376,
    "end": 1297.719,
    "text": "This is basically the idea and the difference between substance and process philosophies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1298.297,
    "end": 1316.264,
    "text": " Now, if we project this abstract idea onto the discussion on the relationship between objective and subjective time, first of all, it's an important discussion because computational models operate on computers, and these follow the laws of physics, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1316.544,
    "end": 1323.527,
    "text": "So we are sort of bound by the laws of physics, and we sort of have to talk about objective time in the context of the laws of physics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1324.067,
    "end": 1326.868,
    "text": "So I like to think that in space,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1327.639,
    "end": 1330.369,
    "text": " we can have several units at the same time, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1330.959,
    "end": 1334.162,
    "text": " Like, you can count different kinds of sheep.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1334.342,
    "end": 1336.223,
    "text": "Like, they don't even have to look alike or anything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1336.323,
    "end": 1343.81,
    "text": "Like, I know that farmers can tell the difference between the animals, but maybe to someone who cannot, it will just be like sheep one, sheep two, sheep three, and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1344.11,
    "end": 1345.331,
    "text": "And you can even say a number.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1345.391,
    "end": 1352.377,
    "text": "Like, you can go, let's take sheep number five, and you will not even imply any other sheep from, well, one to four.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1353.137,
    "end": 1354.118,
    "text": "You don't imply them at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1354.158,
    "end": 1355.259,
    "text": "You just mean this one, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1355.279,
    "end": 1360.023,
    "text": "There's an identity versus similarity discussion that needs to be taken up there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1360.444,
    "end": 1364.785,
    "text": " So space allows us to sort of categorize and discretize the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1365.545,
    "end": 1369.566,
    "text": "And I like to think about this as the way that geometric series sort of functions, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1369.606,
    "end": 1373.967,
    "text": "We can take space and just divide it infinitely, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1373.987,
    "end": 1382.449,
    "text": "You can always take something like anything, and you can split it in two, then in two again, then in two again, and you essentially get what they call the geometric series, which is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1384.258,
    "end": 1387.84,
    "text": " Interestingly, how you approach continuous numbers and continuous functions anyway.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1388.6,
    "end": 1396.524,
    "text": "Of course, I mean this in theoretical terms, because at some point we're going to reach the Planck length, and then we're going to have to deal with a different kind of problem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1397.364,
    "end": 1402.807,
    "text": "But in any case, my point here is that space allows us in the first place to think in degrees, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1402.847,
    "end": 1406.068,
    "text": "Like if there's a change in degree, how much something is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1407.189,
    "end": 1409.63,
    "text": "But time, I think, operates in a different way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1410.518,
    "end": 1413.339,
    "text": " Time sort of has this single unit, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1414.379,
    "end": 1416.84,
    "text": "It's just a single kind as opposed to the degrees.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1417.54,
    "end": 1423.182,
    "text": "So there's a difference in kind when we change moments, not a change in degrees, which you will have in space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1423.742,
    "end": 1425.222,
    "text": "So there cannot be any division of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1425.262,
    "end": 1428.803,
    "text": "This is why I usually say that time for me is completely indivisible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1429.223,
    "end": 1434.245,
    "text": "It doesn't make sense to compare two different moments because they have two different units and we cannot compare them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1435.265,
    "end": 1436.806,
    "text": "So when I say that we measure time,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1439.696,
    "end": 1443.697,
    "text": " I'm basically saying that whenever you measure any time, you measure it the same way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1443.877,
    "end": 1450.04,
    "text": "So when I say five seconds, I imply all the seconds between zero and five, as opposed to the space with the sheep.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1450.6,
    "end": 1455.201,
    "text": "So I guess you can also think about the units of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1455.641,
    "end": 1457.662,
    "text": "I'm talking about the measure of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1457.682,
    "end": 1459.923,
    "text": "I think that sort of makes it easier to understand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1460.734,
    "end": 1473.782,
    "text": " But because these computational models, they are basically operating with computers that are operating with electricity and basically the laws of physics, I think it's important here to sort of think about that in a broader term.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1474.823,
    "end": 1486.93,
    "text": "And I here want to briefly quote Sir Arthur Eddington, who sort of is famous for introducing the idea of the arrow of time, stating that so far as physics is concerned, time's arrow is a property of entropy alone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1487.27,
    "end": 1488.691,
    "text": "And I think that there's some truth to that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1489.355,
    "end": 1502.565,
    "text": " um so if we consider the whole universe as a closed system right then we would expect the heat and the energy to at some point even out completely thermodynamically speaking right is the is the thermodynamic equilibrium and this is where the entropy is is highest",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1504.101,
    "end": 1517.145,
    "text": " So because the entropy of the system is maximized, or basically it's at its highest value, it has reached a state where all the possible ways of distributing energy between the particles has been completely exhausted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1517.165,
    "end": 1519.426,
    "text": "There's no reason for any particle to move anymore.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1519.766,
    "end": 1521.066,
    "text": "There is no hot and cold.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1521.146,
    "end": 1522.466,
    "text": "Everything is the same temperature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1522.887,
    "end": 1525.227,
    "text": "It's the maximum of entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1525.887,
    "end": 1526.028,
    "text": "So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1528.211,
    "end": 1533.535,
    "text": " Well, I guess this is also why you sort of say that energy is unavailable to perform any work, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1533.575,
    "end": 1539.739,
    "text": "So probably I should also mention here that entropy actually is a Greek word for transformation and change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1539.779,
    "end": 1544.302,
    "text": "And I think this is exactly why it fits very well with my understanding of time here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1545.243,
    "end": 1546.124,
    "text": "It's the change, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1546.184,
    "end": 1546.824,
    "text": "It's the process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1547.845,
    "end": 1557.812,
    "text": "So entropy in an abstract way, I think, sort of tries to explain not only spatial states, but also spatial states in relation to time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1558.405,
    "end": 1560.927,
    "text": " like how they can change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1561.687,
    "end": 1570.393,
    "text": "So thermodynamically speaking, there will always be a transfer from hot to cold in order to reach maximum entropy to sort of create a balance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1571.254,
    "end": 1575.677,
    "text": "And importantly, there is a linear causal relationship, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1575.717,
    "end": 1579.279,
    "text": "There's always like one damn thing after the other, as the saying goes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1580.04,
    "end": 1582.862,
    "text": "There's never anything other than like the linear way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1583.682,
    "end": 1585.924,
    "text": "And it goes like the past causes the future and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1586.431,
    "end": 1589.253,
    "text": " And of course, there is no consensus about this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1589.714,
    "end": 1595.439,
    "text": "Lots of people in quantum physics and quantum mechanics will completely oppose that and think that it actually goes the other way around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1596.019,
    "end": 1603.125,
    "text": "But typically, when we talk about this, at least I believe in Newtonian physics, there is a linear causal relationship.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1603.225,
    "end": 1608.31,
    "text": "So the features of objective time is that it's spatial and that it's temporally linear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1609.341,
    "end": 1610.761,
    "text": " Now let's move on to the subjective time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1611.101,
    "end": 1617.983,
    "text": "And as Juan Diego already said, it's the A in the ABCs of consciousness and subjectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1618.523,
    "end": 1630.106,
    "text": "So I'm going to give a brief demonstration of how this particular diagram, which was developed originally by Edmund Husserl in his Bernauer Manuscripte, basically...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1631.963,
    "end": 1636.426,
    "text": " we have to think about the black line here as the objective time, sort of, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1636.586,
    "end": 1639.148,
    "text": "One event, second event, third and fourth, and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1640.069,
    "end": 1648.014,
    "text": "And basically, if we just take the present here as being the event B, well, there is some kind of expectation of what's going to happen at the next moment",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1648.39,
    "end": 1649.971,
    "text": " that is affecting this moment here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1650.351,
    "end": 1656.796,
    "text": "But not only that, there is also another layer to that is going sort of what we call a protension, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1657.136,
    "end": 1667.344,
    "text": "A protension of what's going to happen even beyond C. And you can actually draw this huge diagram out there and you will eventually get like a kind of protension about the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1668.284,
    "end": 1672.247,
    "text": "But at the same time, we also have some information about retention, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1672.267,
    "end": 1677.551,
    "text": "There's something that happened already and we are sort of building our present moment based on",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1677.981,
    "end": 1678.681,
    "text": " our retention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1679.922,
    "end": 1685.944,
    "text": "So the retention sort of explains the immediate past, and we do not refer to this as memory or working memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1685.964,
    "end": 1688.645,
    "text": "It's very explicit that it's not the same thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1688.665,
    "end": 1698.85,
    "text": "I guess the one way we can think about this is also in terms of memories, in terms of melodies, is what I'm trying to say, and sentences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1699.33,
    "end": 1707.033,
    "text": "So, for example, my sentence right now, I started it a few moments ago, but it's still going, and you still have the full sentence in your head, and so on and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1708.047,
    "end": 1728.219,
    "text": " and basically when we talk about the structure of of human experience and i think that juan diego is absolutely right when he says that for any naturalization project for it to succeed it must at the very least get the temporal order right i think this is like the basics of the basics so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1729.366,
    "end": 1739.689,
    "text": " In this case, the way that Uthman Hussar thinks about it is that he thinks about it as the living present being made of a synthesis of retention and protension.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1740.069,
    "end": 1741.989,
    "text": "And this is what we call the primal impression.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1742.529,
    "end": 1743.49,
    "text": "It's the present moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1743.55,
    "end": 1752.212,
    "text": "I will not refer to it always as the primal impression, but that is, I believe, what you call in philosophy the technical term for living present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1753.206,
    "end": 1755.609,
    "text": " But the main issue here still remains.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1755.949,
    "end": 1761.797,
    "text": "So what I'm writing here, how can a sequential structure of time be compatible with one that appears to flow?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1761.817,
    "end": 1764.761,
    "text": "This is the issue that we are dealing with here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1768.615,
    "end": 1772.419,
    "text": " And I think that there is two very important principles that we can point out from here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1772.539,
    "end": 1785.454,
    "text": "Herschelian synthesis, that any experienced moment in time cannot consist of a discrete now moment alone, but must instead coexist with the immediate past and immediate future, which is basically the retention and the protention in this case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1785.874,
    "end": 1791.218,
    "text": " But there is also a very Bergsonian aspect to this, which is the interpenetration, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1791.518,
    "end": 1798.083,
    "text": "So the present moment requires the coming together of subjective and objective temporal structures, which is exactly also what you see here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1798.424,
    "end": 1805.429,
    "text": "There is an objective direction of time, but it's constituted by, well, past and future all the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1808.53,
    "end": 1822.838,
    "text": " And this is basically, if we look at it in a diagrammatic or graphical way, well, the objective time that we call the spatial and linear causal relationship, we say that one event causes the next one, causes the next one, causes the next one, and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1823.447,
    "end": 1825.009,
    "text": " the arrow is very, very clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1825.329,
    "end": 1839.186,
    "text": "But in subjective time, we sort of have this, let's say, opportunity to flip one of the arrows and say that, well, if I'm looking at the event B, not A and C, but just the event B, well, the event B is constituted by a retention and a protension.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1839.246,
    "end": 1840.688,
    "text": "So we have sort of flipped the arrow here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1841.289,
    "end": 1842.37,
    "text": "And this sort of...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1843.792,
    "end": 1846.853,
    "text": " These are two very different orders of time, as we call them in our paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1847.974,
    "end": 1852.216,
    "text": "One is characterized by its unidirectional development in time, which is the objective one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1852.576,
    "end": 1857.238,
    "text": "The other one is characterized by its bidirectional development in time, and this is the subjective one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1857.619,
    "end": 1864.182,
    "text": "Basically, what we do... Oh, probably I should mention here that the notation here is very important to sort of get.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1864.582,
    "end": 1869.644,
    "text": "We're always using the superscript for the objective and the subscript for the subjective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1869.764,
    "end": 1871.065,
    "text": "I meant objective, obviously.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1871.525,
    "end": 1878.107,
    "text": " the superscript for objective and subscript for subjective time dimensions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1878.627,
    "end": 1883.408,
    "text": "And usually we use t for the superscript and tau for the subscript, just to be sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1883.868,
    "end": 1892.991,
    "text": "So what we propose in our paper is basically this integrated continuity where we try to combine both of them into a Husserlian interpretation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1893.451,
    "end": 1899.453,
    "text": " And obviously, we're also relying here a lot on conditional dependencies here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1899.753,
    "end": 1900.793,
    "text": "And this is from statistics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1902.074,
    "end": 1909.256,
    "text": "I guess this is also why I personally like to think of this as kind of a tribute to Boltzmann's statistical approach to entropy, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1909.276,
    "end": 1923.06,
    "text": "Because he was the one who sort of took that step away from simply thermodynamics and movement between energy to thinking about it more as statistics and probability distributions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1923.847,
    "end": 1924.988,
    "text": " I think that was very fascinating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1925.028,
    "end": 1927.45,
    "text": "I think in many ways this is kind of a tribute to that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1927.77,
    "end": 1934.716,
    "text": "So taking the Boltzmannian way of thinking of it and sort of adding this conditional dependency layer to the development of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1934.736,
    "end": 1934.776,
    "text": "So",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1938.524,
    "end": 1942.305,
    "text": " Right, this is what we sort of get at, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1942.525,
    "end": 1945.846,
    "text": "So if you look at the present moment B, this is the event that we're trying to understand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1945.886,
    "end": 1960.849,
    "text": "Well, there's a B minus 1 in objective time, but it's actually a protension, so it's actually a plus 1 as well, because it was a plus 1 pretension later for the next event, which is C.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1961.519,
    "end": 1966.484,
    "text": " And you can actually generalize this the way we do at each corner here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1966.544,
    "end": 1978.556,
    "text": "So y with the superscript object of time plus minus k and the subject of time plus minus n. And you can do the same for the other direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1978.816,
    "end": 1978.856,
    "text": "So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1985.089,
    "end": 1992.159,
    "text": " Basically, what we've been talking about so far is talking about systems and how they function.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1992.319,
    "end": 1995.444,
    "text": "And especially I talked about the universe functioning as kind of a closed system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1995.484,
    "end": 2002.033,
    "text": "I think that's a huge assumption, and I'm not really buying into all of this, but it's basically a good way to explain the approaches that we have made.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2002.947,
    "end": 2008.21,
    "text": " But the body functions as an open system because it's exchanging energy and information all the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2008.27,
    "end": 2009.811,
    "text": "And I'm preaching to the choir here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2009.851,
    "end": 2011.432,
    "text": "You all know about Markov blankets.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2012.272,
    "end": 2016.714,
    "text": "And I don't think that it's important to sort of introduce it to this forum.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2017.495,
    "end": 2019.556,
    "text": "But I would like to just pinpoint a few things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2019.596,
    "end": 2027.84,
    "text": "The first one is that I want to remind you that active inference assumes that there's a border between the central nervous system and the environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2028.401,
    "end": 2030.722,
    "text": "And that can be identified through a Markov blanket.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2031.266,
    "end": 2037.41,
    "text": " And I also would like to emphasize the fact that it's describing the processes and dynamics rather than the things themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2037.97,
    "end": 2040.832,
    "text": "And I'm really emphasizing the process versus the thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2042.914,
    "end": 2046.436,
    "text": "Because marker blankets... Oh, okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2046.536,
    "end": 2046.916,
    "text": "I'm all right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2047.437,
    "end": 2051.639,
    "text": "So basically marker blankets, they represent the statistical boundaries, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2052.86,
    "end": 2054.581,
    "text": "Based on these conditional relationships.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2056.317,
    "end": 2059.299,
    "text": " And they're typically applied in the spatial domain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2059.339,
    "end": 2059.979,
    "text": "This is my point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2060.879,
    "end": 2064.461,
    "text": "It's a statistical boundary in the spatial domain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2064.982,
    "end": 2068.844,
    "text": "Also, I should probably mention that when I talk about conditional dependencies, because I realize that there has been",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2070.174,
    "end": 2079.078,
    "text": " quite a lot of debate about what we mean when we talk about conditional dependencies, well, not specifically for our paper, but in general in statistical work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2080.258,
    "end": 2087.221,
    "text": "What we mean here is that there is a relationship between two or more events that are dependent when a third event occurs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2087.722,
    "end": 2097.886,
    "text": "This is basically the most generic definition of conditional dependencies, which you can find in Judea Pearl's work on Markov and Bayesian networks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2100.148,
    "end": 2106.29,
    "text": " So my point here was just to say that for the Markov blanket, you see that it's just a statistical boundary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2106.55,
    "end": 2120.614,
    "text": "And I know that Carl's monograph, the famous monograph, sort of takes that one step further and suggests that, well, there are Markov blankets actually make up the physical and the spatial boundary between things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2121.234,
    "end": 2125.676,
    "text": "Whereas the way that we apply this is still in terms of statistics and dynamics and processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2126.076,
    "end": 2128.337,
    "text": "So we don't really deal with that aspect here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2132.857,
    "end": 2134.858,
    "text": " Should we really expect things?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2135.199,
    "end": 2136.019,
    "text": "This is my point here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2136.039,
    "end": 2137.2,
    "text": "This is the question that I'm asking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2137.22,
    "end": 2140.623,
    "text": "Should we really expect things in active inference, which is a process theory?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2140.743,
    "end": 2151.931,
    "text": "I mean, I understand that the spatial boundaries, they are a matter of convenience, but can we really expect them to sort of, you know, divide what really is like the central nervous system?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2152.011,
    "end": 2158.776,
    "text": "When does it really transfer into the actual flesh of the body?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2159.838,
    "end": 2162.761,
    "text": " And these spatial transitions, they sort of happen in degree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2162.821,
    "end": 2166.805,
    "text": "And if we look at the borderline, we will be looking at that forever and ever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2167.205,
    "end": 2170.208,
    "text": "And we will look at neurons and then atoms of neurons and so on and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2170.228,
    "end": 2172.571,
    "text": "We will never be able to really find a delineation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2173.171,
    "end": 2177.556,
    "text": "This is where I think that the idea of temporal microblankets sort of is a good idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2178.311,
    "end": 2188.536,
    "text": " Just to briefly sum this up, right, so a marker blanket of this particular node is constituted by its parents and its kids and the parents of the kids here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2188.836,
    "end": 2193.679,
    "text": "So anything that is around that will not hold any valuable information about this particular node.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2193.999,
    "end": 2196.741,
    "text": "Again, I'm probably preaching to the choir here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2197.421,
    "end": 2206.365,
    "text": "But here I'm basically asking, so the delineation is smart because it's sort of, you know, it's...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2207.99,
    "end": 2209.471,
    "text": " It gives us tractability, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2209.531,
    "end": 2210.471,
    "text": "It makes it tractable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2210.491,
    "end": 2213.632,
    "text": "We can start thinking about the dynamics between things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2214.133,
    "end": 2220.855,
    "text": "But in the context of time, we might ask, can we apply the Markov blanket to the temporal structure?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2221.376,
    "end": 2224.277,
    "text": "Because we already drew them as conditional dependencies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2224.972,
    "end": 2230.394,
    "text": " So we sort of asked in our paper, what are the statistical boundaries of the present moment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2230.434,
    "end": 2240.116,
    "text": "So I just show you this one here before of the integrated continuity drawn up here as a network of conditional dependencies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2240.536,
    "end": 2246.278,
    "text": "So if I were to sort of look at this particular point, the event B,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2248.075,
    "end": 2266.741,
    "text": " Well, we will find that if we try to map out this Markov blanket, we will find that the information necessary to understand this particular node is actually constituted by a bit of the past and a bit of the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2267.161,
    "end": 2275.944,
    "text": "So basically, we're kind of cheeky doing this when I think about it, because we're sort of addressing the structure of the blanket that happens in time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2276.385,
    "end": 2276.845,
    "text": "And I think that...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2279.577,
    "end": 2284.32,
    "text": " Obviously, how can I put this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2284.641,
    "end": 2297.249,
    "text": "This is unconventional, which means that there will have to be some limitations compared to the conventional way you would use marker blankets in spatial relationships.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2304.301,
    "end": 2313.508,
    "text": " First, we find that, well, all the information needed to understand the present moment, well, we find them to comply completely with both principles of phenomenology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2313.548,
    "end": 2322.775,
    "text": "We basically get the interpenetration of past and the future, and we also get this integration between the objective and the subjective time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2322.875,
    "end": 2326.737,
    "text": "So we get an integration in this direction, and we get an integration in this direction here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2328.619,
    "end": 2328.739,
    "text": "So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2330.131,
    "end": 2332.372,
    "text": " That was actually our very first surprise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2332.412,
    "end": 2342.278,
    "text": "So the second surprise when we did this, it sort of occurred when we tried to understand what does it take to update the present moment, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2342.378,
    "end": 2345.58,
    "text": "And to actually propagate the whole model through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2346.14,
    "end": 2351.423,
    "text": "And for that, we need to analyze the update function of a standard active inference PONDP.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2351.923,
    "end": 2352.043,
    "text": "So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2354.164,
    "end": 2368.811,
    "text": " Yeah, probably I should mention that the conventional PMDPs in robotics, they don't use the same kind of update function as we use it in active inference because they're much more explicit about the reward functions and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2368.891,
    "end": 2374.154,
    "text": "And active inference obviously caches all of that out as free energy minimization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2374.734,
    "end": 2379.518,
    "text": " So anyway, the dynamics of the present moment are constituted by two protentions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2379.799,
    "end": 2382.461,
    "text": "We have them up here and a single retention, which is down here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2382.641,
    "end": 2385.504,
    "text": "And basically, you will be able to get this particular equation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2385.924,
    "end": 2394.792,
    "text": "And once we start to sort of because these are factors, if we sort of want to turn that into sums, we need to convert them to protentions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2396.133,
    "end": 2397.314,
    "text": " logarithms instead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2397.714,
    "end": 2404.539,
    "text": "And basically, if we just keep this one in mind and put it over here, we see that the first line is our derived model from the slide before.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2405.059,
    "end": 2414.846,
    "text": "And of course, like anyone who's modeling, we have to engage with this very central exercise, which I like to think about as providing quality to quantity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2415.286,
    "end": 2423.472,
    "text": "I think this is a very, very particular problem that researchers in the field of computational phenomenology have to deal with as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2424.406,
    "end": 2429.589,
    "text": " So keeping this exercise in mind, because I will have some comments about this towards the end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2431.07,
    "end": 2437.174,
    "text": "So we have the hidden protension at t plus one and the hidden primal impression at t and t plus one, basically what you see here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2438.175,
    "end": 2441.597,
    "text": "And then we have the observed retention at t minus one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2441.617,
    "end": 2444.999,
    "text": "This is basically what we derive from our model from before.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2445.692,
    "end": 2452.297,
    "text": " Now, the second line here is basically the update function of the active inference from DP.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2452.697,
    "end": 2459.942,
    "text": "And once we actually just strip it away, strip it from all its action policies, you notice here there are no action policies in this update.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2460.762,
    "end": 2462.063,
    "text": "I will return to why we did that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2462.543,
    "end": 2465.806,
    "text": "Then basically what you have is the, well, it's pretty straightforward, actually.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2465.846,
    "end": 2472.37,
    "text": "You have the prior, which is the forward message passing, and you have the predicted, which is the backward one, and you have the likely outcome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2473.531,
    "end": 2473.651,
    "text": "So,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2475.051,
    "end": 2490.62,
    "text": " Our notation here with the double timeline, the double dimension of time in the single notation sort of allows us to understand better what is actually going on here if we map the phonological version or equation that we derived onto the existing update function.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2493.361,
    "end": 2499.004,
    "text": "So I've omitted here a few equations that if you're interested, you can find them all in the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2499.265,
    "end": 2501.406,
    "text": "But essentially, once it's all mapped out, it appears as if",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2502.325,
    "end": 2510.587,
    "text": " update function can be translated into a prior pretension, a predicted primal impression, and a likely retention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2511.147,
    "end": 2519.29,
    "text": "Very similar to how pretension was brought backward, the retention here is brought forward in time, linked with the likelihood and the hidden state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2522.052,
    "end": 2533.007,
    "text": " The discovery, or surprise I should rather say, is both that the model appealed to the same temporal structure as the active inference model, although in a different way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2536.452,
    "end": 2537.453,
    "text": "So I just took this...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2539.56,
    "end": 2553.928,
    "text": " quote from our paper, because this is how we sort of reason about it, that this gives rise to an integrated structure of time where the past depends on prior predictions and the future of my likely retention, which speaks to the phonological understanding of experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2554.229,
    "end": 2568.717,
    "text": "So just as in the Husserlian analysis that retention, primal impression, and protension jointly make up the living present, then we refer to the set of inferences presented here as the living inferences, which is sort of, you know, a word play here between",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2569.127,
    "end": 2577.614,
    "text": " between Prestonian and Husserlian formalities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2578.694,
    "end": 2584.679,
    "text": "So since jointly they serve to describe within an active inference model the phonological process that gave rise to the living present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2586.921,
    "end": 2590.543,
    "text": "So this is basically me working my way here to the end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2592.045,
    "end": 2594.086,
    "text": "We don't have the answer here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2594.246,
    "end": 2596.368,
    "text": "I still think that this is very clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2597.281,
    "end": 2606.143,
    "text": " But we have a suggestion for an answer, which is the continuity that we experience is due to the interpenetration and synthesis of an objective and subjective temporal dimension.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2606.823,
    "end": 2609.504,
    "text": " So yes, can we extract principles?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2609.764,
    "end": 2611.205,
    "text": "That was basically our answer here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2611.245,
    "end": 2613.646,
    "text": "How does the continuous flow in human experience emerge?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2613.966,
    "end": 2619.669,
    "text": "Well, through the interpenetration and synthesis of two temporal dimensions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2620.149,
    "end": 2622.63,
    "text": "Can we extract principles from Husserlian temporality?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2622.71,
    "end": 2625.872,
    "text": "Yes, we can easily extract principles from Husserlian phenomenology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2626.252,
    "end": 2628.653,
    "text": "We just need to note under what conditions this is done.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2628.773,
    "end": 2635.076,
    "text": "And I think this is an important note because you remember when I said that there's this quality to quantity exercise that we all have to engage in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2635.556,
    "end": 2642.723,
    "text": " So basically, my view is that computational phenomenology, if it wants to contribute to science, this would be an extremely important exercise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2643.144,
    "end": 2655.156,
    "text": "But when and how quality is attributed to a specific quantity, it needs to be extensively and very, very clearly elaborated argumentation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2655.839,
    "end": 2664.164,
    "text": " Because you can ask, why does this particular parameter here, right, like typically in active inference, that would be the temperature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2664.585,
    "end": 2667.787,
    "text": "You say that, oh, this particular parameter, it represents attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2668.247,
    "end": 2669.568,
    "text": "Well, does it behave like attention?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2669.628,
    "end": 2670.408,
    "text": "And to what extent?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2670.449,
    "end": 2673.25,
    "text": "Because it will have a limit, and we just need to know when is that limit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2674.551,
    "end": 2680.395,
    "text": "Basically, in our case, we saw that the temporality can be modeled, but we need to know under what circumstances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2680.936,
    "end": 2687.739,
    "text": " So in our case, we assume that the present moment is not a static frozen moment in time, just like space, but it endures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2687.779,
    "end": 2688.899,
    "text": "There's a duration, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2688.959,
    "end": 2695.342,
    "text": "And it's essentially this insight that allows us to create such an integration between the two temporal dimensions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2696.062,
    "end": 2705.406,
    "text": "So finally, I'd like to think that we demonstrated the potential of active inference in being used as a point of departure to model, basically,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2706.28,
    "end": 2708.101,
    "text": " the flow of subjective experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2709.241,
    "end": 2713.082,
    "text": "But I think that we have yet to begin analyzing anything beyond that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2714.683,
    "end": 2719.884,
    "text": "We basically need to start thinking about including action policies, so that's motion and action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2720.344,
    "end": 2724.005,
    "text": "And of course, essentially, we would arrive at something that looks like content, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2726.046,
    "end": 2733.228,
    "text": "So I guess this is, in a way, our rigorous approach and a humble start with the very basics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2734.328,
    "end": 2735.869,
    "text": "And I think that this very slow approach",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2736.835,
    "end": 2744.624,
    "text": " is exactly how it should be because we should be cautious about this relationship between phenomenology and computational modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2745.545,
    "end": 2748.989,
    "text": "Just a few words here about our future work and what we're working on now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2749.71,
    "end": 2749.97,
    "text": "This is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2752.395,
    "end": 2757.339,
    "text": " Actually, this is an example of one of the things that we are working on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2757.379,
    "end": 2767.528,
    "text": "I will say that right now we are focusing on another perspective of our work, which has to do with the direct integration of motor intentionality and action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2767.935,
    "end": 2777.66,
    "text": " But basically, in this particular project, we're sort of trying to map out the exact, let's say, structure of time in any computational model, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2777.7,
    "end": 2783.683,
    "text": "Because when you analyze the update function of any computational model, it will reveal its temporal structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2783.723,
    "end": 2787.866,
    "text": "Like, how does it bring the past into the future, right, into this propagation time?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2788.806,
    "end": 2794.069,
    "text": "So we could ask, like, what about CNNs, right, convolutional networks?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2794.469,
    "end": 2821.834,
    "text": " what about recurrent neural networks or all the encoders or all the other kinds of algorithms how do they function like how do they update their function and i think that um by analyzing all of these different algorithms and their update function we could sort of map out all of these temporal structures and understand better how they are propagating in in in in space through time so um this would be i think my uh my last slide here yes thank you for your attention",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2822.796,
    "end": 2824.236,
    "text": " I was much longer than I am.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2824.296,
    "end": 2824.957,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2829.298,
    "end": 2830.538,
    "text": "Was I muted the whole time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.579,
    "end": 2832.559,
    "text": "Longer in time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.879,
    "end": 2834.5,
    "text": "Or what exactly do you mean by that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.86,
    "end": 2839.061,
    "text": "Well, I would say subjective time was very short.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.941,
    "end": 2842.522,
    "text": "Objective time was much longer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2845.097,
    "end": 2851.021,
    "text": " Thank you both for this really excellent, excellent dyad of presentations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.001,
    "end": 2856.844,
    "text": "And I will pass first to Dean or Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.944,
    "end": 2861.547,
    "text": "Whoever would like to just jump in with a first thought or reflection, please feel free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.787,
    "end": 2863.408,
    "text": "Go ahead, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.73,
    "end": 2870.592,
    "text": "Well, thank you so much for your amazing presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2872.569,
    "end": 2875.952,
    "text": " Gosh, I have so many comments and questions to ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2876.512,
    "end": 2878.554,
    "text": "I don't know where to begin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2879.034,
    "end": 2900.791,
    "text": "But you see, because I'm also deeply interested in process philosophy as well, if not necessarily the Whiteheadian process philosophy, but generally thinking in terms of flows and flux and so on, as opposed to substance and stasis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2901.991,
    "end": 2923.62,
    "text": " But in my view, well, Husserlian phenomenology, these conceptions of flows and the temporality and retention, pretension and so on, is a step toward kind of process thinking, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2925.111,
    "end": 2937.276,
    "text": " Ultimately, I believe that Husserlian philosophy, or more precisely Husserlian phenomenology, fails to escape the trap of substance thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.836,
    "end": 2948.22,
    "text": "Because, you see, if I read a direct quote from Husserl himself, he says that time is like a flow, but with divisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2948.881,
    "end": 2954.103,
    "text": "In other words, not like a flow at all, and in fact, the opposite of a flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2955.768,
    "end": 2971.778,
    "text": " So the reason he doesn't bestow this kind of primacy to the temporality or continuity is because, obviously, it results in a contradiction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2972.238,
    "end": 2975.54,
    "text": "In other words, if what constitutes objects",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2981.243,
    "end": 2986.564,
    "text": " if time is what constitutes objects in time, obviously that cannot itself be an object in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2987.024,
    "end": 3000.467,
    "text": "So he needs a more primary way to, or more primary concept to account for that kind of division in temporality, namely the absolute flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.447,
    "end": 3003.268,
    "text": "But, well, there are some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3004.292,
    "end": 3015.336,
    "text": " arguments regarding whether we can escape this apparent or real contradiction or not, which I'm not going into detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.716,
    "end": 3033.363,
    "text": "But one point I wanted to make is that if we also try to bestow this kind of primacy to the absolute flow or Husserlian absolute flow, don't you think we basically contradict",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3034.364,
    "end": 3045.493,
    "text": " our initial aim to escape that kind of, I mean, substance thinking, given this contradiction that arises?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3045.614,
    "end": 3047.215,
    "text": "That's one of my questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3047.855,
    "end": 3055.022,
    "text": "The other one is about the conception of objective time and subjective time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.922,
    "end": 3067.351,
    "text": " So, interestingly, Husserl, you also began your discussion of Husserlian phenomenology with Husserl's famous musical example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3068.412,
    "end": 3082.383,
    "text": "And it's very interesting that probably the most influential music theory of the past hundred years, namely the Shankarian theory, is fundamentally a phenomenological theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.864,
    "end": 3098.389,
    "text": " because he tries to theorize how we perceive each moment in music as a culmination of every bits of music we've heard so far until that point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3099.209,
    "end": 3103.651,
    "text": "And on the other hand, the anticipation of what is to come and the others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3103.771,
    "end": 3109.993,
    "text": "So each point of music is a kind of combination of all the elements of retention,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3111.381,
    "end": 3114.184,
    "text": " primal moment and also the pretension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3114.204,
    "end": 3114.264,
    "text": "But",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3118.789,
    "end": 3147.739,
    "text": " There are some criticisms put forward, especially by Gerald Levinson, regarding the feasibility of this kind of description because of our limited capacity of our short-term and working memory in trying to at least consciously grasp all of the details of the past and also our limited capacity to predict every",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3149.762,
    "end": 3153.903,
    "text": " possible future or every anticipation from that single point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3154.943,
    "end": 3174.646,
    "text": "So my question is, and also there is another criticism regarding the ignoring the elasticity of perceived time in Shankarian theory and also in Husserlian phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.086,
    "end": 3178.247,
    "text": "So my question is, how would you account",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3179.025,
    "end": 3190.988,
    "text": " for this kind of apparent elasticity that all of us experience in the subjective or manifest time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3192.168,
    "end": 3195.629,
    "text": "And my very last question, sorry, it took me so long.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3196.009,
    "end": 3204.591,
    "text": "And my very last question is about the objective time, which is, do you have any particular justification or any particular reason",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3205.211,
    "end": 3210.534,
    "text": " for choosing one among many of the physical theories of objective time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3211.034,
    "end": 3230.325,
    "text": "So, for instance, we have a view from quantum gravity, a view from relativity, which basically can be seen as kind of contradictory because in general relativity, we allow for the time for temporality to be fundamental.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3230.805,
    "end": 3234.127,
    "text": "But in quantum gravity, temporality is a kind of emergent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3235.428,
    "end": 3240.372,
    "text": " property that emerges from DeWitt-Wheeler equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3240.452,
    "end": 3252.783,
    "text": "So is there a specific reason that you decided to choose Carlo Rovelli's conception of objective time?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3254.444,
    "end": 3257.807,
    "text": "Again, apologies for my long-winded question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3257.827,
    "end": 3260.309,
    "text": "I'm looking forward",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3264.756,
    "end": 3288.432,
    "text": " should i start sharing my screen probably it would be better so we can see each other when you start uh i think some of the first questions uh were about the about the terminology or i can actually i have a few comments to that and i think that if i may uh when you go um yeah go ahead go ahead um i also have some comments but go ahead",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3289.147,
    "end": 3317.552,
    "text": " yeah so i would like to just start by making this the the distinction between um time perception and the temporality and phenomenology um because um temporality is more basic than um time perception time perception is actually a skill it's actually something like it's it's sort of like attention and memory and so on it's a skill set we have and it's something that we are performing uh some are good at it uh some are very bad like me um but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3318.399,
    "end": 3325.743,
    "text": " In any case, temporality in phenomenology talks not about your skills about time perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3325.843,
    "end": 3330.886,
    "text": "It's more about the actual unfolding of anything, like any experience whatsoever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3331.366,
    "end": 3334.688,
    "text": "Like me now shaping these thoughts to sort of convey them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3335.248,
    "end": 3336.709,
    "text": "I'm not thinking about time perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3336.969,
    "end": 3337.89,
    "text": "Actually, it's happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3337.91,
    "end": 3341.472,
    "text": "And there's like this unfolding of time constantly, this continuous flow, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3343.132,
    "end": 3347.775,
    "text": "Whenever I talk about it, I like to think about Lee Smolin's reality of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3348.891,
    "end": 3358.582,
    "text": " I think that there is some truth to his way of reasoning about time, the fact that it's real and it's actually more real than space, and space is actually the emergent property of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3358.822,
    "end": 3364.148,
    "text": "That's actually, by the way, from category theory and geometry theory as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3365.65,
    "end": 3367.071,
    "text": "That's where that comes from.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3369.594,
    "end": 3371.237,
    "text": " Because if we think about it like that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3371.257,
    "end": 3375.002,
    "text": "If you think about the time being the thing that sort of pushes us forward, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3375.022,
    "end": 3376.124,
    "text": "There's like this action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3376.645,
    "end": 3380.05,
    "text": "I wouldn't even say it's an involuntary action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3380.09,
    "end": 3381.472,
    "text": "Like you're constantly doing this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3381.532,
    "end": 3382.594,
    "text": "It's constantly happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3383.194,
    "end": 3387.196,
    "text": " So for me, I would make a clear distinction between time perception and temporality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3387.556,
    "end": 3397.92,
    "text": "Now, if I just jump directly to the end of the question, because I love to deal with... You asked why did we go with Calorovelli's thermodynamic arrow of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3398.04,
    "end": 3405.864,
    "text": "There's a good reason for that, because in the beginning, I believe we discussed briefly the Wheeler-David equations, because...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3406.164,
    "end": 3408.185,
    "text": " In that equation, you completely take away time, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3408.265,
    "end": 3414.489,
    "text": "You just say, well, basically, you can explain any kind of dynamics and change without any variable of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3414.649,
    "end": 3417.23,
    "text": "You just need spatial parameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3418.691,
    "end": 3420.712,
    "text": "I personally think that's great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3420.852,
    "end": 3422.233,
    "text": "That shows that math works.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3422.793,
    "end": 3425.254,
    "text": "It doesn't mean that that's how it works.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3426.135,
    "end": 3428.576,
    "text": "To me, the way that I think about it is more about...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3431.266,
    "end": 3432.327,
    "text": " It doesn't matter what I think about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3432.407,
    "end": 3437.089,
    "text": "Why do we go with Calorovelli's thermodynamic approach?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3437.13,
    "end": 3439.391,
    "text": "Because he starts with entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3440.191,
    "end": 3448.275,
    "text": "And that sort of builds perfectly well on our approach and our analysis of active influence being built on entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3448.676,
    "end": 3453.678,
    "text": "Being, however, another kind of entropy, it still builds on the very same, let's say, ontology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3454.099,
    "end": 3456.5,
    "text": "It builds on the same idea and it fits that idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3456.52,
    "end": 3458.421,
    "text": "It could still be wrong.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3459.184,
    "end": 3468.766,
    "text": " In any case, if you go with David and Wheeler's equations, you still have another dimension of time that is different from the subjective one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3469.827,
    "end": 3474.488,
    "text": "I think I should be clear here that I'm not saying that they exist independently.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3474.948,
    "end": 3478.709,
    "text": "I'm just saying that it's two different things, and we can think about them individually.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3479.369,
    "end": 3484.51,
    "text": "And there is an advantage in doing something like that, because then you can start looking at how they integrate afterwards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3485.07,
    "end": 3486.731,
    "text": "So this is merely convenience, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3488.294,
    "end": 3492.479,
    "text": " There is no such thing as only a subjective time without objective time and the other way around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3492.499,
    "end": 3494.963,
    "text": "This is not part of the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3495.083,
    "end": 3497.366,
    "text": "It's way beyond the scope of the paper anyway.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3500.47,
    "end": 3504.395,
    "text": "Yeah, kind of lashing into Zach's comment towards the end is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3505.433,
    "end": 3509.856,
    "text": " When we were writing the paper, we were discussing slightly about how we should address objective time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3510.096,
    "end": 3516.219,
    "text": "And in the end, we decided to use Carlo Rovelli's framework as just a matter of convenience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3516.259,
    "end": 3524.204,
    "text": "I think at least I'm very much an instrumentalist in that sense that you can have a lot of different stories of how physical time works.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3525.064,
    "end": 3546.056,
    "text": " and that's important and that's okay, but in the end I don't think that affects too much our overall purpose, which is to say there's an integration between an objective sense of time and subjectivity, in which we are pretty much committed to the Husserlian framework, which this brings me to the other two questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3547.413,
    "end": 3568.227,
    "text": " Considering the first one about the relationship between Protestantology and Husserlian phenomenology, I think the important thing to note here, and this is my interpretation, to be honest, is that when we talk about consciousness and time consciousness and the absolute flow within the Husserlian framework, it's important to notice that it is not a thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3568.647,
    "end": 3574.651,
    "text": "And I think it's also an important thing to keep in mind when we address how are we to explain consciousness scientifically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3575.351,
    "end": 3582.417,
    "text": " I do believe that's a sort of implicit assumption within a lot of the literature, especially the earlier one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3582.757,
    "end": 3592.546,
    "text": "It's assumed that consciousness insofar as a phenomenon, it's also a thing that has to arise from, say, neural processes or neurophysiological processes or whatever kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3593.346,
    "end": 3594.487,
    "text": " frame you're subscribing to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3594.507,
    "end": 3595.347,
    "text": "But it's not really that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3595.688,
    "end": 3606.735,
    "text": "And that's the nice thing about phenomenology, especially Husserlian phenomenology, is that when you go to the kind of the deep level of whatever is happening subjectively, you won't find a thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3606.875,
    "end": 3611.017,
    "text": "You find what he calls the absolute flow, which does sound like a thing as a river.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3611.358,
    "end": 3613.359,
    "text": "And he does say that it's a flow, but it's not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3613.439,
    "end": 3616.241,
    "text": "There's always this hesitation in the literature because he",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3618.729,
    "end": 3630.035,
    "text": " is that everything in flow, what we experience, there's always this, there's a lot of stuff happening at the same time and in time, but it kind of keeps a structure, which is retention, primal impression, and protension.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3630.415,
    "end": 3634.097,
    "text": "So there's this kind of paradoxical nature to the absolute flow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3634.437,
    "end": 3637.619,
    "text": "It's pure flow, but it has a specific structure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3638.22,
    "end": 3646.044,
    "text": "But when you look at how that structure functions, and that's kind of the step that he takes from the so-called static to the genetic or dynamical phenomenology,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3646.664,
    "end": 3650.528,
    "text": " is that this structure is just a set of processes that are always happening.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3651.389,
    "end": 3651.929,
    "text": "Not things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3652.29,
    "end": 3656.073,
    "text": "It's not that retention is a thing, but no, it's literally processes happening.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3656.313,
    "end": 3657.294,
    "text": "Synthesis, as he calls it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3657.795,
    "end": 3665.002,
    "text": "And that's what we think it's interesting to connect to the Active Inference Framework or any other modeling framework, is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3665.502,
    "end": 3674.349,
    "text": " then you don't really have to capture a thing, say qualia, say the redness of the red, but actually you're just trying to capture processes with processes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3674.529,
    "end": 3677.031,
    "text": "So you have retention and you have inferences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3677.652,
    "end": 3678.032,
    "text": "That's it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3678.052,
    "end": 3678.812,
    "text": "You don't have real things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3678.832,
    "end": 3685.438,
    "text": "You have stuff that is happening through time and you don't really have to commit to any sort of object ontology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3685.698,
    "end": 3691.943,
    "text": "You have just processes moving on through which something more stable arises, but it's not a thing, once again.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3692.663,
    "end": 3697.946,
    "text": " When we experience, say, the bottle, it's a thing, but it's always giving itself in time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3697.966,
    "end": 3698.707,
    "text": "It's always changing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3698.747,
    "end": 3699.447,
    "text": "I can see its movement.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3699.507,
    "end": 3701.829,
    "text": "I can move around all this time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3702.169,
    "end": 3703.09,
    "text": "That's the nice thing about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3704.03,
    "end": 3711.335,
    "text": "And concerning the other question, which was the one on the limitations on working memory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3711.355,
    "end": 3713.436,
    "text": "About the elasticity of time perception.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3714.157,
    "end": 3717.599,
    "text": "Can you elaborate more about the concept of elasticity as you were using it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3718.343,
    "end": 3718.664,
    "text": " Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3719.765,
    "end": 3732.082,
    "text": "You see the familiar phenomena that we experience when we somehow experience this speeding up or slowing down the experience or living present.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3732.462,
    "end": 3735.747,
    "text": "That's basically what I mean by elasticity of time perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3737.346,
    "end": 3737.786,
    "text": " Okay, brilliant.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3738.887,
    "end": 3749.473,
    "text": "I often wonder, because certainly when we talk about subjective temporality in the Husserlian sense, that's not really what he's trying to capture, that's quite clear.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3749.573,
    "end": 3754.356,
    "text": "He's simply, when he talks about the structure of time conscience, he's very explicit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3754.416,
    "end": 3758.759,
    "text": "We're talking about formal structure that remains arguably invariant through all experiences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3758.779,
    "end": 3762.901,
    "text": "But it's true that there's a sort of flexibility to how to experience the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3763.502,
    "end": 3763.582,
    "text": "And",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3764.322,
    "end": 3766.063,
    "text": " This is literally a speculation for me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3766.083,
    "end": 3767.684,
    "text": "I'd have to sit down and think more about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3767.704,
    "end": 3770.805,
    "text": "But I think there's an important connection between affectivity and temporality here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3771.225,
    "end": 3781.55,
    "text": "So there's kind of, especially in activism, there's these discussions about how affectivity and time consciousness in the Husserlian or phenomenological sense link to one another.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3782.09,
    "end": 3784.571,
    "text": "For example, this is not an activism of the slow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3784.611,
    "end": 3787.653,
    "text": "Matthew Radcliffe talks about styles of anticipation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3787.713,
    "end": 3792.695,
    "text": "We may anticipate something with anxiety or with hope or with fear.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3793.355,
    "end": 3798.699,
    "text": " And that probably stretches out not only that we anticipate, but how we anticipate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3798.999,
    "end": 3803.261,
    "text": "And that's very important, how we anticipate something and what we're anticipating something.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3803.622,
    "end": 3808.445,
    "text": "And this also kind of constitutes our general openness to the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3808.485,
    "end": 3818.291,
    "text": "Because say, if I'm sitting down completely bored, waiting for something, not only the experience of time kind of stretches on, stretches out, but also...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3819.588,
    "end": 3822.489,
    "text": " you know, there's a special kind of affective atmosphere to our world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3823.03,
    "end": 3836.356,
    "text": "But once again, this kind of opens up another question for computational neurophenomenology, which is, okay, now we have in active inference this kind of clear-cut temporal structure that links up to Husserlian phenomenology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3836.776,
    "end": 3838.817,
    "text": "How can we introduce affectivity into the picture?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3838.877,
    "end": 3844.94,
    "text": "And there's, of course, a lot of work and affectivity, emotions, affect more generally in the active inference framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3845.3,
    "end": 3846.721,
    "text": "But that's an interesting question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3847.021,
    "end": 3849.342,
    "text": "How does it relate to our temporal model?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3850.834,
    "end": 3852.535,
    "text": " I don't know if Zach has anything else to add.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3854.175,
    "end": 3856.977,
    "text": "I was just reminded of a few things there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3857.597,
    "end": 3860.778,
    "text": "I think you're totally on point with everything you said.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3860.838,
    "end": 3867.321,
    "text": "I just want to emphasize the fact that the stretch and the plasticity of time is still, in my opinion, something of a skill that we have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3867.742,
    "end": 3892.676,
    "text": " right it's an impression and that impression is something like that we that we get at um and just because i have that experience doesn't mean uh if i had like a twin and we were doing this not even just a friend and we were doing the exact same thing that stretch will be very individual and it that just means that it depends on well on who you are and your skill at doing that i cannot really differentiate between time perception and the plasticity that sort of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3893.217,
    "end": 3921.376,
    "text": " is implicit in time perception i cannot distinguish that from like other skills like being able to remember something or directing your attention at something um because that's exactly the same thing we don't have the same skill like some people are very bad at suppressing peripheral information others are not and it just continues like that um but but i i do have a um a point um so do you guys know james turrell the light designer",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3922.309,
    "end": 3947.261,
    "text": " uh artist american artist he's a fantastic light designer i highly recommend you go see all of his work um basically he has he studied the eye and vision so it never envisioned he's not a vision neuroscientist but he studied vision for many many years and he's a light designer and basically he creates these huge installations everywhere um and one that really caught my attention was in japan uh i think now it's seven years ago",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3947.745,
    "end": 3950.006,
    "text": " We went into this pitch dark room, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3950.066,
    "end": 3952.727,
    "text": "It's a big temple that was reconstructed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3952.887,
    "end": 3953.307,
    "text": "Pitch dark.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3953.687,
    "end": 3954.428,
    "text": "Couldn't see anything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3954.948,
    "end": 3957.349,
    "text": "And you just had to touch the wall and you had to follow the wall.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3958.209,
    "end": 3963.091,
    "text": "And then suddenly you feel like, okay, now there are other people also holding the wall.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3963.411,
    "end": 3965.132,
    "text": "And you sort of feel other people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3965.152,
    "end": 3966.273,
    "text": "You go, okay, I need to stop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3966.333,
    "end": 3967.593,
    "text": "I shouldn't follow the wall anymore.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3967.953,
    "end": 3970.274,
    "text": "And at some point, you're just staring out in complete darkness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3970.894,
    "end": 3972.215,
    "text": "The space suddenly emerges.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3973.018,
    "end": 3983.486,
    "text": " Your eyes adjust to the very, very low light, well, the lux, I don't know the exact illuminance, I suppose in English, the very low illuminance you start to adjust.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3983.927,
    "end": 3985.828,
    "text": "And this can only happen over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3986.369,
    "end": 3991.112,
    "text": "I think that this sort of is an example of temporality, sensory impression, content.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3991.893,
    "end": 3993.634,
    "text": "I wouldn't say quality because I don't buy into that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3994.575,
    "end": 3997.898,
    "text": "I'm totally, I'm more of a time person.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3997.918,
    "end": 3999.479,
    "text": "I don't know if you get the impression.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4001.01,
    "end": 4003.552,
    "text": " But I have a question for you as well, Ali, if I may.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4004.793,
    "end": 4014.641,
    "text": "Because this example that I just gave here with James Turrell, and I'm an architect myself, usually I give that example with the spaces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4015.382,
    "end": 4019.726,
    "text": "Would you say that it's the same experience, or would you say that those are two very different experiences?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4023.009,
    "end": 4025.691,
    "text": "Well, certainly there are similarities between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4026.104,
    "end": 4038.431,
    "text": " between those two experiences, I'm not sure if they're identical or even they can be discussed in, I don't know, in the same terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4039.152,
    "end": 4054.961,
    "text": "But going back to your point on the temporality and also the skill, the discrepancy between the primacy of the skill, the primacy of the temporality versus the skill of time perception,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4055.781,
    "end": 4058.684,
    "text": " Well, I certainly agree with you on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4059.465,
    "end": 4076.581,
    "text": "But I also believe that, you see, I don't think, at least in my opinion, that temporality or the absolute flow, or at least certainly an absolute flow, is the most fundamental thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4078.594,
    "end": 4092.688,
    "text": " fundamental concept that needs to be grounded because there needs to be even more fundamental prior to even existence of that temporality or that flow, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4093.569,
    "end": 4100.576,
    "text": "Which I'm not going into details about how that fundamentality can be accounted",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4101.416,
    "end": 4109.339,
    "text": " or can even be discussed in terms of our observed phenomena or our experience phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4109.799,
    "end": 4117.022,
    "text": "But I wanted to thank both of you for your extensive response you provided and helpful responses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4117.782,
    "end": 4118.822,
    "text": "I wanted to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4120.943,
    "end": 4138.841,
    "text": " ask for your permission to... I wanted to discuss these matters a bit further with you, so if you permit, I wanted to email you about them and discuss them a bit further because that's something that I'm deeply interested in, so again, thank you so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4139.77,
    "end": 4140.11,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4140.27,
    "end": 4140.771,
    "text": "Of course you can.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4140.791,
    "end": 4141.091,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4141.832,
    "end": 4143.754,
    "text": "Can I say something before we go?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4143.814,
    "end": 4144.134,
    "text": "Oh, please.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4144.634,
    "end": 4145.295,
    "text": "Just a small thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4145.315,
    "end": 4149.659,
    "text": "Because Ali just mentioned this, that he does something that is kind of the basic thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4150.059,
    "end": 4166.414,
    "text": "And I don't know to what extent I agree, but something I do think that happens is that, at least in the Husserlian framework, this kind of conception that consciousness or subjectivity, more generally, is this kind of layered or hierarchical structure of which you have to find literally the basis and go from the ground up, so to speak.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4167.287,
    "end": 4173.75,
    "text": " And I think there's something true to that, but it's not completely, it's not as hierarchical as we should put it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4173.77,
    "end": 4178.732,
    "text": "Because once again, this brings us back to the concept, this relationship between affectivity and temporality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4178.792,
    "end": 4183.694,
    "text": "For me, I would say affectivity informs temporality and temporality informs affectivity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4183.714,
    "end": 4184.814,
    "text": "They are co-emergent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4185.114,
    "end": 4186.795,
    "text": "But how can you affect it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4186.935,
    "end": 4190.437,
    "text": "Because you have a body and then you introduce embodiment into the picture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4190.477,
    "end": 4195.999,
    "text": "And if you introduce embodiment into the picture, you open up a lot of, like you open up the Pandora's box almost.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4196.559,
    "end": 4208.046,
    "text": " So maybe this whole idea of the most basic stuff, it's a bit of a red herring, but I also think there's something valuable, and Husserl would agree on this bit, is that temporality is very abstract.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4208.126,
    "end": 4215.451,
    "text": "It's just a formal structure which underpins all experience, regardless of whether it's the most basic structure or not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4216.392,
    "end": 4217.232,
    "text": "That's a different question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4217.732,
    "end": 4219.193,
    "text": "And that's all I wanted to say for now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4220.214,
    "end": 4220.554,
    "text": "Awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4221.155,
    "end": 4221.455,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.951,
    "end": 4226.354,
    "text": " We'll pause in time and move on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.435,
    "end": 4230.838,
    "text": "Dean, please, where does this take you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.421,
    "end": 4235.504,
    "text": "Well, I'm like Ali a whole bunch of places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.604,
    "end": 4241.21,
    "text": "I'm not like Ali in the sense that I do place a very high priority and emphasis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.417,
    "end": 4244.798,
    "text": " on timing and perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.538,
    "end": 4249.201,
    "text": "That doesn't mean that Ali and I don't get along fantastically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.241,
    "end": 4249.721,
    "text": "We do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.522,
    "end": 4256.345,
    "text": "It's just that it's that different perspective thing that I think gives this whole topic a certain richness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.306,
    "end": 4266.231,
    "text": "I want to touch for a second on Zach's teasing out the word skills, because I think that's really, really important here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.752,
    "end": 4270.214,
    "text": "My background is sort of in the practical aspects of learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.381,
    "end": 4276.968,
    "text": " So I tend to zoom out on not just the particulars, but the whole picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.229,
    "end": 4281.534,
    "text": "And I want to just say before I ask my question is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.577,
    "end": 4286.058,
    "text": " I thought it was a fantastic comparative analysis in your paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.858,
    "end": 4300.601,
    "text": "And I thought your presentation and your sharings today were also very clear in terms of being able to show difference and same, which I think only comes about when we account for the temporality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4300.641,
    "end": 4306.803,
    "text": "Not that I'm not saying measure it, but at least have a certain appreciation of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.403,
    "end": 4308.263,
    "text": "So here's my thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.011,
    "end": 4318.138,
    "text": " Practicalities, in other words, the actions in active inference, are not necessarily always a capture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.459,
    "end": 4324.583,
    "text": "That can be one form of an action, but it's not the only one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4324.663,
    "end": 4334.832,
    "text": "There are plays, there are creations and compositions, which we, looking at category theory, are quite intimately familiar with now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.853,
    "end": 4338.235,
    "text": "So one of the things that I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.198,
    "end": 4344.32,
    "text": " tried to bring to the conversation about a decade ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4344.34,
    "end": 4352.522,
    "text": "I was working with a number of people in complexity science and complexity research, and they were huge Maturana and Varela fans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.463,
    "end": 4361.045,
    "text": "And for about two years, all I did was have conversations like the one we're having today with complexity scientists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4362.625,
    "end": 4388.687,
    "text": " And one of the things I tried to bring to them in terms of understanding the possibility of applying skills as learning were, number one, you first have to be able to get people to pay some sort of attention, have an awareness of what they are embedded in, what their niche is, what is being signaled to them, etc.,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.12,
    "end": 4393.101,
    "text": " Number two, you have to be able to link and combine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.181,
    "end": 4406.345,
    "text": "And I know that in a lot of formal learning settings, that association piece, that skill of being able to do that sort of compare and is this same, is this different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4406.545,
    "end": 4407.766,
    "text": "Again, category theory stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.386,
    "end": 4410.006,
    "text": "There's a heavy emphasis placed on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.367,
    "end": 4415.448,
    "text": "Then there's another skill, which is to be able to set a rule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.687,
    "end": 4425.349,
    "text": " to be able to scale up around what is consistent, what is seeming to be able to have a certain shelf life,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.314,
    "end": 4430.899,
    "text": " and things that are changing rapidly, because you guys talked a lot about change today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.339,
    "end": 4434.182,
    "text": "So that's basically an understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.762,
    "end": 4437.205,
    "text": "You can know in English where that came from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.225,
    "end": 4447.214,
    "text": "You're basically standing under the abstracted state, the heuristics, the little sort of rules of thumb that you apply as a skill subjectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.055,
    "end": 4450.678,
    "text": "And then finally, and this is one that's left off of most",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.003,
    "end": 4455.864,
    "text": " out of most conversations, there's a particular type of self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.004,
    "end": 4460.926,
    "text": "All of these are self-organizations, even if you're being prompted by the teacher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.486,
    "end": 4464.628,
    "text": "You still have to take up the skill of organizing yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.408,
    "end": 4476.732,
    "text": "But there's a fourth type of skill, which is a particular type of self-organization, which is being the capacity to transfer, recapitulate in a timely manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.339,
    "end": 4482.924,
    "text": " And I think that's where your paper is opening up a bit of a Pandora's box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.964,
    "end": 4486.567,
    "text": "It's not just a comparison of objective and subjective time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.928,
    "end": 4492.052,
    "text": "It's how do we know when to reapply the rule?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.393,
    "end": 4498.057,
    "text": "And I think from a learning standpoint, that's a big moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.518,
    "end": 4504.083,
    "text": "It's not just a eureka moment, but it's a sense of do my inferences work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4506.078,
    "end": 4513.181,
    "text": " now withstand the scrutiny of the environment, the environment generally, not just the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.581,
    "end": 4525.785,
    "text": "So is the niche capturing us or are we still free to think about how that next move fits with all the prior moves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.125,
    "end": 4533.108,
    "text": "And I think that requires the representation that you guys had in your paper, that essential diagonal line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.908,
    "end": 4534.208,
    "text": "And so,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4535.868,
    "end": 4538.269,
    "text": " I think that's what you did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.689,
    "end": 4551.832,
    "text": "I think what you've touched on and put into defendable form is, okay, so there's all these skills, and do we cut ourselves off at the more phenomenological ones?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.312,
    "end": 4553.352,
    "text": "Are you paying attention?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.893,
    "end": 4555.353,
    "text": "Are you making associations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.933,
    "end": 4563.255,
    "text": "Or are you freeing yourself up to be able to have these rules, but then know when to reconsider?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.795,
    "end": 4566.716,
    "text": " purpose them as the context changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.976,
    "end": 4580.041,
    "text": "So I want to applaud you because I've had many, many conversations for over a decade where there's a whole bunch of people who do not want to talk about the third and the fourth skill because it's hard to measure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.242,
    "end": 4587.444,
    "text": "But I think you guys have brought some ability to compose that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.844,
    "end": 4589.425,
    "text": "And so that's all I wanted to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.445,
    "end": 4590.345,
    "text": "I don't have any questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.946,
    "end": 4591.666,
    "text": "Just want to give you a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.237,
    "end": 4593.738,
    "text": " two claps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4598.963,
    "end": 4599.603,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4599.663,
    "end": 4601.245,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4601.325,
    "end": 4613.938,
    "text": "I don't even know what to say because I guess to Juan Diego and I it was actually I think over a Twitter conversation we sort of realized a few things and basically",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4614.827,
    "end": 4617.109,
    "text": " well linked up and started working on this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4617.169,
    "end": 4621.472,
    "text": "And apparently we have a lot in common in terms of philosophy, uh, well, and also other things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4621.532,
    "end": 4629.257,
    "text": "But, um, interestingly, we found out that there was actually a, you know, plausible, attractable, uh, relationship that we could exploit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4629.277,
    "end": 4632.779,
    "text": "Um, so, well, uh, thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4632.82,
    "end": 4633.3,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4633.82,
    "end": 4639.484,
    "text": "Um, I'm very happy to see that there's someone else who is also like a very temporal person, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4639.524,
    "end": 4640.625,
    "text": "Like think, thinking about,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4641.172,
    "end": 4643.776,
    "text": " things and time and events rather than things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4643.856,
    "end": 4645.639,
    "text": "And I think this is a very important distinction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4645.659,
    "end": 4647.602,
    "text": "Yeah, for sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4647.903,
    "end": 4649.004,
    "text": "Thank you for that comment, Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4649.565,
    "end": 4656.015,
    "text": "And I also think that it kind of speaks up to the whole temporal thing we're talking about precisely because",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4657.185,
    "end": 4676.629,
    "text": " what we learn through time, and that's kind of obvious, but you have to kind of address how the temporality works in order to eventually talk about learning and following rules and understanding our environments, you were saying, kind of understanding how to apply these rules and how to apply different skills in a proper environment, adaptively, so to speak.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4677.109,
    "end": 4700.556,
    "text": " And something that first kind of attracted me to the active inference and FEP context was probably this possibility of making sense of how, through updates to generative models, you can try to make sense formally of these skills and these processes that underline what it's like to be an organism and a human being in a changing world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4700.696,
    "end": 4704.117,
    "text": "And once again, it brings us back to change, temporality, all this stuff.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4704.797,
    "end": 4705.477,
    "text": "It's all connected.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4708.428,
    "end": 4709.909,
    "text": " Can I just do one quick follow-up, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.929,
    "end": 4712.332,
    "text": "Because I know I want to make sure you have some time as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.073,
    "end": 4726.128,
    "text": "I think what people struggle with is they can name it and call it transference, and oftentimes that gets conflated with understanding and wisdom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4726.912,
    "end": 4729.072,
    "text": " And that isn't necessarily so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.573,
    "end": 4735.414,
    "text": "That timely way of being able to recapitulate something is an incredibly important skill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4736.074,
    "end": 4741.175,
    "text": "If we get that wrong, we oftentimes materially fall off a cliff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4742.335,
    "end": 4755.798,
    "text": "But whether or not we can see it as both discretized, as its own entity, its own particulars, and part of this massive whole that requires all of these priors as well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4756.772,
    "end": 4765.818,
    "text": " Being able to juggle that I think is again, that's what you've opened up here and hopefully",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.045,
    "end": 4772.69,
    "text": " people are able to then take that information and test it because that's the best thing to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4773.231,
    "end": 4788.124,
    "text": "In fact, this morning in another separate conversation altogether, I was asked how to take some of the practicalities and the skills that you guys talked about in your paper and apply them in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4788.685,
    "end": 4793.089,
    "text": "And it's not really, really hard if you have at least those four skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.048,
    "end": 4803.791,
    "text": " It is very difficult if you stop at the associative level or if you stop at the, I built a rule now and I know how far that rule will extend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.611,
    "end": 4807.492,
    "text": "So that's my final say for today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.092,
    "end": 4808.532,
    "text": "Go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.552,
    "end": 4809.112,
    "text": "Sorry, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.972,
    "end": 4812.053,
    "text": "Oh, it's all great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.193,
    "end": 4815.774,
    "text": "So many threads weaving together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4815.834,
    "end": 4818.935,
    "text": "So again, to both presenters and authors, it was excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4820.939,
    "end": 4840.708,
    "text": " The dominant sense or impression is that it's very evocative what you've presented, the idea of a generative passage, not just does it touch upon generative models, generative AI, but also this idea that our travels are generative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4841.108,
    "end": 4846.991,
    "text": "Like whenever we see a friend and we take the train, we always have some story to share and like something that happened along the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.791,
    "end": 4855.638,
    "text": " I know that's not necessarily how it's used, but it's just what it evoked when you described formal dynamical models as generative passages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4856.299,
    "end": 4859.482,
    "text": "It's not 95 theses to pin onto the door.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4860.042,
    "end": 4867.99,
    "text": "It's something that evokes and you even spoke about taking different perspectives on your work rather than your work advancing a perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.63,
    "end": 4894.313,
    "text": " And then to hear about the connections with the light and sound art and visual art and the notion of architecture and your background, Zach, and the interplay between space and time and the way that sometimes we can look at a blueprint and see it as static or even the constructed embodied building as a static object when it also moves through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4895.314,
    "end": 4912.208,
    "text": " um then one more impression and then a question finally the um the vocabulary and the the delicacy of the articulation with the protension retention and the primal impression or the living presence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4913.149,
    "end": 4925.171,
    "text": " And then the way in which graphically you arranged it along orthogonal axes like rows and columns that allowed us to slide through on the diagonal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4927.132,
    "end": 4929.512,
    "text": "It gives a lot to work with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.673,
    "end": 4934.913,
    "text": "And my question is, where's the action perception loop?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4935.534,
    "end": 4936.934,
    "text": "Or how do you believe that this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4938.288,
    "end": 4957.431,
    "text": " time consciousness and um associated methods and skills how can we then go back to potentially earlier or contemporary representations of the particular partition under the fep or just the active uh inference action perception loop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4958.692,
    "end": 4968.496,
    "text": " How can we see that or be with that differently with the advances that are happening literally in the last year in this area?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4973.138,
    "end": 4976.039,
    "text": "Oh man, that's right on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4976.379,
    "end": 4977.8,
    "text": "I mean, spot on this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4977.88,
    "end": 4979.78,
    "text": "This is exactly the kind of research I do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4979.941,
    "end": 4980.881,
    "text": "Basically, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4981.818,
    "end": 4984.899,
    "text": " I have like, I guess, two paths in my research.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4985.539,
    "end": 4992.521,
    "text": "I think 80% of my time is empirical research doing neuroscience and basically doing experiments all the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4993.161,
    "end": 5007.184,
    "text": "And one way that I translate all of these insights that I get from working with someone like Juan Diego is to try to understand them as what I like to think about as sensory motor entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5008.473,
    "end": 5016.8,
    "text": " basically talking about it as the interaction and the loop that naturally occurs not only in action perception, but also in past and present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5017.34,
    "end": 5027.429,
    "text": "And if I may just briefly share my screen again, I would like to show you that this last aspect, I hope you can see my arrow, I'm not sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5029.269,
    "end": 5036.731,
    "text": " I'm just going to take the laser pointer just to be sure that this last point here, I think this sort of maybe over here is better.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5036.751,
    "end": 5047.935,
    "text": "You can see that the retention and the protension sort of correlating or sort of meeting here in the middle and sort of creating a loop through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5047.995,
    "end": 5050.575,
    "text": "So if we have to jump from this point, this is the update step.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5050.696,
    "end": 5055.577,
    "text": "So from update step one to two, you sort of need to create this interwoven link between them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5056.018,
    "end": 5070.403,
    "text": " This is naturally creating a loop between, well, action and perception because action is what brings you forward in time, perception was part of the retention, and basically there will be this naturally occurring loop just from basic principles of temporality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5070.423,
    "end": 5076.946,
    "text": "It's like you cannot get around that action perception sort of emerges from temporality all naturally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5077.946,
    "end": 5083.768,
    "text": "So in my opinion, the way that I think about it is as sensory motor entropy, and basically you can look at that and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5084.246,
    "end": 5096.132,
    "text": " the amazing results that people are finding now around the thalamus, which is basically the central organ of the brain, the subcortical structure actually functions as a bridge between major brain regions, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5096.172,
    "end": 5105.797,
    "text": "So for you to actually perform any kind of action, it needs to use the thalamus as a bridge, which means that it's intrinsically related to the way things change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5105.917,
    "end": 5111.22,
    "text": "And there's like this, I guess you can think about it, not as things, but as events, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5111.71,
    "end": 5116.516,
    "text": " So to give an example like Juan Diego did with his bottle, this is my cup.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5117.016,
    "end": 5127.929,
    "text": "And the fact that my cup continuously exists is not the thing that exists all the time, but there are events occurring in which this one continues to exist.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5128.447,
    "end": 5128.647,
    "text": " right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5129.087,
    "end": 5136.753,
    "text": "So it's more about thinking of the evolution of time being highly correlated with itself rather than thinking about things existing in time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5137.133,
    "end": 5146.5,
    "text": "But this is like a reverse way of thinking about it and the typical strategy of active inference is flipping things on the head and see if it actually still makes sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5146.58,
    "end": 5149.102,
    "text": "In this case, I genuinely think it does.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5149.882,
    "end": 5151.644,
    "text": "I don't know if I answered your question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5152.644,
    "end": 5152.844,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5153.305,
    "end": 5153.845,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5155.386,
    "end": 5156.467,
    "text": "Yeah, I would, I would,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5157.684,
    "end": 5168.028,
    "text": " Just to be able to hold up two things again, I would say that there is the bridging piece and there is also the high occupancy vehicle lane as opposed to the intersection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5168.549,
    "end": 5177.372,
    "text": "Like a lot of the ways that we represent this stuff is when we get those X and Y vectors crossing one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.832,
    "end": 5183.835,
    "text": "But there's also a let's get all four skills onto one platform and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5184.511,
    "end": 5210.972,
    "text": " remove a lot of the impediments and that's that flipping part i i would agree exactly with what you're saying you have to have both one as a metaphor as a metaphor it's all that's all it is metaphorical but if you can get all four skills in one place and then down down the distance you'll shorten the amount of time it takes to arrive at wherever you're going",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.643,
    "end": 5216.003,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5216.023,
    "end": 5228.529,
    "text": "Juan, and please feel free to give kind of your closing thoughts and next angles as we come near, I don't even know whether to call it an end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5232.251,
    "end": 5232.591,
    "text": "Lovely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5232.631,
    "end": 5237.774,
    "text": "So I just wanted to go back to Daniel's question because I thought it was a great question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5238.394,
    "end": 5242.977,
    "text": "One I didn't think about, at least in the specific terms, which Zach was discussing precisely, kind of the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5245.055,
    "end": 5247.017,
    "text": " where action fits in all this story.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5247.117,
    "end": 5249.399,
    "text": "And this, of course, brings us to the action-perception loop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5250.139,
    "end": 5257.125,
    "text": "And I guess I'm going to do what we usually do in our collaborations with Zach, which is I'll bring the phenomenology and see whether it fits.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5258.245,
    "end": 5270.275,
    "text": "And I think it fits quite well because what we did in our model is to show that there's precisely this boundary, this temporal boundary to the objective scheme of active inference, which integrates past and future.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5271.535,
    "end": 5277.018,
    "text": " And we kind of relate this to pro-tension, re-tension, primal entresion, and you have this nice living present.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5277.358,
    "end": 5291.905,
    "text": "What is fascinating is that when you go a step further away from the pure temporal form of experience, you have an embodied being whose anticipations, whose pro-tensions are not simply the tones that are coming from the melody, but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5292.405,
    "end": 5293.646,
    "text": " What do you do with them?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5293.666,
    "end": 5294.687,
    "text": "Or what do you do?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5294.787,
    "end": 5298.791,
    "text": "So if I see my bottle again, this bottle appears as something I can grasp.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5298.831,
    "end": 5302.514,
    "text": "And you can think about this in terms of affordances, action possibilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5303.074,
    "end": 5306.317,
    "text": "And that's very clear in the phenomenological literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5306.397,
    "end": 5312.623,
    "text": "And also, I think, in the active inference literature, we talk about action policies and civic affordances, all this stuff.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5313.612,
    "end": 5326.716,
    "text": " And it is fascinating because then you get action just by introducing the temporal aspect of active inference, but this action is always informed by prior observation, so by literal perception, and that happens as well in phenomenology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5327.237,
    "end": 5333.759,
    "text": "All our actions are informed by what we are seeing, what we're perceiving more generally, and what we've perceived in the past.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5334.159,
    "end": 5340.864,
    "text": " And you can just kind of unfold that loop and get a very nice correlation between action and perception through time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5341.224,
    "end": 5344.486,
    "text": "So the action perception loop is not like this monolithic circle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5344.806,
    "end": 5347.608,
    "text": "It's something that it's more like an spiral, so to speak.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5348.529,
    "end": 5350.47,
    "text": "And I think our model speaks to that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5350.49,
    "end": 5354.893,
    "text": "I don't know if Zach wants to add anything to this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5357.396,
    "end": 5379.238,
    "text": " it really would make uh worlds of difference to call it an action perception spiral if it's just going to be a visual metaphor and rely on our cultural understandings of shapes why not firstly hold up multiple and then secondly bring in um this kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5380.356,
    "end": 5387.902,
    "text": " perhaps even double helical or triple helical nature of unfolding, and three makes a party.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5388.723,
    "end": 5390.924,
    "text": "So it's awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5391.685,
    "end": 5397.209,
    "text": "Ali and Dean, first, any closing thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5397.73,
    "end": 5399.911,
    "text": "And then the authors with the final words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5401.112,
    "end": 5401.773,
    "text": "I'll be really quick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5401.813,
    "end": 5406.176,
    "text": "I really want to thank you both for sharing the paper and the great presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5408.558,
    "end": 5409.099,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5409.279,
    "end": 5409.479,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5410.816,
    "end": 5422.343,
    "text": " Yeah, as I said, it was a really fascinating paper for me personally, because I was really obsessed with process thinking, processual and all kinds of dynamic thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5422.424,
    "end": 5427.107,
    "text": "So again, I really wanted to thank you for writing such an amazing paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5427.127,
    "end": 5429.308,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5432.05,
    "end": 5432.37,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5432.75,
    "end": 5434.371,
    "text": "And so to the authors,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5436.778,
    "end": 5442.192,
    "text": " Any closing thoughts or where you'll be heading now or what you're excited, what you're pretending?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.027,
    "end": 5455.133,
    "text": " I guess, first of all, I would just like to thank you because this has been an amazing experience, an experience, an important experience, actually, just to discuss our paper with you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5455.233,
    "end": 5456.533,
    "text": "Thank you for reading the paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5456.593,
    "end": 5458.595,
    "text": "Thank you for enjoying the paper and having us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5458.755,
    "end": 5459.635,
    "text": "It's been lovely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5459.695,
    "end": 5467.22,
    "text": "And I think it's quite clear that the way to go now is to start talking about action and see how it fits.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5467.24,
    "end": 5473.904,
    "text": "And hopefully sooner rather than later, you'll see something about this because it's probably what we're discussing with Zach more recently.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5475.933,
    "end": 5477.974,
    "text": " Yeah, I also would like to extend this thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5479.074,
    "end": 5483.896,
    "text": "It's fantastic to just, I mean, the whole Active Inference Institute is just, in my opinion, the right thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5484.936,
    "end": 5486.337,
    "text": "It's really amazing to follow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5486.357,
    "end": 5490.378,
    "text": "So I'm very happy to be part of this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5491.099,
    "end": 5496.301,
    "text": "Beyond, well, besides the active aspect of hopefully the next paper,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5498.354,
    "end": 5526.592,
    "text": " i'm also looking into phases and looking at active inference as if it did not work with states because i think that's too spatial and it's making things static but actually moving that into phases into a continuous space um is something that i'm trying to establish now uh trying to start up a collaboration with ryan smith about that but it's still a really early work in progress so hopefully we'll see something from that project in a few months time hopefully but but thanks again thank you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5527.972,
    "end": 5528.313,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5528.973,
    "end": 5530.315,
    "text": "Thank you all for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5530.335,
    "end": 5534.04,
    "text": "Thanks everybody for listening and you're always welcome back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5534.16,
    "end": 5535.983,
    "text": "So till the next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5538.746,
    "end": 5538.947,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5538.987,
    "end": 5539.387,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5540.108,
    "end": 5540.449,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_07"
  }
]