[
  {
    "start": 2.174,
    "end": 3.557,
    "text": " All right, welcome everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4.699,
    "end": 11.091,
    "text": "It's November 14th and we're in cohort four, first discussion on chapter 10.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 12.754,
    "end": 21.651,
    "text": "So who wants to begin with some thought or question or any reflection about 10?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.579,
    "end": 31.582,
    "text": " anyone can raise their hand or just go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 31.622,
    "end": 41.398,
    "text": "But what they thought 10 was going to be or some component of what they remembered of it or just some quote that we could start with or a question that they already wrote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.288,
    "end": 47.589,
    "text": "Sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 47.889,
    "end": 55.722,
    "text": "I mean, just kind of at a cursory glance at this chapter, it's just they're basically",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 55.955,
    "end": 67.016,
    "text": " going through a variety of other fields that may or may not be related to active inference and kind of comparing and contrasting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 67.036,
    "end": 76.073,
    "text": "I think it helps to understand what kind of kind of trend or",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 76.458,
    "end": 85.551,
    "text": " body of knowledge in which active inferences has its roots or where it's starting to assert itself as a distinct field.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 87.854,
    "end": 103.275,
    "text": "It's interesting learning a little bit more about, for example, the Helmholtzian view of unconscious inference as being one of the key underpinnings of active inference here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 104.048,
    "end": 123.508,
    "text": " seeing more on the bayesian brain hypothesis and reinforcement learning and other fields that we see mentioned through the textbook but it's here that we get like a direct kind of comparison um and in addition to that i think one of the key overarching themes that they're trying to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 123.64,
    "end": 146.847,
    "text": " make is that active inference combines a variety of kind of traditionally separate or separated cognitive functions like perception, action, planning, attention, and so on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 146.827,
    "end": 154.135,
    "text": " the title of the chapter is active inferences and unified theory makes a lot of sense.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 160.241,
    "end": 160.581,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 161.222,
    "end": 161.702,
    "text": "Very nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.912,
    "end": 172.834,
    "text": "So I",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 177.252,
    "end": 202.247,
    "text": " There's something about the textbook overall that I found myself wondering about when I was reading chapter 10, which is that there are many places in the book where it's not really clear",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 203.746,
    "end": 212.051,
    "text": " If we're talking only about how the human brain functions versus how cognitive systems function.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 213.496,
    "end": 217.789,
    "text": "And so there are places where.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 220.807,
    "end": 234.352,
    "text": " Where it's almost it's almost it feels like a tease like let's let's explore this is not just about the human brain, this is about other cognitive systems, but I think for people who.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 235.654,
    "end": 243.709,
    "text": "The on initiated and of course i'm one of those people at the moment, but it's it's tough.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 244.178,
    "end": 258.307,
    "text": " Right, because I created certain expectations about looking for how does this generalize to all kinds of cognitive systems, but then in the last chapter, the focus is and the wording is used.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 259.329,
    "end": 265.562,
    "text": "For the rest of the chapter is almost like we're going to introduce these concepts, like you would for psychology textbook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 267.23,
    "end": 293.203,
    "text": " um and so they you know those various uh terms that are used in psychology are addressed and how do we think about them from an active influence point of view then this section on social and cultural mechanisms i think needs to be either deleted or completely rethought um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 294.82,
    "end": 315.529,
    "text": " so when i kept going back to the figure in chapter one i think it's figure 1.2 where it has a high road and a low road and in the center it has active inference and it has autopoiesis in each construction",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 316.319,
    "end": 322.847,
    "text": " Well, autopoiesis and age construction are brought up very infrequently throughout the textbook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 324.008,
    "end": 334.401,
    "text": "And I think there's an opportunity for chapter 10 to go back to autopoiesis and age construction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 335.722,
    "end": 341.449,
    "text": "And there are articles out there that I'm finding fascinating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 342.155,
    "end": 368.736,
    "text": " uh on the wording i'm still learning new words but what is this one called um joint agent i love this this article by ruinberg i don't know if this is the one that's um cited in in the book it might be uh but um joint agent environment systems",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 369.914,
    "end": 389.953,
    "text": " And I think that that's the place where really cool stuff can be laid out for people who want to take this framework into the social sciences and anthropology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 389.973,
    "end": 390.454,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 400.171,
    "end": 409.2,
    "text": " Any other thoughts on 10 or overall, whether it's someone's first time at 10 or repeating?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.672,
    "end": 429.52,
    "text": "Well, I have another thought and I'm curious as to how others",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 429.685,
    "end": 431.607,
    "text": " feel about this observation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 432.348,
    "end": 458.359,
    "text": "I don't know yet where I would suggest to include this somewhere in the book, but if most of the information that's presented in the book is backed up by data that's been gathered about the human brain,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 459.132,
    "end": 470.608,
    "text": " Then I think it would be interesting to point out that the human brain is actually a very new centralized nervous system in the history of living organisms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 471.55,
    "end": 485.95,
    "text": "And it's probably between 100,000 and 35,000 years old, meaning that the present day, the modern human brain organization",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 486.807,
    "end": 493.899,
    "text": " presumably reached that point around that time, 100,000 to 35,000 years ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 493.919,
    "end": 512.41,
    "text": "So what I think is super interesting is that the brain, the human brain, that such a recent development has unveiled so much interesting information about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 513.031,
    "end": 522.804,
    "text": " the ways in which we navigate the world and as sentient systems, whatever that means, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 522.905,
    "end": 528.712,
    "text": "And so that needs to be, I think, very clearly stated somewhere in the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 528.732,
    "end": 532.137,
    "text": "What do we mean by a sentient system?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 532.958,
    "end": 541.57,
    "text": "But anyway, I just thought I would bring that up and ask you others, like, what do you think of that observation?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 559.167,
    "end": 561.71,
    "text": " Anyone can go or I'll give a thought, Andrew, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 562.651,
    "end": 563.212,
    "text": "Sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 564.033,
    "end": 568.898,
    "text": "I just want to see if I understand the question properly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 568.938,
    "end": 586.879,
    "text": "But I mean, for me, I think, for example, looking at the human brain and neurobiology, looking at cortical micro circuitry, for example, finding a relationship between that and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 587.669,
    "end": 592.233,
    "text": " message passing, the kind of things we find in chapter five in the book.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 592.974,
    "end": 596.858,
    "text": "I mean, I think it's very interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 596.898,
    "end": 598.68,
    "text": "I think it's fruitful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 598.84,
    "end": 604.605,
    "text": "And I think that there have been empirical studies that are being done.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 605.146,
    "end": 614.655,
    "text": "And of course, one of the biggest tricks is to see how, given we're external observers,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 614.703,
    "end": 625.506,
    "text": " We have to kind of see how the data behaves and figure out what is a reasonable proxy in the data for what's actually going on in the brain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 627.329,
    "end": 629.033,
    "text": "So",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 629.873,
    "end": 652.708,
    "text": " I mean, I find a lot of validity in at least attempting to kind of make this connection between like the the brain, however new it is, and and maybe not just the brain itself in terms of its circuitry, but also like inferential processes, trying to understand",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 652.688,
    "end": 666.025,
    "text": " how those function in the brain or applying that as a kind of metaphor or analogy for looking at potentially entire societies, although that's an area of that's the kind of work in active inference that I'm less familiar with.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 666.226,
    "end": 668.369,
    "text": "So I don't want to over speak on that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 670.732,
    "end": 678.281,
    "text": "I don't know if that was like a like a one to one like relevant response to your question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 678.462,
    "end": 682.527,
    "text": "So I'm just happy to keep talking about it if I understand you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 684.481,
    "end": 705.308,
    "text": " Yeah, I guess, so I guess what I'm trying to appreciate, like I don't really have anything super compelling to say other than to note or make the observation as context for this book, I think, is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 705.659,
    "end": 715.451,
    "text": " the first centralized nervous systems showed up in the evolutionary record, I think about 570 million years ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 717.514,
    "end": 727.226,
    "text": "And the book is about sentient cognitive, sentient systems, presumably.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 728.007,
    "end": 732.392,
    "text": "And so I had to do some digging and think, well, are we talking about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 732.929,
    "end": 760.607,
    "text": " uh centralized nervous systems that evolved emerged 570 million years ago and then you know from that perspective then I would uh I marvel at the fact that you know humans have this incredible engine that evolved very recently and yet it has the capacity",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 761.009,
    "end": 770.761,
    "text": " to not just do everything that's in, you know, I'm completely sold in the whole active inference framework at this point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 770.921,
    "end": 778.731,
    "text": "You know, I just think it's just revealing so much that I can know information about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 778.771,
    "end": 788.603,
    "text": "But I find it super interesting that this brain can actually externalize our generative models",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 789.207,
    "end": 795.778,
    "text": " and that we can look at those generative models and that's why we can do science, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 796.639,
    "end": 812.886,
    "text": "And so it's not so much that I think it makes the work less valid because we are such a recent development in evolutionary history, but rather how these processes",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 813.862,
    "end": 827.435,
    "text": " phenomenally led to this brain that can do not only what, you know, being able to contemplate and think about our generative models, but to actually create generative models through artificial intelligence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 828.676,
    "end": 840.848,
    "text": "And that is something about this book that's an insight that can come out as one of a really important aspect of the book somewhere.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 841.182,
    "end": 844.125,
    "text": " So that's what I'm trying to convey.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 845.346,
    "end": 845.767,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 846.348,
    "end": 849.211,
    "text": "Yeah, these are great, great points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.593,
    "end": 855.377,
    "text": "Here's a figure we often return to in this Path Integrals paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 855.437,
    "end": 866.149,
    "text": "So it was like absent literature until it was drawn, showing the continuity of the basal cognition and the different types of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 867.31,
    "end": 869.012,
    "text": "And so, yeah, there's that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 869.532,
    "end": 881.096,
    "text": " historicity of the timeline of when did the enabling aspects that enabled this theory to be developed or any technical apparatus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 881.757,
    "end": 888.03,
    "text": "And then there's the fact that the subject matter or system of interest of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.01,
    "end": 916.482,
    "text": " this framework or any cognitive modeling framework is the mind slash brain etc um there's some fundamental aspects to that reflexivity there's a lot of it it brings everything you know it it opens up a lot which is why and and so i think this is a really important point that you're bringing up like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.272,
    "end": 939.853,
    "text": " do we approach the book is what it is 2022 textbook can never be changed they could release a different version we could generate a massive amount of educational material and develop an ecosystem around this open source textbook etc so so it's not about changing from how i see it what that book is but how it is approached and conveyed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.833,
    "end": 968.085,
    "text": " could run the gamut from an extension to a statistics course ranging to including deeper investigations like you brought up of the longer arc of sentience and just allowing that to open more and into slower different regimes of attention",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 973.651,
    "end": 984.106,
    "text": " In this framework, Daniel, where does context come into play in a formal way?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 989.114,
    "end": 990.095,
    "text": "What does anyone think?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 990.175,
    "end": 991.457,
    "text": "Where does context come into play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.87,
    "end": 1003.314,
    "text": " I'm sorry, I want to make sure I understand the question again.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1003.354,
    "end": 1012.268,
    "text": "This is context in the form of, do you mean as far as like active inference and behavior goes?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1013.39,
    "end": 1019.159,
    "text": "Or do you mean the field itself, like its context?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1025.189,
    "end": 1025.73,
    "text": "OK.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1028.562,
    "end": 1036.715,
    "text": " I mean, let's go back to the figure 1.2, where it's the high road and the low road.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1036.955,
    "end": 1049.895,
    "text": "Where in this world does context come into the science?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1051.613,
    "end": 1077.958,
    "text": " there's probably a ton of answers but one short narrow answer is self-organization or just broadly the partitioning or differentiation that allows us to say self versus non-self or just any kind of continuation that's the context that's the niche so the first particular partition that enables us from not being able to say anything about that thing that thing not existing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1078.394,
    "end": 1088.224,
    "text": " to it being a thing, it comes into description as contextualized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1088.244,
    "end": 1107.203,
    "text": "Another related point is this as if instrumentalist view, that it doesn't take on needing to provide an account of how whatever context is applies to the rat in the maze.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1110.018,
    "end": 1136.363,
    "text": " that's why it centers potentially that self-reflexivity of the observer because the model not to say it's boring not to say it's simple but it's just an artifact resulting from a different process yes uh so so i",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1137.625,
    "end": 1143.574,
    "text": " Okay, but when you know when you're talking about something like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1147.741,
    "end": 1149.283,
    "text": "What do I want to ask this question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1155.693,
    "end": 1157.275,
    "text": "So you use the word artifact.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1158.918,
    "end": 1165.388,
    "text": "i'm just going to stick for now with the idea that that artifact in figure 1.2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1166.633,
    "end": 1173.642,
    "text": " is applicable across all sorts of contexts, across all kinds of agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1174.543,
    "end": 1187.058,
    "text": "And I think what I would like to know is where is the, I know I shouldn't use that word, but where's the boundary?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1187.799,
    "end": 1190.122,
    "text": "I was gonna say mark of blanket, I'm not gonna use it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1190.142,
    "end": 1193.907,
    "text": "But where's the boundary, in other words,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1196.131,
    "end": 1201.219,
    "text": " In what systems does this artifact not, is it not applicable?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1206.446,
    "end": 1212.475,
    "text": "Yeah, very common question about the applicability or the scope of this type of modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1213.757,
    "end": 1217.142,
    "text": "And so if it's left us as an open question, that's okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1217.683,
    "end": 1221.549,
    "text": "And I won't, you know, push any further, but it's really been.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1223.271,
    "end": 1224.433,
    "text": "Does anyone want to give a thought?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.92,
    "end": 1232.952,
    "text": " Yeah, I can give a thought, and I'm in cohort five, so I'm just, I guess, piggybacking off this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1234.314,
    "end": 1253.644,
    "text": "But I think that one of the active inferences, a model of understanding really any natural system that you want to look at that behaves under the certain dynamics,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1256.24,
    "end": 1283.142,
    "text": " it could be applied to just about anything so the context is really going to be up to the person using it so you could have any context and you know try to draw the boundaries anywhere and how you draw those boundaries is going to determine what the organism or particle that you're looking at is and what the environment is so i think that's one of the cool things about active inference is it's so broadly applicable",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1283.881,
    "end": 1289.629,
    "text": " and where you draw those boundaries makes all the difference in how the models turn out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1293.555,
    "end": 1293.915,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1295.417,
    "end": 1297.56,
    "text": "That was really helpful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1297.58,
    "end": 1302.007,
    "text": "One note on this is Figure 1.2 is not a formal argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1302.487,
    "end": 1303.649,
    "text": "It's more evocative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.29,
    "end": 1310.879,
    "text": "So these different terms might apply in different ways to different systems, like planning as inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1310.939,
    "end": 1312.842,
    "text": "Not all systems plan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1312.973,
    "end": 1317.984,
    "text": " And then even again, pulling back to the instrumentalist layer, you don't have to model the system as planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1318.566,
    "end": 1324.64,
    "text": "But maybe you do model even an inanimate system as doing some kind of extended planning or vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1325.221,
    "end": 1327.206,
    "text": "So they're not requisite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.486,
    "end": 1332.197,
    "text": "They're just some train stops on the low road and the high road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1332.177,
    "end": 1357.56,
    "text": " i think that is a layer that that does kind of make sense to pull back to not that this is exhaustive or um a panacea but it's just a framing that helps organize the the book and the work and also situates active inference at the intersection between actually building something from the ground like what dennett might call the cranes approach",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1357.54,
    "end": 1386.315,
    "text": " and the tethering or the association to the high road principle, the sky hook in that same kind of Dennett metaphor so that there's something that it can be realized with real software tools and real relationships between the math and the theory and the implementations finding new useful through and throughs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1387.848,
    "end": 1414.986,
    "text": " and therefore having nothing to say about any given thing by virtue of being applicable to any modeling situation brahman uh yes daniel i was just um the figure one point two i i view it as you as you said sort of a you're not not a fixed thing you're not really a a pathway thing but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1415.489,
    "end": 1428.148,
    "text": " But in ways, a lot of those things were historical developments in the way people, scientists and philosophers, were considering the progression of understanding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1428.466,
    "end": 1456.887,
    "text": " of the sentient being or the we use human being in its environmental niche so that sort of constant question of how is it that we persist how is it we survive what is it we do how do we adapt and i keep going back and i was talking to you before about 10.3 and daniel dennett's comment in 1978 about a necessity to to really model the whole iguana which is really about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1457.052,
    "end": 1460.316,
    "text": " How do we understand the human being as a whole?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1460.336,
    "end": 1480.444,
    "text": "And so there's a lot of, I mean, and also there's a distinction, I think, between this conversation on modelling something and a conversation on understanding the adaptive dynamic nature of an evolving creature in its environmental niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1481.217,
    "end": 1492.693,
    "text": " So in a way I sort of separate out those things as a modeling sort of the acting on the consideration of how it is that we continue to survive or not survive, whatever it might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1494.315,
    "end": 1511.038,
    "text": "So, I mean, one thing I think that I've learned in my travels through active inference is its connection historically to a lot of thought from a lot of people and a lot of consideration of, of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1511.407,
    "end": 1512.668,
    "text": " what we do, how we do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1513.77,
    "end": 1526.785,
    "text": "And that's including our sort of evolving ability to be cognizant of ourselves and understand how we are actually making decisions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1527.365,
    "end": 1538.258,
    "text": "So it's that stepping back out of our precisions actually enabling us to fine tune our own",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.643,
    "end": 1548.132,
    "text": " Bayesian mechanics so that we can actually see ourselves clearer in our environments so that we can then function to survive and make better choices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1548.733,
    "end": 1551.596,
    "text": "And then we can begin to sort of model that, I suppose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1551.676,
    "end": 1567.772,
    "text": "But I always have a question, I'm rambling on a bit, but I always have a question about someone creating a model when they actually have a biased view of, which is the nature of it, a biased view of what they're doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1568.343,
    "end": 1596.679,
    "text": " So I think the distinction needs to be made between what the free energy principle states, which is we must reduce or minimise free energy, and the actual process theory of active inference in which we bring that into",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.891,
    "end": 1619.511,
    "text": " pragmatic play in our lives as a whole being in our niche and then wrapped in that is then I think we can then subsume all of those other questions that arise whatever I just said wow but no but anyway back to 1.2 is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1619.896,
    "end": 1636.637,
    "text": " I mean, if you go into each of those different areas, autopoiesis, predictive coding, blah, blah, blah, you know, they've all got a sort of a progressive historical evolutionary type footing on which I think active inference rests.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1637.499,
    "end": 1643.987,
    "text": "And I even found another person in America that I was going to speak to about, old Brecht Ames.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1644.067,
    "end": 1646.41,
    "text": "I don't know if you've ever heard of him.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1647.503,
    "end": 1658.68,
    "text": " Yeah, there's like a, you know, it's as if as a, as a whole being where we're evolving, we're evolving to be able to recognize ourselves and what we do in our niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1661.103,
    "end": 1661.784,
    "text": "I'll stop there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1663.487,
    "end": 1674.484,
    "text": "Yeah, that's a very interesting point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1674.504,
    "end": 1675.485,
    "text": "Evidenced by the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1677.676,
    "end": 1698.908,
    "text": " perspectives people bring the skills that are required the kind of collaborations that would entail skillful usage a lot of different aspects to it yeah yeah and that's sort of like one of the follow-ups after the well the scope question is it applicable to any given system and it's like well the question presupposes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.204,
    "end": 1711.092,
    "text": " If it's a system that's that someone's thinking of then yeah that's the system just go ahead and describe it so people try to hold that out like as if it's going to rug pull the talk or it could apply to everything it's like yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.54,
    "end": 1715.763,
    "text": " And then from there, the natural question is like, well, then what does it do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1715.823,
    "end": 1725.732,
    "text": "And the whole iguana, it's funny because people make what they believe are justified true belief assertions about human behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1725.832,
    "end": 1727.153,
    "text": "And this molecule does this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.734,
    "end": 1729.996,
    "text": "And it's like, not to say that smaller brains are simpler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1730.056,
    "end": 1732.959,
    "text": "Of course, I'm always bringing up the insect brains here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.999,
    "end": 1739.965,
    "text": "But think about how many experiments go into determining the role of like a neurotransmitter at a certain synapse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.945,
    "end": 1744.233,
    "text": " And so it's like way less evidence in humans, obviously important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1744.313,
    "end": 1744.995,
    "text": "Everyone cares.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.676,
    "end": 1750.926,
    "text": "But then to overstate the precision, we're not even at the whole iguana.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1750.946,
    "end": 1753.331,
    "text": "This is the whole chapter seven teammates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.132,
    "end": 1756.938,
    "text": "It's like that's that is the whole in what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1757.118,
    "end": 1758.38,
    "text": "It's a pedagogical example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1758.46,
    "end": 1762.408,
    "text": "And then by iterating with a real animal in the maze.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1762.388,
    "end": 1783.35,
    "text": " then there's more and more and and also becomes clearer and clearer how the map's not the territory from the first draft to to the one millionth draft maps not the territory under whatever constraints the map and the territory co-evolve under so it's are the the questions that that help make chapter 10",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1783.702,
    "end": 1792.513,
    "text": " actually about connecting the dots and about anything more than just a literature review on psychological and philosophical topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1798.041,
    "end": 1805.45,
    "text": "And actually, so when you brought up the word bias, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1806.031,
    "end": 1809.135,
    "text": "Now, would it be a correct interpretation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1810.887,
    "end": 1832.136,
    "text": " of generative models to say that I think active influence, one of the implications that seems to make sense to me is that we are constantly in the process of creating biases",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1833.635,
    "end": 1863.388,
    "text": " uh because by creating biases we um you could say that a bias is just a model in our heads of the world and in science we're constantly coming up with these models and but then we get a chance to discuss them and put them at risk um but that but that's just kind of an example of how powerful i think the power of this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1863.622,
    "end": 1873.812,
    "text": " perspective that it actually allows me to think about something like bias that we talked about all the time and not just, well, it's just bias.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1873.832,
    "end": 1874.793,
    "text": "Well, what is bias?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1877.275,
    "end": 1880.878,
    "text": "I'd like to read a little section from a short piece that I wrote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.879,
    "end": 1892.329,
    "text": "So basically, um, active inference learners often look at representations such as figure 4.3 from the 2022 textbook or figure 1.2 or figure any of the textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1893.895,
    "end": 1899.926,
    "text": " seemingly expecting to find sophisticated phenomena such as affect or narrative reflexivity in or on that representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1900.146,
    "end": 1902.47,
    "text": "Two key aspects of my response in that situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1902.511,
    "end": 1912.208,
    "text": "First, if active inference were to include even relatively simple cognitive phenomena, learning or attention in its essential particular formulation, particular partition,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1912.188,
    "end": 1918.835,
    "text": " This would explicitly restrict the scope of analysis to systems of that character and silently diminish our capacity to distinguish across that difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1919.495,
    "end": 1936.913,
    "text": "Second, natural language or conceptual descriptors of cognitive phenomena are secondary attributions better understood as relational rhetorical assertions using a pattern language of phenomena about a given realized generative model rather than fundamental or intrinsic aspects of the system of interest itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.922,
    "end": 1961.601,
    "text": " not to be verbatim but I think it's a really important point like bias has a narrow technical definition you'll see in a statistics textbook it's what biases the data and does anything different than a pass-through it's just a feature of how discriminatory a signaling algorithm is and then of course there's broader senses and and alignments with with with broader um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1961.851,
    "end": 1974.17,
    "text": " Alex Blanche- usage of those terms, just like with so many of the terms in the active ontology and I think it's relevant that, especially when talking about the broader systems of interest or the phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.191,
    "end": 1982.222,
    "text": "Alex Blanche- That they're they're not the basal low road they're not the assertion they're not what actually implements the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.805,
    "end": 1990.575,
    "text": "Alex Blanche- Their descriptors of systems with observers, which is the setting where more can be done and and it's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.209,
    "end": 1999.656,
    "text": " a better discussion setting when it's assertion-based.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2002.198,
    "end": 2013.308,
    "text": "Not to go too hard on this one point, but I think that that puts the space of us as generative model interpreters in between us and any created artifact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2017.132,
    "end": 2019.634,
    "text": "Without that articulation, we're",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2019.833,
    "end": 2026.381,
    "text": " just not set up to have a productive epistemic conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.087,
    "end": 2032.608,
    "text": "Thought on that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2033.088,
    "end": 2043.501,
    "text": "And I like that quote that you showed Daniel about the comment of the vagueness and difficulty with philosophical questions is intentional so that it's a generalizable model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2044.001,
    "end": 2045.223,
    "text": "We don't want to be pigeonholing it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2047.165,
    "end": 2049.047,
    "text": "But I think bias and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2051.035,
    "end": 2056.161,
    "text": " this is my perspective on it is a part of the learning process.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2056.221,
    "end": 2064.151,
    "text": "And if you're learning anything that you hope to be generalizable, then when it's accurate, it was useful information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2064.351,
    "end": 2067.595,
    "text": "And when it's in a situation where it's not accurate, then we call it bias.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2068.436,
    "end": 2077.988,
    "text": "And anytime you're trying to generalize something, you are creating a bias that you hope is going to be helpful and useful at some future point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2078.288,
    "end": 2106.253,
    "text": " but as soon as it gets out of that context where it's helpful and useful we just call it bias it's skewing your understanding in a certain way yeah that's very important like if someone says that was a biased decision i think like how could they violate this or that but if it was like no they picked up on subtle cues it was a biased decision be like wow great for them in that situation so what what is really the discussion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2107.634,
    "end": 2137.219,
    "text": " not even to that topic but just this is that's stepping back from even our words and our symbols how does that really play out we're learners on that all with each other in the textbook group there is a technical part to act in but I think conversations like this chapters like this they show it's not simply that way the whole low road could be ripped out and replaced potentially",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2140.49,
    "end": 2168.843,
    "text": " even in the the message passing live stream right now with Magnus kudal um like generalized free energy generalizes variational free energy and expected free energy so those are some of the main topics we talk about like equation 2.5 and 2.6 in this textbook but if those formalisms last for several years to to decade then they'll have been long-lived even by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2170.915,
    "end": 2198.914,
    "text": " things not accelerating standards so there's just a lot of interesting pieces like as the textbook recedes then do we continue to drive back to the 2022 textbook do people want spaces of more open straightforward",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2203.552,
    "end": 2204.013,
    "text": " I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2206.256,
    "end": 2208.64,
    "text": "Something in between all of the above, of course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2215.952,
    "end": 2220.58,
    "text": "Personally, I need more time to to think about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2222.403,
    "end": 2230.656,
    "text": "I'm still there's so much in the book that I still want processing and learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2233.336,
    "end": 2237.18,
    "text": " That's kind of the funny joke at the end of the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2241.003,
    "end": 2249.031,
    "text": "Making the extra curricular claim that active inference is not something that can be learned purely in theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.118,
    "end": 2262.364,
    "text": "That's why it's such a great, I love that about it because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2263.222,
    "end": 2277.903,
    "text": " Honestly, as I read, I have to pause and then step away and think about how does this apply to this system, that system, other stuff I'm thinking about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2277.923,
    "end": 2280.186,
    "text": "And then I come back.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2283.691,
    "end": 2286.495,
    "text": "But I'll just share with you guys",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2287.285,
    "end": 2292.251,
    "text": " that so I've been studying Buddhist psychology for decades.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2293.552,
    "end": 2315.016,
    "text": "And what one of the things that it's really mind blowing to me is how the very high level Buddhist psychology scriptures are so much have very much to do with active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2315.717,
    "end": 2316.398,
    "text": "Yeah, so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2318.774,
    "end": 2332.751,
    "text": " So yeah, I mean, I guess I'm just thinking about applications and then going back to the ideas, digging deep and trying to master very complex concepts and then stepping away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2336.096,
    "end": 2336.416,
    "text": "Ronwen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2342.303,
    "end": 2344.746,
    "text": "Can I just ask a question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2345.607,
    "end": 2348.511,
    "text": "Did you just say with the Buddhist psychology that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2349.284,
    "end": 2355.816,
    "text": " that active inference was congruent seems to make sense of a lot of the philosophy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2355.936,
    "end": 2357.158,
    "text": "Was that what I heard?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2358.641,
    "end": 2361.647,
    "text": "Well, I'll give you a specific example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2362.588,
    "end": 2368.339,
    "text": "So for example, so in the so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2369.062,
    "end": 2372.286,
    "text": " Buddhist psychology is also very applied.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2372.726,
    "end": 2375.029,
    "text": "It's very abstract and very applied.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2375.67,
    "end": 2378.633,
    "text": "And so one of the applications is meditation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2378.914,
    "end": 2379.975,
    "text": "So what is meditation?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2379.995,
    "end": 2382.798,
    "text": "What do you do with your mind when you're meditating?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2384.06,
    "end": 2390.968,
    "text": "And essentially what you're doing is putting at risk all of your generative models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2392.602,
    "end": 2401.393,
    "text": " that the way that you find the idea behind that, you know, it's called investigating your mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2402.674,
    "end": 2411.465,
    "text": "It's not, you know, if you have a horrible thought about killing somebody, you know, it's not that you just say, oh, no, stop that thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2412.326,
    "end": 2415.69,
    "text": "It's examining why do I have that thought?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2416.075,
    "end": 2437.721,
    "text": " And then you ask yourself that, but to me, when I was reading about active inferences about, yeah, we created this generative models, like since I'm an anthropologist and I worked on these different cultures, I mean, I've lived in cultures where people will say, we men can kill women and not be punished.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2439.163,
    "end": 2439.483,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2440.344,
    "end": 2442.927,
    "text": "Well, that's a model that these,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2443.295,
    "end": 2445.679,
    "text": " people carry in their minds, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2445.779,
    "end": 2458.558,
    "text": "And so in Buddhist psychology, it's what is the default kind of tape player that's going on in your mind that's driving everything that you do that you never think about?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2459.981,
    "end": 2460.942,
    "text": "And that's what it is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2462.324,
    "end": 2463.166,
    "text": "It's very simple.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2463.206,
    "end": 2468.053,
    "text": "And it's very consistent with active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2469.097,
    "end": 2481.857,
    "text": " glad you think so yeah there's like several articles and lines of research with like attention meditation Buddhist psychology different knowledge traditions so that's definitely very interesting Bowen",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2482.867,
    "end": 2492.001,
    "text": " Yeah, well, because the reason I ask is that I am an Alexander Technique teacher, which most people wouldn't know what that was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2492.121,
    "end": 2505.06,
    "text": "But Alexander Technique has a history, but it goes back in time to, say, 100 years ago with John Dewey, who was an educationalist philosopher in America.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.243,
    "end": 2526.947,
    "text": " And I think it was stated once on this book club that, you know, Dewey's language now is quite relevant, and particularly if you read it from an active inference perspective, and that's what I have been doing, and as well with the Alexander Technique, and it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2527.855,
    "end": 2540.571,
    "text": " doing that, having that view or that, so it's maybe it's a preference that, that seeing things seem to have much more meaning and, uh, uh, much clearer to, to be able to understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2541.553,
    "end": 2542.854,
    "text": "Um, that was just one point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2542.954,
    "end": 2554.369,
    "text": "The other thing with about biases was I was just wondering is, um, is that that sort of discussion about bias within, within the, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2554.737,
    "end": 2556.28,
    "text": " the basic mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2557.422,
    "end": 2561.731,
    "text": "We have preferences and preferences are what keep you where you are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2561.751,
    "end": 2568.584,
    "text": "And for me, preferences are biases within the precision mechanics pretty much in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2568.684,
    "end": 2576.239,
    "text": "And because it's an unconscious inference is pretty much unconscious unless we do something like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.219,
    "end": 2603.796,
    "text": " meditate uh or pay attention uh investigate then it remains unconscious but but we probably have the ability to cognitively um delve a certain degree there's a certain penetrability to be able to that's what jack of how he talks about uh penetrability to be able to actually investigate a little further into our unconscious inferences um to be able to begin to understand",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2604.704,
    "end": 2633.614,
    "text": " why we why we think something but then a step on from there is that a generative model is made up of an action perception cycle and i don't it's just a comment i could be could be my preference that a lot of discussion tends to um in in book club tends to and even within the broader literature uh remain in a sort of a passive state um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2634.522,
    "end": 2644.351,
    "text": " in a perceptive state without the recognition that there's an inseparability of action and perception, which I think is what's at the basis of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2644.371,
    "end": 2654.22,
    "text": "We cannot separate the two so that with anything we think or do, it is a perception and an action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2655.181,
    "end": 2664.529,
    "text": "And I think it's much more expansive than people's conceptualizations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2664.762,
    "end": 2668.349,
    "text": " of how we actually function in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.691,
    "end": 2677.365,
    "text": "A lot of our actions are unconscious when their habits are habitual, when really not present to what we're doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2677.806,
    "end": 2687.884,
    "text": "Meditation and mindfulness meditation, Buddhist meditation is one method of beginning to investigate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2689.771,
    "end": 2703.412,
    "text": " that action perception loop that enables us to function at every minute of the day, really, as well as what I consider the Alexander technique.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2704.233,
    "end": 2716.993,
    "text": "The Alexander technique in its true form brings action and perception and thinking together so that it's based on the psychophysical re-education process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2716.973,
    "end": 2743.909,
    "text": " but i i just wanted to put forward i suppose that that the whole body the whole body seems to get broken up a bit in these discussions and and the action perception cycle cycle is that it's an entwined uh inseparable functioning and i think the ability for for us to really cognate that to really sort of understand that is what what uh active inference uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2744.581,
    "end": 2748.713,
    "text": " hopefully will, and I think is coming, bringing to light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2749.255,
    "end": 2750.84,
    "text": "It's the thing that draws people to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2753.387,
    "end": 2755.293,
    "text": "But preferences, not biases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2755.313,
    "end": 2755.654,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2757.22,
    "end": 2778.655,
    "text": " one interesting point there to seal that point is internal and external is just pick aside but sense and action are identically considered by the across any boundaries like and also i find it interesting that the mu for internal state it is almost like if you rotate this like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2779.124,
    "end": 2804.625,
    "text": " clockwise or counterclockwise 180 degrees that it's like it looks like the symbol on the other side to just show that there's kind of like a mirroring but but not an equivalence but that's the interface that that enables there to be that Andrew sure I just wanted to speak on the uh I'm a practicing uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2805.162,
    "end": 2807.645,
    "text": " Buddhist and meditate regularly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2807.665,
    "end": 2815.355,
    "text": "And I've had a lot of thoughts about this, although I haven't become too strongly, haven't gone too deep into the literature on an active inference and meditation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2815.395,
    "end": 2830.174,
    "text": "But I very much agree with this idea of meditation as a kind of practicing one's attention, paying attention to one's thoughts, whatever is going on internally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2830.289,
    "end": 2858.878,
    "text": " lot of forms of meditation involve reading the body and so practicing interoception and um and with that there's a kind of i don't know uh almost like a an attempt at overcoming something like habit like i'm getting back into the models like you have your e uh x versus g and i think by practicing by being able to have that sort of meta awareness i suppose around",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2858.96,
    "end": 2883.297,
    "text": " what your thoughts are what your desires are in in buddhist terms or your preferences as far as the c matrix goes and trying to figure out like what what are those about what am i going for do you have certain things that you want that you know you shouldn't want and like trying to overcome those um yeah i think a lot of it involves like practicing one's attention that is i guess",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2883.479,
    "end": 2910.043,
    "text": " precision optimization like trying to certain yes and certain signals that you're receiving and instead switching your attention to to others that might actually help you realize your your new preferences as opposed to maybe whatever led you to the negative habit before something and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2911.88,
    "end": 2917.986,
    "text": " But with Buddhism, you have this notion of like a desire being kind of endless, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2918.967,
    "end": 2923.952,
    "text": "And so like it can, you know, kind of take you over if in the extreme.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2924.012,
    "end": 2936.544,
    "text": "And I'm not sure where that lies as far as, you know, trying to use POMDP to model that as a process or something goes, you know, but it's all very interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2936.584,
    "end": 2939.187,
    "text": "So I kind of just want to chime in on that bit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2941.985,
    "end": 2956.399,
    "text": " yeah yeah like just to connect the the references a little bit in the textbook here is that kind of figure you alluded to 5-4 with the seesaw or the continuum between the total pass-through of habit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2956.514,
    "end": 2978.421,
    "text": " defined however and then the total sharpening to an arbitrary function which function that's life modeling but this arbitrarily defined one such that any sharpening we can fit within this framework it doesn't even have to be one that is created by the modeler that's why it's a descriptive view from the outside",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2979.97,
    "end": 2984.823,
    "text": " And then here in the Sanford Smith, 21 paper, last from 28.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2985.003,
    "end": 2996.494,
    "text": "This kind of demonstrated the plausibility in the scheme for nested awarenesses, because just having attention or a bias filter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.812,
    "end": 3014.23,
    "text": " of one depth is just like sharpens out let's just say edges from a static image so successive layers of bias signal to noise could pull out edges or or hallucinate them um but here it kind of pointed towards the ability that there could be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.442,
    "end": 3016.043,
    "text": " Alan Fekete, Ph.D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3016.023,
    "end": 3026.958,
    "text": ": Awareness of awareness and and this sort of more nuanced view on phenomenology which could be understood just could be whimsical could be different culture, it could be different individuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.14,
    "end": 3028.52,
    "text": "Alan Fekete, Ph.D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.5,
    "end": 3034.108,
    "text": ": Just to show that it could be created in terms of this broader topic of regimes of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3035.86,
    "end": 3041.392,
    "text": " attention as internal action, internal action as covert action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3041.893,
    "end": 3054.259,
    "text": "So using the same apparatus that's used for the overt action and like the planning where to walk, turning that to apply to potentially sequences of attentions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.421,
    "end": 3055.742,
    "text": "Ajith?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3059.941,
    "end": 3080.397,
    "text": " uh yeah so um I had a different question not related to sort of meditation so it's a little different but I'll go for it okay okay uh I was just wondering like how exactly is sort of uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3081.288,
    "end": 3102.428,
    "text": " I guess, like free will and measurement independence sort of how's that related to like the free energy principle and active inference like are like do behaviors follow like certain attractor states at certain times and does that mean that, like when you're taking a measurement of something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.468,
    "end": 3109.455,
    "text": "The choice between that measurement is actually like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.954,
    "end": 3133.992,
    "text": " the choice between that measurement is statistically dependent uh with sort of um like you kind of like uh if you're going to pick you know between a and b was that choice sort of determined if sort of you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.039,
    "end": 3142.318,
    "text": " our decisions themselves follow sort of this principle of least action with like the free energy principle and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.338,
    "end": 3149.955,
    "text": "So yeah, it's just like how is free will sort of formalized in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.205,
    "end": 3153.471,
    "text": " Big question, just so that a few other people can ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3153.491,
    "end": 3154.773,
    "text": "Here's the shortest answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3155.053,
    "end": 3156.496,
    "text": "Look it up in this coda.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3156.516,
    "end": 3158.099,
    "text": "There's been a little bit of discussion on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3158.639,
    "end": 3160.963,
    "text": "People have come down hard on one side or the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.024,
    "end": 3165.391,
    "text": "People have put their professional careers on the line one side or the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3165.451,
    "end": 3167.314,
    "text": "Science shows this, science shows that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3168.316,
    "end": 3171.201,
    "text": "That's why I see that debate largely at this point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3171.788,
    "end": 3198.235,
    "text": " so active inference doesn't actually like tell us it doesn't lean towards one side as of yet or it doesn't have a system that it's based upon other than historically but it doesn't have a system indicated so it's it's expressionless about topics like the relevance of a given thing in a given situation for a given thing it's multiple layers of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3198.62,
    "end": 3207.171,
    "text": " David Price- Productivity by the modeler and the contextualize or before that's even a complete sentence, so I think it's just.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3209.334,
    "end": 3217.925,
    "text": "David Price- cart and horse or something like that, but but understandable and topically associated and historically associated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3220.048,
    "end": 3220.408,
    "text": "David Price- um.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.266,
    "end": 3241.131,
    "text": " but we should continue to talk read the coda and write or add more and obviously it's an ongoing discussion so I'm not saying it's permanently one way or the other I'm just saying that you will find Discord messages and coda and transcripts of people vehemently believing both things within the last two months okay okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3241.28,
    "end": 3242.862,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3243.422,
    "end": 3248.447,
    "text": "Everyone who wants to, how about just a closing round of thoughts on this first discussion on 10?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.467,
    "end": 3251.83,
    "text": "So Bronwyn, then Magdalena, then anyone else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3254.453,
    "end": 3267.806,
    "text": "Just very quickly, in terms of active inference going forward, you discussed it a little bit before in terms of what sort of is the book in 2022, what happens in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3267.826,
    "end": 3270.949,
    "text": "I just wonder, it seems to me that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3271.587,
    "end": 3289.292,
    "text": " from very different areas in life people get their teeth but they they hear about active inference and they get their teeth into it and it's really hard to let it go like it's like a dog with a bone and um and i can't see how it it can do anything other than then evolve and become",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3290.015,
    "end": 3300.468,
    "text": " not denser, but sparser in a way, a much more simple theory to be able to understand sentient behaviour.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3300.488,
    "end": 3306.855,
    "text": "I just wonder what people think about that and what their view on the future of active inference is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3306.875,
    "end": 3313.483,
    "text": "I mean, for me, it's something I haven't been able to let go of, and it just raises more questions day after day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3314.465,
    "end": 3316.427,
    "text": "So, yeah, I'll just leave it there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3320.542,
    "end": 3323.869,
    "text": " Yeah, everyone can give a closing thought on that or whatever they want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3326.776,
    "end": 3335.435,
    "text": "Yeah, my closing thought is that I first want to learn active inference really well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3335.695,
    "end": 3337.96,
    "text": "I want to understand it fully.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3338.26,
    "end": 3349.773,
    "text": " I think it has a lot of promise, and every day I do a little bit of translation into the scientific questions that I'm working on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3352.496,
    "end": 3354.598,
    "text": "But I feel the same way you do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3355.179,
    "end": 3360.204,
    "text": "I just feel like this is just the beginning of a very long journey.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3361.266,
    "end": 3363.468,
    "text": "It's going to take a lot of work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3364.029,
    "end": 3365.23,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3372.55,
    "end": 3375.272,
    "text": " Any other closing thoughts on 10?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3375.292,
    "end": 3389.485,
    "text": "I think active inference is rather huge in the context of Chapter 10 presenting the theory as a broad unified theory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3389.525,
    "end": 3395.871,
    "text": "I think it's going to go in many directions for whoever wants to start modeling in that direction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3396.091,
    "end": 3400.195,
    "text": "I myself discovered active inference",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3400.495,
    "end": 3404.18,
    "text": " just a kind of hobbyist interest in psychoanalysis.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3404.58,
    "end": 3425.187,
    "text": "And then I found the work of Mark Solms in neuropsychoanalysis, and one thing led to another, and here I am wanting to read Carl Friston's work instead almost, and seeing how this is being applied and feels as diverse as psychiatry to robotics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3425.167,
    "end": 3454.431,
    "text": " yeah i think it really i'm more interested in seeing what kind of empirical work what kind of direct applications um people carry out with this theory and i think that'll probably end up shaping the field even more it's closing but yeah awesome esmail do you want to add anything",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3456.976,
    "end": 3457.957,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.059,
    "end": 3464.644,
    "text": "Today we speak about Daniel Dennett and Buddhism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.825,
    "end": 3470.831,
    "text": "I think one thing is common between Daniel Dennett and Buddhism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.492,
    "end": 3473.374,
    "text": "Both of them deny self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.737,
    "end": 3481.022,
    "text": "In the meditation, almost you will lost the self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.843,
    "end": 3486.949,
    "text": "And Daniel Dennett introduce self is like a school",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.402,
    "end": 3495.955,
    "text": " For example, after 20 years in the school, everything will be changed, like teacher, students, bench, everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.716,
    "end": 3502.225,
    "text": "And just they have same name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.186,
    "end": 3509.716,
    "text": "And this general model is, I think, exactly whole iguana.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.437,
    "end": 3516.126,
    "text": "This don't look, don't suppose self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.135,
    "end": 3535.096,
    "text": " This active inference make general model for artificial intelligence and people bearing and everything generated, not with some abstract idea, I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.782,
    "end": 3540.282,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.723,
    "end": 3545.809,
    "text": "I think that's a super important point about how it's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3545.89,
    "end": 3546.971,
    "text": " purely synthetic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3549.935,
    "end": 3552.738,
    "text": "And that is being explored more recently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3552.778,
    "end": 3560.967,
    "text": "So, however satisfied and excited we were previously, it continues to develop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3562.729,
    "end": 3568.676,
    "text": "And as with all of our discussions, this one probably opens up more questions than not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3569.577,
    "end": 3571.8,
    "text": "But these were all really great points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3571.96,
    "end": 3573.822,
    "text": "Chapter 10's kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3574.46,
    "end": 3601.817,
    "text": " epic but it's also like symbolic and it is where we jump out you know we're going to close this meeting and close that book and then you do something next so that's really where it like breaks the fourth wall breaks the fifth wall all these like interesting dynamics of our engagement with it and all the fun things we get to do in textbook group",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3602.962,
    "end": 3610.238,
    "text": " yeah though we'll have another discussion next week earlier than this time in two weeks",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3612.631,
    "end": 3635.803,
    "text": " we will talk about projects or future textbook groups right now already this form yeah is accurate so you can fill out the form you can give any other information but other than that we're just kind of chilling cruising down the end of the year last few scheduled live streams have a quiet December then come back in 24",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3638.247,
    "end": 3644.245,
    "text": " Anyone's welcome to be a facilitator for textbook group, or we can explore like other things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3646.392,
    "end": 3647.736,
    "text": "So thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.1,
    "end": 3649.662,
    "text": "See you next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3651.367,
    "end": 3652.29,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_03"
  }
]