[
  {
    "start": 1.718,
    "end": 3.718,
    "text": " Hello, it's March 22nd, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4.439,
    "end": 12.94,
    "text": "We're in cohort two in our second discussion of chapter nine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.661,
    "end": 24.663,
    "text": "We're going to jump right in to anything that people are thinking about related to chapter nine or just in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.923,
    "end": 27.203,
    "text": "So whomever would like to bring something up, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.604,
    "end": 30.804,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 32.789,
    "end": 52.017,
    "text": " So I have a question that you said last time, I don't know whether it was in what context it exactly was, that you would say we talked about or you talked about affordances and you said that policies are not affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 53.118,
    "end": 63.148,
    "text": " And then I was wondering what then affordances are, because I understood policies are not affordances because they are in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 64.85,
    "end": 70.135,
    "text": "But then I was thinking what that should mean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 71.728,
    "end": 80.376,
    "text": " Because the present is a point in time infinitely small, which would imply that affordances doesn't exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 82.058,
    "end": 83.84,
    "text": "Or how would you see this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 85.141,
    "end": 95.27,
    "text": "So if one thinks that an affordance is if we are in one state, and the policy is a sequence of states in the future,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 96.451,
    "end": 109.678,
    "text": " But then even if we have this embedded state, I can be in the state of learning, for instance, active inference, which also implies some actions in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 109.718,
    "end": 115.962,
    "text": "So I was a little bit confused about this notion and why you would think that policies are not affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 116.782,
    "end": 117.783,
    "text": "Maybe I misunderstood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 119.563,
    "end": 119.884,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.544,
    "end": 122.345,
    "text": "Olli, want to give a first thought?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.365,
    "end": 124.126,
    "text": "And then I'll be happy to add some.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.943,
    "end": 146.456,
    "text": " Well, yeah, actually, well, in fact, in active inference literature, there are some divergence between the way terms used in this context as compared to their other connotations or other meanings in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.14,
    "end": 150.844,
    "text": " some other contexts such as reinforcement learning and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 150.904,
    "end": 160.634,
    "text": "So basically, in active inference by policy, they generally mean a sequence of actions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 162.56,
    "end": 176.691,
    "text": " But, for instance, in our learning policy is defined as just a single action and affordance again is kind of problematic term because we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 177.171,
    "end": 200.462,
    "text": " different notions of affordance for example in ecological psychology or in some other areas but to the best of my understanding in active inference affordance refers simply to a single action in some cases",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.53,
    "end": 208.373,
    "text": " But in some other cases, it can take on some other additional layers of meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 208.433,
    "end": 226.881,
    "text": "So for example, we can affordances or pragmatic affordances and they somehow conflated with each other and they can be confusing to delineate which",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.57,
    "end": 232.211,
    "text": " notion of affordance is referred to here in this context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.931,
    "end": 248.094,
    "text": "So yeah, those are pretty much the basic or at least some of the points that can help delineate those two concepts, affordance and policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.174,
    "end": 251.935,
    "text": "But I'm sure Daniel would have some other thoughts on that as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.656,
    "end": 254.016,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.276,
    "end": 254.496,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.771,
    "end": 279.291,
    "text": " lot of good points so big picture there are divergences between how the terms are used in Act-Inf and in reinforcement ecological psychology we hope and basically believe that there's coherence in how the terms are used but that doesn't guarantee coherence within and across areas which themselves are not necessarily internally or externally consistent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.992,
    "end": 286.5,
    "text": " so policies are sequences of actions over a given time horizon",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.297,
    "end": 314.826,
    "text": " affordances are the instantaneous single action possibilities described by the e variable so map not territory if you're in a maze and you can be going up down left right then those are your affordances and over a time horizon of four you could have policies of a time horizon of four with all the combinatorial possibilities of up down left right to the fourth power um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.173,
    "end": 337.038,
    "text": " Then there are those sometimes informally applied statements like a pragmatic affordance or an epistemic affordance, which is like when action is being taken that is oriented around epistemic value, but this is kind of like a modifier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.878,
    "end": 343.4,
    "text": "Like it's a risky affordance or it's a fun affordance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.901,
    "end": 368.715,
    "text": " not necessarily like a special subtype in a in a formal way um and it's described by the e variable you could have a nested generative model so like live stream 42 with a slam simultaneous localization and mapping at the lower level the robot has up down left right affordances at the higher level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.795,
    "end": 375.022,
    "text": " the policy selection, the affordances have to do with locations moving amongst locations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 376.204,
    "end": 381.571,
    "text": "And so you can have nested affordances because you can have nested models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.152,
    "end": 386.458,
    "text": "That's not any controversial or hot take on the system itself,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 387.617,
    "end": 408.844,
    "text": " it's just describing the model and then what we can look into more and what Paolo is researching and some others is explicitly in contrast with the ecological psychology concept of the gibsonian affordance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.49,
    "end": 432.179,
    "text": " use what was also called like affordance 1.0 2.0 and then maxwell ramstead taking the perspective that active inference affordances are affordances 3.0 the gibsonian advocates emphasize that affordances are directly perceived action capacities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.188,
    "end": 444.951,
    "text": " So for them, indeed, it is not making sense that there could be affordances in the future, but people have also considered planning from an ecological psychology perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.892,
    "end": 458.855,
    "text": "But their emphasis is on the direct perception of action possibilities, which coming from the E-vector perspective, it's kind of like take it or leave it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.175,
    "end": 461.536,
    "text": "The E-vector might be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.03,
    "end": 479.53,
    "text": " known in a metacognitive way might be directly perceived or it might not sorry what is an e-vector the e-vector is with the capacities for action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.877,
    "end": 518.059,
    "text": " here in step-by-step the E vector is the habit these are the actions that can be taken are enumerated and the values in the cells reflect the prior on action we can see that in the textbook in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.785,
    "end": 545.52,
    "text": " the figures for chapter five so here we have a dopamine mediated so neuromodulator mediated balance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.653,
    "end": 554.657,
    "text": " between two modes of policy selection here in some dopaminergic regions in the mammalian brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.718,
    "end": 558.299,
    "text": "So in both cases, observations are coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 559.46,
    "end": 571.286,
    "text": "In the indirect pathway, the E vector is basically passed along, and the policy posterior, which could be sampled from neutrally,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.367,
    "end": 600.927,
    "text": " or you could have a shaky hand and erase differences in the policy posterior or you could have a precise hand and always select the maximum element maximum posterior action probability in the indirect pathway the habit vector is basically just passed along so action selection resembles action prior whereas in the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.051,
    "end": 624.237,
    "text": " expected free energy deliberative type 2 archetype of action selection there's this sharpening or updating of the action prior into a policy posterior that's been reweighted by expected free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 634.554,
    "end": 639.778,
    "text": " This is highly schematic, and not all the variables are shown in many cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 641.7,
    "end": 643.141,
    "text": "It's just schema.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.725,
    "end": 650.047,
    "text": "So habits is something bottom up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 650.527,
    "end": 651.007,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 651.408,
    "end": 656.612,
    "text": "And the g vector is something top down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 657.112,
    "end": 658.053,
    "text": "So that's planned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 658.253,
    "end": 662.557,
    "text": "And the other one is routine or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 665.755,
    "end": 667.036,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.019,
    "end": 670.3,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.581,
    "end": 676.446,
    "text": "As always, these are aspects of generative models, not of organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.287,
    "end": 684.695,
    "text": "So it's hard because we want to be referring to the habits and the deliberation patterns that cognitive systems do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.201,
    "end": 712.57,
    "text": " also be aware that like e and g are phenomena of our model they're not phenomenas of the world but that being said the role of e is to through its membership or composition enumerate what instantaneous actions are possible if there's up down left right then the e vector is going to have four elements if there's nine directions it can move then e has a length of nine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.379,
    "end": 740.218,
    "text": " the values within the e vector are the prior on those actions being selected in an instance so if there is a uniform e vector across up down left right one one one one then there's no prior asymmetry towards taking any of those um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.869,
    "end": 768.067,
    "text": " actions whereas if the e vector was 10 1 1 1 then that is equivalent to saying like that um in the absence of further expected free energy updates that action prior will be recapitulated in future action and so you can imagine a model where e is updatable or not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.141,
    "end": 777.365,
    "text": " Like a simple updating model for E would be every time you take an action, drop a pebble into that urn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.885,
    "end": 796.973,
    "text": "So that's the learning as counting strategy, which works for many things so that the action prior comes to embody previous action posteriors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.414,
    "end": 797.994,
    "text": "That's habit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.721,
    "end": 828.457,
    "text": " And so what initially may have required a deliberative expected free energy expenditure becomes canalized or entrenched in E, allowing, for example, skill or skillful performance to occur without the deliberative high dopamine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.5,
    "end": 855.65,
    "text": " setting in figure 5.4 here the dopamine variable is gamma and yes two of the places to look for further discussion on that some of it is the ontology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.892,
    "end": 860.778,
    "text": " project where with paulo and others were talking about like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.27,
    "end": 867.972,
    "text": " Ramstad and Camaro and all of these different perspectives on affordance and representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.092,
    "end": 874.534,
    "text": "And also there's been an interesting discussion about like similarities and differences with the continuous and the discrete time model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.934,
    "end": 876.995,
    "text": "So the affordance is 3.0 discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.735,
    "end": 889.319,
    "text": "And then the other angle for critical perspectives on the active strategies and counter rebuttals is the Markov blanket trick",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.328,
    "end": 908.628,
    "text": " I just wanted to point to a kind of possible point of a point of possible confusion that can arise when dealing with these ABC",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.881,
    "end": 921.308,
    "text": " sorry, DE matrices and vectors, because sometimes it's difficult to remember which matrix or which vector encodes what.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.828,
    "end": 931.574,
    "text": "So one simple mnemonic that I found helpful in remembering those notational conventions is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 933.555,
    "end": 948.08,
    "text": " As we go from A to E, we move from instantaneous observations into our prior and learned and habit beliefs about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.76,
    "end": 952.521,
    "text": "For instance, A encodes our beliefs about the relationship between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 953.041,
    "end": 955.903,
    "text": " the hidden state and the observable outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 956.043,
    "end": 959.366,
    "text": "B is about the likelihood of the transition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 959.846,
    "end": 962.368,
    "text": "C encodes our preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 962.568,
    "end": 967.212,
    "text": "D encodes our beliefs about initial hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 967.612,
    "end": 970.014,
    "text": "And finally, E encodes our habits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.155,
    "end": 976.94,
    "text": "So yeah, I think that might help to remember those terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 976.96,
    "end": 977.44,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 980.318,
    "end": 987.023,
    "text": " And G is some kind of metaphysical expectations or something like this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 987.184,
    "end": 988.084,
    "text": "Or what is G then?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 993.329,
    "end": 995.33,
    "text": "Well, it's all metaphysical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.411,
    "end": 997.692,
    "text": "They're all informational because they're all variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.098,
    "end": 1004.962,
    "text": " Although one can take the Chris Fields perspective, information as physics... I expected free energy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.282,
    "end": 1005.782,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1006.283,
    "end": 1015.388,
    "text": "But that being said, we continue down the line with F as variational free energy and G as expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.63,
    "end": 1022.733,
    "text": "However, these are all symbols.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.253,
    "end": 1028.156,
    "text": "And there's sort of a common...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.234,
    "end": 1048.517,
    "text": " set of symbols in some sense but but they're by no means necessarily these letters it kind of goes without saying but it definitely can be a point of confusion but um let's look at our favorite step by step pull in the image for the 100th time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1058.649,
    "end": 1065.572,
    "text": " Then we have S and O. O, observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.652,
    "end": 1068.593,
    "text": "S, hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.314,
    "end": 1072.775,
    "text": "D, prior on hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.955,
    "end": 1079.558,
    "text": "A, the emission recognition matrix between S and O. This is the tale of two densities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.079,
    "end": 1084.4,
    "text": "Because A can go from S to O,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.638,
    "end": 1111.779,
    "text": " emitting in the generative direction plausible observations from hidden states or a can be used in its recognition capacity to update s based upon incoming observations so in the upper left static perception case all you need to appeal to is a b or i'm sorry a and d s and o",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.208,
    "end": 1142.041,
    "text": " then dynamic perception it's still passive but it's changing through time and what changes the hidden state through time is b the transition matrix on hidden states to enable policy selection at least two other things have to come into play well at least one but really two the one that must come into play is simply the enumeration of action capacities which is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.32,
    "end": 1166.333,
    "text": " listed in the membership of e and the cells contain quantitative information on the prior probability of those actions being selected aka habit you could have e and just be taking actions however what is it that steers the ship on which actions are selected",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.742,
    "end": 1185.44,
    "text": " Well, the way we do that in Active Inference is not by proposing a utility function and maximizing utility function and a reward function, but to encode through C our preferences, what we expect slash prefer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.521,
    "end": 1189.944,
    "text": "We talk about them as preferences because they play a functional role",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.004,
    "end": 1200.311,
    "text": " teleologically as preferences in the sense that pragmatic behavior reduces the divergence between observations and preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.332,
    "end": 1204.274,
    "text": "So in the sense that they are preferences, they are that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.114,
    "end": 1216.503,
    "text": "But what C does is it's like a thumb on the scale of observations, not by changing anything downstairs with a tail of two densities,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.79,
    "end": 1230.815,
    "text": " but rather through expected free energy, selecting policies that are expected to reduce the divergence between observations and expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.996,
    "end": 1239.119,
    "text": "And by way of reducing divergences between observations and expectations about observations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.359,
    "end": 1255.487,
    "text": " we acquire pragmatic value oriented towards C, in the extreme case, fully realizing C, exactly having a homeostatic temperature, exactly having how much money we want in the bank, whatever it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.667,
    "end": 1260.95,
    "text": "And so functionally, C is called preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.732,
    "end": 1268.554,
    "text": "And then there's this little extra piece on the right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.673,
    "end": 1286.031,
    "text": " that's also reflected in that dopaminergic image with gamma as a temperature gamma and beta as one over each other and those um gamma being a parameterization of a big gamma distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.38,
    "end": 1289.76,
    "text": " And then be one over each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.2,
    "end": 1298.162,
    "text": "So whether you choose to think about it as like temperature or inverse temperature, that is a precision on policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1298.922,
    "end": 1300.023,
    "text": "And then last thought on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.143,
    "end": 1305.264,
    "text": "This is not the only active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.464,
    "end": 1308.444,
    "text": "You could have a precision on anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.405,
    "end": 1315.366,
    "text": "You could have a precision on D. You could have a precision on A. You could have a precision on B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.048,
    "end": 1320.45,
    "text": " So these are like some birds I've seen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.891,
    "end": 1327.795,
    "text": "This is not the overall exhaustive zoo of all possible birds or the one possible bird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.715,
    "end": 1341.103,
    "text": "These are like certain configurations of base graphs, which we can use a controlled ontology to describe so that we can apply them in cybernetic contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.863,
    "end": 1344.925,
    "text": "For example, designing ecosystems of shared intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.976,
    "end": 1358.139,
    "text": " I also believe beta is technically called stochasticity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1358.9,
    "end": 1373.546,
    "text": "So in some literature, they explicitly use this term stochasticity to refer to that beta parameter, which sometimes for the sake of simplicity is equated to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1374.496,
    "end": 1381.982,
    "text": " in order to not complicate the distributions, especially the Gaussian distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1383.563,
    "end": 1389.688,
    "text": "But sometimes it can be an arbitrary value of stochasticity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.591,
    "end": 1394.012,
    "text": "Yes, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.373,
    "end": 1402.538,
    "text": "And when we see the learning, figure 7.10,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.864,
    "end": 1424.553,
    "text": " here learning in a bayesian setting can be seen as as having a prior on that variable so if we have a fixed parameter um d then it's just like a um like a dirac delta",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.834,
    "end": 1433.097,
    "text": " hashtag category theory, but it's like one point that's just fixed and it's a fixed value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.857,
    "end": 1436.538,
    "text": "There's two states and it's one, zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.738,
    "end": 1451.043,
    "text": "So just, it is the first state, or you could imagine the instantiation of that prior parameterization to be drawn from another distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.43,
    "end": 1458.531,
    "text": " And then you could imagine learning or updating within that setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.752,
    "end": 1465.433,
    "text": "But if you have just a fixed parameter, then it can't be updated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.813,
    "end": 1477.356,
    "text": "But if you have a fixed parameter or associated with a prior, then you've opened the door to learning and invoked all of these other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.665,
    "end": 1492.966,
    "text": " of bayesian considerations like making sure that your prior is not simply being recapitulated in the output so like testing for different priors and doing all these different things for standards rigorous bayesian statistics michael",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.492,
    "end": 1504.637,
    "text": " Yeah, so in this graph that you just showed, an affordance would then be the relation between S and O?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1506.538,
    "end": 1506.718,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.959,
    "end": 1510.441,
    "text": "S and O, hidden states and observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.341,
    "end": 1513.182,
    "text": "So A is the tail of two densities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.823,
    "end": 1520.987,
    "text": "Here's the temperature of the room, S, and the thermometer, O. So the recognition density is what's the temperature...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.068,
    "end": 1549.169,
    "text": " given the reading and then the generative density direction is from the temperature what's the thermometer so the downstairs is all passive inference downstairs passive inference here's our prior on the temperature in the room temperature in the room changing through time we're not doing anything about it and at every time step it's emitting an observation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.075,
    "end": 1562.225,
    "text": " Where action comes in is in the upstairs with E, the actions that we can take and associated habituality around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.686,
    "end": 1577.999,
    "text": "And then as to do more than simply recapitulate habit, we have preferences, which have a semantics of being expectations about observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.759,
    "end": 1606.196,
    "text": " i expect myself to be homeostatic and i'm going to take actions that make that realized so reward learning paradigm i'm rewarded by having homeostatic temperature and i follow policies that are rewarding active inference self-evidencing paradigm i expect to be homeostatic and so i take action selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.714,
    "end": 1614.445,
    "text": " to reduce divergences between the observations that I do get and what I expect slash prefer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.561,
    "end": 1631.327,
    "text": " So can the notion of affordances then be explained with these graphs that you showed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1631.828,
    "end": 1637.392,
    "text": "Is it a vertical slide through this architecture?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1638.593,
    "end": 1642.957,
    "text": "I mean, it has to do with the O and with preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.277,
    "end": 1644.458,
    "text": "That's what you just said, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1645.839,
    "end": 1647.06,
    "text": "The actions are taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.08,
    "end": 1650.542,
    "text": "I mean, in a way, the actions are taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.548,
    "end": 1672.716,
    "text": " in the adaptive case in service pragmatically of reducing the divergence between c and o that is pragmatic value is reducing that and that's with the kl divergence we're reducing the divergence between c and o that's pragmatic value epistemic value is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.833,
    "end": 1677.375,
    "text": " reducing our uncertainty about different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.236,
    "end": 1679.217,
    "text": "Where are the affordances?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.277,
    "end": 1681.238,
    "text": "Can it be seen as like a slice in time in this graph?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.658,
    "end": 1685.341,
    "text": "So the affordances are enumerated in the E variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.343,
    "end": 1700.633,
    "text": "And in every single time step, they are going to be crunched by G. And then B, let's just say that there are two affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.154,
    "end": 1703.696,
    "text": "We can turn the heater on or we can have the heater off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.262,
    "end": 1710.166,
    "text": " B is going to have two slices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.707,
    "end": 1712.647,
    "text": "B is like a tensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.409,
    "end": 1721.994,
    "text": "It can be any, the dimensionality is really important and looking at the notebooks and the code around these things is some of the best way to get intuition for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.675,
    "end": 1727.979,
    "text": "But basically B has a slice for every affordance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.82,
    "end": 1733.223,
    "text": "So there's like a B, like a transition matrix for the heater being off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.266,
    "end": 1737.008,
    "text": " And then there's a transition matrix for the heater being on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.909,
    "end": 1745.474,
    "text": "So like, let's just say that in our hidden state, there's three temperatures, cold, medium, and hot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.775,
    "end": 1748.256,
    "text": "So again, map, not territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.296,
    "end": 1750.798,
    "text": "We're not saying that there isn't a quantitative temperature in the room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.818,
    "end": 1754.841,
    "text": "It just, we're choosing to model the hidden state with three discrete states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.761,
    "end": 1761.485,
    "text": "And so if the heater is off, the B matrix, let's just say, looks like the identity matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.626,
    "end": 1763.847,
    "text": "So if the heater is off,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.08,
    "end": 1766.922,
    "text": " the room's temperature does not change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.784,
    "end": 1774.91,
    "text": "If the heater is on, we bump from cold to medium, medium to hot, and we stay in hot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.112,
    "end": 1787.764,
    "text": "And so then the ones would be like in different locations on that slice of B. What do you think about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.553,
    "end": 1792.495,
    "text": " Yeah, so trying to digest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1793.436,
    "end": 1799.42,
    "text": "So you're saying the affordances are encoded in the transitions between states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.282,
    "end": 1805.966,
    "text": "The affordances are most plainly listed in the E variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.667,
    "end": 1819.257,
    "text": "However, every affordance is also represented with a different transitions, different transition slice in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.192,
    "end": 1832.854,
    "text": " If there was just one transition matrix, then our action wouldn't do anything because the world is just going to change the way it's going to change no matter what we select.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.735,
    "end": 1845.337,
    "text": "So then all policies would be equally meaningless in service of reducing the divergence between our preferences and observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.86,
    "end": 1855.027,
    "text": " So again, not a feature of the real world that there's actually a B matrix out there that has a number of slices equivalent to the number of actions that can be taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.147,
    "end": 1874.102,
    "text": "But given the dimensionality of E, there is a slice corresponding to each element of E in B. And then if affordance one is taken, slice one is used in the transition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.103,
    "end": 1881.045,
    "text": " If a forwardance 2 is taken, slice 2 is used in passing s forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.686,
    "end": 1885.106,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1885.226,
    "end": 1895.129,
    "text": "And what if there is somehow an implication if I'm in right now and there's an implication for the future?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1895.149,
    "end": 1901.732,
    "text": "And well, perhaps not really a deterministic one,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1904.052,
    "end": 1909.235,
    "text": " So I decide with my decision right now what happens in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1909.735,
    "end": 1912.956,
    "text": "But the future would not be an affordance in that sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1913.516,
    "end": 1926.582,
    "text": "Even though it's part of maybe a policy, it's not an affordance because it's not related to that transition that is immediately activated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1926.642,
    "end": 1927.882,
    "text": "That's right now the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1929.223,
    "end": 1929.863,
    "text": "Something like this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1933.607,
    "end": 1962.88,
    "text": " that that's a a a commendable compatibilist position between the ecological psychologists and active inference is like saying well affordances are real in the moment and so policies which also include actions that are taken potentially in the future like imagined actions those are also those will be real in their moment and they're cognitively real in this moment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.383,
    "end": 1990.064,
    "text": " And that's why this also invokes the discussion around representationalism, because if one takes a realist perspective and says, well, this is what they're doing, they're evaluating all counterfactuals in the organism's brain or in the computer program or something, versus is this just an instrumental analytical framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.001,
    "end": 1997.043,
    "text": " That doesn't actually mean that there's an E vector or the enumeration of counterfactual policies at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.664,
    "end": 2019.89,
    "text": "So the realist angle would be, this is the causal architecture and patterns in this Bayes graph will be associated with, for example, neural activity patterns, which can be understood as neural representations of these quantities and processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.786,
    "end": 2037.373,
    "text": " The instrumentalist is under absolutely no compulsion for this architecture to reflect anything in specific about the slime mold, the ant colony, the civilization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.634,
    "end": 2046.117,
    "text": "It's not like there actually has to be the enumeration of counterfactuals about hypothetical action sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.938,
    "end": 2051.139,
    "text": "But we list those as a convenience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.919,
    "end": 2079.122,
    "text": " then we can apply tree surge branching time active inference etc etc as heuristics in the space that is combinatorially constructed but that from an instrumentalist point of view doesn't mean that's what the system is doing and that is like at one of one of the heart of the tension",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.451,
    "end": 2109.915,
    "text": " because the gibsonian affordance concept centers a quintessentially realist phenomena which is what the organism is actually instantaneously perceiving in terms of action capacities chairs are for sitting which means potentially under like some um people's interpretation of radical and activism like if you don't see the chair",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.206,
    "end": 2114.949,
    "text": " you're not having that instantaneous perception of action capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.171,
    "end": 2130.801,
    "text": "Whereas an active inference, especially from an instrumental reading, we're basically on the plus side, completely free from that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.422,
    "end": 2138.807,
    "text": "But on the downside, people need to be very careful that they don't sneak the realism back in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.984,
    "end": 2149.794,
    "text": " and say, well, here's going to be the central nervous system, just conceptually, decision-making, and here's going to be the nested model of the hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.496,
    "end": 2162.368,
    "text": "And then it's all good, they go off on their instrumental way, and then all of a sudden they're interpreting this as the elbow, as if this architecture was reflecting, for example, something anatomical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.293,
    "end": 2188.532,
    "text": " so instrumentalism allows one to fly freely with this analytical framework and leave a lot of baggage at the door however in the case where realist conclusions are being sought to be constructed one has to be careful that they weren't actually taking a covert realism along for the ride",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.254,
    "end": 2214.325,
    "text": " good news is i think people can do that because they don't have any problems with linear regression but then again some do in some cases but the arc architecture of that base graph",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2219.298,
    "end": 2223.381,
    "text": " can be seen of similar to structural equation modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.302,
    "end": 2240.955,
    "text": "It's not exactly the same, but having edges and nodes is not the system's mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.998,
    "end": 2247.28,
    "text": "But given this statistical artifact",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.645,
    "end": 2252.407,
    "text": " it's very easy to say that this causes that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.65,
    "end": 2259.193,
    "text": "Instead of being proper and saying it's associated with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.774,
    "end": 2262.996,
    "text": "Especially because you get into directed edges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.016,
    "end": 2268.62,
    "text": "It's like, well, this is unidirectionally associated with that through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.622,
    "end": 2272.223,
    "text": "It's like, come on, then just say it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2281.854,
    "end": 2282.294,
    "text": " What do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.14,
    "end": 2294.264,
    "text": "Yeah, if you ask me, I'm digesting it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2295.525,
    "end": 2299.488,
    "text": "I need some more time to get all this a little bit clearer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2299.528,
    "end": 2303.471,
    "text": "But thanks so much to elaborate on this question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2303.571,
    "end": 2304.352,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2304.912,
    "end": 2310.617,
    "text": "Yeah, this is like the heart of the textbook and the topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.003,
    "end": 2338.858,
    "text": " and this is a model architecture it's not the only model architecture but being able to interpret what these model architectures are helps us understand a lot about active inference and then I guess as we are seeing it also shines a lot of interesting light on broader questions about scientific modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.172,
    "end": 2365.588,
    "text": " in bigger discussions which i mean to kind of return to chapter nine that's the metabasian perspective that's why we're centering this ethological moment with the modeler's construction of a cognitive model whose aboutness is the setup the experimenter has constructed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.747,
    "end": 2400.488,
    "text": " and again that to make that explicit and encoded in our model structurally is the innovation because upon inquiry I don't think this is a contentious layout like if inside of the dashed line there was a linear regression or an SPM model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.213,
    "end": 2417.583,
    "text": " and we said, okay, we did the T maze and we had the rat hooked up to the whatever, optogenetics or to the confocal microscope or to the EEG or to the video camera or to the ultrasound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2417.603,
    "end": 2419.544,
    "text": "It's like, you got all these scientific tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.185,
    "end": 2425.248,
    "text": "Okay, we set up an experimental context and then we observe behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2426.669,
    "end": 2429.431,
    "text": "Now, what is it that was in between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.905,
    "end": 2433.026,
    "text": " the stimuli and the observed behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.606,
    "end": 2436.267,
    "text": "Well, obviously it was the mouse or the rat itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.288,
    "end": 2450.493,
    "text": "Okay, so we want to have at the very least some kind of model of our rat that is able to perceive experimental stimuli and then output behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.433,
    "end": 2453.254,
    "text": "So we could put a linear regression here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.714,
    "end": 2458.356,
    "text": "Here's temperature on the x-axis and likelihood of eating cheese on the y-axis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.192,
    "end": 2462.573,
    "text": " and we make a regression or we do model comparison.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.613,
    "end": 2470.997,
    "text": "We say, okay, is it better compatible with a linear regression or a breakpoint regression or a quadratic regression?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.717,
    "end": 2487.283,
    "text": "And so you have the modeling discussion and they go, okay, we use the BIC and the optimal model to describe the relationship between temperature and cheese eating is a breakpoint regression or it's just a simple linear regression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.741,
    "end": 2495.243,
    "text": " Would someone turn around and say, why would you say mice are linear regressions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.425,
    "end": 2511.208,
    "text": "The obvious response would be, no, we just use the linear regression instrumentally to describe our data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2512.728,
    "end": 2514.509,
    "text": "Check out the method section, look again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.069,
    "end": 2518.81,
    "text": "We followed pretty standard process of modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.566,
    "end": 2531.691,
    "text": " so that we were able to explain data but not overfit, accuracy minus complexity, and we use standard software tools and packages so that everybody could replicate it in its open source.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.691,
    "end": 2535.012,
    "text": "We're definitely not saying that mice are linear regressions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.576,
    "end": 2543.816,
    "text": "But when figure 4.3 goes into the box,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.537,
    "end": 2550.858,
    "text": " different questions arise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2554.741,
    "end": 2562.626,
    "text": "And I'm not even saying that what I have just proposed is infallible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.907,
    "end": 2566.509,
    "text": "I think people can have a different perspective on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.53,
    "end": 2575.216,
    "text": "For example, they could say, well, yeah, if you do a linear regression, you're not saying the mouse is a linear regression, but there's something different about active inference modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.227,
    "end": 2600.212,
    "text": " when you put figure 4.3 inside the box you've taken on a different set of commitments that's a totally valid point to make if somebody can point to those commitments and that's a discussion to have but simply considering active inference as like a software package or an analytics framework for behavior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.277,
    "end": 2611.561,
    "text": " just replace figure 4.3 in your mind's eye with linear regression and ask what claims are valid or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.901,
    "end": 2615.782,
    "text": "And there are differences between the models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2616.343,
    "end": 2621.125,
    "text": "So there may be certain things that go one way for linear aggressions and another way for POMDPs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.126,
    "end": 2630.669,
    "text": "However, there's also a broad set of criticisms that people level at figure 4.3",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.297,
    "end": 2638.241,
    "text": " that are throwing out the linear regression as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2641.384,
    "end": 2643.605,
    "text": "But it's a format that people are more familiar with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.631,
    "end": 2654.634,
    "text": "I assume this explains much more, potentially at least.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2655.875,
    "end": 2661.64,
    "text": "You could generate a POMDP with zero explanatory predictive value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.089,
    "end": 2667.112,
    "text": " And you could have a linear regression with a good R squared or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2668.152,
    "end": 2671.054,
    "text": "It's not a function of the type of model selected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.916,
    "end": 2680.1,
    "text": "In fact, the space of POMDPs is just from a parametric perspective, it's much larger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.081,
    "end": 2681.221,
    "text": "Like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.836,
    "end": 2688.9,
    "text": " Here, this is still a relatively simple, this is even without showing the dimensionality of these variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.801,
    "end": 2692.863,
    "text": "Like if there's 10 affordances, B is going to have 10 slices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2694.384,
    "end": 2706.813,
    "text": "And then if S has 10 hidden, even if it's 10 discrete options, so you're talking about some large tensors and parameterizing them from data is non-trivial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.291,
    "end": 2709.792,
    "text": " That's what chapter nine is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.452,
    "end": 2724.541,
    "text": "And that's why we have often called for the development of statistical power analysis techniques, because even simple models have many free parameters that might be related in complex ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2725.482,
    "end": 2733.047,
    "text": "Like if C is like within this range, then changes in A do or don't do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.275,
    "end": 2738.778,
    "text": " but if A becomes more ambiguous, then this consequence happens over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.858,
    "end": 2745.323,
    "text": "And those kinds of like rippling effects in the model are not constrained to which edges are drawn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.685,
    "end": 2755.591,
    "text": "So we need much better statistical power analysis techniques in order to anticipate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.96,
    "end": 2762.884,
    "text": " the kinds of statistical considerations that people use for linear regressions and RNA-seq analyses every day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2764.525,
    "end": 2768.828,
    "text": "But there's nothing about this model that makes it fit any given data set better or worse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.928,
    "end": 2772.09,
    "text": "These are all modeler's choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.734,
    "end": 2783.317,
    "text": "Any closing thoughts or questions on nine before we scan 10?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.633,
    "end": 2818.633,
    "text": " i also think it'll be interesting to see like as we have more notebooks and and accessible software packages that will help um support this deflationary perspective on active inference because it'll be like well what what what part of this um tiger is the is the b matrix",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.419,
    "end": 2845.691,
    "text": " we'll have like a notebook it's like well now here's the b matrix in the notebook but it's not in the world and and then just coming at that nexus many many times will be useful but also i think including people in empirical research is going to help with that because for one who hasn't read a paper and or for one who hasn't participated in empirical behavioral research",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.858,
    "end": 2875.921,
    "text": " neither of which are bad or good states just saying some people have these experiences and some don't that um separation of statistical models from reality like mice are not linear aggressions mice are not pomdps that is definitely like a posture and i don't mean it's a facade",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.583,
    "end": 2890.59,
    "text": " It's a stance that is built through statistical investigation, at the very least reading it, if not actually doing it oneself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.131,
    "end": 2905.858,
    "text": "Like once one sees that there's a hundred or an open-ended number of ways to model just the thermometer and the true temperature of the room, that person will think differently about map and territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.423,
    "end": 2913.624,
    "text": " This is the final chapter 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.305,
    "end": 2919.407,
    "text": "In general, we are least aware of what our minds do best by Dr. Minsky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.728,
    "end": 2929.252,
    "text": "Chapter 10, we're going to wrap up active inference main theoretical points from the first half of the book, chapters one through five, and the practical implementations from the second part, six through 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.113,
    "end": 2936.096,
    "text": "Then we connect the dots, abstracting away from specific models discussed to focus on integrative aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.115,
    "end": 2960.661,
    "text": " benefit of active is it provides a complete solution to the adaptive problems that sentient organisms have to solve this is definitely a sentence that we've um discussed in prior cohorts does it provide a complete solution or does it set the table for a useful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.17,
    "end": 2986.401,
    "text": " solution or or some other way of of saying that you know have the previous nine chapters literally resolved all the problems or have they helped us learn the linguistics and techniques that help us frame the problems so that we can come to heuristic solutions but again these are the kinds of things we can discuss um 10.2 wrapping up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.971,
    "end": 3013.281,
    "text": " this par at all textbook offers a systematic account of the theoretical underpinnings part one practical implementations of active inference part two they review chapter one chapter two long low road chapter three high road well do you need your temperature tomorrow chapter five",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.926,
    "end": 3019.809,
    "text": " highlights some of the applications and research in active inference in the mammalian nervous system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.73,
    "end": 3024.851,
    "text": "Chapter six, the recipe to design active inference models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.512,
    "end": 3032.476,
    "text": "Chapter seven and eight, discrete and continuous time generative models in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.356,
    "end": 3038.259,
    "text": "Chapter nine, active inference in the context of model-based data analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3039.419,
    "end": 3040.2,
    "text": "Connecting the dots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.334,
    "end": 3043.635,
    "text": " Integrative perspectives on active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.435,
    "end": 3046.875,
    "text": "Daniel Dennett and the whole iguana.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3048.236,
    "end": 3066.6,
    "text": "Hey, instead of going deep down the rabbit hole with the prospective working memory module subsystem and then developing this whole just-so story backwards from that, how about modeling a complete cognitive creature and environmental niche for it to cope with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.339,
    "end": 3084.448,
    "text": " They talk about that whole iguana perspective and the way that diverse cognitive phenomena, attention, memory, anticipation, et cetera, et cetera, can be understood of using this active inference first principles framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.569,
    "end": 3094.593,
    "text": "Active inference doesn't start by assembling separate predefined cognitive functions, perception, decision-making, and planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.717,
    "end": 3102.442,
    "text": " Rather, it starts by providing a complete solution or approach to derive implications about cognitive functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3106.245,
    "end": 3110.829,
    "text": "That helps us identify patterns of cognitive phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.609,
    "end": 3115.152,
    "text": "For example, optimal foraging in different settings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.394,
    "end": 3124.319,
    "text": "Finally, active inference offers a principled means of understanding corresponding neural computations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.323,
    "end": 3153.094,
    "text": " it speaks to multiple levels of mars hierarchy mars levels and very briefly we'll discuss more in the coming weeks implications for psychological function as if we were sketching or prompting a psychology textbook predictive brains minds and processing what does active inference have to do and how does it build within the lineage of research on the predictive brain predictive mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3156.038,
    "end": 3182.172,
    "text": " perception and different psychological and philosophical lineages for example going back to helmholtz and before on perception bayesian brain action idea motor theory cybernetics optimal control theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.057,
    "end": 3210.272,
    "text": " utility in decision-making, Bayesian decision theory, reinforcement learning, planning as inference, behavior and bounded rationality, free energy theory of bounded rationality, valence, emotion, and motivation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3213.066,
    "end": 3237.597,
    "text": " homeostasis, allostasis, and pteroceptive processing, attention, salience, and epistemic dynamics, role learning, causal inference, and fast generalization, active inference, and other fields, open directions, social-cultural dynamics, machine learning and robotics, and summary with the Lord of the Rings quote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.006,
    "end": 3244.288,
    "text": " Ultimately, we are confident that you will continue to pursue active inference in some form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3246.13,
    "end": 3250.452,
    "text": "Okay, thanks for the Chapter 9 discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.873,
    "end": 3257.676,
    "text": "We will come back for the coming two weeks in Chapter 10 and then one final session.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.096,
    "end": 3259.337,
    "text": "So, thank you all.",
    "speaker": "SPEAKER_01"
  }
]