[
  {
    "start": 7.912,
    "end": 16.842,
    "text": " hello and welcome everyone this is Active Inference guest stream 88.1 on September 17th 2024",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.092,
    "end": 23.119,
    "text": " We're here with Hunar Abdulrahman and we'll be discussing what is the limit of our brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.98,
    "end": 27.284,
    "text": "There's a fun backstory here maybe we'll go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.324,
    "end": 31.989,
    "text": "There will be a presentation followed by a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.53,
    "end": 38.257,
    "text": "So I'm very much looking forward to it and to reading people's comments and questions too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.377,
    "end": 46.947,
    "text": "So Hunar, thank you again for joining and to you for any backstory and introduction and for the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.927,
    "end": 47.908,
    "text": " So thanks again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.47,
    "end": 53.494,
    "text": "Thank you, Daniel, for inviting me to this nice stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.514,
    "end": 60.942,
    "text": "Actually, it's the first time, as I told you before, we start to do a live stream using this software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.982,
    "end": 66.788,
    "text": "So I hope the audience will forgive us if there is any upcoming technical problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.808,
    "end": 67.81,
    "text": "Hopefully there will be not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.331,
    "end": 71.233,
    "text": "So thanks a lot for inviting me again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.293,
    "end": 72.515,
    "text": "My name is Huner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.595,
    "end": 74.757,
    "text": "I have a PhD in neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.737,
    "end": 81.224,
    "text": " I spent many, many years trying to learn how our brain works using functional MRI EEG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.805,
    "end": 87.071,
    "text": "So I did my PhD at, I get my PhD from the Cambridge University.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.353,
    "end": 100.727,
    "text": "And we will be talking a bit about what I did in my PhD and how I try to link the concepts that I learn about brain with the outside world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.707,
    "end": 103.871,
    "text": " with other concepts like the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.891,
    "end": 106.934,
    "text": "So I'm actually a newcomer to the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.055,
    "end": 123.955,
    "text": "I hope that people with technical background forgive us if I have any technical errors, but hopefully maybe I'll try to learn and share my insights about what I have discovered from my searching in the past few years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 124.936,
    "end": 129.321,
    "text": "So can you see the slides if I start?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.102,
    "end": 130.663,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.656,
    "end": 140.601,
    "text": " So the topic is actually about what's the limit of our brain and I will try to talk about two concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.721,
    "end": 146.678,
    "text": "I will talk about some few concepts and later on we will link them all together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.658,
    "end": 155.549,
    "text": " So first I will try to talk about the brain as a predictive machine, usually the predictive coding account, then I will try to ease into the free energy principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 155.749,
    "end": 160.635,
    "text": "And then later on, I will try to talk about what makes prediction difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.715,
    "end": 162.697,
    "text": "I will talk about extrinsic factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.737,
    "end": 173.29,
    "text": "So even if we have the best learning machine, the best machine learning algorithm, or even if our brain is perfect in learning, there are still a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.27,
    "end": 200.256,
    "text": " difficulties basically because of computational irreducibility principle which i will be talking more about it in the upcoming slides so i will try to i i would love to start with repetition suppression it's a well-known concept in neuroscience so uh if if somebody wants to go into the details what's repetition suppression i will recommend to you uh this article by my phd supervisor rick henson",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.236,
    "end": 217.519,
    "text": " uh but it's a bit difficult to wrap your head around the results so i'll try to make it easy basically what repetition suppression means the activity that we record from our brains whether using eeg fmri or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 217.499,
    "end": 219.143,
    "text": " single-cell recordings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.386,
    "end": 234.883,
    "text": "For example, if you see a sequence of pictures of elephants, and then later on you will see something surprising or novel, like the kangaroo image here, the activity of our brain increases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.982,
    "end": 242.457,
    "text": " However, when you see repetitions of the same image again, like the kangaroo here, the activity decreases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.038,
    "end": 244.942,
    "text": "That's what we call a repetition separation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.962,
    "end": 253.699,
    "text": "If you repeat something, the activity of your brain, your brain will not be responding in the same way it responded the first time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.012,
    "end": 257.636,
    "text": " then you will see something new like this beer here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.817,
    "end": 262.382,
    "text": "Because it's novel, the activity of your brain increases again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.203,
    "end": 267.389,
    "text": "So this repetition suppression is not only for repetition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.81,
    "end": 270.213,
    "text": "Sometimes we call it expectation suppression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.634,
    "end": 276.822,
    "text": "So even if something is not repeated but not expected, the activity of your brain increases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.183,
    "end": 283.011,
    "text": "But if you expect something, so usually repetition and expectation are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 282.991,
    "end": 302.383,
    "text": " synonymous if something repeats a lot it will be expected if something is novel it's unexpected so these results you will be finding in whether repetition studies or expectation studies they will tell you if you see something unexpected or novel the recordings of your brain increases if something becomes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.363,
    "end": 328.405,
    "text": " expected or repeated the recordings degrees so that's the repetition suppression now uh during my phd we we saw a very interesting paper titled less is more expectations sharpens representations in the primary cortex so so normally a neuroscientist will be interesting why this happens why repetition suppression is there so this paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.482,
    "end": 334.248,
    "text": " proposed a new idea, which actually a bit surprising for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.268,
    "end": 337.612,
    "text": "So the paper tested these are grating orientations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.753,
    "end": 340.856,
    "text": "The subject will see different orientations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.976,
    "end": 344.18,
    "text": "Sometimes it's expected, sometimes it's not expected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.56,
    "end": 351.068,
    "text": "So the results they found is that the activity of the brain decreases when something is expected or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 351.824,
    "end": 376.144,
    "text": " so this was expectation study not repetition study but the same usually the results will be similar so the activity decreases as you see here uh i i you don't see my mouse can you see my my cursor oh okay so the activity decreases however for classification uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 376.985,
    "end": 382.357,
    "text": " They tested classification accuracy, so they have like two orientations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.497,
    "end": 391.076,
    "text": "If you repeat something, if you use machine learning to classify between orientations, in the repetition, the classification accuracy is more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.82,
    "end": 393.762,
    "text": "So let me see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.88,
    "end": 424.002,
    "text": " uh okay so during uh this is the classification the the bottom panel is about the classification accuracy so as you see in the repetition of the classification accuracy increases and the very explanation was that because sharpening happens so i will give you an ex an illustration so this is not the exact experiment but this illustration so for example here you see the number five",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.724,
    "end": 428.468,
    "text": " If you repeat that, basically, it will become sharper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.568,
    "end": 436.157,
    "text": "I mean, the neurons, that's the concept, that are not directly representing number five will be suppressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.277,
    "end": 442.724,
    "text": "So when you repeat something or when something becomes expected, the non-interested activity will become suppressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 442.744,
    "end": 444.306,
    "text": "So that's their explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.366,
    "end": 446.328,
    "text": "Basically, it's sharpening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.548,
    "end": 447.95,
    "text": "The image will become sharper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.811,
    "end": 451.934,
    "text": "I think this is intuitive explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.516,
    "end": 454.377,
    "text": "However,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 455.015,
    "end": 466.071,
    "text": " we uh so during my phd we did have a lot of data set about repetition so two different data sets we have one data set was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.249,
    "end": 473.057,
    "text": " pictures of faces versus scrambled faces were shown to the subjects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.077,
    "end": 477.083,
    "text": "So you see here two faces, similar, repeated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.784,
    "end": 480.608,
    "text": "And then you see here two scrambled faces repeated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.228,
    "end": 484.513,
    "text": "We also have the data for gratings, orientations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.514,
    "end": 486.376,
    "text": "It's similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.436,
    "end": 488.539,
    "text": "We have either repetitions or novel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.68,
    "end": 493.365,
    "text": "So what we found in our results is same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.606,
    "end": 496.75,
    "text": "The repetition, the activity decreases, we saw.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.73,
    "end": 502.098,
    "text": " But for the phase dataset, we saw that even the classification accuracy also decreases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.939,
    "end": 508.006,
    "text": "So it means like when you repeat something, the brain activity decreases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.567,
    "end": 512.192,
    "text": "But for the gratings, we saw that the classification increases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.212,
    "end": 516.638,
    "text": "So the same result as the previous group, which I talked about, they found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.698,
    "end": 519.582,
    "text": "They explained that as sharpening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.562,
    "end": 522.366,
    "text": " So how can we explain this result?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.386,
    "end": 528.835,
    "text": "Because for the grading data set, we see the classification accuracy increases, so we can say, oh, it's sharpening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.416,
    "end": 532.42,
    "text": "But now for the faces, the classification accuracy decreases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.561,
    "end": 533.302,
    "text": "So what is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 534.784,
    "end": 541.814,
    "text": "So we thought it would be very, very difficult without simulations just to explain the data with our minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.994,
    "end": 546.801,
    "text": "Intuition doesn't work, to be quite honest, without a simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.781,
    "end": 576.788,
    "text": " the reason because functional mri is uh even though it's high resolution it's still very very low each pixel if each voxel here represents the activity of millions of neurons averaged together so so basically when you are trying saying that uh sharpening it means that then interest neurons will become less active we are talking about the average activity of many many many neurons and it will be very very difficult to intuition about that without simulation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.768,
    "end": 587.829,
    "text": " So this representation will tell you, like, for example, here we are talking about different representations of the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.39,
    "end": 597.207,
    "text": "It will be very, very difficult to conceptualize what happens really in the underlying mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.608,
    "end": 606.48,
    "text": " So what we proposed was we thought like maybe classification accuracy also decreases for local scaling or local.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.82,
    "end": 611.587,
    "text": "So what people think, you see here in the first panel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.208,
    "end": 617.334,
    "text": "So I'm just wondering, can you see the mouse when I am moving it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.876,
    "end": 620.479,
    "text": "Yeah, it's small, but we can see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.619,
    "end": 623.042,
    "text": "I'll also go with my mouse too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.208,
    "end": 626.26,
    "text": " Because I have two screens, to be quite honest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.28,
    "end": 632.644,
    "text": "I mean, which screen you see the mouse moving so that I... Yeah, we see the mouse on P1 uniform.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.957,
    "end": 639.224,
    "text": " Okay, okay, so this screen, okay, I just, okay, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 639.444,
    "end": 646.493,
    "text": "So five here, if you repeat the five, people usually think that suppression will happen uniformly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.514,
    "end": 649.237,
    "text": "So you can see the five suppressed with all the videos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.638,
    "end": 653.883,
    "text": "So sharpening will tell you, no, the suppression will not happen uniformly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.943,
    "end": 660.572,
    "text": "It only happens with the non-interested neurons or neurons that doesn't represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.552,
    "end": 683.927,
    "text": " five but we say that even if neurons for example the neurons that represent five even we if we selectively suppress those neurons like in the bottom panel we may still find increase in classification accuracy depending on how many voxels or we suppress so basically this was our conceptual idea before simulations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 684.312,
    "end": 686.676,
    "text": " So how do we simulate data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.897,
    "end": 689.962,
    "text": "I mean, how do we go from the neural activity to the functional MRI?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.022,
    "end": 697.556,
    "text": "Because the simulation is kind of difficult because we are trying to express neural activity in the functional MRI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 698.037,
    "end": 703.687,
    "text": "So one idea is, for example, this is from neural activity studies from a single neuron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.568,
    "end": 707.113,
    "text": "Let's say this neuron is very active.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.093,
    "end": 730.755,
    "text": " uh for uh orientation if if the orientation is 90 degree so you see a lot of spikes here and and the if you if you represent that with a tuning curve you will see that it will have maximum response when the orientation is at 19. but but the response of the neuron will be less if you go because we will say this neuron is very selective to the orientation 90.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.596,
    "end": 737.447,
    "text": " So the way we simulated that, we simulated that using orientation curves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.948,
    "end": 750.853,
    "text": "So let's say this orientation curve is selective to the horizontal orientation, but it's less selective to the other orientations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.833,
    "end": 754.318,
    "text": " What sharpening means, it means it becomes sharper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.678,
    "end": 759.264,
    "text": "When we repeat that, the neuron will be more selective to the horizontal selector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.285,
    "end": 762.369,
    "text": "So this is less sharpening, this is more sharpening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.389,
    "end": 765.373,
    "text": "So that's how we are trying to simulate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.154,
    "end": 772.222,
    "text": "Now, on the other hand, scaling or dampening, it means like the activity will be decreased.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.663,
    "end": 778.731,
    "text": "The activity of the neuron will be increased for the horizontal stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.078,
    "end": 788.011,
    "text": " Now we have a lot of neurons, not one neuron, so this was only a representation for one neuron, but we have a lot of neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.071,
    "end": 797.647,
    "text": "Some neurons are responding to the orientation 19, some neurons are responding to the horizontal orientation, and some in between, and there is overlapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.667,
    "end": 804.398,
    "text": "And when we want to simulate a voxel, we usually sum this line, the activities on this line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.053,
    "end": 811.162,
    "text": " So I don't know if it is clear or not the procedure that we are trying to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.222,
    "end": 814.948,
    "text": "So I hope you interrupt me if something is unclear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.589,
    "end": 821.117,
    "text": "So when we sum the activities, we will have a representation for the activity of a voxel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.038,
    "end": 824.462,
    "text": "Now, in this case,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.202,
    "end": 830.169,
    "text": " We talked about sharpening and scaling, but we may have a global effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.189,
    "end": 834.294,
    "text": "The global effect means everything will be suppressed, everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 834.354,
    "end": 837.398,
    "text": "So this is the global effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.418,
    "end": 843.867,
    "text": "The local effect, it means no, selectively a part of neurons will be suppressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 843.887,
    "end": 846.13,
    "text": "So this is similar to the sharpening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.11,
    "end": 863.562,
    "text": " we call it remote effect it means that the neuron that responds to the horizontal stimuli it won't be suppressed but the neurons that respond to other orientations they will be suppressed according to their distance so this is a parameter that we can fine-tune",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.233,
    "end": 867.64,
    "text": " And local separation, it means the opposite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.68,
    "end": 871.888,
    "text": "The neuron that is selective to the horizontal stimuli, it will be suppressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.329,
    "end": 877.72,
    "text": "So you see, there are many ways that we can simulate the repetition separation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.252,
    "end": 898.29,
    "text": " so we identified six ways to to represent repetition suppression either we have global so the red one represents the after repetition what happens to the neural tuning curves after repetition so either the global everything is suppressed or everything is sharpened become narrower",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.709,
    "end": 906.456,
    "text": " Or we have local, the stimulus of interest, the effect will be more concentrated on the stimulus of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.476,
    "end": 913.462,
    "text": "Or we have remote, the effect will be more concentrated on the neurons that are far away from the stimulus of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.564,
    "end": 919.547,
    "text": "So for the completion, we actually examined six other models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 920.048,
    "end": 928.615,
    "text": "We call them shifting models, but they are not important because we don't think our brain will behave like that, but just for completeness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.713,
    "end": 943.338,
    "text": " So for those who want to do a mathematical modeling, it's just like for here, G is the tuning curve, which is represented by x and mu, which is the mean of the tuning curve, and sigma, which is how much narrow is the tuning curve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.739,
    "end": 948.407,
    "text": "And then we multiply it by a factor, which is C. That's the suppressing factor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.787,
    "end": 951.632,
    "text": "So in local scaling, we suppress the tuning curve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.612,
    "end": 958.847,
    "text": " In sharpening models, we suppress the sigma or how much narrow it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.288,
    "end": 962.815,
    "text": "And then in shifting models, we shift the tuning curve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.017,
    "end": 971.713,
    "text": "So for more technical details, you can actually go to our paper and see more details about how did we simulate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.997,
    "end": 977.61,
    "text": " As I said, we have two datasets, the phase dataset and the grading dataset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 977.63,
    "end": 984.505,
    "text": "So what we want, we want to see if we can use our simulations to match our findings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.7,
    "end": 991.187,
    "text": " And actually using functional MRI, we actually identified some other features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.347,
    "end": 995.813,
    "text": "We didn't only use repetition, suppression and classification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.314,
    "end": 1007.088,
    "text": "We identified six more data features and we want to see if we can actually use the simulations to explain that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.188,
    "end": 1010.492,
    "text": "And the results which we found was very, very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.658,
    "end": 1030.742,
    "text": " so these green uh circles it means that that specific model so remember we we examined 12 models in total 12 different models so if it is green it means this model can explain this functional mri feature",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.722,
    "end": 1032.865,
    "text": " If it's red, it means it can't explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.325,
    "end": 1041.736,
    "text": "So for global scaling, you can see it can explain a lot of features, but except BC, which I didn't have time to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.677,
    "end": 1044.739,
    "text": "These are functional MRI features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.82,
    "end": 1047.463,
    "text": "You can see this is the data and we are trying to fit it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.607,
    "end": 1053.27,
    "text": "So the interesting thing is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.402,
    "end": 1069.504,
    "text": " you only see local model local scaling can actually explain all the features so you don't see any red circles here for both deficits so it can qualitatively explain all the features that we saw in our data",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.484,
    "end": 1090.345,
    "text": " all the other models they they can individually they can explain individual features for example here sharpening model can explain repetition separation can explain within correlations can explain between correlation but it can't explain for example the features of sharpening in our phase data set",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.472,
    "end": 1103.523,
    "text": " So the short story long, as the long story short story, we find that local scaling best represent the findings of our data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1103.543,
    "end": 1120.399,
    "text": "So basically the local scaling, it means that the best model is the model that actually predict when we repeat the neuron that are selective to that feature, it will be suppressed the most, not global and not sharpening,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.379,
    "end": 1137.122,
    "text": " the the suppression of the neuron that so basically what that means if you see a horizontal orientation the neurons that are specific to this uh horizontal orientation they will be suppressed more the more selectivity to that they will be more suppressed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.608,
    "end": 1141.094,
    "text": " that there are two reasons we like the results like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.695,
    "end": 1161.81,
    "text": "So basically later on the paper, which we actually, it was just later, they did similar simulation to us, and they actually found similar conclusions that this model, this new one is, this model is best explains our dataset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1163.579,
    "end": 1172.59,
    "text": " So the reason we like local tailing or dampening, it's because it's very parsimonious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1173.23,
    "end": 1179.538,
    "text": "It can be explained easily without instigating complicated explanations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1179.618,
    "end": 1183.703,
    "text": "So basically, it just means that synaptic fatigue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.163,
    "end": 1189.249,
    "text": "So when you stimulate a neuron, when a neuron is stimulated, it will get tired.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.55,
    "end": 1206.31,
    "text": " then it will be more suppressed when you repeat something so this is a parsimonious explanation and the second reason why we like this result because now i'm trying to connect it with predictive coding literature and with the free energy principle first with the predictive coding literature",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.897,
    "end": 1233.951,
    "text": " we think this result is more in line with web because you see in in predictive coding literature you usually see this image a lot you will say oh you have a stimuli and then you have a prediction the lower upper level of your brain try to predict and there will be an error and you have a prediction error so the question is not what this prediction error represents we think that these results will tell us that the prediction error is the unexplained data so it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.931,
    "end": 1262.841,
    "text": " nowhere says that the prediction error is the noise it's usually the non-explained stimuli so the part that you can't explain and that we think is actually more in line with with the suppression with the with this model i will actually come back to this uh later uh but but uh first i want to talk about so we established that our brain is a prediction machine and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.243,
    "end": 1272.862,
    "text": " And the results in our functional MRI actually supports that our brain seemingly is not interested in expected stimuli because it has predicted that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.683,
    "end": 1275.908,
    "text": "Our brain is trying to predict the unexpected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.208,
    "end": 1282.821,
    "text": "That's why more activity is being exploited for novel and unexplained stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.801,
    "end": 1286.27,
    "text": " So what's the enemy of prediction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.37,
    "end": 1297.097,
    "text": "So if our brain is a prediction machine, what are the obstacles in front of our ability or our brain to predict things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1298.039,
    "end": 1301.463,
    "text": " So I will tell you a story that I faced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1301.483,
    "end": 1304.127,
    "text": "I'm usually interested to train MRI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.527,
    "end": 1310.315,
    "text": "At some point of my life, I was trying to train a neural network to predict Mandelbrot set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.635,
    "end": 1320.648,
    "text": "And the reason why I thought Mandelbrot set is more interesting than language predictions predicting the next token, because from Mandelbrot, you actually know the ground truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.828,
    "end": 1326.375,
    "text": "The ground truth is, actually, if you copy this JavaScript line into JavaScript,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.355,
    "end": 1327.756,
    "text": " it will produce a Mandelbrot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.797,
    "end": 1329.078,
    "text": "It's very, very easy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.238,
    "end": 1331.761,
    "text": "It's a few lines of code, just one equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.221,
    "end": 1332.802,
    "text": "It will produce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.822,
    "end": 1336.726,
    "text": "And then when you change these numbers, you can zoom in to this Mandelbrot set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.607,
    "end": 1340.93,
    "text": "So for Mandelbrot set, I know actually what's the ground truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.251,
    "end": 1343.153,
    "text": "It's not like the language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.273,
    "end": 1346.136,
    "text": "For language, I don't know what's the best ground truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.336,
    "end": 1347.838,
    "text": "Is my sentence is the best?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.298,
    "end": 1349.499,
    "text": "Is your sentence?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1349.539,
    "end": 1352.042,
    "text": "Which phrasing is the ground truth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.022,
    "end": 1356.866,
    "text": " So it's very difficult to identify the ground truth in language models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.906,
    "end": 1360.429,
    "text": "But for Mandelbrot, we know what's the ground truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.449,
    "end": 1364.773,
    "text": "And that's why I was interested to train neural networks to predict Mandelbrot's set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.435,
    "end": 1377.084,
    "text": "So the surprising thing for me, I thought this will be easy because Mandelbrot has a lot of regularities, a lot of places where it repeats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.404,
    "end": 1381.067,
    "text": "So I thought this will be an easy task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.047,
    "end": 1405.941,
    "text": " i was shocked i mean even when i used a neural network with very very big size to predict different parts so you can train a neural network to do to predict that specific part that's easy but when you want to generalize it will be very difficult the reason is because i was underestimating motherboard there are it's true that there are a lot of regularities but the more you zoom in there are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.921,
    "end": 1423.17,
    "text": " there will be always new features it's mind-blowing how this simple line of recursive they will always present you with something new that your model or the neural network no matter how good how good is trained it can't predict any anything so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.062,
    "end": 1430.434,
    "text": " So the puzzle for me, actually, we know that recurrent neural networks are Turing-complete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.454,
    "end": 1436.406,
    "text": "So it is possible that you can train a neural network to simulate that code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.167,
    "end": 1441.395,
    "text": "But in that case, the neural network will not help you in degradation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.436,
    "end": 1444.281,
    "text": "It will just simulate the same code for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.261,
    "end": 1459.283,
    "text": " the the main hope that we have with neural network is that we predict ahead of time we predict two steps ahead of time or three steps ahead of time not not just recursively uh predict one step because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.263,
    "end": 1481.305,
    "text": " that's what uh which i came later on on computational it's the first of that uh so so before coming to computational irreducibility so this is my first time when i saw there is a challenge in prediction it's it's it's it's very difficult uh to predict these intricate features never ending emergent patterns",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.963,
    "end": 1492.89,
    "text": " So one of the reasons, this is phrased by Stephen Wolfram, is the principle of computational equivalence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.93,
    "end": 1509.906,
    "text": "So basically, if you manage to train a recurrent neural network to simulate the same rule that actually generates Mandelbrot, it means that at the underlying level, they are doing the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1509.966,
    "end": 1512.068,
    "text": "They are doing the same computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.385,
    "end": 1533.786,
    "text": " so you basically according to this principle you cannot simulate a rule with another rule that are more efficient that basically if you if you simulate them at their most basic level so you can simulate rule a with rule b and then rule b can actually predict two steps ahead of rule b that's not possible",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.492,
    "end": 1542.421,
    "text": " So this may be difficult to understand, but the way Stephen Wolfram did it, he explained that in his TED talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1543.302,
    "end": 1552.852,
    "text": "So he actually, so basically in his TED talk, he was like, I'm paraphrasing, he was like saying, okay, you have this simple rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1552.912,
    "end": 1555.175,
    "text": "So this is just like a Mandelbrot rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.195,
    "end": 1560.04,
    "text": "You just give this rule to computer and then it will produce for you a pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.481,
    "end": 1562.743,
    "text": "These are step-by-step patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.723,
    "end": 1569.789,
    "text": " And then it will tell you if you could, is it possible to predict ahead of time just from knowing the rule?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.809,
    "end": 1573.612,
    "text": "I mean, you know the rule, just like we know the theory of everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.213,
    "end": 1580.659,
    "text": "Can we actually predict ahead of time without simulating the intermediate steps?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.679,
    "end": 1588.726,
    "text": "And I actually don't know if it's true or not, but I believe that because Stephen Wolfram has spent like his decades of his life trying to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.286,
    "end": 1591.448,
    "text": "And he says that this is not possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.934,
    "end": 1595.258,
    "text": " You have to compute all the steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.419,
    "end": 1596.861,
    "text": "You have to compute all the steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.582,
    "end": 1599.304,
    "text": "And he even put a price for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.165,
    "end": 1613.503,
    "text": "The reason why I believe computational irreducibility principles should be, it must be true, because in essence, it's similar to two other principles, Godel's incompleteness theorem and the halting problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.483,
    "end": 1623.247,
    "text": " In spirit, if you think more about it, you will see that these are all talking about probably the same phenomena, but in different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.47,
    "end": 1628.34,
    "text": "So what I learned is that complexity is easy to generate, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.781,
    "end": 1631.307,
    "text": "It was a very shocking thing for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1631.287,
    "end": 1640.516,
    "text": " But I have been simulating these simple rules for a while, and they always surprise me what they can produce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.536,
    "end": 1643.139,
    "text": "Very simple rules, you fine tune them, and you can generate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.619,
    "end": 1645.881,
    "text": "But the problem is it's hard to understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.001,
    "end": 1655.21,
    "text": "And this is because of that principle which was formulated by Stephen Wolfram, which says computational irreducibility principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.23,
    "end": 1660.095,
    "text": "So basically, let's say we have two systems, system one and system two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.075,
    "end": 1662.138,
    "text": " And then system one tries to predict system two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.178,
    "end": 1671.373,
    "text": "So if system one can predict system two with less computational power, then we can say that system two is reducible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1672.054,
    "end": 1679.586,
    "text": "And this system one is analogous to our brain and system two is analogous to the environment and the world which we are trying to learn about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.764,
    "end": 1690.899,
    "text": " So what Stephen Wolff found that he examined so many different rules and the reason why he examined actually cellular automata because of their simplicity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.48,
    "end": 1697.929,
    "text": "So what he found that is each rule are producing unique patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.909,
    "end": 1705.68,
    "text": " So actually, by looking at these patterns, you can see what computational equivalence means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.78,
    "end": 1713.351,
    "text": "It just means that you can stimulate, for example, this pattern using another rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.512,
    "end": 1718.338,
    "text": "Now, there are some rules that are faster than itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1718.618,
    "end": 1719.299,
    "text": "That's what I mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.12,
    "end": 1725.047,
    "text": "Now, there are rules that are truly complete, like the rule 110.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.668,
    "end": 1734.145,
    "text": " But even if you manage to initialize the rule number 10 to produce another rule, it will not produce it faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.345,
    "end": 1737.732,
    "text": "I mean, you can't use it two steps ahead of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.193,
    "end": 1745.668,
    "text": "So some of these rules will be trapped into repetition and some of these rules will never be able to predict what comes next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.644,
    "end": 1749.649,
    "text": " And I thought there is another phenomena like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.45,
    "end": 1753.675,
    "text": "It's the irrational numbers versus rational numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.835,
    "end": 1756.8,
    "text": "They are actually similar to that because we have irrational numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.84,
    "end": 1762.068,
    "text": "And their definition is, if you go to the definition, they will never trap into repetition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.108,
    "end": 1764.312,
    "text": "So we have pi, which is a very simple rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.332,
    "end": 1766.896,
    "text": "It's just the circumference divided by radius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.916,
    "end": 1768.478,
    "text": "It's a very, very simple rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.498,
    "end": 1772.905,
    "text": "If you simulate that rule, it will always give you a new pattern, a new number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1772.885,
    "end": 1789.645,
    "text": " the same for the square root of two three so this is amazing i mean i i don't know why i didn't thought about that before stephen wolfram talking about uh cellular automata thing because i thought like these are actually have the same amazement so if you have a generative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.625,
    "end": 1795.896,
    "text": " And actually, we usually talk about universality, Turing complete universality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.916,
    "end": 1804.15,
    "text": "So they will tell you if you have an infinite tape, and if you have a reader, a writer, and specific rules, you can compute everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.29,
    "end": 1808.157,
    "text": "And they will call that Turing complete universality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.137,
    "end": 1838.143,
    "text": " now according to steven more from he actually revised the what what does it mean by computation or universality so so he usually uh explains that in the term of cellular automata but i will try to explain that in in the term of rational and irrational numbers so it's actually a bit mind-blowing but we we usually don't think about it like that so let's say pi that's the definition a definition means this rule will never trap interest unlike the rational rules so the rational uh numbers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.123,
    "end": 1847.408,
    "text": " if you divide them at some point they will repeat they will repeat they will never give new patches but but irrational numbers so that means",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.08,
    "end": 1876.281,
    "text": " if you if you compute pi for infinity it is possible that at some point you will find the same pattern that the square represents the square root of two so so if you if you compute pi for infinity it's possible that you can find a space of one one one one one but but it will never trap into that option at some point it will it will change so so that means in every irrational number you have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.261,
    "end": 1887.351,
    "text": " The other irrational numbers embedded in it, there is no way to say this is not true, because if you say this is not true, it means that these patterns will be trapped at some point into a cyclic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.141,
    "end": 1910.993,
    "text": " repetition but if they don't trap they will always give you novelty and that means so someone can tell you pi is too incomplete why because he says like if you if you if you keep computing pi for infinity at some point you will find that it computes my genetics the same sequence that if you represent it as a number and i i mean you can say this is not true",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.496,
    "end": 1912.137,
    "text": " Can you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.257,
    "end": 1914.441,
    "text": "I mean, do you have a comment, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.461,
    "end": 1916.764,
    "text": "Oh, it's a great connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.805,
    "end": 1925.198,
    "text": "It just makes me think like within Pi is every possible operating system, every possible note file you could write to yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.378,
    "end": 1928.083,
    "text": "So it's like it contains all of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.624,
    "end": 1933.251,
    "text": "And also it's a great connection with the computational classes from Wolfram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.67,
    "end": 1960.977,
    "text": " exactly exactly because going off from usually represents a rule number 30 it says that oh this rule number 10 you can see all patterns are there so if you go for infinity i think it's a computational universality is there it's just you just can't formalize and i think it's the same to be quite honest i mean if you go if you say it's it doesn't repeat it means that it uh even though the rule is very simple five is the simplest possible rule it's just a certain price divided by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.957,
    "end": 1987.707,
    "text": " radius it's as simple as possible and then you have unimaginable sequence patterns so okay this is interesting but this is also problematic because it tells you a prediction with 100 accuracy is impossible remember we talked about the super intelligence we say that oh agi is is actually near but many people will say oh if agi is near then we will have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.687,
    "end": 2014.572,
    "text": " intelligence asi artificial super intelligence will be just in the corner about the corner i don't think so because of computational disability it means that agi will also face the same problems that the problem is you have to compute to beat this system you have to you have to have a universe-sized computer that simulates our universe faster and i don't think agi can have that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.552,
    "end": 2029.354,
    "text": " because it lives in the same environment like us, so that it reaches the same ceiling that we actually reached, which means that at the age of unknowledge, at the age of uncertainty, the AGI will also suffer from uncertainty, just like us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.815,
    "end": 2049.773,
    "text": " So, okay, so I talked about that, that even if we know the rule of everything, so I was, when I was younger, I was always following the physics news because I was very, very happy to see if a physicist will find the theory of everything because I thought, oh, it's even...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.753,
    "end": 2056.66,
    "text": " If Stephen Hawking can find the theory of everything, that will be the happiest day because we can explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.081,
    "end": 2059.083,
    "text": "But now I see this is not possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.283,
    "end": 2067.132,
    "text": "I mean, even if you know that, even if you put theoretically, I thought like this is the difficult part, but this is not even the difficult part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.372,
    "end": 2078.764,
    "text": "Even if we say this is easy, we have all the atoms, the state, their velocity, their position inside our computer, or even if we have a very powerful computer, that computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.744,
    "end": 2107.806,
    "text": " that compute and predict the next state it will just produce the next update which is the next picosecond or whatever is the smallest type of the plank level so that means it means to to simulate to predict the future you have to simulate the future you have to simulate the present faster than the universe and that's impossible unless we are outside the universe and we have we can somehow simulate everything faster than our universe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.765,
    "end": 2137.05,
    "text": " so okay so how do we how do we do that i mean in the beginning i told i told you that our brain is a prediction machine you know we can predict things so how prediction is possible in this system the only way i can think that prediction is possible is because two things memorization and abstraction the reason why i didn't put memorization before abstraction because memorization is not very without abstraction memorization is not useful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.03,
    "end": 2147.407,
    "text": " Because memorization, it means if something repeats, then if you memorize it later on, you just catch that, and if something catches that, it will be computationally very easy to read it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.687,
    "end": 2153.757,
    "text": "But that will be possible if we live in a computationally reducible universe, if something repeats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.737,
    "end": 2155.079,
    "text": " Memorization will be great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.46,
    "end": 2162.291,
    "text": "But if we live in a computationally irreducible where there is always emergent pattern, memorization doesn't help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.331,
    "end": 2170.525,
    "text": "The reason is because you should have infinite sized memory to store all the emergent patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2171.046,
    "end": 2175.373,
    "text": "You have to have abstraction with memorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2175.809,
    "end": 2184.182,
    "text": " Just like, so remember that previously before AI, people stored pixels inside the computer just using memorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.202,
    "end": 2190.973,
    "text": "But what neural networks does is they memorize, but not just using that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.133,
    "end": 2194.138,
    "text": "It will abstract the information before memorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.253,
    "end": 2197.717,
    "text": " So you just don't memorize the data like itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.757,
    "end": 2200.781,
    "text": "You have to find a way to find the useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.702,
    "end": 2203.444,
    "text": "So that's the formal definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.524,
    "end": 2205.667,
    "text": "I actually gave that to Jack Chifty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.687,
    "end": 2216.059,
    "text": "And that system, which I like it actually more than the Wikipedia definition, is the process of reducing complexity by focusing on main ideas and acknowledge specific details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.079,
    "end": 2219.824,
    "text": "So that's the only way that we can beat the computational irreducible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2219.884,
    "end": 2223.568,
    "text": "It's just we pay attention to what matters for our survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.168,
    "end": 2229.492,
    "text": " So you can see I am trying to actually reconnect back to the active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.585,
    "end": 2232.027,
    "text": " So there are many ways to abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.047,
    "end": 2234.391,
    "text": "There are many different algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.411,
    "end": 2239.699,
    "text": "But I think the easiest one is that's what they usually introduce you in category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.719,
    "end": 2244.065,
    "text": "They just say, oh, we just gave the same name to everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.285,
    "end": 2246.809,
    "text": "So let's say we have Bob, Ali, Joe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2246.829,
    "end": 2255.462,
    "text": "And if you even want to do statistics or if you want to find any relationship, we just need to group things according to their similarity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.442,
    "end": 2284.656,
    "text": " so similarity is actually a very complex topic it's not just easy to say according to similarity but but they will be right now so coarse graining is actually simpler because coarse graining you group things according to proximity proximity is easier to define that similarity you just say if things they have a euclidean distance them a specific threshold you just group them so coarse graining actually used everywhere i i'm surprised because grain is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.94,
    "end": 2289.385,
    "text": " not so much well known, but it's used everywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.046,
    "end": 2293.45,
    "text": "Another thing which may be more familiar to your group is Markov Blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.59,
    "end": 2297.354,
    "text": "I think Markov Blankets is also a more sophisticated way of abstraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.576,
    "end": 2306.325,
    "text": "The reason why Markov, for example, here you see these nodes, the parent nodes, the children nodes and the partner nodes, and the internal nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.345,
    "end": 2312.392,
    "text": "So when the Markov Blanket becomes stable, you can just treat this as one entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.412,
    "end": 2313.293,
    "text": "So just like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.273,
    "end": 2336.395,
    "text": " another way of abstraction so we say anything inside this membrane is just one entity anything inside this house the house is one entity with everything that happens inside I don't care about only when somebody comes outside the house I should care about but when they are inside about I should just look at the house so my point is that the stable membranes can abstract things for us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.539,
    "end": 2345.99,
    "text": " Linear regression is another way to abstract information, but linear regression is just a more sophisticated way of coarse-graining because we are using a weighted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.351,
    "end": 2357.505,
    "text": "In coarse-graining, we just average the nearby information, but here we are doing weighted summation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.987,
    "end": 2360.629,
    "text": "So we have neural networks as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.669,
    "end": 2364.154,
    "text": "Neural networks are the most sophisticated way of abstraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.134,
    "end": 2391.053,
    "text": " so far uh so so coarse graining let me just give you a bit about coarse grain the importance of course gaining so i mean it's self-explanatory you just average the nearby pixels or the nearby uh so so what i think about uh talk about uh why coarse grain is important there is a simulation called part life simulation i have a video about that a little bit but let me just i don't know why this particle simulation is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2391.033,
    "end": 2418.255,
    "text": " more uh familiar among the scientists uh it's it's actually a more interesting extension of the game of life i don't know who invented that but there are old videos uh seven years ago doing these particle simulations i didn't have the code back then when i wanted to re-stimulate that so i improvised the code and i was shocked the reason why i i just wanted to simulate a primordial soup",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.235,
    "end": 2422.18,
    "text": " where you have some particles attracting each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.24,
    "end": 2424.824,
    "text": "So you can see these few lines of code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.745,
    "end": 2432.975,
    "text": "These few lines of code just represent particles attracting to each other according to Newton's law, something similar to Newton's law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.995,
    "end": 2442.167,
    "text": "So the inner loop here just says if the distance is this, you have an attraction force or a repulsion force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.147,
    "end": 2451.636,
    "text": " parameterized by G. So the G parameter actually determines the attraction of repulsion forces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.996,
    "end": 2454.578,
    "text": "So just less than a page of code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.399,
    "end": 2458.662,
    "text": "And when you have this rule, you can simulate this rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.882,
    "end": 2465.428,
    "text": "For example, you can specify how green particles attracted to each other and how red particles attracted to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.448,
    "end": 2470.753,
    "text": "So just a few lines of code, and you will have so many interesting patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2470.733,
    "end": 2494.075,
    "text": " so many interesting patterns so so we we have made a c plus plus software about that it's available on our github uh so it's it's just amazing how complexity is easy to generate so you just have these parameters are just attraction and reposition between different color particles so so you just define how much red particles attracted to read particles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2494.055,
    "end": 2517.143,
    "text": " and then you let the simulation run and you will as you fine tune this so maybe maybe if you are interested i can give you a live demo is it possible is it okay oh yeah okay so so so so if you go to the github uh there is actually a link a javascript uh let me let me reshare the screen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.294,
    "end": 2532.9,
    "text": " Okay, so you can see the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.361,
    "end": 2545.458,
    "text": "Okay, so if you go to the GitHub, Hunerp4321 Particle Life, and then we have a downloadable version, so you can download it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.938,
    "end": 2548.362,
    "text": "And we have an online version, a 2D online version.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.382,
    "end": 2550.945,
    "text": "So let me just open the 2D online version.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.406,
    "end": 2552.968,
    "text": "I hope you can still see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2553.826,
    "end": 2573.421,
    "text": " do you see it or should i yep and i'm also pasting it in the chat so people can go to it okay so the interesting thing is so you see i i will just so here are the parameters so i'm trying to change the parameters but even if you push the random button so here is a random button",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2573.806,
    "end": 2578.53,
    "text": " So this random button will just randomly revisit the attraction and repulsion force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.031,
    "end": 2585.337,
    "text": "So even if you push the random button, you can still see interesting patterns emerging on the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.357,
    "end": 2590.122,
    "text": "So let me zoom in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2590.302,
    "end": 2593.745,
    "text": "So you can see I'm just now pushing the random button.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.765,
    "end": 2602.193,
    "text": "And you see cellular things like very, very interesting things coming to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.008,
    "end": 2608.051,
    "text": " So we will come soon to Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.091,
    "end": 2610.294,
    "text": "You'll see that Markov blanket is very natural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2610.374,
    "end": 2619.144,
    "text": "It's something, when you have local rules, that's what Carl Froston usually says, when you have local rules, there will be always a Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.164,
    "end": 2625.111,
    "text": "So because we have local rules, so the attraction and repulsion rules, they have a threshold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.131,
    "end": 2629.335,
    "text": "So you usually see this particle can attract this particle, but there is a circle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.676,
    "end": 2631.758,
    "text": "It can't attract very far particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.738,
    "end": 2637.688,
    "text": " the same power as the nearby particles, just like in real life, just like the gravity in real life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.068,
    "end": 2639.451,
    "text": "So you can let these systems evolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.471,
    "end": 2650.489,
    "text": "They will produce, but what interests me is even if you push the random buttons, the random, these random rules, push it and you will have interesting patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.207,
    "end": 2678.147,
    "text": " wow right there just like these chasing chasing around so now you see a bit a bit stability now you can see a stability but this stability will not go forever because of computational industry sometimes something comes to disturb the system so now they have a market blanket they live happy they they have their internal system but at some point you see this okay now the system is disturbed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2678.836,
    "end": 2681.779,
    "text": " So they lived for a period of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.5,
    "end": 2686.945,
    "text": "They have nice mark of blanket, but then something outside happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.965,
    "end": 2687.466,
    "text": "We don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.047,
    "end": 2702.083,
    "text": "That's the halting problem is could you look at this at a given time, all the rules, every single particle state, all the rules, could you say what the final endpoint will be or what will happen in a certain number of steps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.583,
    "end": 2708.37,
    "text": "And you might have a heuristic, but you can't know without actually going through the procedure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.042,
    "end": 2730.173,
    "text": " without actually going to know it would be in simulating the system i mean if why if i want to predict the future i have i should have a supercomputer that is faster than this i should put the initial settings and the supercomputer can simulate the system faster than me but but if i am living inside this system i don't have this leisure to to simulate the system faster than itself so how do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.153,
    "end": 2754.253,
    "text": " oh one other one other interesting piece there which you brought up a few times with like having a more powerful computer somehow outside the system so as you start to look deeper and deeper into futures it's almost like the procedure has run time n like it's just whatever complexity class it is it's just one or x but if you start looking further and further ahead",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.233,
    "end": 2780.646,
    "text": " there are more and more adjacent possible so that you actually it's like trying to run up a wall that's getting exponentially steeper because the the faster supercomputer even if it's it's a million times faster but then if it starts looking several time steps ahead each of those time steps have a bigger and bigger adjacent possible so eventually that one million fold increase gets eaten up pretty fast yes yes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.959,
    "end": 2790.253,
    "text": " Yes, so that's why I think this part, I actually can't trust the newspaper that it has a primordial suit, but they usually I think it uses MATLAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.654,
    "end": 2797.285,
    "text": "And then so I mean, people nowadays usually use more sophisticated tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.265,
    "end": 2799.549,
    "text": " that have nicer visualizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.73,
    "end": 2805.32,
    "text": "And you actually couldn't find these interesting patterns if you didn't have a real system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.661,
    "end": 2814.818,
    "text": "So when I was coding this system, it's impossible to find interesting patterns without having a GUI system to explore easily in real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.798,
    "end": 2842.206,
    "text": " uh and that's what made us discover so many many interesting patterns so now there are other systems that are similar to it actually i think there is a system called lenya which are smoother i think it's also very interesting but the reason why i like that it's very naturally connected to mark of blankets and and active energy so so i will actually now go to to what we can actually elicit from these systems and how can how can we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.186,
    "end": 2850.113,
    "text": " do abstractions and how can we reconnect what we have learned to our findings that I explained in the beginning of the video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.133,
    "end": 2854.477,
    "text": "So let me reshare my screen again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.141,
    "end": 2861.243,
    "text": "So I'm sharing the slides again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.771,
    "end": 2871.973,
    "text": "Okay, so you can see the slides again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.19,
    "end": 2872.43,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.692,
    "end": 2873.953,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.253,
    "end": 2877.999,
    "text": "So you saw, like these parameters, I found these interesting patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.66,
    "end": 2885.27,
    "text": "But somebody can't reproduce it if I download the software, the C++ one, not the online one, because the C++ one is more powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.29,
    "end": 2890.798,
    "text": "You can simulate more particles without the, I mean, the computer can't handle it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.399,
    "end": 2894.123,
    "text": "So you can find amazing, amazing patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.165,
    "end": 2898.049,
    "text": "And this is just four particles, four color particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.109,
    "end": 2901.454,
    "text": "I mean, you can go five color particles, six color particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2901.974,
    "end": 2917.013,
    "text": " okay so why so my point is how how how coarse graining can help us uh in in this case so let's say uh i mean this bug shape to be quite honest i actually produced this bug shape from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.904,
    "end": 2921.63,
    "text": " So this is also not the profile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.67,
    "end": 2923.512,
    "text": "The profile is just for the illustration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.113,
    "end": 2928.079,
    "text": "But this bug, which you can see, this is from the particle life simulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2928.56,
    "end": 2931.584,
    "text": "This is, believe it or not, just from these rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.466,
    "end": 2935.049,
    "text": "And it accidentally happened to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.069,
    "end": 2938.174,
    "text": "So green attracts to green with this power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.154,
    "end": 2940.96,
    "text": " green attracts red or repuffs red.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.301,
    "end": 2944.909,
    "text": "I forget whether the negative is attraction or the positive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.35,
    "end": 2951.823,
    "text": "But these simple rules of attractions, it can produce you this flying shape, a bug-like flying shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.425,
    "end": 2955.792,
    "text": "So this is some screenshots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.075,
    "end": 2957.196,
    "text": " how it flies around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.736,
    "end": 2963.181,
    "text": "So my point is that let's say this frog is inside this system and it's a predator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.221,
    "end": 2967.064,
    "text": "It wants to predict because without prediction, you can't catch this bug.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.605,
    "end": 2969.166,
    "text": "You can't catch this bug.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.186,
    "end": 2971.088,
    "text": "But the frog is inside the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.208,
    "end": 2975.872,
    "text": "According to computational pre-reducibility, it can't stimulate the system faster than itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.892,
    "end": 2976.632,
    "text": "So it can't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.213,
    "end": 2980.896,
    "text": "The only way it can do is does some way of abstraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.256,
    "end": 2983.879,
    "text": "And the easiest abstraction, as we say, is coarse graining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2983.979,
    "end": 2985.66,
    "text": "So if we do coarse graining,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.64,
    "end": 2991.63,
    "text": " So here I did course going, this is not a simulation, it's just illustrations because, but I think it's trivial to understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.311,
    "end": 2995.957,
    "text": "So now the number of particles becomes 70 particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.278,
    "end": 3004.651,
    "text": "So if the brain of the frog, it just samples the, it just didn't sample all the 600 particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.972,
    "end": 3007.175,
    "text": "It just samples based on locality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.195,
    "end": 3011.783,
    "text": "I mean, local things, sample them and then,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.556,
    "end": 3018.005,
    "text": " In the future, I mean, repetitively, local things will be aggregated together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.045,
    "end": 3020.109,
    "text": "You will have a coarse-grained image.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.53,
    "end": 3024.076,
    "text": "And this coarse-grained image is very, very easy to simulate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.096,
    "end": 3030.767,
    "text": "For the frog, now it deals with 70 particles instead of 600 particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3030.747,
    "end": 3043.879,
    "text": " and that's why maybe even if the frog is inside the system it can actually predict the simulation of course it won't be exactly the same simulation because we are simulating a coarse-grained world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.737,
    "end": 3050.245,
    "text": " But it will be close enough for the frog to survive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3050.585,
    "end": 3055.452,
    "text": "So if you do the real simulation, the bug maybe go this way and then go this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3055.472,
    "end": 3062.042,
    "text": "But if you do the coarse-grained simulation inside the brain of the frog, it may predict a different path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3062.082,
    "end": 3068.01,
    "text": "But if the path is close enough for the frog to survive, then that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.99,
    "end": 3071.093,
    "text": " what we come here into a very interesting conclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.294,
    "end": 3075.739,
    "text": "Living things like a probe will value accuracy and will value efficiency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.299,
    "end": 3078.782,
    "text": "It values both accuracy and efficiency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.163,
    "end": 3087.312,
    "text": "So you see, we are closely intuitively coming to the free energy principle, which tells you you have to minimize surprise and complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.672,
    "end": 3089.714,
    "text": "That's the equation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.015,
    "end": 3091.076,
    "text": "So it's the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.116,
    "end": 3094.74,
    "text": "You can say, so let me go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.72,
    "end": 3119.007,
    "text": " actually i i explained that in the video that coarse graining is a very underrated concept it's like it's used in physics in chemistry do you know there is in physics there are so many theories under the name of effective theories they use coarse graining to explain so many things and usually you do not see physicists telling people oh we predicted that but we used coarse graining",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.987,
    "end": 3133.671,
    "text": " i i saw that this is like hiding a different fact because we usually talk about uncertainty principle and things like that okay but you use you use coarse graining coarse grain is part of uncertainty so so in this simulation now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.242,
    "end": 3142.197,
    "text": " It's true that we can predict the bug, but now we are less certain about the individual particles because we did coarse graining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.217,
    "end": 3149.051,
    "text": "But that was okay for us because the aim of the probe is to predict the whole system, not the individual particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.492,
    "end": 3155.423,
    "text": "So I'm actually surprised why physicists usually don't explicitly say, hey, we used coarse graining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3156.55,
    "end": 3158.612,
    "text": " So they use everything to be quite honest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.632,
    "end": 3172.688,
    "text": "So many theories of physics depend on, they just use all, even if only when you go to the details, you'll find them, they have coarse grained the system before doing the simulations, whether it's a fluid system, a particle system, anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.45,
    "end": 3176.392,
    "text": "Well, I think everything is coarse grained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.492,
    "end": 3178.755,
    "text": "I don't think we can measure anything precisely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.895,
    "end": 3181.798,
    "text": "So coarse graining is there, whether we like it or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.533,
    "end": 3184.755,
    "text": " Okay, Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.895,
    "end": 3186.878,
    "text": "I think Markov blankets is well explained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.918,
    "end": 3189.862,
    "text": "Carl Frost has many, many videos about Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.882,
    "end": 3194.268,
    "text": "So Markov blankets is a different way of abstracting information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.288,
    "end": 3201.998,
    "text": "So the nodes that are surrounding, let's say we want to predict X. So if we want to predict X exactly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3201.978,
    "end": 3219.463,
    "text": " we have to know that we have to know the position and the velocity of all the particles in the system but according to markov blanket you don't have to if you know the state of the markov blanket you only need to simulate the state but the problem is how do we know the state of the markov blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3219.443,
    "end": 3246.987,
    "text": " we know we need to know the state of their market blanket but how do we know the state of so so that will defeat the purpose and it means that we have to simulate the entire system but as i said luckily these markov blankets are sparsely connected i mean you you sometimes see uh the world the reason to be quite honest i'm still not sure why why our world is sparsely connected the only reason that comes to my mind is because we have different force ranges",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3246.967,
    "end": 3276.096,
    "text": " we have nuclear force which is very very short range we have uh electromagnetic force which is wider range we have gravity force and then because there is a speed limit of light if you combine the speed of limit of light and the the range of forces you can have various ranges of forces just like just like in our simulation so just like in our simulation so we can also say that the particle simulation is also sparsely connected because we have simulated different ranges of forces",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.076,
    "end": 3282.944,
    "text": " That's why close by particles, so they will arrange sooner to produce lumps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.986,
    "end": 3287.71,
    "text": "So that's why I think Markov blankets are possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3287.81,
    "end": 3291.975,
    "text": "Stable Markov blankets are possible because of sparsely connected system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3292.015,
    "end": 3293.457,
    "text": "Why sparsely connected system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3293.477,
    "end": 3295.459,
    "text": "Because of different range forces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.54,
    "end": 3297.862,
    "text": "That's my explanation for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.383,
    "end": 3300.065,
    "text": "And this makes prediction easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3300.085,
    "end": 3304.21,
    "text": "Now, the reason why I think this makes prediction easier",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.19,
    "end": 3314.562,
    "text": " So I will give you this example, last example of particle simulation, because to be quite honest, the reason why I like particle simulation is it gives you intuition about a lot of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3315.523,
    "end": 3322.451,
    "text": "So one of the intuitions, I usually follow up Stephen Wolfram's video and usually say, oh, I understand entropy now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.551,
    "end": 3327.477,
    "text": "I think entropy is the feature of observers because we observers are computationally limited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3327.517,
    "end": 3328.999,
    "text": "That's why entropy is there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3329.779,
    "end": 3332.863,
    "text": "I was usually thinking what the hell he's talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.704,
    "end": 3356.218,
    "text": " it's a bit so i finally have aha moment when i was trying to understand how entropy works when watching these particle systems so so let's say this was the initial uh state of the before we start the simulation this is all the particles if if somebody sees this system it says this system have high entropy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.198,
    "end": 3375.861,
    "text": " it's intuitive i mean even if we don't specifically define what's entropy here it's it this system is all sparse around different colors everywhere so if i tell you can you predict what will happen to this particle here at the middle which is circled by the where does this particle go",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3376.837,
    "end": 3378.581,
    "text": " I mean, you don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.681,
    "end": 3379.703,
    "text": "I'm sure you don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3380.084,
    "end": 3389.985,
    "text": "The reason you don't know, even you have the rule, is just your brain cannot simulate all the particles inside your brain, the forces,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.32,
    "end": 3416.833,
    "text": " you can't you can't figure out what's the direction of this particle will it go this way this way but if your brain is unlimited power i mean if you can compute all these particles right away there is no uncertainty you can tell me i know this particle will go this direction but the reason you can't tell me because you can't compute all these particles now as the system evolves like you you let the system evolve",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.725,
    "end": 3439.193,
    "text": " now we have different entities with different mark of blankets they are stable so you have chunkers so now your brain can meaningfully course grain so so you can easily course when you can say oh we have four systems and these four systems they attract everything so now if i tell you can you tell me where this dot goes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.679,
    "end": 3441.0,
    "text": " according to the attraction rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.301,
    "end": 3445.204,
    "text": "I think now you can say, you can say, oh, this thought is very close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.284,
    "end": 3446.406,
    "text": "I think it will go down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.567,
    "end": 3449.729,
    "text": "So the entropy in your brain is increased.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.749,
    "end": 3457.897,
    "text": "So the entropy, I mean, the way that the uncertainty is decreased, sorry, because now you can predict where this thought will go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3458.397,
    "end": 3469.568,
    "text": "And the reason you go, because now your brain can compute what happens because your brain chunked, coarse grained all these particles together as one entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.273,
    "end": 3476.897,
    "text": " that's because of the Markov blanket or because of these stable blankets which encapsulate these entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.398,
    "end": 3482.055,
    "text": "You treat them as one entity and the system is now become more predictable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.364,
    "end": 3487.068,
    "text": " So now you can tell these particles will go downward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.248,
    "end": 3491.373,
    "text": "And you can say this will go from high energy to low energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.654,
    "end": 3494.397,
    "text": "So basically, you can use these particle systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.798,
    "end": 3495.939,
    "text": "I actually didn't do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.159,
    "end": 3501.747,
    "text": "It's in my plan to do actual simulations, not just intuition about these systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.187,
    "end": 3509.877,
    "text": "So this is Gibbs pre-energy, in which Carl Preston actually derives from the concept of pre-energy in the living beings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.318,
    "end": 3513.342,
    "text": "It just relates entropy with enthalpy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.57,
    "end": 3522.203,
    "text": " So we know that entropy of systems increase, but local entropy, because of these local forces, local entropy decreases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.223,
    "end": 3532.14,
    "text": "But the entropy, overall entropy decreases because particles will go down and then the energy as a light will go into the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3533.082,
    "end": 3536.305,
    "text": " Basically, these simulations are so simple to capture all the details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.906,
    "end": 3540.109,
    "text": "But all the details, the global entropy either stays same or increase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.129,
    "end": 3541.691,
    "text": "But the local entropy decrease.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.711,
    "end": 3546.896,
    "text": "And that's what self-organizing systems like us, living beings, will try to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3546.916,
    "end": 3547.857,
    "text": "They will go to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.977,
    "end": 3552.862,
    "text": "So what Carl Friston does is generalize this concept to living beings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.022,
    "end": 3556.826,
    "text": "And to be quite honest, I don't know the details that he do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3556.866,
    "end": 3563.072,
    "text": "But he usually use these sequence, Langevin equations with full body attractors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.052,
    "end": 3566.316,
    "text": " Fokker-Planck equation, then he comes to the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.376,
    "end": 3571.202,
    "text": "Once it reaches the Markov blanket, it can connect to the living world, Bayesian world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3571.242,
    "end": 3576.449,
    "text": "And then we have, so these particle world can be connected with living world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.489,
    "end": 3578.411,
    "text": "That's what Carl Friston usually does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3578.892,
    "end": 3581.034,
    "text": "And the interesting thing, it's the same objective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.074,
    "end": 3591.928,
    "text": "So the high-level equation in which that Carl Friston uses, it just, you have living systems want to reduce surprise and want to reduce complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.229,
    "end": 3598.441,
    "text": " And if you remember, we told you because of computational, we want to be efficient and we want to increase the accuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.801,
    "end": 3601.967,
    "text": "So we reach the same intuition without driving it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.308,
    "end": 3605.293,
    "text": "Just because we have computation, we have to be efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3605.333,
    "end": 3606.435,
    "text": "There is no way around that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.856,
    "end": 3610.002,
    "text": "So this part and that's what makes because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.982,
    "end": 3615.569,
    "text": " Long time ago, I didn't understand what's exactly the difference between free energy principle and the predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.589,
    "end": 3619.733,
    "text": "So the main difference is that the free energy principle also added efficiency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.753,
    "end": 3629.885,
    "text": "It says that we try to predict, but we also try to be as efficient as possible, as simple as comes principle way, or the least action way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.386,
    "end": 3632.809,
    "text": "So it tries to reduce the complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3632.929,
    "end": 3639.837,
    "text": "And I think the reason why we want to reduce the complexity is because we have competition in relation to principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.15,
    "end": 3665.25,
    "text": " so now we come to active in france because according to active in france there is a trick we can do we can not only predict the system by learning about it we can actually be participate in the system so so you either learn from the world uh which i call the bottom up system or teach the world is the one that means you you are trying to change the world so just like if you go back to this to this particle it's just like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3665.23,
    "end": 3674.263,
    "text": " You see, so this particle either attracts the entire system to itself, or either the particle goes to the bigger system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3674.583,
    "end": 3676.345,
    "text": "So we individuals also do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.686,
    "end": 3681.533,
    "text": "Either we are trying to change the community, or either we adapt to the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.553,
    "end": 3683.335,
    "text": "And we usually have to do the later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3683.475,
    "end": 3685.919,
    "text": "The majority of us will be just slaves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.979,
    "end": 3688.843,
    "text": "We will just say, we can't change the world usually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3689.343,
    "end": 3694.09,
    "text": "But I think the analogy is very easy to see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3695.96,
    "end": 3722.575,
    "text": " so so there are a lot of questions uh so i i usually usually this question comes up if we try to predict the systems why we just don't go to the dark room uh i still i i also see the answer to this from the computational irreducibility principle because your computation doesn't let you there will be always emergent factors so locally you can do that as an individual but collectively we can we can do that because the system will always change",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3722.555,
    "end": 3723.657,
    "text": " This is analogous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.277,
    "end": 3726.961,
    "text": "Another example which I like, I don't see it's used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.021,
    "end": 3728.884,
    "text": "Why we don't use fascism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3728.984,
    "end": 3732.149,
    "text": "Because fascism actually makes the system predictable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.589,
    "end": 3734.933,
    "text": "Everything behaves according to some order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.953,
    "end": 3741.542,
    "text": "I mean, we can use a less inflammatory word than fascism, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3742.023,
    "end": 3743.445,
    "text": "Actually, people do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.465,
    "end": 3749.153,
    "text": "I mean, you can see religion as a way to make everything predictable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.133,
    "end": 3752.956,
    "text": " If you follow a community, a strict community, they will tell you, you should behave that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.197,
    "end": 3753.857,
    "text": "You should do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3754.017,
    "end": 3755.118,
    "text": "The whole day will come that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.138,
    "end": 3756.9,
    "text": "So everything will become predictable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.3,
    "end": 3763.085,
    "text": "And that's why these systems sometimes are appealing for people, because it encapsulates the idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3763.426,
    "end": 3767.609,
    "text": "But the problem with that, again, computational doesn't let you live that forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3768.55,
    "end": 3771.052,
    "text": "You will be trapped with a local maxima.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.213,
    "end": 3773.074,
    "text": "And you can do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.134,
    "end": 3777.418,
    "text": "You can live in this predictable system for years, for thousands of years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3777.398,
    "end": 3780.585,
    "text": " The outside world will always change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.046,
    "end": 3786.998,
    "text": "And at some point, these changes will either affect you collectively or individually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3787.098,
    "end": 3788.822,
    "text": "That's why we have to change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3789.343,
    "end": 3792.65,
    "text": "That's why we have curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3792.69,
    "end": 3793.872,
    "text": "We want to learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.852,
    "end": 3803.771,
    "text": " So according to the simulations that have been done in free energy principle, even these particle systems, they are actually modeling the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.791,
    "end": 3812.046,
    "text": "The reason why they did that, so if you try to follow the activity of these particles, you will see they are correlating with the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.026,
    "end": 3841.476,
    "text": " if a change happens in outside you will see that a change happens in the inside so as if the inside of these entities they are trying to model and the reason why they are trying to if you see that the mark of blanket just actually just looks like a neural network so it has sensory nodes it has inter internal nodes it has active nodes so it's just like a neural network it's just like how it's trained so either use evolutionary technique to train the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.456,
    "end": 3869.151,
    "text": " some blankets survive some will not survive so we are using evolutionary technique to train it or you can use back propagation or you can use the technique that happens inside our brains although there are a lot of unknowns how the learning happens in our brain but but the thing is same so so nested levels of markov blanket you can see it as a nested level of neural networks it's same it's same level of abstraction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3870.937,
    "end": 3881.098,
    "text": " uh okay so so that's what makes us that's what i'm saying we can beat the computational irreducibility because so all the brains",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3881.517,
    "end": 3882.759,
    "text": " are local.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3882.839,
    "end": 3884.901,
    "text": "They can't compute the entire system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3884.961,
    "end": 3888.806,
    "text": "But collectively, the lower brains, they abstract the information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.866,
    "end": 3892.831,
    "text": "They don't send the entire information to the upper, the higher-level brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3893.132,
    "end": 3894.153,
    "text": "They abstract it away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3894.874,
    "end": 3904.206,
    "text": "So the higher-level brain, even though it's computationally very limited, it has the same, it can actually simulate the system because it's abstracted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3904.266,
    "end": 3905.247,
    "text": "It's coarse-grained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3907.741,
    "end": 3911.609,
    "text": " So it's usually a balance between top-down and bottom-up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3911.629,
    "end": 3920.408,
    "text": "So basically what happens is that the inner levels will be more predictable, but the outer edge will always be less predictable, or the higher levels will always be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3920.749,
    "end": 3925.058,
    "text": "And I'm usually saying cautiousness leads to the higher level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.038,
    "end": 3952.935,
    "text": " at the age of uncertainty so we have subconscious everything is predictable like for example if a fire here my hand will go away that the gland gangrenous in our spinal cord will decide even before it goes to our brain the decision so predictable things are happens in your subconscious the unpredictable things happens in our conscious uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.468,
    "end": 3966.445,
    "text": " Okay, I think I have tried to explain all the important things that I want to do, but just before finishing, I want to just reconnect this concept back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3966.926,
    "end": 3970.391,
    "text": "So far, we are talking about how do we do abstractions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.712,
    "end": 3979.885,
    "text": "We generally, the best abstraction, as I said, we have neural networks, and how neural networks work using backpropagation, and how backpropagation works, we really don't understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3980.118,
    "end": 3992.305,
    "text": " Even people who produce chat GPT, they say, we can code the system for you, but we don't know how back propagation will decide how abstractions are formed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.943,
    "end": 4019.828,
    "text": " so i i mean a few years ago i came across an algorithm which is which actually uh drives multi-linear regression i i thought this is beautiful because it it matches with our predictions without with our simulations very very well the simulations that i did in the beginning so i don't know have you heard about lattice filters lattice filters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.681,
    "end": 4022.943,
    "text": " Yeah, go for it, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.963,
    "end": 4023.404,
    "text": "Continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.906,
    "end": 4033.8,
    "text": "Yeah, so lattice filters are actually, they used all the way in Kalman filters and signal processing filters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.301,
    "end": 4038.067,
    "text": "And I just don't know why they are less famous in the machine learning community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4038.708,
    "end": 4047.823,
    "text": "They are more, if you go to the signal processing community, you will see a lot of talk about lattice filters and Kalman filter and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4047.803,
    "end": 4053.188,
    "text": " For me, lattice filters are actually very, very similar to how the brain is depicted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4053.768,
    "end": 4058.633,
    "text": "Because the predictive coding system will tell you we have predictions and we have prediction errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4059.253,
    "end": 4062.716,
    "text": "And they match very, very neatly together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.817,
    "end": 4066.36,
    "text": "And these lattice filters are very, very easily derived.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4066.38,
    "end": 4073.927,
    "text": "So if you have two groups, for example, let's say we want to see which group are more reliable to have a high blood sugar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.467,
    "end": 4077.81,
    "text": "We have obese group and less obesity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.79,
    "end": 4099.343,
    "text": " and usually in scientific tests we have more variations and these variations will affect our results so the biggest experimental design is to remove these variations that's what we say control design but sometimes you can't do that because there will be always variations so many multifactorials that you're even not aware of it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.323,
    "end": 4102.869,
    "text": " So what you can do that, you can do that post hoc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4103.069,
    "end": 4110.941,
    "text": "So let's say we want to predict these Xs using X3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.081,
    "end": 4114.907,
    "text": "And what's not predicted is we call them prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4115.308,
    "end": 4118.333,
    "text": "So the prediction error will go to the upper labels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4118.773,
    "end": 4125.043,
    "text": "And then we use the residual errors to predict the other remaining errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.023,
    "end": 4134.153,
    "text": " So you do that until you end up with the last prediction error, which represents this feature, in this case, obesity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.794,
    "end": 4141.301,
    "text": "This is where you can actually find the relation with obesity and why the factor that you want to test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.022,
    "end": 4152.533,
    "text": "And if you do that, especially for a sequential data, you actually end up deriving that lattice filter again, which I talked about here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4152.513,
    "end": 4173.778,
    "text": " so you can you you will drive lattice filter and this lattice filter is actually very very similar to how a prediction error works and this this way it's similar to what our findings in in our paper when we say the expected stimuli will be suppressed so these lattice filters will also tell you the same thing it will tell you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4174.518,
    "end": 4177.808,
    "text": " In multivariate linear regression, you are trying to predict the stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.888,
    "end": 4185.793,
    "text": "The prediction error, which is not predicted, it will go to the upper vehicle, and then the outer context will try to predict that and that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.735,
    "end": 4209.84,
    "text": " you will go to increase the context to predict the remaining errors so i thought this is a really an interesting connection but these lattice filters are not used in machine learning the reason is because mostly they are linear systems there are ways that you can make it non-linear but they are because they learn very fast they are very very sensitive to noise so if you have a small noise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.82,
    "end": 4237.6,
    "text": " they will just learn the noise too and that's why that's why i think people in machine learning system they actually go to uh use optimization methods using back propagation because in back profession you have a learning rate which you can reduce it that means even if a noise comes it will not affect the entire system so that's why my only explanation why people don't use this method but i like this method because it connects our brain the predicted coding error",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4237.58,
    "end": 4259.217,
    "text": " and it is very similar to the findings that we have in our paper and and i think it connects nicely somehow to to the free energy principle so uh thank you a lot for for for uh listening and i'm here if you have any questions awesome",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4260.361,
    "end": 4283.213,
    "text": " okay well thanks for the awesome and wide-ranging presentation while i crop and get everything back if anyone wants to write a question in the chat go for it and just to kind of begin the discussion i mean could you share a little bit how how did you get to studying the suppression",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.193,
    "end": 4312.103,
    "text": " uh repetition suppression in your phd then what what journey has brought you to making the self-organizing particles and all the cool youtube videos oh thank you uh well repetition suppression uh it's uh my phd supervisor is actually uh a very uh big name in repetition suppression so he he have a lot of reviewed uh review papers on repetition suppression",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4313.011,
    "end": 4314.593,
    "text": " And I found this is interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.954,
    "end": 4324.548,
    "text": "My beginning PhD, I was interested in episodic memory, because my master's degree was about episodic memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.251,
    "end": 4333.562,
    "text": "But later on, I thought there is a very nice connection between repetition suppression and predictive coding literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4334.323,
    "end": 4342.495,
    "text": "Back then, I wasn't aware too much with three energy principle, but more aware with predictive coding literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4342.475,
    "end": 4369.984,
    "text": " so i thought because there is this connection and and and it was always surprising to me uh the phenomena of repetition suppression it just means that when something becomes very expected when when you finally predict something your brain will go either so usually i thought in the beginning it's counterintuitive because usually you think oh if something becomes very predictable you should your brain should be more active",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4370.605,
    "end": 4373.73,
    "text": " But that's interestingly not true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.291,
    "end": 4381.201,
    "text": "Your brain is usually what I think is more active at the age of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.443,
    "end": 4387.491,
    "text": "Because let me be honest, if you see noise, it's completely unpredictable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4387.531,
    "end": 4389.694,
    "text": "But at some point, your brain will go idle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4389.674,
    "end": 4411.902,
    "text": " interested so we uh our paper was not about that but i am sure if there are papers uh it's a u-shaped curve so if something is very predictable your brain will be less interested less active and if something is completely unpredictable again we we are not interested in it so i think the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.725,
    "end": 4415.951,
    "text": " For some reason, I think it may be connected to consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.011,
    "end": 4436.507,
    "text": "I am not sure about, my studies was all about consciousness, but I think repetition suppression is probably the closest phenomena that we can objectively examine and in some ways connect because subjectively, when something becomes predictable, you also feel bored.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4436.527,
    "end": 4437.248,
    "text": "It's boring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4437.599,
    "end": 4438.841,
    "text": " and we feel sleepy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4439.802,
    "end": 4449.113,
    "text": "So the objective findings that we see, the activity decreases, also correlates with the subjective findings that we actually feel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.133,
    "end": 4459.286,
    "text": "And because these are too connected, I think it's probably the closest objective phenomena that we can test, and somehow we can correlate to consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4460.888,
    "end": 4465.193,
    "text": "Yeah, I mean, the example of just a random pattern",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.067,
    "end": 4492.092,
    "text": " that could be intelligently coarse grained and you go okay frame after frame the coarse graining of this whole picture is just gray so then the coarse graining is unsurprising so then even if the pixel level details are still surprising you've reduced or bounded surprise at the slower or the deeper layer so again that becomes not interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.477,
    "end": 4522.399,
    "text": " oh wow that's actually a very so so i actually didn't thought about it like that but the core screening idea if you combine it it will just reconnect back to that more extra that's very nice actually i i really liked how you connected the core screening with a the markov blanket a lot of work has connected neural networks and the loss function that's used in training the neural network with the variational free energy and then in the neuroimaging setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4522.379,
    "end": 4547.543,
    "text": " coarse graining like you brought up it's a really simple heuristic because it's just spatial proximity you don't need to cluster things by their functional similarity you just use the anatomy and then it's interesting to think about the markov blankets as coarse graining in a causal space like if you had um 10 10 different uh sub procedures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.063,
    "end": 4566.257,
    "text": " but then you say well one procedure one two and three are like one unit and then that becomes like its own thing but procedure one might be anatomically close to seven but then one two and three are causal and so then it's like building these parallel maps",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.558,
    "end": 4583.908,
    "text": " your phd it was more grounded in the spatial and the temporal and then the markov blanket abstracts that into a causal but then abstracting away from space and time is where we get patterns and that is how abstraction helps us predict the future",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.238,
    "end": 4608.175,
    "text": " exactly oh god this is interesting i think i think i think course graining is just like a door for understanding so many things and i usually i i sometimes interested in physics because even in my high school i was interested in physics i don't have a formal education in physics but i am very very interested and i am very very interested in the phenomena uncertainty principle and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4608.357,
    "end": 4623.97,
    "text": " um bills phenomena and i usually i'm afraid to ask this because they usually get angry is there a relation between course graining and uncertainty so they usually tell you no and uncertainty in physics is fundamental",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4625.148,
    "end": 4642.65,
    "text": " I don't know whether they may be, there may be physicists outside, outlier physicists like Stephen Wolfram or some other physicists, they have more deterministic view of what uncertainty means or what randomness means at the lower level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4642.63,
    "end": 4657.551,
    "text": " to my experience usually when i go discussing reddit they will get angry they will say no you don't understand anything about the underlying atoms they will just go random it's just a a true random generator",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.543,
    "end": 4669.76,
    "text": " Well, I don't know who will get mad about what, but in a way, the movement from quantum scale physics to classical physics is like coarse graining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.92,
    "end": 4678.312,
    "text": "It's like saying, well, if you go to one atom, it might be difficult to know what vector it's going to move in next, even if you knew the temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.332,
    "end": 4682.859,
    "text": "So maybe that's near the limits of a true ontological uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.279,
    "end": 4687.065,
    "text": "But then if you have a ball moving through space,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4687.045,
    "end": 4699.236,
    "text": " You can get a really good prediction on a slower, larger thing, and then that's classical mechanics, where you don't have the same uncertainty, you can just assume this basically infinite precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.297,
    "end": 4713.61,
    "text": "But then quantum is where you can't assume infinite precision, and people debate whether that's ontologically how it is at a certain scale, or whether that's an artifact of our interfacing with small things,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.59,
    "end": 4721.583,
    "text": " But regardless, things that are about as big as we are, it's kind of like, these are like pebbles that are about as big as we can pick up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.084,
    "end": 4723.867,
    "text": "Those are the things that we can think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4723.927,
    "end": 4725.389,
    "text": "That's what makes sense to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4726.05,
    "end": 4727.392,
    "text": "And then those are the classics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.953,
    "end": 4738.571,
    "text": "And then things that are more challenging to abstract or predict, they're nonsensical or they're outside of our scope of understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.973,
    "end": 4740.053,
    "text": "Yes."
  },
  {
    "start": 4741.315,
    "end": 4753.148,
    "text": " But from earlier, how did you get from the repetition suppression to working on what you're doing now and making cool videos?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4753.634,
    "end": 4777.65,
    "text": " uh actually uh particle uh making videos uh i i as i told you before i actually learn more when i make a video about the topic so i call that active learning there are so many topics that in my life i want to try learning it's just like because i see many intelligent people they say oh this this topic is very important this topic is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.63,
    "end": 4801.073,
    "text": " so right now in in current situation i'm trying to learn mona and i i i look at many videos i don't know what the hell they are talking about but because so many intelligent people they say oh mona is a very interesting way of abstraction in programming just like i have to learn that and at some point i think when i fail understanding and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.357,
    "end": 4831.296,
    "text": " i say oh if i have if i if i try to make a video on it i will finally understand it so usually making videos on something it actually pushes you to understand it i don't know why this is true but i find it very interesting because our brain course brings a lot of information and self-attention it always tells you this is not interesting this is not interesting it has a lot of a big selectivity so this part of selectivity tells you which direction you go",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4831.276,
    "end": 4837.992,
    "text": " So when you make a video on something, it will actually now say, okay, now I know this is important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4838.012,
    "end": 4842.623,
    "text": "So it gives you, it makes your attention on the topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4842.663,
    "end": 4847.715,
    "text": "Without that, it will always something tells you to procrastinate and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.695,
    "end": 4867.155,
    "text": " not not pay attention to it so the reason why i make videos is just interest to be quite honest i make videos when there is some idea and i like to represent i like to learn about it and i like to represent that in a video uh so one of the these ideas which i like local maxima idea",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4867.135,
    "end": 4895.083,
    "text": " i i find it fascinating and actually it links back to computational irreducibility in some way because local maxima tells me that because we are limited because our brain is limitless we we every now and then we will be trapped on a local maximum and that will be very difficult when we travel in a local magazine that's it we we have to become conservatives there is no way around either you risk something some people risk their lives go outside otherwise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4895.063,
    "end": 4898.07,
    "text": " the direction will be lost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.367,
    "end": 4927.315,
    "text": " when you when you are trapped on a lot of them so that idea was very interesting and particle simulations i was trying to explain to some friends how because usually when you discuss evolution theory they will tell you how pure cells arise and i thought i almost thought the first cells are actually easy to explain i mean people usually think that the first cells are the complicated cells like now we see no the first cells are probably just a membrane and a nucleus and i thought that this is very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4927.295,
    "end": 4944.342,
    "text": " easy to simulate with some particles attracting each other and i was looking at youtube videos to see and then i came across this particle life system uh i don't remember the name of the guy but he was explaining uh these cellular shapes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4944.322,
    "end": 4959.293,
    "text": " with attraction and repulsion forces and i thought wow this is very interesting actually i've tried to implement that by myself and i improvised that and i was surprised i was trying to do that and then a bug on my screen appeared a flying bug",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.796,
    "end": 4961.659,
    "text": " So that was very, very surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4961.799,
    "end": 4962.42,
    "text": "I was shocked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.52,
    "end": 4968.789,
    "text": "I mean, how can I, I'm just randomly examining some simple rules and I see something like a flag.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4970.631,
    "end": 4977.781,
    "text": "And then I actually made a video and that video actually have a lot of views and the code have a lot of participants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4977.841,
    "end": 4979.003,
    "text": "They made the code,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4978.983,
    "end": 5002.543,
    "text": " way more sophisticated so now it has a lot of gooey parts and thanks to the participants uh and i think i think it's uh the most uh uh yeah i mean many many people actually become more popular uh the particle life uh after that video and the reason why i think it's because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5002.523,
    "end": 5004.927,
    "text": " The code was the simplest possible code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5005.067,
    "end": 5009.273,
    "text": "I thought, because it is educational, I have to make it the simplest possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5009.394,
    "end": 5014.622,
    "text": "I actually reduced all the parts that I thought it may not be interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5015.103,
    "end": 5021.973,
    "text": "And because the code is very simple and the patterns is very complex, I thought that's what attracted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5022.294,
    "end": 5025.358,
    "text": "And I am hoping more people actually come to the part of my life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5025.378,
    "end": 5028.583,
    "text": "Because I know Game of Life is very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5028.764,
    "end": 5030.927,
    "text": "It's touring complete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5030.907,
    "end": 5036.094,
    "text": " But particle life is less known about, but they are more biologically looking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5038.978,
    "end": 5049.473,
    "text": "Yeah, a lot of insights there about the formation of, well, first the joy and the fun of open source and of people's participation in science around the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5049.573,
    "end": 5055.381,
    "text": "And then in the first cells forming, there's like hydrophobic and hydrophilic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5056.162,
    "end": 5060.408,
    "text": "Exactly, that was my question about how huge cells are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.388,
    "end": 5065.953,
    "text": " So how the material gets there is, you know, these are all inquiry to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5066.634,
    "end": 5068.415,
    "text": "And then also just about the videos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.776,
    "end": 5072.96,
    "text": "So one thing about video is it's an audio and a visual component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.0,
    "end": 5076.883,
    "text": "Now, some videos you can watch with no audio and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.105,
    "end": 5086.432,
    "text": "But when audio and visual are happening together, it's kind of like two touches from across the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5086.452,
    "end": 5089.315,
    "text": "Like if someone's doing hand gestures while they're talking,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.295,
    "end": 5094.186,
    "text": " then they're both being emitted from the same cognitive state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5094.506,
    "end": 5099.978,
    "text": "Whereas if it scrambled what hand gestures were happening with the audio, it would remove that meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5100.359,
    "end": 5102.985,
    "text": "But synchronously, they're experienced together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.025,
    "end": 5104.388,
    "text": "So then they're seen as meaningful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5104.428,
    "end": 5106.392,
    "text": "So then like I was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5106.862,
    "end": 5108.586,
    "text": " paying attention to the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5109.047,
    "end": 5111.853,
    "text": "And it was like slide after slide, I would be initially surprised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.435,
    "end": 5124.482,
    "text": "And then through the suppression of surprise, I keep seeing in these two images here, it's like sometimes you connect with a layer above or below,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.817,
    "end": 5129.864,
    "text": " which is top down from the top's perspective or bottom up from the bottom's perspective, or you go sideways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5130.485,
    "end": 5136.994,
    "text": "And so that could be in a grid world, lateral, spatial, that could be through time, like on a timeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.295,
    "end": 5140.76,
    "text": "And it's like, those are the local moves that can be made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5141.14,
    "end": 5151.415,
    "text": "You can move up or down a layer of abstraction and generalization, and then you can move around in space and time and cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5151.698,
    "end": 5157.584,
    "text": " It's like those are our, that's like the push-up and the pull-up of the local interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5158.405,
    "end": 5160.126,
    "text": "These are the moves, the dance moves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.767,
    "end": 5163.81,
    "text": "And then the question is just like, what does the party look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.21,
    "end": 5166.432,
    "text": "And that's the particle simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.513,
    "end": 5173.599,
    "text": "What really, what starts to happen when all of these moves, what if some of the particles can do abstraction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.221,
    "end": 5175.441,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5177.323,
    "end": 5177.643,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5178.825,
    "end": 5179.886,
    "text": "Can I show you a demo?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5180.006,
    "end": 5180.466,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5180.747,
    "end": 5181.267,
    "text": "Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.753,
    "end": 5192.307,
    "text": " Okay, so this latest filter, I do have a video, another video on it, but I have also a demo, so I can show you a Python code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5193.889,
    "end": 5199.336,
    "text": "So let me open up my... So do you code in Python?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5199.356,
    "end": 5200.818,
    "text": "I saw you code in Python.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5200.878,
    "end": 5201.939,
    "text": "What IDE do you use?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5202.8,
    "end": 5208.908,
    "text": "I use Cursor for the AI augmentation or just VS Code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5210.221,
    "end": 5211.843,
    "text": " Oh, Visual Studio Code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5212.824,
    "end": 5215.567,
    "text": "I use what's called Spider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5215.607,
    "end": 5216.688,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.708,
    "end": 5218.37,
    "text": "For scientific Python.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.55,
    "end": 5218.791,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5219.151,
    "end": 5224.778,
    "text": "It's very similar to Matlab because in my PhD, I left Matlab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5225.759,
    "end": 5229.683,
    "text": "I hate it as a language, but it's very nice IDE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5229.703,
    "end": 5231.025,
    "text": "It has a very nice IDE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5231.665,
    "end": 5233.487,
    "text": "Hate it as a language, love it as a friend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.569,
    "end": 5235.79,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5237.052,
    "end": 5251.23,
    "text": " So when I transitioned to Python code, I saw Spider as a home because it looked like... It looked like... The MATLAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5251.551,
    "end": 5251.771,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5252.152,
    "end": 5253.493,
    "text": "Also like RStudio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5253.513,
    "end": 5255.196,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.336,
    "end": 5255.556,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5262.385,
    "end": 5262.645,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5263.506,
    "end": 5265.489,
    "text": "So you see the IDE now, huh?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5265.509,
    "end": 5265.849,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.869,
    "end": 5266.35,
    "text": "Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5267.663,
    "end": 5268.027,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5270.188,
    "end": 5271.379,
    "text": "So let me...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5311.42,
    "end": 5340.87,
    "text": " Okay, so I'm pasting a previous... Let me paste a code from... Okay, so can you see the code?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5341.255,
    "end": 5348.747,
    "text": " OK, so I like this algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5349.688,
    "end": 5351.972,
    "text": "People usually call it lattice filters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5352.853,
    "end": 5359.344,
    "text": "As I said, I derived this algorithm just from the prediction coding multilinear regression system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5360.025,
    "end": 5361.287,
    "text": "And I have a video about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5362.248,
    "end": 5365.153,
    "text": "It's titled Regression and Brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5365.741,
    "end": 5389.217,
    "text": " so it's very very simple code but it somewhat explains repetition suppression so if you if you run the code okay so now this this will act this is activity this is the error and this is by the way do you see the plots or you just see the spider ide no plots just the ide",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5389.872,
    "end": 5391.675,
    "text": " OK, so I have to share the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5391.695,
    "end": 5392.717,
    "text": "The screen is better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5393.759,
    "end": 5396.284,
    "text": "So let me share the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5401.513,
    "end": 5402.515,
    "text": "I think you should see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5402.535,
    "end": 5402.936,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5402.956,
    "end": 5403.477,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5403.497,
    "end": 5405.019,
    "text": "Looks good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.059,
    "end": 5405.721,
    "text": "OK, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5406.202,
    "end": 5409.788,
    "text": "So I run the code and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5410.358,
    "end": 5425.245,
    "text": " this is the pattern so so let's let's simulate a sinusoidal pattern in the beginning so so let's say we are just simulating a sinusoidal okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5428.803,
    "end": 5433.811,
    "text": " So this is the truth, the green, and the orange is the prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5433.911,
    "end": 5436.455,
    "text": "You see in the beginning, it doesn't predict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5436.996,
    "end": 5442.644,
    "text": "The orange line doesn't overlie the blue line, the sinusoidal activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5443.686,
    "end": 5450.516,
    "text": "So the sinusoidal activity is our data, the truth, and the prediction is the algorithm which I showed you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5450.616,
    "end": 5452.92,
    "text": "It's just a few lines of code here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5454.453,
    "end": 5456.555,
    "text": " So I will just explain it right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5457.236,
    "end": 5461.84,
    "text": "But the interesting connection I will try to make to repetition suppression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5463.122,
    "end": 5472.832,
    "text": "So you see after a few iterations, it can perfectly predict the sinusoidal activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5473.032,
    "end": 5475.394,
    "text": "And you see the error plot actually reducing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5475.955,
    "end": 5479.178,
    "text": "In the beginning, it's high, but then it's reducing to zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5480.103,
    "end": 5509.975,
    "text": " and this actually tells you how much activity do we have in different layers so you can see in the beginning in the lower layers we have higher activity let me zoom in so we have higher activity in the lower layers and then as we go to the upper layers we have less activity that's why because because the system can predict what happens this now i will introduce a surprise to this system let me uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5510.444,
    "end": 5526.04,
    "text": " in this code now i am for every for every two steps i am just changing y to one it means just sinusoidal wave but i'm introducing one to it so just like now we have a surprise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.712,
    "end": 5529.477,
    "text": " Okay, now you see it's more difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5530.198,
    "end": 5536.829,
    "text": "So in the beginning, it can't predict the entire system, but then later on, it learns to predict the sequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5536.849,
    "end": 5544.602,
    "text": "So you see, it's the same sinusoidal, but I have introduced, number one, I have introduced something surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5546.05,
    "end": 5564.987,
    "text": " but then later on it predicts and then the error goes down and then again we have the activities but now the activities can go to higher layers before it's suppressed to zero okay now i will just introduce one surprising event",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5566.081,
    "end": 5569.065,
    "text": " So just minus 1 at point 17.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5569.105,
    "end": 5578.836,
    "text": "So at point 17, I will just introduce a surprise to the sequence and see how the algorithm behaves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.916,
    "end": 5579.277,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5579.357,
    "end": 5584.443,
    "text": "So you see it predicts the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5584.503,
    "end": 5589.729,
    "text": "But here, when I introduced a surprise, it can't predict it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5589.789,
    "end": 5593.253,
    "text": "It can't fit the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5593.672,
    "end": 5619.156,
    "text": " and if you see the activity you see when the at the level at this level when i introduce start plus surprise you can see the prediction error goes all the way to all the upper layers so just like repetition separation when you see something surprising the activity increases so just like that in the beginning so this algorithm is actually a very nice view to tell us how our brain may be working",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5619.136,
    "end": 5631.75,
    "text": " And here we even see that almost diagonal propagation up and to the right as it sort of normalizes and calms down at higher levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5631.77,
    "end": 5632.33,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5632.511,
    "end": 5639.318,
    "text": "So maybe that's a good thing and a bad thing because the algorithm learns this surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5639.679,
    "end": 5645.565,
    "text": "That's why even in the upcoming steps, it needs some time to come back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5646.794,
    "end": 5650.46,
    "text": " So maybe we can put a filter there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5650.48,
    "end": 5654.986,
    "text": "We can say, oh, if the prediction error is very high, don't learn the pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5655.006,
    "end": 5656.569,
    "text": "So maybe we can put a threshold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5657.25,
    "end": 5662.738,
    "text": "And maybe that will actually tells me that's why we have belief system in us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5662.758,
    "end": 5666.444,
    "text": "That's why our brain is actually fixed on some ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5666.524,
    "end": 5675.738,
    "text": "Sometimes if something very surprising and it doesn't conform with your previous beliefs, because the learning algorithm inside our brain is very fast,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5676.578,
    "end": 5699.481,
    "text": " if we can learn everything that even it doesn't conform to our previous beliefs it means it can mess up uh sometimes they it's similar to catastrophic forgetting it's just like the activity the new activity may superimpose the previous activities in your brain i can mess up everything and that's why maybe some people are actually hard to change their minds even after",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5699.68,
    "end": 5709.133,
    "text": " when they say new data, when they say new things, people usually, if it doesn't conform to their beliefs, they will just deny it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.894,
    "end": 5719.347,
    "text": "Because sometimes you need to fix, you need for this surprise to become a pattern so that your brain surrenders, says, okay, I want to learn that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5719.848,
    "end": 5721.37,
    "text": "That's what I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5721.891,
    "end": 5726.397,
    "text": "I mean, I think this algorithm can tell us more about our brain that we even...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.377,
    "end": 5754.696,
    "text": " uh so so it's very very easy it's just it's just like the prediction uh your system so so you have a sequence of data y is and then you just have just just focused on these two lines because everything happens here so you have so you just have a forward prediction and backward prediction basically w and this is the weight multiplied by the activity current activity it will try to predict",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5754.929,
    "end": 5757.434,
    "text": " the future activity, FF.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5758.055,
    "end": 5762.083,
    "text": "And the subtraction, the difference between these two is the prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5762.404,
    "end": 5766.712,
    "text": "So that prediction error will go to the upper level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5767.233,
    "end": 5769.838,
    "text": "So we have a nice illustration on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5769.918,
    "end": 5774.828,
    "text": "So the quote just illustrates this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5774.808,
    "end": 5802.165,
    "text": " so y5 here the sequence tries to predict y4 and then the prediction error goes up and then y4 tries to predict y5 the prediction the the forward prediction and the backward prediction so the prediction error we have two prediction error the forward prediction error and the backward prediction error so each level tries to predict the previous prediction error and each prediction error will go up hierarchy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5802.77,
    "end": 5806.513,
    "text": " And hopefully at the higher hierarchy, you will have less prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5806.593,
    "end": 5809.692,
    "text": "It means like your brain can predict everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5810.549,
    "end": 5812.792,
    "text": " I'll just add a note on prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5813.192,
    "end": 5816.977,
    "text": "The prediction error is denominated in the units of the measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5817.177,
    "end": 5821.643,
    "text": "Like if you expect the room to be 30 degrees and it's 31, then the error is one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5821.663,
    "end": 5833.177,
    "text": "And then the move in active inference is to translate that error signal into information units, bits, surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5833.938,
    "end": 5839.645,
    "text": "And then surprise, if you can compute it exactly for a simple system, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.625,
    "end": 5847.158,
    "text": " But then in cases where it's intractable or you want to do an optimization on bounding surprise, that's variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5847.198,
    "end": 5855.271,
    "text": "And that's been used for decades, variational autoencoder, all these other kinds of variational methods in physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5855.791,
    "end": 5872.602,
    "text": " so those are all kind of aligned like if you bow if the arrow were zero the surprise would be minimal the free energy would be minimal if there's a large error the surprise is higher the variational free energy is higher so like they're slightly different formulations but they're all monotonically related",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5873.206,
    "end": 5874.267,
    "text": " They are related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5874.408,
    "end": 5879.294,
    "text": "I think they are using other optimization algorithms to learn this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5879.835,
    "end": 5882.238,
    "text": "So there may be better optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5882.258,
    "end": 5882.959,
    "text": "That's what I say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5883.199,
    "end": 5884.982,
    "text": "You have to learn gradually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5885.062,
    "end": 5886.824,
    "text": "The problem with this system, it learns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5886.884,
    "end": 5888.366,
    "text": "It tries to exactly learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.386,
    "end": 5891.991,
    "text": "And that's why when you show something surprises,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.422,
    "end": 5900.753,
    "text": " Well, that kind of even comes back to the earlier numbers that you showed with the decimal points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5901.254,
    "end": 5913.253,
    "text": "It's like, are you trying to predict to one significant figure that's coarse graining to just one digit, but then if you give a computer program",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5913.233,
    "end": 5933.908,
    "text": " a float precision number it might have a ton of decimal points and then it will think that those are just as important to compute as the earlier decimal points and then it gets catastrophic because it's doing really well on like the the 50th decimal point but it lost the plot on the main thrust",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5934.58,
    "end": 5936.623,
    "text": " Sometimes precision error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5937.264,
    "end": 5944.635,
    "text": "By the way, floating point numbers are also a form of coarse graining because we can't actually simulate real numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5944.995,
    "end": 5946.838,
    "text": "Real numbers have infinite precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5946.938,
    "end": 5953.568,
    "text": "So the moment we say we use floating point, it means we have coarse grained the real number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5953.548,
    "end": 5974.628,
    "text": " there is no way without coarse graining even in in the computers even if you see if you use double precision it's it's just you have at some point you just cut the the number yeah um cool so what are your next research or or directions that you're going to be exploring",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5975.738,
    "end": 5977.421,
    "text": " Okay, there are two directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5977.662,
    "end": 5993.933,
    "text": "One is I actually want to explore more free energy, what happens in these particle systems, but not just intuitively, because to be quite honest, the things that I showed you, some stuff that I thought it is trivial, we don't need to even stimulate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5993.913,
    "end": 6003.729,
    "text": " But I have to simulate that because sometimes simulations give you a surprise, just like the first example, which I showed you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6003.749,
    "end": 6009.118,
    "text": "I mean, you think this happens because of this, but sometimes this is not true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6010.52,
    "end": 6013.465,
    "text": "The next thing, I am actually working on a different algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6013.665,
    "end": 6017.912,
    "text": "I call it PAN, Predictive Hebian Unified Neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6018.584,
    "end": 6047.747,
    "text": " uh i'm so far i'm not successful at this algorithm we can see this algorithm is a variant of this algorithm which i just showed you uh but but i'm trying to make this algorithm more local i mean learn locally uh the problem is because you so so what's the problem with the current neural network approach the neural network works very very good we saw magic with gpt but the problem is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6047.727,
    "end": 6070.174,
    "text": " these systems they are very very slow training they are sample inefficient they you have to give them so many samples so that they can live the reason why because they you have to tweak the learning rate to to lower evils because if you tweak the learning rate higher if the system learns fast",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6070.475,
    "end": 6073.219,
    "text": " it will have a catastrophic forgetting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6073.279,
    "end": 6085.856,
    "text": "The moment it sees something new, novel, because it has high learning rate, it tries to incorporate that new thing into all the systems, all the neural network nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6085.936,
    "end": 6092.685,
    "text": "And because these systems are distributed, it means it tries to fine-tune every node, every weight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6092.665,
    "end": 6108.109,
    "text": " and that could be catastrophic especially if this outlier is just a noise it's just a noise you need to ignore but if you have a high learning rate the algorithm doesn't can't learn that is why",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6108.089,
    "end": 6130.182,
    "text": " you have to make the learning rate small but if you make the learning rate small it means you have to iteratively learn so many samples and variations and that's why only big companies nowadays can train neural networks because it has it needs so many iterations and even these big companies they can't make a real-time system so even if they make a robot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6130.55,
    "end": 6134.074,
    "text": " That robot can't learn real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6134.195,
    "end": 6140.923,
    "text": "It's just like the company can tell you, oh, this robot can only learn, do things that we have trained in 2020.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6141.003,
    "end": 6149.514,
    "text": "We have to take it back and update and retrain again on the data from 2023 or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6149.794,
    "end": 6152.377,
    "text": "So it's not a real time learning system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6152.477,
    "end": 6157.063,
    "text": "So even now, it's not a real time learning system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6157.347,
    "end": 6164.561,
    "text": " if OpenAI needed to retrain everything again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6165.723,
    "end": 6169.911,
    "text": "So basically, it means these algorithms are not real-time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6170.291,
    "end": 6173.137,
    "text": "But this algorithm is real-time, the one I showed you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6173.157,
    "end": 6177.465,
    "text": "It means once you see the data in just a few samples, it learns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6178.154,
    "end": 6182.501,
    "text": " But again, the problem with this algorithm is this catastrophic disturbance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6182.661,
    "end": 6192.037,
    "text": "I mean, this instability, once it sees something surprising, because it tries to learn it, it just mess up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6192.057,
    "end": 6201.512,
    "text": "And that's what I try to figure out, something that learns fast, but it doesn't disturb the entire system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6203.095,
    "end": 6208.483,
    "text": " So I'm actually trying to do that, but so far, not very successful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6208.864,
    "end": 6214.032,
    "text": "But every now and then, I have ideas to implement and then try again and again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6214.052,
    "end": 6221.363,
    "text": "I think now, I mean, a few months ago, I have a new idea, but I still don't have time to implement it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6221.463,
    "end": 6230.537,
    "text": "So maybe you can hear more about me in the future, about the predicted hidden unified neurons, which I shortly called one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6231.074,
    "end": 6235.942,
    "text": " which is not fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6235.962,
    "end": 6236.743,
    "text": "It doesn't work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6236.763,
    "end": 6237.644,
    "text": "It's not fun yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6240.248,
    "end": 6241.771,
    "text": "Planning for fun is still fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6243.353,
    "end": 6243.553,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6244.415,
    "end": 6246.318,
    "text": "Do you have any last comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6247.76,
    "end": 6252.788,
    "text": "No, thank you very much for actually inviting me to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6253.108,
    "end": 6254.971,
    "text": "And I hope you continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6255.031,
    "end": 6257.655,
    "text": "I actually find Active Inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6257.956,
    "end": 6282.208,
    "text": " uh channel very interesting and i find the topic is very interesting actually the entire topic that you specialized yourself to just this one topic and it's a very very interesting i i thought it's a very good candidate for the theory of everything i mean people usually think that the theory of everything should come from physics but i think it will come from neuroscience that's fine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6283.775,
    "end": 6287.346,
    "text": " I mean, it doesn't make sense to have a theory of everything without consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6287.426,
    "end": 6289.793,
    "text": "That's why it has to come from neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6290.255,
    "end": 6293.565,
    "text": "I mean, physics can help in neuroscience, but the theory of everything",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6293.815,
    "end": 6295.416,
    "text": " It comes from neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6295.436,
    "end": 6298.019,
    "text": "There is no way around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6298.039,
    "end": 6302.903,
    "text": "Or it comes from a new combinatoric fusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6302.923,
    "end": 6308.248,
    "text": "I mean, one of the key moves in the free energy principle is to talk about the cognitive particle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6308.909,
    "end": 6319.138,
    "text": "So then if it's a Bayesian mechanics, if it's a statistical physics for cognitive particles, then it's not surprising that it has a lot to do with particle physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6321.16,
    "end": 6321.24,
    "text": "Yes."
  },
  {
    "start": 6321.727,
    "end": 6323.389,
    "text": " Yeah, maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6323.489,
    "end": 6327.393,
    "text": "That's the best thing to actually do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6327.553,
    "end": 6334.96,
    "text": "Actually, I have maybe one extra animation slide I can show you before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6335.401,
    "end": 6336.142,
    "text": "Sounds good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6336.962,
    "end": 6337.163,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6337.643,
    "end": 6339.265,
    "text": "About this combinatory things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6339.705,
    "end": 6344.17,
    "text": "I usually show that to friends and they usually like it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.75,
    "end": 6350.316,
    "text": "And I explained that in some of my videos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6351.038,
    "end": 6362.628,
    "text": " So, I mean, if we see this graph as the entire human knowledge, and then this child, it likes to learn, it's just born, it doesn't know anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6363.349,
    "end": 6365.731,
    "text": "So the problem is our age is very limited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6365.791,
    "end": 6378.322,
    "text": "So by the time the child, the curious child that tries to collect information, it will get old and it will, at some point, it will die before learning about everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6378.482,
    "end": 6380.083,
    "text": "And that's the reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6380.637,
    "end": 6386.865,
    "text": " Okay, now what I think actually better is specialization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6387.065,
    "end": 6389.909,
    "text": "It means that child shouldn't try to learn everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6390.029,
    "end": 6395.957,
    "text": "In the beginning, it tries to learn all the things that are surrounding and then should specialize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6397.259,
    "end": 6401.004,
    "text": "If you specialize, at some point you will reach the edge of knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6401.605,
    "end": 6407.853,
    "text": "And once you reach the edge of knowledge, this is where you can find a new information, the extrapolation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6408.514,
    "end": 6410.256,
    "text": "That's what I call extrapolation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6411.164,
    "end": 6416.249,
    "text": " Okay, but the problem with specialization is we will be trapped at a local maxima.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6417.891,
    "end": 6430.244,
    "text": "So it means if this guy is a doctor, he tries to treat cancer, he's specialized in cancer, but maybe the true treatment of cancer comes from an engineering trick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6430.324,
    "end": 6438.032,
    "text": "Someone can find a new radiation that doesn't affect normal cells, only affect cancer cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6438.265,
    "end": 6444.473,
    "text": " So I mean, if you trap yourself just reading medicine, you can never find the solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6446.516,
    "end": 6449.079,
    "text": "So this solution, how it comes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6449.88,
    "end": 6453.184,
    "text": "So let's say, so that's my point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6453.204,
    "end": 6459.112,
    "text": "You can never make distant connections, long term connections, because you specialize, you trap yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6460.073,
    "end": 6465.1,
    "text": "Now, if other people who are also specialized in different topics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6465.502,
    "end": 6471.151,
    "text": " If they collaborate with each other, that's why I'm coming back to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6471.171,
    "end": 6482.548,
    "text": "So if physics and collaborate with chemistry, with chemists, and they collaborate with neuroscientists, and then this collaboration, we can overcome the local maximum traps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6483.845,
    "end": 6484.807,
    "text": " Totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6485.348,
    "end": 6498.698,
    "text": "And there they are working on the interdisciplinary team, sending each other papers, sending each other jokes and memes that reflect their worldviews to give a kind of qualitative sense of their understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6499.859,
    "end": 6505.466,
    "text": " And also I think in the coarse graining, I think about nestmate ants returning with food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6506.067,
    "end": 6508.991,
    "text": "And so they're not saying what temperature or anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6509.071,
    "end": 6511.214,
    "text": "It's just interacting with nestmate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6511.234,
    "end": 6512.315,
    "text": "Yes, there was food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6512.796,
    "end": 6514.879,
    "text": "Someone else came that way with food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6515.42,
    "end": 6520.927,
    "text": "And so that's like a binary coarse graining that tells you something about that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6521.528,
    "end": 6528.617,
    "text": "And so it's like every node is a local sense maker receiving and sending and that's active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6529.542,
    "end": 6545.458,
    "text": " yes yes that's a nice way to conclude okay thank you good luck with your with your work and with your education so it's been awesome thank you very much daniel see you soon bye see you bye",
    "speaker": "SPEAKER_00"
  }
]