[
  {
    "start": 26.82,
    "end": 27.08,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 27.661,
    "end": 28.241,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 28.641,
    "end": 32.403,
    "text": "Welcome to ActInflab live stream number 41.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 33.384,
    "end": 34.285,
    "text": "It's April 13th, 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 34.705,
    "end": 37.867,
    "text": "So welcome to the ActInflab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 38.607,
    "end": 44.531,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 45.071,
    "end": 46.672,
    "text": "You can find us at the links on this slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 47.713,
    "end": 49.854,
    "text": "This is a recorded and an archived live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 50.314,
    "end": 53.516,
    "text": "So please provide us with feedback so that we can be improving on our work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 54.577,
    "end": 59.724,
    "text": " All backgrounds and perspectives are welcome, and we'll be following good video etiquette for livestream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 60.024,
    "end": 62.508,
    "text": "And Dean and Blue, thanks a ton for joining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 64.21,
    "end": 70.559,
    "text": "Check out ActiveInference.org to learn more about what the Active Lab is up to and how you can participate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 71.852,
    "end": 87.487,
    "text": " Today in number 41.2, we are going to have our third discussion on the paper Extended Active Inference, Constructing Predictive Cognition Beyond Skulls by Axel Constant, Andy Clark, Michael Kirchhoff, and Carl Friston.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 88.367,
    "end": 99.573,
    "text": " We had a dot zero video where we took a first pass, a first coat of paint on this paper, overviewed some of their distinctions and their background and some context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.113,
    "end": 104.255,
    "text": "And then we had a fun dot one last week with all of us here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 104.795,
    "end": 106.376,
    "text": "And we went down a few different paths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 107.116,
    "end": 113.82,
    "text": "And all I can say is with trust and glue of all of us,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 114.85,
    "end": 119.592,
    "text": " Us here and those who are watching live who are welcome to write questions in the live chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 119.672,
    "end": 125.694,
    "text": "I think we'll get somewhere pretty cool in the next two hours, but can't even know what shape it will be then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 126.454,
    "end": 133.397,
    "text": "So we can just start by saying hello and then we can pick up where we've left off",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 135.051,
    "end": 136.992,
    "text": " or we can go in any other direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 137.132,
    "end": 153.543,
    "text": "So I'm Daniel, I'm a researcher in California, and I think the part that I'm looking most forward to exploring today is that, trust and glue, and how do we trust and glue appropriately or adaptively?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 154.123,
    "end": 155.304,
    "text": "And I'll pass to Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 157.786,
    "end": 158.346,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.406,
    "end": 158.806,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.866,
    "end": 160.748,
    "text": "I'm in British Columbia at the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.479,
    "end": 170.003,
    "text": " I really like where you and Blue were going with this once I signed off last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.564,
    "end": 184.633,
    "text": "I was particularly interested in the idea of is the answer in the question because I thought that was an interesting way of maybe looking at is there an extended active inference component to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.913,
    "end": 187.555,
    "text": "So maybe you'll pick that thread up again today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.575,
    "end": 188.796,
    "text": "I'll pass it to Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.325,
    "end": 190.886,
    "text": " Hi, I'm blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.946,
    "end": 192.787,
    "text": "I'm a researcher in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.907,
    "end": 203.017,
    "text": "And yeah, trust and glue or, you know, what kind of improvisational context do we use this extended active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.057,
    "end": 209.482,
    "text": "Like, where is this kind of thing necessary, functional?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.542,
    "end": 210.403,
    "text": "Where do we see it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.483,
    "end": 214.107,
    "text": "Like what kinds of environments maybe highlight extended active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.147,
    "end": 215.588,
    "text": "That'd be interesting for me to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.542,
    "end": 220.779,
    "text": " awesome so we have a few different",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 221.664,
    "end": 248.751,
    "text": " aspects we can talk and return to some formalisms about how are the equations connected internally how are the formalisms connected to one another how are the extended active inference formalisms framed in this paper connected to earlier or now that some time has passed since the publication later formalisms in active inference how are they connected to the ideas that we've been discussing we have questions and answers",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 250.976,
    "end": 251.896,
    "text": " or answers and questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 252.837,
    "end": 256.699,
    "text": "What does that look like in the context of extended active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 260.56,
    "end": 275.787,
    "text": "Perception action, learning, teaching, applying, finding, discovering, a lot of ING verbs, and that is hiding or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 277.446,
    "end": 301.461,
    "text": " somehow intertwined with this question which is always in the backdrop or the pre-drop or stage right or something like that with what takes us from a regime of attention or a regime of intention towards active inference itself and some specific model so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 303.803,
    "end": 304.323,
    "text": " where to go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 304.603,
    "end": 314.405,
    "text": "I think the most structured of the options here is to remind ourselves of the formalisms and the figures, and then maybe we can come back to any of these as we see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 314.425,
    "end": 315.326,
    "text": "Does that sound good?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 317.506,
    "end": 317.706,
    "text": "Okay."
  },
  {
    "start": 326.088,
    "end": 326.308,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 328.488,
    "end": 330.769,
    "text": "There, equation one is a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 332.059,
    "end": 335.8,
    "text": " fairly typical restatement of Bayes' theorem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 336.26,
    "end": 356.427,
    "text": "So we won't dwell too much on that, but it is relating to the decomposition of a joint model of both observations and inferred latent causes, and the total model contains both of those, yet it's able to be decomposed in some amenable ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 360.959,
    "end": 361.5,
    "text": " Equation 2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 362.462,
    "end": 371.18,
    "text": "Using variational inference, one can invert the likelihood in equation 1, the probability of the hidden states conditioned on observation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 374.693,
    "end": 379.956,
    "text": " to approximate the posterior probability of causes once a sensation has been sampled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 380.977,
    "end": 384.079,
    "text": "So is this a twist, Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 384.099,
    "end": 403.811,
    "text": "Or what kind of inversion are we talking about here when we go from thinking about the likelihood, which is like the probability of there being a lightning strike conditioned upon what we actually observed, and that is now flipping to what are the causes given the sensation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 406.769,
    "end": 409.59,
    "text": " Well, here's a question for both of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.31,
    "end": 412.451,
    "text": "Is there such a thing as a group sensation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.251,
    "end": 422.835,
    "text": "I mean, if we think of it, it's seldom that we would consider ourselves as a proportion of a larger volume of energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.975,
    "end": 435.08,
    "text": "But when we find ourselves in these contexts and in these cultures, so what happens when we invert that idea of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.512,
    "end": 449.383,
    "text": " I'm one pie in a whole collection of pies at a pie shop to I'm some proportion of a larger energy set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.944,
    "end": 455.489,
    "text": "And then what are the implications of that in terms of the kind of evidence that I can or cannot gather?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 456.79,
    "end": 460.694,
    "text": "So that's my question for both of you, because you guys probably can answer that better than I can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 462.996,
    "end": 466.659,
    "text": " So I think we definitely experience group sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.659,
    "end": 470.841,
    "text": "I think about like the countries that are being bombed right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.082,
    "end": 478.306,
    "text": "And I think about like the countries that when a tsunami hits, like there is definitely a group felt sense of like terror.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.466,
    "end": 486.672,
    "text": "That's like a group sensation, but also even on like a positive note, like I think about like huge concerts and it's like a bunch of people really having fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.772,
    "end": 489.554,
    "text": "And that's kind of another like group sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.074,
    "end": 492.436,
    "text": "Like even like, yeah, those kinds of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.698,
    "end": 501.304,
    "text": " group things or even like large meditation retreats is like another good example of like a group sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 501.404,
    "end": 512.515,
    "text": "And it does kind of get like amplified or it feels like the sensation is like going through a megaphone when you know you're experiencing it with 5,000 people or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.635,
    "end": 513.896,
    "text": "So in my experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.506,
    "end": 519.027,
    "text": " And does that change the formalism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.927,
    "end": 536.655,
    "text": "I think we can identify it, but does that change the math or the way that we measure that based on the source of affective sensing within one agent versus that collective measure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.975,
    "end": 538.816,
    "text": "I think it just changes where we put the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.677,
    "end": 542.798,
    "text": "Doesn't change the math, though?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.686,
    "end": 547.591,
    "text": " I think it just changes where we put the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.611,
    "end": 551.581,
    "text": "So if you have a bigger blanket, there's more components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.23,
    "end": 562.434,
    "text": " um, you know, like you would separate the group of people that are experiencing the concert from a group of people that are about to experience a tsunami.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.975,
    "end": 568.638,
    "text": "You know, there's like a huge partition and it's, it's the same as separating two different people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.738,
    "end": 570.999,
    "text": "Mathematically, it's just separating groups of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.359,
    "end": 575.421,
    "text": "Like as mathematically, we are groups of cells, tissues, organs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.081,
    "end": 579.883,
    "text": "So I think that the, the only difference is just what's under that Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.903,
    "end": 579.983,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.294,
    "end": 585.675,
    "text": " All right, a few cool points to make.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 585.955,
    "end": 589.217,
    "text": "So you asked about group sensations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 590.317,
    "end": 595.98,
    "text": "And if we were in a unidirectional signal processing paradigm,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 597.967,
    "end": 624.597,
    "text": " question could be approached like what are the outside signals that come in and how do those diffuse through the group what does that look like when we've taken a step towards thinking about perception as inference as a generative inference so what are groups expecting so what is the same way that we talk about perception cognition and affect and memory anticipation planning as inference of entities",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 626.348,
    "end": 634.303,
    "text": " what does it mean for the group to not just be passively receiving sensations, but to be engaged in active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 634.504,
    "end": 636.487,
    "text": "So that's going to be a, um, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 638.424,
    "end": 643.667,
    "text": " big question and I'll leave it for another brief break to write out a few more options here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 644.147,
    "end": 660.898,
    "text": "But I think what Blue said about it depends on where the blanket is drawn or how the model is phrased relates to the composability of active inference and the way that it's kind of like blocks that play nice together laterally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 661.934,
    "end": 667.217,
    "text": " as well as in a nested fashion, including a nice little tuck at the end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 667.277,
    "end": 669.258,
    "text": "So let me explain by what I mean there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 669.899,
    "end": 679.465,
    "text": "The way that they interact laterally is it's a framework that allows you to simulate one ant or many ants, because one can just have,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 680.669,
    "end": 703.005,
    "text": " more and more entities in the same lateral level or scale that are interacting with the same environment and or with each other, whether that's like direct contact or with communication, because all that one needs to specify is the entity model and then their perception, their umwelt basically, and their action selection, like their affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 703.425,
    "end": 705.567,
    "text": "So if we know where the blanket is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 707.088,
    "end": 735.506,
    "text": " that was the system of interest that's the entity the ant and then what goes both directions that allows composability of a thousand ants just like one but then the key piece with the nesting is even if we only write down a single layer active model so the mouse in the t maze or just a single layer it's not a deep nested hierarchical model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 736.741,
    "end": 749.234,
    "text": " we can actually still interpret that graphical model as abstracting or receiving other models that we didn't directly formalize.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 751.368,
    "end": 763.093,
    "text": " So it was discussed in the textbook and in other sources of like, we could make an active inference model of one brain region with the inputs as sense states and the outputs as action states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 763.914,
    "end": 772.818,
    "text": "And then in that single brain region model, those input states, it can just be like, that's where the black box is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 773.198,
    "end": 773.799,
    "text": "There's just...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.824,
    "end": 779.066,
    "text": " an inability to actually do modeling on the details of what's coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 779.566,
    "end": 783.428,
    "text": "We're just going to leave it at some sort of stochastic process coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.928,
    "end": 794.612,
    "text": "So it kind of like tucks all the uncertainty away into this hidden little corner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 795.132,
    "end": 798.054,
    "text": "And then we're going to interface with that uncertainty as it becomes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 799.096,
    "end": 801.037,
    "text": " recognized by the system of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 801.697,
    "end": 812.442,
    "text": "Or one could make another model of that second brain region, and it could have its own perception and action states, but then that too would have inputs coming from elsewhere and actions going elsewhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 812.942,
    "end": 817.965,
    "text": "So I think there's probably more to unpack and explore here, but this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 819.124,
    "end": 826.25,
    "text": " hopefully speaks to the composability of active inference models to implicitly contain nested subsystems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 826.83,
    "end": 836.598,
    "text": "Like we could do an active inference model of a person and recognize that they consist of organs and cells and organelles and go all the way down to however small.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 837.419,
    "end": 847.547,
    "text": "And we can compose down and dig down or compose up as the extended perspective hopefully will have us look at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.287,
    "end": 848.428,
    "text": "But",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 849.454,
    "end": 873.829,
    "text": " we get to be making our single layer model implicitly within a more composable structure than many other families of modeling might allow for so that might give an ability to compare alternative ways of looking at multi-scale extended systems but it will be more like a comparison of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.649,
    "end": 888.002,
    "text": " relative free energies or relative model fits rather than some sort of ad hoc comparison that we're applying based upon a desire for simplicity or desire to see this many levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 897.066,
    "end": 914.711,
    "text": " I wonder in the sense that I understand that you can have the single ant and you can find the average in the eco, evo, devo, as you pointed out in earlier versions of this set of live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.391,
    "end": 923.833,
    "text": "And you can also look at the entire colony and look at it and find an average of its behavior over eco, evo, and devo as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 925.401,
    "end": 943.482,
    "text": " But that's why I'm not questioning whether or not the... If you use one type of math and you just decide which partition you're going to make, that that's going to kick out a certain expected kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.339,
    "end": 960.287,
    "text": " What I'm kind of curious about is in the synchronicity question, so we all go to the concert, for example, and we all anticipate, because this is the anticipatory part, we all anticipate having a good time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.868,
    "end": 967.752,
    "text": "How do we build that into what the actual result is when we all start singing along to the chorus?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.752,
    "end": 973.615,
    "text": "Because I don't know if there's a math for that quite yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.722,
    "end": 996.476,
    "text": " that's all I make basically ask I'm not I'm not questioning the formalism per se I'm just saying if we build up how does that affect what the equations are telling us versus if we as you said Daniel maybe collapse down and what the math tells us there there's going to be an average it gets kicked out so not arguing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.867,
    "end": 998.828,
    "text": " I'm not ignoring that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.868,
    "end": 1012.114,
    "text": "I'm just saying I think there is an anticipatory piece to this when we're talking about extended active inference and what we should be able to anticipate, what that surprise should be, and what ends up happening when",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.458,
    "end": 1034.776,
    "text": " those external controls in terms of rules play their part and what each individual's heuristics that they bring to the collective play their part and what that, how that all sort of transpires into something which can be measured and other parts of which may still be way too untractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.057,
    "end": 1035.457,
    "text": "That's all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.401,
    "end": 1040.722,
    "text": "Hello, any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.41,
    "end": 1050.433,
    "text": " No, I think, I don't know, I said what I needed to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.473,
    "end": 1055.896,
    "text": "I think it scales differently for me than how Dean perceives it, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.216,
    "end": 1059.998,
    "text": "I'm going to bring in another resource here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1060.158,
    "end": 1061.139,
    "text": "So this is from the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1063.84,
    "end": 1069.021,
    "text": " The 2021 paper, Felix Scholler, Mark Miller, Roy Salomon, and Carl Friston.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1069.762,
    "end": 1074.363,
    "text": "And it's trust as extended control, human-machine interactions as active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1074.783,
    "end": 1080.365,
    "text": "So staying on this trust and glue and extended anticipatory theme.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1081.445,
    "end": 1083.526,
    "text": "So here is one figure that they have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1088.167,
    "end": 1088.327,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1094.776,
    "end": 1120.013,
    "text": " the left side is a uni-dimensional scalar perspective on trust so this is like from zero to ten or one could think that zero is the threshold pass through zero rather than passing through five do not collect two hundred dollars on your way through five but you might on the way through zero and we have negative trust as well as like positive complete trust with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1121.334,
    "end": 1145.937,
    "text": " various associations we can make like having aligned interest or shared affection they then expand that uni-dimensional perspective into like a two-dimensional perspective on trust and they separate out the x-axis and the y-axis as being trustworthiness and trust and we've been talking about glue and trust so let's keep the glue and trust",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1146.983,
    "end": 1153.511,
    "text": " rattling around as we think about this later work, which undoubtedly is building upon the current paper we're discussing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1154.472,
    "end": 1163.062,
    "text": "And so on the Y equals X line, where the trust and the trustworthiness evaluations are equivalent,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1164.073,
    "end": 1171.921,
    "text": " that is where you have justified trust, meaning like high sense of trust, felt sense of trust in a trustworthy system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1172.582,
    "end": 1176.947,
    "text": "I believe the glue is strong and the glue is manifestly strong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1177.447,
    "end": 1180.05,
    "text": "I believe the glue is weak and it's breaking all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1180.49,
    "end": 1182.352,
    "text": "So that's on the Y equals X line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1182.933,
    "end": 1184.555,
    "text": "And that's like a manifold, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1184.915,
    "end": 1191.357,
    "text": " which is to say a lower dimensional line in a higher dimensional state space that actually is this unidimensional one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1191.637,
    "end": 1195.979,
    "text": "So we can imagine that being like at an angle and being the y equals x line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1196.879,
    "end": 1200.42,
    "text": "What does opening it up into multiple dimensions allow us to talk about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1201.101,
    "end": 1210.064,
    "text": "Well, it's allowing other quadrants to be explored where the perceived sense of trust may differ",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.204,
    "end": 1216.11,
    "text": " from the objective or the relational trust.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1216.831,
    "end": 1221.557,
    "text": "And so it's sort of like separating out cognitive versus the behavioral dimensions of trust.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.078,
    "end": 1223.079,
    "text": "Like, would you rather...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1223.971,
    "end": 1249.027,
    "text": " be the person that people behaviorally trust, like they give their keys to you, but then they're always having the sentiment or having the communications that that person's untrustworthy, or would you rather have the lip service or the cognitive lip service of people thinking and feeling and maybe even speaking like they trust you, but then when it comes down to it, there's no actual behavioral trust there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1249.447,
    "end": 1251.709,
    "text": "So they explored that in the context of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1252.796,
    "end": 1254.897,
    "text": " human robotic interactions and technology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1255.617,
    "end": 1261.52,
    "text": "So then let's just look at the second one and then it'll be awesome to hear what you two think or anyone in the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1263.881,
    "end": 1276.086,
    "text": "Here, they're looking at generations of technology along with their adoption curves and the ways in which they enable empowerment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1276.947,
    "end": 1281.489,
    "text": "And so the three rows here are like the sort of mobility,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1282.78,
    "end": 1283.153,
    "text": " Genre.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1284.66,
    "end": 1290.584,
    "text": " of the legs embodied moving into the extended and then cultured with like the horses and the cars.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1290.624,
    "end": 1296.208,
    "text": "There's like a weaponry genre or a sport hunting for those who want to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1296.909,
    "end": 1307.236,
    "text": "And then there's a navigation and orientation, which even came up in our discussion last time about cloud-based map services and how that leads to changes like in our spatial navigation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1307.776,
    "end": 1313.66,
    "text": "And especially as we'll be exploring in 42 upcoming, what if the neurobiology of navigation changes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1314.483,
    "end": 1316.424,
    "text": " is deeply intrinsic to ourselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1316.504,
    "end": 1328.272,
    "text": "So what is actually happening to ourselves as the navigational technology becomes something that we trust, something that we glue to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1328.692,
    "end": 1341.181,
    "text": "And so here they're just showing that there's this spiral of increasing empowerment, like an individual who's in the V3 tech stack here has certain",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1342.349,
    "end": 1360.005,
    "text": " constraints and affordances and just simply differences not even better except on specifically defined axes than those in the v1 tech stack so where do some of these representations or points that are raised in the later Scholler paper speak to either of you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1372.841,
    "end": 1374.382,
    "text": " Do you have something to add to that, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.223,
    "end": 1378.626,
    "text": "So I'm not really getting this empowerment time adoption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.806,
    "end": 1382.189,
    "text": "Without reading the paper, it's just not clicking for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.309,
    "end": 1387.553,
    "text": "So I have to, I guess, catch up in this trust versus extended control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.276,
    "end": 1391.537,
    "text": "Yes, totally agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1391.857,
    "end": 1399.183,
    "text": "And definitely the real-time interpretation is non-trivial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1399.283,
    "end": 1401.225,
    "text": "So let's just look at what they defined there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1407.043,
    "end": 1430.761,
    "text": " measure the amount of control or influence an agent has and perceives kluben et al propose the concept of empowerment empowerment is a property of self-organized adaptive systems and is a function of the agent perception action loop more specifically the relation between sensors and actuators of the organism as induced by interactions between the environment and the agent's morphology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1432.95,
    "end": 1441.485,
    "text": " So this goes back to like the definition of agency and where we were talking about empowerment as like a definable measurable metric on a live stream recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.505,
    "end": 1444.45,
    "text": "You remember that now it's starting to kind of click in, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.755,
    "end": 1471.164,
    "text": " but but we were talking about that like the um capacity of an entity to realize their preferences like you can have all the preferences in the world on a given on the temperature of the that day but on that dimension one's empowerment like their capacity for action selection to have impact a causal impact on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1472.759,
    "end": 1479.143,
    "text": " what is being preferred that is minimal versus one could be empowered and not even care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1479.824,
    "end": 1485.748,
    "text": "And they could have the power to, to modify something and yet not approach that potentially seriously.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1487.089,
    "end": 1487.349,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.429,
    "end": 1492.092,
    "text": "So it's clicking now it's making a little bit more sense, but I'm still not really getting this graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.293,
    "end": 1500.358,
    "text": "The, the I understand like empowerment over time, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.618,
    "end": 1500.838,
    "text": "I mean,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.57,
    "end": 1504.791,
    "text": " Like, if you think about a graph of a human, we become more empowered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.952,
    "end": 1507.673,
    "text": "We're like a inverted parabola, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.733,
    "end": 1515.216,
    "text": "So like we become more empowered as time goes on and then less empowered as we, you know, age and become less able to care for ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.456,
    "end": 1520.979,
    "text": "We're unable at the beginning and then we max empowerment and then like least empowerment towards the end of our life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.039,
    "end": 1525.401,
    "text": "Or, or if we live to be, you know, 110 or, or whatever, not always true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.421,
    "end": 1526.501,
    "text": "The end of life gets a little weird.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.861,
    "end": 1528.322,
    "text": "It's a wiggly trail offline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.528,
    "end": 1532.53,
    "text": " That reminds me of the classic riddle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1533.39,
    "end": 1538.813,
    "text": "What has four legs in the morning, two legs in the midday, and then three legs at night?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1540.754,
    "end": 1541.294,
    "text": "It's a person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1543.736,
    "end": 1543.856,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.997,
    "end": 1557.145,
    "text": " And then also let's look at what they mean by these like flex, because there's a few other pieces, of course, that this paper is bringing in, and then we'll kind of return to the trust and glue of the constant et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.905,
    "end": 1560.767,
    "text": "So of course it's a simplification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1561.948,
    "end": 1570.593,
    "text": "The important idea here is that the inflection point, flex, indicating the start of technological decay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1571.604,
    "end": 1582.966,
    "text": " reflects the abandoned rate of a practice as the experience of better predicted slopes of extended technological engagement lead to disengagement of non-extended approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1584.966,
    "end": 1586.907,
    "text": "Cars replace horses replacing legs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1588.067,
    "end": 1593.848,
    "text": "Old slopes are less than expected and so unsatisfactory as compared to new ones.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.268,
    "end": 1600.669,
    "text": "So it's a technology adoption",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1602.293,
    "end": 1622.763,
    "text": " model and often we just see the s curve part of the adoption and people will say like well here's how fast telegraph was adopted then the radio then the tv then the internet and so one can look at these s curves of adoption and sometimes they like start low they go up and then they flatten out and then it's sort of like what the technology's got 100 adoption",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1624.244,
    "end": 1641.582,
    "text": " this is also showing not just the rise of empire but the decline where we're seeing the retraction of use from a given technology and isn't it funny that we may have actually you know used our legs less as other technologies come into play like just the steps per day",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1642.483,
    "end": 1659.896,
    "text": " So we have each of these technologies stacks that they're modeling here have like a curve of adoption and also a curve by which they're no longer in use with many simplifications as people can hopefully charitably interpret.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1660.836,
    "end": 1666.861,
    "text": "And what they're pointing to is actually that the inflection point of the next generation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1668.174,
    "end": 1686.398,
    "text": " when things are like, when it's moving as fast, adoption is increasing as fast as it's going to increase for this new tech, occurs, basically, it must be occurring during the decline, the peak or the decline phase of the previous generation of glue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1688.419,
    "end": 1691.78,
    "text": "Because unless the technologies can be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1694.318,
    "end": 1702.867,
    "text": " coexisting in use, but they're looking a little bit more like technologies that replace one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1705.029,
    "end": 1710.095,
    "text": "So it's interesting here because legs are actually glued to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.033,
    "end": 1715.934,
    "text": " Whereas like horses can wander away or be stolen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.954,
    "end": 1722.218,
    "text": "So there's like an intermediate level of glue, but like cars are like, you know, or horses are like the most likely to go away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.578,
    "end": 1726.56,
    "text": "And then cars are, you know, not, they have no agency themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.06,
    "end": 1729.321,
    "text": "So they can kind of be glued a little bit more tightly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.381,
    "end": 1733.003,
    "text": "So horses are like the least amount of glue and cars are like the most amount of glue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.303,
    "end": 1733.823,
    "text": "It's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.124,
    "end": 1735.424,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1735.564,
    "end": 1736.645,
    "text": "Like, yes, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1740.046,
    "end": 1750.22,
    "text": " So I have relatives who have a ranch in the wine growing part of British Columbia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.061,
    "end": 1753.525,
    "text": "And in a strange conversation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.782,
    "end": 1777.374,
    "text": " I asked my relative who has a number of horses, would he ever consider instead of people being carted around in minibuses from winery to winery on a wine tour, given the proximity to a number of vineyards, would he ever consider taking his",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.587,
    "end": 1786.05,
    "text": " his horses and putting a business plan together around having people go from vineyard to vineyard on horseback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1786.67,
    "end": 1797.774,
    "text": "And he laughed me off in a heartbeat because he said, no, I think that would be very dangerous, people with drinking too much wine and trying to stay on their horse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.974,
    "end": 1804.016,
    "text": "But then he came back to me later on and said, maybe I was too dismissive of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.861,
    "end": 1806.802,
    "text": " because of the novelty aspect of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.882,
    "end": 1811.444,
    "text": "And if you could actually control the nature of it, because he's got great horses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.484,
    "end": 1812.865,
    "text": "I've ridden on his horses a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.266,
    "end": 1825.071,
    "text": "But if you could actually control that situation, the novelty of that means that the people that would participate in that would actually be doing something very unique and very novel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.832,
    "end": 1831.535,
    "text": "And so that reversion back to something that's not necessarily seen as being something super efficient",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.662,
    "end": 1838.724,
    "text": " is actually something that can be something that's very attractive and extend that generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.404,
    "end": 1841.325,
    "text": "Now, we haven't followed through on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1842.165,
    "end": 1843.366,
    "text": "That was mid-pandemic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.026,
    "end": 1860.191,
    "text": "But just this conversation right here, I find it really, well, I find it kind of disturbing because to have all of that now come rushing back a year and five months later kind of tells me, whoa, what's going on here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.652,
    "end": 1861.272,
    "text": "But it's that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1862.426,
    "end": 1878.693,
    "text": " It's that sense that in the collective extended active inference, in that probability of what portion of a population would actually find this interesting, instead of just dismissing it out of hand and saying, no, that would be a logistical nightmare.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.69,
    "end": 1883.111,
    "text": " You incorporate bays, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.451,
    "end": 1893.739,
    "text": "You actually see as, well, maybe there is a percentage of the population that would actually see this as something really unique, as long as it's not something that's unmanageable, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.5,
    "end": 1896.722,
    "text": "So I had no idea that you were going to bring this up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.382,
    "end": 1908.911,
    "text": "I'd have no idea what the comparison is of empowerment to the adoption uptake of that particular offering, but I do find it really curious right now that it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.468,
    "end": 1910.288,
    "text": " Here it comes again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.369,
    "end": 1911.389,
    "text": "It's popping up again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.969,
    "end": 1925.737,
    "text": "And it's not a constructivist thing so much as it's holding open the idea that there is not necessarily a whole bunch of people that just want to be housed in a minivan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.638,
    "end": 1928.579,
    "text": "What's the possibility then?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.56,
    "end": 1935.623,
    "text": "So it's actually pretty interesting in terms of this extended active inference, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.043,
    "end": 1938.545,
    "text": "It's not optimization in the conventional sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.426,
    "end": 1943.047,
    "text": " sense of, well, we can now hit nine wineries in four hours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.427,
    "end": 1949.99,
    "text": "Maybe it's an all-day thing, and people actually tell all their friends what a great experience they had.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.67,
    "end": 1952.19,
    "text": "So you look at the model a little.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.41,
    "end": 1954.331,
    "text": "The regenerative model is inverted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1956.468,
    "end": 1959.751,
    "text": " I hate to break it to you, Dean, but the idea is not that novel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.771,
    "end": 1961.492,
    "text": "Well, there you go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1961.832,
    "end": 1969.198,
    "text": "Well, so where I live, I live really pretty far out in the middle of nowhere, and there's one bar within maybe a 25-mile radius.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.061,
    "end": 1978.463,
    "text": " And people ride their horse to the bar, and there's hitches for the horse where you can tie the horses outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.843,
    "end": 1981.044,
    "text": "I drove Daniel up that road, so he knows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.104,
    "end": 1982.224,
    "text": "He's driven right past it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.625,
    "end": 1985.926,
    "text": "So there's hitches where you can tie your horse and go to the bar and drink.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.986,
    "end": 1991.628,
    "text": "And people actually have been cited for DWI on horseback after leaving the bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.288,
    "end": 1996.651,
    "text": " But also the Cinque Terre is amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.212,
    "end": 2001.275,
    "text": "A little series of five towns in Italy and there's no cars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.035,
    "end": 2003.876,
    "text": "I mean, they say that no cars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.916,
    "end": 2009.08,
    "text": "There are these tiny little baby like trash trucks and like FedEx delivery trucks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.16,
    "end": 2011.502,
    "text": "But like there's no roads that a car could actually drive on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.522,
    "end": 2013.183,
    "text": "Just these little tiny like cars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.649,
    "end": 2021.917,
    "text": " car-like things, but you have to get, you have to arrive by boat or by train and people take horseback from, you know, through these five little towns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.017,
    "end": 2023.639,
    "text": "It's, they do horse tours and wine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.699,
    "end": 2026.702,
    "text": "It's a five little towns that what they do is make wine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.822,
    "end": 2031.987,
    "text": "So like, that's a definitely like a winery tour and there's a beautiful beach and yeah, it's really kind of nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.147,
    "end": 2038.193,
    "text": "So, so maybe novel in the area and there's some value always to that, but yeah, had to bring up the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.613,
    "end": 2040.874,
    "text": " the closest bar to my house where there's horse hitches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.334,
    "end": 2044.715,
    "text": "I'm actually at the family dollar, which is like also the only store near where I live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.256,
    "end": 2049.437,
    "text": "I've seen people tie their horse to like the handicapped parking signs in the front of the store.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.437,
    "end": 2050.898,
    "text": "Classic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.258,
    "end": 2051.758,
    "text": "Two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.858,
    "end": 2054.359,
    "text": "One shout out for the gelato in Rio Maggiore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.959,
    "end": 2065.483,
    "text": "And two, I could just see, cause I've been to the, to the, well, I haven't been in the French laundry, but that famous restaurant in Napa, that's up from that Napa bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.523,
    "end": 2067.004,
    "text": "But, but I never saw like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2068.8,
    "end": 2095.574,
    "text": " dozen people riding by on their horses but i could just imagine for the people who are going there that wouldn't seem out of place so yeah two shutouts here's an interesting pattern so let's review figure one and two just briefly because that's that's one of the key contributions it's also some of the formalism so um we are taking it fast but then we'll take it slow",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2096.75,
    "end": 2110.341,
    "text": " In figure one, we saw the standard action perception loop that we've seen in different guises where we have perception and cognition as being a process of optimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.682,
    "end": 2113.224,
    "text": "And that is what the variational approach enables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2113.964,
    "end": 2115.085,
    "text": "So that's what they write here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2117.007,
    "end": 2122.611,
    "text": "Variational inference converts an inference problem into an optimization problem articulated by equation three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2123.052,
    "end": 2123.932,
    "text": "So that's where we went from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2125.009,
    "end": 2143.319,
    "text": " the Bayesian decomposition into this variational approach, variational because there's this Q distribution that we control and we're minimizing a divergence between a distribution that we're in control of that's simplified from a family that's very tractable to study from this true posterior, which is inferred.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2144.119,
    "end": 2151.563,
    "text": "And then we go from that variational phrasing of this inversion to an optimization that helps us solve it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2152.924,
    "end": 2160.582,
    "text": " that's what we're seeing in figure one there's optimization happening at the cognitive part of the partition and at the action part",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2161.837,
    "end": 2166.119,
    "text": " the sensory inputs are not being chosen by the entity directly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.44,
    "end": 2174.604,
    "text": "They can engage in active inference to take action selection that then brings predictability and control to sensations, perceptual control theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2174.964,
    "end": 2177.666,
    "text": "However, those are not directly being controlled or optimized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2178.026,
    "end": 2178.807,
    "text": "So that was figure one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2179.367,
    "end": 2189.733,
    "text": "And we talked about how on the other side of the table, there still is this stochastic dynamical equation reflecting how external states depend on their prior behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2190.513,
    "end": 2217.82,
    "text": " states and on action so we still have this interactive external states with potentially complex and self-reinforcing dynamics that's emitting sense states and so it goes in figure two that gets brought into the extended active inference space because now on the other side of the table from our star system of interest the brain here is also something looking more like an arg min",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2218.94,
    "end": 2234.811,
    "text": " of previous external states and action selection rather than looking more like a stochastic differential equation so now we have extended active inference because there's like an adaptive cognitive process happening on both sides of the blanket",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2235.712,
    "end": 2256.223,
    "text": " and that provides this new interpretation of what is crossing the boundary as being joint self-evidencing and part of a joint optimization process even if these two different arguments are quite different from each other okay so that's also where figure four came into play",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2257.128,
    "end": 2285.848,
    "text": " same way that figure one developed into figure two from the mirror active inference on the other side of the table to the adaptive on the other side of the table in equation two we were looking at the variational optimizable approximation of figure one and in equation four we're looking at the variational optimizable equation describing basically figure two let's return to our discussion on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2286.98,
    "end": 2289.322,
    "text": " trusting control and glue and tech and all of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2291.964,
    "end": 2300.07,
    "text": "Even before there was Spears, if we were going to have V zero, we could have legs, hands, and legs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2301.167,
    "end": 2306.972,
    "text": " some embodied navigational onboard perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2306.992,
    "end": 2310.795,
    "text": "So that's the pure BioWare stack V zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2312.176,
    "end": 2323.205,
    "text": "And then we can think about, and it's not so clean across these different verticals of technology, but the horse for sure is like an adaptive active entity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2323.825,
    "end": 2329.39,
    "text": "Like there is an intelligence on the other side of the table when somebody is riding a horse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2331.553,
    "end": 2345.097,
    "text": " What's interesting is that cars may be complex and however simple early cars were more like a mere active inference entity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2345.517,
    "end": 2354.599,
    "text": "I'm sure they still brought surprise and they broke and did things that were like wacky and stuff, but it was kind of like operating a motor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2356.1,
    "end": 2356.32,
    "text": "Now,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2357.793,
    "end": 2364.558,
    "text": " cars and technologies are actually becoming increasingly adaptive on the other side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2364.758,
    "end": 2366.359,
    "text": "So let's replace horses in V2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2366.659,
    "end": 2372.003,
    "text": "What if it was a map, like a paper map, a bow and arrow and a skateboard?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2373.103,
    "end": 2377.547,
    "text": "So those are all non-living extended entities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2378.387,
    "end": 2381.649,
    "text": "And those are one stack.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2381.729,
    "end": 2385.232,
    "text": "And then the next level is like the technology is developing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.513,
    "end": 2392.057,
    "text": " but it still is like that offloading rather than the uploading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2392.538,
    "end": 2402.246,
    "text": "Like you can't punch the person from 500 feet, but you can use the crossbow to do basically the same transfer of kinetic energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2403.266,
    "end": 2415.296,
    "text": "And with digital technology and digital models of cognition, we're moving into a place where like the car, the gun, the GPS system,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2417.779,
    "end": 2419.219,
    "text": " They might just say, you can't do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2420.9,
    "end": 2424.86,
    "text": "So that is changing the nature of interaction with technology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2426.361,
    "end": 2432.302,
    "text": "Whereas like a trusty bow was one that can be relied upon to behave predictably in a certain way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2434.742,
    "end": 2443.204,
    "text": "What is trust and glue when we're in the figure two world with everything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2445.461,
    "end": 2450.945,
    "text": " Here's the bow and skateboard worlds in figure one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2451.786,
    "end": 2461.353,
    "text": "And now this is in like a adaptive active setting, but yeah, blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2462.353,
    "end": 2464.495,
    "text": "So I'm really reminded of, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.851,
    "end": 2471.957,
    "text": " The pay phones, and, like, I know, you know, Dean is old enough to remember, but, like, Daniel, what were you, like, five when they had pay phones?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.418,
    "end": 2472.878,
    "text": "I'm just kidding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.938,
    "end": 2473.519,
    "text": "Fuck what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.741,
    "end": 2478.164,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.384,
    "end": 2484.31,
    "text": "So, I mean, we, you know, everywhere, so we had a telephone, we had a telephone at home, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.33,
    "end": 2488.154,
    "text": "Like, we could trust it that if we were at home, we could connect with whoever we would want to connect with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.139,
    "end": 2513.611,
    "text": " um and then you know there was all these payphone technologies like if you were somewhere where there were people where there was a gas station you could always find a payphone and it's interesting like the you know so we we were okay being away from our home phone but we had some trust that somewhere we could find a phone to connect with people if we needed to right um but we still couldn't connect with them unless they were at their house there was this other weird like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.77,
    "end": 2544.203,
    "text": " looped component and then you know you don't see a payphone now at all like the last time i saw one i took a picture of it because it's like such an anomalous thing i mean they just don't exist anymore because there's some you know everyone trusts that they'll have a phone and yeah if your phone battery dies it's okay you trust that you'll be able to charge it you know in your car or you get a battery pack or you have a solar battery pack i have one of those it's great um but so so you trust that you'll be able to connect even if you don't have your phone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.683,
    "end": 2546.104,
    "text": " someone will have a phone, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.144,
    "end": 2550.225,
    "text": "So like, you know, if you're in a car accident and have no cell phone, someone will stop and you can use their phone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.245,
    "end": 2557.427,
    "text": "So there's always this, but it's, it's interesting, this level of, of, you know, trust and the ability to communicate with others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.527,
    "end": 2560.749,
    "text": "And then what does that do to us cognitively?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.889,
    "end": 2564.29,
    "text": "Like if we, you know, can you check the fridge, hon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.33,
    "end": 2565.77,
    "text": "Did I leave, do we need milk?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.91,
    "end": 2567.991,
    "text": "Like, you know, can you call your house?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.43,
    "end": 2570.491,
    "text": " and find out, like, it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.511,
    "end": 2582.715,
    "text": "So I wonder how much more preparation we used to do without this ability to communicate broadly, like at the push of a button or, you know, 10 buttons or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.735,
    "end": 2586.717,
    "text": "Can I just build on that for a second?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.137,
    "end": 2587.917,
    "text": "So a couple of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.297,
    "end": 2595.44,
    "text": "If we're going to do an around the world thing, there are places still in the world where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.121,
    "end": 2601.004,
    "text": " although there's a whole bunch of people that have got their own device, there's still lots and lots of pay phones, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2601.044,
    "end": 2622.177,
    "text": "So we don't see them necessarily in our cognitive niche, but I can think of Central American countries that I visited recently, and I'm going to be visiting later this year, where if there wasn't a pay phone on every second corner, that will have changed only since 2017, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.277,
    "end": 2625.259,
    "text": "So some cognitive niches still require that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.731,
    "end": 2641.56,
    "text": " In this diagram here, I think it's interesting that when we look at the verticals, we could probably see the offloading, the idea that why would you need a payphone anymore, that being sort of resolved depending on which niche you're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2642.32,
    "end": 2653.987,
    "text": "But the horizontals, which is really the diachronic part, that's what kind of frees us up to go and look at a turntable again, even though most people have got that same capacity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.537,
    "end": 2658.44,
    "text": " to access whatever the media is on their phone, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.261,
    "end": 2662.823,
    "text": "So I think, again, I'm going to beat the same drum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.244,
    "end": 2666.446,
    "text": "When we look at these kind of representations, it's a minimum of two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.766,
    "end": 2669.228,
    "text": "Do we look at the verticals and the horizontals?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.268,
    "end": 2672.43,
    "text": "Do we see the stacks and the diachronics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.951,
    "end": 2683.939,
    "text": "Because when we incorporate the diachronics, then that looking back, I still probably won't go to a phone booth in Costa Rica because I just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.704,
    "end": 2688.905,
    "text": " don't need to, but I can certainly understand why it still exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.945,
    "end": 2691.005,
    "text": "And it isn't just a novelty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.245,
    "end": 2699.867,
    "text": "It exists like you were talking about last live stream about why we've automated water access.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.067,
    "end": 2710.028,
    "text": "Those people in those cognitive niches are still finding those tools useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.389,
    "end": 2713.509,
    "text": "So yeah, I think it's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.949,
    "end": 2739.494,
    "text": " Again, I keep bragging about this Axel Constant character who writes these papers, but man, is he ever touching on important stuff in terms of us sort of being aware, not just in terms of what we're dealing with in the here and now, but how that environment necessarily partitions us as much as we actively partition it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.614,
    "end": 2744.775,
    "text": "And so, yeah, I mean, go to Costa Rica.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.759,
    "end": 2752.504,
    "text": " It's a pretty modern place, but they still have lots and lots of payphones, and they still really matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.926,
    "end": 2756.687,
    "text": "They're in that second hump, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.747,
    "end": 2763.812,
    "text": "As we're transitioning from house phone to payphone to cell phone, they're still in V2 there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.452,
    "end": 2769.496,
    "text": "Or, yeah, some point where there's overlapping waves of tech.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2769.836,
    "end": 2771.898,
    "text": "So very interesting about...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2773.174,
    "end": 2775.416,
    "text": " trust and glue at different levels or types.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.137,
    "end": 2783.364,
    "text": "Like, do you trust that you'll be able to simply make the call or do you trust that they're going to be able to hear you on the call?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2784.164,
    "end": 2787.808,
    "text": "Do they, do you have trust that you'll be understood?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2788.308,
    "end": 2790.991,
    "text": "Do you have trust that that will have action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2791.251,
    "end": 2795.295,
    "text": "Like if you call an emergency hotline number, that's like, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2797.568,
    "end": 2806.294,
    "text": " It's probably a bunch of active jokes that one can imagine because one is providing a sense stimuli for that operator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2807.245,
    "end": 2829.114,
    "text": " so that they undertake some action and you trust that a certain kind of action will be taken though not directly knowing all the details like we may not understand how an ambulance gets called or where the location of the ambuli are but then we expect that upon a certain type of signal a call",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2830.43,
    "end": 2833.513,
    "text": " that one will be arriving shortly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2834.274,
    "end": 2836.796,
    "text": "So that is very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2836.836,
    "end": 2840.239,
    "text": "And then also Dean, like you said, we're partitioning technology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.94,
    "end": 2849.828,
    "text": "Like if you install Linux on a computer and it's the disk partition, and there's so many times where technology is about partitioning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.098,
    "end": 2855.324,
    "text": " and about putting the technology in the box and technology is often in a box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2855.384,
    "end": 2859.37,
    "text": "It's like wrapped in a box and then it's in like another plastic box or metal box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2859.95,
    "end": 2864.817,
    "text": "But then that actually changes our cognitive partitioning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2865.706,
    "end": 2872.548,
    "text": " And then we've explored in this paper, a sort of low bar and then a high bar where more is different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2872.749,
    "end": 2880.291,
    "text": "And the low bar was the offloading was where the technology is going to merely remind you of something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2880.851,
    "end": 2891.075,
    "text": "And so the offloading can be freeing up cognitive thought cycles and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.514,
    "end": 2893.695,
    "text": " and allowing for future epistemic action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2894.215,
    "end": 2909.922,
    "text": "Writing something down on the post-it and putting it on the doorway and it says, get milk, or it's yellow and you know that yellow means get milk, but you're offloading it to this sort of relatively passive, more like a crossbow, more like a skateboard kind of technology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2911.622,
    "end": 2916.524,
    "text": "What starts to happen when technology becomes adaptive and anticipatory?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2917.345,
    "end": 2919.786,
    "text": "And so we are not just offloading,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2920.831,
    "end": 2923.111,
    "text": " That's the low bar, but we're uploading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2923.892,
    "end": 2930.353,
    "text": "And there's an active entity on both sides of the table now, and they're anticipating and expecting each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2933.714,
    "end": 2940.875,
    "text": "What is happening when our technology use and modifications in the niche change our cognitive partitioning?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2945.016,
    "end": 2946.956,
    "text": "I got a question maybe for both of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.996,
    "end": 2948.277,
    "text": "So in that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.558,
    "end": 2979.434,
    "text": " under that sort of the spirit of what you're just saying Daniel so you get some platforms where you want to do some you want to take all your photos and all your images from your holiday and you make an iMovie or you go to Final Cut Pro now both of those platforms perform essentially the same function in terms of you being able to stitch together a bunch of images but the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2980.419,
    "end": 2988.047,
    "text": " iMovie, in its effort to be adaptive, says how much of this would you like me to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.467,
    "end": 2990.429,
    "text": "Would you like me to sync the music for you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.85,
    "end": 2993.432,
    "text": "Would you like me to apply the Ken Burns effect?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.813,
    "end": 3000.64,
    "text": "Whereas the Final Cut Pro, the assumption is that you have a much more control",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.005,
    "end": 3010.93,
    "text": " aspect of this in terms of what you want to be able to fine-tune and continue to operate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.61,
    "end": 3033.225,
    "text": "So I think it's interesting, the technology question and the environment question, because yes, it can be framed as freeing up, but I think at some point we have to ask whether it's option removing, because it's trying to help us, but it's not necessarily generating more possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.127,
    "end": 3036.289,
    "text": " which is, again, another form of optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.609,
    "end": 3039.511,
    "text": "Optimization isn't always removing uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.272,
    "end": 3048.639,
    "text": "Lots and tons of times, optimization is having more possibilities that are valid, that are viable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.66,
    "end": 3052.962,
    "text": "And that's the harder of those two things to determine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3053.543,
    "end": 3061.089,
    "text": "What's a viable alternative here as opposed to, am I getting closer and closer to being able to regenerate the copy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3066.195,
    "end": 3074.477,
    "text": " It makes me think about optimization when we're in the world of figure one and when we're in the world of figure two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3075.057,
    "end": 3080.779,
    "text": "So human on the bike and optimizing has to do with like speed on the bike.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3081.499,
    "end": 3081.759,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3082.179,
    "end": 3087.28,
    "text": "But now we're in figure two world and we're all going on a walk together, like the three of us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3088.16,
    "end": 3090.141,
    "text": "What is the optimum speed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.866,
    "end": 3098.051,
    "text": " It may have some of the same considerations as the bicycle, like we want to get there, we want to be safe, we don't want to break anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3098.992,
    "end": 3108.159,
    "text": "But then there is this relational layer where the optimum speed may be a pure group decision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.214,
    "end": 3127.164,
    "text": " And then what you said about optimization, how is optimization related to reducing uncertainty as well as, or in what cases, reducing options, which can be a one way to reduce uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3128.018,
    "end": 3130.802,
    "text": " Like you have equal uncertainty about a hundred options.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3130.862,
    "end": 3131.823,
    "text": "Let's just reduce it to two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3132.303,
    "end": 3134.146,
    "text": "You're still uncertain, but there's only two options.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3134.927,
    "end": 3139.312,
    "text": "But then you also mentioned adding more options and of what kind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3139.653,
    "end": 3141.955,
    "text": "So let's think about choosing a cereal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.696,
    "end": 3144.859,
    "text": "So there's a hundred cereals there in the store.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.9,
    "end": 3172.047,
    "text": " and we're in the figure one world it's just the dead cereals and they are uh passive recipients of our action selection maybe they're wiggling around a little bit on the shelves trying to escape but basically they're dead and we're taking adaptive decisions and so there can be uncertainty about which actions to take so yes we could increase our precision by having for for example fewer alternatives",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3173.186,
    "end": 3198.488,
    "text": " then again you said what about optimization via more acceptable alternatives what if there was a friend or a parent or a adaptive computer system that said would you like me to make some suggestions that's actually another option of a totally different type than serial one through 100. so you've added another option another affordance for action",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3199.767,
    "end": 3211.016,
    "text": " And in doing so, it's part of a trajectory that does minimize free energy and find some sort of satisficing solution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3211.976,
    "end": 3214.558,
    "text": "Or like, can I ask a question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3214.578,
    "end": 3218.802,
    "text": "It's actually an opportunity for an open-endedness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.003,
    "end": 3227.809,
    "text": "It puts a new affordance on the table when the adaptive entity asks like, okay, could I make a suggestion about your serial choice?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3229.07,
    "end": 3229.27,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3230.953,
    "end": 3232.713,
    "text": " Are you interested in this or that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3233.233,
    "end": 3241.975,
    "text": "Like it's actually adding more uncertainty about potentially even a novel introduction of now there's this dialogue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3241.995,
    "end": 3243.516,
    "text": "It's like, wait, I thought we were choosing a serial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3243.916,
    "end": 3245.636,
    "text": "Why are we now engaging in dialogue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3247.716,
    "end": 3255.458,
    "text": "But then it could be on the path to selecting a good serial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3258.8,
    "end": 3259.661,
    "text": " Can I just quote something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.681,
    "end": 3264.846,
    "text": "You just reminded me of something in the paper under the diachronic cognition of EAI in the 314.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3266.087,
    "end": 3270.352,
    "text": "I'll just read it because I think it's spot on to what you were just describing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.932,
    "end": 3279.301,
    "text": "Cognitive assemblies are formed and maintained diachronically beyond the local organism-centered boundaries of individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.878,
    "end": 3283.1,
    "text": " Kirchhoff, Malafouris, and Stotz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.9,
    "end": 3298.649,
    "text": "Cognitive assemblies are decentralized systems or networks of human and non-human agencies, which is what you were just describing, the tour in 1993, whose causal constitutive relationship",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3300.199,
    "end": 3305.803,
    "text": " depends upon self-organized processes distributed across the network that they constitute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.843,
    "end": 3311.006,
    "text": "So, yeah, I mean, I think the authors would agree with what you were just describing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.591,
    "end": 3326.756,
    "text": "I remember reading that the first time and thinking to myself, again, of Paul Kahn's book, The Origins of Order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3327.296,
    "end": 3327.816,
    "text": "So you have...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3329.659,
    "end": 3336.841,
    "text": " assemblies within, and then you have assemblies in terms of a larger energy package, a constitution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3337.641,
    "end": 3347.563,
    "text": "And so how does that ebb and flow relative to your own homeostatic and allostatic heuristics that you're following, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3348.204,
    "end": 3349.704,
    "text": "So, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.278,
    "end": 3387.115,
    "text": " that's again back to the witness piece right i don't know if this is exactly how to say it but i see this paper and line of research and thinking as being sort of the upswing of thinking about for e-cognition extended enacted embedded etc etc etc",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3390.347,
    "end": 3396.169,
    "text": " What does it look like to be on the upswing of taking 4E cognition as a starting point?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3397.129,
    "end": 3405.572,
    "text": "So no longer does non-4E have to be straw-personed or discussed pejoratively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3405.592,
    "end": 3410.634,
    "text": "Car companies today are not doing slam pieces on horses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.633,
    "end": 3421.981,
    "text": " There's a recognized place and time for people who are horses, and it's now in a different tech vertical than people who are now doing the differentiation between different cars that they might like to buy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3423.789,
    "end": 3429.131,
    "text": " when a technology actually does threaten it, like, hey, maybe you don't need to own a car.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3429.251,
    "end": 3433.453,
    "text": "Maybe there's going to be something you can trust on that will take you where you need to go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3434.053,
    "end": 3441.616,
    "text": "That is where you start to see the threatening and the responses and things like that, when there actually is a possibility to have a technological replacement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3442.217,
    "end": 3444.918,
    "text": "But there isn't a attack",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.46,
    "end": 3453.622,
    "text": " on non-extended, non-embedded, non-encultured cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3454.082,
    "end": 3461.585,
    "text": "The paper does not spend a massive amount of time describing that cultural priors influence cognitive process of individuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3463.705,
    "end": 3476.47,
    "text": "In descriptive and concise positive language, it is recouping and restating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3477.441,
    "end": 3489.186,
    "text": " an extended perspective and taking that as a starting point for moving forward and for modeling kinds of systems that previously had ineffective or incomplete models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3491.606,
    "end": 3498.649,
    "text": "Because hardly could it be said that this paper answers anything about extended cognitive process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3499.489,
    "end": 3504.151,
    "text": "In fact, we keep on coming back to the figure one, figure two, equation two, equation four step",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3506.328,
    "end": 3522.339,
    "text": " because it's subtle, but it is the contribution of this paper because they took active inference, which was always framed this way, extended it and showed, well, actually like this is a special case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3522.419,
    "end": 3528.584,
    "text": "Figure one of active inference was a special case of where there could be a more adaptive entity on the other side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3530.051,
    "end": 3541.443,
    "text": " And then that becomes reabsorbed into active inference and is a starting point for what I hope that we'll continue to discuss in some of the rest of this discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3543.55,
    "end": 3559.758,
    "text": " what is active inference and extended active inference particularly as a starting point look like rather than, well, we've done all of these attack ads versus earlier models of cybernetics or of ecological psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3559.778,
    "end": 3562.9,
    "text": "We've decimated the opposition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3562.98,
    "end": 3568.803,
    "text": "And now the only model that you can go forward with is active or is extended cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3568.903,
    "end": 3571.725,
    "text": "People who don't believe in extended cognition, just what are they thinking about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3572.725,
    "end": 3595.619,
    "text": " that isn't where our regime of attention or linguistics is let the record show so what does it look like when we actually do start to take steps forward in this figure two kind of world dean can i ask a question on that then would it not make sense",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3597.645,
    "end": 3603.432,
    "text": " to at least momentarily suspend many of the typical hierarchies that we apply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3603.712,
    "end": 3605.193,
    "text": "We can keep things nested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.192,
    "end": 3614.734,
    "text": " Those things continue to exist, but isn't extended active influence asking us to start from a place of not knowing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.214,
    "end": 3617.935,
    "text": "I mentioned this in the last live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.695,
    "end": 3632.539,
    "text": "I mean, if both people are willing to take that risk and face down that consequence, or if the entire audience has taken on that risk and taken that question on collectively,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3632.921,
    "end": 3650.072,
    "text": " Is that not the beginning of extended active inference, where now the environment access the scrutinizer as opposed to, oh, there's somebody who now judges all people who don't believe in extended active inference as being...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.238,
    "end": 3651.999,
    "text": " not legitimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.599,
    "end": 3663.365,
    "text": "The first thing that we have to do is allow the environment to be the scrutinizer as opposed to somebody else who's given that role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3664.946,
    "end": 3667.548,
    "text": "And I'm sincerely asking that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.168,
    "end": 3670.89,
    "text": "I'm not questioning whether that's even possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.43,
    "end": 3679.195,
    "text": "But if we're going to start down that road of applying extended active inference, then who's the judge here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3679.915,
    "end": 3680.736,
    "text": "And for how long?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3684.218,
    "end": 3689.966,
    "text": " If it's extended, it's extended active inference as opposed to mere active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.229,
    "end": 3693.992,
    "text": "Lou, you have a thought or I'll go?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3694.012,
    "end": 3695.714,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3698.51,
    "end": 3719.538,
    "text": " it makes me look in the bottom right corner of our video for act infer serve as we sometimes do and uh before the action potentially there's like this stop wait listen perceive that is silence and it's important to also recognize like a silence before and after a word so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3722.065,
    "end": 3726.046,
    "text": " Where the action perception loop begins and ends, no one knows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3726.787,
    "end": 3729.548,
    "text": "But you said, what happens when we start with not knowing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3730.168,
    "end": 3734.209,
    "text": "What if we start or intend for the environment to be the scrutinizer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3734.93,
    "end": 3738.491,
    "text": "How do we let the environment be the scrutinizer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3739.011,
    "end": 3750.295,
    "text": "Whether it's short, long, transient, we have to act because, hashtag figure two, our actions are the observations of the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3751.693,
    "end": 3769.949,
    "text": " So if we withhold action or act in a way that the scrutinizer is going to get the wrong impressions from, like we're the adversarial demon, it's like, oh, I prefer lower CO2, but then tee hee hee, I'm just putting a ton out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3771.81,
    "end": 3776.374,
    "text": "What could one ask the environment to make its inferences on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3776.814,
    "end": 3779.397,
    "text": "Only the Markov blanket, only the holograph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3780.143,
    "end": 3781.884,
    "text": " only the quantum experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3782.725,
    "end": 3790.61,
    "text": "And so action is how we allow the environment to make inferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3792.031,
    "end": 3799.777,
    "text": "Like two people, I don't know, operating on a saw or a tree, one person's pushing while the other one is pulling",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3802.941,
    "end": 3827.098,
    "text": " what are the consequences of our actions we don't know but we have expectations preferences and we reduce our uncertainty about all of that but when we don't know which is to say our cognitive process doesn't have precision and precision could also be a false belief so we have not knowing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3828.86,
    "end": 3850.865,
    "text": " in our non-extended act-inf, in our cognitive process, do we infer first and wait until we have higher precision, which again can be a false perception, and then that is actually implicitly putting one into the position of the central scrutinizer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3851.605,
    "end": 3854.246,
    "text": "It's like saying, when I'm ready to act, then I'll act.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3855.063,
    "end": 3856.484,
    "text": " but I'm going to wait until then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3856.824,
    "end": 3870.69,
    "text": "These are all of course simplifications and I know there's counterexamples that people can think of and that's rich and those counterexamples are in a yes and spirit because these are only some of the actions that I or you could take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3871.43,
    "end": 3878.613,
    "text": "But when we empower the environment, that doesn't mean that we don't act.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3882.106,
    "end": 3888.03,
    "text": " Does it not mean we interact more and we get out more often?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3889.011,
    "end": 3892.473,
    "text": "Isn't that the first assumption?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3892.513,
    "end": 3907.063,
    "text": "If we actually want the environment to become more involved in whatever it is, whatever the joint self-evidencing is, don't we have to actually allow the environment in by getting out more and interacting more?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.065,
    "end": 3910.225,
    "text": "Luke?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3911.542,
    "end": 3920.047,
    "text": " So I kind of find this like, if a tree falls in the forest and no one heard it, did the tree really fall?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3921.687,
    "end": 3934.074,
    "text": "So if there's no action, and I guess a tree falling down is also a tree doing action, maybe whether it's, you know, reactive inference or not, it doesn't really matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.094,
    "end": 3936.775,
    "text": "But I do think that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3939.482,
    "end": 3943.544,
    "text": " You know, something has to happen for the environment to perceive it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.704,
    "end": 3947.046,
    "text": "Otherwise, what is the environment perceiving?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.066,
    "end": 3959.974,
    "text": "Yeah, so I think we're navigating on it, but I think it's harder for us to perceive in our minds how it might be navigating on us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3959.994,
    "end": 3964.436,
    "text": "I mean, we pick ourselves up, put ourselves on an airplane and fly somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.837,
    "end": 3966.097,
    "text": "So that's pretty easy to track.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3968.22,
    "end": 3978.383,
    "text": " But I don't know that we necessarily know until we bump into that payphone in that foreign niche how that's going to necessarily navigate on us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3979.783,
    "end": 3986.345,
    "text": "We don't know until we actually put ourselves in that position and then decide what that interaction will or will not be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.605,
    "end": 3990.806,
    "text": "Do I take a picture of it because, whoa, I just found something I haven't seen in a long time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3991.207,
    "end": 3992.267,
    "text": "Or do I actually pick it up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.191,
    "end": 3996.654,
    "text": " and have its affordances play on me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3997.234,
    "end": 3999.817,
    "text": "That's the harder part to get your mind around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3999.837,
    "end": 4008.564,
    "text": "It seems like it's imaginal and philosophical, but it's really navigational and wayfinding and reorienting, updating, updating, updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.464,
    "end": 4010.826,
    "text": "So can I just respond really quick?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.267,
    "end": 4014.028,
    "text": "I think that you are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.042,
    "end": 4029.761,
    "text": " dealing with or thinking about when you're thinking about cognitive uploading and this has like been consistent through this stream and the last stream you're talking about putting yourself in a foreign environment right so like i would have to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.382,
    "end": 4050.511,
    "text": " by leaving my office getting on a plane arriving in Switzerland and getting off the plane and now I'm in a foreign environment right and so what do I perceive in this foreign or in this novel environment but but simply the act of moving from a familiar environment to a novel environment is also an action right mm-hmm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.707,
    "end": 4074.805,
    "text": " completely it's an epistemic forging action to be in a new informational niche to jump into a new paper to listen to a live stream that somebody might not otherwise like take a little journey with us and it is definitely one of the most important kinds of action to study",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4075.819,
    "end": 4085.322,
    "text": " just like they bring up epistemic actions at the end of this paper, like knowing where to look, like what is on page 50 of this book?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4087.062,
    "end": 4091.243,
    "text": "One has to have precision in an action policy to know where to look, that's an epistemic action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4091.923,
    "end": 4097.085,
    "text": "And Dean, you've brought together the spatial navigation elements,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4098.18,
    "end": 4100.221,
    "text": " with the epistemic aspect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4100.882,
    "end": 4106.025,
    "text": "And then even in that example of the payphone, we see epistemic and pragmatic value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4106.245,
    "end": 4115.27,
    "text": "Like if it's high novelty, high epistemic value, that might induce a certain kind of action, like taking a picture maybe to document it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4115.61,
    "end": 4119.893,
    "text": "But then also there's the pragmatics of the phone, like using it to make a call.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4121.254,
    "end": 4126.297,
    "text": "So this type of action to have the initiative just to get up,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4127.188,
    "end": 4142.784,
    "text": " and to do something and to have bounded modeling and just knowing that one will know enough when they're in that situation or that it's low stakes enough that it doesn't really matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4143.945,
    "end": 4144.826,
    "text": "That's very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4145.046,
    "end": 4147.649,
    "text": "So let me read something that is in live chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4147.729,
    "end": 4148.69,
    "text": "So Steven wrote,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4150.202,
    "end": 4159.416,
    "text": " This paper extends towards the mind body spirit environments dynamic by starting in terms of what most active models focus on generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4160.437,
    "end": 4164.143,
    "text": "How can we start bigger, bolder and work back in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4169.574,
    "end": 4171.916,
    "text": " So I'll just give a first thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4171.956,
    "end": 4173.177,
    "text": "Thanks for the question, Steven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4174.558,
    "end": 4188.008,
    "text": "So I believe that when Steven is saying where most active models focus on or start on, which is like the generative model of the particular entity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4188.589,
    "end": 4195.574,
    "text": "And the particular entity, the thing, which is the thing as distinguished from the environment, is this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4196.635,
    "end": 4197.055,
    "text": "That is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4197.921,
    "end": 4201.93,
    "text": " the blanket states and the cognitive states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4202.09,
    "end": 4204.615,
    "text": "Blanket and internal states constitute the thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4205.156,
    "end": 4206.118,
    "text": "Like the car...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4208.157,
    "end": 4220.723,
    "text": " Of course, here we would take the car as process and the car includes the roads and the stop signs, but the car as a thing partitioned from its environment is the blanket and internal states of the car.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4221.403,
    "end": 4236.25,
    "text": "And so extended, the idea that this is the thing, but that it's extending its function in a more distributed way, in a way, as I think we may have even talked about last week, reifies that as the thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4237.182,
    "end": 4249.424,
    "text": " Like when the person puts the post-it note and we call that extended organismal cognition, do we not reify and maybe even implicitly constrain what organismal cognition is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4249.784,
    "end": 4254.245,
    "text": "Because we're saying, well, an organism with a post-it note is extended organismal cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4254.625,
    "end": 4258.706,
    "text": "So that means that regular organismal cognition isn't that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4259.346,
    "end": 4265.947,
    "text": "So when we go to the figure two world, we can then ask about, well,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4267.133,
    "end": 4269.934,
    "text": " there's now a generative model on both sides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4270.834,
    "end": 4276.495,
    "text": "That's what we were looking at with our colorful boxes last time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4277.515,
    "end": 4279.516,
    "text": "Each one of these boxes is a thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4280.576,
    "end": 4284.837,
    "text": "And then we talked about how they make up a bigger thing together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4285.677,
    "end": 4288.658,
    "text": "They make up a different generative model together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4289.298,
    "end": 4292.439,
    "text": "So this thing, the green thing on the right,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4293.985,
    "end": 4295.188,
    "text": " is still a generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4295.228,
    "end": 4302.002,
    "text": "So it's not like we're going to escape Act-Inf's highlighting of generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4303.323,
    "end": 4331.869,
    "text": " but rather we recognize that generative models can have sub partitionings and that some of the cases that we might want to think about involve like a partitioning between what are classically understood to be autonomous entities and their niche and so it's almost like from the atomic active not the quantum just like sort of a single entity where we're going to put less emphasis on the niche then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4332.987,
    "end": 4347.577,
    "text": " With extended act-inf, we start to recognize the niche as an active entity, not of the same type, but of the same structure in terms of performing optimization on both sides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4348.517,
    "end": 4361.546,
    "text": "And then that really moves us to a place of like synthesis, which is it's just like holistic act-inf or it's just, it is extended active inference, but we're not saying who it's extended from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4362.751,
    "end": 4379.869,
    "text": " It's just, we're taking a total modeling perspective on all these activities, as well as all of these activities now with the red line, but then what does that make the purple line?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4380.785,
    "end": 4382.506,
    "text": " And what is its niche?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4382.986,
    "end": 4394.453,
    "text": "And that comes back to the point about composability, which is like, we could stop with just the black box and say, we're just modeling the entity and we're not gonna think about the environment as a thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4394.533,
    "end": 4398.836,
    "text": "We're gonna think of it as the heat sink, just like our quantum colleagues reminded us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4399.596,
    "end": 4410.283,
    "text": "Or maybe we want to model both sides of the table as things, but then in doing so, we make them into this joint generative model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4411.519,
    "end": 4413.48,
    "text": " So again, we didn't escape generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4414.04,
    "end": 4426.206,
    "text": "We actually only reified the need for them because now we've made this fusion generative model, but now we're back to where we were earlier, which is implicitly taking the environment to be the heat sink.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4432.309,
    "end": 4432.51,
    "text": "Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4434.27,
    "end": 4437.112,
    "text": "So I have a thought, if you can go back to figure two, that'd be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4438.613,
    "end": 4461.603,
    "text": " um just about um what happens and this goes back to what dean was talking about earlier when we're talking about scaling and where do you put the markov blanket so here we have the niche and the environment doing this joint self-evidencing um and what happens when like they're trying to fit to each other right but i mean we all have seen circumstances where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.174,
    "end": 4465.676,
    "text": " someone doesn't quite fit in with the crowd, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.756,
    "end": 4473.801,
    "text": "And so like, this is how like people become school shooters or radicalized or, you know, bullied or, you know, we've all seen someone doesn't matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.841,
    "end": 4475.102,
    "text": "They see their niche environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.142,
    "end": 4479.685,
    "text": "They just can't quite fit like a square peg trying to fit into a round hole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.785,
    "end": 4485.348,
    "text": "And this happens, like I just was writing about this, you know, last night when we,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.529,
    "end": 4496.357,
    "text": " if we were to take an organism and put it in a novel environment, as Dean was suggesting earlier, but like, I mean, take a bacterium that lives in a hot springs and put it in a cold water pond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.818,
    "end": 4501.562,
    "text": "It's not going to do very well because it's just, that's the wrong place for it to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.582,
    "end": 4512.971,
    "text": "And I just was really talking with Chris Fields yesterday about what makes you put a Markov blanket in a certain place or what makes things, and this is like one of the fundamental things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.173,
    "end": 4527.905,
    "text": " the big it's the big question it is the question where do you put the markov blanket like where you can establish conditional independence okay so like i get that answer but but at the same time you can kind of put it wherever you want it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.148,
    "end": 4540.201,
    "text": " So when there's maladaptive fit to the niche environment, does that make it pop out of the Markov blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.241,
    "end": 4542.664,
    "text": "And what is the threshold for that maladaptive fit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4543.605,
    "end": 4545.408,
    "text": "These are just the things that I want to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.685,
    "end": 4565.112,
    "text": " In the Acton textbook and in other sources, there's a discussion of Bayesian brain and of computational approaches to neurophysiology, neurodiversity, psychopathology, all of these different areas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4565.832,
    "end": 4577.898,
    "text": "And by integrating them, we kind of see that just like Axel's bacteria can be doing exact Bayes or variational Bayes free energy minimization right off the cliff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4578.809,
    "end": 4584.535,
    "text": " that hot water bacteria in the cold water is going to continue minimizing its free energy up until it dies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4585.176,
    "end": 4593.565,
    "text": "And so, if systems are always doing free energy descent,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4595.453,
    "end": 4616.783,
    "text": " where do we get to say which kinds that we prefer like maybe um we need to bring that purple line back and what's on the other side of the purple line is like the modeler like we've still been thinking about this in a very like entity it's physical environment partitioning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4617.694,
    "end": 4622.001,
    "text": " But this comes back to what happens before the graphical model gets drawn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4622.702,
    "end": 4632.337,
    "text": "That's the first Markov blanket where now you in that paper or you in that graphical representation, now there's a blanket between the two of you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4633.51,
    "end": 4638.714,
    "text": " but it's almost like there's this modeling impulse that is not extended.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4638.774,
    "end": 4650.182,
    "text": "It's within a cognitive entity, whether that's a person bouncing around their head, whether it's a group that hasn't externalized the model, but they're bouncing it around in each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4650.202,
    "end": 4662.852,
    "text": "And then when they externalize it, when they externalize this as a model, that is an action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4664.144,
    "end": 4671.67,
    "text": " It's not the only kind of action to take, but then that is the zero to one step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4671.77,
    "end": 4672.25,
    "text": "Yes, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4674.232,
    "end": 4689.423,
    "text": "And to both of your comments, one of the things in our program that we used to talk about all the time is we don't want your sponsor, the person who is essentially taking you and inviting you into their professional setting, their professional cognitive niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4690.104,
    "end": 4692.305,
    "text": "We don't want you to turn that person into teacher 2.0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4694.312,
    "end": 4701.135,
    "text": " We don't want you to have the same expectations of that person as you have of the person that's in the classroom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4701.215,
    "end": 4718.841,
    "text": "One of the things that you have to try to do is be adaptive and extend what you then can accommodate in terms of these various formalized cognitive niches that you're now gaining access to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.827,
    "end": 4749.505,
    "text": " I just think that that joint self-evidencing part is really, really critical because I think for most of us, it's hard for us to get our heads around the idea that, well, I have a certain agency and then I have other people who have leverage over me and they can tell me what I can and cannot do versus the person who goes into a situation and says, I'm a proportion of a larger energy group",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4750.908,
    "end": 4754.349,
    "text": " situation, set, volume, whatever you want to call it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.849,
    "end": 4766.573,
    "text": "And somebody has been able to find another person who, despite the fact that they have a lot more experience than me, is also able to perceive themselves as a proportion and is prepared to base update.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4766.913,
    "end": 4776.737,
    "text": "And now giving that relational composition all the support and resources that you possibly can so that you're actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.751,
    "end": 4802.621,
    "text": " generating this possibility of being able to invent together as opposed to one person's downloading to another, which I found traditionally, even in those transdisciplinary settings, which I really like, even those tend to revert back, regress back to an average of, I want to stay in my safe place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.161,
    "end": 4806.463,
    "text": "I want to stay with what I know and only share those things that I know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4807.831,
    "end": 4820.737,
    "text": " Rarely will you find a situation like the one we have here where every single time I walk into one of these live streams, I assume I'm going to learn way more than I can bring to the actual conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4821.417,
    "end": 4826.199,
    "text": "And if I come into it with that sort of humble sense that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4827.901,
    "end": 4830.842,
    "text": " I can't come from a place of everything that I know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4830.902,
    "end": 4842.646,
    "text": "I have a few experiences that I can share and say, I think that this validates some of the ideas that we have, but I never come at it with a situation of going, well, I'm going to school everybody up today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.567,
    "end": 4852.37,
    "text": "I think it's the interaction part, and I think it's the getting into those places of necessary discomfort, because we do...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.598,
    "end": 4858.105,
    "text": " find ourselves lots of times in these papers, not really knowing where it's going to end up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4858.386,
    "end": 4864.776,
    "text": "And you have to kind of have the strategies and the attitude to be able to handle that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4865.357,
    "end": 4867.36,
    "text": "And so when we develop that in people,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.427,
    "end": 4875.131,
    "text": " What does that do in terms of giving them a better sense of what applied active inference really means?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.892,
    "end": 4881.035,
    "text": "We have to go a step back and say, so what strategies do you use right now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.335,
    "end": 4883.297,
    "text": "What are your default heuristics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4883.777,
    "end": 4891.442,
    "text": "When you find those heuristics, as Blue pointed out, being applied in certain social settings and getting rejected, now what do you do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.71,
    "end": 4905.762,
    "text": " Okay, I'm going to plateau on this slide elaboration to see what this might reflect on either of you about applying active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4906.664,
    "end": 4909.608,
    "text": "So now we've added in another layer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4909.808,
    "end": 4912.632,
    "text": "So here's the active inference modeler team.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4914.475,
    "end": 4926.919,
    "text": " making figure two model, making a model where there is intelligence on both sides of the table, whereas here they're making something more like figure one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4928.2,
    "end": 4940.564,
    "text": "So in this case, the modeler, in the more figure one-like case, there's more of a tendency, speculating, for the modeler",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4941.707,
    "end": 4953.534,
    "text": " to just project their cognition into the model as it interfaces with a more passive or non-agentic surrounding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4954.814,
    "end": 4968.002,
    "text": "When we start thinking about making models where there's agency on both sides, then it's like we have that realization",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4969.119,
    "end": 4972.821,
    "text": " that we're also on the other side of something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4975.622,
    "end": 4995.573,
    "text": "And so that is some of the implicit, esoteric, impactful interfaces of modeling as development and modeling as personal and multi-scale development",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4996.98,
    "end": 5013.114,
    "text": " Because there is a difference with making these two different types of model in what this individual thinks and their thought loops change how they act and their actions are the environment's sense states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5014.515,
    "end": 5015.016,
    "text": "So it's like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5018.203,
    "end": 5024.186,
    "text": " there's a lot of ways to go with it and a lot of loops of cognition and perception and action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5024.846,
    "end": 5036.832,
    "text": "But again, it's taking those intertwined and nested and laterally interacting perception, cognition, action loops, taking that as a starting point, not as an ending point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5037.493,
    "end": 5040.014,
    "text": "So we don't need to talk about how it's not that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5041.034,
    "end": 5045.857,
    "text": "We need to talk about applying active inference so that it can be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5046.974,
    "end": 5076.277,
    "text": " starting point and it is a starting point and we're on the journey anyone who's paying attention is but what happens as we continue in that journey are either of you gamers like do you do gaming i have a little bit but like as a teenager or something but not not so much anymore",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5079.957,
    "end": 5082.559,
    "text": " Because in that environment, I don't do it at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5083.22,
    "end": 5092.667,
    "text": "But in that virtual environment, I have a number of friends who have picked up the virtual reality gear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.687,
    "end": 5095.389,
    "text": "And they absolutely love it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5095.609,
    "end": 5100.453,
    "text": "In that kind of an environment, they are neophilic through and through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.473,
    "end": 5103.555,
    "text": "And they want to share that with me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.575,
    "end": 5106.117,
    "text": "I mean, they want to invite me in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5106.137,
    "end": 5106.698,
    "text": "They want...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.443,
    "end": 5114.569,
    "text": " me to kind of join that world of playing virtual tennis with them because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5116.085,
    "end": 5117.466,
    "text": " They just have so much fun in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5117.747,
    "end": 5134.7,
    "text": "So a big part of this, although it's not my cup of tea anymore than robots are, I can see where you can take these basic principles of applying active inference, and it doesn't always have to be pick yourself up physically and board an airplane and whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5135.201,
    "end": 5137.362,
    "text": "You can do it virtually as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5137.803,
    "end": 5140.084,
    "text": "It's just that knowing when those...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5141.005,
    "end": 5162.429,
    "text": " when those conditions and circumstances are such that people want to move concentrically and circularly around a certain set of conditions, whether limited by the number of pixels or limited by their wanting to control their carbon footprint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5163.55,
    "end": 5169.531,
    "text": "But again, the applied active influence part isn't necessarily something that's always",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5171.171,
    "end": 5175.995,
    "text": " I have to get on the big rocket and away we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5176.015,
    "end": 5189.366,
    "text": "I think this does take us towards this question of wanting to apply active inference or wanting to be applying active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5190.046,
    "end": 5193.209,
    "text": "Expecting and preferring oneself to be applying active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5193.849,
    "end": 5197.292,
    "text": "If you don't expect and prefer that, fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5199.568,
    "end": 5202.437,
    "text": " Do what you expect and prefer, and you will.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5203.46,
    "end": 5206.71,
    "text": "But then what brings one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5209.232,
    "end": 5233.007,
    "text": " from seeing a phenomena from being curious about payphones and technology adoption in this or that region of the world or wanting to understand how moving a bacteria from one temperature and salt concentration to a different niche how to model that or all of these other processes that come up as examples or as ancillary to some of the discussions that we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5234.128,
    "end": 5243.171,
    "text": " How do we go from that phenomena that has taken our interest, that we've distinguished that phenomena from the other phenomena?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5243.371,
    "end": 5246.312,
    "text": "Like I'm talking about the rotating of the hurricane.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5246.612,
    "end": 5251.514,
    "text": "I'm not talking about the fact that the clouds are gray or that it's 21,000 feet off the ground.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5251.654,
    "end": 5259.357,
    "text": "Like there's a phenomena, not the only phenomena, but there's something, and thing ends with ing too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5259.917,
    "end": 5262.138,
    "text": "So something, ing, that has...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5263.171,
    "end": 5265.573,
    "text": " come onto our radar?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5267.415,
    "end": 5280.966,
    "text": "And then how do we go from that T-H-I-N-G or other thing towards active inference models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5281.987,
    "end": 5288.193,
    "text": "And that space before the modeler has even written down a Bayes graph",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5289.124,
    "end": 5301.907,
    "text": " before they in their journey may even know what a Bayes graph is or a way to interpret it, let alone the minimum of two ways to interpret it, what's happening in that space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5301.967,
    "end": 5304.628,
    "text": "And is that applying active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5306.528,
    "end": 5312.57,
    "text": "Even if it's only recognized later that it was applying active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5323.524,
    "end": 5344.976,
    "text": " Well, I don't have much more to say on it except the fact that I think that a lot of us are trained in formal education settings to never actually really apply active inference in terms of that formality around what we predict we have to do in order to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.843,
    "end": 5351.124,
    "text": " come out the other side of that particular kind of formalized and structured learning journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5351.604,
    "end": 5354.124,
    "text": "That's what I know from my own experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5354.165,
    "end": 5368.547,
    "text": "I mean, until there was an active inference group, something formally organized around the concept of active inference, I would not have guessed, I would not have predicted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5371.394,
    "end": 5378.475,
    "text": " that there would be the kind of interest that we are now trying to evolve and support.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5379.716,
    "end": 5391.918,
    "text": "This is still very nascent in terms of its acceptance and its uptake if we're going to talk about uploading in terms of what kinds of alternatives we could at least give",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5400.419,
    "end": 5429.649,
    "text": " some consideration too i can show an image from the textbook from the active textbook and kind of reflect on that and this is just this is the appetizer of the appetizer because of course we're going to have the textbook group and multiple cohorts of that where we like go through it and the textbook is an appetizer to the appetizer and so just it's a fractal it's a crumb",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5432.29,
    "end": 5435.995,
    "text": " We've been talking a lot about graphs that look like the one on the top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5436.943,
    "end": 5451.213,
    "text": " And so this is the same kind of partially observable Markov decision process written in a slightly different way, slightly different labeling, like a three instead of a D and a two instead of an A and a B here and et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5451.433,
    "end": 5454.335,
    "text": "So same, but a little different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5455.035,
    "end": 5464.782,
    "text": "And in this type of model, we talk about like the state at a given time, S of T, and then we talk about the transitions of it being different at a different time point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5464.862,
    "end": 5466.443,
    "text": "Like here is the past,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5467.203,
    "end": 5470.045,
    "text": " and then the transition to the present, the present, the transition to the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5470.605,
    "end": 5475.168,
    "text": "And then at each of those time steps, there's like the emission of some observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5475.548,
    "end": 5482.912,
    "text": "So there's the dynamics of the translation of the underlying hidden state, and then there's the emission of observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5482.933,
    "end": 5484.934,
    "text": "That's the part that makes it like partially observable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5485.454,
    "end": 5486.815,
    "text": "And then there's action in the loop with pi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5487.635,
    "end": 5489.176,
    "text": "Okay, that's the top one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5490.657,
    "end": 5493.079,
    "text": "The bottom one is clearly drawn",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5494.136,
    "end": 5504.763,
    "text": " if we can have a theory of mind of the authors to reflect some isomorphisms or similarities structurally between this top representation and the bottom one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5505.643,
    "end": 5510.146,
    "text": "And they discuss, we're going to appeal to these throughout the remainder of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5510.606,
    "end": 5516.07,
    "text": "Okay, so the tops, the POMDP sequence of states evolving through time indexed by the subscript.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5516.71,
    "end": 5526.235,
    "text": " bottom continuous time model of the sort implied by stochastic differential equations with prime notation indicating temporal derivatives so here x",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5528.064,
    "end": 5530.405,
    "text": " is like the hidden state now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5531.606,
    "end": 5535.027,
    "text": "X prime is the rate of change of the hidden state now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5535.868,
    "end": 5542.711,
    "text": "X double prime is the second derivative, so not just like the velocity, but the acceleration of the hidden state now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5543.591,
    "end": 5550.655,
    "text": "Each of those are emitting observations in this Y prime space, but now three",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5552.259,
    "end": 5561.294,
    "text": " The B up here does not reflect how things change through time, but rather how derivatives are taken now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5562.276,
    "end": 5566.182,
    "text": "And so this is like time series planning with time series inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5567.13,
    "end": 5568.711,
    "text": " Where should we be in five time steps?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5569.031,
    "end": 5572.653,
    "text": "Well, let's explore and roll out where we could be in five time steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5573.373,
    "end": 5579.976,
    "text": "The bottom is more like a Taylor series because we're only staying with two feet now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5580.656,
    "end": 5582.237,
    "text": "And then we're just asking, okay, where are we now?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5582.397,
    "end": 5584.698,
    "text": "That's our first fundamental frequency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5585.338,
    "end": 5586.859,
    "text": "Then where's the rate of change?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5587.219,
    "end": 5589.02,
    "text": "And where's the second derivative of the rate of change?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5589.52,
    "end": 5592.722,
    "text": "And so we're approximating a future unfolding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5593.855,
    "end": 5599.478,
    "text": " using only the generalized coordinates of motion in one time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5600.058,
    "end": 5604.24,
    "text": "And so there isn't an explicit modeling of any future time points at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5604.6,
    "end": 5607.341,
    "text": "It's not x prime of t plus one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5608.161,
    "end": 5612.643,
    "text": "This is all about the derivatives of motion at this time point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5613.464,
    "end": 5616.565,
    "text": "So we've been having some interesting conversations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5617.706,
    "end": 5622.388,
    "text": "What kind of thing allows these representations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5623.78,
    "end": 5650.448,
    "text": " and then thinking about what kind of thing that is and actually how different these representations are despite being able to be laid out graphically in a similar way there are more in this family of graphs that we haven't seen even if these two uniquely identified one thing and that one thing was the one thing there still would be other representations we haven't seen so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5656.859,
    "end": 5659.762,
    "text": " So you're way ahead of me in the textbook because you're a good student like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5659.782,
    "end": 5661.203,
    "text": "I haven't come to that picture yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5661.323,
    "end": 5670.069,
    "text": "But I think it's interesting that when things are changing rapidly, we notice them more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.089,
    "end": 5673.892,
    "text": "And when things are changing slowly, we don't notice them at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5674.512,
    "end": 5681.237,
    "text": "So what effect do first and second order derivatives have on our perception of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5681.577,
    "end": 5684.679,
    "text": " Like a frog being boiled in hot water, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5684.699,
    "end": 5685.419,
    "text": "Or in tap water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5685.479,
    "end": 5690.121,
    "text": "If you take it room temperature water and slowly increase it, it doesn't really notice that it's being boiled alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.642,
    "end": 5696.745,
    "text": "But if you take it from, you know, it's cold, nice, cool pond into a pot of boiling water, it's going to big time notice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5697.545,
    "end": 5709.211,
    "text": "So, so I wonder, you know, does perception increase with first and second order derivatives or, or the sensation increase the magnitude of the sensation or the perception?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5709.231,
    "end": 5709.371,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5714.38,
    "end": 5718.661,
    "text": " When some things change so fast, they again become imperceptible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5719.321,
    "end": 5724.802,
    "text": "Like a helicopter blades, and then it becomes again, or like a frequency that just becomes inaudible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5731.584,
    "end": 5734.064,
    "text": "Is it like parabolic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5734.104,
    "end": 5742.426,
    "text": "Like, you know, we get max perception, like when the rate of change is between this and this, and then no perception and no perception over on the other side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5742.706,
    "end": 5743.006,
    "text": "It's like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5744.153,
    "end": 5745.694,
    "text": " It's like tuning in and tuning out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5746.194,
    "end": 5752.716,
    "text": "There's some wavelength that's being optimally perceived and then there's trailing off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5753.657,
    "end": 5760.499,
    "text": "So now let's go back to figure two and think about blue like you brought up at the beginning, like improvisation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5761.439,
    "end": 5771.083,
    "text": "Now, when we're doing improvisation, do we, in what ways do we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5772.651,
    "end": 5796.185,
    "text": " do time series modeling to explicitly predict how i will be and how they will be in the future at specific future time points and or if we are uploading not just offloading what if we just have to where is their arm is it accelerating is it changing how it's accelerating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5797.441,
    "end": 5813.989,
    "text": " rather than where will their arm be in 30 minutes, one can just say in the very short term in a playful space, how can we just listen to how things are, how they're changing and how that's changing and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5816.79,
    "end": 5825.775,
    "text": "How does that move from playful contact improv into digital stigmergy that makes useful productive technologies",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5827.119,
    "end": 5828.08,
    "text": " It's another question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5828.88,
    "end": 5830.161,
    "text": "One of those questions isn't better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5830.181,
    "end": 5835.604,
    "text": "It's awesome that we have a framework that helps us address both of them as well as other questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5839.947,
    "end": 5845.91,
    "text": "What happens when we think about offloading and uploading using the structures that we've seen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5846.21,
    "end": 5852.254,
    "text": "We won't go into it today, but like we've added this extended perspective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5854.284,
    "end": 5882.11,
    "text": " to what will be evoked when we hear about actin in the future it's like charging that term with more and more ways to relate it like it'll be interesting to find out there will be epistemic and pragmatic value in finding out dean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5885.17,
    "end": 5888.311,
    "text": " Daniel, because I haven't seen this before you put it up here today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.351,
    "end": 5891.431,
    "text": "You've got the book, but I've just read the introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.332,
    "end": 5906.775,
    "text": "Do you think going forward, if we're going to get to a place where we're going to feel comfortable in terms of developing the conditions around which active inference is more easily uptaken or adopted,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5907.634,
    "end": 5917.151,
    "text": " or given there's a certain confidence around using that methodology to inform what's on the other side of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5919.744,
    "end": 5920.725,
    "text": " yet to be observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.125,
    "end": 5931.651,
    "text": "Is there a Monte Carlo aspect to this in terms of just having to play out a few hands and getting comfortable with the fact that that takes a while?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5932.171,
    "end": 5948.421,
    "text": "Is that perhaps why the diachronic piece was introduced and kept right near the end where the remarks are in the sense that we all seem to be time constrained and we want to make sure that we're getting value for our dollar from our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5949.242,
    "end": 5970.725,
    "text": " ways of doing things but if we're going to look at it from the perspective of distributing cognition in the globe there was still going to be some ad hoc aspects of this that kind of play out Monte Carlo style like you went to one performance and then you went to the the next performance five hours later and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5972.233,
    "end": 5977.877,
    "text": " would you go in with an expectation that you're going to see an exact copy of what you saw before?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5978.237,
    "end": 5992.427,
    "text": "And does that change the value of being now part of that collector or that constituted cognitive niche, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5993.267,
    "end": 5998.091,
    "text": "So maybe one of the things we have to do is ask ourselves, if we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5999.372,
    "end": 6025.238,
    "text": " want people to be able to take this on, the idea of active inference and extended, making it safe for them not to feel as though if they don't come up with the correct answer out of the series of four, that that's not the only way to measure whether or not you're gaining confidences around how your generative model gives you a chance to maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6026.943,
    "end": 6032.847,
    "text": " decide who the two finalists are in said competition still six weeks away from now, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6032.867,
    "end": 6053.16,
    "text": "Like, and I don't want everything now to become about online gambling, but I mean, there are actual things that we can find in the niche that are currently there that would give people a better sense of what information they might, may or may not need in order to be able to make, open that, that basal ganglia or close it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6054.087,
    "end": 6056.73,
    "text": " Because there's a lot of times we know that we should close it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6057.191,
    "end": 6058.993,
    "text": "We just should not go forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6059.995,
    "end": 6067.084,
    "text": "So yeah, again, I think, I think it, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6068.635,
    "end": 6094.821,
    "text": " It may be some of these things come back to how much time we're willing to spend on it and whether we see the investment of time at the front end paying off exponentially at the back end or whether we just stick with those methods that we are familiar with because we know at the end of the 13-week cycle, we can say we've now accounted for X amount of a download or an offload or a dump.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6096.802,
    "end": 6098.342,
    "text": "I wonder if that's part of where we're at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6108.032,
    "end": 6131.226,
    "text": " blue this is only a partial a partial um alignment just a yes and what you said it's not a direct example or a contradiction or anything but if we think about the tech adoption curve of cars and advanced modern technology extending back infinitely it's like it asymptotes back infinitely",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6133.173,
    "end": 6153.479,
    "text": " When I hear you talking about 13-week quarter educational paradigm, the instructionist paradigm, which may be able to get you from three out of 10 on the week one assessment, and then we have a strategy that gets this percentage of people to seven out of 10 on the week one assessment in this set of instructions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6153.859,
    "end": 6157.1,
    "text": "The teachers get the instructions and they give different instructions to the learners.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6160.856,
    "end": 6170.159,
    "text": " Then you said in contrast, there's putting the time in upfront and receiving super linear reward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6171.38,
    "end": 6182.424,
    "text": "And so it's like the long phase where the technology is developing and that's sort of happening in someone's life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6184.364,
    "end": 6188.606,
    "text": "And then I saw that as connected to the gaming question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6189.54,
    "end": 6194.583,
    "text": " And so we have a lot of the tools for that micro gaming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6195.344,
    "end": 6212.315,
    "text": "Getting people to engage in instructionalist activities has been gamified to a fine art and science, and it will become more intense in the coming years, we can expect, even if we cognitively say we don't prefer that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6213.496,
    "end": 6218.079,
    "text": "So how do we...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6220.054,
    "end": 6234.746,
    "text": " interact, not just instruct in a way where somebody who is spending one hour a week on Act-Inf goes to 10 and somebody who's at zero goes to one, but we don't need to take 10 to 100.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6237.284,
    "end": 6238.424,
    "text": " probably most of the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6238.984,
    "end": 6241.445,
    "text": "And how much time should people be spending on Act Dymph?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6241.765,
    "end": 6243.465,
    "text": "What should they expect to get out of this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6244.065,
    "end": 6247.266,
    "text": "What do people expect from listening to live streams?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6247.646,
    "end": 6248.346,
    "text": "They should comment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6248.866,
    "end": 6250.987,
    "text": "If they're listening, it's a special request.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6251.727,
    "end": 6254.988,
    "text": "They should comment for what they do expect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6255.508,
    "end": 6264.49,
    "text": "That would be interesting to know because otherwise it's us acting without that much of a sense back from our environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6265.393,
    "end": 6277.339,
    "text": " And so that puts us more into a figure one paradigm rather than a figure two paradigm, even if the material is so massively nuanced and interactive itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6277.359,
    "end": 6280.301,
    "text": "So there's definitely a lot on the table.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6280.621,
    "end": 6293.467,
    "text": "Hopefully the table is set such that those who are 5.8 hours in to paper number 41, that they're more intrigued and motivated by rather than",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6295.635,
    "end": 6313.45,
    "text": " reflexively looking for that two minute explainer video because some of these ideas may occur at a cognitive pace that is slower than that video in its whole and require regimes of attention that are not amenable to being driven in the same way as um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6317.429,
    "end": 6324.099,
    "text": " addictive, repetitive behaviors in other like micro mining educational situations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6325.301,
    "end": 6325.521,
    "text": "Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6327.724,
    "end": 6332.251,
    "text": "So there's a whole science behind the gamification of everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6333.582,
    "end": 6341.546,
    "text": " And I wonder if our ability to do that in an educational setting, but also in a work setting, I mean, they like, you know, have performance metrics and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6341.566,
    "end": 6344.148,
    "text": "I mean, we have metrics for posts on Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6344.208,
    "end": 6345.068,
    "text": "How many likes do you get?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6345.428,
    "end": 6348.57,
    "text": "How many people liked the photo you put on Facebook?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6348.93,
    "end": 6351.572,
    "text": "I mean, we metric, we have metrics for everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6351.612,
    "end": 6353.913,
    "text": "And so we can gamify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6353.933,
    "end": 6359.276,
    "text": "I mean, we gamify things for ourselves, but things are externally gamified for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6360.156,
    "end": 6361.037,
    "text": "And I wonder if, if,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6362.586,
    "end": 6364.708,
    "text": " it's successful and it's very successful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6365.028,
    "end": 6378.378,
    "text": "I don't know that it's optimal because I think it leads to like other problems, but does the gamification of everything, is that like a replacement of our preferences for just like winning the game?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6379.739,
    "end": 6383.542,
    "text": "Like ultimately, like do, like, you know, I would prefer to be happy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6383.562,
    "end": 6390.668,
    "text": "I would prefer to engage meaningfully with my colleagues and, you know, fellow students in the class.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6391.584,
    "end": 6400.773,
    "text": " But instead we are like in this weird warped gamified way that we have to like, everything conforms to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6401.935,
    "end": 6403.756,
    "text": "Even though it's not aligned with my preferences,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6404.804,
    "end": 6414.306,
    "text": " I shift like, so, so the preference for taking the game, just like, or for winning the game, just like takes over your entire model with all of your other preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6414.346,
    "end": 6415.226,
    "text": "Like, why does that work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6415.366,
    "end": 6422.167,
    "text": "Or how I wonder, like, can we active inference that like the active inference of gamification, that would be super interesting to just look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6422.527,
    "end": 6429.528,
    "text": "Like what happens is that that one preference for just like winning, ticking up a notch or like gaining more metrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6430.088,
    "end": 6433.269,
    "text": "Is that, that just overrides all of your other preferences or just like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6433.809,
    "end": 6436.893,
    "text": " hits harder with the dopamine, or what's going on there, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6439.136,
    "end": 6444.322,
    "text": "Definitely an important area to model, and it reminds me of Mark Miller et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6444.282,
    "end": 6445.925,
    "text": "'s work on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6448.257,
    "end": 6450.098,
    "text": " Yes, podcasts and papers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6450.138,
    "end": 6454.58,
    "text": "So people should for sure listen to how it's framed by him and by colleagues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6455.14,
    "end": 6463.724,
    "text": "But there are the drives and the preferences on thirst, like Blue just enacted, or for temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6463.744,
    "end": 6472.548,
    "text": "And so within each drive, there is a pretty clear preference, like to be in a bounded range or more is better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6473.168,
    "end": 6476.85,
    "text": "But then there's a second level process by which one is asking,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6478.388,
    "end": 6485.872,
    "text": " are those optimizations across domains happening better or not as well as I'm expecting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6487.093,
    "end": 6500.26,
    "text": "Is this a balanced strategy where every time I get to 98% on my phone's battery, I'm always charging it, but then all of a sudden I'm neglecting all this other stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6500.981,
    "end": 6506.204,
    "text": "So I'm too attentive, for example, to the battery drive",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6507.438,
    "end": 6515.119,
    "text": " to a point of it not being any more adaptive of a policy selection than just waiting until it's at 70% most of the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6515.639,
    "end": 6526.762,
    "text": "But the uncertainty about those times where you do need that 98% battery is what compels people to make these optimal decisions that may neglect other drives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6527.922,
    "end": 6531.802,
    "text": "So being able to model that, what's called gamification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6531.822,
    "end": 6534.403,
    "text": "And then the other piece that made me think about is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6535.757,
    "end": 6539.34,
    "text": " We don't get to see figure one and figure two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6540.621,
    "end": 6548.547,
    "text": "We don't know what's on the other side of the blanket, if it's mere or adaptive or what it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6550.669,
    "end": 6563.139,
    "text": "And so it's not like we'll know figure one when we see it and we'll know figure two when we see it and we'll have a super clear strategy for when to engage in the figure one way and when to engage in the figure two way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6564.659,
    "end": 6581.09,
    "text": " It's more like, and potentially this is what learning and applying active inference in a personal capacity may look like for some, what does it look like to engage with figure two as your null hypothesis rather than figure one as your null hypothesis?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6581.53,
    "end": 6584.792,
    "text": "And we'll have closing thoughts with none of you having the ultimate phrase.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6585.173,
    "end": 6585.693,
    "text": "Dean, please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6587.472,
    "end": 6614.562,
    "text": " think i think what you're describing both of you are describing is maybe that service piece as gamified which isn't necessarily cooperative games but that's essentially what we're talking about so that's and i'm glad i got it in because i hate the final word blue yeah thanks it's interesting uploading cognitive uploading what uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6616.415,
    "end": 6618.816,
    "text": " What amount of uploading has been done by gamification?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6618.836,
    "end": 6619.577,
    "text": "I wonder that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6620.197,
    "end": 6623.259,
    "text": "That's a curious thing for me to now think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6623.279,
    "end": 6625.76,
    "text": "I should be thinking about other things, but now I'm going to think about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6626.1,
    "end": 6627.341,
    "text": "So thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6627.821,
    "end": 6632.704,
    "text": "Stephen wrote in the chat, gamification pushes induction over abduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6633.709,
    "end": 6640.257,
    "text": " Favors inductive logic and playing within the rules of the game rather than abductive logic, which I hope we'll be able to talk about later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6640.977,
    "end": 6646.844,
    "text": "So the participation is tied into a reinforcement learning paradigm that limits meaningfulness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6647.645,
    "end": 6652.951,
    "text": "Because it's like, if game is about pragmatic value, then mine more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6653.829,
    "end": 6658.51,
    "text": " But if the game includes an epistemic and a pragmatic component, it's already opened up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6659.171,
    "end": 6673.475,
    "text": "Now, what if it contains an improvisational and participatory element, because it's not just like we expanded the pragmatic value into your epistem and your pragmatics, but their service to another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6674.878,
    "end": 6675.679,
    "text": " and to the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6676.399,
    "end": 6687.088,
    "text": "And so maybe that is a good place to end slash begin with 41 and we'll head into a whole nother set of topics as we move forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6687.108,
    "end": 6688.97,
    "text": "So Dean and Blue, thanks a ton.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6689.891,
    "end": 6695.035,
    "text": "Great discussion and great and special times and thanks Steven and everyone else in the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6695.576,
    "end": 6697.037,
    "text": "So peace out fellows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6697.998,
    "end": 6698.238,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6698.838,
    "end": 6699.019,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6699.099,
    "end": 6699.459,
    "text": "Thanks team.",
    "speaker": "SPEAKER_03"
  }
]