[
  {
    "start": 27.776,
    "end": 51.987,
    "text": " all right hello everyone thanks for joining actinflab live stream number 41.1 it's april 6 2022. welcome to the actinflab we're a participatory online lab that is communicating learning and practicing applied active inference this is a recorded and an archived live stream so please provide us with feedback so we can improve on our work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.581,
    "end": 58.925,
    "text": " All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.166,
    "end": 67.633,
    "text": "If you want to learn more about any actinflab activities, head over to activeinference.org, and you can learn more there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 67.653,
    "end": 78.582,
    "text": "All right, today in stream number 41.1, we are continuing to learn and discuss the paper, Extended Active Inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.693,
    "end": 85.635,
    "text": " Constructing Predictive Cognition Beyond Skulls by Constant, Clark, Kirchhoff, and Friston from 2020.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.436,
    "end": 97.079,
    "text": "And today in the dot one, we're going to have some introductions, revisit the roadmap, and some of the big questions of the paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.899,
    "end": 113.187,
    "text": " and then we can have an open discussion around the figures formalism anything else that people think is relevant and for those who are watching live feel free to add any questions or comments in the live chat so we can start just by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.047,
    "end": 119.848,
    "text": " saying hello, hearing perhaps Blue's first thoughts on the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.448,
    "end": 129.61,
    "text": "And from Dean and I, we can revisit what we've been thinking about potentially since the dot zero, which I'll save for soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.77,
    "end": 130.59,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.87,
    "end": 134.431,
    "text": "I'm a researcher in California, and I'll pass it to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.411,
    "end": 137.031,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 137.071,
    "end": 137.471,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 137.491,
    "end": 138.392,
    "text": "I'm up here in Calgary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 138.412,
    "end": 141.052,
    "text": "I'm a little nasally today because I'm fighting off a bit of a cold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 142.534,
    "end": 151.937,
    "text": " What I've been thinking about since we did the dot zero is the sort of the idea around how cognition is maybe cultural.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.757,
    "end": 156.199,
    "text": "And I'll just leave it at that because maybe we can have a bit of a conversation about that today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 156.219,
    "end": 157.439,
    "text": "I'll pass it to Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 160.976,
    "end": 161.457,
    "text": " I'm Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.697,
    "end": 165.222,
    "text": "I'm an independent research consultant in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.963,
    "end": 170.51,
    "text": "And I, yeah, okay, so I'll give some first thoughts on the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.791,
    "end": 176.738,
    "text": "One thing that really stuck out to me was the idea of glue and truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.865,
    "end": 182.108,
    "text": " So that gave a whole new level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.348,
    "end": 189.692,
    "text": "So in order for you to have extended cognition, you have to believe in it, and you have to be glued to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.112,
    "end": 194.034,
    "text": "You have to have access to it whenever you need it, and you have to believe that it's valid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.515,
    "end": 197.556,
    "text": "So that's the glue and truth idea that they unpacked in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.716,
    "end": 200.138,
    "text": "And it gave a whole new...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.718,
    "end": 219.054,
    "text": " meaning of like being glued to your phone to me like I was like oh this is why we're always glued to our phone there's glue and there's truth right um so that was kind of interesting and then um definitely like uh to touch on what Dean was saying I think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.431,
    "end": 225.076,
    "text": " the cognition and bedding and culture is a super interesting aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.156,
    "end": 237.832,
    "text": "And like in the very last section of the paper, they were talking about like the ability to give like theater plays without being able to rehearse just based on cultural cues and knowing the context and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.212,
    "end": 243.555,
    "text": " just being so well-versed in how to cue off of each other or this kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.595,
    "end": 259.325,
    "text": "And it reminded me like of maybe like a jazz improv, like we know like what's acceptable or like when you're playing, when you have like a jam band and you're playing all the time, like you kind of just know where to pick off or, or, you know, Daniel and I are constantly leaving stigmatic traces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.425,
    "end": 262.607,
    "text": "Like, like there's like this extended cognition that I see happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.627,
    "end": 264.188,
    "text": "Like we'll both be doing the same thing at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.208,
    "end": 265.288,
    "text": "Like I was just doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.609,
    "end": 267.69,
    "text": "Like it's hard to eliminate redundancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.563,
    "end": 270.485,
    "text": " in those kinds of circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.545,
    "end": 284.375,
    "text": "So, so there is like the shared culture and how like central, like even because culture, yes, we have culture as a human society, but like within the Elizabethan theater companies, there's their own culture, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.655,
    "end": 287.317,
    "text": "Of, I don't know how many people were in the theater company, 20.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.118,
    "end": 294.563,
    "text": "So like there's that and being able to cue off of each other and like, you know, the active inference lab, which is growing every day, reach out if you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.138,
    "end": 305.282,
    "text": " so like within the active inference lab, like where we have our community and we have like, you know, some people we interact with on a very regular basis and then others less so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.362,
    "end": 308.704,
    "text": "And so we're kind of able to cue off of each other in that kind of way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.764,
    "end": 319.75,
    "text": "And so how does this go out to like your religious culture, your state culture, like your country culture, like let alone society at large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.81,
    "end": 324.172,
    "text": "So, so this idea of cultural cognition, I think is very, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.664,
    "end": 338.25,
    "text": " like salience and also like really speaks to the IQ tests or not IQ tests, but even like childhood development and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.7,
    "end": 348.045,
    "text": " Like in some cultures, when you give a child, you know, some pieces and do a demonstration for them of how to like, you know, stack blocks together or how to like make a Lego thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.805,
    "end": 360.011,
    "text": "In some cultures, like, I mean, especially in the West, we see like a child who assembles the blocks, like maybe starts off how the demonstration happened, but then like does some new innovative stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.371,
    "end": 361.552,
    "text": "Like we see a child like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.592,
    "end": 363.073,
    "text": "Oh, that's so like creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.133,
    "end": 367.755,
    "text": "And what an ingenious way to use these, you know, tools in a novel way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.12,
    "end": 371.081,
    "text": " But in some cultures, like that child must be an idiot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.141,
    "end": 374.082,
    "text": "Why isn't he just replicating like what the adults showed him how to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.703,
    "end": 378.164,
    "text": "And that's a legit like cultural phenomenon that speaks to intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.284,
    "end": 379.445,
    "text": "And yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.765,
    "end": 379.945,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.285,
    "end": 381.125,
    "text": "Sorry, I rambled enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.205,
    "end": 381.845,
    "text": "You've got my thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.866,
    "end": 384.146,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 384.386,
    "end": 388.068,
    "text": "Well, at least we know there'll be a lot to jump into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.158,
    "end": 409.455,
    "text": " let's uh return to the big question so for more background of course people can read the paper or check out the dot zero but let's just pick up with the big question and then the roadmap and then we'll kind of jump into the more unstructured slides um as we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.028,
    "end": 434.846,
    "text": " uh framed it here the question of this paper about extended cognition is about how cognition is extended and the way that the authors approach that is this perspective of the cognitive niche which they develop from the perspectives that are focused on here in this paper with this dialectic of the cognitive niche consisting of a psychological habit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 435.586,
    "end": 442.541,
    "text": " from ecological psychology one can think of, as well as a functional habit, like a neurobehavioral habit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.143,
    "end": 445.608,
    "text": "And they also have a selective behavior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.229,
    "end": 453.154,
    "text": " ecological evolutionary perspective on the cognitive niche that Axel Constant and others have developed in other work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.174,
    "end": 463.24,
    "text": "But in this paper, they were focused mostly on the psychological and the functional and the timescale of behavioral ecology rather than evolutionary ecology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.26,
    "end": 464.901,
    "text": "But this is all kind of in the background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.242,
    "end": 474.468,
    "text": "So they focus on the psychological and functional dimensions of the cognitive niche and use that to sort of navigate and triangulate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.228,
    "end": 496.737,
    "text": " cognitive extensions so any other ways to think about it or just what did other people think of were just like a big question that would maybe mention active inference or not but what is the kind of question that leads somebody to want to read this paper and understand what they're conveying yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.592,
    "end": 521.587,
    "text": " I think one of the interesting things here is that if you encounter something that you don't believe is an extension or a continuation of the prior culture, so you're walking into a new habitat, we'll just call it that, what does that then imply in terms of your ability to, as a newbie, cognitively extend into that situation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 522.415,
    "end": 537.082,
    "text": " I think that's what this paper is really interesting in terms of discussing because not so long ago, there were a couple of researchers, writers, Lave and Wagner, who talked about experiential learning and how you'd be on the periphery",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 537.902,
    "end": 565.665,
    "text": " of a of a culture and you would slowly move your way closer and closer to whatever the core of that culture is this doesn't speak to the the cultural aspects of cognitive extension in that way so my question is when you when you walk into a new culture or something that you don't feel that you're necessarily um familiar with how does how does your cognitive extension get taken up in that new culture",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 568.98,
    "end": 572.464,
    "text": " As opposed to the participants in the culture, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 572.784,
    "end": 574.125,
    "text": "There's two components to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 574.526,
    "end": 578.93,
    "text": "It's how the people will treat you, for example, but it's how the culture treats you as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 578.97,
    "end": 582.414,
    "text": "So there's two parts to that, and I think that's really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 582.434,
    "end": 590.822,
    "text": "They haven't broken it out in this paper per se, but they certainly lead to that kind of question because of the research and the argument that they've been able to put forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 592.995,
    "end": 621.609,
    "text": " nice um three researchers walk into a new habit is it a psychological habit is it a functional habit and then that makes me think about like the culture of a music festival or something when you're at the periphery there's people who are just joining like you are or people who are leaving or people who want a little bit of a space away from the main action but using that sort of inner and outer culture idea very interesting yeah blue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.749,
    "end": 642.057,
    "text": " So the idea of being like a newcomer is pretty interesting in, in this context because there has to be some kind of reciprocity that like you are expecting the niche to be a certain way, or maybe you learn the ways of the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.097,
    "end": 647.479,
    "text": "You don't really have an expectation or, or, you know, like how your old niche was and you carry that forward with some prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.819,
    "end": 649.84,
    "text": "But as the niche is updating you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.356,
    "end": 651.857,
    "text": " you are also updating the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.977,
    "end": 660.982,
    "text": "And so as the culture is updating you, singular you, you are also updating the culture and it goes around and around like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.302,
    "end": 669.227,
    "text": "And I think, or I wonder what degree we all update our culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.327,
    "end": 671.808,
    "text": "Like what is the single characteristic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.848,
    "end": 674.61,
    "text": "Maybe it's like a big five personality trait or maybe it's a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.651,
    "end": 687.079,
    "text": " You know, some kind of Enneagram type or maybe there's a single dominating thing that makes you have a strong influence on the culture around you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.619,
    "end": 693.423,
    "text": "Or is it just like the rate at which you transmit information or the number of people that you transmit information to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.817,
    "end": 702.102,
    "text": " I mean, we all know that like those nodes that are hotspots in like, you know, social networks are, you know, like they're the influential nodes that have the bazillions of connections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.123,
    "end": 710.247,
    "text": "So is it just the number of connections that you have, the level of information that you transmit or the quantity of information that you transmit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.747,
    "end": 718.853,
    "text": "Or is there something like some personality trait that actually gives you the ability to update your culture more influentially than others?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.873,
    "end": 719.293,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.627,
    "end": 723.588,
    "text": " One last quick point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 723.608,
    "end": 725.669,
    "text": "I want to kind of build on Blue's point there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 726.59,
    "end": 735.634,
    "text": "So part of this, and I'm using terminology that's not part of the paper, but I think we could look at enculturation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 737.848,
    "end": 743.771,
    "text": " as a form of domesticate, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 744.591,
    "end": 756.476,
    "text": "And so I'm not sure when a person walks into a new culture, whether they're perceived as sort of non-domesticated, and then we're gonna get them caught up or brought up to speed in terms of what the culture is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 756.496,
    "end": 759.297,
    "text": "And I agree with you, Blue, it is a circular thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 759.937,
    "end": 766.18,
    "text": "I just wonder whether there's a certain amount of wildness that's brought in when somebody new is sort of thrown into the,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 766.92,
    "end": 793.008,
    "text": " the bigger cultural uh pot and whether there's an effort to try to bring them to be more influential on the on the one than the one being influential on the many so i always always i'm always curious about those things and i don't think that this is going to get answered right now but i think that's an important point to sort of remember especially when we get into the flipping part here which i can see dan has already got the uh the graph up so let's go there",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 795.253,
    "end": 811.685,
    "text": " we will come there it just made me think about when the niche is um not other people so going on a walk through the forest and the niche is going to be like other trees or just the path itself um this kind of figure two representation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.659,
    "end": 827.589,
    "text": " where there's an active process by which not just as the entity doing action selection with respect to the niche, but the niche is basically being agentified and it is taking some sort of active process by which it is doing an inference on the entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 828.029,
    "end": 830.751,
    "text": "And in the forest, it's like, whoa, are the trees alive?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.811,
    "end": 831.672,
    "text": "Is this Lord of the Rings?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.272,
    "end": 836.195,
    "text": "But if this is another group of people and this is your social niche,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.775,
    "end": 843.965,
    "text": " and your psychological and functional habitat is other people, then it is like quite literal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.305,
    "end": 848.731,
    "text": "This could be two people in conversation, or this could be one versus multiple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 849.312,
    "end": 852.937,
    "text": "And so in the social and cognitive and cultural niche,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.44,
    "end": 875.072,
    "text": " it is like less of a leap to talk about how there's cognitive processes on both sides, but then that helps us recognize that actually it is a continuum and it's like, okay, so if we can very clearly see how in the conversation, there's this optimization happening on both sides, then what does that look like when we're in the forest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.672,
    "end": 876.213,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.433,
    "end": 883.137,
    "text": "So some of those big questions have been raised and then let's just revise the roadmap",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.168,
    "end": 906.247,
    "text": " see where they went on their little forest journey and then we'll jump back into the slides and um the go from there so they introduced the cognitive niche active inference and extended mind concepts and then discussed the argument that they're going to lead us down and the way in which active inference plays into it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.583,
    "end": 919.272,
    "text": " As we mentioned just recently, they're focusing on the functional and psychological aspects of the cognitive niche, leaving for later that eco evolutionary perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 920.153,
    "end": 925.557,
    "text": "And they're using active inference as an integrative framework and set of formalisms to help address that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.719,
    "end": 948.488,
    "text": " go through cognitive psychological and functional niches provide a case study with earthworms and have several figures that we spent a lot of time in the dot zero looking at where in figure one there was somewhat of an active entity in a niche that could have its own dynamics but then figure two",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.918,
    "end": 955.923,
    "text": " introduce the idea that the niche is also doing something like what the entity is doing, but with a symmetry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.443,
    "end": 957.884,
    "text": "So same, same, but different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.785,
    "end": 966.891,
    "text": "And then after that discussion, they take the full turn towards extended active inference, EAI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.471,
    "end": 975.957,
    "text": "And they recognize, well, if the niche or whatever is on the other side of the entity in the way that we're modeling it is doing something cognitive,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.898,
    "end": 984.635,
    "text": " Is that a way in which we can recognize boundaries and interfaces as well as distributed or extended cognitive processes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.469,
    "end": 997.057,
    "text": " And they approached that from a few different angles, like extension through space, spatial extension, as well as extension through time, temporal extension related to diachronic cognition through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.758,
    "end": 1013.369,
    "text": "And then they also discussed a few pieces related to, for example, epistemic actions and the relevance of how distributed cognitive systems use epistemic actions, for example, knowing where to look to find some piece of information in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.462,
    "end": 1017.283,
    "text": " That's kind of how they went through this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.583,
    "end": 1020.585,
    "text": "Any comments on the roadmap or we can now turn to the blank slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.526,
    "end": 1024.066,
    "text": "Don't forget about the spiced food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.366,
    "end": 1027.348,
    "text": "Cause that was also part of the case case study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.908,
    "end": 1029.348,
    "text": "What about it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1031.269,
    "end": 1038.633,
    "text": "Um, I mean, that was like, there was the earthworm case, but then there was also like the case of, um, spicing food as like a cultural practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.013,
    "end": 1039.613,
    "text": "And, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.128,
    "end": 1049.655,
    "text": " how like potentially, I mean, even the act of cooking food or how we prepare food overall, like some parts of food are poisonous or like, I mean, you're going to eat blowfish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.695,
    "end": 1055.959,
    "text": "Like that's a very precise, very mentor mentee transmitted practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.5,
    "end": 1066.207,
    "text": "So, but, but I mean, more than that, just also like the spices that we use can sometimes be like, you know, poisonous agents and they're slightly toxic to us, but not in small amounts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.287,
    "end": 1066.367,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.889,
    "end": 1070.677,
    "text": " But they also like help to get rid of any parasites that might be residing in the meat that we're eating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1070.697,
    "end": 1076.248,
    "text": "But yeah, they use that as a case study also, not just the earthworm with the kidney.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.529,
    "end": 1082.711,
    "text": " This is a book that we've been reading at home recently, Much Depends on Dinner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1083.251,
    "end": 1102.377,
    "text": "It's kind of in the culinary writing genre, not something we talk about too much directly here, but it's a very interesting approach that really does some deep dives on what we could see from our active lab vantage point of extended and encultured cognitive processes and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.857,
    "end": 1107.22,
    "text": " thinking about how food gets to the table in all of the ways that it gets to the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.26,
    "end": 1108.561,
    "text": "How do people get to the table?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.961,
    "end": 1109.861,
    "text": "How do we show up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.961,
    "end": 1112.063,
    "text": "And how does that differ through time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.223,
    "end": 1113.303,
    "text": "So it's kind of a cool book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.364,
    "end": 1119.867,
    "text": "Similarly, like the omnivore's dilemma, which I just read was also like, how does your food get to the table?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.887,
    "end": 1120.608,
    "text": "Where does it come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.848,
    "end": 1124.01,
    "text": "And yeah, that's a whole, there's a whole set of practices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.09,
    "end": 1132.355,
    "text": "And like, not only that, but it's actually, I mean, you go back to thinking about Serval and thinking like a state, thinking about thinking like a state,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.844,
    "end": 1140.812,
    "text": " There's a whole set of practices that actually construct our society based on the way that we get food, which is really pretty remarkable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.313,
    "end": 1148.359,
    "text": "It's a distributed metabolism with bringing resources and nutrients to and from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.2,
    "end": 1151.962,
    "text": "And so it is very related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.924,
    "end": 1175.161,
    "text": " okay so here's a few of the options people can um take a quick little vote or state their preference we can talk about walking into new cognitive niches talk a little bit about glue and truth in the context of extended cognitive processes and culture about applying extended active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.111,
    "end": 1188.935,
    "text": " and how that is modeled in its deployment, as well as maybe from a experiential perspective, what does it feel like to be applying active inference in the extended way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.496,
    "end": 1199.939,
    "text": "We have the question from Dave about thinking about partitions, and there's a few other ways we could go, but any preferences from these?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.177,
    "end": 1212.085,
    "text": " So when we talk about applying active inference, are we talking about this from a realist or instrumentalist perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.125,
    "end": 1212.766,
    "text": "I just need to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.749,
    "end": 1215.509,
    "text": "Determines my vote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.672,
    "end": 1218.933,
    "text": "I think you've already said enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1220.051,
    "end": 1222.032,
    "text": " What would it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.773,
    "end": 1229.737,
    "text": "Why does it matter about realism and instrumentalism if we're talking about applying extended active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.997,
    "end": 1232.099,
    "text": "What are those as you're seeing it now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.679,
    "end": 1236.762,
    "text": "And what would the realism flavor or instrumentalist flavor look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1239.235,
    "end": 1244.197,
    "text": " Well, are we talking about actually what is it like to apply active inference in an extended way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.417,
    "end": 1253.281,
    "text": "Like what is that actually, like it takes on a very realist flavor when we're thinking about extending active inference beyond our own skull?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.941,
    "end": 1257.382,
    "text": "Or are we modeling, what are we actually doing here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.482,
    "end": 1264.605,
    "text": "Are we modeling collective cognition, collective predictive processing as extended active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.926,
    "end": 1266.226,
    "text": "Or what are we actually doing here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.146,
    "end": 1268.347,
    "text": "I would like to know what you guys think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.219,
    "end": 1274.322,
    "text": " Yes, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1274.482,
    "end": 1285.068,
    "text": "My curiosity around this is always to do with things that have actually happened, but I still think there's a sort of a tool or instrumentalist part around it too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1285.469,
    "end": 1287.45,
    "text": "When I first joined this community,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1288.575,
    "end": 1300.872,
    "text": " I don't know that I could have become part of whatever the community is evolving into without having both a kind of a realism perspective and an instrumentalism perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1302.52,
    "end": 1306.041,
    "text": " I'm always kind of curious when people want to break it out into those two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.121,
    "end": 1308.781,
    "text": "I'm a minimum of two thing guy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1308.801,
    "end": 1311.522,
    "text": "I think both of them exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.982,
    "end": 1315.023,
    "text": "And I don't think we can actually do anything without having both of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1315.103,
    "end": 1317.843,
    "text": "So let's say we drop one of the other blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1318.544,
    "end": 1327.145,
    "text": "What happens in terms of our ability to sort of get a real grip on or optimize or do any of the things that we want to do in terms of becoming enculturated?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1327.826,
    "end": 1329.186,
    "text": "Like if we drop one of the two,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1330.034,
    "end": 1341.958,
    "text": " and just put all of our resources in the other domain, do we do that naturally or do we do that in those domesticated situations, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1342.359,
    "end": 1347.64,
    "text": "If we're doing it in the wild, if we're truly having to go out there and forage, don't we use both?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.901,
    "end": 1348.721,
    "text": "That's my question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1350.401,
    "end": 1352.262,
    "text": "So I will respond to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.503,
    "end": 1356.564,
    "text": "I do think we use both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.89,
    "end": 1360.592,
    "text": " I drop the instrumentalist perspective all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.252,
    "end": 1373.56,
    "text": "I drop it when I think about extending my cognition into my niche environment and I think about extending my cognition into my group of active inference people or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.66,
    "end": 1378.984,
    "text": "I drop the instrumentalist perspective frequently in language, in thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.504,
    "end": 1383.166,
    "text": "I think about, oh, what is it like to actively infer XYZ?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.687,
    "end": 1386.789,
    "text": "But I never lose sight of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.745,
    "end": 1392.207,
    "text": " the instrumentalist perspective as the real way things are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.407,
    "end": 1394.067,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.167,
    "end": 1398.629,
    "text": "Like, so the instrumentalist perspective is the real way things are like, this is a tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.729,
    "end": 1414.315,
    "text": "I talk about it as if it's not, I think about it as if it's not, but essentially in my generative model, like from the realist perspective in my model, when I talk about my model, I am modeling my model and I'm doing it with the instrument of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.595,
    "end": 1414.755,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1416.107,
    "end": 1418.709,
    "text": " Well, again, that's where I find this really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1418.769,
    "end": 1430.118,
    "text": "If we're going to extend, it's hard enough to talk about building a niche or constructing a niche without tools or without realism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1431.539,
    "end": 1438.465,
    "text": "But if you're going to do that as an extended cognition exercise, now it's even more complicated, even more complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1438.845,
    "end": 1445.691,
    "text": "How do you drop one of the two and continue to feel like you're accomplishing something?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1446.815,
    "end": 1448.537,
    "text": " I don't want to get into debate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1448.697,
    "end": 1451.16,
    "text": "I don't think we're getting into debates about it's one or the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1451.741,
    "end": 1460.792,
    "text": "But I think when you're trying to figure things out, to just say, okay, I'm automatically going to blind one eye just because I want the other eye to grow bigger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1461.152,
    "end": 1462.354,
    "text": "The other eye doesn't grow bigger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1462.494,
    "end": 1464.756,
    "text": "So why are you doing that to yourself?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1464.817,
    "end": 1465.798,
    "text": "That's what I always ask.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1467.554,
    "end": 1472.538,
    "text": " So we can think about applying extended active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.499,
    "end": 1482.367,
    "text": "And as Blue initially asked, are we approaching this in what ways from a realism and in what ways from an instrumentalism perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.927,
    "end": 1491.034,
    "text": "So the realist question, just we're at the DMV, we're getting our driver's license renewed, and they ask us to cover one of our eyes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.795,
    "end": 1496.645,
    "text": " because they actually do want to understand that one of the eyes has a certain visual capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.685,
    "end": 1502.657,
    "text": "So we're closing the instrumentalism eye, and it's like, to the extent that we can even talk about the real,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.008,
    "end": 1512.955,
    "text": " cognitive systems actually really do have functional dependencies that extend beyond any actual boundary in the world or that we state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.536,
    "end": 1526.086,
    "text": "So however many philosophical caveats you need to add about realism, this eye has no problem seeing that the functional components of cognition are distributed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.386,
    "end": 1530.449,
    "text": "So that is realism or really extended active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.669,
    "end": 1531.59,
    "text": "So R-E-A.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.554,
    "end": 1541.668,
    "text": " The instrumentalism eye is how are we going to utilize Act-Inf in a way that is useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.209,
    "end": 1545.656,
    "text": "And so here with this eye, we can see that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.437,
    "end": 1564.301,
    "text": " no matter what, we're gonna have to model along with compromises like accuracy minus complexity, the ways in which our models of the cognitive systems, they actually do require in the model, the as if influence of influences beyond their neural system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.801,
    "end": 1574.083,
    "text": "So whether those influences beyond the actual boundaries are real, or whether those influences beyond the statistical boundaries are statistically real,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1576.96,
    "end": 1588.885,
    "text": " we can oscillate and like look at something because we're the one who's generating those visuals and integrating those perspectives into like a single coherent generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.685,
    "end": 1594.167,
    "text": "And one last thought on this, a lot of times somebody will think, well, what does a bug see?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.267,
    "end": 1595.328,
    "text": "What does an insect see?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.828,
    "end": 1598.309,
    "text": "And it has like a thousand different views of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.069,
    "end": 1602.33,
    "text": "But of course we have two eyes and see just one vision of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.911,
    "end": 1613.904,
    "text": " there's reason to think that no matter how many facets of the insect eye there are, they're still having just a single coherent visual generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.545,
    "end": 1620.192,
    "text": "So maybe there's even other perspectives, but that won't mean that we are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.088,
    "end": 1645.465,
    "text": " not having a singular underlying coherent generative experience so okay that um bridge being crossed or burnt depending on what you think what are some situations where we would be applying extended active inference so and also to distinguish that question from just like where would we want to be extending active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.894,
    "end": 1655.904,
    "text": " Where would specifically extended perspectives on active inference be really important as opposed to just non-extended?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.364,
    "end": 1660.528,
    "text": "And maybe it'd be helpful there to look at figure one and two just to remind ourself of those differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.01,
    "end": 1666.855,
    "text": "So think about the examples while we... Yes, blue first, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.816,
    "end": 1668.096,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.233,
    "end": 1691.986,
    "text": " In the spirit of active inference being a scale-free framework, like I think about extended active inference as very critical to this scale-friendly slash scale-free way that we think about active inference, just because as a biological system, we're layers and layers and layers and layers and layers deep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.046,
    "end": 1697.129,
    "text": "So like I, this like, whatever my ego perceives as me, Blue,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1698.519,
    "end": 1703.442,
    "text": " I am an embodied image of extended active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1703.722,
    "end": 1706.943,
    "text": "I mean, so, so I don't see it happening anywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.964,
    "end": 1710.445,
    "text": "I don't see it extended active inference, not happening anywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.805,
    "end": 1725.133,
    "text": "Like I see what happens in my skull, a function as of what's happening in my cells and my tissues and my organs, et cetera, because all of those subunits of blue are doing this extended active inference with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.293,
    "end": 1746.518,
    "text": " But if we want to look specifically at like a group function, which may be necessary or maybe not, I mean, to go beyond our skull, are we looking at like how organizations function, which maybe Dean wants to talk about more or how, you know, states function or how institutions function at large?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.459,
    "end": 1753.08,
    "text": "So do we have to get actually beyond the physical body to go beyond our skull or can we go within our physical body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.496,
    "end": 1756.921,
    "text": " body to talk about extended active inference beyond skulls?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.804,
    "end": 1759.084,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.505,
    "end": 1764.172,
    "text": "So we can think about like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.984,
    "end": 1773.946,
    "text": " that great point, which is that nested systems of which we often talk about can actually be thought of as extended active inference systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.746,
    "end": 1778.447,
    "text": "So we've talked about like ant nest mates in the ant colony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.147,
    "end": 1784.649,
    "text": "And so there's the sense in which the lateral interactions from one nest mate's point of view",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1786.448,
    "end": 1792.373,
    "text": " because those lateral interactions are with other nest mates, there's cognition on both sides of the interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.413,
    "end": 1794.675,
    "text": "So it is like an extended active inference process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.515,
    "end": 1796.917,
    "text": "And then also there's the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.283,
    "end": 1822.238,
    "text": " extended active inference with the physical substrate and the stigmergy and the building of the nest architecture and the pheromone deposition and that kind of physical substrate is more on the mere active inference rather than adaptive active inference end of the spectrum and the physical substrate reminds us more of figure one where you have an active cognitive entity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.918,
    "end": 1828.223,
    "text": " that's doing some sort of free energy minimizing process that's helping it select policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1828.403,
    "end": 1829.404,
    "text": "That's the arg min.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.225,
    "end": 1836.13,
    "text": "And then it's feeding into the dynamics of the external niche, which can be complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.19,
    "end": 1845.359,
    "text": "And they have their own endogenous change dynamics, which is seen by the fact that the rate of change on the external states is a function of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.644,
    "end": 1851.467,
    "text": " something involving the current state of those world states plus a noise term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.147,
    "end": 1864.774,
    "text": "So this can be a complex recursive non-linear function, but that could still be a mere act-dimp entity because it's not actually engaged in a policy selection, rather just a complex dynamical unfolding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.675,
    "end": 1872.839,
    "text": "And then in contrast, in figure two, we see that the external states are still taking similar arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.723,
    "end": 1897.745,
    "text": " eta and a so the current states at that time and actions feeding into it that's what's influencing external states and we see those arguments are still here actions feeding in from the entity and the current state of the external states except what it's doing is no longer just the rate of change is a function of plus noise but an active policy selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.906,
    "end": 1900.867,
    "text": " more like the kind that the entity is involved in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.407,
    "end": 1906.29,
    "text": "So maybe figure two is reminding us more of like two nest mates interacting with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1906.75,
    "end": 1911.753,
    "text": "And figure one is more like a nest mate interacting with the physical stigmergic niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.755,
    "end": 1926.141,
    "text": "And so in that way, it opens up all of the discussions we've had about multi-scale act-inf and nested systems and thinking about them as extended active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.501,
    "end": 1926.741,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.482,
    "end": 1927.622,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1928.217,
    "end": 1931.998,
    "text": " In the paper, I'll just read one sentence from the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1932.038,
    "end": 1945.663,
    "text": "It says here, the concept of the cognitive niche that we refer to here is a sort of hybrid between the concepts of the selective, developmental, and cognitive niches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1945.683,
    "end": 1947.824,
    "text": "It's right near the beginning, Dan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1948.084,
    "end": 1949.225,
    "text": "Yeah, right there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1950.385,
    "end": 1951.145,
    "text": "Yeah, you got it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1952.046,
    "end": 1955.907,
    "text": "So in the context of what were those two figures there,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1957.52,
    "end": 1960.422,
    "text": " When we're talking hybrid, what are we really talking about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1960.442,
    "end": 1970.747,
    "text": "We're talking about the comparison of say the electric component of the engine and the internal combustion engine that are both in one car.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1971.408,
    "end": 1978.112,
    "text": "Would that be a good analogy in terms of being able to figure out what part of this is the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1980.023,
    "end": 1985.384,
    "text": " Is the vessel, what part of this is the electric motor and what part of this is the internal combustion motor?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1985.425,
    "end": 1989.086,
    "text": "Would that be a good metaphor for what we're talking about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1992.827,
    "end": 1993.427,
    "text": "What's the car?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1996.728,
    "end": 1996.948,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1997.948,
    "end": 2000.889,
    "text": "Well, is that the culture piece?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2001.109,
    "end": 2001.709,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2003.953,
    "end": 2007.274,
    "text": " Yeah, I don't know what a cognitive niche is here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2007.314,
    "end": 2020.237,
    "text": "Like, I don't know if I want to entail culture with a cognitive niche, because this is what this paper is about, or whether I want to entail cognitive niche with culture, which is something that we've talked about in a whole bunch of papers, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2020.498,
    "end": 2021.558,
    "text": "So that's a good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2021.658,
    "end": 2022.158,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2024.252,
    "end": 2033.965,
    "text": " It reminds me of your earlier statements about how if a pizza is something with toppings on top, and then if you put it upside down, is it still a pizza?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.486,
    "end": 2041.034,
    "text": "So is car the total functional phenomena involving vehicular transport?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.995,
    "end": 2064.874,
    "text": " or at what point does that also require like gravity and a road and all these other pieces that are part of the extended process by which cars come to be like is the factory that made the car part of the car i mean it would be interesting if they just blinked into existence but because things are part of process ontologies how can we uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.636,
    "end": 2075.144,
    "text": " connect this question of extended function to the process and object ontology angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.326,
    "end": 2077.046,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.427,
    "end": 2079.148,
    "text": "Blue, I see some Stigma G happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2085.755,
    "end": 2085.955,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.228,
    "end": 2105.883,
    "text": " So to kind of close this little thread on applying extended active inference, though, of course, we welcome a thousand more specific contributions and we hope to continue building these actual models and examples and interactive dashboards and everything out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.104,
    "end": 2116.231,
    "text": "There are multiple ways to think about what is extended and probably even for consensus on the same",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.506,
    "end": 2126.331,
    "text": " perspective on the world as it really is, or even on the same choice of models, there would still be a lot of degrees of freedom in how we actually apply extended active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2126.992,
    "end": 2146.383,
    "text": "But one tantalizing cue there from Blue was like connecting it to the scale-free, scale-friendly components and potentially connecting what we've been talking about with active inference in nested multi-scale systems to this perspective on thinking about their niche as consisting of other mere",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.923,
    "end": 2150.726,
    "text": " figure one, or adaptive, figure two, active entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.99,
    "end": 2156.611,
    "text": "What do we see with the termites?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.373,
    "end": 2170.963,
    "text": "So I just was thinking about like the literal pushing off into the niche in kind of like this scale-free slash scale-friendly way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.004,
    "end": 2175.167,
    "text": "I saw the last author of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.078,
    "end": 2181.12,
    "text": " these papers give a talk at the mathematics of collective intelligence workshop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.26,
    "end": 2184.421,
    "text": "And it was so cool, like really literally like the termite mound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.161,
    "end": 2193.424,
    "text": "And I'm sure that the ants nests do the same thing, Daniel, but I think that the, they're not very studyable because as soon as you go in to start to try to figure them out, like they fall apart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.504,
    "end": 2194.324,
    "text": "Is that, that's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.705,
    "end": 2195.845,
    "text": "So we kind of get a better understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.038,
    "end": 2201.902,
    "text": " Well, many termites build underground and in logs, so it can be hard to assess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2202.082,
    "end": 2204.623,
    "text": "Above ground termite architecture is, of course, amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.124,
    "end": 2214.51,
    "text": "And more ant architecture is happening underground, which makes it really hard to study unless you have like a high resolution landmine sweeping device.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.486,
    "end": 2246.481,
    "text": " landmine sweeping device so like are there like images i mean yeah i don't see how to do it really without destroying it because they're like made of sand right so how do you like i mean i remember like when we were kids there was like the frame the two glass panes and you would get some ants and like throw them in there and watch them like dig tunnels but like other than this like very artificial environment um like the deer on the trampoline right other than this very artificial environment you know in what way do we know about the ant architecture but but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.969,
    "end": 2271.349,
    "text": " my point was actually just that, that the termites, um, really like you can predict the behavior of the termites based on like the velocity of the wind and how hot or cool, or like they build all these different structures and you can predict like, and they not only build these different structures, but they will actually like deconstruct their mound and then reconstruct it like based on whatever is shifting in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.389,
    "end": 2271.709,
    "text": "And so, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.929,
    "end": 2273.009,
    "text": " this latest paper is cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.029,
    "end": 2284.031,
    "text": "Like really shows the, it gets into like the math behind how termites, termite mounds are constructed, like under what, you know, wind velocity and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.091,
    "end": 2294.513,
    "text": "But I just thought that that was a really neat example of literally putting the offloading into the, I mean, we literally do that as humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.573,
    "end": 2301.194,
    "text": "And so we're pretty familiar with like, you know, the smartphone and the different ways in which we do cognitive uploading and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.718,
    "end": 2315.329,
    "text": " But this idea of cognitive uploading, which I've always used cognitive offloading, cognitive uploading into the niche can kind of tell others, even future others, what was happening to you in your life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.39,
    "end": 2321.935,
    "text": "It's like you're writing your own little, you know, history book as we are cognitively uploading these videos onto YouTube.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.315,
    "end": 2324.337,
    "text": "You know, this will be here after we're gone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.958,
    "end": 2328.481,
    "text": "But the termites do this too in a very cool, like physical way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.501,
    "end": 2330.102,
    "text": "I just thought it was neat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.175,
    "end": 2333.197,
    "text": " Tucker has corrected me in chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.317,
    "end": 2335.499,
    "text": "It's not a landmine sweeping device.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.559,
    "end": 2337.521,
    "text": "It's an ant mind sweeping device.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.921,
    "end": 2339.102,
    "text": "So thank you, Tucker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.585,
    "end": 2341.925,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2342.425,
    "end": 2354.777,
    "text": "Yes, I think extended active inference systems to study could include starting with colony-like systems or various other systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.646,
    "end": 2369.951,
    "text": " what would be another good place to now jump in as we sort of walk back to the midden pile, walk back to the trash heap of ideas and then figure out where to repurpose and go back in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.971,
    "end": 2372.652,
    "text": "Um, maybe you meant, yes, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.272,
    "end": 2375.133,
    "text": "Well, I just have a question for both of you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2375.173,
    "end": 2384.297,
    "text": "Cause so when I think of offloading and they give the example, and I think I put the image up there of the brain on top of the, of the phone, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2385.819,
    "end": 2391.972,
    "text": " If we upload and we're talking about intergenerational stuff, are we uploading into culture?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2392.332,
    "end": 2397.343,
    "text": "And is that the primary difference between offloading something so I don't have to remember it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2398.123,
    "end": 2407.966,
    "text": " and uploading something so that rules are introduced that you will sort of be swept up by if you join this culture?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2408.206,
    "end": 2410.087,
    "text": "I'm asking because I'm not really sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2410.107,
    "end": 2412.367,
    "text": "I was trying to figure that out myself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2413.348,
    "end": 2420.21,
    "text": "Is there an arbitrariness to this or is it really kind of clear what the line is in terms of they tried to explain it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2421.13,
    "end": 2423.571,
    "text": "They said it's akin to cognitive uploading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2424.738,
    "end": 2425.578,
    "text": " but it's different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2425.779,
    "end": 2430.461,
    "text": "So where did you guys come away on that question of what's different about it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2431.181,
    "end": 2432.942,
    "text": "Yes, great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.962,
    "end": 2433.403,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.443,
    "end": 2436.945,
    "text": "Let's look at what they wrote and then let's see where we can take it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.065,
    "end": 2443.708,
    "text": "So they wrote, cognitive uploading is akin to cognitive offloading in the original theory of the extended mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.629,
    "end": 2448.111,
    "text": "However, in contrast to the traditional notion of offloading,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.911,
    "end": 2459.835,
    "text": " The notion of uploading refers to the creation of novel cognitive functions that are taken on board by the cognitive niche per se, instead of being merely managed by the cognitive niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.295,
    "end": 2465.797,
    "text": "A function's offloaded when individual agents restructure their world,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.023,
    "end": 2471.384,
    "text": " so as to minimize internal processing costs and or increase reliability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.364,
    "end": 2477.646,
    "text": "So offloading, like you could offload your heavy, heavy backpack and just drop it on the floor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.206,
    "end": 2488.469,
    "text": "So offloading has more of a sense, at least hopefully this is aligned with as they're describing it, of like it is allowing the shelves in the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.434,
    "end": 2492.995,
    "text": " to you're offloading what you're carrying into places in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.615,
    "end": 2502.336,
    "text": "And so the cognitive onus and the imperative for epistemic action is still resting in the entity of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2502.876,
    "end": 2508.257,
    "text": "So cognitive offloading could be consistent with a worldview that's like solipsistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2508.617,
    "end": 2514.998,
    "text": "Like there's just this one cognitive entity and they're like offloading, they're off gassing, it's their exhaust thermal waste.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.559,
    "end": 2517.559,
    "text": "They're offloading cognition to the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.419,
    "end": 2525.781,
    "text": " Cognitive uploading takes on more of a sense that there's actually something active on the other side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.121,
    "end": 2536.463,
    "text": "Because if you're going to upload a file to a cloud folder, there has to be another server that's actually recognizing your packets as you're uploading that file.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2537.083,
    "end": 2543.705,
    "text": "So uploading is more consistent with the framing that they have, for example, in figure two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.145,
    "end": 2544.965,
    "text": "Surprise, surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.545,
    "end": 2547.346,
    "text": "Whereas the cognitive offloading",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.266,
    "end": 2569.833,
    "text": " um could be consistent with figure one like i'm trying to have this cognitive function of this symphony of bells being played and so i'm gonna set up these dominoes and these delays in the niche and where to put the sheet music and where to put the post-it notes offloading the cognitive requirements making it extended making it distributed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.11,
    "end": 2596.159,
    "text": " figure two it goes even a step further and that's what they're trying to highlight the distinction with with their usage of the word uploading because there's actually something that's cognitive that's accepting the download or the upload from the entity is the download from the server so to speak so sorry if that's repetitive but i think it's a subtle and important point dean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.837,
    "end": 2598.578,
    "text": " Yeah, I think it's a super important point, too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2598.638,
    "end": 2605.96,
    "text": "So then, then for me, the question is, so let's say that I have an academic culture that I could upload to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.46,
    "end": 2610.602,
    "text": "And I also have a professional culture that I could upload to, let's say they're two different things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2611.926,
    "end": 2612.126,
    "text": " Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2612.867,
    "end": 2620.992,
    "text": "So I'm a part-time student and I'm also working full-time at my job every day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.612,
    "end": 2626.876,
    "text": "Is there some way of being able to find myself or find examples of myself",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2628.797,
    "end": 2639.886,
    "text": " not being downloaded on per se by each one of those different cultures, but me uploading into both of those and retaining my sort of hybridized sense of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2639.966,
    "end": 2652.796,
    "text": "So from a psychological and a functional niche perspective, what does that entail for me as the person who's now kind of doing this oscillation back and forth between these two niche constructions, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2653.436,
    "end": 2664.284,
    "text": " Now, again, they don't go to that length here, but I think it's important, based on what you just said, Daniel, for us to remember it isn't just a single culture examination here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2664.524,
    "end": 2674.571,
    "text": "The whole point is that there are multiple niche constructions happening all the time, and it's just a matter of whether or not we recognize the differences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2675.737,
    "end": 2675.977,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2676.517,
    "end": 2678.218,
    "text": "So I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2678.238,
    "end": 2687.362,
    "text": "Again, I'm not sure that they answer that here, but I think we're getting closer to being able to find that answer because of what they're what they're bringing to our attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2690.443,
    "end": 2691.863,
    "text": "Lou, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.984,
    "end": 2695.505,
    "text": "I'll spin up some slides for you, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2695.525,
    "end": 2697.266,
    "text": "So just on that on that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.307,
    "end": 2704.529,
    "text": "When I really was thinking about cognitive uploading, it's like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.023,
    "end": 2712.055,
    "text": " it's like putting something into the niche and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.594,
    "end": 2720.298,
    "text": " for others to use and reuse and maybe interact with or like remix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.598,
    "end": 2741.751,
    "text": "And what you're saying about like this hybridization between academic and professional really makes me think about complex systems and like the Santa Fe Institute where Daniel and I met and the kind of siloed academic experience that maybe people are still having, unfortunately,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.191,
    "end": 2743.752,
    "text": " but that people have had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.253,
    "end": 2757.362,
    "text": "So if you are in mechanical engineering versus biology versus economics, you have very different knowledge acquisition and a very different culture and a very different way of interacting with your peers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.303,
    "end": 2763.447,
    "text": "And there's this kind of siloed culture, even within an academic culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.807,
    "end": 2766.829,
    "text": "So even subsections of academia tend to be siloed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.23,
    "end": 2767.61,
    "text": "And when you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.137,
    "end": 2796.484,
    "text": " bring people into a complex systems kind of environment there's this amazing like ability for new ideas to generate right it's like this cross-fertilization or cross-pollination people call it different things but but when people come together with academic expertise some you know shared ability to read write and do some mathematics so when people come together with and intermix their own siloed knowledge which is deep like it tends to be very very deep like if you've got",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.872,
    "end": 2805.155,
    "text": " you know, PhD or bachelor's degree or master's degree in your field, like, you know, a whole lot about that field and probably not a lot like about the other field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.595,
    "end": 2814.539,
    "text": "So when you come together in a complex systems kind of way, it enables people with this deep, deep knowledge and understanding of their own thing to then interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.679,
    "end": 2815.859,
    "text": "And it's exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.28,
    "end": 2817.68,
    "text": " And it builds new things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.72,
    "end": 2831.025,
    "text": "Like I think exponentially, like, like, you know, if I get together with a bunch of other data scientists or a bunch of other bio people or neuro people, I don't have that same kind of excited brainstorming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.372,
    "end": 2837.234,
    "text": " jittery idea, gosh, that was so professional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.955,
    "end": 2845.818,
    "text": "But generally, I think that that happens in this cross-fertilization or cross-pollination way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.858,
    "end": 2853.381,
    "text": "And when I think about cognitive uploading, I think about you push it in so that other people can interact with it, so that it can do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.861,
    "end": 2856.162,
    "text": " the cross-fertilization thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.242,
    "end": 2861.985,
    "text": "And maybe that's just kind of my naive interpretation of what they were saying in the paper, but that's kind of what I got.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.146,
    "end": 2864.246,
    "text": "And then Daniel made us slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.607,
    "end": 2866.168,
    "text": "So perfect, I talked enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.788,
    "end": 2868.589,
    "text": "I totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.809,
    "end": 2871.03,
    "text": "One slide's worth in Kairos time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.531,
    "end": 2877.494,
    "text": "Totally agreed though, like uploading as opposed to, or as distinguished from offloading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.115,
    "end": 2883.558,
    "text": "Offloading, you just need to trust that the shelf isn't gonna break and someone's not gonna steal your backpack while you're gone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2884.178,
    "end": 2895.528,
    "text": " But cognitive uploading, like you gotta trust that file is being stored and that that is gonna be able to be executed potentially even outside of your awareness or control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.129,
    "end": 2904.236,
    "text": "So when we're in like a interdisciplinary context or just sharing like cognition in a team, we're getting it done as a team,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2905.632,
    "end": 2920.403,
    "text": " The uploading brings in this whole element of like trust and culture and glue that others are gonna be able to do things that you don't want to do, that you can't do, that you wouldn't see of doing, all these different ways in which their active cognitive model is different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.264,
    "end": 2925.446,
    "text": " and importantly aligned and importantly contrasting and complimentary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.586,
    "end": 2926.727,
    "text": "It's all of those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2927.527,
    "end": 2938.452,
    "text": "So here's a few visualizations of borders between or interfaces between entities and each other or entities in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.901,
    "end": 2951.968,
    "text": " So on the left side, it's like the overlap between two systems, whether we think about them as like, oh, that block in the city, it's part of little Italy and downtown.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.709,
    "end": 2957.652,
    "text": "So there could be like a block, there's a border region, but it is both included in the two sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.212,
    "end": 2967.738,
    "text": "Or it can be a little bit more blurry or fuzzy around what those orange and blue sets are, but still there's like a region that is overlapping and claimed by both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.261,
    "end": 2977.961,
    "text": " There's another case where the border or the interface is something that is like overlapping to both, but also a distinct region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.908,
    "end": 2987.333,
    "text": " perhaps like a cell membrane, or in the full separation case, it becomes its own separate region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.234,
    "end": 2997.279,
    "text": "And that entails now this recursive boundary setting, because now there's Wall Street, there's the street in front of the wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.319,
    "end": 3006.925,
    "text": "And so this just made me wonder when we were talking about academic and professional,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.884,
    "end": 3012.107,
    "text": " What kind of synthesis or what kind of integration are we looking for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.687,
    "end": 3018.691,
    "text": "Which one of these setups is predisposed towards effective extended active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.592,
    "end": 3023.715,
    "text": "Or is this something that we determine about how it really is in the world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.535,
    "end": 3025.296,
    "text": "Hashtag realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.016,
    "end": 3029.999,
    "text": "Is this a model selection choice from an instrumentalist point of view?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.066,
    "end": 3034.467,
    "text": " Can I just speak to that for a sec, Dan?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3034.867,
    "end": 3055.217,
    "text": "I think this is interesting because in this example and also in the paper where they talk about desire lines, we do have a tendency to sort of see these things be at the border or the artifact of the number of humans or animals that walked to the watering hole and the result on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3055.277,
    "end": 3057.238,
    "text": "And they speak to that clearly in the paper that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.231,
    "end": 3063.813,
    "text": " So sometimes that is not acting, the environment's not acting in a surprising way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3065.073,
    "end": 3071.475,
    "text": "That's the result of what ends up happening when a whole bunch of people follow the same path or use the same stones to break the nuts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3071.875,
    "end": 3073.596,
    "text": "That's the capuchin monkey example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3074.356,
    "end": 3077.837,
    "text": "Or use the same spices, right, in a particular thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3078.657,
    "end": 3086.38,
    "text": "One of the things that we kind of just touched on briefly in this dot zero was, so what if you took all of those examples that you had of boundary",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3087.406,
    "end": 3092.608,
    "text": " And you used green as one of the things to sort of show it in the rectangular shape.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3092.908,
    "end": 3104.113,
    "text": "But what if you were able to twist that and do with it what we have when we, for example, use the Mobius strip in the keywords?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3105.214,
    "end": 3107.094,
    "text": "Do you have a representation of that here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3107.134,
    "end": 3108.475,
    "text": "And why would that matter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3108.595,
    "end": 3110.556,
    "text": "Because I think that actually really does matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.596,
    "end": 3113.137,
    "text": "And I think it's something that we tend to overlook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3114.804,
    "end": 3122.066,
    "text": " So if we're talking about transdisciplinary and blues point, I think this fits really, really well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.086,
    "end": 3132.269,
    "text": "But if you wanted to talk about people walking into a situation who are creating a new cognitive niche, they don't come from a place of knowing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3132.989,
    "end": 3135.07,
    "text": "They basically come from a place of not knowing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3135.87,
    "end": 3144.092,
    "text": "And they're going to build that new boundary or that new border, and they're not going to be restricted to the oval shape.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.834,
    "end": 3164.156,
    "text": " might be able to put a single twist on it and come up with like like i said the example that we have that that we put up as a representation behind our keywords or maybe they'll do a mandelbrotty and two cranks of the system and they'll come up with the um two loops that are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.157,
    "end": 3166.919,
    "text": " orthogonal to one another, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3167.199,
    "end": 3174.466,
    "text": "And what does that mean in terms of a representation around uploading as opposed to offloading?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3174.907,
    "end": 3178.39,
    "text": "And I think that that's, yeah, exactly, as you're building it out here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3178.67,
    "end": 3187.999,
    "text": "This is where it actually gets interesting because I think that's where, again, if we always see ourselves as where does my cognition end and begin, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3188.921,
    "end": 3200.724,
    "text": " we will get one, out will kick a certain number of representations, all conforming to that pre-desire to keep the cognition contained and framed and stabilized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3201.161,
    "end": 3214.007,
    "text": " Now, if we look at this from the environment position and the argument flip or inversion of that, can we just limit the inversions to the two sides on either side of the Markov blanket?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3214.047,
    "end": 3218.69,
    "text": "Or could we actually look at the Markov blanket twisting and reforming itself?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.63,
    "end": 3222.571,
    "text": "Because, I mean, it opens up the space for that possibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3222.651,
    "end": 3229.815,
    "text": "Now, whether we choose to give any attention over to that or make ourselves available to that, it gets really, really interesting in a hurry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3235.3,
    "end": 3259.009,
    "text": " so i think it is really interesting and where we put the boundary um maybe depends on what we feel that we are uploading or offloading like by us uploading these video series into the niche environment of the internet um we other people are able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.54,
    "end": 3279.778,
    "text": " cognitively offload like they're offloading their need to delve into deep read and unpack this paper like they could just you know they've offloaded it to us and they're just watching the youtube video not everybody sorry if you if you're really actually reading the paper and really into it and just want to want to hear someone else reflect but in many ways you know we provide a summary of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.342,
    "end": 3289.33,
    "text": " that in today's information-laden age, it's really impossible to just read all the papers, even in your own field, when there's five papers released a day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.67,
    "end": 3291.872,
    "text": "So I don't blame you for doing some cognitive offloading there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.912,
    "end": 3296.256,
    "text": "But by us uploading, that enables someone else to offload.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.736,
    "end": 3298.017,
    "text": "Is that always the case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.157,
    "end": 3301.24,
    "text": "Is there this interplay with upload and offload?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.34,
    "end": 3302.901,
    "text": "I think about Google Maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.922,
    "end": 3308.166,
    "text": "That is the biggest cognitive offload that I've seen in technologically advanced",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.672,
    "end": 3310.814,
    "text": " in technological advancements in my lifetime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.194,
    "end": 3314.036,
    "text": "Like I no longer remember how to get anywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.477,
    "end": 3328.188,
    "text": "Like maybe if I drive there 15 times, maybe then, but, or maybe if I know someplace next to it, like, like, but as far as driving to a new place, a place I've never been, a new housing development, for example, like I have a friend that moves in and I've never been there before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.528,
    "end": 3331.691,
    "text": "I'm at their house 15 times before I remember how to get back and forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.771,
    "end": 3334.253,
    "text": "And I Google about myself the whole way every time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.973,
    "end": 3337.275,
    "text": "It's massive cognitive offloading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.554,
    "end": 3343.299,
    "text": " but only because Google was so kind to upload the information only due to uploading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.659,
    "end": 3344.8,
    "text": "Can I then offload?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.18,
    "end": 3347.242,
    "text": "And then does that also work culturally?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.683,
    "end": 3356.09,
    "text": "Like in terms of, I think about institutional or hierarchical organizations, or even thinking like a state, I have someone who will make shoes for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.47,
    "end": 3358.111,
    "text": "I don't need to know how to make shoes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.151,
    "end": 3360.694,
    "text": "I just need to know how to access shoes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.714,
    "end": 3361.915,
    "text": "I don't know how to make shoes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.435,
    "end": 3365.718,
    "text": "So, but because someone else is uploading that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3366.354,
    "end": 3389.493,
    "text": " information technology their product to our culture cognitively but it's like the output of their cognition actually i get it maybe they could actually teach someone else how to make shoes if they had to but but my point is is that there's like this interchange does upload somewhat because you upload it to someone else download it and then they can offload because of their ability to download sorry if that was rambly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.211,
    "end": 3391.851,
    "text": " No, I think that's perfect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3392.051,
    "end": 3401.053,
    "text": "And my question then is, from a learning standpoint, are we more adept at accepting other people's information?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3401.333,
    "end": 3405.274,
    "text": "Because that expedites, we can follow and use that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3406.394,
    "end": 3408.254,
    "text": "Your first example, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3409.034,
    "end": 3412.415,
    "text": "Here's somebody, Google, I mean, for Google, it's great for them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3412.455,
    "end": 3417.796,
    "text": "They went and figured out how to become the go-to source for uploading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3418.616,
    "end": 3429.041,
    "text": " But what are we doing in terms of giving people a sense of their agency over uploading as opposed to simply just following and being consumed by the Googles?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3429.641,
    "end": 3439.105,
    "text": "If we're going to invert this, we need to ask that question around what we're giving people in terms of agency and knowing the difference between the trade-offs",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3440.458,
    "end": 3446.93,
    "text": " that happened with offloading, as you described, you're not building any desire lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3447.17,
    "end": 3450.596,
    "text": "Your GPS is doing it for you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3450.837,
    "end": 3453.702,
    "text": "Now you feel completely dependent upon that thing and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3454.181,
    "end": 3466.069,
    "text": " You don't have to be able to make shoes to be able to understand the difference between what you might need in one set of circumstances on your feet and what you might need in another set of circumstances on your feet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3466.429,
    "end": 3470.892,
    "text": "But are we drifting to that place that says, I don't even know what shoes to put on today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3470.992,
    "end": 3472.614,
    "text": "I better go and find out from Google.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3476.536,
    "end": 3478.738,
    "text": "Yes, very interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.687,
    "end": 3486.209,
    "text": " keeping with the uploading, offloading desire paths and Google, thanks YouTube, by the way, for the affordance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.989,
    "end": 3494.131,
    "text": "What if each person were only seeing locally which paths were attractive to them, which search results were appealing to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.771,
    "end": 3505.674,
    "text": "But then there was an eye in the sky that could see the statistical distributions of everyone else in their uploading and offloading that would actually make that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.438,
    "end": 3510.219,
    "text": " tremendous resource for the eye in the sky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.399,
    "end": 3514.881,
    "text": "And so that's a little bit of the asymmetry, but the challenge and opportunity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3516.182,
    "end": 3522.045,
    "text": "Also the caption of figure one does explicitly mention like action, perception and learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.885,
    "end": 3524.827,
    "text": " So that's very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.847,
    "end": 3546.923,
    "text": "And it does raise the question of what is the difference between perception and learning, which is discussed a ton in Act-Inf and in the textbook, what the similarities and difference are, like with perception being over faster timescales, but being fundamentally similar to learning, but learning being about cognitive parameters and usually updating over slower timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.376,
    "end": 3553.339,
    "text": " And then what does learning look like in a cognitive offload world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.559,
    "end": 3560.342,
    "text": "In the no offload world, then in the cognitive offload world, and then in the cognitive upload world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.622,
    "end": 3569.747,
    "text": "So just to kind of maybe just give one example, the no offload world is the test where you can't bring any notes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3571.088,
    "end": 3575.15,
    "text": "In that case, it's like what you know about organic chemistry is in your skull.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3577.078,
    "end": 3580.6,
    "text": " One could go a little bit broader than that, but you can't take in your notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.241,
    "end": 3589.805,
    "text": "The cognitive offloading, which is going to beg the question of like epistemic action is you're allowed to bring in your own notes or even the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.386,
    "end": 3592.947,
    "text": "So it's a dead artifact in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.107,
    "end": 3594.548,
    "text": "It's a mere active entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3594.608,
    "end": 3596.709,
    "text": "It's an epistemic resource in AOS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3596.729,
    "end": 3604.454,
    "text": "We would call it an informational entity in the niche and it can be referenced and you might only have to learn where to look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3605.114,
    "end": 3633.412,
    "text": " learn where you put your backpack learn which chapter to look to when you want to resolve a certain kind of uncertainty so it's an affordance you didn't have in the no offload case to have the textbook or the notes what's the cognitive upload is it phone a friend is it go in with the chemicals and have a lab kit like what does it look like to go one step beyond yes you can take your notes into that organic chemistry test what is the upload what do you think dean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.565,
    "end": 3644.712,
    "text": " I think the upload is when you are taking the information that you've received here and finding yourself migrating in a completely different culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3645.113,
    "end": 3650.897,
    "text": "And somebody in that completely different culture says, I want you to solve this problem for me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3651.197,
    "end": 3655.08,
    "text": "Before I can hire you, can you do this thing first?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3655.14,
    "end": 3660.304,
    "text": "Show me that you can do this thing or resolve this issue for me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3661.528,
    "end": 3673.214,
    "text": " So it's taking information from one context and finding yourself in a completely different context, not from the person who's decided this is the amount of material that we've covered in these past 13 weeks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3673.734,
    "end": 3682.159,
    "text": "And now I'm going to select out the points that I want you to, as you said, load into your bucket and carry into the testing situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3682.619,
    "end": 3688.202,
    "text": "I want you actually now to take what you've learned and I want you to go out back into the wild now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3689.039,
    "end": 3701.288,
    "text": " where you're going to have to be able to solve something as a result of you loading up your quiver or your 13 weeks worth of information, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3701.868,
    "end": 3712.716,
    "text": "That's literally finding yourself now working with a new culture and that new culture taking on all the properties that they're talking about in this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3715.297,
    "end": 3716.778,
    "text": "Another angle on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.838,
    "end": 3717.339,
    "text": "Oh, yes, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.78,
    "end": 3731.175,
    "text": " So my take on that would be to like, say you have all of the material that you learned, you have all the books, you have all the notes, you then go teach it to someone else and they go in and take the test for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.355,
    "end": 3733.517,
    "text": "So that would be uploading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.138,
    "end": 3734.579,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.159,
    "end": 3735.5,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.62,
    "end": 3736.441,
    "text": "Is that what you were going to say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.941,
    "end": 3737.122,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3737.262,
    "end": 3737.922,
    "text": "So we have too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.163,
    "end": 3738.723,
    "text": "We do too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.743,
    "end": 3738.824,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.247,
    "end": 3743.189,
    "text": " I was thinking of a driver's exam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.749,
    "end": 3748.433,
    "text": "It's the difference between the no notes driver's exam, taking the test at the DMV.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.893,
    "end": 3750.695,
    "text": "Can people tell that I just renewed my license?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3751.515,
    "end": 3756.039,
    "text": "And then there's the having the notes and then there's the actual driving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3756.379,
    "end": 3763.324,
    "text": "And so that is where the functions are no longer hypothetical and in a testing scenario, but they're enacted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.105,
    "end": 3772.11,
    "text": " And that means that it's different to say you should do this when you're parallel parking and it is going to be 15 feet versus the actual enacting of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3772.591,
    "end": 3783.398,
    "text": "And that cognitive function really or instrumentally is happening in this extended way with the visual components of the car and the proprioception of the car.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3783.858,
    "end": 3793.605,
    "text": "So that is one angle is towards the practice bent and then blue awesome point with taking it towards the teaching, which is like if you had to send a proxy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.185,
    "end": 3798.207,
    "text": " And what if we all had to train a proxy test taker?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.227,
    "end": 3813.316,
    "text": "It would take like, well, you know it when you can teach it to another level because that would entail many, many aspects of making sure that you could upload it in a way where then they could offload or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.457,
    "end": 3819.019,
    "text": "And then of course the infinite regress is, well, what if they had to go train somebody else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.56,
    "end": 3823.282,
    "text": "And then you would have reinvented academia from scratch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.502,
    "end": 3823.642,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.034,
    "end": 3830.218,
    "text": " Yeah, I find that what you guys are describing, I find that it kind of is an intermediary step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3830.338,
    "end": 3833.08,
    "text": "If you can teach it to somebody else, you know it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3833.2,
    "end": 3840.305,
    "text": "And I think it does a good job of blending sort of the procedural knowledge and the declarative part if you can teach it to somebody else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3840.345,
    "end": 3846.91,
    "text": "But I think if you're talking about uploading, I think you actually need to find yourself in a completely different cultural setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3848.448,
    "end": 3850.429,
    "text": " as opposed to the offloading aspect of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3850.449,
    "end": 3855.852,
    "text": "So I think you actually have to move outside of the teaching realm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3856.352,
    "end": 3869.638,
    "text": "I find that if you can teach it to somebody else as a nice sort of middle ground between where you would eventually have to go if you're gonna niche construct in the wild,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3871.147,
    "end": 3876.988,
    "text": " as opposed to the setting, which is somewhat contained and framed, which is teaching, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3877.128,
    "end": 3878.649,
    "text": "Learning in that setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3879.329,
    "end": 3883.329,
    "text": "So I'm not saying you guys aren't moving in that direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3883.67,
    "end": 3895.832,
    "text": "I just think that the ultimate end game of uploading is different than the one that's offloading, which there's way more offloading in the teaching realm than we probably care to acknowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3897.268,
    "end": 3903.19,
    "text": " Or for the plot embedding, offloading is more like instructionalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3904.17,
    "end": 3905.51,
    "text": "You're offloading the recipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3906.29,
    "end": 3912.452,
    "text": "And then interactionism requires the other interact ant to be a cognitive entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3912.492,
    "end": 3914.032,
    "text": "And so that's more like the figure two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.132,
    "end": 3915.713,
    "text": "It's more like cognitive uploading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.233,
    "end": 3922.855,
    "text": "And the more interactionism is at play, the more figure two-like we're in a space of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3923.908,
    "end": 3937.358,
    "text": " the more it is like a question that Dave has just asked in the chat, which is, isn't the result of offloading a new goal-seeking, self-maintaining, autopoetic thing, all caps, and telky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.858,
    "end": 3939.98,
    "text": "That's kind of Aristotelian a little bit, I believe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3941.396,
    "end": 3945.359,
    "text": " Yes, and that's a little bit like our progression here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.539,
    "end": 3957.486,
    "text": "Here was two things and their interface, and then it got more and more shared or delineated or less until at some level of interfacing and interactionism and extended cognition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.226,
    "end": 3970.688,
    "text": " from a functional or psychological perspective, which is what they explore in this paper, or from an ecological and an evolutionary perspective, like Constant et al explore elsewhere, it does become a new kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.088,
    "end": 3978.189,
    "text": "The eukaryotic cell is a thing, and it's a thing that involves these nested and interfacing systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3978.81,
    "end": 3987.251,
    "text": "And then I took the colors that we had here and overlaid them from this abstract space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.358,
    "end": 3993.782,
    "text": " into this kind of space that we've seen with the figure one and two representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.643,
    "end": 4002.631,
    "text": "And isn't that interesting that the blanket states are the interface, the border states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.531,
    "end": 4005.814,
    "text": "And so, as we discussed,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4006.684,
    "end": 4013.549,
    "text": " The dynamics, even in the mere-act-inf case, could be very chaotic or very difficult for the entity to predict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.11,
    "end": 4019.934,
    "text": "So mere-act-inf shouldn't be seen as meaning that it's simple or it doesn't have rich dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.196,
    "end": 4024.218,
    "text": "How do we know which of these settings we're in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.418,
    "end": 4026.72,
    "text": "Or how do we make the best of these settings?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4032.441,
    "end": 4037.782,
    "text": " Wasn't there, Daniel, can you find the slide in the 41 deck where we talked about the joint?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4044.204,
    "end": 4045.284,
    "text": "Yes, there we go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4045.304,
    "end": 4047.085,
    "text": "The joint self-evidencing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4047.645,
    "end": 4058.788,
    "text": "I guess what I'm saying is that joint self-evidencing on the one level of instructionalism or the joint self-evidencing in terms of the interaction piece",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4061.328,
    "end": 4068.649,
    "text": " I think that that's, you can decide how big, how sophisticated, how complicated you want that joint to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4069.129,
    "end": 4079.711,
    "text": "But I think that that's what this is essentially saying is, can we get ourselves to a place of this closest, like the closing of the circle of causality part, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4079.751,
    "end": 4081.752,
    "text": "That's sort of circularity piece of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4082.872,
    "end": 4085.312,
    "text": "When do we realize that it's circular?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4085.912,
    "end": 4090.153,
    "text": "Is it when we're at the instructionalist level or when we're at the interactionist level?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4092.403,
    "end": 4093.284,
    "text": " Lou, do you have a thought?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.565,
    "end": 4097.752,
    "text": "Or there's a little bit more slide play that could happen, I think, to resolve Dean's question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.515,
    "end": 4101.157,
    "text": "Go ahead and give it over to Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.217,
    "end": 4102.339,
    "text": "I'm just thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.822,
    "end": 4106.105,
    "text": "Let's say that we were in a forest of F2s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.93,
    "end": 4130.376,
    "text": " so we're no longer thinking about just nest mates interacting but now we're thinking about like each one of these orange the so we're gonna our system of interest is going to be the orange um guys we got f2a f2b and f2c and they're like different evolutionary replicators of a similar kind they're different organisms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.383,
    "end": 4134.846,
    "text": " The blue could be the same physical niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.266,
    "end": 4137.428,
    "text": "It could be each other in an adaptive niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4137.528,
    "end": 4145.795,
    "text": "They could each be in their own battles, but their fitness is being relatively compared in terms of their success.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4146.595,
    "end": 4154.942,
    "text": "Now, what does it mean when on that slide that we were just on, on figure two, when they mentioned",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4156.912,
    "end": 4166.04,
    "text": " This closes the circle of causality in which the niche and phenotypes are trying to learn about each other to minimize their joint free energy or surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.56,
    "end": 4167.001,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4167.301,
    "end": 4169.723,
    "text": "So what does that mean that the causality has been closed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.263,
    "end": 4179.011,
    "text": "So one worldview would be, well, let's just look at how the three orange entities are connected and think about how they're in competition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4179.712,
    "end": 4182.674,
    "text": "And so that might be a totally valid and important way to look at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.335,
    "end": 4183.495,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.154,
    "end": 4208.955,
    "text": " um this is kind of like there's various statements i'm sure various phrasings but i won't even try but what is the good in doing so well in the orange f2a free energy minimization such that this whole system is actually maladaptive so that would be like this entity being greedy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.824,
    "end": 4212.446,
    "text": " in this new kind of interaction or thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.167,
    "end": 4235.763,
    "text": "And so the one, the orange A, B, or C that's going to persist the best or have the highest fitness is going to be involved in the best free energy minimization of this whole system where there's sense and action coming both ways, because just to short-term do a free energy minimization here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.801,
    "end": 4243.745,
    "text": " at the cost of maladaptive actions coming in the future back from the niche is not a sustainable strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.245,
    "end": 4265.216,
    "text": "And so that's like where they tuck the little bit, the last thread gets tucked back into the ecology and evolution and the selective niche, which is the one that actually provides at least an adaptive starting point for the cognitive functional and psychological habitats that they're discussing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4268.973,
    "end": 4290.584,
    "text": " you think dude well so so again here's the thing if we're talking about just the perception piece and we've got three three versions of perception is that what you're you're trying to bring out here three similar kinds of entities that are involved in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4292.165,
    "end": 4292.566,
    "text": " fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.888,
    "end": 4299.275,
    "text": "But we're focusing in on the perception aspect of that, are you not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4301.178,
    "end": 4307.247,
    "text": "Are we looking at the cultural piece of this when three perceivers are proximal to one another in the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4309.043,
    "end": 4313.008,
    "text": " in an environmental cluster or in a cognitive niche?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4313.569,
    "end": 4316.793,
    "text": "How do those perceptions align with one another?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4316.913,
    "end": 4318.315,
    "text": "And what's the timeframe, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4318.335,
    "end": 4319.896,
    "text": "What's the diachronic of this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4319.916,
    "end": 4324.442,
    "text": "I just want to make sure I'm clear about what you're trying to show here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4326.479,
    "end": 4330.72,
    "text": " There's probably multiple ways to think about it or show it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.841,
    "end": 4333.541,
    "text": "Let's try to make it one little bit clearer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4334.542,
    "end": 4335.782,
    "text": "Here's going to be the blue niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.703,
    "end": 4342.184,
    "text": "And now we're going to have those cognitive entities sharing a niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4343.145,
    "end": 4348.447,
    "text": "So here's going to be a bunch of brains that are going to be sharing the same blue niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.927,
    "end": 4352.468,
    "text": "So how does this affect what you're discussing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4354.787,
    "end": 4357.268,
    "text": " They're all being interfaced with a common niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.048,
    "end": 4364.171,
    "text": "And so in what way can we say that they're involved in joint action perception loops?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4366.191,
    "end": 4374.575,
    "text": "Well, that's where I'm curious because I think what this does is it shows that there is something called an extended loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4377.643,
    "end": 4391.124,
    "text": " Aspect of this of this active inference frame, but I wouldn't I don't know how each one of those perceivers realizes What the others are perceiving as well?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4391.425,
    "end": 4391.725,
    "text": "I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4392.717,
    "end": 4398.501,
    "text": " the environment or the niche itself knows collectively what that is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4398.581,
    "end": 4405.606,
    "text": "But I don't know that each one of those individual representations of the brain necessarily does know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4405.626,
    "end": 4419.775,
    "text": "And I think this is where this, it trips up a lot of people because, oh, I don't believe in extended, extended cognition because you can't possibly, Daniel, you can't possibly know what Dean's thinking and Dean can't possibly know what Blue's thinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4419.815,
    "end": 4422.097,
    "text": "But eventually as we work out,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4422.817,
    "end": 4433.864,
    "text": " together through communication, through some sort of signaling processes, eventually we kind of land on some sort of generally agreed to sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4434.304,
    "end": 4436.485,
    "text": "There's a collective sense around this as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4436.846,
    "end": 4440.508,
    "text": "And so do we say, well, that collective sense isn't cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4442.546,
    "end": 4444.549,
    "text": " We don't know what it is, but it's not cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4445.211,
    "end": 4456.248,
    "text": "But of course, it's all based on cognition, but we're not going to call it cognition because we can't possibly know everything that's going on in that other perceiver, cognizant,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4457.788,
    "end": 4461.191,
    "text": " way of looking at blue, at this blue rectangle, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4462.232,
    "end": 4465.594,
    "text": "So, sorry, sorry, blue night, blue rectangle, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4465.695,
    "end": 4469.378,
    "text": "So, again, this is, that's, yeah, thinking through other minds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4469.398,
    "end": 4480.847,
    "text": "I don't know how we, I don't know how we quantify it, but also recognize that it is, it does exist, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4481.724,
    "end": 4493.713,
    "text": " And if we get too concerned that if we can't measure it, it's not a thing, then we'll just pretend like it's not there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4494.454,
    "end": 4495.495,
    "text": "But it's there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4495.555,
    "end": 4497.696,
    "text": "Not all things are necessarily measurable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4498.537,
    "end": 4510.426,
    "text": "The way that we can hook up the cap and make sure that it's picking up everything in the whatever the heck of the one is that is the cap as opposed to the fMRI, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4512.722,
    "end": 4513.022,
    "text": " EEG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4514.043,
    "end": 4514.584,
    "text": "Thank you, sir.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4515.124,
    "end": 4515.344,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4516.305,
    "end": 4519.728,
    "text": "I just looked up like opposite of extended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4521.11,
    "end": 4527.255,
    "text": "And so there's like retracted, reduced, shrunk, narrowed, shortened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4529.858,
    "end": 4538.906,
    "text": "It's interesting how extended cognition feels like a reach, yet defending the other position...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.957,
    "end": 4543.538,
    "text": " is almost too narrow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4548.6,
    "end": 4557.263,
    "text": "So I just was going back and reading the author's definition of uploading versus offloading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4557.283,
    "end": 4570.668,
    "text": "And they said, in contrast to the traditional notion of offloading, the notion of uploading refers to the creation of novel cognitive functions that are taken on board by the cognitive niche per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.226,
    "end": 4573.767,
    "text": " instead of being merely managed by the cognitive niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.967,
    "end": 4582.169,
    "text": "A function is offloaded when individual agents restructure the world so as to minimize internal processing costs and or increase reliability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4583.169,
    "end": 4595.113,
    "text": "For example, by posting a yellow sticky note as a reminder, for example, that a function is uploaded when social and technological change means that it's now taken care of by the niche rather than the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4595.572,
    "end": 4600.014,
    "text": " For example, most agents store phone numbers in smartphones instead of by memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.614,
    "end": 4604.316,
    "text": "So the whole number storage function has been assimilated into the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.237,
    "end": 4613.421,
    "text": "The niche into which the function has been uploaded can then be passed on to future generations for them to leverage, share, and finesse that function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4613.741,
    "end": 4621.265,
    "text": "And so I wonder if the difference between offloading and uploading is a transgenerational difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.945,
    "end": 4624.126,
    "text": "So like I do offloading,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4625.313,
    "end": 4638.784,
    "text": " like, you know, with my yellow sticky note or like my notes in my little pad, but I do offloading when I, you know, create a publication from those notes and publish it into something that's then archived that the future generations can access.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.586,
    "end": 4655.596,
    "text": " that's that's awesome um here's a thought on that uh connecting it to the epistemic actions so offloading just like they describe it says um a yellow stick note on the front door to remind them to pick up milk next time they are out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4657.051,
    "end": 4660.032,
    "text": " It doesn't say this means pick up milk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4660.672,
    "end": 4666.253,
    "text": "They've offloaded their cognitive backpack, but only they know their recovery seed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.513,
    "end": 4673.735,
    "text": "Only they know the password to speak friend and enter into that extended cognitive function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.515,
    "end": 4683.117,
    "text": "Whereas if it were cognitively uploaded, I made an app that reminds people to get their milk when they're low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.432,
    "end": 4702.112,
    "text": " that is actually something that because of its intrinsic and more integrated actual cognitive function, like the ability to assess information, like the level of milk in the fridge, and then take an action, like remind the person or not, it's a bona fide cognitive entity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4703.243,
    "end": 4708.644,
    "text": " It's more like figure two, more like uploading than it is like figure one offloading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.224,
    "end": 4726.167,
    "text": "And then that app can be leveraged and shared and intergenerational in a way where it would be extremely difficult and only through like implicit learning and seeing it many times would somebody be like, ah, yes, we put the yellow post-it note when we want to remind ourself later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4726.707,
    "end": 4729.187,
    "text": "So interesting example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4729.247,
    "end": 4732.188,
    "text": "And it's very true what they say about future generations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.248,
    "end": 4732.408,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.544,
    "end": 4744.114,
    "text": " Yeah, and I think when we get into that diachronic piece, we're not just offloading remember to get milk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4744.695,
    "end": 4750.741,
    "text": "What we're doing is when we're uploading, we're talking about rules, especially if we're talking about culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4750.781,
    "end": 4755.205,
    "text": "It's the old, that's not the way we do things around here kind of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4756.006,
    "end": 4757.107,
    "text": "So I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4758.305,
    "end": 4763.58,
    "text": " There are differences between offloading and uploading, and I do believe that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4765.399,
    "end": 4794.311,
    "text": " rules because rules are always kind of flexible they're always a limit around where when we talk about scale friendliness there's an effective limit around how a rule will be able to function at scale so there's there is going to be a certain amount of arbitrariness when we get up to that rules place and as we pass rules down from one generation to the next i'm sure both of you can think of the times when your parents told you this is the rule and you both looked at them and went",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4795.839,
    "end": 4798.121,
    "text": " What the, why is that the rule?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4798.942,
    "end": 4799.742,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4800.643,
    "end": 4808.67,
    "text": "So now when we're talking about rules and we're talking about uploaded things, I think there has to be a certain amount of participation in that rule setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4808.77,
    "end": 4817.718,
    "text": "It's not always the case, but I think in order for it to be adopted and actually to be a part of the cognitive niche, we're not just talking about content here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4818.199,
    "end": 4820.521,
    "text": "We're talking about consequences here as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4821.081,
    "end": 4840.745,
    "text": " And so I think that's where this gets really, really interesting in terms of building or constructing that psychological and functional niche, but also appreciating that it's kind of rules-based and it's joint self-evidencing as opposed to, well, Daniel believes in Jitsi, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4840.825,
    "end": 4842.766,
    "text": "So everybody's got to follow Daniel's rule.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4843.769,
    "end": 4853.778,
    "text": " But that's not kind of how it works when you bring a bunch of people together and you're trying to come up with some sense of where are the cognitive limits here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4853.918,
    "end": 4857.762,
    "text": "That arbitrariness aspect of it is actually a part of the game.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4859.323,
    "end": 4860.984,
    "text": " So that is awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4861.044,
    "end": 4872.211,
    "text": "It connects the intergenerational niche inheritance to the interactionism and to that idea of having to teach somebody else to take your organic chemistry test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4872.611,
    "end": 4881.116,
    "text": "Is the point of rule following in the short term from the age of zero to six years old to minimize the perceived number of times that a rule is violated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.996,
    "end": 4885.739,
    "text": "Or is it to minimize the amount of times that your grandchildren",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4887.532,
    "end": 4905.534,
    "text": " violate that rule or for example and so the further one looks into the future the more interactionist it looks and the more autonomy potentially provided to the recipient and that might also connect back to mike levin the discussion on training and learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.567,
    "end": 4918.374,
    "text": " Because the trainer and the trains, that may be a functional dyad, but it may not be able to result in the trainee being able to be training somebody else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4918.574,
    "end": 4920.976,
    "text": "Whereas somebody who has learned has a generative model update.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4921.056,
    "end": 4922.217,
    "text": "And so they may be able to teach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4922.877,
    "end": 4930.802,
    "text": "And then also to connect to Dean's, it was academic and professional settings, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.822,
    "end": 4935.545,
    "text": "And we talked about like the hybrid models and about, okay, so we had the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4937.139,
    "end": 4961.108,
    "text": " had walking into new niches then we had the professional okay here is us and now we're engaging we can think of this in of course multiple ways so one of this would be diachronic so the diachronic interpretation would be grandparent parent child",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.804,
    "end": 4971.507,
    "text": " The synchronic but extended spatial interpretation would be this could all be happening in the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4971.968,
    "end": 4981.872,
    "text": "Here's the academic context, academic niche, me in the academic niche, professional niche, other professionals in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4984.333,
    "end": 4990.995,
    "text": "So we have through space and through time, just like they explored some of those dimensions in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4991.255,
    "end": 4992.556,
    "text": "What do either of you think about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4995.876,
    "end": 5001.021,
    "text": " The representation, I think it's like this extended active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5001.441,
    "end": 5003.022,
    "text": "It grows, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5003.763,
    "end": 5004.424,
    "text": "It blossoms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5005.444,
    "end": 5007.026,
    "text": "So I'm liking where it's going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5010.889,
    "end": 5018.756,
    "text": "So it just made me think about, like, so I had brought up the temporal, you know, maybe to be uploading versus offloading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5018.816,
    "end": 5020.678,
    "text": "There's some kind of temporal persistence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5020.758,
    "end": 5022.86,
    "text": "But also, like, what if...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5025.396,
    "end": 5037.703,
    "text": " to be uploading, it has to be accessible even in the same time, because we don't really know if our YouTube video is going to be around in 10 years or watched by anyone else except us, or we don't really know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.844,
    "end": 5046.869,
    "text": "But we do know that it's watched by, like Tucker was watching it, I guess, and Dave, and so there are some people watching it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.389,
    "end": 5052.552,
    "text": "So if uploading just means beyond personal use...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5053.151,
    "end": 5053.791,
    "text": " would that be fair?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5053.951,
    "end": 5056.832,
    "text": "Like, is that, is that uploading versus offloading?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5057.872,
    "end": 5058.272,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.712,
    "end": 5063.814,
    "text": "But then if I, if I remind my daughter, like, so, so it just makes me think of like, but what about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5063.854,
    "end": 5064.354,
    "text": "But what about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5064.454,
    "end": 5069.895,
    "text": "So if I remind my daughter, like, Hey, don't forget your lunch or Hey, you know, you need to study for your spelling test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.295,
    "end": 5076.737,
    "text": "If I remind her or if I create a reminder for her, is that uploading or offloading?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5079.557,
    "end": 5080.197,
    "text": "Here's your lunch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5082.058,
    "end": 5082.658,
    "text": "Here's a post-it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5084.249,
    "end": 5086.489,
    "text": " to remind of lunch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5088.99,
    "end": 5092.231,
    "text": "How will you remind yourself of your lunch?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5099.352,
    "end": 5103.313,
    "text": "And it probably, there's probably ones that we could add above, here is your lunch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.453,
    "end": 5106.634,
    "text": "Here's the food in your mouth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.434,
    "end": 5109.734,
    "text": "Here's the airplane flying in, the food in your mouth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5111.515,
    "end": 5112.315,
    "text": "All the way up to, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5113.942,
    "end": 5118.889,
    "text": " well, before here's your lunch, I need to remember to remind my daughter to get her lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5119.43,
    "end": 5122.555,
    "text": "So there's like, how am I going to remember to remind my daughter to get her lunch?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5122.635,
    "end": 5125.819,
    "text": "Like there's that whole like second tier of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.099,
    "end": 5155.735,
    "text": " yes yes um and this is kind of like a continuum on um well this is a preparatory uh preamble but then it's like a continuum again from the more instructionalist to the more interactionist um and it probably gets more allegorical and it gets more flexible it gets more empowering but if you say and you mean it how um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.366,
    "end": 5159.967,
    "text": " I'm going to let you decide how to remind yourself of how to get your lunch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5162.268,
    "end": 5166.809,
    "text": "But also if you forget your lunch, you know, it's going to be really bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5167.889,
    "end": 5170.37,
    "text": "Then that creates a cognitive tension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5170.45,
    "end": 5185.335,
    "text": "And so that's kind of like where it's okay to experiment and fail and interaction, you know, to improvise one must like make some notes they didn't intend and then continue to roll with it as their new, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5187.006,
    "end": 5199.82,
    "text": " and just continue on like in improv versus if it was just about playing the sheet music as written, then every time a mistake is made, one could just push the rails back in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5202.845,
    "end": 5215.256,
    "text": " So I think what you're saying is I need to let my daughter go hungry when she forgets her lunch, because right now, if she forgets her lunch, it's really bad for me because I have to drive like an extra hour to go home and get the lunch or it's either way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.296,
    "end": 5216.017,
    "text": "It's an hour out of my day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.037,
    "end": 5217.959,
    "text": "I've got to stop at the grocery store and assemble a lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.019,
    "end": 5218.679,
    "text": "It's not just lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.779,
    "end": 5219.3,
    "text": "It's like lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5219.69,
    "end": 5222.032,
    "text": " Plus like six different snacks that she eats throughout the day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5222.452,
    "end": 5224.234,
    "text": "So she has to bring all the food with her every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5224.534,
    "end": 5226.676,
    "text": "So it's really bad for me if she forgets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5226.896,
    "end": 5230.379,
    "text": "So because I end up taking care of it for her, I should just let her starve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5230.519,
    "end": 5233.241,
    "text": "And then I will have uploaded that task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.525,
    "end": 5238.686,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5238.766,
    "end": 5242.229,
    "text": "Without getting between mother and daughter, can I just say one quick thing here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5243.704,
    "end": 5256.888,
    "text": " I think, again, if we're just trying to figure out what the extended cognition, if there's evidence for extended cognition, it's probably in the rule and the consequence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5257.268,
    "end": 5262.37,
    "text": "So it's to your point, Blue, if there's a consequence here, who has to take that consequence on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5263.01,
    "end": 5278.618,
    "text": " the older person who maybe whose prospective memory didn't work out that day and didn't provide all the reminders, or the younger person who now has the effect of not having something to eat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5278.658,
    "end": 5281.58,
    "text": "But I think the point here in terms of can we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5283.564,
    "end": 5305.403,
    "text": " The argument, because they call it an argument, this paper is an argument, the argument for extended cognition would be one where if we upload, we're probably going to be uploading rules and the consequences of those rules are implied versus the uploading of content and material that tends to overwhelm us",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5306.337,
    "end": 5315.361,
    "text": " and that we use devices then to act as a way of being able to store, because our own memorial capacities are somewhat limited.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5315.461,
    "end": 5321.604,
    "text": "Like, I mean, when I compare my memorial capacity to you and Daniel, I can't hold a candle to that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5321.624,
    "end": 5324.946,
    "text": "So I should be the one using all of the instruments for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5325.666,
    "end": 5337.798,
    "text": " But what I do is I have my own way of sort of compensating for that by developing my own rules sooner and with a more consequential nature to that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5338.198,
    "end": 5345.004,
    "text": "So that's what one of the things we could possibly be teaching six to eight year olds, not just here are the rules,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5346.124,
    "end": 5355.507,
    "text": " But what can you do in terms of helping me, who's probably got less capacity as I get older, for remembering all the content?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5356.748,
    "end": 5360.609,
    "text": "So there's consequences for me now, and there's consequences for you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5360.989,
    "end": 5365.711,
    "text": "We both suffer a certain consequence in this new environmental niche that we're constructing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5366.667,
    "end": 5369.369,
    "text": " Now, maybe the eight-year-old doesn't give a rat's backside about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5369.409,
    "end": 5370.45,
    "text": "She's just hangry now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5370.55,
    "end": 5372.272,
    "text": "But oh, well, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5372.352,
    "end": 5374.854,
    "text": "I mean, there's going to be some learning one way or another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5374.874,
    "end": 5383.001,
    "text": "And it could be through guilt or it can be through some kind of a conversation where you actually do introduce the rules and the consequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5383.141,
    "end": 5383.461,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5388.363,
    "end": 5398.933,
    "text": " In comparison to memorizing the RGB values of an image, like the pixel colors, none of us have memories that hold a candle to even the smallest JPEG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5399.634,
    "end": 5407.581,
    "text": "So render onto the JPEG that which is JPEGable, and then what will that leave humans to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.633,
    "end": 5413.435,
    "text": " And we hear about cognitive overload, cognitive security, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5414.016,
    "end": 5431.965,
    "text": "What does that actually mean for designing informational niches, cognitive niches from the psychological, functional, ecological, selective perspectives that are not overwhelming or that are accessible or that are resilient or that do stabilize function?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5432.545,
    "end": 5434.286,
    "text": "There's so many awesome...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5435.106,
    "end": 5458.213,
    "text": " questions that this like brings us totally towards daniel i'm sorry but i'm gonna have to bounce out now because uh i've just kind of used up all my energy anyway close this swing i hope you guys can close this thing off for me and i look forward to the point too so thanks thank you dean peace all right all right cool blue",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5461.482,
    "end": 5480.918,
    "text": " Let's think for a few more minutes what could be fun for Dot 2 and just how we can go from some of the rhetoric and perspectives they share towards all of these extremely relevant scenarios that we've been discussing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5482.46,
    "end": 5484.361,
    "text": "Like, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5485.522,
    "end": 5488.064,
    "text": "So for me, I think I'd like to touch back onto...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5491.897,
    "end": 5504.446,
    "text": " what other situations are like the Elizabethan play people, like the Elizabethan cast, um, the theater company, that's what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.486,
    "end": 5504.686,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5505.327,
    "end": 5518.116,
    "text": "Uh, so what other situations are like this Elizabethan theater company in that the culture is so strong and so vital to participation that, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5519.191,
    "end": 5520.272,
    "text": " you can just wing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.632,
    "end": 5524.854,
    "text": "Like you can know a lot of things just by queuing off of others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5525.534,
    "end": 5527.175,
    "text": "So I had mentioned jazz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5527.535,
    "end": 5535.618,
    "text": "I don't know what else, um, what other, I'd like to look at that a little bit more because it's that, that was the example that they gave, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5535.638,
    "end": 5537.559,
    "text": "This, this diachronic cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.639,
    "end": 5541.121,
    "text": "So it would be cool to look at that a little more deeply.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5542.321,
    "end": 5542.621,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5543.502,
    "end": 5547.444,
    "text": "Especially in like the kind of online context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5548.084,
    "end": 5548.164,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.963,
    "end": 5573.91,
    "text": " yes um agreed about that yeah you brought up music and jazz and about culture where does what is culture of different kinds and where does that fit into this ability of people to have joint action in what ways or in what senses is culture about shared ways of thinking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5574.938,
    "end": 5604.693,
    "text": " orthodoxy heterodoxy in what ways is culture about joint action orthopraxis and heteropraxis so i was thinking also about action um and like action offloading uh uh because just like in terms of a scaled system like sure cells do their own actions like they eat food and they you know secrete nutrients and you know they like communicate with each other and whatever but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5605.202,
    "end": 5611.228,
    "text": " But in terms of, like, a nested system, like, the cells don't have to go find water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5611.428,
    "end": 5612.75,
    "text": "The water just comes to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5613.53,
    "end": 5613.891,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.271,
    "end": 5618.996,
    "text": "Like, whereas a human, it's, like, one of the most vital things that we could ever do is find water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5619.096,
    "end": 5622.279,
    "text": "Like, clean drinking water, super necessary for life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5622.98,
    "end": 5623.16,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.441,
    "end": 5625.202,
    "text": " We have to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5625.262,
    "end": 5628.884,
    "text": "I mean, we've offloaded that into our culture with running water, but not every human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.644,
    "end": 5635.988,
    "text": "But I just think about we're acting on behalf of organ systems, cell systems, organelles, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.008,
    "end": 5638.55,
    "text": "So I think about action offloading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5638.89,
    "end": 5640.811,
    "text": "So what does that look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5642.172,
    "end": 5642.392,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5642.512,
    "end": 5645.894,
    "text": "And how akin to cognitive offloading or uploading is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5648.836,
    "end": 5649.116,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5649.456,
    "end": 5652.858,
    "text": "In what ways is the cognitive offloading and uploading different?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5654.665,
    "end": 5676.954,
    "text": " that of perception in what ways is it offloading action like if you write a script that then does some daily task that could be seen as like offloading a repetitive action and that's something that we're only unlocking with computers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5678.504,
    "end": 5684.588,
    "text": " but it's kind of like a, and it's even referenced in the idea of a daemon in computers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5686.088,
    "end": 5687.909,
    "text": "It's like the magician's familiar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5688.63,
    "end": 5702.578,
    "text": "It's this little trainable or learning entity that is able to carry things out according to the will of the magician in a semi-autonomous way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5704.335,
    "end": 5705.676,
    "text": " it's not just computers though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5705.736,
    "end": 5719.042,
    "text": "We've automated some tasks for us through the years, through the ways of like, even just with running water, like we, you know, that's an automated task that used to be a big portion of your daily life as a human, like going to find water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5719.843,
    "end": 5719.903,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5720.644,
    "end": 5723.087,
    "text": " And I mean, washing machines, dishwasher, we have all the things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5723.147,
    "end": 5724.848,
    "text": "I mean, we've been automating life for forever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5724.949,
    "end": 5727.011,
    "text": "So now it's just becoming more sophisticated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5727.411,
    "end": 5731.735,
    "text": "Now, perhaps we're automating our cognitive life, like with GPT-3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5732.076,
    "end": 5734.939,
    "text": "I think that that's like a different kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5736.431,
    "end": 5741.674,
    "text": " Yes, it's approaching automation at the semantic and linguistic level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5742.175,
    "end": 5751.08,
    "text": "Whereas previously it could be like at the task, the physical task performance level could be off-sourced or uploaded in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5751.901,
    "end": 5760.166,
    "text": "This is like rapidly rising in its cognitive complexity, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5761.616,
    "end": 5764.421,
    "text": " like a typewriter is a mere active entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5764.762,
    "end": 5772.836,
    "text": "It's part of extended cognition, type, type, type, type, type, but unless it gets jammed, one is not gonna be too surprised by how it performs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5774.423,
    "end": 5778.046,
    "text": " And that's like the famous Turing quote from back in the day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5778.087,
    "end": 5784.453,
    "text": "And someone said, like, how can it have intelligence or if it can't give a surprising answer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5784.894,
    "end": 5789.979,
    "text": "And then Turing said something like, computers surprise me every day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5790.84,
    "end": 5792.482,
    "text": "So is that going to be your measure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5792.802,
    "end": 5794.004,
    "text": "How surprised you are?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5794.024,
    "end": 5795.045,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.833,
    "end": 5797.834,
    "text": " What do you want to look at?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5798.174,
    "end": 5800.756,
    "text": "What do you want to look at, though, in the next one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5801.336,
    "end": 5811.202,
    "text": "I want to look at the partition question that Dave raised and also the earlier question from Dave when he wrote about the result of cognitive offloading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5811.983,
    "end": 5813.524,
    "text": "It was more about cognitive uploading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5813.784,
    "end": 5815.505,
    "text": "He clarified in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5815.605,
    "end": 5823.21,
    "text": "So I was thinking about the partition, too, like when I was talking about – I meant to say partition in there because it's a temporal partition –",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5823.69,
    "end": 5826.032,
    "text": " going from this generation to the next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5826.192,
    "end": 5834.018,
    "text": "Or is it like a cognitive or like a organismal partition between like me and you or me and my daughter or this group and that group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5834.998,
    "end": 5838.861,
    "text": "The partition is, the fuzziness of the partition always makes it interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.842,
    "end": 5840.182,
    "text": "What else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5840.722,
    "end": 5841.483,
    "text": "That's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5841.783,
    "end": 5843.384,
    "text": "Let's read his question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5844.045,
    "end": 5851.41,
    "text": "So in some papers other than this one, so here's the niche of papers citing each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5853.28,
    "end": 5877.047,
    "text": " in an adjacent regime of an attention but it's it's relevant the point comes up and this comes up indeed in discussion anatomical or mechanical blankets so at the cellular level this would be like the lipid bilayer cell membrane at the organismal level this would be like the epithelial so anatomical gross or micro mechanical blankets sometimes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5878.243,
    "end": 5883.589,
    "text": " coincide with functional psychological blankets and sometimes not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5884.349,
    "end": 5888.934,
    "text": "So two brain regions that are separated but have an interface",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5890.009,
    "end": 5903.238,
    "text": " It might be the case that their function could be ascribed with a certain partition that reflected the partitioning topologically of the anatomical components, or it could totally not be that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5903.899,
    "end": 5910.483,
    "text": "So sometimes anatomical mechanical blankets coincide with functional psychological blankets, and sometimes not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5911.164,
    "end": 5915.887,
    "text": "Insert all the asterisks that we've ever had about realism and instrumentalism, but just, we're going to plunge ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5917.008,
    "end": 5918.769,
    "text": "What is the relation among...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5920.331,
    "end": 5945.095,
    "text": " that distinction between the two kinds of blanketing this one more of a embodied enacted realist flavor and this one more of a functionalist flavor so what is the relation among a b and c here so what is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5946.843,
    "end": 5950.926,
    "text": " It's a relation of relation of relations as per usual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5951.947,
    "end": 5960.693,
    "text": "We're relating A, B, and C, where A is the relationship between these kinds of blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5962.073,
    "end": 5967.377,
    "text": "B is the hierarchical and heterarchical nesting of blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5968.778,
    "end": 5973.701,
    "text": "And C is the relations between or among niches",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5974.642,
    "end": 5977.803,
    "text": " and the particles that upload functionality to those niches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5985.805,
    "end": 5989.366,
    "text": "What do you think, Blue, about when they say that the answer is in the question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5991.646,
    "end": 5997.488,
    "text": "Like the way that the question is asked contains the seeds of an answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5998.328,
    "end": 5999.428,
    "text": "What do you think about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6001.347,
    "end": 6011.814,
    "text": " I mean, are you talking about, like, how I would, you know, cognitive offload information as an undergraduate just because I could tell by the way that the question was asked?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6011.854,
    "end": 6012.934,
    "text": "Yeah, like, I think I did that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6014.095,
    "end": 6017.337,
    "text": "Like, I think I looked for the answer in the question quite often.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6017.697,
    "end": 6020.619,
    "text": "As long as it's a multiple choice question, that was pretty simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6020.739,
    "end": 6024.261,
    "text": "Or if it wasn't there, it was often somewhere else in the test in a different question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6024.622,
    "end": 6025.642,
    "text": "So, like, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6025.982,
    "end": 6026.743,
    "text": "So, yeah, I did that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6028.584,
    "end": 6029.805,
    "text": "But I think here...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6032.37,
    "end": 6038.493,
    "text": " There's definitely some answering here happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6039.053,
    "end": 6040.694,
    "text": "Like, that distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6040.954,
    "end": 6041.594,
    "text": "What is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6041.854,
    "end": 6042.875,
    "text": "Like, I hate those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6043.155,
    "end": 6043.875,
    "text": "I hate those words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6043.995,
    "end": 6047.937,
    "text": "I hate those words as I use, like, the similar, like, referential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6047.977,
    "end": 6050.959,
    "text": "What is the name of, like, the part of speech that it is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6051.119,
    "end": 6054.9,
    "text": "This, that, those, these, you know, those words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6055.601,
    "end": 6058.402,
    "text": "Words that are referential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6058.502,
    "end": 6059.483,
    "text": "It's a pronoun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6059.563,
    "end": 6060.063,
    "text": "It's an article.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6060.103,
    "end": 6060.203,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6061.263,
    "end": 6063.424,
    "text": " It's an article because the pronoun is like he, she, it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6063.544,
    "end": 6064.565,
    "text": "So it's the articles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6064.725,
    "end": 6066.185,
    "text": "So the articles really bother me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6066.566,
    "end": 6075.23,
    "text": "I think that that distinction, the distinction between anatomical and mechanical blankets or the functional psychological blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6075.57,
    "end": 6075.85,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6075.99,
    "end": 6076.691,
    "text": "I'll write it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6076.731,
    "end": 6082.173,
    "text": "I believe it's the distinction between anatomical and mechanical and functional psychological.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6085.055,
    "end": 6085.455,
    "text": "Those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6085.475,
    "end": 6087.276,
    "text": "So it should be a plural article.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6088.676,
    "end": 6089.817,
    "text": "That's what was throwing me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6091.273,
    "end": 6095.256,
    "text": " Yeah, anyway, the nesting of blankets is always something I am down to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6096.016,
    "end": 6098.138,
    "text": "But here, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6099.659,
    "end": 6101.521,
    "text": "Does the distinction need to be drawn?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6101.981,
    "end": 6109.187,
    "text": "If you're talking about nesting of blankets, how can you make distinctions between different types of blankets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6109.407,
    "end": 6109.727,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6110.928,
    "end": 6111.649,
    "text": "Maybe that's just me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6115.212,
    "end": 6116.053,
    "text": "What do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6116.393,
    "end": 6119.896,
    "text": "We explored some aspects of it when...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6122.04,
    "end": 6144.729,
    "text": " you mentioned the multi-scale approach where like we can think of nesting as the the bigger nested system whether it hosts only one active entity within it or multiple laterally interacting entities the bigger nesting so putting a aside for now the bigger nested system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6145.595,
    "end": 6151.24,
    "text": " can be seen of as the niche for the subunit or subunits inside of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6152.061,
    "end": 6173.139,
    "text": "So for sure, this B and C can be connected because the nested system, its niche, its environment, what its actions are going into and what it is getting sense information from is the niche and that is like the larger nested system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6174.451,
    "end": 6191.846,
    "text": " Now, how do nested systems, using that as a shorthand for both B and C, connect to this structural and functional perspective on systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6193.707,
    "end": 6202.615,
    "text": "Are nested systems, when we talk about nested systems, in what ways, give me a yes and, is it a structural nesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6204.059,
    "end": 6225.901,
    "text": " like the word is inside the sentence inside of the paragraph or in what ways is it a functional nesting where the functional nesting of concepts doesn't necessarily have to follow from the nesting of like sentences on the page i think that's a very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6227.935,
    "end": 6229.736,
    "text": " challenging but important question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6229.776,
    "end": 6245.709,
    "text": "And then also when you mentioned like the undergrad example, and we've been talking a lot about test taking right here, it made me think about how in undergrad or potentially even earlier, yes, it was possible to like kind of reverse engineer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6246.109,
    "end": 6254.696,
    "text": "And so like the answer is in the seeds of the question is kind of like a game to play where you're just trying to maximize your score on some test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6255.376,
    "end": 6265.022,
    "text": " But then you get rugged in grad school where it is still true that the question that you're asking to nature to the system contains the seeds of the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6265.062,
    "end": 6273.747,
    "text": "Like you're only going to get the data for your experiment of the kind that you measure on the number that you actually measure it from with the conditions that you set them up to be in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6273.767,
    "end": 6273.827,
    "text": "But.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6276.525,
    "end": 6295.846,
    "text": " if one tries to p hack nature or if one tries to do that sort of undergrad I'm going to maximize I mean these two groups must be different right so I'm going to try to measure them with a thumb on the scale so that they come out to be different that becomes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6297.216,
    "end": 6302.378,
    "text": " tantamount to basically non-rigorous, non-reproducible science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6303.139,
    "end": 6312.443,
    "text": "So it just shows, I think also to Dean's continued themes of like in the lab, in the classroom, and then out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6313.203,
    "end": 6315.785,
    "text": "So the highest test score",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.003,
    "end": 6319.765,
    "text": " is not necessarily the highest performer on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6320.566,
    "end": 6328.973,
    "text": "Out in the wild, that's towards the application side, nor necessarily the best teacher as we've been discussing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6329.634,
    "end": 6345.607,
    "text": "And so it's sort of like, there's like learning and development, and sometimes it feeds back on itself with teaching, and other times it just plunges ahead with application to all these different phenomena of learning, teaching, and applying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6347.466,
    "end": 6351.789,
    "text": " Do those all use the same partitioning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6353.05,
    "end": 6357.133,
    "text": "Are they featuring or highlighting their regime of attention on different parts of the partitioning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6360.776,
    "end": 6365.419,
    "text": "So that's like where I can't ever close my instrumentalist eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6367.001,
    "end": 6374.086,
    "text": "It is in the partition point because the partition is just wherever you put it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6378.021,
    "end": 6381.444,
    "text": " Yes, it's how you see it slash model it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6382.725,
    "end": 6390.331,
    "text": "Unless one specifically wants to make claims about realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6391.592,
    "end": 6392.693,
    "text": "I see what you're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6393.206,
    "end": 6401.509,
    "text": " But even if you want, like when I investigate realist claims, like if I look for a partition, like what partitions me from the rest of the world, it's like my skin, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6401.69,
    "end": 6404.351,
    "text": "So like my skin is the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6404.391,
    "end": 6407.152,
    "text": "It's the Markov blanket that holds me in and the world out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6407.472,
    "end": 6409.893,
    "text": "But like I'm losing pieces of my skin every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6409.933,
    "end": 6410.753,
    "text": "It gets cut open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6410.813,
    "end": 6417.096,
    "text": "And so then am I, is my partition broken or like, you know, am I somehow not the same person?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6417.116,
    "end": 6417.896,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6417.916,
    "end": 6419.257,
    "text": "So for me finding this, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6419.677,
    "end": 6444.778,
    "text": " boundary that's like solid and never changes is not doesn't sit right so that's why like i always have to remind myself it's an instrument so i can never ever lose my instrumentalist perspective and get into full realism when i think about the blanket so um it's it's non-non-separability it's you know this is goes back to the quantum chris fields you know we're non-separable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6446.551,
    "end": 6471.992,
    "text": " on time so i think in uh dot two let's just write a few notes down and then close out so i think in dot two we can look over some formalisms and see how the equations connected we can think about what we discussed about the fastest time scale is perception",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6473.732,
    "end": 6479.814,
    "text": " Action, learning, teaching, applying, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6481.294,
    "end": 6487.496,
    "text": "How do these different modes of engagement with extended active inference systems differ?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6489.476,
    "end": 6490.456,
    "text": "Or what about finding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6491.917,
    "end": 6492.497,
    "text": "Discovering?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6497.395,
    "end": 6503.559,
    "text": " So like when you're not taught, you know, when you don't know the path and you find the stack of rocks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6506.561,
    "end": 6514.245,
    "text": "How do we go from a verb ending in ing to an appropriate or useful active model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6516.607,
    "end": 6521.89,
    "text": "How do we go from negotiating, trusting,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6524.113,
    "end": 6524.874,
    "text": " Discomforting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6525.895,
    "end": 6526.556,
    "text": "Communicating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6527.096,
    "end": 6538.187,
    "text": "Yeah, communicating to the right graphical structure of a generative model that we can use in our standard academic routines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6539.369,
    "end": 6544.594,
    "text": "As patiently reminded, we all are by Carl on those points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6547.177,
    "end": 6547.517,
    "text": "Very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6548.211,
    "end": 6548.451,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6549.432,
    "end": 6549.952,
    "text": "Fun times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6550.013,
    "end": 6552.595,
    "text": "Thanks a lot, Dean, for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6552.615,
    "end": 6554.456,
    "text": "Yeah, Dean, hope you feel better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6555.017,
    "end": 6556.057,
    "text": "Yep, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6556.077,
    "end": 6557.519,
    "text": "And Blue, thanks a ton.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6557.559,
    "end": 6560.001,
    "text": "It was a fun discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6560.041,
    "end": 6562.162,
    "text": "Thanks, everybody who's in the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6562.643,
    "end": 6564.564,
    "text": "Dave and Tucker and Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6564.644,
    "end": 6568.007,
    "text": "And everybody is welcome to join us next week for 41.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6572.246,
    "end": 6575.434,
    "text": " On 13th and in the papers beyond.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6575.815,
    "end": 6576.998,
    "text": "So thank you all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6577.46,
    "end": 6577.861,
    "text": "See you later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6577.881,
    "end": 6578.823,
    "text": "Peace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6579.345,
    "end": 6579.525,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]