[
  {
    "start": 29.79,
    "end": 30.07,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.97,
    "end": 32.131,
    "text": "Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.711,
    "end": 35.732,
    "text": "It's ACT-INF Lab live stream number 41.0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.532,
    "end": 41.833,
    "text": "On April 2nd, 2022, four squared two comma two zero two two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.513,
    "end": 47.555,
    "text": "We're discussing the paper Extended Active Inference Constructing Predictive Cognition Beyond Skulls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.011,
    "end": 51.092,
    "text": " So welcome to the Act-Inf Lab, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.733,
    "end": 57.056,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.456,
    "end": 59.497,
    "text": "You can find us at some of the links here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.338,
    "end": 66.001,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 67.222,
    "end": 72.605,
    "text": "All backgrounds and perspectives are welcome, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.431,
    "end": 81.013,
    "text": " Head over to ActiveInference.org to learn more about what is happening in ACT-INF Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.634,
    "end": 101.019,
    "text": "We're here today in ACT-INF stream number 41.0, where we are learning and discussing the paper Extended Active Inference Constructing Predictive Cognition Beyond Skulls by Axel Constant, Andy Clark, Michael Kirchhoff, and Carl Fristen from December 2020, so long ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.915,
    "end": 116.072,
    "text": " and this video is an introduction for some of the ideas and some of the pieces of the paper it's not a review or a final word and the dot one is just us getting excited and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 117.148,
    "end": 125.652,
    "text": " doing our preparation so that the dot one and the dot two, the participatory group discussions, we can start to unpack them more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 127.233,
    "end": 136.618,
    "text": "We're gonna go over some aims and claims, keywords, the abstract and the roadmap of the paper, address the big question, and then walk through some of the figures and formalisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 137.279,
    "end": 143.682,
    "text": "And the coming weeks we'll have the dot one and the dot two, which of course are open to anyone who wants to join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 145.495,
    "end": 148.818,
    "text": " So we'll just begin by saying hello and any thoughts we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 149.918,
    "end": 151.019,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.46,
    "end": 152.881,
    "text": "I'm a researcher in California.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.561,
    "end": 162.848,
    "text": "And on the topic of distributed or extended cognitive processes, Dean really appreciated co-stigmatically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 163.86,
    "end": 167.143,
    "text": " extended in space and time collaborating with you on the slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 168.204,
    "end": 182.376,
    "text": "I loved your first pass on the slides and it just made me remark on how different it is to be involved in a distributed cognitive process versus the kind that can just play out in the quiet room within the skull.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.637,
    "end": 190.664,
    "text": "And that's like just one example of what this whole paper and extended mind, extended cognitive area is about is actually,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.034,
    "end": 196.397,
    "text": " among other things, respecting those kinds of processes and thinking about how to frame them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.778,
    "end": 200.401,
    "text": "So that is obviously something we'll be talking about a lot more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.381,
    "end": 201.742,
    "text": "Over to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.762,
    "end": 205.024,
    "text": "Hi, my name is Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.204,
    "end": 206.225,
    "text": "I'm up here in Calgary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.605,
    "end": 218.695,
    "text": "And I think what I really liked about this paper is their ability to sort of say, there's some ways that we've been looking at this question of how far does the process go",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.707,
    "end": 245.283,
    "text": " go and then there's this paper which introduces a new way of maybe having a conversation around that they talk about things like uploading entailing some of the more nascent features of offloading and so that to me has the potential of morphing if we because we've done a lot of morphology lately from subject matter expertise to prediction matter expertise if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.73,
    "end": 250.153,
    "text": " Somebody can also hold up an egg and a chicken, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.434,
    "end": 251.755,
    "text": "So I'm kind of excited about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.857,
    "end": 254.898,
    "text": "Okay, excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.358,
    "end": 256.899,
    "text": "Into the paper we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.74,
    "end": 260.263,
    "text": "So the paper link is provided here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.763,
    "end": 261.964,
    "text": "And as stated, it's from 2020.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.006,
    "end": 271.413,
    "text": "I'll just, why don't you summarize what you felt some of the key aims and claims were?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.333,
    "end": 295.813,
    "text": " uh well i'll summarize the aims you you can summarize the claims for me the aim was to be able to optimize organize organisms generative models which a cognitive niche construction implies but these authors essentially sort of put that out there in a in a they articulate that uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.32,
    "end": 300.805,
    "text": " It reviews generic predictive approaches to niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.526,
    "end": 311.779,
    "text": "It takes and looks at both the functional and the psychological components of what that active generation of a cognitive niche might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.379,
    "end": 315.062,
    "text": "And then they argue for, and I think this is the critical bullet,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.717,
    "end": 322.186,
    "text": " an extended active inference, henceforth EAI, based on our model of cognitive niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.226,
    "end": 325.35,
    "text": "So there's a model within the modeling universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.931,
    "end": 326.592,
    "text": "This is theirs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.519,
    "end": 328.859,
    "text": " Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.119,
    "end": 329.36,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.02,
    "end": 345.81,
    "text": "As we'll explore, they aim towards reconciling some of the functional and grounded and embodied aspects of what is known as the cognitive niche with some of the essentially metaphysical in the sense that they're not as embodied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.83,
    "end": 351.493,
    "text": "They're like purely cognitive features of or psychological features of the cognitive niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 351.853,
    "end": 352.854,
    "text": "So that's kind of where they aim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.374,
    "end": 357.497,
    "text": "And yes, they aim for a synthesis reflected in the EAI idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.337,
    "end": 361.7,
    "text": " So some of the claims in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 361.88,
    "end": 366.925,
    "text": "So these are things where it's like you could ask whether these are valid assertions or assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.006,
    "end": 381.679,
    "text": "Cognitive niche construction, which again, they're thinking of in a functional and psychological sense, is the process whereby organisms create and maintain cause effect models of their niche as guides for fitness influencing behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.239,
    "end": 389.786,
    "text": " So it's kind of like extended autopoiesis, self-maintenance, but not just at the level of the epithelial, like a cognitive boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.767,
    "end": 396.832,
    "text": "Extended mind theory claims that cognitive processes extend beyond the brain to include predictable states of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.993,
    "end": 403.338,
    "text": "Statistical regularities in the generative process and how to leverage those processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.338,
    "end": 407.701,
    "text": "Active inference and predictive processing in cognitive science assume...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.917,
    "end": 435.101,
    "text": " organisms embody predictive which is generative models of the world optimized by standard cognitive functions like perception action learning so putting different cognitive features on common grounding those are some of the aims and claims of the paper let's see how they get there here's a few of the keywords that were in the paper active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.56,
    "end": 450.978,
    "text": " affordances, capacities for action, availabilities for action, cognitive niche construction, which we'll go into a lot more, ecological psychology, which is something that's been around for decades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.118,
    "end": 454.242,
    "text": "It's about breaking the psyche out of the skull.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 455.163,
    "end": 484.393,
    "text": " and that's very related to extended mind and then predictive processing and this sort of anticipatory perspective and the real-time signal processing action loop all these things that are like active by another word or kind of like the latent proto-active threads that um are brought together here anything to add on keywords no no okay i'll read the abstract then you can feel free to give a thought",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.032,
    "end": 494.054,
    "text": " Cognitive niche construction is the process whereby organisms create and maintain cause-effect models of their niche as guides for fitness-influencing behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.015,
    "end": 500.636,
    "text": "Extended mind theory claims that cognitive processes extend beyond the brain to include predictable states of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.457,
    "end": 510.459,
    "text": "Active inference and predictive processing in cognitive science assume that organisms embody predictive models of the world optimized by standard cognitive functions .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.18,
    "end": 521.924,
    "text": " This paper presents an active inference formulation that views cognitive niche construction as a cognitive function aimed at optimizing organisms' generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.744,
    "end": 526.186,
    "text": "We call that process of optimization extended active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.027,
    "end": 531.668,
    "text": "What do I think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.988,
    "end": 538.851,
    "text": "I think of it from the view of a professional setting as an example of an environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.933,
    "end": 553.797,
    "text": " and how that professional setting traditionally is not necessarily seen the agents within it like we sometimes consider the internalities within the epithelial limits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.078,
    "end": 559.659,
    "text": "But we very much depend on those things functioning correctly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.819,
    "end": 564.741,
    "text": "So this kind of opens up a little tiny portal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.256,
    "end": 571.321,
    "text": " into how our imaginations might be able to sort of access that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.654,
    "end": 579.399,
    "text": " makes me think about the professional setting, the professional niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.28,
    "end": 586.446,
    "text": "Is that something that's just reflected in the skull of the expert or the professional as a person?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 587.307,
    "end": 596.156,
    "text": "Or is the setting something that's distributed where it wouldn't be possible to locate or focalize it within the skull of any individual",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.577,
    "end": 604.844,
    "text": " while also recognizing, for example, that a lesion inside of the skull of a person in a professional setting would change it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 605.365,
    "end": 613.272,
    "text": "So we don't need to like deny brain functionalism to have an extended yes and approach to cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 613.332,
    "end": 616.495,
    "text": "So what are we going to find out when we go down that way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.476,
    "end": 621.517,
    "text": " Well, here's some of the signposts along that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.537,
    "end": 634.201,
    "text": "This is their roadmap, how they get from discussing previous work in the extended mind and cognitive niche area towards their concept of extended active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.181,
    "end": 642.644,
    "text": "The introduction covers some of the core background concepts like cognitive niche, active inference, and the extended mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.561,
    "end": 645.222,
    "text": " They then kind of lay out where they're gonna go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.282,
    "end": 659.688,
    "text": "In section two, the functional and psychological niches under active inference, they partition or delineate different ways of thinking about the cognitive niche into a psychological and a functional component, and then present a case study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.008,
    "end": 689.342,
    "text": " um there's also figures that we'll walk through and through the presentation of this disambiguation of cognitive niche and case study in connection to the active inference models they present extended active inference eai and then discuss several features or aspects of eai like the parity principle which we'll come back to of course functional isomorphisms epistemic actions and diachronic cognition under eai",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 691.058,
    "end": 692.138,
    "text": " Anything to add on the roadmap?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.519,
    "end": 695.679,
    "text": "No, let's get the big question here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.119,
    "end": 697.98,
    "text": "Go for the big question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.88,
    "end": 701.2,
    "text": "Okay, I'll just read it off the slide here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.22,
    "end": 716.184,
    "text": "The set of questions that fall within our scope relates to the computational function of cognitive extensions and the developmental and intergenerational, so we're going to talk about a little bit of a temporal thing here, process whereby this computational function emerges, given...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.047,
    "end": 727.435,
    "text": " The cognitive niche is sometimes studied as a psychological habitat, refers to the set of organisms' niche relations that offer organisms relevant affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.116,
    "end": 736.563,
    "text": "And two, the cognitive niche is sometimes studied as a functional habitat, refers to the set of resources that support species-specific tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.744,
    "end": 738.725,
    "text": "That's the behavior angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.272,
    "end": 745.755,
    "text": " Then, this means that one must define the functional habitat on the background of the organism's phenotypic dispositions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.775,
    "end": 748.236,
    "text": "This is where Daniel's expertise can step in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.637,
    "end": 763.364,
    "text": "For example, books are part of the functional habitats of humans because of humans' ability to read, but they're not part of the beaver's functional habitat unless, of course, the beaver wants to include it as part of their environmental structure, which if they're an imaginal beaver, maybe they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.104,
    "end": 767.846,
    "text": "The psychological and functional habitats can be part of the same overall physical habitat,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.735,
    "end": 772.418,
    "text": " My question then was, how then do cognitive extensions exist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.558,
    "end": 776.621,
    "text": "We're not answering that today, but we're parking that for future conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.176,
    "end": 789.397,
    "text": " There's a famous quote in biology, nothing makes sense except in the light of evolution and a million other mutations on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.097,
    "end": 805.3,
    "text": "And we've talked about eco evo devo in biology, like the importance of thinking holistically about ecology and evolution and development processes that entail different mechanisms and play out over different scales to influence phenotype as studied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.46,
    "end": 811.381,
    "text": "And what I see here is ecology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.418,
    "end": 814.479,
    "text": " which has been dancing with cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.819,
    "end": 818.62,
    "text": "That's the ecological cognitive area, ecological psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.54,
    "end": 823.761,
    "text": "Then there's developmental psychology, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.781,
    "end": 824.861,
    "text": "So how does learning happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 824.941,
    "end": 835.344,
    "text": "And then there's evolutionary psychology and any of those fields people can take or leave, but it's almost like we're going to dissolve those couplets",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.457,
    "end": 847.544,
    "text": " into just eco, evo, and devo, pull them away from the cognition, from developmental, ecological, and evolutionary cognition, and then like bring it all back together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.664,
    "end": 853.008,
    "text": "So no one's denying that humans don't read books or that beavers don't make a dam or anything like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.088,
    "end": 855.55,
    "text": "So what are we really getting at here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.99,
    "end": 863.375,
    "text": "It's a different way to recombine and reframe how we think about cognition and ecology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.582,
    "end": 865.623,
    "text": " Can I just add one thing to that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.643,
    "end": 867.284,
    "text": "Because that's, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.304,
    "end": 878.432,
    "text": "A decade and even two decades ago, there was a real push of real philosophical density forming around the idea of hands-on science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.133,
    "end": 882.255,
    "text": "But this questions, what can we get our hands on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.955,
    "end": 887.279,
    "text": "Because if, again, if you want to simplify it and just say, oh, if we give everybody a chance to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.632,
    "end": 913.597,
    "text": " touch the beaver kit that will somehow change their understanding of beaver behavior um what you just described says no what that will give us is an understanding of the the direction that their fur um all seems to set up as right so again we have to be careful that we don't come up with these oh here's here's the way to solve all of these really complex issues",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.999,
    "end": 940.078,
    "text": " hands-on example also um it made me think about how you could still have a very brain-based approach to thinking about hands-on cognition someone could say it's been shown that when there's multi-sensory engagement that the learner updates their cognitive model more rapidly so multi-sensory learning or experience-driven learning is more engaging for science it keeps people in the game longer they learn the concepts better",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.039,
    "end": 950.904,
    "text": " That is still within the individual intraschool paradigm, but it starts moving into the periphery and the peripersonal space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.564,
    "end": 956.106,
    "text": "And it's like, where is this extended cognitive process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.987,
    "end": 959.968,
    "text": "Aren't the hands always on something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.228,
    "end": 961.849,
    "text": "Or I'm sure there's a lot of other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.029,
    "end": 963.33,
    "text": "Are they literally on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.69,
    "end": 964.21,
    "text": "Are they on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.43,
    "end": 965.651,
    "text": "Are they on an abstraction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.294,
    "end": 967.734,
    "text": " That's the big question, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.874,
    "end": 969.895,
    "text": "So, yeah, it gets really interesting in a hurry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.755,
    "end": 978.977,
    "text": "If you want to take a quantum bike ride with Chris Fields, you got to be able to explain how that works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.718,
    "end": 985.699,
    "text": "Another piece I just can't help, but it's from the Active Inference textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.939,
    "end": 988.02,
    "text": "I can't help myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.14,
    "end": 989.9,
    "text": "I have a new car.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.98,
    "end": 990.64,
    "text": "I have to drive it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.246,
    "end": 995.008,
    "text": " This is on the first page of the preface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.149,
    "end": 1001.714,
    "text": "To illustrate the simplicity of active inference and what we are trying to explain, place your fingertips gently on your leg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.155,
    "end": 1004.137,
    "text": "Keep them there motionless for a second or two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.817,
    "end": 1006.399,
    "text": "Now does your leg feel rough or smooth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.12,
    "end": 1012.505,
    "text": "If you had to move your fingers to evince a feeling of roughness or smoothness, you have discovered a fundament of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.905,
    "end": 1016.168,
    "text": "To feel is to palpate, to see is to look, to hear is to listen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.829,
    "end": 1035.553,
    "text": " So if you can't, with your hands on, with a finger on, if the pants don't have a feeling of smoothness or roughness, except for as a function of action, what are we handling, grasping, comprehending with cognitive things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.353,
    "end": 1036.573,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.313,
    "end": 1040.134,
    "text": "That whole niche development thing, which we're going to get into today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.054,
    "end": 1041.294,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.394,
    "end": 1041.654,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.894,
    "end": 1044.015,
    "text": "So cognitive niche, section 111.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.605,
    "end": 1050.627,
    "text": " Do you want to give a first summary on any parts you think are important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.167,
    "end": 1054.549,
    "text": "Well, I'm going to just read some of the stuff from the paper itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.649,
    "end": 1056.891,
    "text": "I threw a few references in here as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.931,
    "end": 1074.142,
    "text": "But in cognitive science, a form of instrumental intelligence, to be in Devorah, if I hope I'm pronouncing that correctly, create and maintain cause-effect models of the world as guides for prejudging which courses of action will lead to which results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.878,
    "end": 1077.921,
    "text": " We've had a few conversations about guides in the new year, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.001,
    "end": 1080.483,
    "text": "So I thought that was interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.504,
    "end": 1083.926,
    "text": "Residues in the environment act as cues and prompts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.187,
    "end": 1096.536,
    "text": "Concept development niche as where and when your genes act given the epigenetic envelope over selective niche as genetic information inherited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.577,
    "end": 1102.021,
    "text": "I thought that made a clear differentiation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.061,
    "end": 1103.322,
    "text": "The concept of cognitive...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.666,
    "end": 1114.19,
    "text": " cognitive niche that we're referring to here is a sort of hybrid, again, I love this, between the concepts of the selective developmental and cognitive niches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.01,
    "end": 1125.514,
    "text": "This paper's questions fall under that which conceptual function emerges, sorry, computational function emerges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.75,
    "end": 1139.736,
    "text": " So bottom line is they say that there are things in the timeline of the environment which are passed along.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.756,
    "end": 1143.858,
    "text": "So how do we explain that through",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.732,
    "end": 1171.385,
    "text": " lot of different ways but active inference in particular and so that's what this is about and so again i threw a couple of different ways in terms of explaining the cognitive load aspect of that like why would we download or offload or upload into the environment and why would the next generation necessarily be able to pick up on that through some sort of pointing or signal signaling effort",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.778,
    "end": 1188.046,
    "text": " What were you getting at with the cognitive niche for enabling somebody to learn and apply active inference and about how that relates to professional or other settings inside and outside of academia?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.126,
    "end": 1192.468,
    "text": "Well, the enabling part is what I was really wondering about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.549,
    "end": 1194.79,
    "text": "So how is that set up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.45,
    "end": 1203.535,
    "text": "Is there a set the condition for that or are what they're describing here as is something variant retained?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.266,
    "end": 1207.007,
    "text": " meaning conditions set, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.047,
    "end": 1211.489,
    "text": "Because there's always a tendency to want to say, okay, well, things are too complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.089,
    "end": 1213.83,
    "text": "So let's focus on X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.738,
    "end": 1216.978,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.718,
    "end": 1226.882,
    "text": "And that was my essentially what my question was here is, is the interdisciplinary question satisfied by organizing along chapters and subject areas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.922,
    "end": 1228.603,
    "text": "Because we just don't want to overload people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.883,
    "end": 1229.083,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.183,
    "end": 1231.064,
    "text": "I mean, we get why we do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.404,
    "end": 1232.564,
    "text": "There's a reason for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.964,
    "end": 1234.125,
    "text": "And that's what they're talking about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.145,
    "end": 1239.647,
    "text": "There's a reason why there are tracks laid down in the environment that can help guide the next generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.592,
    "end": 1242.093,
    "text": " pass her through, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.613,
    "end": 1253.536,
    "text": "But the bottom line is, is the constructionism aspect of this, the mechanics part of it, the default or functional enhancement outside of the academic niche?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.796,
    "end": 1256.857,
    "text": "Like when you get out of school, what do you do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.418,
    "end": 1262.539,
    "text": "Do you necessarily follow the same patterns that you do in school?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.06,
    "end": 1267.761,
    "text": "How does a bridge to uncertainty, as a metaphor, change the nature from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.228,
    "end": 1270.71,
    "text": " explanatory to explorational and back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.351,
    "end": 1288.147,
    "text": "So when we go out into the world and then come back into academia, how does that change our perception of the structures that academia places down to make sure that we get to certain outcomes relative to the variants that still exist out there in the greater space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.235,
    "end": 1293.757,
    "text": " makes me think of paths in a forest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1294.778,
    "end": 1303.985,
    "text": "And it's like, is within a generation or between generations, are we trying to pass down the path?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.825,
    "end": 1309.289,
    "text": "Or are we passing down a healthy forest where wayfinding can happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.969,
    "end": 1314.353,
    "text": "And it's like, well, I paved the path and I removed all the brambles from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.434,
    "end": 1316.755,
    "text": "Where's the forest now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.355,
    "end": 1319.757,
    "text": "Because in order to make that path stabilized...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.421,
    "end": 1325.103,
    "text": " the functional niche had to actually change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.663,
    "end": 1333.248,
    "text": "And so that shows how like the cognitive and the functional needs start to have interplay over these multiple timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.209,
    "end": 1334.389,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.19,
    "end": 1335.49,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.77,
    "end": 1339.052,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.072,
    "end": 1339.052,
    "text": "1.1.2."
  },
  {
    "start": 1339.533,
    "end": 1343.555,
    "text": "Here's where they introduce the concept of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.537,
    "end": 1348.078,
    "text": "What parts did you pull out on the left side?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.098,
    "end": 1350.38,
    "text": "Like what text pieces did you find important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.716,
    "end": 1355.516,
    "text": " Before we talk about starting and progging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.617,
    "end": 1363.5,
    "text": "Yeah, no, I just highlight where I thought it was kind of interesting is if you just read the stuff that's fonted in red, you have to entertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.001,
    "end": 1365.781,
    "text": "There's a probabilistic relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.282,
    "end": 1376.887,
    "text": "We have to think of this not just over a single time frame, but as you said, over possible inference, probability, and modeling time frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.967,
    "end": 1378.988,
    "text": "What's entailing what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.841,
    "end": 1382.122,
    "text": " when we're talking through the active inference lens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.742,
    "end": 1384.523,
    "text": "Transitions amongst causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.584,
    "end": 1386.404,
    "text": "Hmm, interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.444,
    "end": 1391.967,
    "text": "So processes of processes, the updating piece, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.047,
    "end": 1409.215,
    "text": "And so again, the sodding and the pronking thing, all I wanted to do is in that section of the paper say, here's an example in the wild where we could identify each one of the aspects that they were talking about in this section of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.874,
    "end": 1418.195,
    "text": " And you had listed a few functions or a few as here, and then I added a few more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1418.935,
    "end": 1425.577,
    "text": "And I think it just reflected how there's always a plurality of answers to the why question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.437,
    "end": 1436.078,
    "text": "In biology, we have 10 Bergen's four whys, and we have different time scales and whether the approximate or the ultimate cost, all this stuff that we've talked about other times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.698,
    "end": 1438.879,
    "text": "And then just even within the active perspective,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1439.759,
    "end": 1443.962,
    "text": " Why do these animals do this jumping behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.903,
    "end": 1449.287,
    "text": "And how does active inference help us think about that kind of behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.687,
    "end": 1455.331,
    "text": "Like, it's a signal to itself about its bodily integrity and its coherence and its capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.252,
    "end": 1461.656,
    "text": "It's a signal to other entities like itself, like other conspecifics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.297,
    "end": 1465.439,
    "text": "For example, an early warning system for a predator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.3,
    "end": 1466.7,
    "text": "It also...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.785,
    "end": 1473.73,
    "text": " has been brought up in the literature that this is actually a honest and costly signal to the predator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.31,
    "end": 1476.572,
    "text": "Like, look at me jump and play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.972,
    "end": 1477.773,
    "text": "You think you're going to get me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.793,
    "end": 1478.373,
    "text": "That's absurd.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.513,
    "end": 1480.935,
    "text": "Go after somebody who's not jumping and playing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.396,
    "end": 1485.519,
    "text": "And then there's so many other ways like to think about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.759,
    "end": 1488.601,
    "text": "And those are things that you could disambiguate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1488.621,
    "end": 1497.007,
    "text": "You might be able to design an experiment or a professional setting to reduce your uncertainty or to engineer and scaffold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.848,
    "end": 1525.841,
    "text": " something but once you get this deer in the lab on the trampoline in the vr headset with the predators approaching from both sides when that doesn't happen in the wild what are you actually studying right i like the last bullet too because it could be pronounced as way updating or way up dating so i mean anytime we and i i i i",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.471,
    "end": 1532.555,
    "text": " I hope people appreciate that it could literally, literally be interpreted both ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.615,
    "end": 1546.183,
    "text": "And that's what I think is kind of fascinating about this paper is that inversion in our minds of what, so what does that just put a place in the emphasis reinforces two very different concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.024,
    "end": 1548.224,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.494,
    "end": 1560.643,
    "text": " And to close this set of introductory concepts, the cognitive niche, active inference, and we get to the extended mind concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.964,
    "end": 1568.071,
    "text": "So what pieces did you find relevant here and what did you pull out of the text itself and associated citations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.505,
    "end": 1586.717,
    "text": " Well, just for me, it was an affirmation of what I've been thinking about for a long time, that the idea of saying something is contained in your skull and shall no further pass doesn't get answered just because we can communicate back and forth to one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.757,
    "end": 1592.041,
    "text": "There's probably a lot more evidence in the larger environment if you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.898,
    "end": 1594.139,
    "text": " take the time to look for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.739,
    "end": 1604.182,
    "text": "And it doesn't always necessarily cause issues in terms of what you can or can't imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.223,
    "end": 1609.485,
    "text": "So those images out there are collective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.805,
    "end": 1613.066,
    "text": "And so do we always come at it from the perspective of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.84,
    "end": 1617.161,
    "text": " we're making connections because there are associations and we get that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.641,
    "end": 1625.824,
    "text": "But is there an uploading aspect of this that quite literally in the community can look like a museum, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.345,
    "end": 1641.41,
    "text": "So these ways of being able to understand what's happening have other ways than what has traditionally been thought of as here's where something ends and something else begins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.272,
    "end": 1650.157,
    "text": " One piece I thought was interesting, this is kind of a classic modern example of extended mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.958,
    "end": 1656.523,
    "text": "So they discuss reliable access to external states of the niche, e.g.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.583,
    "end": 1661.688,
    "text": "the cell phone that functions as an extended memory for recalling phone numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.655,
    "end": 1671.08,
    "text": " Okay, how about when those are your cloud contacts and now that phone is pinging a global communications network?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.741,
    "end": 1684.97,
    "text": "So again, no one is denying that an entity can take an action that triggers computational events and cognitive events to occur around the world and beyond sending those signals off into wherever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.511,
    "end": 1688.193,
    "text": "So what are we actually doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1689.383,
    "end": 1716.96,
    "text": " discussing what is extended relative to what again reifying the epithelial boundary and saying well it's extended relative to the epithelial boundary but isn't this about updating our priors to think about cognition in a more extended way so then why do the sort of straw person version of epithelial individualist brain-centered cognition and then posit extended cognition as a contrast from that like what is the real positivist",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1718.543,
    "end": 1722.666,
    "text": " or positive claim in extended cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1724.448,
    "end": 1731.613,
    "text": "And there's a lot of interesting citations here back through the decades, and people have been talking about this stuff for a very long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1731.653,
    "end": 1734.154,
    "text": "So that'll be a cool thread to draw on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.395,
    "end": 1735.255,
    "text": "Yeah?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.295,
    "end": 1738.718,
    "text": "Yeah, what's interesting is I've had conversations with Sweller and Ginn's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.639,
    "end": 1744.822,
    "text": " back, you know, like 15 years ago, about this whole question of what is cognitive overload.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.862,
    "end": 1757.951,
    "text": "And one of my favorite references is Lucy Sukman's The Human-Machine Interface, where her book is essentially set up as a case study around people encountering the photocopy machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.897,
    "end": 1764.244,
    "text": " And what exactly transpires there as an extended mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.684,
    "end": 1771.593,
    "text": "Because there are people that have sort of built the photocopy machine in the hopes that it becomes intuitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.654,
    "end": 1774.336,
    "text": "But as she points out in her reference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.259,
    "end": 1778.422,
    "text": " Well, that's in the eye of the beholder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.682,
    "end": 1792.733,
    "text": "That's in the person who has to key in their passcode and then try to determine, of course, the person who's actually built the photocopy machine, try to determine how each one of those individuals with each separate passcode",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.211,
    "end": 1804.42,
    "text": " necessarily believes that their mind is being extended so that they don't have to, you know, as Stephen used to do, make another copy and make another copy and make another copy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.82,
    "end": 1822.415,
    "text": "So there's a lot in this and it can't always be reduced down to an assumption around a particular order of steps that will just naturally seem present to the person who now has their hand available",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.391,
    "end": 1833.456,
    "text": " and a screen from which they can select a number of options, but still can't get what inside of their head they want in terms of that version or that format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.996,
    "end": 1845.321,
    "text": "So anyway, I love the extended mind concept, but now how do we employ it in such a way that it actually is something available as opposed to just theoretical?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.826,
    "end": 1849.288,
    "text": " It makes me think of playing pool or billiards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.948,
    "end": 1857.353,
    "text": "So in the extended desire to move the ball from one area to another, like you use a cue and it's like transducing mechanical force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.373,
    "end": 1860.435,
    "text": "And then that force is transmitted to the ball that you strike.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.476,
    "end": 1862.197,
    "text": "And that has all these outcomes in the board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1863.789,
    "end": 1868.17,
    "text": " what is the pool cue for these increasingly abstract processes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1868.551,
    "end": 1874.973,
    "text": "We talk about the grip and the embodied performance, the skilled performance of playing pool and all of those aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.573,
    "end": 1890.518,
    "text": "And again, how do we talk about epistemic grip and we're extending not just into the functional niche, so like the real phenotypic substrates, but when we start thinking about, as the authors reminded us of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.872,
    "end": 1919.624,
    "text": " selective developmental and cognitive niches this is like apples and oranges and kale chips over different time scales it's not just counting how many pieces of fruit are on the table these are different nested interacting and even types of things so how do we keep all of that on the menu and still do yeah and you introduced with the pool cue a field thing which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1920.803,
    "end": 1923.807,
    "text": " In Sukhman's reference, she talks about field thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.847,
    "end": 1925.89,
    "text": "It's not just the touching of a screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.411,
    "end": 1932.88,
    "text": "There's a huge field component to this that's often left out, but can't be if we're talking about extending our minds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.778,
    "end": 1941.985,
    "text": " It makes me think about putting the chalk on the tip of the cue, and that helps the pool tip make grip with the ball better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.666,
    "end": 1948.591,
    "text": "But you wouldn't put the blue chalk on your feet on the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.631,
    "end": 1951.754,
    "text": "The way that they grip the ground is different than how the extended...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.575,
    "end": 1954.056,
    "text": " cognitive apparatus gets a grip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1954.496,
    "end": 1956.598,
    "text": "And that's like where we see a lot of challenges in programming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.098,
    "end": 1965.983,
    "text": "Somebody with skill in programming goes, well, of course that's not going to work because like to get a grip on this process, this program needs the API call to look like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.363,
    "end": 1967.304,
    "text": "And then it can get a handle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.384,
    "end": 1968.465,
    "text": "It can get a web hook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.965,
    "end": 1974.028,
    "text": "It can make this call so that on the other side of the phone, the right other program calls back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.548,
    "end": 1981.693,
    "text": "But here's the other person still, you know, shining their shoe with a blue chalk and wondering why the billiards not going the right direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.773,
    "end": 1982.153,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.354,
    "end": 1985.594,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.714,
    "end": 1989.895,
    "text": "Here we get to their outline and argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.395,
    "end": 2000.978,
    "text": "So, what would you say is important about what they wrote here with all of these different cues that we have annotated and added into the text?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.718,
    "end": 2009.801,
    "text": "Well, what I appreciate is that in order to be able to introduce the concept of uploading, which we'll get to here, they're basically saying, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.786,
    "end": 2018.489,
    "text": " And I don't want to put words in the author's mouths, but my interpretation of what I read was, this is why it's taking so long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.51,
    "end": 2023.652,
    "text": "Because they're going to cut into a time, a temporal piece to this eventually anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.072,
    "end": 2033.237,
    "text": "And rather than read all of the highlighted parts that I dragged out, maybe you want to talk about the things...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.971,
    "end": 2040.326,
    "text": " that you think for the point one and point two, we might want to spend a little bit more time on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.727,
    "end": 2043.975,
    "text": "When you're done, I'd like to talk about the stuff on the right-hand side of the page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.689,
    "end": 2046.069,
    "text": " Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.169,
    "end": 2063.399,
    "text": "Just a few pieces that would be cool to unpack would be salience and attention and ostentative cues in communication and how sometimes cues can be transient, like what I'm about to say next is really important, but then other times cues can be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2064.787,
    "end": 2066.508,
    "text": " acting through time, like stigmergy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.068,
    "end": 2073.552,
    "text": "So epistemic cues as ecological legacies is really powerful, guiding epistemic foraging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.813,
    "end": 2078.775,
    "text": "The notion of a shared cognitive model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.653,
    "end": 2083.756,
    "text": " But once it becomes one shared cognitive model, is it extended anymore?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.537,
    "end": 2089.921,
    "text": "Or by drawing the boundaries around that shared model, is it saying, well, it's not extended within.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2089.941,
    "end": 2096.726,
    "text": "So I think optimization, leveraging of shared generative models through action and perception",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.992,
    "end": 2117.806,
    "text": " excellent place to pick up as we think about our intra active lab and other contexts share generative models um cognitive uploading one place to start there would be like what is being appealed to or invoked with this upload download metaphor how many",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.587,
    "end": 2120.73,
    "text": " KB per second are we talking about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.15,
    "end": 2132.365,
    "text": "What are we getting at or potentially seeing only one facet of when we use this computationalist notion of up and download, which they do unpack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.148,
    "end": 2141.55,
    "text": " and also the idea of cognitive extensions that gain independence from the specific individuals having produced them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.33,
    "end": 2162.056,
    "text": "So it's kind of like if the pool cue doesn't do a different type of thing, but then as people might be interested in more and more autonomous pool cues, allowing them to be further and further from more and more complex pool tables until they're not even looking at the pool table,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.055,
    "end": 2169.992,
    "text": " They're just sending a sequence of messages to something that is outside of the person who designed it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.373,
    "end": 2171.716,
    "text": "It wouldn't even be called a pool queue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2172.574,
    "end": 2183.898,
    "text": " but all of a sudden it's so extended, it's involving all this cyber-physical apparatus that it does have this degree of autonomy or independence from the individuals who created them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.278,
    "end": 2192.541,
    "text": "So then where do we put these complex cyber-physical systems where it's like, it's not Dr. Frankenstein, nor is it Dr. Frankenstein's monster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.902,
    "end": 2197.423,
    "text": "What is really the cognitive apparatus in those situations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.883,
    "end": 2199.424,
    "text": "What about what you see on the right side?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.513,
    "end": 2218.368,
    "text": " Well, I want to just, before I go to that, I want to just say, because I put it on that thing there, professional initiatives programming, and I'm not horn-tuning here, but basically that was the name of the company that I started up and ran for a decade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.408,
    "end": 2229.237,
    "text": "And essentially, the reason why I put it in there is because, to the point, the optimization and leveraging of the shared generative model, sharing through action and perception of what we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.066,
    "end": 2231.97,
    "text": " call extended active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.012,
    "end": 2238.483,
    "text": "When that's actually applied and you actually see people doing something with that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.347,
    "end": 2245.788,
    "text": " it's actually quite fascinating because it's actually very distributed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.188,
    "end": 2254.11,
    "text": "You don't have a job wall and then people decide whether or not the things that are on offer are things that they want to partake in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.17,
    "end": 2255.97,
    "text": "What it does is it's an inversion of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.551,
    "end": 2260.892,
    "text": "It's essentially saying, are you an explorer by nature?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.912,
    "end": 2270.594,
    "text": "And if you are, are there other explorers out there in the larger community who that relational frame is something that you could share?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.9,
    "end": 2277.201,
    "text": " So again, these are interesting things that this paper now surfaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.301,
    "end": 2280.422,
    "text": "So I just want to talk about that for a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.522,
    "end": 2286.044,
    "text": "So my questions were, should we assume that the exploration done in literature is a proxy for functioning in the wild?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.384,
    "end": 2290.985,
    "text": "We take maps with us, but do we continue to stare at the maps while we're in the wild?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.665,
    "end": 2299.527,
    "text": "How much focus on the epistemic resolves what, when, which questions to predict when the bird strike happens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.623,
    "end": 2311.35,
    "text": " These random things are how do we respond to randomness and then how does the Hudson River take care of cognitive extension gain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.15,
    "end": 2319.655,
    "text": "Because that seems like a weird question to ask, but in the context of this paper, that's the question that's being asked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.795,
    "end": 2321.716,
    "text": "So don't be afraid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.497,
    "end": 2322.837,
    "text": "Ask it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.399,
    "end": 2330.082,
    "text": "Don't be scared because the alternative is a lot worse, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.311,
    "end": 2337.554,
    "text": " That's what's fascinating about the sort of creative part of this that active inference, I think, enables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.234,
    "end": 2341.256,
    "text": "But it's not constructivist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.596,
    "end": 2343.257,
    "text": "It's creativist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.657,
    "end": 2354.442,
    "text": "And I'm not saying that there isn't a huge constructivist piece here, but you're leaving off another magnificent part of it if you only focus on the computational and the constructivist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.057,
    "end": 2357.417,
    "text": " Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.517,
    "end": 2361.36,
    "text": "A lot more to say on that, but let's move forward to section two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.641,
    "end": 2367.725,
    "text": "We're going to now talk about active inference entailing functional and psychological niches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.505,
    "end": 2370.567,
    "text": "Okay, so here's where we get to equation one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.946,
    "end": 2382.432,
    "text": " And they write, a generative model, which is this left term here with a purple line, is a probabilistic statement about a set of unobserved hidden variables, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.732,
    "end": 2395.92,
    "text": "hypothesized causes, like you didn't actually see the lightning strike, but there's going to be some unobserved cause, which is like the actual event of the lightning initiation, and observed sensations, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.96,
    "end": 2396.56,
    "text": "consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.64,
    "end": 2400.563,
    "text": "So that could be like the volume and the visual input of thunder and lightning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.823,
    "end": 2405.387,
    "text": " which represents an organism's predictive or causal model of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.548,
    "end": 2407.049,
    "text": "That's that joint generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.87,
    "end": 2412.135,
    "text": "A generative model is usually expressed in terms of a likelihood and a prior term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.676,
    "end": 2415.76,
    "text": "And this is sort of like a fundamental statistical...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2417.702,
    "end": 2445.501,
    "text": " tool slash trick slash tip that you can take a joint distribution and then kind of pull out and condition upon one of the variables in that joint distribution so it's like probability of flipping a coin rolling a die it's like flipping a coin conditioned on rolling a die multiplied by rolling the die but not exactly in this likelihood prior case but it's very much similar so quick question for you can you can you tell me when you say trick",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.281,
    "end": 2448.323,
    "text": " Is it as simple as a flip?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.864,
    "end": 2452.567,
    "text": "Like effect, cause, cause, effect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.648,
    "end": 2454.049,
    "text": "Is that what you mean by trick?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.292,
    "end": 2459.815,
    "text": "Like a hot trick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.855,
    "end": 2467.322,
    "text": "Like a pattern of performance that enables you to win statistical games.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.123,
    "end": 2469.164,
    "text": "Okay, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2470.459,
    "end": 2486.316,
    "text": " of course anyone can describe it however else they want so here they're saying the likelihood corresponds to the probability of sensations given the priors and then the prior corresponds to the probability of the conditions or causes that generate the sensations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.099,
    "end": 2490.94,
    "text": " So this is like beliefs about how the world is in the prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.96,
    "end": 2498.043,
    "text": "And then this is the likelihood of sensations, which is here, S, conditioned upon those beliefs of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.983,
    "end": 2502.745,
    "text": "And two other places to learn a little bit more would be,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2505.228,
    "end": 2511.05,
    "text": " ACT-INF stream number 34, where we were discussing Axel's paper, Free Energy Principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2511.17,
    "end": 2513.631,
    "text": "It's not about what it takes, it's about what took you there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.951,
    "end": 2520.773,
    "text": "We talked a lot about bays, exact bays, variational bays, and about free energy minimization, and when do priors go right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.833,
    "end": 2521.833,
    "text": "When do they go wrong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.394,
    "end": 2527.995,
    "text": "And then here is an example from the ACT-INF textbook from 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.035,
    "end": 2528.315,
    "text": "And on page 18,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.119,
    "end": 2534.781,
    "text": " They show an example with frog and apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.161,
    "end": 2536.462,
    "text": "That's the hidden state of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.522,
    "end": 2538.083,
    "text": "What is actually in your hand?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.243,
    "end": 2539.604,
    "text": "Is it a frog or an apple?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.284,
    "end": 2545.048,
    "text": "And so initially there's a prior belief, like 90% that it's an apple and 10% that it's a frog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.668,
    "end": 2552.873,
    "text": "And then there's this observation of jumping, which could be like visual, it could be tactile, proprioceptive, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2553.413,
    "end": 2561.058,
    "text": "And then that has an associated likelihood model of apples jump 1% of the time, frogs are jumping 81% of the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.859,
    "end": 2568.522,
    "text": " And then it's like much more likely that jumping is a frog than an apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.203,
    "end": 2570.163,
    "text": "People can see that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.303,
    "end": 2576.206,
    "text": "And then that updates the prior belief into a posterior belief, but it never eradicates the alternative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.246,
    "end": 2583.01,
    "text": "It's still 10% likely that it's an apple that jumped because initially we thought it was like very likely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.45,
    "end": 2585.631,
    "text": "So that's just one example from the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.369,
    "end": 2595.524,
    "text": " Let's see how we actually use that generative model decomposition into likelihood and prior to talk about functional and psychological niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.606,
    "end": 2610.15,
    "text": " They're going to use variational inference to invert this likelihood, which is the statistical distribution of sensations given causes of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2610.97,
    "end": 2617.332,
    "text": "So how you should interpret a given sensation conditioned upon your beliefs about how things actually are out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.559,
    "end": 2626.262,
    "text": " approximate the posterior probability of causes once a sensation has been sampled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.783,
    "end": 2632.827,
    "text": "So here it's P S conditioned upon eta, I hope that's the right,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.121,
    "end": 2646.088,
    "text": " pronunciation of fancy N. But here we're looking for actually the probability distribution on unobserved causes of the world conditioned upon observed sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.668,
    "end": 2649.47,
    "text": "So these are like two of the directions of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.03,
    "end": 2656.214,
    "text": "Given the prior on what's out there in the world, what is being sensed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2657.255,
    "end": 2662.238,
    "text": "And then this is given the sensations, what is out there in the world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.038,
    "end": 2675.125,
    "text": " So the big picture level, this is like how we're both doing inference on perceiving the lightning and thunder and the actual likelihood of what's happening in that cloud out there, despite not being able to directly observe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.846,
    "end": 2679.068,
    "text": "So that's the inversion that they're talking about here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.748,
    "end": 2690.315,
    "text": "And that could be done through different methods, but the variational approach allows this inversion to be done in like a tractable and computable way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.095,
    "end": 2697.739,
    "text": " And so here they're going to use the same notation and they're just going to unpack it into equation two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.999,
    "end": 2700.921,
    "text": "And they write the variational density becomes a posterior belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2702.482,
    "end": 2712.948,
    "text": "So that's a prior that's been updated by input about the causes of sensations given the sensations that were experienced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.589,
    "end": 2717.912,
    "text": "This inverse mapping from causes to effect corresponds to inferring the causes of sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.112,
    "end": 2718.212,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.505,
    "end": 2724.75,
    "text": " In a way, we repeat ourself many times with this inversion in both directions at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2725.551,
    "end": 2730.916,
    "text": "And I hope it's just not redundant for those who are familiar, nor...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.061,
    "end": 2759.568,
    "text": " ambiguous overly for those who are unfamiliar but this is sort of at the core of it is that there's modeling of both the sensations and the underlying causes and sometimes it goes from one to the other and backwards and variational inference is like a toolbox or a toolkit that helps deal with both of those directions and compute them in an attractable way and here's the thing it's if if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.941,
    "end": 2771.028,
    "text": " If you think you can analogize this to I've always walked around on my feet and now I'm going to walk around on my hands, that's not what's actually happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.068,
    "end": 2775.251,
    "text": "That's not the type of inversion that's actually going on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.271,
    "end": 2784.259,
    "text": "There's something to do with effect and cause that doesn't just necessarily translate to what's up and what's down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.779,
    "end": 2787.661,
    "text": "You have to take a little bit more dimensionality into that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.587,
    "end": 2801.751,
    "text": " And so that's why it remains at sort of this mathematical statistical level, as opposed to, oh, if it was just as simple as, oh, you're telling me now to walk around in my hands and that's going to change my perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.351,
    "end": 2803.752,
    "text": "No, that's not what we're saying here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.905,
    "end": 2808.328,
    "text": " just to give kind of one reading of equation two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.468,
    "end": 2818.699,
    "text": "So this f, it's very much spaced out, but you can think of it as being like f of x, like a function f of the variable x, like with x as an argument, but you could think about that f being like right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.279,
    "end": 2821.722,
    "text": "It's a functional, it's a function of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.368,
    "end": 2827.392,
    "text": " states that are sensations, S, and mu, the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.452,
    "end": 2830.274,
    "text": "And like, it's kind of like here, the eta is the external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.355,
    "end": 2831.456,
    "text": "It's like an upside down mu.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.736,
    "end": 2834.719,
    "text": "So mu is internal and then eta is external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.499,
    "end": 2846.349,
    "text": "And so that free energy value for a given combination of sensation and internal, which are to say cognitive states, is the divergence between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.33,
    "end": 2857.318,
    "text": " the truth, the true posterior, which is the actual distribution of causes given sensations, and this Q distribution, Q sub mu.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.618,
    "end": 2864.044,
    "text": "So it's a Q distribution that we control as a cognitive state that takes only a single argument, which is just eta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.104,
    "end": 2876.634,
    "text": "And then that KL divergence, which is trying to minimize the difference between like the Q distribution that we control and the true posterior and subtracting out just how surprising given states should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.032,
    "end": 2881.614,
    "text": " We talk about it also other times, but many touches, many coats of paint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2882.014,
    "end": 2882.955,
    "text": "So we'll continue on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2884.256,
    "end": 2887.598,
    "text": "What does this variational inference approach allow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.239,
    "end": 2891.88,
    "text": "That takes us to equation three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.181,
    "end": 2897.644,
    "text": "Formally, variational inference converts an inference problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.437,
    "end": 2904.421,
    "text": " into an optimization problem as articulated by equation three and figure one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2905.142,
    "end": 2908.744,
    "text": "So here's our figure two, which was stated as like an inference problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.505,
    "end": 2926.939,
    "text": "And then this is going to move to an optimization problem using this arg min, which just means like choose the minimum, choose the minimum of that argument over Q. And then that is gonna be applied to this inverse mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.444,
    "end": 2946.215,
    "text": " They also connect it here to some discussion of Bayes optimal updating when learning that cause sensation relationship and about how it's tied to biological cognitive mechanisms like experience dependent plasticity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2947.716,
    "end": 2953.861,
    "text": "And then they tie that to several specific mechanisms of cognitive updating like the millisecond timescale",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.148,
    "end": 2958.671,
    "text": " the minutes to hours timescale, and then the months to years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.212,
    "end": 2965.277,
    "text": "And then when we think about that forest, that's where we think about the intergenerational selective extended niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.538,
    "end": 2967.599,
    "text": "Anything else you'd add on this one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.66,
    "end": 2970.262,
    "text": "This is kind of the in-between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.422,
    "end": 2975.106,
    "text": "We're going to get to the other side here shortly when we go further in the slides, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.388,
    "end": 2989.211,
    "text": " If you started thinking that if it was a simple matter of inverting from walking on feet to walking on hands, this is kind of the in-between between, okay, so to me, it makes perfect sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.251,
    "end": 2997.574,
    "text": "It's unsurprising that my skin is on the outside and everything else is sort of the bones and the organs and all the blood is on the inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.074,
    "end": 3002.595,
    "text": "But to the environment, it has an inside and an outside as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.769,
    "end": 3009.154,
    "text": " And what is my outside could necessarily be the environments inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.634,
    "end": 3026.069,
    "text": "And this is kind of transitioning us to that idea of, yes, it would be surprising if everything that's now currently inside of me was on the outside, but stop looking at it as inversion in that sort of centric or cellular way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.529,
    "end": 3028.611,
    "text": "Think of it now in terms of the bigger picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.881,
    "end": 3036.324,
    "text": " And that's where this, I think this slide starts transitioning us to that other perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.165,
    "end": 3039.445,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.286,
    "end": 3041.506,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.866,
    "end": 3045.908,
    "text": "Continuing on in section two to figure one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3046.748,
    "end": 3046.949,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.93,
    "end": 3054.612,
    "text": "Why don't you give a first pass description on what you see in the figure or what you think is important about it, Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3055.384,
    "end": 3058.506,
    "text": " Well, I'm going to read first before I sort of throw my own comment in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.047,
    "end": 3065.552,
    "text": "Actions are selected if they bring about expected outcomes while being geared toward minimizing expected surprise or uncertainty about the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.292,
    "end": 3070.395,
    "text": "That's if you've been reading enough stuff in active inference that you've read that a few times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.216,
    "end": 3084.906,
    "text": "Hence, in active inference, motor and autonomic functions, autonomic, work hand in hand with a perceptual inference to resolve uncertainty through the active sampling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.276,
    "end": 3093.803,
    "text": " of salient uncertainty reducing sensations, back to the feeling piece, while allowing for preferred unsurprising outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.203,
    "end": 3096.965,
    "text": "Free energy is minimized with respect to counterfactual outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.507,
    "end": 3103.691,
    "text": "And we've spoken a few times of what is a counterfactual in this context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.652,
    "end": 3110.036,
    "text": "But now it's very clear that the counterfactual is embedded in a context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.603,
    "end": 3112.324,
    "text": " It doesn't just free float.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.784,
    "end": 3120.849,
    "text": "There are times when it is supposed to now extend into something or is already embedded within something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.81,
    "end": 3128.253,
    "text": "By taking the expectation of free energy under future outcomes, given the action being evaluated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.414,
    "end": 3135.618,
    "text": "Now, both Daniel's copy and my copy of the paper didn't do a good job of reproducing the purple and the greenness of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.516,
    "end": 3138.577,
    "text": " these two worlds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.957,
    "end": 3142.68,
    "text": "And there's actually a third world going to be introduced as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.02,
    "end": 3157.128,
    "text": "But in order to be able to get to the idea of extending, the first thing that they want to do is kind of create this idea of surprise minimization within a tighter loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.288,
    "end": 3162.391,
    "text": "There's going to be a concentric loop that they're going to introduce around this shortly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.833,
    "end": 3169.275,
    "text": " And that's what all this is, is just basically setting up, I think, for the next figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.295,
    "end": 3170.255,
    "text": "But what do you think, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.775,
    "end": 3175.196,
    "text": "Yes, just a few pieces to highlight and then just describing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.816,
    "end": 3187.139,
    "text": "This is a key piece of active inference that there's a relative comparison of expected futures, not just in the abstract, but always conditioned upon policy affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.06,
    "end": 3188.86,
    "text": "And that helps us understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.793,
    "end": 3196.676,
    "text": " determine whether to trim tab or steer the ship to the left or to the right, because that's our affordances with our hand on the rudder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.136,
    "end": 3209.682,
    "text": "Okay, now if you're modeling the hand on the rudder and a hand on the gas and brake, that's another control situation that you might be in, but there is no such thing as like the neutral non-policy grounded trajectory of the boat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.442,
    "end": 3215.085,
    "text": " Or one could do that, but it would actually not be actionable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.145,
    "end": 3224.269,
    "text": "It wouldn't be action oriented because there would be like some maximum likelihood boat trajectory implicitly based upon non-action of the captain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.03,
    "end": 3228.692,
    "text": "And it's like, okay, but I know that we're going to crash if we don't do anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.372,
    "end": 3233.716,
    "text": " A biological organism is actually always engaged in that action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.377,
    "end": 3246.788,
    "text": "And so this is both something that's biologically grounding to always condition upon policy affordances, but also is computationally simplifying because we could have uncertainty about both sides of the team A's, but we still need to act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.148,
    "end": 3248.589,
    "text": "What do you think about that before we continue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.85,
    "end": 3253.674,
    "text": "Well, I think that's fantastic because I think the struggle that people have in writing papers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.508,
    "end": 3258.652,
    "text": " is the fact that they're talking right now because you have to talk about the psychological niches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.992,
    "end": 3261.915,
    "text": "How do you keep in mind the functional niches?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.256,
    "end": 3269.102,
    "text": "They've said you have to do that, but it's hard to do that when your focus is on the cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.583,
    "end": 3278.772,
    "text": "So how do you keep that other thing running in parallel, the functional niche, while you're supposedly giving your attentional",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.594,
    "end": 3283.056,
    "text": " energies over to psychological niches, but you got to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.317,
    "end": 3284.858,
    "text": "So how do you train for that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.838,
    "end": 3293.864,
    "text": "That's what, that's a fantastic thing about this paper and what you just kind of explained again about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.965,
    "end": 3296.526,
    "text": "It's a minimum of two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.906,
    "end": 3300.869,
    "text": "If you lose one, you, the whole thing falls apart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.251,
    "end": 3307.253,
    "text": "Let's run around the Rosie as it were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.628,
    "end": 3315.011,
    "text": " So here, even though the paper was quite literally beyond skulls, we're going to have a brain for the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3315.852,
    "end": 3322.716,
    "text": "And so just looking at these four pieces, you could also kind of think about a Markov blanket in the middle, but it's not emphasized in this picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.636,
    "end": 3331.921,
    "text": "What you see, even without knowing what the variables are, is that these two on the bottom right, the internal states and the action selection have this arg min.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.641,
    "end": 3338.105,
    "text": "So those are, as per this discussion, it means that it's an optimization problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3338.985,
    "end": 3345.91,
    "text": " So these two, there's this active and act of optimization and selection and choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3346.891,
    "end": 3350.653,
    "text": "Here's the external states, which it's a stochastic differential equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.833,
    "end": 3360.961,
    "text": "So it's doing some dynamics that's a function of, well, omega noise term, but also a function of the current external states as well as the actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3361.621,
    "end": 3366.164,
    "text": "So if external states were influenced in some way by action, it would be for naught.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.245,
    "end": 3368.486,
    "text": " Here's the sense states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.086,
    "end": 3371.948,
    "text": "They're a function of external states and noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.708,
    "end": 3378.271,
    "text": "So you don't get to directly, in the instant of perception, select sense states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.092,
    "end": 3389.517,
    "text": "However, actions like eye-siccating, ocular motor choices, can be selected that result in changed sensory output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.617,
    "end": 3395.401,
    "text": "You can walk to a different part of the room where you get a different sensation of temperature, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.83,
    "end": 3401.572,
    "text": " without special appeals, one can't just change their sensory inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3402.112,
    "end": 3410.495,
    "text": "And so this is like framing, here's the particular entity, the blankets and the internal states as partitioned off from the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3411.535,
    "end": 3413.176,
    "text": "And even within the entity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3414.016,
    "end": 3423.039,
    "text": " we see that it's not enough just to talk about the set of undirected nodes that makes the internal and the external states conditionally independent from each other, the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.519,
    "end": 3432.022,
    "text": "This is where we kind of get towards the Friston blanket, where we're thinking about incoming sensory dependencies and treating those as perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.002,
    "end": 3443.146,
    "text": "And then there's this free energy function that is doing perception as divergence minimization without the ability to directly control those sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3444.397,
    "end": 3450.859,
    "text": " We also have action as minimizing a divergence and minimizing a bound on surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3451.299,
    "end": 3457.381,
    "text": "But this is also framed as an optimization that we actually get to choose based upon our affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.941,
    "end": 3465.704,
    "text": "And so this one is kind of like you're selecting the sensory, perceptive, interpretive lens that is minimizing something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.949,
    "end": 3468.07,
    "text": " It's minimizing surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3468.45,
    "end": 3476.954,
    "text": "And then in a different way, choosing from the action selection affordances, there's also a minimization of surprisal through action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.414,
    "end": 3481.175,
    "text": "And so these two are like choice-driven, optimization-like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.656,
    "end": 3485.838,
    "text": "And then there also is this optimization happening with perception, but it's like slightly different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.678,
    "end": 3488.899,
    "text": "Can I just add something to that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.939,
    "end": 3491.2,
    "text": "We spend, in all of these live streams,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.892,
    "end": 3497.378,
    "text": " to go again and again back to the active piece and the inference piece or the action piece and the perception piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.019,
    "end": 3512.035,
    "text": "But what I really liked about this figure was if you actually, again, do a little shift in terms of what you want to pay attention to, back to the way uploading or way up finding or whatever, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.97,
    "end": 3520.133,
    "text": " You could say the bound as minimized, or you could say the bound as optimized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.493,
    "end": 3522.834,
    "text": "And I think that's really critical as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.314,
    "end": 3528.576,
    "text": "We can put all of our attention on the perception and the action, or we could look at the bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.576,
    "end": 3532.777,
    "text": "And what are the two meanings of binding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.138,
    "end": 3540.4,
    "text": "And again, if we're going to look at this imaginatively, what is the Hudson River telling us today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3541.616,
    "end": 3552.271,
    "text": " because that's now the bound as optimized, doesn't necessarily have to have a plane land on it, and the bound as minimized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.751,
    "end": 3557.778,
    "text": "And I'll let you use your imagination of what that means in that context, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.818,
    "end": 3558.199,
    "text": "But again,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.517,
    "end": 3561.799,
    "text": " There's multiple ways that this can be parsed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.359,
    "end": 3565.902,
    "text": "Arbitrarily, what we tend to focus on is the action and the inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.382,
    "end": 3571.647,
    "text": "But we could also look at, so how does this bound behave?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.507,
    "end": 3577.031,
    "text": "Do we just assume it's stationary, it's static, it doesn't change?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.871,
    "end": 3580.794,
    "text": "Or is it malleable as well?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.095,
    "end": 3584.517,
    "text": "I guess it just depends on what you want to pay attention to, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.097,
    "end": 3585.958,
    "text": "So again,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.46,
    "end": 3589.521,
    "text": " This is going to lead to the next figure, which I really love.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3590.541,
    "end": 3592.041,
    "text": "Yes, we'll get to figure two in a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.781,
    "end": 3594.081,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3594.961,
    "end": 3600.222,
    "text": "They continue in section 2.1 discussing the cognitive niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3600.682,
    "end": 3603.063,
    "text": "And this, there's a lot to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3603.143,
    "end": 3608.124,
    "text": "People could, you know, pause the video and read these quotations or they could read the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.284,
    "end": 3614.265,
    "text": "What would be the one or few things that you would highlight from this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.285,
    "end": 3615.125,
    "text": "And then I'll give a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.373,
    "end": 3624.197,
    "text": " Well, I took from the paper the thing on the right bottom in red, which I really like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.617,
    "end": 3630.942,
    "text": "We do not claim that the formal symmetry between brain and niche dynamics entails a symmetry and construal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.723,
    "end": 3633.484,
    "text": "Fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.204,
    "end": 3637.266,
    "text": "I'll let people, if they don't know what construal is, they can look that up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.387,
    "end": 3643.771,
    "text": "Rather, we employ the notion of symmetry epistemically as a modeling analog.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.619,
    "end": 3649.023,
    "text": " to make sense of niche dynamics as learning dynamics under active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.084,
    "end": 3654.668,
    "text": "They're just reassuring us that this is true active inference, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.529,
    "end": 3657.771,
    "text": "The notion of symmetry is merely an assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.554,
    "end": 3670.483,
    "text": "I think that that's, and if you read the paper and you read that statement, you'll go, okay, they're not overfitting anything here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.274,
    "end": 3680.421,
    "text": " which I love because it would be real easy to just go completely off and start thinking we've solved every riddle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.522,
    "end": 3682.223,
    "text": "They haven't done that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.343,
    "end": 3685.805,
    "text": "They've done a brilliant job of just sort of keeping it in its lane.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.507,
    "end": 3687.787,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3688.047,
    "end": 3689.989,
    "text": "So to pick up on one of their quotes,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3691.309,
    "end": 3695.692,
    "text": " They write, the environment is the generative process that is modeled by the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3696.313,
    "end": 3698.134,
    "text": "Generative process, forest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3698.694,
    "end": 3701.856,
    "text": "Generative model, wayfinding, hiking, team.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3702.857,
    "end": 3703.918,
    "text": "Entailed by the phenotype.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.157,
    "end": 3714.721,
    "text": " In virtue of the mathematical symmetry imposed by a Markov blanket that separates or makes conditionally independent the internal and external states, it's like, hey, whose side are you on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.321,
    "end": 3717.742,
    "text": "Internal is external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.242,
    "end": 3719.743,
    "text": "They're just two sides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.443,
    "end": 3721.264,
    "text": "Don't provoke me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.985,
    "end": 3729.127,
    "text": "The environment can also be construed as a generative model of its denizens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3730.387,
    "end": 3733.53,
    "text": " who now become the processes generating outcomes for the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.071,
    "end": 3744.861,
    "text": "So in figure one, we had this sort of like argument on the internal states, but then it's a different qualitative structure for those generative processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.282,
    "end": 3751.267,
    "text": "So this might be appropriate for a world where there's some active entity that's doing strategy and cognition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.108,
    "end": 3755.31,
    "text": " And the rest of the world is like chains of dominoes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.771,
    "end": 3765.877,
    "text": "Like there are exogenous dynamics that could happen without the cognitive entity pushing them, but it's a mere active inference entity in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.998,
    "end": 3772.702,
    "text": "This formalism also could extend to other cases, but this is just sort of at a first pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.363,
    "end": 3780.407,
    "text": "And where we're headed and where we're going to go in figure two in the next slide is this symmetry as an assumption",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.428,
    "end": 3795.92,
    "text": " and saying well actually let's put rich dynamics on both sides of the blanket let's allow this thinking where um one active state of this entity is the sense state of the other entity and vice versa so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3797.386,
    "end": 3803.571,
    "text": " That means that niche construction is a form of environmental learning about the organisms hosted by the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.071,
    "end": 3808.315,
    "text": "So it's like the field that's getting the pleasure path burnt into it by footsteps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.835,
    "end": 3813.319,
    "text": "It's actually, in a sense, learning where people like to walk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.079,
    "end": 3839.14,
    "text": " that's its parameter updating and then there's one case where that pleasure path is just like the stacks of dominoes and so it's like yes it's parameter updating but it's kind of like low-key not learning versus what if that pleasure path was more and more agentic more and more cognitive then there's teaching going both directions and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3840.208,
    "end": 3846.63,
    "text": " then we see a few examples like the two guys on this stream, you know, here's one that you put.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3846.77,
    "end": 3852.032,
    "text": "So it's the person in nature and they're in their VR viewing nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.153,
    "end": 3854.393,
    "text": "That's like sort of this one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.533,
    "end": 3858.195,
    "text": "Which is viewing, like that's the strange loop part, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.575,
    "end": 3866.538,
    "text": "And the other thing too is, I mean, if there was some way that you could have put little VRs on every one of those ants, that would have been kind of fascinating as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.598,
    "end": 3869.079,
    "text": "And again, it goes back to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.256,
    "end": 3876.821,
    "text": " When we look at slices in time, we can nest, and we're looking at a nest of ants, but is that the same thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3878.262,
    "end": 3884.747,
    "text": "So, again, it comes back to, okay, so I'm just going to say this at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.327,
    "end": 3893.053,
    "text": "I'll probably have a ton of bricks fall down on me, but you can look at things as opposite sides of the same coin, or you can look at twins, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.57,
    "end": 3897.113,
    "text": " In both cases, the question is, is one better than the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.133,
    "end": 3904.279,
    "text": "Or is it our ability to see both that is the thing that matters?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.32,
    "end": 3909.343,
    "text": "Here's the plot twist with the ant picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.023,
    "end": 3915.768,
    "text": "You'll notice that this ant has yellow paint on all three of its body parts, and this one has blue paint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.738,
    "end": 3923.781,
    "text": " And so it turns out that an experimenter had previously collected these ants and then chilled them on ice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3924.081,
    "end": 3929.123,
    "text": "And then while they were stopped, painted them carefully and then reintroduced them to their colony several hours later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.143,
    "end": 3930.503,
    "text": "I did this in Arizona.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.203,
    "end": 3937.646,
    "text": "So now these painted ants and their behavior, they're like tracers in this collective behavioral system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3938.426,
    "end": 3941.287,
    "text": "And so who's learning and who's teaching from who?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3941.968,
    "end": 3942.168,
    "text": "Who's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3943.288,
    "end": 3967.854,
    "text": " training who there's cognitive entities in a shared niche on both sides of the markov blanket or whatever kind of blanket however you draw it and so what does it look like to start to embrace this richness on both sides of the cognitive partition yeah let's see what that looks like in figure two okay so on the right side um we have the old figure one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.089,
    "end": 3973.611,
    "text": " Way back when, back when the environment was simple, weren't those the days?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3974.492,
    "end": 3979.955,
    "text": "And the figure has been updated in a few different ways, which I'll describe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3979.975,
    "end": 3983.717,
    "text": "But first, what did you see in figure two or what would you highlight here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.339,
    "end": 3992.422,
    "text": "Okay, well, I'm going to beat the drum about joint self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.942,
    "end": 3998.846,
    "text": "So I think it's easy enough to find out what self-evidencing is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.739,
    "end": 4006.543,
    "text": " But joint self-evidencing is a whole different ant or cat or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.303,
    "end": 4016.029,
    "text": "And so when we introduce the niche construction optimizes the bound on surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.289,
    "end": 4021.893,
    "text": "Now the boundary has a different look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.474,
    "end": 4025.335,
    "text": "Why is that different than the first two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.095,
    "end": 4050.648,
    "text": " where is the where is the joint like literally the joint in this relationship because relationship is fluid how do we how do we secure exactly where the joint is or is it something that's more in the realm of the twist you know back in the keywords we've got that image of the sort of the Morpheus strip",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.778,
    "end": 4058.035,
    "text": " Is that what's actually going on here as opposed to sort of the more traditional definition of what a joint is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.376,
    "end": 4060.696,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.016,
    "end": 4061.897,
    "text": "Joint, it's funny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.917,
    "end": 4069.779,
    "text": "It means both separate, carved nature at the joints and all of that, the joint between the two pieces of plywood, and it literally means together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.859,
    "end": 4070.579,
    "text": "They are joint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.98,
    "end": 4072.74,
    "text": "It's like the past tense of to join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.68,
    "end": 4076.361,
    "text": "It's a joint in the Tensegrity sculpture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4076.861,
    "end": 4078.262,
    "text": "So that's very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4078.862,
    "end": 4081.263,
    "text": "And what is the difference between figure one and figure two?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.723,
    "end": 4083.944,
    "text": "So the triangle and the star...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4084.824,
    "end": 4100.331,
    "text": " So the idea of perception optimizing surprisal, we don't get to directly control sensory states, but we can control our cognitive modeling of sensory states, is bound on a surprisal and bound on survival in the evolutionary sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.951,
    "end": 4106.414,
    "text": "And then action is also this argmin-like process of choosing actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.654,
    "end": 4108.115,
    "text": "So that was in figure one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.062,
    "end": 4121.866,
    "text": " Now, rather than this external state just being like a function of external states and action states in a noise term, now there's actually this argmin happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4122.347,
    "end": 4125.588,
    "text": "Now it's an argmin on those same two arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.328,
    "end": 4137.332,
    "text": "It's still being influenced by the current state of the external states and the actions, but now the other side of the cognitive partitioning is also doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.172,
    "end": 4138.953,
    "text": " action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4139.873,
    "end": 4155.503,
    "text": "And so then they write, this effectively closes a circle of causality in which the niche and phenotypes, I mean, it's really just two different phenotypes, the niche and the entity, are trying to learn about each other to minimize their joint free energy or surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4156.083,
    "end": 4163.088,
    "text": "An inevitable consequence of this is that the niche and its incumbents become mutually predictable in both directions of fit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4164.517,
    "end": 4178.551,
    "text": " paging the principle of unitarity and the quantum and the entanglement from 40, so that the joint niche phenotype system can be regarded as jointly self-evidencing, which probably also has a few different ways to read it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4178.651,
    "end": 4180.112,
    "text": "But we had the star and the triangle,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.113,
    "end": 4186.814,
    "text": " as perception and action as in the common game of minimizing surprise for the entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.394,
    "end": 4199.757,
    "text": "And now we have square, which is niche construction, optimizing the bound on surprise of the niche, of the organism's actions, which are sense from the perspective of the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4200.577,
    "end": 4209.579,
    "text": "Like what if instead of us trying to minimize our surprise about CO2 readings in the atmosphere, the other side of that coin is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.609,
    "end": 4215.452,
    "text": " the environment minimizing its surprise about the CO2 that's actually put in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4216.733,
    "end": 4217.813,
    "text": "And that's what we see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4218.294,
    "end": 4218.474,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4219.114,
    "end": 4221.235,
    "text": "What about the Siamese twin example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.716,
    "end": 4224.537,
    "text": "Like is that two sides of the same coin?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.599,
    "end": 4226.859,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.939,
    "end": 4230.141,
    "text": "So again, this is the twist aspect of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.181,
    "end": 4231.702,
    "text": "This is we're looking at the bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.115,
    "end": 4238.719,
    "text": " as opposed to what's on either side of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.199,
    "end": 4241.862,
    "text": "Again, we have this ability to see both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.202,
    "end": 4245.264,
    "text": "It's a question of whether we choose to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.105,
    "end": 4252.01,
    "text": "That's what's really great about this paper, actually, because it's actually looking at extending a mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.43,
    "end": 4258.535,
    "text": "But in order to be able to do that, it's asking you to, can you delimit from what you're paying attention to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.772,
    "end": 4264.613,
    "text": " Let's unpack the equations with one more level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4265.153,
    "end": 4267.214,
    "text": "So here we are in equation four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4267.774,
    "end": 4274.496,
    "text": "So on the top left, we're going from figure one to figure two, but with equation two to equation four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4275.216,
    "end": 4281.038,
    "text": "So figure one was here, and then we introduced the activity of the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.738,
    "end": 4289.04,
    "text": "Equation three was the optimization of internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4290.051,
    "end": 4308.491,
    "text": " to infer causes between this and now the niche is also going to be doing something similar so equation four has the same form as equation two but with internal sensory and external active states switch around which is like i switched um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4311.124,
    "end": 4317.468,
    "text": " which signpost was pointing to each side of the maze and I switched where the food locations were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.889,
    "end": 4321.091,
    "text": "So it's still like the sign is still correct, but it's all different now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.351,
    "end": 4326.514,
    "text": "This means that the variational density is taken under the external states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4328.419,
    "end": 4329.519,
    "text": " not the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.66,
    "end": 4333.061,
    "text": "And surprisal is relative to organism's actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.301,
    "end": 4340.984,
    "text": "So from the organism's point of view, the variational density is over internal states, minimizing surprisal about the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.924,
    "end": 4349.347,
    "text": "From the environment's point of view, the variational distribution is over external states, and it is over...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.234,
    "end": 4355.276,
    "text": " It is oriented towards reducing surprisal relative to the organism's actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.836,
    "end": 4366.0,
    "text": "But again, environment and organism, it could just be thought of as like side A and side B. Like whichever side you're on, there's going to be this symmetry in the forming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.35,
    "end": 4381.201,
    "text": " And so that's what equation four does, is it pretty much just replicates equation two, but instead of it being about the organism doing free energy minimization on sensations and internal states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.426,
    "end": 4395.974,
    "text": " It's literally the other two pieces of the quadrivium of the fourfold distinction, which is like, it's a free energy minimization of the environment on the actions of the organism and the current state of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.734,
    "end": 4399.576,
    "text": "And then there's analogous flippings of all the other pieces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.436,
    "end": 4404.779,
    "text": " So that's basically taking this symmetry seriously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.7,
    "end": 4416.407,
    "text": "And it shows that this free energy functional structure, it is like, it's enough to hold the yes and the no, or to hold both sides together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4417.608,
    "end": 4426.093,
    "text": "It's not a Jedi mind trick to say that my outsides can be inside the insides of something else like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.274,
    "end": 4426.494,
    "text": "That's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4427.962,
    "end": 4438.994,
    "text": " That is literally not hard to do, but that's not necessarily how I don't walk around every day identifying myself as the insides of something larger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.536,
    "end": 4440.756,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.936,
    "end": 4441.817,
    "text": "But that's a fact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.338,
    "end": 4445.341,
    "text": "So, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.741,
    "end": 4449.145,
    "text": "And it's almost like the inside out view on strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4450.362,
    "end": 4455.483,
    "text": " it ends up through thinking through other minds, being like an outside-in strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4455.963,
    "end": 4462.804,
    "text": "How will other strategic entities, the other chess player, how will they think about my actions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.545,
    "end": 4473.426,
    "text": "And so it's like stepping outside of the entity, considering how other minds will see the entity's actions as sense states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4474.147,
    "end": 4475.467,
    "text": "Yeah, perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4475.587,
    "end": 4476.347,
    "text": "All right, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4478.179,
    "end": 4480.02,
    "text": " 2.2, the psychological niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4480.14,
    "end": 4486.983,
    "text": "So this is where they're going to be unpacking the cognitive niche concept, again, in terms of the functional and the psychological components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4488.123,
    "end": 4492.525,
    "text": "And any things here before I'll just note whatever I see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4492.805,
    "end": 4498.848,
    "text": "Yeah, and the thing you've just highlighted, the psychological niche can thus be viewed as a state space of invitations to act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.028,
    "end": 4503.169,
    "text": " That's the attractor state thing, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.529,
    "end": 4507.371,
    "text": "I don't want to overstep, but I think that's what it's sort of pointing to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.431,
    "end": 4519.355,
    "text": "With peaks and valleys that correspond to the most and least probable and thereby adaptive actions, given the priors and phenotypic preferences of organisms like me, having constructed the niche in the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4519.375,
    "end": 4520.696,
    "text": "And I brought those three images in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.832,
    "end": 4530.614,
    "text": " as examples of why free energy minimized drive niche construction in states they share with these psychological attractors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.654,
    "end": 4542.676,
    "text": "Like why does somebody want to paraglide outside of the Monch in Switzerland or do the Ferrata on Mount Norquay in Banff, or I'm not sure where the amusement park is in the States.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.776,
    "end": 4550.958,
    "text": "But I mean, again, why are these, could be these not just functional places, but psychological",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.846,
    "end": 4567.906,
    "text": " niches right as an extension of the mind that's essentially what this is is is pointing at do we necessarily see the walking along that ferrata as an extension of the mind well people that are probably enjoying it do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.735,
    "end": 4571.556,
    "text": " And people that are wetting themselves probably don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.178,
    "end": 4584.162,
    "text": "And all of these cases involve the cognitive niche broadly as having like a functional underlying physical embodied substrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.282,
    "end": 4586.203,
    "text": "Like there is a roller coaster here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.223,
    "end": 4589.684,
    "text": "There is a bridge of some kind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4589.704,
    "end": 4596.447,
    "text": "There is the apparatus of the paragliding machinery and it's both functional and it's cognitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.507,
    "end": 4597.448,
    "text": "It's an invitation to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.26,
    "end": 4603.785,
    "text": " for an experience and an invitation for being in a certain scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4604.886,
    "end": 4606.087,
    "text": "So that's very rich.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4606.127,
    "end": 4610.071,
    "text": "And I hope we can explore that a little more in the dot one, two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.972,
    "end": 4624.324,
    "text": "And it's also, it's also, yeah, it's also dense and it's also up and down, which when the previous slide, we saw the, I'm sorry, I think it's the previous slide where we saw the, the waves example of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4625.374,
    "end": 4628.756,
    "text": " One of the, I'm not sure if it's slide 23 or 24.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4629.616,
    "end": 4633.057,
    "text": "But anyway, that's the other part of this psychological piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.458,
    "end": 4634.958,
    "text": "It's not necessarily stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.658,
    "end": 4645.863,
    "text": "You don't know who's going to walk into these kind of niche constructions and remain stable and who's going to be completely destabilized by what they find themselves in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.903,
    "end": 4649.284,
    "text": "That surprise-o piece causes all kinds of feelings, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4649.384,
    "end": 4652.425,
    "text": "So, yeah, it's, again, fantastic paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4653.466,
    "end": 4653.606,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.588,
    "end": 4658.05,
    "text": " We come now to section two, three, the functional niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.17,
    "end": 4663.393,
    "text": "So previously we were discussing that psychological niche facet of the cognitive niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4664.153,
    "end": 4667.055,
    "text": "And then this is coming to the functional niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4669.876,
    "end": 4672.017,
    "text": "What does dancing with the stars have to do with it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.137,
    "end": 4673.278,
    "text": "Or what would you add here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.599,
    "end": 4679.582,
    "text": "Well, do we gear learning towards belonging to or working with or both?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4680.282,
    "end": 4682.243,
    "text": "Because I think in, in, in different,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.027,
    "end": 4712.664,
    "text": " situations that we find ourselves sometimes we're partnered with somebody who has prior experience sometimes we're stepping on one another's toes and either one of those kind of situations can bring us minimize our free energy right and optimize i step on you step on my toes enough times i'll probably communicate to you that we need to maybe change the pattern of your foot movement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.564,
    "end": 4713.804,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.985,
    "end": 4721.768,
    "text": "One isn't always done at the exclusion of the other in terms of getting to the place we want to be sooner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.088,
    "end": 4729.251,
    "text": "There's also the part where dancing in actual galactic scales just fascinates me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4732.393,
    "end": 4735.574,
    "text": "I'm going to start with a quote from the paper, but it will end in a joke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4738.041,
    "end": 4748.829,
    "text": " They give us an example of the wax feeling and extended cognitive apparatus of the whole postal chain, the supply chain logistics of the mailing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.889,
    "end": 4752.731,
    "text": "And they basically say the point here is neither...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.052,
    "end": 4760.702,
    "text": " is that neither of the internal or external sub-components of the brain wax system exists in isolation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4761.142,
    "end": 4763.406,
    "text": "So it's like the fully distributed term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.806,
    "end": 4769.895,
    "text": "So what does it look like when instead of just thinking like, well, cognition is about what's happening in the brain, happening in the skull,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4770.936,
    "end": 4790.857,
    "text": " and then there's all these extensions of cognition like that get um facilitating what happens in the brain is now going to be done through these extended apparatuses and this is kind of like even going further which is like yeah it's a little odd to depict the wax as doing active modeling of the punch",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4792.04,
    "end": 4818.253,
    "text": " but actually from the markov partitioning perspective all these different sub components of the cognitive constellation federation are all sense and acting each other they're all doing active on each other back to figure two look at the brain see how it has a star here perception optimizing the balance so how do we dance with the stars",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.514,
    "end": 4822.616,
    "text": " How do we do group dancing with the stars?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.917,
    "end": 4826.119,
    "text": "How do the brains dance together?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4826.94,
    "end": 4833.785,
    "text": "That's not the same thing as one active brain, one star in an extended dead universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4834.585,
    "end": 4840.81,
    "text": "Dancing with the stars is when cognitive entities are on the other side of the phone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4841.59,
    "end": 4846.274,
    "text": "And so it's a very apt meme that you added here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.025,
    "end": 4854.289,
    "text": " There's another interesting part to this too, and that is the stage tends to be set up so that the cameras can catch all of the choreography.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.849,
    "end": 4856.43,
    "text": "What happens when the participants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.429,
    "end": 4858.97,
    "text": " impose on the cameras, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4858.99,
    "end": 4862.311,
    "text": "Like, when do they extend the stage out into the audience?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.832,
    "end": 4872.376,
    "text": "That hasn't happened yet, but what would that mean then for the property that we know, conventionally have known as dancing with the stars?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.177,
    "end": 4877.399,
    "text": "Now the camera has to move to that active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.999,
    "end": 4881.401,
    "text": "That's imposing, and it's kind of really fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.001,
    "end": 4886.083,
    "text": "Again, do you construct it and contain it, or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4887.253,
    "end": 4890.754,
    "text": " What elements of this are actually free and independent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.334,
    "end": 4898.235,
    "text": "That makes me think about, here's figure one, science communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.376,
    "end": 4902.876,
    "text": "Scientists are stars and they're great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4904.297,
    "end": 4906.197,
    "text": "Figure two, science communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4907.737,
    "end": 4914.919,
    "text": "Now we're dancing with the stars because the fourth wall has been broken and there's rich cognitive activity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.962,
    "end": 4924.604,
    "text": " not just happening on both sides of the communication partition, but actually in a way where it's irreducible and it's a value add from both sides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4924.684,
    "end": 4928.085,
    "text": "That's when we'll be doing science communication with the stars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.186,
    "end": 4932.046,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4932.066,
    "end": 4932.046,
    "text": "2.4."
  },
  {
    "start": 4932.867,
    "end": 4936.748,
    "text": "We won't go into it that much, but feel free to make any comment that you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.888,
    "end": 4941.169,
    "text": "They give a case study of the common earthworm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4942.171,
    "end": 4943.932,
    "text": " Lumberchris terrestris.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4944.333,
    "end": 4946.394,
    "text": "So here's that wormy guy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4947.415,
    "end": 4961.945,
    "text": "And they talk about some of the ideas that were brought up in the previous sections, like counterfactuals in the niche and inferential efficiency and uploading of cognitive functions in the context of the worm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.365,
    "end": 4964.766,
    "text": "Anything you'd add about this or we can continue on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.887,
    "end": 4966.688,
    "text": "Just real quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.708,
    "end": 4971.311,
    "text": "I mean, I'm glad that they're introducing the second, not just offloading, but uploading idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.399,
    "end": 4983.146,
    "text": " but again, I'm always sort of, I always get a little sensitive around the idea that expediting is not expedition and we, we are sort of built to do both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4983.947,
    "end": 4988.03,
    "text": "So optimization can sometimes just take, take a longer path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.171,
    "end": 4992.513,
    "text": "And so again, I'm not, I'm not critiquing what they're saying here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4992.833,
    "end": 4996.336,
    "text": "I understand what in the context of earthworms, I don't know if there's a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.319,
    "end": 5000.481,
    "text": " a Magellan earthworm, or if one has been discovered yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.381,
    "end": 5018.709,
    "text": "So I don't want to sort of drag this off into the wilderness, but I do know that for us, there is that aspect of our curiosity, which we want to make sure that we don't toss away in terms of bringing the example of the case study forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.75,
    "end": 5019.97,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5020.61,
    "end": 5021.591,
    "text": "Just one note here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5022.751,
    "end": 5023.852,
    "text": "Over multiple generations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5025.256,
    "end": 5042.566,
    "text": " So that's both ecological in terms of the stigmatic niche construction of building the tunnel apparatus, and it's evolutionary because there's a selective niche now inside of the ecological niche that selects for earthworms that are better at, for example, using tunnels and building sometimes rather than being the builder earthworm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5043.667,
    "end": 5047.649,
    "text": "This comes at the cost of being evolutionarily glued to those cognitive extensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5048.329,
    "end": 5048.81,
    "text": "Put bluntly...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5049.75,
    "end": 5076.715,
    "text": " cognitive niche construction smartens the world of the earthworm so that its physiology can remain dumb yet optimal in peace so from 24 years ago clark and so that's interesting to think about and it actually relates to a question that joseph clark asked in the chat they wrote if we can model the environment as a sum of its states and the state's environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5077.742,
    "end": 5091.977,
    "text": " What does this say about our capacity to create a superintelligence, perhaps in an adapted structure to the deep generative model of mental action with the superintelligence acting as attention over its states like people and frogs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.718,
    "end": 5094.92,
    "text": "So this is kind of like saying, okay,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5096.181,
    "end": 5124.965,
    "text": " well just one thought it's not exactly what is being said is all right so we've talked about how there's this like extended active inference that's happening richly in a distributed way across multiple stars we're doing active with the stars but is that whole system one non-extended super intelligence or what is that extended system and what does that say about our ability to actually construct and work with different intelligences than human",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5127.915,
    "end": 5128.135,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5130.037,
    "end": 5132.299,
    "text": "Three, extended active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5132.339,
    "end": 5134.42,
    "text": "So here's where we get to the EAI parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5138.284,
    "end": 5139.585,
    "text": "What would you say about this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5143.528,
    "end": 5143.748,
    "text": "Well...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5148.493,
    "end": 5173.219,
    "text": " have a lot to say but honestly i think i want to keep it to the point one and the point two because they're they're i'm not by nature the kind of person who wants to critique and i'm not critiquing this but i can think of lots and lots of examples in my my personal professional uh history where if you don't appreciate put bluntly cognitive niche construction smartens the world of the earthworm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5173.789,
    "end": 5176.835,
    "text": " so that its physiology can remain dummy yet optimal in peace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.236,
    "end": 5180.361,
    "text": "That's been ignored in a lot of formal education settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5180.422,
    "end": 5183.087,
    "text": "So if we get there, we'll talk about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.187,
    "end": 5183.768,
    "text": "And if we don't,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5185.672,
    "end": 5186.052,
    "text": " No problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5186.892,
    "end": 5187.132,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5187.473,
    "end": 5191.934,
    "text": "They do connect to at least two, minimum of two, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5192.434,
    "end": 5197.155,
    "text": "And these are like extended in space and extended in time, through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.336,
    "end": 5199.516,
    "text": "Diachronic as opposed to synchronic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5199.616,
    "end": 5204.698,
    "text": "And so without going too much into the quantum...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5205.854,
    "end": 5211.216,
    "text": " wormhole, rabbit hole with space and time being constructs, hashtag livestream 40.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5212.117,
    "end": 5215.038,
    "text": "Those are at least just two ways we can think about extended cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5215.938,
    "end": 5222.261,
    "text": "Okay, here's the sections that are in three, and it'll be great to talk more about this in dot one and dot two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5223.521,
    "end": 5229.304,
    "text": "In these sections, they introduce three functions or aspects of the extended mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5230.044,
    "end": 5235.266,
    "text": "So the first of these features, as they call them, is a parity principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5238.721,
    "end": 5268.207,
    "text": " parity principle states that if a part of the world functions as a process which were it done in the head we would have no hesitation in recognizing it as part of the cognitive process then that part of the world is part of the cognitive process so if you can add two plus two in your head be right or wrong or whatever then it shouldn't be um qualitatively different to think about two plus two on the calculator it's all part of this extended cognitive so parity just means like um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.273,
    "end": 5272.694,
    "text": " If it's been rendered unto Caesar, then it's equal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5274.855,
    "end": 5275.876,
    "text": "The parity principle, yeah?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.136,
    "end": 5277.316,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.356,
    "end": 5278.937,
    "text": "No, no, that's right, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5279.377,
    "end": 5287.641,
    "text": "The parity principle entails the second feature of the theory of extended mind, which is the notion of a potential functional isomorphism between some internal and external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5288.843,
    "end": 5297.508,
    "text": " We discussed this a lot in the representations paper and what does active inference tell us about our representations of ourself and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5297.628,
    "end": 5304.091,
    "text": "So there's a lot packed into this notion of functional isomorphism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.452,
    "end": 5313.897,
    "text": "What kind of functional isomorphism does the cognitive model have the same structure as the generative process, or can it be just action oriented and of a totally different kind?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5314.926,
    "end": 5317.947,
    "text": " but suffice to say there has to be some functional connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5318.667,
    "end": 5322.048,
    "text": "And then the third piece that they introduce is this epistemic action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5323.068,
    "end": 5329.789,
    "text": "These are actions that ease or optimize cognitive tasks by reducing the memory load required to perform a task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5330.269,
    "end": 5331.85,
    "text": "So that's like space complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5333.85,
    "end": 5337.571,
    "text": "By simplifying the computational processing procedure, time complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5338.496,
    "end": 5342.785,
    "text": " And by minimizing the probability of error outcomes, success probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5343.566,
    "end": 5347.254,
    "text": "So it's kind of like space, time, and then surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5347.274,
    "end": 5348.416,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5349.127,
    "end": 5350.688,
    "text": " And that's the cognitive dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5351.128,
    "end": 5363.313,
    "text": "Like we always hear about, well, what would it be like when you're on the light beam and when you're on the spaceship and when you're going into the black hole in this objectivist frame, as if the dimensions that mattered were like the objective space and time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5363.753,
    "end": 5372.077,
    "text": "But once we swallow that cognitive pill or decide to let it course through us in our action, all of a sudden there's the surprise dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5373.155,
    "end": 5394.461,
    "text": " element of surprise and that's where some of these psychological aspects of the cognitive niche come into play and some of these citations are pretty interesting so as always like reading citations is awesome um so referring to the first of those features that they talk about with the parody principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5396.072,
    "end": 5401.414,
    "text": " It's been suggested that external resources should meet the requirements of glue and trust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5401.994,
    "end": 5404.955,
    "text": "So it's not just for first graders anymore, glue and trust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5405.875,
    "end": 5414.437,
    "text": "So that the resource is available when needed, like biomemory, and not subject to constant agentive scrutiny to ensure it is working as it should.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5414.597,
    "end": 5416.058,
    "text": "Again, like biomimicry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5416.781,
    "end": 5427.358,
    "text": " From the point of view of extended active inference, the trust condition is guaranteed by the uploading process whereby the agent learns to engage epistemic cues of the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5430.242,
    "end": 5431.624,
    "text": "This entails trading off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5432.97,
    "end": 5437.871,
    "text": " on-board neurocognitive functions or on-board environmental ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5438.431,
    "end": 5446.113,
    "text": "I wasn't actually sure if this was meant to be off-boarded environmental ones or if on-board here is still referring to our ship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.193,
    "end": 5452.274,
    "text": "It's still on-board our ship, but now the function is also distributed environmentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5452.294,
    "end": 5457.175,
    "text": "Yeah, but I kind of focused on the trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.255,
    "end": 5460.956,
    "text": "So it's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.498,
    "end": 5464.839,
    "text": " You made a choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.54,
    "end": 5467.862,
    "text": "Now, was it the proper one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5467.882,
    "end": 5477.51,
    "text": "You hope that the stability of the thing that you passed along to remains robust and constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.671,
    "end": 5480.392,
    "text": "So that's why it's a trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5480.692,
    "end": 5482.434,
    "text": "There's an assumption built in, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.834,
    "end": 5483.655,
    "text": "That's how I read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5485.165,
    "end": 5493.393,
    "text": " And they also write, for instance, the earthworm is glued to its inheritance of burrows and moist soil because the constraints of burrows, soils, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5493.493,
    "end": 5495.855,
    "text": "have played on the earthworm's evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5497.637,
    "end": 5506.505,
    "text": "And then we can imagine how an individual would become glued to their environment in a similar fashion over developmental and also evolutionary timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5506.966,
    "end": 5507.927,
    "text": "Like, if we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5509.892,
    "end": 5512.315,
    "text": " don't have fossil fuels tomorrow, it's going to be tough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5512.775,
    "end": 5517.321,
    "text": "But there would have been a time previously in history before we were glued to them like we are now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5517.861,
    "end": 5519.603,
    "text": "And so it's like glue and trust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5519.884,
    "end": 5521.706,
    "text": "And what does that enable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5521.846,
    "end": 5522.667,
    "text": "What does it constrain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5523.148,
    "end": 5526.532,
    "text": "And how does that relate to this core screening and the parity principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5527.369,
    "end": 5527.509,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5527.549,
    "end": 5528.37,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5528.69,
    "end": 5529.49,
    "text": "Epistemic actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5529.79,
    "end": 5541.816,
    "text": "So they write a notebook, for instance, can be viewed as supporting and easing the task of making it to your multiple appointments throughout the week because it can encode relevant information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5543.317,
    "end": 5545.298,
    "text": "It can provide structures like a schedule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5546.408,
    "end": 5549.469,
    "text": " and it can increase your chances of making it to those appointments on time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.769,
    "end": 5557.85,
    "text": "So it's those same three areas that we discussed earlier, like space, time, and surprise about success.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5560.491,
    "end": 5571.473,
    "text": "These intuitions are formalized by the process of uploading from the point of view of extended active inference, but in addition, by accounting for the relation between all these advantages, also between slash among.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5571.673,
    "end": 5575.254,
    "text": "Between is for two things, and among is for more than two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5576.743,
    "end": 5578.705,
    "text": " And then here's a bunch of different kinds of notebooks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.785,
    "end": 5580.746,
    "text": "And then here's the computational one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5582.027,
    "end": 5583.088,
    "text": "Anything to add on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5583.988,
    "end": 5594.055,
    "text": "Well, traditionally, from a learning standpoint, the epistemic actions tend to be placed into a planning paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5594.534,
    "end": 5599.797,
    "text": " Whereas I see this more as the provisioning, this is part of my kit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5600.757,
    "end": 5618.386,
    "text": "So I kind of tend to step back and say a journal by itself or an assumption that journaling, writing my ideas out in the traditional sense, isn't the same as I'm going to bring a journal along in case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5619.707,
    "end": 5622.488,
    "text": "And the in case being the counterfactual, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5623.112,
    "end": 5633.021,
    "text": " So again, I'm in agreement with them, but I know that convention follows that you take one of these things along because you're planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5634.022,
    "end": 5635.823,
    "text": "And I'm not discounting planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.184,
    "end": 5645.452,
    "text": "I'm just saying when it turns into a plan as opposed to it's one more source of or one more example of a provisioning exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5647.808,
    "end": 5648.068,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5649.088,
    "end": 5666.773,
    "text": "One thought on that would be like the difference between true step-by-step long-term planning, planning as inference, and a sort of nested planning approach where it's like, today, I'm just going to plan to make time to pack my backpack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5668.061,
    "end": 5672.886,
    "text": " And then I'll have a plan in the moment when I'm there with my backpack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.026,
    "end": 5684.636,
    "text": "Like I wanna have the best possible plan, but we're like layers of uncertainty away from what actually might be that situation or the specifics, but I wanna have the right affordances then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5685.397,
    "end": 5688.88,
    "text": "And so what are the plans that can be taken right now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5689.961,
    "end": 5714.765,
    "text": " so that we can plan to plan instead of just treating planning as like being like before action and being like we're just going to be in the headquarters and we're going to plan out all the alternatives it's like how are we going to plan to plan and then once you go into the nested planning well then how are we going to plan to plan to plan and what should we be doing in the headquarters maybe we should be on the road by now yeah well it's just it's different versions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.566,
    "end": 5725.133,
    "text": " And I think as long as you can see them as being different, you're probably ahead of the person who automatically jumps to one conclusion of what this means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5725.153,
    "end": 5725.913,
    "text": "So that's all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5726.614,
    "end": 5726.814,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5727.134,
    "end": 5733.379,
    "text": "And then one other term that they talked about is diachronic cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5734.179,
    "end": 5741.445,
    "text": "So they wrote, the standard example used to explain diachronic cognition is that of Elizabethan theater companies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5742.897,
    "end": 5748.402,
    "text": " in the work of Tribble, 2005, Evelyn Tribble, Distributing Cognition in the Globe Theater.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5750.023,
    "end": 5755.687,
    "text": "And this paper is about how members of theater companies during the 16th century A.D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5755.887,
    "end": 5760.451,
    "text": "would manage to perform multiple plays per week without being able to rehearse due to time limitations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5760.851,
    "end": 5760.971,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5762.472,
    "end": 5791.381,
    "text": " too real too real and the ability of the actors to memorize how to perform those plays depended on all kinds of embodied enacted and cultured etc etc etc like all the richness was there and is there and um then like this is just one quote from Tribble's paper and then love to hear what you think about it so here's from King Lear which is a Shakespeare play that I love um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5792.66,
    "end": 5798.013,
    "text": " And it's just interesting in this extended cognitive discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5799.747,
    "end": 5806.928,
    "text": " to see the artifact of the text, the written part, that's like the trace that we see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5806.948,
    "end": 5813.769,
    "text": "And that's when, when Fristin speaks of singing from the same hymn sheet, this is kind of like, this is the script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5813.889,
    "end": 5816.97,
    "text": "I mean, isn't the script like the DNA, isn't it the blueprint?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5817.65,
    "end": 5827.052,
    "text": "And then this actually reminds us that no, there's actually hundreds of years of discourse and discussion around the enactments and what the trace means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5827.892,
    "end": 5828.452,
    "text": "And so like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5829.552,
    "end": 5838.16,
    "text": " Meagher argues what has eluded generations of editors is not likely to have been instantly grasped by the company originally mobilizing the play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5839.2,
    "end": 5847.628,
    "text": "Meagher argues that Shakespeare was expected, probably and preferred, to be available, plan to plan to speak to will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5848.581,
    "end": 5849.322,
    "text": " Get in the boat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5850.323,
    "end": 5853.586,
    "text": "Able to explain and install such designs as this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5853.606,
    "end": 5854.607,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5855.228,
    "end": 5857.85,
    "text": "Captain Shakespeare was expected to be there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5858.371,
    "end": 5861.494,
    "text": "And so that's why the trace isn't instructions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5864.778,
    "end": 5881.096,
    "text": " It's kind of interesting, too, if you think about this, because what does this say about a lot of stuff that goes on at the post-secondary level now, which you put a loop on it or put a bow on it when you have a conversation with somebody about your poster or your trifold?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5882.377,
    "end": 5886.982,
    "text": "What has that got to do with a diachronic cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5890.066,
    "end": 5890.826,
    "text": " Interesting, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5891.106,
    "end": 5893.507,
    "text": "Because it's not the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5893.867,
    "end": 5917.039,
    "text": "What they're essentially saying here is there's the context of how you would present a poster, but then there's this, which appears, I guess, to the current viewer, not the one 500 years ago, as being this thing taking up a lot more time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5918.653,
    "end": 5924.815,
    "text": " But back then, that was the default for those people who were time constrained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5925.595,
    "end": 5941.6,
    "text": "So again, have we come up with a way of being able to demonstrate cognition today that enables this view?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5942.62,
    "end": 5943.04,
    "text": " I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5944.001,
    "end": 5945.521,
    "text": "Again, I'm not criticizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5945.601,
    "end": 5964.63,
    "text": "I'm just saying, what if, counterfactually, this were the way that we were able to now give people an opportunity to say, this was my niche construction, as opposed to, I got X number of answers correct on this form of filter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5966.826,
    "end": 5994.702,
    "text": " Yeah, when this paper talks about patterned sociocultural practices mediated by material artifacts populating the stage and a cross-generational apprenticeship system, and what you just said about education, this makes me think about the PhD system and the idea that it could happen without the materiality or the intergenerational mentorship and apprenticeship systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5996.75,
    "end": 5999.451,
    "text": " it just wouldn't be the same cognitive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5999.791,
    "end": 6020.241,
    "text": "And then I really liked what you said there, like the brain based instructionist paradigm, it wants to put the student in the cubicle into a different niche, a different learning environment, and then test them on the recall, on the ability to like be that API on the other side of the question response hotline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6021.261,
    "end": 6034.939,
    "text": " and what else does it look like when we invite each student to create a cognitive Niche which as we're discussing here is psychological and it's offloaded it's uploaded into the environment which could be digital and then it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6036.3,
    "end": 6039.583,
    "text": " I want to know that you spent the time and attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6039.603,
    "end": 6044.048,
    "text": "I want to see your Coda page with the questions that you wrote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6044.608,
    "end": 6051.715,
    "text": "And I want to see some components of your cognitive niche and see where you're developing it and how you're developing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6052.396,
    "end": 6057.761,
    "text": "And public goods like parks, there's people who prune the roses and there's people who mow the grass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6057.801,
    "end": 6058.281,
    "text": "There's people who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6059.795,
    "end": 6061.997,
    "text": " Make sure the trees are all good to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6062.077,
    "end": 6065.12,
    "text": "And those are all different kinds of niche maintenance practices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6065.861,
    "end": 6073.928,
    "text": "And so in our broader cognitive niche, how do we navigate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6075.21,
    "end": 6075.55,
    "text": "Amen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6077.031,
    "end": 6078.413,
    "text": "Here's their whole concluding remark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6078.433,
    "end": 6079.313,
    "text": "Better stage, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6080.094,
    "end": 6080.314,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6081.314,
    "end": 6082.795,
    "text": " Here's their whole concluding remark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6084.115,
    "end": 6092.359,
    "text": "The model of cognitive niche construction proposed in this paper offers a formal apparatus for the study of non-brain based factors in cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6092.959,
    "end": 6104.905,
    "text": "So extended cognition as a starting point for modeling, not as a conclusion, not like, well, there's all these things in the niche and there's the apprenticeship and then there's the ambiguity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6104.985,
    "end": 6108.767,
    "text": "And so the conclusion of my paper is it's extended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6111.221,
    "end": 6112.622,
    "text": " invert that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6113.662,
    "end": 6126.809,
    "text": "So that is starting with the notion of this extended distributed cognitive process, and then apply the sensemaking to the modeling process in this holistic way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6129.29,
    "end": 6138.315,
    "text": "The point stressed in the paper was that cognitive niche construction can be studied as a shared cognitive functioning, enabling organisms to track",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6140.959,
    "end": 6160.795,
    "text": " fractal often implicitly and at low cost and fractal cause effect relationships otherwise difficult if not impossible to track semicolon notably relationships where the causal structure is volatile or too complex to be learned",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6161.618,
    "end": 6164.301,
    "text": " by a single entity, by a single nest mate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6165.121,
    "end": 6180.796,
    "text": "And so as they close from the point of view of extended active inference, EAI, all cognitive functions are in the game of tracking causal regularities, and there's no principled reason to restrict this process to the boundaries of skin, skull, or even individual agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6183.198,
    "end": 6185.32,
    "text": "So then how do we put it all into practice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6187.202,
    "end": 6191.224,
    "text": " What does applied extended active inference looks like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6192.145,
    "end": 6192.865,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6193.625,
    "end": 6200.269,
    "text": "The 4EA cognitive, extended embedded encultured inactive applied cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6201.029,
    "end": 6208.253,
    "text": "And so definitely when we're in 41.1, we can talk about applied slash applying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6208.273,
    "end": 6210.835,
    "text": "And taking initiative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6211.715,
    "end": 6212.916,
    "text": "That's a really critical thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6212.956,
    "end": 6214.357,
    "text": "Like it's hard to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6215.319,
    "end": 6219.881,
    "text": " You always hear people in post-secondary education say, well, it's what you do with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6220.061,
    "end": 6220.981,
    "text": "It's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6221.041,
    "end": 6223.762,
    "text": "Like there's a bit of a hand wiping aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6223.802,
    "end": 6224.982,
    "text": "What's what you do with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6225.723,
    "end": 6230.724,
    "text": "But what this is saying is, I think it's a little bit more than what I do with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.205,
    "end": 6238.287,
    "text": "So how do we set that stage so that it's not quite so daunting to take the initiative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6240.02,
    "end": 6242.604,
    "text": " What you do with it is the hands-on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6243.024,
    "end": 6244.186,
    "text": "You're the active person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6244.226,
    "end": 6245.308,
    "text": "It's what you make of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6245.689,
    "end": 6246.931,
    "text": "It's the energy you put in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6246.951,
    "end": 6249.455,
    "text": "You're going to get back what you put into your PhD.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6251.117,
    "end": 6251.318,
    "text": "That's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6252.717,
    "end": 6258.76,
    "text": " you're the star of the show, you're the main and only character in this dead extended cognitive world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6259.58,
    "end": 6274.906,
    "text": "But what about when we're dancing with the PhDs and non-PhDs and we're actually applying together in a shared cognitive niche and that cognitive niche includes other stars who are also like sensing and acting and cognizing about us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6275.366,
    "end": 6278.688,
    "text": "So applied thinking through other minds and ways of knowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6279.568,
    "end": 6303.644,
    "text": " and then another question that we'll discuss in dot one dave was that there's often a point in these active papers about the um different kinds of partitioning and blankets there's anatomical mechanical there's functional psychological but there's a lot of different partitionings and different kinds of things coming into play so what is the relation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6304.793,
    "end": 6313.488,
    "text": " between the anatomical mechanical blankets, so the skin and skull, and the functional psychological blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6313.548,
    "end": 6315.731,
    "text": "This is kind of like brain and mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.15,
    "end": 6323.911,
    "text": " So how is that distinction related to nesting of similar or different kinds of blankets?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6324.732,
    "end": 6337.194,
    "text": "And then, oh yeah, where does the niche and the niches and the niches of each other and the laterally interacting and the nested niches, how does that all come together?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6338.114,
    "end": 6341.695,
    "text": "So what are your penultimate thoughts, Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.796,
    "end": 6346.376,
    "text": "Well, first of all, I really appreciate the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6346.857,
    "end": 6348.178,
    "text": " I think it's a fantastic paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6348.338,
    "end": 6352.782,
    "text": "I love inverting because I think we're capable of doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6353.262,
    "end": 6362.49,
    "text": "To Dave's point, I think we have this ability to see the difference between process and product or up and down or whatever, dynamic and stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6363.331,
    "end": 6366.073,
    "text": "And arbitrariness seems to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6367.228,
    "end": 6373.493,
    "text": " bother the people who want things to be stable and stability seems to bother those people that want things to be creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6373.673,
    "end": 6375.114,
    "text": "And I think that's a perfect world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6376.095,
    "end": 6390.887,
    "text": "And so every time I read one of these papers by Axel and the other authors, but in particular, the two papers recently that we've now given a treatment to that, I think Axel was the primary author, first author.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6391.788,
    "end": 6392.408,
    "text": "Only author on 34.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6392.929,
    "end": 6393.109,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6393.509,
    "end": 6393.79,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6394.17,
    "end": 6396.692,
    "text": "I mean, he, he, he brings things that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6399.988,
    "end": 6406.833,
    "text": " at first might seem counterintuitive compared to the way things traditionally have been viewed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6407.533,
    "end": 6412.616,
    "text": "And he makes a very compelling case for why we might want to open a second eye to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6413.037,
    "end": 6415.478,
    "text": "He doesn't throw out the first thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6415.899,
    "end": 6417.8,
    "text": "He says, maybe there's a new entailment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6418.2,
    "end": 6421.784,
    "text": " that we might want to consider in this partitioning exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6421.824,
    "end": 6426.909,
    "text": "We all seem to participate in just different levels of degrees of sophistication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6427.009,
    "end": 6440.143,
    "text": "So again, I'm not a fanboy or putting people up on pedestals, but I certainly respect the way that he's able to share this information and make it more accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6441.589,
    "end": 6445.771,
    "text": " I think we can make it even more accessible if we can find real-life on-the-ground examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6446.391,
    "end": 6448.072,
    "text": "And I think that's what we'll try to do in the 41.1 and 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6448.532,
    "end": 6451.033,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6451.413,
    "end": 6451.813,
    "text": "Agreed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6453.154,
    "end": 6455.075,
    "text": "Axel gets those cogs spinning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6455.435,
    "end": 6460.537,
    "text": "So as always, Axel, thanks for the collaboration directly and indirectly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6461.237,
    "end": 6462.458,
    "text": "And yeah, this should be a great...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6463.573,
    "end": 6489.365,
    "text": " set of discussions in the dot one and dot two so dean thanks a ton for all the assistance before during and after here and uh to anyone else who's listening now or in the future or whatever just come get involved and enact with us all the world's a stage everyone's a critic we're all stars here etc thanks daniel really appreciate it bye",
    "speaker": "SPEAKER_01"
  }
]