[
  {
    "start": 1.425,
    "end": 30.096,
    "text": " hello it's act inf textbook group cohort one meeting 23 on no 4 22 and we are in our first of two discussions on chapter 10. it's the final chapter of the book and so let's take a look at the table of contents and just does anybody from their reading or experience want to share an initial note on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.383,
    "end": 52.738,
    "text": " where and how we've come where do we sit in a satisfaction space after chapter nine does chapter 10 get us where we want to be as we then complete the book",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.325,
    "end": 66.787,
    "text": " Yeah, Ali, and then anyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.569,
    "end": 87.167,
    "text": "Actually, chapter 10 is a pretty interesting chapter with all its comparative analysis provided and comparing active inference framework with other similar methodologies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 87.928,
    "end": 98.214,
    "text": " and unsurprisingly emphasizing almost always the advantages of using active inference over all the other frameworks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.074,
    "end": 106.898,
    "text": "But yeah, these comparative analyses were really helpful, in my opinion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 108.499,
    "end": 118.394,
    "text": " in order to distinguish what exactly active inference is and how it relates to other disciplinary areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.454,
    "end": 123.541,
    "text": "But I think that some of these materials could have been",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 124.222,
    "end": 137.719,
    "text": " introduced much earlier, I mean, even in chapters 1 or 2, because most, some of the confusions at least, sometimes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 139.561,
    "end": 154.349,
    "text": " arises from not being too clear enough about what active inference is and what it does and how it compares to other related areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.249,
    "end": 160.532,
    "text": "But otherwise, it's a very, very interesting chapter in my opinion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 167.352,
    "end": 190.662,
    "text": " Yeah, I kind of feel similarly here that the way I would word it is that it's almost like a survey chapter, but it's got a lot of details and it's like, that would have been a good, maybe not all of that up front in the same way, but it just helps delineate active inference a little bit more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 192.563,
    "end": 194.324,
    "text": "Just the textbook overall, like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 195.945,
    "end": 204.931,
    "text": " I feel like we could make this no, you know, no exercises or something and lack of implementation comment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 205.071,
    "end": 213.796,
    "text": "It's like, but the fact that it's in the structure of the way that the, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 217.523,
    "end": 233.415,
    "text": " that it is currently understood at the frontier is almost like a little puzzle that will probably result in significantly better understanding of the domain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 235.136,
    "end": 237.478,
    "text": "So I feel like it's...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.649,
    "end": 246.792,
    "text": " it's just the right amount of challenge for me to like really ground what is being said here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 246.832,
    "end": 248.973,
    "text": "And it's not like just given to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.213,
    "end": 254.195,
    "text": "So, um, usually that's not done very well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 254.295,
    "end": 258.317,
    "text": "Once you have some pedagogical sort of resource, it's like, this is what it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 258.917,
    "end": 259.537,
    "text": "Don't think about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 260.078,
    "end": 260.778,
    "text": "Just remember that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 261.578,
    "end": 263.579,
    "text": "And that's not very helpful either.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 263.799,
    "end": 265.3,
    "text": "So, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 267.611,
    "end": 277.54,
    "text": " I wish there were maybe other libraries or something of software that explained a little more how this was working in a cogent fashion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 277.58,
    "end": 283.326,
    "text": "But also, there's an opportunity to help write this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 283.406,
    "end": 292.534,
    "text": "So that's, to me, I don't know, more interesting than just a rote definition explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 295.222,
    "end": 324.203,
    "text": " yes this isn't the final version of the textbook nor the final textbook ecosystem and i agree yes chapter 10 provides a nice overview it's it is long and it also may make sense as like chapter 1.1 even just to understand like the unifying theory of sentient behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.791,
    "end": 351.933,
    "text": " angle before even talking about how to drive to active inference with a high road and a low road you know here's the overview in chapter one and here's maybe here's how hawaii is different than this other destination now here are two ways to get there now here's the generative model and empirical examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.103,
    "end": 353.984,
    "text": " So many ways to read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.144,
    "end": 355.324,
    "text": "Eric, any overall thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.444,
    "end": 357.125,
    "text": "Or let's look at their key points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.767,
    "end": 378.577,
    "text": "I felt like this was kind of a kitchen sink chapter, trying to take just a whole conglomeration of perspectives and lines of research and ideas in the whole enterprise of computational intelligence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.5,
    "end": 387.342,
    "text": " cognitive science, neuroscience, psychology, and so forth, and say, okay, this is how we view it through the active inference lens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.523,
    "end": 394.504,
    "text": "So I think that's the purpose, kind of the purpose of the chapter, at least the second part of the chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.524,
    "end": 403.387,
    "text": "The first part of the chapter is kind of the summary of, again, the overview of what active inference is about, and tries to tie the threads together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.407,
    "end": 406.528,
    "text": "And I don't think it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.146,
    "end": 415.011,
    "text": " It's good to see the reminders of what the journey has been through the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.912,
    "end": 417.373,
    "text": "I appreciated that refresh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.494,
    "end": 424.599,
    "text": "There are a number of threads that go in different directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.439,
    "end": 427.08,
    "text": "Things like the notion of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.685,
    "end": 440.191,
    "text": " Everything being a form of inference, but planning is a different form of inference because it's a different functional energy functional than pure perceptual inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.433,
    "end": 458.281,
    "text": "The notion of the exploitation exploration trade-off, the notion of not being able to solve for the base and optimal policy, but therefore having to use",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.488,
    "end": 462.89,
    "text": " a variational energy approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.851,
    "end": 470.516,
    "text": "That was mentioned, but I felt like the book never in this chapter didn't say, well, how do we really leverage that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.576,
    "end": 474.939,
    "text": "I mean, how does that really come into play, you know, operationally?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.959,
    "end": 488.128,
    "text": "It reviewed the examples that were used earlier in the book, such as the TMAs and so forth, which I found underwhelming all the way through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.969,
    "end": 493.133,
    "text": " And so the chapter ends with promises.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.253,
    "end": 496.795,
    "text": "It says, wow, this is this wonderful hammer we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.616,
    "end": 499.498,
    "text": "Let's see what nails we can find out in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 499.718,
    "end": 500.899,
    "text": "And we're going to hammer, hammer, hammer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.839,
    "end": 504.261,
    "text": "And let's see if they behave like nails.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.462,
    "end": 512.308,
    "text": "We're going to treat them as they behave like nails, even if they're screws and need a different instrument to turn them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.665,
    "end": 540.664,
    "text": " so i think that as far as you know what if you're a devotee of active inference then this chapter is perhaps inspirational um if you're a skeptic then it's um it's like well okay that's nice move on yeah a lot there too let's let's look at some of these strong claims",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.739,
    "end": 551.201,
    "text": " One benefit of active inference is that it provides a complete solution to the adaptive problems that sentient organisms have to solve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.863,
    "end": 560.244,
    "text": "Of course, more could be said, but does it provide a complete solution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.584,
    "end": 570.927,
    "text": "Or maybe a little bit, still generously, but perhaps less excessively, it provides a complete framing or accounting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.669,
    "end": 595.908,
    "text": " which is different than a solution for the problems this makes it sound like just you know install actinf.py and the problem is solved which is obviously going to be situational depending on the generative model which is under no guarantee to be effective just like no linear model is effective by principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.714,
    "end": 611.159,
    "text": " So pretty obvious point, but something where as Eric just suggested, like an adherent might see this as a slam dunk, a fractal slam dunk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.079,
    "end": 620.902,
    "text": "Whereas somebody who's approaching this more skeptically is actually not going to have seen a solution at least presented in this book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.323,
    "end": 626.224,
    "text": "It offers a unified perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.802,
    "end": 638.651,
    "text": " on problems like perception, action selection, attention, emotional regulation, which are usually treated in isolation in psych and neuro and addressed using distinct computational approaches and artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.431,
    "end": 653.282,
    "text": "This much more coherently is true because it is a unified perspective on perception, learning, but through the composability of generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.963,
    "end": 656.424,
    "text": "So merely the particular physics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.541,
    "end": 680.47,
    "text": " markov blanket itself is not a unified model of perception action selection attention emotion regulation etc etc etc however it's a composable framework under which these phenomena can be explored but just the active inference kernel figure 1.1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.777,
    "end": 711.564,
    "text": " is not that but it does offer a perspective that allows us to integrate it in a way that linear models aren't going to get us there and indeed these fields do work in isolation across multiple levels of mars hierarchy and so unified perspective is really important to start having some discourse about like hey there are two computational functions from the same brain region",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.896,
    "end": 717.678,
    "text": " or other kinds of more integrative work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.998,
    "end": 719.479,
    "text": "So that's nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.1,
    "end": 728.864,
    "text": "Here, they're going to contextualize Active Inference in light of the following other fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.944,
    "end": 733.166,
    "text": "Eric first though, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.186,
    "end": 735.587,
    "text": "Yeah, I'll just add one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.607,
    "end": 736.947,
    "text": "Since you mentioned Marr,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.386,
    "end": 744.729,
    "text": " You know, I actually met David Maher once when I was applying for grad school.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.349,
    "end": 757.657,
    "text": "And so I was a big part of the, you know, I was a big enthusiast about the whole school of thought that he was the founder of at MIT, first in the UK and then at MIT.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.597,
    "end": 766.682,
    "text": "And one of the things that some of my fellow students and I observed was in that era was a phenomenon we call physics envy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.529,
    "end": 776.99,
    "text": " which is that an observation that physics is the grand science to explain the universe,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.055,
    "end": 786.819,
    "text": " And it manages to boil things down to very pithy equations, simple equations that explain a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.099,
    "end": 790.78,
    "text": "You've got E equals MC squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.84,
    "end": 795.182,
    "text": "You've got Schrodinger's equation, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.943,
    "end": 805.927,
    "text": "And people in computer science and cognitive science and artificial intelligence want to have a grand theory because we know that the even more interesting problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.94,
    "end": 811.431,
    "text": " for civilization is not how the universe works, it's how do minds work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.073,
    "end": 816.383,
    "text": "So we wanted to, so at least our professors and our mentors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 816.94,
    "end": 821.603,
    "text": " We're always looking for these grand unified theories, little equations that will explain everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.243,
    "end": 822.863,
    "text": "And it's important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.903,
    "end": 823.664,
    "text": "Math is important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.884,
    "end": 828.466,
    "text": "So, you know, you can find like equations of optical flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 828.546,
    "end": 832.749,
    "text": "And it's really important to model things using math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.349,
    "end": 838.252,
    "text": "But it seems that the free energy principle is is one of these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.38,
    "end": 844.823,
    "text": " physics envy type of approaches where we were looking for a single equation to explain everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.283,
    "end": 848.625,
    "text": "And by the way, it does borrow from statistical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 849.205,
    "end": 853.268,
    "text": "So it really is, I guess, Friston himself is his background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.048,
    "end": 860.872,
    "text": "So from that point of view, you know, this is again, you know, looking for a hammer that will,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.014,
    "end": 868.961,
    "text": " treat the mysteries of nature as a nail and you can hit it with a hammer and presto, you've got it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.722,
    "end": 872.565,
    "text": "And, you know, it may be more like biology where there are,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.338,
    "end": 891.483,
    "text": " Lots of principles, there's lots of math to be doing, lots of modeling to be doing, but by golly, it's really, really complicated and complex, and you're never gonna boil it down to the details of how it actually works using any simple equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.803,
    "end": 892.944,
    "text": "Physics does not predict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.458,
    "end": 895.559,
    "text": " the shape of my coffee cup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.54,
    "end": 902.827,
    "text": "I don't care how much you understand Schroeder's equation or the laws of physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.147,
    "end": 910.315,
    "text": "There's a lot other levels of complexity that have their own independent principles and ways of modeling them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.762,
    "end": 912.704,
    "text": " that are required to really understand the phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.105,
    "end": 925.541,
    "text": "So my concern is that these over-encompassing claims about active inference are falling susceptible to the physics envy trap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.742,
    "end": 947.456,
    "text": " so sorry that's my oh awesome thank you yeah well it surely recalls the earlier um distinction of needs and scruffies from like chapter one in the book or i believe um whether the complexity of any realized system is so in the weeds and massively factorial that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.806,
    "end": 965.377,
    "text": " transcendent generalizations are ineffectual um to the physics envy so this is the classic xkcd comic much memed many variants and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.319,
    "end": 974.503,
    "text": " it also surely represents some sociological settings like at Santa Fe Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.064,
    "end": 983.969,
    "text": "And it's like, well, we can talk, we can have the physicists speculate about sociology, but you wouldn't have the sociologists speculate about physics, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.785,
    "end": 993.591,
    "text": " And there's cases where that conversation in both directions is helpful or not, but it just isn't this projected down number line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.971,
    "end": 1000.876,
    "text": "But as a sort of rejoinder to the physics envy, is the FEP carrying on this lineage of physics envy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.757,
    "end": 1008.121,
    "text": "We may be in a lineage of physics annexation because the cognitive physics...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.975,
    "end": 1036.543,
    "text": " is actually expanding to tackle the scope of classical statistical thermodynamic and quantum physics under special cases of cognitive systems and so i do agree that an individual might experience physics envy or feel like they're getting closer and closer to the real thing as more and more equations and and inscrutable symbols appear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.935,
    "end": 1065.176,
    "text": " however I wonder if on a deeper supra personal level we're actually aligning physics more with cognitive science than vice versa which would completely invert the traditionally understood um physics envy they're gonna have neuro envy or they'll have they'll have miramiko envy Ali",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.177,
    "end": 1088.771,
    "text": " Yeah, one other case in point in this physics-envy endeavor is Karen Barad, who's a physicist which tries to apply her expertise onto some of the cultural phenomena, especially feminism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.791,
    "end": 1097.697,
    "text": "And she has a very well-known book on that subject called Meeting the Universe Halfway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.798,
    "end": 1118.875,
    "text": " And she's also the founder of a kind of realism called agential realism, which is very isomorphic with some of the fundamental concepts of FEP here as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1119.755,
    "end": 1128.482,
    "text": " So yeah, there are lots of interminglings between humanities and sciences or especially physics these days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1130.844,
    "end": 1131.104,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.725,
    "end": 1145.876,
    "text": "One image I kind of get is like there's a micro ratchet towards technicality, applications, visibility, tangibility, but there's a macro ratchet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.997,
    "end": 1152.881,
    "text": " towards holism, systems thinking, humanities, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.302,
    "end": 1159.965,
    "text": "And without broader awareness of that situation, there can be whiplash.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.425,
    "end": 1165.929,
    "text": "Like, are we doing philosophy on what things are and how they become and becoming and unbecoming?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.129,
    "end": 1174.254,
    "text": "Or are we calculating a particular form of a POMDP's expected free energy functional?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.27,
    "end": 1185.892,
    "text": " And we need to educate and develop our information environment to understand both and to include many perspectives yet unsaid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1186.672,
    "end": 1187.592,
    "text": "So 10.2, wrap up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.672,
    "end": 1200.575,
    "text": "Just really quickly, I'm going to also say there is an interesting discussion on Lex Friedman's podcast with Andrej Karpathy on attention is all you need, the way that they framed it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1201.391,
    "end": 1207.234,
    "text": " This is just kind of this underwhelming kind of mimetic kind of pithy thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1208.715,
    "end": 1230.827,
    "text": "But they didn't make this claim about transformers being kind of some significantly a more general trainable architecture that was just kind of in the paper slipped in and they were just framing it as here's a better, you know, language translation slash prediction, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1233.772,
    "end": 1235.252,
    "text": " And he didn't like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1235.792,
    "end": 1239.673,
    "text": "He was like, oh, it was so transformational.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1239.734,
    "end": 1243.735,
    "text": "They should have named it the Transformers, the new whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1245.135,
    "end": 1257.339,
    "text": "But then also had this conversation of, well, maybe it worked and it spread because it was this pithy meme thing that was under-promising and then eventually over-delivering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1258.039,
    "end": 1260.54,
    "text": "I think in Active Inference, I don't know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1261.676,
    "end": 1269.938,
    "text": " I don't see, like, I see how this, like, FEP framing of it is, like, implicitly overpromising.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1271.219,
    "end": 1278.361,
    "text": "But I don't see a lot of people explicitly constantly kind of making this, like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1281.09,
    "end": 1282.131,
    "text": " FEP is all you need.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1282.151,
    "end": 1285.074,
    "text": "Actives will explain everything sort of framing of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1286.235,
    "end": 1294.822,
    "text": "But there's this, I guess, yeah, it's like implicitly somehow because FEP is this sort of physics framing of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.583,
    "end": 1302.089,
    "text": "It just it seems like it's murky because of that relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1302.73,
    "end": 1305.512,
    "text": "But ultimately, we'll just find where it's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1308.129,
    "end": 1312.213,
    "text": " well suited and not that there are really, in fact, a lot of nails out there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1312.333,
    "end": 1322.743,
    "text": "And there may be a lot more screws or an equal amount of screws or we don't know, but we're going to get, you know, more complex and more precise models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1322.883,
    "end": 1329.208,
    "text": "So how that exactly works in implementation is up for debate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1329.609,
    "end": 1331.711,
    "text": "But or as remains to be seen, but I",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1332.779,
    "end": 1334.3,
    "text": " I don't know if there's something that can be done there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1334.46,
    "end": 1343.583,
    "text": "It's already modeled as FEP as some sort of containing background foundational epistemic prior there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1343.743,
    "end": 1348.684,
    "text": "And so they've already said the transformer is the amazing thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1348.724,
    "end": 1353.706,
    "text": "So it's just it will deliver until it meets that and or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.086,
    "end": 1354.366,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.686,
    "end": 1357.107,
    "text": "Nicely said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.478,
    "end": 1385.022,
    "text": " like we have the worked example we have canonical neural networks are active inference agents we have the the initial tracers you know the grappling hooks have been thrown the bugle has been sounded now let's see what really happens so good comments 10.2 wrapping up oh Ali please",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.729,
    "end": 1396.355,
    "text": " Sorry, just one point about this claim in the book that says the active inference provides a complete solution to the adaptive problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.175,
    "end": 1398.196,
    "text": "Well, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.256,
    "end": 1412.726,
    "text": "It seems to me like a kind of dubious claim because especially about the word complete here, maybe they meant that to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1413.306,
    "end": 1433.766,
    "text": " an adequate solution to the adaptive problems because you see there's a very significant and fundamental difference between being adequate and between complete in your solutions right so in this case i'm not sure what they mean by a complete solution to the adaptive problems because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1435.526,
    "end": 1459.093,
    "text": " as we all know, even at this stage of its development, Active Inference has some shortcomings and there are some, well, gaps in the theory and so on, and so using this strong claim here seems to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1461.033,
    "end": 1462.273,
    "text": " a little bit out of place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1464.574,
    "end": 1473.977,
    "text": "But I would be fine if I have an adequate solution to some problems in some situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.018,
    "end": 1478.619,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.639,
    "end": 1482.12,
    "text": "10.2 might be a nice reading early.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.14,
    "end": 1486.661,
    "text": "It summarizes chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.661,
    "end": 1488.602,
    "text": "Summarizing chapter 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.922,
    "end": 1492.623,
    "text": " Adaptive exchange, the high road and the low road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.283,
    "end": 1494.764,
    "text": "Chapter two, the low road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.405,
    "end": 1503.97,
    "text": "Bayesian inference and generative models that can be inverted and heuristics thereof, as well as decompositions associated with those heuristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.071,
    "end": 1518.719,
    "text": "Chapter three, the high road, starting from the deflationary imperative to preserve integrity and avoid dissipation, which we may have a more sophisticated realization of in the Bayesian physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.331,
    "end": 1528.272,
    "text": " Chapter five, neurobiology, the most well-studied cases and systems of interest for many.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.913,
    "end": 1541.735,
    "text": "Cortical, subcortical, motor architectures supporting the integrative work, pointing to empirical examples on neurotransmitters, composability of neural systems, artificial systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.076,
    "end": 1545.016,
    "text": "That's part one of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.096,
    "end": 1546.956,
    "text": "Chapter six heads into part two of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.976,
    "end": 1550.177,
    "text": "There's a recipe for designing systems seven and eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.408,
    "end": 1556.47,
    "text": " are currently summarized as just the continuous and discrete time settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.37,
    "end": 1568.875,
    "text": "And chapter nine talks about model-based data analysis in terms of parametric recovery of an individual's generative model in the context of meta-Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.156,
    "end": 1571.856,
    "text": "Connecting the dots, 10.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.537,
    "end": 1575.578,
    "text": "Dennett and the whole iguana.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.497,
    "end": 1604.585,
    "text": " guess usually we would say what the whole enchilada but that's not sentient enough so dennett was out there um it's a whole cognitive iguana it's a metabasian iguana we're imagining that we're building the whole iguana but we don't no one's actually built the whole iguana but also this is so representative how like threads of research just serve to be like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.047,
    "end": 1609.171,
    "text": " It's like spark after spark with no fire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.573,
    "end": 1611.855,
    "text": "What is it like to be a bat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.716,
    "end": 1618.985,
    "text": "Spawned tens of thousands of directions from 1954.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.127,
    "end": 1622.75,
    "text": "But where can you go find what it's like to be a bat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.869,
    "end": 1645.321,
    "text": " oh that's right it's still the exact same speculation that existed in 1954 which is if you had the motor apparatus and the evolutionary heritage of being a bat then you'd know what it was like and it'd be whatever it is it is like like but if you're not you're not and so you don't know and i don't know if anyone has actually pierced that veil",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.734,
    "end": 1666.06,
    "text": " so at least it reflects following up diligently or more diligently on provocations from our philosopher colleagues eric yeah i'm sorry this is just a digression you sent me on uh well maybe the metaverse will tell us because then you can have your virtual reality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.199,
    "end": 1693.922,
    "text": " environment that gives you only the abilities the sensory abilities and motor abilities of a bat and you live in that for a week and you learn really what a bat you know how to think like a bat what a bat can do can't do um i don't know just just sorry about that you no no you started it that's what i think is the brain machine interface like where it literally you'd rewire your brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.867,
    "end": 1715.06,
    "text": " to feel it yeah and then then we'd know but you'd have to recover that too so there's like a difficulty of like bringing that sensory experience back to the human brain i don't all right well yeah might be a no cloning theorem sort of situation there all right this is a close enough approach i'm gonna",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1715.814,
    "end": 1718.115,
    "text": " I'm going to advertise a piece of work I did many years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1718.175,
    "end": 1720.576,
    "text": "It's called The Consciousness Machine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.916,
    "end": 1728.778,
    "text": "And it's an account for how to solve a hard problem of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.658,
    "end": 1734.7,
    "text": "The hard problem being, why do we have consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.74,
    "end": 1735.32,
    "text": "How does it work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.34,
    "end": 1736.781,
    "text": "How does the brain produce it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.181,
    "end": 1740.062,
    "text": "But your own subjective experience of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.167,
    "end": 1746.429,
    "text": " is the mystery that it's hard to penetrate through pure science and explanations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.829,
    "end": 1747.67,
    "text": "So how do you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.99,
    "end": 1750.691,
    "text": "You have to have a user experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.791,
    "end": 1757.894,
    "text": "You basically have to make a cross between a video game and a simulation of your own mind, the mind of the user.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.634,
    "end": 1760.935,
    "text": "And in that environment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1761.633,
    "end": 1772.696,
    "text": " then you can not only see intellectually, well, how is my brain working, but you can feel it, experience it, and make it real to yourself in the feedback sort of sense, the motor feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.197,
    "end": 1784.4,
    "text": "And so once we have a consciousness machine, which we don't know how to build yet, but we're getting closer, and all the VR technology is an enabler for that, then we'll be able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.293,
    "end": 1806.091,
    "text": " to um you know transform our conscious experience in various ways including uh becoming bats or ants or or whatever by learning to live those kind of lives in certain contexts it's on my website awesome",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.097,
    "end": 1835.84,
    "text": " short on that somebody will always say well you're not a bat you're a person thinking you're a bat but that's where you go to the meta turing test which is now you're in the metaverse can you tell the difference between the true bat and the person thinking that they're about now if you can't design a setting to differentiate it from the functional ecological pragmatic view",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.512,
    "end": 1842.033,
    "text": " It's as bat-like in the metaverse space as you can get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.394,
    "end": 1858.598,
    "text": "So yeah, I mean, Act-Inf in the metaverse and Internet of Things and the way that we can even just today qualitatively talk about cyber-physical systems, composability, intelligence augmentation, distributed cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.179,
    "end": 1863.3,
    "text": "These are all so valuable and they are not...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.448,
    "end": 1874.402,
    "text": " Features that come from some of the competitors that we're going to be discussing today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.946,
    "end": 1877.186,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.647,
    "end": 1878.949,
    "text": "The whole iguana thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.04,
    "end": 1905.481,
    "text": " some connections to analyses of cognition and generalized challenges in cognitive systems like exploration exploitation we talked earlier about how the planning mediated resolution of explore exploit was not quite that but certainly other papers do actually carry that out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.281,
    "end": 1933.399,
    "text": " that doesn't mean that they outperform any other given model but at least we know that we can frame explore exploit in single step and in multi-step scenarios with active um and active offers a means of understanding corresponding neural computations the connection between cognitive processing and expected neural dynamics was actually very very interestingly characterized in the recent live stream number 51.1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.441,
    "end": 1949.151,
    "text": " which I highly recommend because this could be the dam breaking between artificial neural networks and active inference POMDP models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.253,
    "end": 1952.834,
    "text": "So it's quite exciting to hear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.796,
    "end": 1961.66,
    "text": "We will explore in the rest of this chapter some implications for psychological functions as if we were sketching a psychology textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.639,
    "end": 1970.623,
    "text": " This is kind of like that Gertl Escher Bach style where it's like, am I going to end the book in the middle of the book and then fill it with filler?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.023,
    "end": 1972.403,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.684,
    "end": 1973.504,
    "text": "Has that already happened?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.604,
    "end": 1973.904,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.204,
    "end": 1976.205,
    "text": "Am I sketching a book or is this the book itself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.865,
    "end": 1977.366,
    "text": "It's up to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.266,
    "end": 1980.047,
    "text": "But that's just such a funny note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.864,
    "end": 2006.158,
    "text": " predictive brains bayesian brain predictive coding predictive processing architecture um these are popular frameworks in computational cognitive neurosciences yet also at a deeper level these predictive approaches",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.521,
    "end": 2019.51,
    "text": " still struggle for recognition among somehow default non-predictive approaches, like it always is needing to be justified in some people's eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.852,
    "end": 2031.56,
    "text": "Whereas Active Inference takes it several steps further, first by incorporating action over multiple timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.297,
    "end": 2047.343,
    "text": " although predictive processing via Andy Clark and others also was making directions in that way, but in a less quantitative way, and also introduces this variational physics grounding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.264,
    "end": 2059.729,
    "text": "Like 4E cognition plus predictive processing with inference and action, simply smashing those two together in your theory collider",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.731,
    "end": 2069.16,
    "text": " would never reveal that classical statistical thermodynamic and quantum mechanics can be understood as special cases of a cognitive physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.936,
    "end": 2097.016,
    "text": " that's sort of this like third vector that is exceptionally technical but does more than or makes active inference more than merely for e-cognition plus predictive processing as qualitative syntheses with a tractable implementation approach in the pomdp for example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.977,
    "end": 2101.658,
    "text": " Perception and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.679,
    "end": 2119.072,
    "text": "We've talked about how there are similar inferential processes playing out over different timescales, and that maps to some biologically plausible physiological updates in terms of synaptic plasticity for learning and neural firing rates for perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.161,
    "end": 2133.216,
    "text": " And it's a very strong mapping indeed, because the imperative in terms of the loss function of the neural network being trained includes the firing and the plasticity term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.758,
    "end": 2147.702,
    "text": " And that actually brings a very strong synthesis between the loss function in the neural networks training and the variational free energy descent in the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.982,
    "end": 2151.243,
    "text": "So figure one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.763,
    "end": 2180.679,
    "text": " in isomera at all and the loss function on a neural network as a function of observations and parameterization is concordant with the variational free energy in terms of observations and parameterizations and we can model one interesting piece here i know this is not the textbook itself but this fictive causality causality is like the opposite of the expected free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.659,
    "end": 2185.661,
    "text": " So it's almost like variational free energy is the now casting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.861,
    "end": 2195.886,
    "text": "Expected free energy is anticipated decision-making and fictive causality is looking only at the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.187,
    "end": 2206.852,
    "text": "And it has a computational implementation in terms of a risk variable and a neuromodulatory interpretation with respect to dopamine modulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.093,
    "end": 2208.233,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2209.122,
    "end": 2211.904,
    "text": " Very interesting and tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.125,
    "end": 2217.068,
    "text": "Bayesian brain, I don't know what more can be said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.648,
    "end": 2220.13,
    "text": "It's about time that the Bayesian brain got formal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.371,
    "end": 2237.342,
    "text": "But there's a lot of prose on the Bayesian brain and a lot of reprinting of the Bayes equation, but not much in the way of meaningful contributions beyond that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.074,
    "end": 2246.578,
    "text": " And where there are meaningful contributions, they're not carried out in the spirit of the unified sentient behavioral model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.298,
    "end": 2252.802,
    "text": "It's just like, oh, this brain region can be understood as doing prior updating on this inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2253.762,
    "end": 2266.45,
    "text": "So it's using Bayesian framework, Bayesian statistics to describe neurophysiology, but that is unless super intentionally otherwise on the scruffy end of the spectrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.981,
    "end": 2274.05,
    "text": " Whereas Act Dymph is like coming from the neat end of the spectrum and connecting some of those scruffy findings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.052,
    "end": 2276.333,
    "text": "Action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.454,
    "end": 2282.001,
    "text": "Both action processing and perceptual processing are guided by forward predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.167,
    "end": 2306.526,
    "text": " many contact points with various motor embodied embedded perspectives that we've discussed ecological psychology affordances cups are for grasping change the world change your mind we're talking about action the consequences of past action what to do now planning in the future the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.238,
    "end": 2310.399,
    "text": " Idea motor theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.819,
    "end": 2315.304,
    "text": "That's an interesting thread with William James and beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.726,
    "end": 2322.012,
    "text": "And it is about connecting ideas with behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.954,
    "end": 2326.277,
    "text": "That is getting formalized here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.061,
    "end": 2338.503,
    "text": " cybernetics, the TOTE as well as the OODA loop, Observe, Orient, Decide, Act, and the Test, Operate, Test, Exit model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.664,
    "end": 2344.265,
    "text": "And cybernetics brings in the concept of the goal-oriented teleos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.545,
    "end": 2357.408,
    "text": "And in certain cybernetics settings, that was operationalized further as perceptual control theory, which is that what is being bounded is surprise about perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.747,
    "end": 2379.871,
    "text": " Interestingly, and as Dr. Isamura described in our conversation, the Bayesian risk is calculated about uncertainty on hidden states, which allows the Bayesian risk to be fit monotonically and with a heuristic approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.731,
    "end": 2386.372,
    "text": "And in doing so, prevents overfitting of observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.984,
    "end": 2398.607,
    "text": " So in the fully observable chessboard situation, of course, observations and hidden states are one and the same, and the A matrix is just an identity matrix, mixing our metaphors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.467,
    "end": 2416.173,
    "text": "Whereas when there's uncertainty between the hidden state and the outcome, one may be down a fallacious cul-de-sac if they overfit on the observations, because there might be like a many-many mapping or a stochastic mapping between hidden states and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.733,
    "end": 2417.073,
    "text": "However,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.169,
    "end": 2442.942,
    "text": " under an appropriately structured partition the particular partition in particular one may fit a central tendency and variance attribute on an unobserved state and by doing so resists overfitting categorically to outcomes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.517,
    "end": 2450.622,
    "text": " and also enables fitting of large or sparse data sets of observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.727,
    "end": 2468.898,
    "text": "Optimal control theory discussed in various previous live streams and cases on how our inverse and forward control theoretic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.037,
    "end": 2481.079,
    "text": " In the control theory ontology, how does it map to the way that we talk about message passing and active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.7,
    "end": 2496.883,
    "text": "General key point, the cost or value function is a special case or part of the decomposition of a variational or expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.763,
    "end": 2501.404,
    "text": "However, we're not shoehorning everything into cost or value function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.605,
    "end": 2513.328,
    "text": " However, again, components or special scenarios of the free energy can be understood to have a pragmatic value-like or a cost-like component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.989,
    "end": 2516.469,
    "text": "Utility and decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.09,
    "end": 2521.731,
    "text": "Dynamic programming and the Bellman work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.492,
    "end": 2529.834,
    "text": "Some of these ad hoc bonuses, novelty bonus, intrinsic reward, and so on,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.905,
    "end": 2541.79,
    "text": " are being approached in a first principles way through unified imperatives like the expected and variational free energy, which can be decomposed into pragmatic and epistemic components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.192,
    "end": 2547.833,
    "text": "So, whence utility?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.093,
    "end": 2549.874,
    "text": "Oh utility, where art thy sting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.634,
    "end": 2553.616,
    "text": "How am I going to get utility by learning about active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.011,
    "end": 2567.114,
    "text": " Bayesian decision-making coming closer from the cybernetic and utilitarian decision-making space into specifically the Bayesian brain and Bayesian decision-making space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.874,
    "end": 2571.735,
    "text": "This bears very, very heavily on the complete class theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.535,
    "end": 2585.519,
    "text": "And so Ali, thanks a lot for raising this in the preparations for 51, because the Bayesian beliefs can be framed in terms of willingness to bet,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.877,
    "end": 2611.85,
    "text": " willingness to pay but importantly from the complete class theorem perspective as basically like an action ability and the specific set of strategies that they are interested in and restrict their analysis to are the admissible decision rules which means that that decision rule is as good as other decision rules everywhere or at least somewhere",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.881,
    "end": 2640.365,
    "text": " So by staying in subspaces of admissible rules, one has strategies that are in some way functional, meaning more functional than alternatives, which is very interesting because that is still a large space with many bizarre strategies, some of which are very fragile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.653,
    "end": 2651.655,
    "text": " but their admissibility is a constraint that is equivalent to saying that the calculation of perception is going to be Bayes optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.455,
    "end": 2663.917,
    "text": "Like there's some signal input for which the Kalman filter of time horizon three, seven, 11 is going to be the Bayes optimal solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.417,
    "end": 2670.418,
    "text": "Or for whatever length of Kalman filter or Bayesian filtering approach you're taking, you can calculate it Bayes optimally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.394,
    "end": 2672.555,
    "text": " And that's in the inference space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.575,
    "end": 2677.259,
    "text": "And then analogously, we can think about the admissible strategies in the strategy space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.661,
    "end": 2686.486,
    "text": "Reinforcement learning addressed, but subtle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.629,
    "end": 2698.815,
    "text": "Reinforcement and reward are decompositions of expected and variational free energies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.835,
    "end": 2698.895,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.702,
    "end": 2725.352,
    "text": " so it's not that we don't reinforce high value behaviors it's just that the model architecture is quite distinct they then go into these families of rl model free reinforcement learning model based and policy gradient some similarities and differences with all of these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.448,
    "end": 2736.152,
    "text": " Planning is inference, which we may or may not have seen in the book, depending on how you think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.676,
    "end": 2760.431,
    "text": "But the key point is that as future outcomes haven't happened, even hypothetically, one has to take a different approach towards planning and the consequences of hypothesized consequences of potential actions or policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.216,
    "end": 2774.361,
    "text": " It's a slightly different topic or question than inferring the relationship between actions taken in the world and the consequences on how things change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.383,
    "end": 2789.428,
    "text": "And it actually is captured very interestingly again with the fictive causality, which can be understood as like a retrospective learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.66,
    "end": 2817.015,
    "text": " from just starting with the first data point, already you're in the game, but starting from even the first round and then accumulating through training, learning the relationship of actions and transitions in the world and allowing reevaluation thereof, because some actions have delayed consequences and so on, learning that in an open-ended way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.973,
    "end": 2824.897,
    "text": " while actions truly do have consequence in the real world, in the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.799,
    "end": 2832.362,
    "text": "So active inference takes a unique approach for planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2833.642,
    "end": 2835.183,
    "text": "First, we use variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.804,
    "end": 2837.765,
    "text": "Second, it's model-based planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.345,
    "end": 2846.871,
    "text": "Third, we use an integrated expected free energy functional that subsumes other schemes like KL optimal control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.215,
    "end": 2876.817,
    "text": " so at worst it should fit these other schemes as well as they do I'll be it with some computational overhead at best we should strictly be better behavior and bounded rationality Cicero bounded rationality in free energy interestingly free energy theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.024,
    "end": 2882.165,
    "text": " More of the psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.645,
    "end": 2884.107,
    "text": "Valence, emotion, motivation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.948,
    "end": 2886.349,
    "text": "Dante.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.132,
    "end": 2892.714,
    "text": "Homeostasis, allostasis, interoceptive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.215,
    "end": 2897.758,
    "text": "We just completed 50.2 yesterday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.838,
    "end": 2900.32,
    "text": "Interoception as modeling, allostasis as control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.124,
    "end": 2905.325,
    "text": "This is an important area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.526,
    "end": 2909.408,
    "text": "And these models are fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.975,
    "end": 2914.997,
    "text": " Attention, salience, and epistemic dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.677,
    "end": 2922.783,
    "text": "So we saw kind of like utility oriented above with the bounded rationality and the reinforcement learning and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.823,
    "end": 2927.807,
    "text": "And now we're moving towards the epistemic components being addressed in a first principles way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.369,
    "end": 2931.45,
    "text": "Salience and attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.592,
    "end": 2937.675,
    "text": "Now into the structural learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.956,
    "end": 2941.378,
    "text": "Rule learning, causal inference, fast generalization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.146,
    "end": 2967.877,
    "text": " building on the bayes graph causal architectures and thinking about inference and inferring fast and slow meta learning active inference in other fields open directions active inference can be applied to other domains two domains social cultural dynamics and ml and robots",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.013,
    "end": 2999.868,
    "text": " social and cultural thinking through other minds the anticipating brain is not a scientist ecological cognitive processes birdsong which as we've discussed isn't also the communication example that people think it is it's an example of dyadically embodied pre-scripted monologue that's why it's called a duet for one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.172,
    "end": 3006.576,
    "text": " This is not open-ended symbolic message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.537,
    "end": 3016.224,
    "text": "So much, much more needs to come into play before we can say that we have active inference models of like improvising entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3016.344,
    "end": 3020.788,
    "text": "But some of the turn-taking architecture is adequate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.369,
    "end": 3028.995,
    "text": "And for example, these birds expect to hear a certain song, but we could use this model to say, well, we just expect there to be a conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.799,
    "end": 3032.939,
    "text": " we expect little dead air.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.58,
    "end": 3055.204,
    "text": "So we can use this mechanics to simulate the dynamics of turn-taking, but we need a different payload for the actual communication if we want those entities, those birds to be doing anything other than just saying what they already expect each other to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.403,
    "end": 3061.388,
    "text": " and in the machine and cumulative culture and all of these complexities, extended cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.309,
    "end": 3069.796,
    "text": "Machine learning and robotics, JF is the one to speak to on this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.497,
    "end": 3080.326,
    "text": "And it's really interesting with the cognitive robotics angle, how like it's helping get action fully into the loop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.616,
    "end": 3090.28,
    "text": " And by doing so, showing which aspects of the inference and action are embodied, embedded, and cultured, etc., etc., etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.901,
    "end": 3097.063,
    "text": "And we end with Lord of the Rings quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.824,
    "end": 3103.726,
    "text": "Perhaps referencing the One Ring on the cover of the textbook, perhaps not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.246,
    "end": 3133.184,
    "text": " they started by daring to be naive and ask whether it is possible to understand brain and behavior from first principles and brought active inference from off stage to address that question they hope expect and prefer that the reader has been convinced that the answer to the original question is yes it is possible to understand brain and behavior from first principles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.465,
    "end": 3141.787,
    "text": " The book is a useful compliment to philosophy and physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.807,
    "end": 3152.231,
    "text": "A Physics for Particular Systems, 2019 monograph, currently under contract at the same MIT Press.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.251,
    "end": 3163.556,
    "text": "And speculatively, we can say that this will be the active inference textbook, and there is forthcoming a physics textbook that will be more about the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.229,
    "end": 3167.391,
    "text": " The journey ends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.217,
    "end": 3172.078,
    "text": "It was an introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.261,
    "end": 3176.144,
    "text": "You can't just learn it in theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.467,
    "end": 3180.01,
    "text": "In theoretical neurobiology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.653,
    "end": 3186.434,
    "text": " You have to get your hands on the models and their misbehaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.294,
    "end": 3195.876,
    "text": "So like the classic Turing quip, when someone said, how can computers be creative when they only put out what we put in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.736,
    "end": 3198.757,
    "text": "They never surprise us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.017,
    "end": 3201.017,
    "text": "We're just getting what we put in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.637,
    "end": 3202.317,
    "text": "We hear that today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.337,
    "end": 3205.418,
    "text": "And Turing said, I'm surprised by computers every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.454,
    "end": 3215.399,
    "text": " Whether or not you're going to be modeling computationally, you may reflect on it day to day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.58,
    "end": 3217.861,
    "text": "It might be about where you look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.882,
    "end": 3220.203,
    "text": "It might be about where you lick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.284,
    "end": 3222.485,
    "text": "It might be about what you do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.086,
    "end": 3228.79,
    "text": "Ultimately, we are confident that you will continue to pursue active inference in some form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.674,
    "end": 3238.597,
    "text": "Bravo to those who stay through the cohort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.667,
    "end": 3241.949,
    "text": " Do you have any last thoughts for today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.659,
    "end": 3254.859,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.0,
    "end": 3256.361,
    "text": "Well, excellent reading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3256.521,
    "end": 3258.222,
    "text": "Thank you for going through it in such detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.242,
    "end": 3260.264,
    "text": "That's a great summary of your part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.637,
    "end": 3287.213,
    "text": " trying to you know balance the um the epistemic and the pragmatic which is to say the comedic value um we'll talk again about chapter 10 maybe go into a few more details and then probably highlight projects and the ways that we can return in 2023 for cohort three",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.072,
    "end": 3317.152,
    "text": " with something like a cleaner slate as we welcome the next set of people in we accreted a lot we got all the equations in we got all the figures in all the boxes are in now we have the the actual task laid out in terms of the space so we'll be ready to proceed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.738,
    "end": 3326.014,
    "text": " All right, going to finish the recording now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.174,
    "end": 3326.696,
    "text": "Thank you guys.",
    "speaker": "SPEAKER_00"
  }
]