[
  {
    "start": 8.254,
    "end": 9.435,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.175,
    "end": 21.901,
    "text": "It is October 12th, 2023, and we are in the final lecture, session six in physics is information processing with Chris Fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.961,
    "end": 24.522,
    "text": "So Chris, thank you for this journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.103,
    "end": 32.967,
    "text": "Exciting to get to this final lecture, which will be followed only by the last discussion for this go around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.007,
    "end": 34.027,
    "text": "So it's really awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.167,
    "end": 35.588,
    "text": "And to you for this lecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.414,
    "end": 47.117,
    "text": " Thank you, Daniel, and welcome everyone to this last session that I'll be doing with a focus on biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.958,
    "end": 67.464,
    "text": "And just to give a brief review, as usual, we've focused in this course on generic quantum systems, by which I mean just any quantum system that has some number of degrees of freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.647,
    "end": 86.57,
    "text": " And we really haven't made any assumptions about these systems other than the assumption that both interacting partners have sufficient degrees of freedom that they can be considered separable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.871,
    "end": 94.612,
    "text": "So their boundary is small with respect to the total size of each of the interacting systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.172,
    "end": 104.778,
    "text": " And I want to emphasize again that the approach we've taken is completely topological, so we haven't assumed anything about embedding in space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.059,
    "end": 113.104,
    "text": "And as we've characterized these systems, we focused really on two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.325,
    "end": 120.569,
    "text": "One, the amount of information that the two systems can exchange.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.793,
    "end": 125.794,
    "text": " And that amount is determined by the size of their boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.194,
    "end": 131.976,
    "text": "It's determined by this number N, which is the Hilbert space dimension of the boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.656,
    "end": 143.699,
    "text": "And as we've discussed now in several of the sessions, we can think of this boundary as a collection of N qubits via which the two systems A and B communicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 145.299,
    "end": 150.761,
    "text": "The other feature of the interaction on which we focused",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.589,
    "end": 161.092,
    "text": " is the reference frames that are used by the two systems to interact with this set of qubits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.352,
    "end": 177.697,
    "text": "And it's these reference frames that assign the information that flows between A and B meaning or functional significance or actionability or however you want to refer to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.566,
    "end": 187.192,
    "text": " the idea that when a system gets some information, it does something useful with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.893,
    "end": 195.118,
    "text": "So those are very generic kinds of ways of characterizing an interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.66,
    "end": 206.228,
    "text": "You can think of it as a qualitative characterization, the semantics of the information, and a quantitative characterization, the amount of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.165,
    "end": 211.629,
    "text": " But other than that, we've left the nature of these systems open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.23,
    "end": 230.323,
    "text": "And this characterization allowed us to reformulate the free energy principle in quantum information theoretic terms as the principle that interacting systems behave in a way that will asymptotically align their reference frames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.644,
    "end": 232.405,
    "text": "And we saw that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.942,
    "end": 237.984,
    "text": " full alignment of reference frames is equivalent to entanglement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.965,
    "end": 249.37,
    "text": "So the FEP drives systems toward entanglement, which is not surprising because that's what happens to generic quantum systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.45,
    "end": 254.593,
    "text": "They may start out separable, but if they interact long enough, they'll become entangled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.953,
    "end": 263.077,
    "text": "So we've had a discussion that is really very generic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.502,
    "end": 276.528,
    "text": " Now, we showed a couple of sessions ago that under these very generic assumptions, we got some interesting outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.589,
    "end": 290.457,
    "text": "And one is that if systems have sufficient degrees of freedom, under the action of the FEP, they will be driven toward making",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 292.563,
    "end": 300.389,
    "text": " a diverse set of measurements of their environment because they're trying to get information about it so that they can predict what it's going to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.01,
    "end": 311.258,
    "text": "And that as they add ways of making measurements, they'll come up against non-commutativity of their measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.398,
    "end": 320.625,
    "text": "And this may be due to intrinsic mathematical facts about their measurements, and it may just be due to their limited supply of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.208,
    "end": 334.971,
    "text": " So either way, what this induces is compartmentalization and the requirement for internal classical communication on internal boundaries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.291,
    "end": 347.934,
    "text": "So I just wanted to reemphasize that this is a result of basic physics, and we see compartmentalization, of course, ubiquitously in biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 350.209,
    "end": 364.434,
    "text": " But this suggests to us that features of biology that are very familiar actually follow from fairly deep physics, and compartmentalization is one of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.755,
    "end": 373.577,
    "text": "We then talked last time about space and time and the computational requirements",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.748,
    "end": 385.455,
    "text": " on any system that is able to perceive an external clock or perceive an external spatial layout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.716,
    "end": 393.62,
    "text": "And we discussed these from a very kind of developmental psychology point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.641,
    "end": 398.324,
    "text": "We discussed it using essentially the kinds of terms on the right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.426,
    "end": 414.033,
    "text": " as opposed to the kind of language that's much more technical and mathematical that's used in physics to derive spacetime as emergent from information transactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.555,
    "end": 425.099,
    "text": "But we at least hypothesize that both of these are ways of getting to the same sense of emergent spacetime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.377,
    "end": 444.522,
    "text": " And one important outcome of this discussion was that systems can perceive external clocks, so external periodic behavior, with fewer computational resources, so before they're able to perceive spatial layouts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.682,
    "end": 447.723,
    "text": "And we'll get back to this later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.663,
    "end": 455.565,
    "text": "So organisms and maybe other complex systems seem to manage",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.596,
    "end": 463.318,
    "text": " a collection of capabilities that are all mutually dependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.719,
    "end": 473.882,
    "text": "So memory depends on having layouts of persistent things that can be distinguished.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.743,
    "end": 480.504,
    "text": "So it depends on space, and it certainly depends on time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.577,
    "end": 488.019,
    "text": " Space gives structure to persistent objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.899,
    "end": 492.521,
    "text": "Memory allows you to identify persistent objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.902,
    "end": 500.106,
    "text": "And objects, in turn, give structure to space by being located in different places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.246,
    "end": 513.213,
    "text": "And objects enable the fundamental requirement for memory, which is some form of error correction, so that one has enough redundancy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.321,
    "end": 519.382,
    "text": " in the memory to check to see whether a memory has been degraded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.963,
    "end": 537.487,
    "text": "So organisms seem to manage a physically very important process, which is the use of space-time and memory as a basis for cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.368,
    "end": 543.329,
    "text": "You'll recognize these four functions that are mutually interdependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.25,
    "end": 547.451,
    "text": " as underlying complex cognition across the board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.871,
    "end": 553.653,
    "text": "And you can't really do complex cognition unless you have these capabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.214,
    "end": 571.518,
    "text": "So today we're going to put some of these things together in a discussion of biology and end by looking forward to future directions, not just in biology, but in all of quantum information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.47,
    "end": 588.155,
    "text": " So let's talk about biological systems, living systems, which of course includes us, but also includes all other organisms and communities of organisms and so forth at multiple scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.735,
    "end": 601.439,
    "text": "And I want to put forward a fairly radical hypothesis that living systems are just generic quantum systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.213,
    "end": 607.275,
    "text": " that the FEP has driven to a high level of computational complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.556,
    "end": 611.077,
    "text": "So what does this really say?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.438,
    "end": 625.824,
    "text": "It suggests that living systems are just quantum systems that have enough degrees of freedom and a sufficiently complicated internal dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.316,
    "end": 647.041,
    "text": " that the FEP, by requiring them to predict what their environment is going to do next, has driven them to make complicated measurements and complicated inferences on the basis of those measurements that enable fairly complicated actions on the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.921,
    "end": 655.983,
    "text": "So these are systems that you would characterize as computers, essentially, information processing systems,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.909,
    "end": 659.87,
    "text": " with a high degree of computational capability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.11,
    "end": 673.735,
    "text": "Now this is clearly as much a philosophical hypothesis as an empirical hypothesis, and that's due in part to the fact that we don't really have a good definition of what a living system is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 674.735,
    "end": 679.477,
    "text": "We can just point and say that's a living system and that thing over there isn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.312,
    "end": 683.335,
    "text": " But beyond that, we don't have much of the theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 684.136,
    "end": 688.062,
    "text": "And of course, people have worked on a theory of what is life for decades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.787,
    "end": 692.249,
    "text": "But there's not a lot of agreement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.915,
    "end": 711.319,
    "text": " And so this is, in a sense, a definitional kind of hypothesis, and we test such kinds of hypotheses by seeing if they're useful conceptually to help us understand what living systems are doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 712.895,
    "end": 723.842,
    "text": " Now, as soon as we put forward something like this, inevitably the question comes up, are living systems really quantum systems, or are they classical in some intrinsic sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.037,
    "end": 729.159,
    "text": " This question is really an artifact of two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.5,
    "end": 738.988,
    "text": "One, the continuing association between quantum systems and microscopic systems, which is, of course, traditional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.248,
    "end": 743.652,
    "text": "Quantum theory was developed to deal with microscopic phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.692,
    "end": 744.793,
    "text": "It was first tested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.219,
    "end": 748.2,
    "text": " is the theory of microscopic phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.88,
    "end": 757.204,
    "text": "And it's only in the past couple of decades that quantum theory is being applied to big things, to cosmology, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.964,
    "end": 774.211,
    "text": "So there's a long tradition of association between quantum and microscopic, and living systems are mesoscopic, much bigger than atoms, bigger than molecules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.64,
    "end": 780.042,
    "text": " So, and they're not nearly as big as cosmological systems, so they're somewhere in between.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.842,
    "end": 783.984,
    "text": "And those systems have traditionally been regarded as classical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.124,
    "end": 791.767,
    "text": "And even chemistry, even biochemistry is still taught in a very classical way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 792.687,
    "end": 795.989,
    "text": "So we're not used to thinking of these things as quantum systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.209,
    "end": 800.691,
    "text": "But at least in the approach we've taken in this course,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.317,
    "end": 813.423,
    "text": " All physical systems are quantum systems, and classical information exists only on boundaries, only on boundaries between systems, and it only describes their interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.364,
    "end": 825.031,
    "text": "And I want to emphasize, I've said it before, but since this is the last class, I want to say it again, that this is not a universally held view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 829.005,
    "end": 840.087,
    "text": " It's a view that's becoming more common, and I think a generation from now it will probably be the dominant view of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 841.388,
    "end": 847.269,
    "text": "But it's not fair to say that it's the dominant view now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.509,
    "end": 854.49,
    "text": "It's, I think, quite fair to say that it's a view on the rise, especially in the quantum information and quantum gravity communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.038,
    "end": 861.102,
    "text": " But from a strict empirical perspective, we know a number of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.243,
    "end": 868.048,
    "text": "We know that accurate molecular dynamics calculations require quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.829,
    "end": 878.316,
    "text": "We know that a lot of biologically important molecular processes use quantum coherence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.297,
    "end": 885.642,
    "text": "We know that things like hydrogen bonding can only be understood using quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.738,
    "end": 905.172,
    "text": " We know that cellular free energy budgets are way too small to support fully classical information processing if we think of information processing in terms of what proteins are doing or what other molecules are doing in terms of changing shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.954,
    "end": 913.339,
    "text": "We know that shape changes in proteins and other molecules underlie all cellular information processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.232,
    "end": 922.599,
    "text": " So if we think of them as actually implementing cellular information processing, we have way more information processing than could be funded classically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.16,
    "end": 928.123,
    "text": "And finally, we know that human cognition exhibits contextuality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.524,
    "end": 932.147,
    "text": "So human cognition uses quantum coherence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.287,
    "end": 937.371,
    "text": "It's not a classical causal process in all cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.104,
    "end": 941.766,
    "text": " But this is still a very nascent field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.867,
    "end": 945.349,
    "text": "And it's a field with a lot of potential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.429,
    "end": 960.201,
    "text": "And I think, again, a generation from now, quantum biology is going to be regarded as a very mainstream endeavor, even though it's something of a small emerging field now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.663,
    "end": 966.146,
    "text": "And I'll just show you one picture in support of this third point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.396,
    "end": 996.85,
    "text": " This is a plot of measured free energy usage converted to numbers of bits processed at one kilohertz for a number of prokaryotic and eukaryotic cells, all that I could find a few years ago that had good caliometric measurements, versus the log of their area, their membrane surface area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.414,
    "end": 1008.577,
    "text": " And the thing to note here is that these cells are processing classical information at pretty low rates, kilohertz to gigahertz rates for a thousand bits at a time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.552,
    "end": 1015.077,
    "text": " And we know that a lot more is happening in cells than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.118,
    "end": 1021.603,
    "text": "Cells have many more than 1,000 proteins, and those proteins are all moving all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.744,
    "end": 1035.557,
    "text": "And if that motion is processing information, then there's not nearly enough thermodynamic power to power all of that information processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.433,
    "end": 1048.436,
    "text": " So let's now talk a little bit about life and living systems and what they look like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.077,
    "end": 1054.978,
    "text": "Here's a view of living systems from the point of view of genome diversity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1055.078,
    "end": 1058.559,
    "text": "This is a few years old, so it's out of date by now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1059.42,
    "end": 1061.6,
    "text": "But it tells us a lot qualitatively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.392,
    "end": 1082.145,
    "text": " It tells us that almost all genome diversity is microbial, that the sorts of organisms that we're familiar with, medium-sized organisms like us, animals and plants, have only a tiny amount of genome diversity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.345,
    "end": 1085.388,
    "text": "So we think of ourselves as pretty diverse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.508,
    "end": 1090.972,
    "text": "We think of ourselves as quite different from other animals, from flies or worms or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.823,
    "end": 1094.305,
    "text": " sponges or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.885,
    "end": 1097.828,
    "text": "But in fact, we're not all that different from them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.348,
    "end": 1101.571,
    "text": "We share many, many proteins with all of those other organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.711,
    "end": 1104.894,
    "text": "We share the same cellular organization and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.035,
    "end": 1108.557,
    "text": "We're not, in fact, all that different from plants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.118,
    "end": 1114.582,
    "text": "And we're much more similar to the fungi than to the plants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.164,
    "end": 1116.304,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.697,
    "end": 1124.563,
    "text": " We get a very biased view of genome diversity when we just look at familiar large types of living systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.005,
    "end": 1130.208,
    "text": "Most genome diversity is buried down there in the microbial world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.45,
    "end": 1139.096,
    "text": "This isn't the only way we can look at life as a diverse set of organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.997,
    "end": 1143.0,
    "text": "We can also look at it in terms of a cell lineage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.764,
    "end": 1157.148,
    "text": " The fact that we're all related at the DNA level tells us that we're all descendants of a common ancestor, which is usually called LUCA, the last universal common ancestor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.888,
    "end": 1171.472,
    "text": "And LUCA is generally modeled as being a cell, more or less like a bacterial cell, so fairly simple, with not very many pathways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.448,
    "end": 1174.169,
    "text": " with maybe a DNA genome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.789,
    "end": 1183.093,
    "text": "And if LUCA didn't have one, then they arose fairly shortly thereafter because all organisms that we know of have DNA genomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.813,
    "end": 1194.778,
    "text": "But the point of looking at life as a lineage is that we get a diagram that looks very much like the cell lineage",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.058,
    "end": 1204.421,
    "text": " from an embryological situation, much like the cell lineage of our own body is growing from a fertilized egg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.302,
    "end": 1225.008,
    "text": "And in particular, looking at life as a lineage shows us that not only do we share DNA with all other organisms, we actually share a membrane, a cytoplasm that's continuous in time all the way back to Leuco.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.206,
    "end": 1230.729,
    "text": " and so continuous in time between us and bacteria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.149,
    "end": 1248.099,
    "text": "So if you look at life this way, you realize that life is in a sense all one organism, all one connected structure that's developed over time through division, cell division.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.358,
    "end": 1261.423,
    "text": " And so we're very closely related to all other parts of life in the same way that different cells in our bodies are closely related to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.043,
    "end": 1263.344,
    "text": "The time spans just longer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.424,
    "end": 1270.887,
    "text": "I mean, here the time spans three and a half or four billion years between us and Luca.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.748,
    "end": 1277.292,
    "text": " These lineages have been diverging for that long, but they're still continuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.812,
    "end": 1282.976,
    "text": "And in particular, they form a continuous cell membrane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1284.477,
    "end": 1294.865,
    "text": "So when we think of life in this way, we realize that we're reasoning from just one example when we think about terrestrial life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.066,
    "end": 1301.831,
    "text": "And this strongly limits what we can say about living systems, what we can say about biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.927,
    "end": 1310.253,
    "text": " that we really only have one example, the lineage that descends from LUCA here on Earth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1311.454,
    "end": 1326.525,
    "text": "And at some point we may have more examples, and there's certainly groups working on artificial organisms that aren't part of this lineage, that are constructed from parts derived from this lineage, but aren't members of this lineage themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.946,
    "end": 1329.928,
    "text": "And that may tell us something new about life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.462,
    "end": 1345.592,
    "text": " But if we think of life this way, we see something very important, which is that as life grows, its boundary gets bigger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.993,
    "end": 1358.642,
    "text": "And since the boundary of a system constitutes its informational environment, its dimension getting bigger,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.6,
    "end": 1368.082,
    "text": " means that more information flows into it from its environment, and more information flows out of it into its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.383,
    "end": 1380.286,
    "text": "So as life develops from LUCA, it gets a larger and larger informational environment, and this dimension of its boundary grows and grows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.466,
    "end": 1387.288,
    "text": "Now what that means, if you go back to our original picture of two interacting systems,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.473,
    "end": 1393.275,
    "text": " is that the number of the dimensionality of the physical environment is decreasing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.256,
    "end": 1398.737,
    "text": "And we think of the physical environment as increasing in size.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.817,
    "end": 1400.818,
    "text": "We have the expanding universe and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.639,
    "end": 1403.78,
    "text": "But what's increasing in size is space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.3,
    "end": 1413.324,
    "text": "And if space is emergent, then that increase is not a real increase in degrees of freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1413.904,
    "end": 1415.445,
    "text": "What we're really interested in is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.718,
    "end": 1422.143,
    "text": " the Hilbert space of the physical environment as distinct from the Hilbert space of life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.624,
    "end": 1430.711,
    "text": "And as life gets bigger, it literally, quite literally, eats the physical environment and turns it into more life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.271,
    "end": 1433.494,
    "text": "So there's less physical environment around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.195,
    "end": 1440.52,
    "text": "So the trajectory of life is toward a bigger informational environment and a smaller physical environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.516,
    "end": 1446.159,
    "text": " And as the physical environment gets smaller, you might imagine it gets easier to predict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.999,
    "end": 1454.924,
    "text": "And as the informational environment gets bigger, you have more information with which to predict the behavior of the physical environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.224,
    "end": 1459.306,
    "text": "So this all hangs together very nicely with the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.035,
    "end": 1463.056,
    "text": " Here's another picture of this same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.757,
    "end": 1483.164,
    "text": "If we start with some boundary here on the left labeled B around some system labeled S, and it's embedded in an environment E, then as S makes copies of itself through some process like cell division,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.54,
    "end": 1495.665,
    "text": " then it starts to fill up more of E. It's actually converting degrees of freedom of E into degrees of freedom of its copies that it's made of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.206,
    "end": 1510.932,
    "text": "And if we think of some larger boundary drawn somewhere in E, here on the right side, I've labeled that B prime, what happens is that B prime gets slowly filled up with copies of S,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.389,
    "end": 1514.87,
    "text": " And it starts to look like a large organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.47,
    "end": 1519.311,
    "text": "And that's what life is doing in the physical environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.611,
    "end": 1527.253,
    "text": "It's making a bigger boundary for itself at the expense of degrees of freedom of its physical environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.813,
    "end": 1531.734,
    "text": "So we can ask, what drives this process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.174,
    "end": 1534.334,
    "text": "Why is life doing this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.454,
    "end": 1536.475,
    "text": "Why is it making copies of itself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.115,
    "end": 1544.477,
    "text": " And the answer to that question, at least one answer to that question, is the free energy principle drives it to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.178,
    "end": 1558.822,
    "text": "And I'll just show you some simulations from several years ago of a cell population in this upper left panel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.342,
    "end": 1562.203,
    "text": "The green cells are stem cells that divide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.863,
    "end": 1571.224,
    "text": " And they've been embedded in an environment that's safe on the left side and 100% lethal on the right side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.085,
    "end": 1580.466,
    "text": "So they're embedded in an environment that's conducive to life on one side and very dangerous as you get toward the middle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.467,
    "end": 1589.308,
    "text": "And the purpose of these simulations was to study what happens",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.486,
    "end": 1616.976,
    "text": " When the stem cells are able to divide and create not just other stem cells, but create specialized progeny that don't divide, so somatic progeny that don't divide, and hence have free energy resources, thermodynamic resources, that they can devote to doing something other than dividing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1619.218,
    "end": 1622.101,
    "text": " Cell division is incredibly expensive when it comes to energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.961,
    "end": 1636.773,
    "text": "So if you take that energy and apply it not to cell division, but to protecting the stem cells, you can allow the stem cell population to expand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.833,
    "end": 1639.616,
    "text": "And that's what these other simulations show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1639.696,
    "end": 1645.781,
    "text": "The blue cells are somatic cells that have very varying ability to protect the stem cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.435,
    "end": 1664.022,
    "text": " And if they're fairly good at protection and they're fairly hard to kill down in the right bottom quadrant, you can actually get a population expanding well into the highly lethal part of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.122,
    "end": 1669.224,
    "text": "So this shows you the FEP in action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.665,
    "end": 1673.286,
    "text": "What the stem cells are doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.355,
    "end": 1694.208,
    "text": " is constructing a very predictable neighborhood around themselves in the environment by dividing to make progeny that don't themselves divide, that just sit there and help protect the stem cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.608,
    "end": 1698.771,
    "text": "So the stem cells are now living in a safer, more predictable environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.591,
    "end": 1707.637,
    "text": " And that allows them to invade more and more of their physical environment by having this fairly benign informational environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.798,
    "end": 1716.043,
    "text": "So this is the FEP in action, driving the expansion of life at the expense of the physical environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.165,
    "end": 1724.749,
    "text": "So that lets us go back to this question that was raised last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.962,
    "end": 1732.366,
    "text": " about the mechanism of these scale transitions that we see ubiquitously in life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1733.907,
    "end": 1743.212,
    "text": "Life gets bigger and bigger as time goes on phylogenetically and as time goes on developmentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.833,
    "end": 1751.276,
    "text": "We start with some molecular pathways that somehow get assembled into a cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.356,
    "end": 1753.117,
    "text": "That's the origin of life question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.177,
    "end": 1753.998,
    "text": "How does that happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.888,
    "end": 1764.53,
    "text": " And about 2 billion years later, cells start to group together to make multicellular organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.77,
    "end": 1774.872,
    "text": "Now, bacteria group together to make facultative multicellular systems like microbial maps 3 billion years ago, very, very early on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.393,
    "end": 1782.234,
    "text": "But we don't see the emergence of obligate multicellulars until much, much later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.412,
    "end": 1787.615,
    "text": " before the Cambrian explosion, but still less than a billion years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.237,
    "end": 1791.979,
    "text": "And from there, things get more complicated very quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.96,
    "end": 1798.405,
    "text": "So one has large multicellular organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1799.987,
    "end": 1807.293,
    "text": "They develop complicated social relations that probably first emerged with social insects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.494,
    "end": 1813.297,
    "text": " but are certainly well developed in invertebrates, including in mammals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.541,
    "end": 1823.926,
    "text": "Organisms group together in very complex ecosystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.547,
    "end": 1835.635,
    "text": "And recall here that it's now known that all multicellular organisms have obligate microbial symbionts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.955,
    "end": 1838.578,
    "text": "So all of our bodies are in fact very complex",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.767,
    "end": 1843.409,
    "text": " ecosystems populated by many, many different species of bacteria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.19,
    "end": 1850.013,
    "text": "And that's true not just for us, but for trees and insects and worms and sponges and everything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.394,
    "end": 1866.583,
    "text": "So organisms from a body point of view are themselves ecosystems, and organisms organize themselves into ecosystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.742,
    "end": 1872.887,
    "text": " And these ecosystems come into contact across the entire biosphere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.747,
    "end": 1884.377,
    "text": "So processes as simple as the wind disperse organisms as small as bacteria all over the planet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1886.138,
    "end": 1894.646,
    "text": "So this scaling of life toward larger and larger organizational structures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.956,
    "end": 1899.937,
    "text": " is in a sense the major thing for biology to explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.638,
    "end": 1922.664,
    "text": "And the hypothesis that we floated last time was that this transition from very small scales to very large scales uses the same mechanism over and over again, or a mechanism that has the same structure over and over again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.133,
    "end": 1928.997,
    "text": " So the renormalization group is trivial, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.137,
    "end": 1934.781,
    "text": "It's just the identity operating at different scales, or mapping from one scale to the next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.262,
    "end": 1939.324,
    "text": "So the question is, can we approach this in any way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.344,
    "end": 1941.485,
    "text": "Does this make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.547,
    "end": 1951.633,
    "text": "And to try to make sense of it, we can go to the one real developed theory that we have in biology,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.691,
    "end": 1957.854,
    "text": " which has been formulated by Dawkins and others as universal Darwinism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.534,
    "end": 1968.079,
    "text": "This is just kind of an abstraction of the modern synthesis between Darwinian evolution and genetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.999,
    "end": 1975.002,
    "text": "But universal Darwinism is incredibly simple and very obvious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.082,
    "end": 1981.205,
    "text": "It says if you have systems and they can copy each other, they can copy themselves and the copies can diversify,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.602,
    "end": 1994.767,
    "text": " Then if you want to know what's going to happen at the population level, what you will find is the systems that copy themselves and diversify most efficiently will win because there'll be more of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.327,
    "end": 1997.348,
    "text": "So they end up dominating the population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.329,
    "end": 2003.671,
    "text": "And winning gets called natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.687,
    "end": 2010.051,
    "text": " But natural selection is not an extra part of the Darwinian process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.371,
    "end": 2021.838,
    "text": "It's just the outcome of efficiency, of the systems that copy themselves most efficiently coming to dominate any population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.219,
    "end": 2024.14,
    "text": "So there's no sort of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.226,
    "end": 2031.95,
    "text": " kind of hand of God or whatever reaching down and selecting some organisms and not others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.21,
    "end": 2051.664,
    "text": "And of course, when Darwin put the idea of natural selection together, he was thinking very explicitly of the analogy of a gardener or a farmer selecting the crops or the animals or whatever that the gardener liked best and keeping those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.628,
    "end": 2055.05,
    "text": " And that's where this selection metaphor comes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.11,
    "end": 2061.474,
    "text": "But there's no real process of selection in evolution by natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.574,
    "end": 2063.556,
    "text": "It's just copying and diversifying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.357,
    "end": 2079.207,
    "text": "But this clearly is just the outline of what a real mechanistic theory would be, because we need to have a story about what copying is and what diversifying is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.171,
    "end": 2082.192,
    "text": " and what efficiently means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.953,
    "end": 2100.739,
    "text": "And in particular, to address the question that we raised a couple of slides ago, we need to know whether these mechanisms are the same or at least isomorphic of the same form at different scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.24,
    "end": 2107.502,
    "text": "So that's what I want to talk about for the next little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.237,
    "end": 2112.618,
    "text": " Let's start with copying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.783,
    "end": 2130.91,
    "text": "Up until the 70s, copying in biology really meant DNA replication and, to some extent, cell division.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.731,
    "end": 2135.213,
    "text": "But the focus in evolutionary theory was on DNA replication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.02,
    "end": 2146.569,
    "text": " And in the 70s, it was realized that whole genes could be duplicated, so whole genes could be copied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.751,
    "end": 2161.143,
    "text": "And then shortly after that, it was realized that particularly in prokaryotes, where functionally related genes are next to each other in chromosomes often,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.952,
    "end": 2169.357,
    "text": " in what are called operons, that operons could be duplicated, and so entire pathways could be duplicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2171.018,
    "end": 2179.343,
    "text": "And as genomes began to be sequenced and structures of genomes were understood, it became clear that genomes could be copied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.823,
    "end": 2191.47,
    "text": "And of course, we have two copies in each of our cells, with the exception of red blood cells, of our complete genome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.759,
    "end": 2198.801,
    "text": " But some plants, for example, have six or eight or even more copies of their genome in each of their cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.821,
    "end": 2203.022,
    "text": "So there's large-scale genome duplication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.642,
    "end": 2207.603,
    "text": "Cell division is clonal duplication of cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2208.423,
    "end": 2214.745,
    "text": "Organismal reproduction works by cell division in all known systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2218.226,
    "end": 2229.335,
    "text": " colonies or societies of organisms reproduce themselves, in part through cultural transmission, and entire niches reproduce themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.436,
    "end": 2247.229,
    "text": "For example, in processes like forest evolution or desertification or even urbanization, we see humans reproducing the same sorts of niches in city after city, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2248.996,
    "end": 2257.558,
    "text": " So these forms of copying have the kind of hierarchical dependencies that one might expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.918,
    "end": 2260.739,
    "text": "So to duplicate pathways, you have to duplicate genes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.439,
    "end": 2265.42,
    "text": "To duplicate cells, you have to duplicate the genome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.62,
    "end": 2269.261,
    "text": "To duplicate organisms, you have to duplicate cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.961,
    "end": 2273.382,
    "text": "And this suggests that this copying operation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2274.272,
    "end": 2284.618,
    "text": " is indeed scale-free, that each level, the copying operation at each level enables the copying operation at the next level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.02,
    "end": 2290.182,
    "text": "Now, with diversification, we see much the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2294.344,
    "end": 2303.13,
    "text": "In the early days of the modern synthesis and still in the work of people like Richard Dawkins,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.446,
    "end": 2330.932,
    "text": " diversification is is generally thought of as random so mutation for example is thought of as random and um here i have barbara mcclintock who is kind of the hero of non-randomness in doggedly over decades pointing out that much of genome diversification is not random at all and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.562,
    "end": 2350.427,
    "text": " that genomes actively diversify by moving whole clusters of genes around and duplicating them or just changing their positions so that they're under the influence of different local control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.628,
    "end": 2359.99,
    "text": "So at the gene and genome level, you have active diversification by various processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.253,
    "end": 2369.077,
    "text": " enzymatic processes, as McClintock showed us, transposon-mediated mechanisms, which are enzymatic at the bottom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2372.539,
    "end": 2375.701,
    "text": "Cells actively diversify by lots of different mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.962,
    "end": 2387.968,
    "text": "And in the 70s, Carl Woese was, in part, personally responsible for pointing out that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.752,
    "end": 2393.135,
    "text": " In the microbial world, there's a lot of horizontal gene transfer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.396,
    "end": 2396.718,
    "text": "And again, no one believed him for quite a while.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.459,
    "end": 2407.867,
    "text": "But now it's broadly accepted that microbes exchange DNA very frequently and across large distances phylogenetically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.145,
    "end": 2419.073,
    "text": " And this is how things like microbial resistance to antibiotics spread so quickly, or one way that it spreads so quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.614,
    "end": 2430.062,
    "text": "And it's a tremendous agent of essentially speciation, to the extent that that even makes any sense in the microbial world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.084,
    "end": 2435.887,
    "text": "Of course, in our cells, we have functional differentiation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.508,
    "end": 2449.514,
    "text": " As mentioned earlier, there are lots of symbiotic interactions that lead to diversification in cells by radically altering their local environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.734,
    "end": 2453.916,
    "text": "And of course, sex is a mechanism for diversification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2456.458,
    "end": 2459.54,
    "text": "Organisms actively diversify in many different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.58,
    "end": 2463.722,
    "text": "The most obvious one is just by moving around, by moving to a different environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.976,
    "end": 2470.178,
    "text": " the organism is exposed to different inputs and is allowed different outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.158,
    "end": 2478.06,
    "text": "And so it can move into a different direction, morphologically, genetically, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2479.56,
    "end": 2488.363,
    "text": "Organisms can regulate their own evolvability by altering things like DNA repair systems or activating transposons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.163,
    "end": 2491.924,
    "text": "Again, these are sorts of things that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2494.537,
    "end": 2499.164,
    "text": " went very much against the grain when they were first discovered, but are now pretty well accepted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.386,
    "end": 2508.159,
    "text": "And of course, organisms can learn and so can diversify their behavior by diversifying their computational capabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.971,
    "end": 2514.655,
    "text": " And social groups, of course, actively diversify in many different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.016,
    "end": 2533.831,
    "text": "And organisms are increasingly, non-human organisms are increasingly regarded as having cultures that they pass on intergenerationally by intergenerational learning and can exchange with other groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.532,
    "end": 2538.775,
    "text": "So diversification is active.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2539.557,
    "end": 2541.157,
    "text": " and occurs at every scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.658,
    "end": 2556.26,
    "text": "And again, diversity, although this is a bit less clear than in the case of copying, diversification mechanisms at one scale enable diversification mechanisms at other scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2558.921,
    "end": 2569.163,
    "text": "So, for example, transposon-mediated mechanisms enable horizontal gene transfer in microorganisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.304,
    "end": 2588.954,
    "text": " And the FEP tells us that efficiency is actually about intelligence because the FEP drives systems to build good models of their environments or the behavior of their environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2590.235,
    "end": 2600.762,
    "text": "And what a good model lets a system do is reach a single goal by many different means because it allows, in a sense, planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2602.697,
    "end": 2606.119,
    "text": " and it allows flexibility and adaptability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.179,
    "end": 2618.084,
    "text": "And I put William James here on this slide because he was the first, as far as I know, to define intelligence as this ability to use different means to reach the same goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.865,
    "end": 2625.868,
    "text": "Now, in evolution, that's long been known, and it's called convergent evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.408,
    "end": 2631.551,
    "text": "When you see two lineages adapting to a single environment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.173,
    "end": 2635.595,
    "text": " with very different genetics and very different morphologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.996,
    "end": 2648.022,
    "text": "And often the organisms will end up with similar morphologies that work well in that environment, but very different genetics and very different biochemistry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.423,
    "end": 2653.966,
    "text": "So throughout evolution, we see this phenomenon of functional convergence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.26,
    "end": 2658.984,
    "text": " balancing structural divergence at many, many different levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.124,
    "end": 2663.728,
    "text": "So we have multiple genes for very similar proteins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.749,
    "end": 2668.592,
    "text": "We have multiple pathways that do more or less the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.294,
    "end": 2675.499,
    "text": "We have different cell types that support the same basic functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2677.158,
    "end": 2682.92,
    "text": " We have tissues that are fairly different, but that have the same functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.0,
    "end": 2689.163,
    "text": "For example, eyes and different kinds of organisms that allow vision, but have very different structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.983,
    "end": 2693.044,
    "text": "And of course, we have functional convergence and social relations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2694.545,
    "end": 2702.127,
    "text": "And if we look at how cells interact, traditional evolutionary theory really focuses on competition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.528,
    "end": 2703.748,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.117,
    "end": 2716.263,
    "text": " We now know that cells cooperate, that they exchange resources in various ways, even across vast differences in phylogeny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.863,
    "end": 2722.526,
    "text": "For example, the interchange between plants and fungi, or between bacteria and us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2724.827,
    "end": 2733.792,
    "text": "We know that cells, in a sense, persuade each other by secreting things like hormones that cause other cells to do different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.687,
    "end": 2737.947,
    "text": " Cells deceive each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.967,
    "end": 2742.849,
    "text": "For example, microbes that are trying to escape the immune system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.829,
    "end": 2746.09,
    "text": "And cells coerce each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.21,
    "end": 2751.211,
    "text": "Cells even kill each other when they detect, for example, genetic defects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.952,
    "end": 2762.135,
    "text": "So these sorts of social and economic and even political ideas are useful for describing living systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.447,
    "end": 2764.948,
    "text": " from the level of cells on up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2764.968,
    "end": 2773.592,
    "text": "I mean, they were developed in social settings to describe what goes on in human societies and then extended to other animals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.812,
    "end": 2779.435,
    "text": "And now it's very clear that they extend to individual cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.375,
    "end": 2788.519,
    "text": "So when we think about social intelligence, we can think about social intelligence even at the level of individual cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.745,
    "end": 2801.653,
    "text": " And we see these sorts of competition, cooperation, resource exchange, et cetera, even at the level of microbial mass, so biological structures that are 3 billion years old.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2803.995,
    "end": 2808.398,
    "text": "Now, of course, intelligence is necessary, but it's not sufficient for being selected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.458,
    "end": 2815.423,
    "text": "It won't protect you from impacts of asteroids that happen to land on your planet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.691,
    "end": 2824.458,
    "text": " which has happened often in the evolution of the Earth, and we're now trying to figure out how to predict and prevent such things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.099,
    "end": 2830.022,
    "text": "But it's, you know, who knows whether we'll be successful at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.944,
    "end": 2835.306,
    "text": "But this intelligence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2836.448,
    "end": 2840.391,
    "text": " is necessary when it's viewed in this FEP sort of way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.852,
    "end": 2847.557,
    "text": "Intelligence is what lets you build models that enable you to predict the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2849.739,
    "end": 2851.02,
    "text": "So where does this leave us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.503,
    "end": 2864.531,
    "text": "By thinking of evolutionary theory in terms of scale-free mechanisms, we seem to have a picture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.598,
    "end": 2878.587,
    "text": " in which we start with quantum systems with a certain level of complexity, and the FEP actually gives us scale-free biology or something very close to scale-free biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2880.608,
    "end": 2884.791,
    "text": "And that's very interesting because the FEP, of course, is a generic principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.151,
    "end": 2888.753,
    "text": "It just says that systems do what they need to do to keep existing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.275,
    "end": 2894.037,
    "text": "And this way of thinking gives us some predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.042,
    "end": 2903.855,
    "text": " One is that we'll find compartmentalized problem solving everywhere because the FEP drives compartmentalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.616,
    "end": 2909.464,
    "text": "And the reason is just non-commutativity of measurement processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.164,
    "end": 2925.851,
    "text": " It predicts that we'll see hierarchical organization everywhere, in the same way we did on that first compartmentalization slide, where once you have a number of compartments, you need a metacompartment that, if nothing else, distributes free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.211,
    "end": 2928.492,
    "text": "So some sort of very basic attention system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.252,
    "end": 2932.934,
    "text": "And we see attention systems, of course, throughout biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.593,
    "end": 2941.136,
    "text": " It predicts that living systems will have very limited classical data structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.236,
    "end": 2959.464,
    "text": "So since they have to write classical data on their boundaries, and their boundaries are much smaller than they are, then they'll, and because writing classical data is expensive, living systems will tend to use as little classical data as they can get away with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.305,
    "end": 2963.026,
    "text": "Since classical data is needed for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.735,
    "end": 2965.376,
    "text": " thermodynamic irreversibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.297,
    "end": 2971.22,
    "text": "Where we see thermodynamic irreversibility, that's where we look for classical data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.841,
    "end": 2978.405,
    "text": "We saw that organisms will be able to detect time first before they can detect space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.025,
    "end": 2988.211,
    "text": "So we can expect organisms to have clocks even before they can represent space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.932,
    "end": 2992.554,
    "text": "And of course, we see things like diurnal variation throughout biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.133,
    "end": 3000.974,
    "text": " And finally, the FEP predicts this asymptotic collapse of separability back to entanglement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.955,
    "end": 3009.756,
    "text": "So it predicts that living systems will eventually degrade and become indistinguishable from their environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.516,
    "end": 3014.297,
    "text": "And we know that happens at the cell level and the individual organism level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.157,
    "end": 3016.978,
    "text": "We call it death.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.898,
    "end": 3019.038,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.842,
    "end": 3033.005,
    "text": " The FEP seems to give us a lot of the features of biology, and it gives us these features in a scale-free way, and it derives them from this very basic physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.665,
    "end": 3036.926,
    "text": "So where does that leave us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.386,
    "end": 3047.948,
    "text": "I think it leaves us here with a challenge, not just to thinking about the FEP, which is what this course has been about,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.363,
    "end": 3052.666,
    "text": " but to quantum information theory in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3055.468,
    "end": 3077.465,
    "text": "And that challenge is to evolve from the kind of conceptual and theoretical utility that we've been discussing in this course, and which is very well developed in the physics community, to some sorts of empirical and technological utility",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.304,
    "end": 3084.126,
    "text": " And I've listed three areas here where QIT is very active.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3084.886,
    "end": 3086.887,
    "text": "One in quantum gravity and cosmology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.167,
    "end": 3098.07,
    "text": "And you're probably familiar with things like string theory that sort of fairly famously seem not to be empirically testable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.571,
    "end": 3102.772,
    "text": "And the quantum gravity community is enormous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.032,
    "end": 3106.293,
    "text": "Many thousands of people working in this area",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3107.298,
    "end": 3120.265,
    "text": " But coming up with theories that can be tested empirically at the scales that we can actually do experiments, so at accessible energy scales, for example, has proved to be very difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.226,
    "end": 3132.531,
    "text": "So this is a real challenge to the field, is somehow getting not just to empirical testability, but to some sort of technological utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3133.811,
    "end": 3136.813,
    "text": "And you can imagine that if the main prediction of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.302,
    "end": 3152.388,
    "text": " quantum gravity is that space-time is emergent, that there could be enormous utility in that, some ability to manipulate the way space-time emerges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3154.129,
    "end": 3157.35,
    "text": "The second area, of course, is quantum information and computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.27,
    "end": 3164.413,
    "text": "And here, massive resources are being put into technological utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.524,
    "end": 3171.567,
    "text": " And I think it's reasonable to expect that we'll have useful quantum computers within a generation at any rate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.308,
    "end": 3177.63,
    "text": "So there I think the field is going quite well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.71,
    "end": 3183.232,
    "text": "And the last area of what we've talked about here is quantum biochemistry and biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.933,
    "end": 3193.057,
    "text": "And this, I think, is an area with enormous promise that maybe some of you will actually contribute to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.054,
    "end": 3201.078,
    "text": " making this area more useful technologically and more accessible empirically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.259,
    "end": 3205.782,
    "text": "But at least we have a picture of how these different areas fit together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3207.623,
    "end": 3209.044,
    "text": "So that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3209.584,
    "end": 3212.066,
    "text": "Thank you very much for participating in this class.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.66,
    "end": 3242.965,
    "text": " sorry um could you just repeat the last like 30 seconds from andrew will be chris",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.378,
    "end": 3258.462,
    "text": " And it will be a discussion session on Saturday, the 20th of October at the usual time, 8 a.m.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.522,
    "end": 3259.123,
    "text": "Pacific time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3260.124,
    "end": 3261.925,
    "text": "And the interactive Q&A is open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.265,
    "end": 3263.826,
    "text": "I really appreciate your questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.926,
    "end": 3264.807,
    "text": "I try to answer them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3267.028,
    "end": 3267.949,
    "text": "And thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.59,
    "end": 3269.91,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.211,
    "end": 3272.052,
    "text": "Can I ask a question or do you want to call it here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.434,
    "end": 3275.034,
    "text": "Sure, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.574,
    "end": 3275.835,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.036,
    "end": 3281.198,
    "text": "Inks wrote, Chris spoke last time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.222,
    "end": 3284.503,
    "text": " Introducing the mechanisms of scale transition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.444,
    "end": 3289.484,
    "text": "I'll read your question, then I'll fix the cropping on the live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.425,
    "end": 3299.187,
    "text": "Chris spoke last time introducing the mechanisms of scale transition of these essentially semantic theories about how one scale embeds in another scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.087,
    "end": 3308.31,
    "text": "I would love to learn more about this, especially in terms of natural language semantics and human cognition semantics versus machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.67,
    "end": 3311.93,
    "text": " Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.531,
    "end": 3316.193,
    "text": "Well, that's a very good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.175,
    "end": 3329.521,
    "text": "I think that's a very relevant question given the sorts of machine learning that we see deployed in systems like ChatGPT.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.422,
    "end": 3333.424,
    "text": "And especially as these systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.426,
    "end": 3348.029,
    "text": " start to associate language with images, for example, and as such systems are embedded in robotic systems that can actually move around in the world and interact with real objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.829,
    "end": 3357.33,
    "text": "I think one of the key questions in natural language semantics is to what extent does it depend on reference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.991,
    "end": 3359.871,
    "text": "To what extent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3361.9,
    "end": 3381.413,
    "text": " do the meanings we attach to words or the usages that we allow for words depend on our ability to connect words to external objects?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.894,
    "end": 3390.96,
    "text": "And to what extent do those abilities rely on connections between words themselves?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.113,
    "end": 3408.429,
    "text": " So if you think of an LLM like ChatGPT by itself, it's just a statistical model of relationships between words as used in some corpus of text, which is large, of course, but we can debate its representativeness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.706,
    "end": 3417.35,
    "text": " And so that's a model of semantics that's entirely self-contained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.45,
    "end": 3422.053,
    "text": "It's entirely relations between different pieces of language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.334,
    "end": 3438.563,
    "text": "Whereas when we start to connect those words, statistics to images, or better yet, to actual objects that are interacted with, not just visually, but haptically, for example, by a robot,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.67,
    "end": 3441.912,
    "text": " they start to be connected to external reference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3443.674,
    "end": 3449.359,
    "text": "And that transition, I think, is going to be very, very interesting to watch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.78,
    "end": 3459.308,
    "text": "And it's just starting, so we all have ringside seats on an incredible experiment in semantics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3461.969,
    "end": 3484.99,
    "text": " And so that would be my response really to that question is keep your eyes on this experiment and see how it goes, because it's bound to tell us something about how semantics really works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.411,
    "end": 3498.621,
    "text": " And I suspect that there will be enormous opportunity to start relating the results of that experiment to what we see in developmental psychology, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.641,
    "end": 3500.863,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.504,
    "end": 3501.824,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.585,
    "end": 3502.885,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.465,
    "end": 3512.633,
    "text": "Tucker asks, Areas of macroscopic quantum-mediated phenomena in biology that get Chris Fields excited?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.278,
    "end": 3533.566,
    "text": " I think the one that excites me the most right now is just this question of how cells are managing to do the information processing that they're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.647,
    "end": 3540.19,
    "text": "And how much of it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.573,
    "end": 3551.561,
    "text": " they can accomplish, or I think the right way to put it is, how can they get away with so little classical information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.562,
    "end": 3568.094,
    "text": "And I don't think we have the cell biology yet to answer that question, but I think asking the question may help us design the right kinds of cell biology to look for an answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3569.551,
    "end": 3586.067,
    "text": " And our cell biology has been organized around the idea that the structures that we see are essentially static, that they're classical, and that they're constructed in a way that's thermodynamically irreversible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.468,
    "end": 3594.715,
    "text": "But if we think of what we measure as not necessarily reflecting a static structure,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.095,
    "end": 3602.857,
    "text": " I think we'll start to conceptualize it differently and build models of it differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.957,
    "end": 3610.6,
    "text": "I mean, clearly, when we look at things like protein structure, we're looking at snapshots of something that's very dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.38,
    "end": 3625.625,
    "text": "And when we look in a chemistry textbook and we see pictures of this conformation that changes to that conformation, we think of those as static, stable structures, that that's kind of a switch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3628.097,
    "end": 3634.539,
    "text": " But it's not actually a switch the way a light switch is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.699,
    "end": 3637.48,
    "text": "It's a much more dynamic process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.841,
    "end": 3649.785,
    "text": "And the kinds of molecular dynamic simulations that allow you to study that process are incredibly complicated and time expensive and uncertain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.245,
    "end": 3654.326,
    "text": "Good resolution problems and other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3654.426,
    "end": 3654.586,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.369,
    "end": 3668.475,
    "text": " I think thinking of these as kind of fluid, reversible processes is going to change the way we think about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.836,
    "end": 3672.017,
    "text": "That's a great point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.957,
    "end": 3684.523,
    "text": "And it reminds me of the more physics-based way of thinking about the paths that could happen between observations or the statistics-based way of samples of a dynamical process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.763,
    "end": 3685.784,
    "text": "And in biology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.644,
    "end": 3693.287,
    "text": " we know that even if we take a snapshot, okay, this organism is one centimeter today, it's two centimeters tomorrow, something changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.307,
    "end": 3701.471,
    "text": "So we know there was a developmental process, then we know there's an ecological process, and then there's an evolutionary context, eco, evo, devo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.511,
    "end": 3714.497,
    "text": "And then from that more biological understanding of contextual developing organisms, all of these different biological phenomena,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.825,
    "end": 3742.045,
    "text": " actually help us expand our space of measurement and analysis for material that on one hand some people may have called inanimate but then they have their own dynamics different time scales and so bringing some of those like the challenges of measuring and observing intervening in historical and biological",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3743.322,
    "end": 3769.449,
    "text": " things gives us a big understanding even on measuring and summarizing analyzing ensembles or scales that that don't immediately appear to have that kind of historiosity like pieces of silicon or carbon yeah that's that's that's well put and and i think uh we have the same problem as we go up in scale also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.606,
    "end": 3773.608,
    "text": " We tend not to think of things like societies as living systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3776.911,
    "end": 3778.872,
    "text": "But in one sense, they clearly are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.353,
    "end": 3793.482,
    "text": "And to the extent that we can think of these structures that are much larger than we are individually as living systems, cognitive systems, etc., I think we'll understand their dynamics better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.502,
    "end": 3796.304,
    "text": "Okay, final question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.085,
    "end": 3820.611,
    "text": " upcycle club wrote how can a quantum system detect and respond to quantum context shifts switches which are changes in the measurement basis or the entanglement structure of the system um well uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.812,
    "end": 3826.033,
    "text": " The answer here is simple and not very informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.233,
    "end": 3845.6,
    "text": "It's by making measurements, which is all that quantum systems can actually do, and making measurements that follow probing actions that try to push the boundaries of the model of a context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3851.036,
    "end": 3869.481,
    "text": " When having this discussion, I always like to go back to the frame problem in artificial intelligence, which is the problem formulated in the late 60s of predicting what won't change as the result of an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3870.681,
    "end": 3873.822,
    "text": "So it's sort of the inverse of the problem of predicting the side effects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.418,
    "end": 3879.72,
    "text": " And if you could predict all of the side effects, you can predict what doesn't change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3879.78,
    "end": 3882.941,
    "text": "So it's equivalent to the question of predicting all the side effects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3883.781,
    "end": 3885.962,
    "text": "And context change is a side effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3887.022,
    "end": 3894.345,
    "text": "And it's often an unobserved and maybe unobservable side effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.545,
    "end": 3896.826,
    "text": "But if you have a model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.864,
    "end": 3914.55,
    "text": " that says, I'm working in this context, then you can intentionally probe the boundaries of that model and see if you can actually alter the context you're in as a way of discovering what context you're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3915.67,
    "end": 3919.111,
    "text": "And humans do that in social settings all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.312,
    "end": 3926.354,
    "text": "But I think this is something that we need to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3928.118,
    "end": 3953.395,
    "text": " think about happening at many different scales i suspect that cells are doing this all the time we just don't know how there's so much to say there it just makes me think of the the paradox or the tension between expecting the expected expecting the unexpected and life needing to expect both of that right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.04,
    "end": 3976.111,
    "text": " so thank you chris it's been an amazing lecture series many people in the live chat are very appreciative and and um we'll look forward to their submitted questions and their participation in the final discussion coming soon so thank you chris until next time okay and thank you all bye ciao",
    "speaker": "SPEAKER_00"
  }
]