[
  {
    "start": 7.796,
    "end": 30.881,
    "text": " hello and welcome this is active guest stream number 39.1 it's march 16th 2023 we are here with Xu Ji Eric L. Mosnino and Guillaume Dumas we're going to have a presentation followed by a discussion section so thank you all for joining and off to you for the presentation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 33.558,
    "end": 33.758,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 33.858,
    "end": 34.439,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.14,
    "end": 36.182,
    "text": "Yeah, I'm Eric.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 36.242,
    "end": 38.825,
    "text": "I'm a PhD student in Yoshua Bengio's lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 39.386,
    "end": 40.247,
    "text": "I'm Shuji.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 40.347,
    "end": 41.509,
    "text": "I'm a postdoc with Yoshua.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 42.551,
    "end": 44.173,
    "text": "And we're really excited to be here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.193,
    "end": 45.054,
    "text": "Thanks for the invite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.935,
    "end": 50.341,
    "text": "We're going to be talking about why we can't describe conscious experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.073,
    "end": 62.46,
    "text": " So this is going to be our take on a really long-standing problem in the philosophy of mind, but we're going to be looking at it through the lens of computational neuroscience and information theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.921,
    "end": 64.902,
    "text": "So yeah, hopefully it'll be fun for everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.942,
    "end": 66.163,
    "text": "It mixes a bunch of disciplines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.064,
    "end": 79.593,
    "text": "So I think the most salient way to illustrate the problem that we're going to be addressing is to ask you to try and think about how you would describe the experience of seeing the color red.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 80.912,
    "end": 89.295,
    "text": " So probably the kind of stuff that's going in your head is things like, well, it's a bright, aggressive color, you know, symbolizes love, that sort of stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.535,
    "end": 91.856,
    "text": "And in a sense, this is a description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 92.917,
    "end": 93.457,
    "text": "It's effective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 93.517,
    "end": 95.938,
    "text": "I would be able to guess which color you were describing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.818,
    "end": 99.579,
    "text": "But in another sense, it's really inadequate, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.659,
    "end": 102.761,
    "text": "If I were blind, for instance, your description would be totally useless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 102.801,
    "end": 105.862,
    "text": "I would be no better in understanding what red looks like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 106.793,
    "end": 112.98,
    "text": " So there's this real sense in which conscious experiences are ineffable such that we can't describe them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 113.66,
    "end": 118.525,
    "text": "And this applies to percepts like red, but it also applies to experiences more broadly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.706,
    "end": 123.631,
    "text": "Like the experience of having a thought is just so ineffable, so hard to describe it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 125.424,
    "end": 129.685,
    "text": " And really importantly, this doesn't happen with most of our knowledge, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 129.825,
    "end": 133.586,
    "text": "I can describe most of what I know, except for experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.606,
    "end": 134.587,
    "text": "They have this special place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 134.767,
    "end": 143.489,
    "text": "So it's a big topic in the philosophy of mind because it relates a lot to this thing called the hard problem of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 144.369,
    "end": 153.832,
    "text": "So basically all the hard problem is, it's the problem of how and why physical processes give rise to conscious experiences in the first place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.138,
    "end": 159.644,
    "text": " So this is probably the oldest and most debated problem in the philosophy of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.664,
    "end": 166.452,
    "text": "And it's even led many to the conclusion that, you know, actually we're going to give up and consciousness can't be explained with physical theories at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 166.573,
    "end": 172.039,
    "text": "You know, that it can't simply emerge from neuroscience, computation, or known physical laws.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.338,
    "end": 183.285,
    "text": " So that's a bold statement, and I won't get into all the details about what makes the hard problem so salient, but just here's a few things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 184.286,
    "end": 192.611,
    "text": "So first of all, we can logically conceive of what are called philosophical zombies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 192.691,
    "end": 198.415,
    "text": "Philosophical zombies, very different from Hollywood zombies, they're basically beings that are physically identical to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.515,
    "end": 199.856,
    "text": "They behave exactly like us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.916,
    "end": 202.718,
    "text": "In fact, they even have the exact same neural activity that we do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.838,
    "end": 205.739,
    "text": " but they just aren't conscious, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.859,
    "end": 214.861,
    "text": "So similarly, instead of these alternate agents being unconscious, we could also imagine them as just experiencing different things when they're in the same states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 215.742,
    "end": 230.306,
    "text": "So for instance, it's conceivable at least that in an alternate universe, the same exact brain mechanisms that produce an experience of red in this world would instead produce an experience of green in the other and that all experiences would kind of be like flipped in this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 231.938,
    "end": 249.018,
    "text": " So, you know, intuitively, we think that these these two thought experiments aren't actually possible in our universe, but even just their logical conceivability suggests some kind of explanatory gap where consciousness doesn't seem to neatly emerge from or be determined by physical state or function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.518,
    "end": 254.423,
    "text": " Another really prominent thought experiment is the knowledge argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 254.724,
    "end": 257.227,
    "text": "And this is the main sort of problem that our work is going to address.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 257.247,
    "end": 265.86,
    "text": "We're not going to address all facets of the hard problem of consciousness, but this knowledge argument is one of the biggest arguments against physicalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 268.174,
    "end": 277.941,
    "text": " So how the knowledge argument goes is it's another thought experiment and asks us to imagine Mary, who has grown up in a black and white room her whole life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.262,
    "end": 284.046,
    "text": "And, you know, despite this poverty and stimulus, she actually knows a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.126,
    "end": 289.75,
    "text": "In fact, we're going to assume that she knows all the physical facts about how color perception works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 289.77,
    "end": 292.752,
    "text": "So all the relevant physics, all the relevant neuroscience, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.273,
    "end": 302.538,
    "text": " And now we're going to ask, well, does she learn something new when she steps out of the room for the first time and actually experiences color?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.379,
    "end": 310.842,
    "text": "And if we say that she does learn something new, which I think is the intuitive answer, there seems to be a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 311.763,
    "end": 315.445,
    "text": "We assumed that she knew all the relevant physical facts about color perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 315.845,
    "end": 320.248,
    "text": "So doesn't this mean that what she learned had to be something that was non-physical?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 321.946,
    "end": 335.349,
    "text": " And if there was nothing more to color perception than physically embodied information and neural activity, then the experience is something describable that she presumably could have read about, understood, and would have already known.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 336.089,
    "end": 346.751,
    "text": "So it feels like this thought experiment really pushes us against physicalism towards this idea that maybe conscious experience has something on top of just information content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 348.765,
    "end": 351.107,
    "text": " Now, of course, we don't want to reject physicalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 351.167,
    "end": 353.948,
    "text": "It's been very fruitful for us in the history of science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 354.989,
    "end": 359.211,
    "text": "So we really do want to say that experience just consists of information that can be described.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 360.152,
    "end": 363.954,
    "text": "So there has to be something wrong in this knowledge argument here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 365.015,
    "end": 369.797,
    "text": "And what we're going to do is we're going to bite the bullet and acknowledge that experiences actually are ineffable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.758,
    "end": 377.102,
    "text": "So maybe it is the case that experiences can be described in principle since they consist of nothing more than information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.21,
    "end": 386.414,
    "text": " But maybe they can't be fully described in practice using something like language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.335,
    "end": 392.958,
    "text": "So then the challenge becomes explaining why experiences are ineffable under a physicalist framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 393.698,
    "end": 396.74,
    "text": "And that's what our work is really going to be about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 398.928,
    "end": 402.15,
    "text": " Okay, so the structure of the talk is going to be like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 402.49,
    "end": 409.415,
    "text": "I'm going to summarize briefly why characterizing richness and ineffability is an interesting and important question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 409.435,
    "end": 421.623,
    "text": "Then Eric is going to talk about how there's a natural correspondence between ineffability and information loss, which is going to let us link biologically plausible attractor models of working memory",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 422.023,
    "end": 426.925,
    "text": " to ineffability, essentially because information loss is inherent in attractor dynamics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 427.685,
    "end": 450.133,
    "text": "Then I will talk about if you consider the ineffability of conscious experience to verbal report as just a special case of information loss between two specific points in the communication pipeline, then you can actually generalize the notion of ineffability more broadly by considering, for example, loss from sensory processing to conscious experience,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 450.669,
    "end": 452.892,
    "text": " and even interpersonal information loss.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 454.134,
    "end": 468.332,
    "text": "We're going to prove using Kolgomorov mutual information that your conscious experience being ineffable to another person implies high cognitive dissimilarity between the two of you under our model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 469.477,
    "end": 482.331,
    "text": " And finally, we'll talk about whether an exact definition of conscious experience is required, at least for characterizing the nature of ineffability and richness, and also some open questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 486.052,
    "end": 492.574,
    "text": " So, yeah, why is richness and ineffability an important question?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 493.374,
    "end": 494.575,
    "text": "There are sort of several reasons.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 494.815,
    "end": 501.537,
    "text": "So first, as Eric said, understanding consciousness is not just of general interest.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 501.737,
    "end": 504.958,
    "text": "It's a longstanding central problem in philosophy of mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 506.278,
    "end": 518.013,
    "text": " because it's not easy to reason about, which has led some dualists to believe that consciousness must be at least partly non-physical in nature because they can't see how it could be explained by physical processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 519.054,
    "end": 522.418,
    "text": "But it's also a topic that is of great interest in machine learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 524.06,
    "end": 537.368,
    "text": " Because if you assume that consciousness is essential to human cognition, then it follows that we won't be able to engineer machines that think like humans without incorporating consciousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 539.998,
    "end": 555.708,
    "text": " And so we're actually going to argue in this talk that the confusing aspects of human consciousness, such as its ineffability, can be understood with information theory, which, as you all know, is born from computer science.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 557.229,
    "end": 569.357,
    "text": "We're going to use some primitives from information theory to shed light on why consciousness is ineffable and hopefully to dispel some of the mystery surrounding it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 572.352,
    "end": 572.592,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.652,
    "end": 585.403,
    "text": "So one of the main primitives over here that we're going to use is to talk about attractor dynamics in the brain and in conscious experience and how that results in ineffability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 586.284,
    "end": 590.487,
    "text": "So hopefully this sort of perspective is familiar to most people, but.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.071,
    "end": 598.332,
    "text": " we could talk about neural dynamics by saying the brain has a state at any particular time, and we could denote this state using a vector.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.093,
    "end": 612.076,
    "text": "So for instance, in this plot over here, maybe we could denote each axis in the state, each dimension using an individual neuron, and maybe we denote the activity of each neuron using its average firing rate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 612.616,
    "end": 617.697,
    "text": "So any states at a particular time would be the firing rate of all the neurons across the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.94,
    "end": 622.242,
    "text": " Now, there's nothing special about neurons or firing rates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 622.282,
    "end": 632.506,
    "text": "You know, if you think that things like the synapse strengths or the dendrite potentials or the astrocytes or whatever else is also important to the representation, you could include those in a state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 632.526,
    "end": 633.727,
    "text": "They're just additional axes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 634.647,
    "end": 642.331,
    "text": "The details aren't so important as long as, you know, we have some state that describes what the brain is doing at any particular time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.26,
    "end": 646.662,
    "text": " Now, of course, the brain is a dynamical system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 646.702,
    "end": 647.723,
    "text": "These states are changing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 648.584,
    "end": 653.167,
    "text": "So you can think of tracing out trajectories through state space as a function of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.187,
    "end": 663.634,
    "text": "And the way that the state evolves will be determined just by the recurrent connections within the brain, as well as inputs coming from elsewhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 663.754,
    "end": 666.536,
    "text": "Maybe we're just talking about the dynamics within a given brain region.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.837,
    "end": 672.721,
    "text": "The inputs would be, you know, the other brain regions talking to it, as well as any sensory stimulus coming in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 675.962,
    "end": 676.142,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 676.202,
    "end": 683.308,
    "text": "So this dynamical systems perspective of the brain, it's been really instrumental in understanding the computations it performs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 683.948,
    "end": 691.394,
    "text": "And one of the primary methods for characterizing these computations is to look at what are called the state attractors of the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 692.194,
    "end": 698.039,
    "text": "And for us as well, state attractors are going to be a really important part of our ineffability framework in a bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.222,
    "end": 713.688,
    "text": " Basically, what an attractor state is, is a state where once the system reaches it, it's going to remain there, at least until inputs come in and change the dynamics or noise nudges the state out of this attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 714.768,
    "end": 716.99,
    "text": " So you can see this thing clearly within the figure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 717.99,
    "end": 721.412,
    "text": "So the X and Y axis over here are like the state of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 721.472,
    "end": 724.054,
    "text": "Again, maybe something like the average firing rates of the neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.634,
    "end": 728.677,
    "text": "These arrows are illustrating the dynamics of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 728.717,
    "end": 732.719,
    "text": "So how the state will evolve given the brain's connectivity, given the synapses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 733.42,
    "end": 738.223,
    "text": "And you can see that there's some regions where all the arrows, all the dynamics kind of contract to a single point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.638,
    "end": 741.0,
    "text": " So that's called a fixed point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 741.38,
    "end": 743.602,
    "text": "If it's one dimensional, it's a kind of state attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 744.543,
    "end": 754.733,
    "text": "And because all the arrows point towards it, once you finally reach that state, you're not going to move out again until the dynamics change because inputs came in or until noise nudges you out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 755.794,
    "end": 759.797,
    "text": "And you can see that each state attractor also is associated with this sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 760.578,
    "end": 786.636,
    "text": " attractive region an attractor basin it's called where you know once a trajectory is somewhere in that region it will eventually converge to the attractor again in the absence of noise um so these these attractors are really common in the brain uh and also in uh artificial recurrent neural networks uh trained on tasks and a big computational benefit is that they provide a form of transient memory right once you're in the attractor you remain there that's where the memory comes in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 787.874,
    "end": 799.941,
    "text": " And because of this and other benefits, they're implicated in a wide variety of neural processes, like working memory, long-term memory, decision-making, and higher level cognition, and we'll argue consciousness in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.001,
    "end": 802.483,
    "text": "So they're all over the place in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 805.945,
    "end": 815.811,
    "text": "An additional aspect of them that's interesting and that's going to be relevant for our talk is that you can think of attractors as having a sort of dual, discrete, and continuous nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 817.029,
    "end": 825.792,
    "text": " So what I mean by that is that the discrete aspect of an attractor is given by the fact that there's a finite number of them and that attractors are mutually exclusive, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.812,
    "end": 827.533,
    "text": "You're in one or you're in another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 828.573,
    "end": 833.555,
    "text": "So this means that we could use discrete symbols to denote which attractor the system is in, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 833.575,
    "end": 834.776,
    "text": "There's a finite number of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 834.796,
    "end": 835.916,
    "text": "You're either in one or another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.936,
    "end": 841.458,
    "text": "And this basically lets us, you know, identify or label the states using a discrete variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.659,
    "end": 852.187,
    "text": " There's also a notion, though, in which an attractor is just a continuous high-dimensional vector in this really high-dimensional state space of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 853.228,
    "end": 859.193,
    "text": "Every attractor basically is just a vector in state space, and that means that they're not arbitrarily discrete states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 859.233,
    "end": 860.735,
    "text": "They have continuous representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 861.135,
    "end": 867.581,
    "text": "We can say, for instance, that one attractor is more or less similar to another one, depending on how close they are in state space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.602,
    "end": 871.564,
    "text": " And that gives a representation to the attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 871.604,
    "end": 873.926,
    "text": "That's the high dimensional sort of continuous part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 874.667,
    "end": 882.212,
    "text": "So just to recap, the discrete part is you could identify which attractor you're in in the finite set of all possible attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 883.613,
    "end": 893.421,
    "text": "But you could also talk about an attractor through this continuous high dimensional vector that describes where the attractor is in the high dimensional state space of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.878,
    "end": 900.1,
    "text": " To wrap your head around this, there's a good analogy to word embeddings in NLP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.5,
    "end": 903.642,
    "text": "So in NLP, each word has a discrete ID.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.262,
    "end": 905.763,
    "text": "That's like the symbolic discrete part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 906.463,
    "end": 916.808,
    "text": "But also each word is associated to a high dimensional vector that gives it a representation, sort of the meaning of the word, where we could say that words are more or less similar to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.669,
    "end": 926.89,
    "text": " Okay, so we're going to use attractor dynamics quite a bit to explain a significant source of ineffability in conscious experience later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 927.851,
    "end": 936.253,
    "text": "But for that to be relevant, I first need to spend a bit of time to convince you that neural dynamics that produce conscious experience actually do have attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.313,
    "end": 941.614,
    "text": "And for this, there's already a lot of work in the literature connecting attractors to conscious experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 941.634,
    "end": 945.475,
    "text": "So this part is not something new from our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.294,
    "end": 956.598,
    "text": " So, for instance, one of the leading theories of consciousness, which is the global workspace theory, actually implicitly implies that attractor dynamics are kind of fundamental.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 957.979,
    "end": 968.663,
    "text": "So what global workspace theory says is basically like across the brain and all the different regions, you have sort of some process worker workers basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 968.723,
    "end": 971.944,
    "text": "And these different distributed mechanisms, they can't speak to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 973.445,
    "end": 1001.935,
    "text": " very easily they mainly communicate through this like global workspace which is kind of like a bottleneck if i think of it like a blackboard uh that all the different processes across the brain could write to you can also think of it as like the ram of the brain but basically it's collecting information from the different workers um and one key uh aspect about uh the global workspace that's posited in the theory is that for content in the workspace to then be broadcast",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.881,
    "end": 1004.383,
    "text": " to the step processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1004.784,
    "end": 1017.783,
    "text": "For instance, for us to be able to talk about what's in the workspace, for it to be written to speech regions, the content of the workspace has to be amplified and sustained for a certain amount of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.823,
    "end": 1019.084,
    "text": "It has to be stable, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.929,
    "end": 1023.393,
    "text": " And this is clearly where the attractors come in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1023.433,
    "end": 1027.999,
    "text": "Attractors, by definition, are these states that are stable, these states that are sustained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1028.78,
    "end": 1038.352,
    "text": "So basically what global workspace theory says is that the context of the global workspace that can be used by the rest of the brain are the attractor states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1039.153,
    "end": 1053.191,
    "text": " And the relevance to consciousness in this theory is that it posits that the contents of this global workspace are the things that we're aware of, the things that we're able to report, the things basically that we're conscious of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.797,
    "end": 1060.142,
    "text": " And then just kind of like terminologically, another term for this workspace is called working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1061.042,
    "end": 1070.311,
    "text": "The idea there is it's a sort of like really short-term memory in the sense that you could quickly, you know, act on the things that are in this global workspace or report on them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1070.711,
    "end": 1071.712,
    "text": "They're accessible basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.024,
    "end": 1078.806,
    "text": " Okay, so that's one very powerful argument for why attractors are relevant to consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1079.286,
    "end": 1081.067,
    "text": "There's a bunch of other related arguments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1082.408,
    "end": 1090.591,
    "text": "For instance, just introspectively, you could think of what experience is like is a sequence going from one thought to the next to the next.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.711,
    "end": 1094.012,
    "text": "We kind of have this sequence of discrete events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1095.133,
    "end": 1099.795,
    "text": "And that clearly looks like a dynamical system kind of jumping between attractor states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1100.875,
    "end": 1115.64,
    "text": " And then experimentally, there's also been work showing that in psychology experiments, when you sort of present a stimulus to a subject and you vary the amount of time that the stimulus is presented to kind of bring it below or above the conscious threshold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1116.4,
    "end": 1124.983,
    "text": "Well, in the conditions where subjects report being aware of the stimulus, the main thing that's different is that the representation is really stable and robust in noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1125.163,
    "end": 1128.264,
    "text": "And those are also clearly properties of attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1130.472,
    "end": 1142.563,
    "text": " Okay, so again, we'll use those attractors to identify a source of ineffability in a little bit, but first I need to also introduce how we're going to formalize the very notion of ineffability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.244,
    "end": 1145.466,
    "text": "And for this, we're going to use information theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.387,
    "end": 1153.273,
    "text": "Part Shannon information theory, I'll do that now, and then Shu will talk a bit about Kolmogorov complexity as another formalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1156.681,
    "end": 1162.825,
    "text": " Hopefully, most people are familiar with this, but one thing that we're going to be using is the entropy of a state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1164.058,
    "end": 1171.82,
    "text": " So, for instance, if you have the entropy of some random variable X, to make things concrete, maybe that random variable is conscious experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1171.92,
    "end": 1182.642,
    "text": "So the entropy of conscious experiences, that value would be high if the distribution over conscious experiences was kind of diffuse and flat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1182.802,
    "end": 1185.083,
    "text": "So there's equal probability for all possible experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1185.723,
    "end": 1191.445,
    "text": " And entropy would be low if the distribution over conscious experiences was peaky.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1191.826,
    "end": 1200.189,
    "text": "So that's kind of like the green distribution in this image would have low entropy and the red distribution that's sort of flatter and more uncertain would have higher entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.687,
    "end": 1212.135,
    "text": " And basically what entropy is going to quantify in our framework is the richness of a variable, in particular, the richness of conscious experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1213.016,
    "end": 1223.204,
    "text": "Why this is a good measure of richness is because if conscious experiences could kind of take on many possible values with equal probability, they're very kind of diverse in that sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1223.264,
    "end": 1224.845,
    "text": "Well, then it's something that's rich.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1226.631,
    "end": 1230.392,
    "text": " Some other notions that are gonna be important are mutual information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1231.473,
    "end": 1240.215,
    "text": "So here that's denoted by I of actin Y. And what that denotes is how much shared information there is between two random variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1241.375,
    "end": 1250.138,
    "text": "So again, to make things concrete, X we could take to be a conscious experience, whereas Y, maybe that's a description of the experience, maybe a verbal description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1251.563,
    "end": 1258.668,
    "text": " So in this case, the mutual information will be really high if the verbal description uniquely determines the experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1259.489,
    "end": 1265.594,
    "text": "So basically, another way of saying that is knowing the verbal description, we have no more uncertainty about what experience is going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1265.634,
    "end": 1266.854,
    "text": "They perfectly determine each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.155,
    "end": 1269.276,
    "text": "So that would maximize the mutual information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1270.057,
    "end": 1279.564,
    "text": "And in contrast, if the message told you nothing about the conscious experience and you were just as unsure as when you didn't have the message, well, then the mutual information would be zero.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.211,
    "end": 1285.594,
    "text": " This is useful because we can use it to define a notion of ineffability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1287.115,
    "end": 1306.006,
    "text": "So this conditional entropy that we've written, H of X given Y, is equal basically to the richness of X, so the entropy of conscious experiences, minus the mutual information between conscious experiences and other variables like their descriptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1306.086,
    "end": 1307.067,
    "text": "That's the mutual information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1308.372,
    "end": 1316.398,
    "text": " What this captures basically is how much information is lost when going from an experience X to a description Y, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1316.458,
    "end": 1335.03,
    "text": "If all the information was lost, if Y doesn't tell you anything about X, the mutual information is zero and H of X will, well, the conditional entropy will be equal to the richness of X. If Y perfectly determined X, well, then H of X and the mutual information cancel and the conditional entropy would be zero.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.971,
    "end": 1346.414,
    "text": " So what conditional entropy describes basically is how much information is lost when moving from X, so like a conscious experience, to Y, a description of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1346.734,
    "end": 1351.695,
    "text": "And that's a perfect description of what ineffability is intuitively, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1351.735,
    "end": 1355.716,
    "text": "It's how much information is lost when I try and describe something like an experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1357.95,
    "end": 1371.601,
    "text": " Okay, so I think we have most of the background out of the way, and now we're ready to describe one main source of ineffability that arises due to attractor dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1372.181,
    "end": 1375.704,
    "text": "So very quickly to describe some variables over here that we're gonna be using throughout the presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1375.964,
    "end": 1384.371,
    "text": "If you look at that top right diagram, we're gonna have X, which is basically the trajectory of neural activity that's relevant for a conscious experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.751,
    "end": 1391.033,
    "text": " So, for instance, in global workspace, X would be the trajectory of the working memory state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1391.053,
    "end": 1395.854,
    "text": "We're going to assume that this trajectory of neural activity produces a conscious experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.874,
    "end": 1398.335,
    "text": "We're going to be calling that conscious experience S throughout.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1399.355,
    "end": 1403.116,
    "text": "But also the trajectory, importantly, is going to follow attractor dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.836,
    "end": 1405.577,
    "text": "So they converge to states such as X.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1407.338,
    "end": 1409.479,
    "text": " So how does this result in ineffability?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.239,
    "end": 1420.304,
    "text": "Well, basically the idea is that whenever you have attractor dynamics, there's a many to one mapping from trajectories to attractors, and this induces information loss, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1420.404,
    "end": 1428.227,
    "text": "Just knowing the attractor, we're not able to kind of go the other way around and infer what the original trajectory was.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.847,
    "end": 1434.41,
    "text": "So there's this conditional entropy, this ineffability of X given A is gonna be high basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1435.333,
    "end": 1436.273,
    "text": " All right, why does this matter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.713,
    "end": 1442.375,
    "text": "Who cares if there's information loss between the trajectory of working memory and the attractors that it converges to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.955,
    "end": 1457.578,
    "text": "Well, important thing here, again, is that Global Workspace postulates that for working memory contents to be accessible across the brain, it needs to be amplified and maintained over a sufficient duration, so thought to be around 100 milliseconds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.464,
    "end": 1466.435,
    "text": " This means that working memory is going through these trajectories X, but only A, only the attractor, can be reported.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.176,
    "end": 1469.32,
    "text": "Only the attractor could broadly affect behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1469.841,
    "end": 1471.383,
    "text": "Only it could be written to memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.724,
    "end": 1473.586,
    "text": "Only it could be broadcast to these other processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1475.911,
    "end": 1482.577,
    "text": " So that means that the contents of working memory, kind of these transient contents in the trajectory X, are inherently fleeting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.318,
    "end": 1492.947,
    "text": "There's a rich information that was encoded in the moment of the trajectory, but that can't later be recalled or reported because only the attractors can be recalled or reported.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1493.928,
    "end": 1495.83,
    "text": "And kind of if we zoom out and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1497.335,
    "end": 1504.561,
    "text": " go back to our philosophical notions of ineffability, this also explains why it's difficult to sort of catch yourself in a thought, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.641,
    "end": 1512.928,
    "text": "Working memory encodes these rich and subtle thoughts through the trajectory, but we can never quite pinpoint or report in words what those thoughts consisted of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1513.708,
    "end": 1514.549,
    "text": "Were they verbal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.609,
    "end": 1515.53,
    "text": "Were they pre-verbal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1515.67,
    "end": 1517.351,
    "text": "Did they consist of visual imagery?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.611,
    "end": 1519.133,
    "text": "It's really hard to say exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.313,
    "end": 1523.036,
    "text": "And the reasoning would be that, well, there's just a lot of information that's lost.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.516,
    "end": 1529.964,
    "text": " going from these trajectories to the attractors that, again, we could report on, or that we could recall, or they could just broadly affect behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1530.985,
    "end": 1537.232,
    "text": "And so that's one huge source of ineffability arising from attractor dynamics in working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1540.784,
    "end": 1546.888,
    "text": " Now, these attractor dynamics also give a lower bound for ineffability during verbal reports.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1547.388,
    "end": 1554.133,
    "text": "So now at the top right, I've added another variable, M. That's basically some verbal message that you can be using to describe your experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.854,
    "end": 1557.576,
    "text": "And M is a function of the attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1558.136,
    "end": 1563.58,
    "text": "According to Global Workspace, only the attractors can be reported on or used across the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.6,
    "end": 1565.962,
    "text": "So this means that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.0,
    "end": 1583.12,
    "text": " Basically, the ineffability of an experience given a verbal message has to be at least as great as the ineffability given an attractor, because M is a function of the attractor, and you can't gain information when applying a function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1583.14,
    "end": 1583.961,
    "text": "You can only destroy it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1585.664,
    "end": 1591.97,
    "text": " But we're actually going to argue that the ineffability is not just lower bounded by the ineffability of the attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1592.05,
    "end": 1594.892,
    "text": "It's actually, in practice, quite a bit greater than that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1595.553,
    "end": 1600.337,
    "text": "And the reason is that M, this message, is a discrete variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1600.677,
    "end": 1601.258,
    "text": "It's language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1602.479,
    "end": 1607.403,
    "text": "Whereas A, the attractor, is this really high dimensional snapshot of some cortical state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1607.844,
    "end": 1612.208,
    "text": "So because of the asymmetry between the richness of these variables, there has to be information loss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1612.848,
    "end": 1620.072,
    "text": " And intuitively what's going on here is that you can think of there as being a many to one mapping from attractors to messages as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1621.272,
    "end": 1624.394,
    "text": "So, for instance, if I say that I saw fat cats.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1625.451,
    "end": 1625.571,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1625.771,
    "end": 1639.537,
    "text": "That paints a picture, but it's also leaving out significant details about the original attractor, which presumably encoded things that you were aware of, like the cat's color, size, pose, the background, all these things that you were aware of and that were encoded in the attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1639.997,
    "end": 1645.339,
    "text": "But you can't really put into a message without it being prohibitively large.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1646.38,
    "end": 1656.486,
    "text": " So again, the idea here is that the ineffability of experiences given messages higher than given attractors because the message divides the space of attractors more coarsely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.786,
    "end": 1657.766,
    "text": "It's a simpler variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1658.166,
    "end": 1660.168,
    "text": "It adds additional information loss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.85,
    "end": 1670.173,
    "text": "So one problem is if language is so coarse and simple, why can it describe experiences at all?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.596,
    "end": 1679.948,
    "text": " And the solution is that while attractors and the message kind of both share this discrete part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1681.419,
    "end": 1687.384,
    "text": " So the message, because language is discrete, can be used to index or identify compositional attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.965,
    "end": 1702.737,
    "text": "There's this comparable richness, basically, between the message and the discrete part of the attractor, which means that in practice, the richness of the experience H of S is typically much greater than the ineffability of the experience given the message.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.981,
    "end": 1711.807,
    "text": " So that explains why we still can communicate somewhat with language, even though it's this really low dimensional simple thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.848,
    "end": 1721.855,
    "text": "So to recap quickly, what we have over here is the argument says the detractor dynamics are empirically ubiquitous in neural activity across brain regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1722.535,
    "end": 1731.842,
    "text": "They've been proposed as a computational model for working memory and prominent models contends that conscious experience is a projection of working memory states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.884,
    "end": 1745.283,
    "text": " And one of our key contributions is to connect these theories to argue that attractor models working memory offer an account for the ineffability of conscious experience because attractor dynamics induce significant information loss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.704,
    "end": 1746.706,
    "text": "That's the general argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.2,
    "end": 1751.002,
    "text": " There's one quick thing to add over here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1751.062,
    "end": 1755.885,
    "text": "So I've been talking about working memory a lot less about conscious experience so far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1756.586,
    "end": 1757.607,
    "text": "So let's link the two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1759.788,
    "end": 1765.292,
    "text": "What's going on over here is that there's many ways to link conscious experience to X, to working memory basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1765.312,
    "end": 1768.254,
    "text": "And there's kind of two main options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1768.715,
    "end": 1773.358,
    "text": "So one is we could say that the instantaneous state of working memory is always conscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1773.478,
    "end": 1776.761,
    "text": "So all the states in between attractors are also consciously experienced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1777.481,
    "end": 1791.614,
    "text": " And how attractors would result in NF ability here is that, again, what you're able to recall, what you're able to report is just the attractor, not the actual experiences in between attractors that you were having.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.655,
    "end": 1797.839,
    "text": " But there's another possibility, which is to say, well, maybe only the attractors themselves are experienced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1798.579,
    "end": 1802.021,
    "text": "However, importantly, ineffability exists regardless in this case, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1802.281,
    "end": 1809.766,
    "text": "If only A is conscious, A can still encode the fact that there's information loss during processing and working memory during these trajectories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1810.487,
    "end": 1812.328,
    "text": "Information loss is something that is computable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1813.168,
    "end": 1818.292,
    "text": "It could be encoded along some dimensions in the attractor, for instance, which explains how, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.072,
    "end": 1823.614,
    "text": " we could be consciously aware that there's information lost during working memory processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1825.095,
    "end": 1825.375,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1826.376,
    "end": 1827.996,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1828.217,
    "end": 1830.958,
    "text": "So now I'm going to talk about generalizing ineffability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1832.919,
    "end": 1843.384,
    "text": "Once you view ineffability as information loss from a source variable to a destination variable, then there are a myriad of different pathways that you can characterize, which we're going to split into two groups.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1844.671,
    "end": 1854.12,
    "text": " So pathways confined within an individual or intrapersonal communication and pathways that extend between individuals or interpersonal communication.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1854.747,
    "end": 1861.191,
    "text": " So in the intra case, you've already seen conscious experience, the working memory trajectory, the attractor state and the message.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1862.172,
    "end": 1874.22,
    "text": "But you can also consider D, which is the input data to the system, and V, which we use to denote the state of processes considered outside the delimitation of working memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1876.449,
    "end": 1883.931,
    "text": " And you can also consider the cognitive parameters of the individual being communicated to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1884.291,
    "end": 1896.854,
    "text": "So we're going to work with Alice and Bob, and we're going to assume that Bob has a brain which is structurally identical to Alice's, but has different parameters, phi tilde instead of phi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1897.174,
    "end": 1902.775,
    "text": "And we're going to denote Bob's cognitive state using the tilde.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1907.852,
    "end": 1921.145,
    "text": " So empirical evidence from neuroscience suggests that the brain is hierarchical in nature, and there are many levels of organization, many instances of attractor dynamics across organizational levels and cortical regions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1922.489,
    "end": 1942.334,
    "text": " So one example is the inferior temporal cortex is a sensory processing area that responds discriminatively to novel sensory stimuli, whereas the prefrontal cortex or PFC appears to be implicated in maintaining the attention modulated representations of working memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1943.994,
    "end": 1948.455,
    "text": "And to a first approximation in this simple model,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1948.86,
    "end": 1954.445,
    "text": " It's easy to obtain the result that richness of one process constrains the richness of another.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1955.846,
    "end": 1959.469,
    "text": "So here we have that richness of working memory trajectories.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1960.269,
    "end": 1965.293,
    "text": "HX is upper bounded by the richness of its inputs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1965.934,
    "end": 1970.398,
    "text": "And subsequently, we also have that the richness of conscious experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1970.498,
    "end": 1978.224,
    "text": "HS is upper bounded by the richness of conscious experience and the richness of subprocess states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1981.42,
    "end": 1984.804,
    "text": " Now we're going to zoom out and consider the interpersonal communication case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1987.066,
    "end": 1992.272,
    "text": "Shannon entropy has some drawbacks when it comes to characterizing interpersonal ineffability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1993.176,
    "end": 2000.022,
    "text": " A major one is that Shannon entropy assumes you have access to phi, Alice's cognitive parameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2000.802,
    "end": 2011.391,
    "text": "So note that H phi S given M, for example, is the descriptional complexity of S given not just A, but also phi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2016.47,
    "end": 2027.938,
    "text": " And since we can't assume in the interpersonal case that Bob has access to Alice's brain parameters, we're going to rely on the Kolgomorov framework for information theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2028.839,
    "end": 2037.886,
    "text": "If you're unfamiliar with the Kolgomorov complexity, the first thing to note is that Kolgomorov complexity or Kx is defined on instances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2039.453,
    "end": 2044.499,
    "text": " hence the lowercase, rather than variables, which are denoted by capitals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2045.6,
    "end": 2053.85,
    "text": "KX is roughly defined as the length in bits LZ of the shortest binary program Z that prints X and halts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2054.978,
    "end": 2062.601,
    "text": " Um, so there's no explicit dependency on the probability distribution over X, unlike in, um, Shannon information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2063.662,
    "end": 2075.547,
    "text": "Uh, but we can introduce PX, um, by taking an expectation over the Kogomorov complexity of states, um, to, uh, obtain the Kogomorov version of Shannon entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2076.768,
    "end": 2084.271,
    "text": "And likewise, um, for an affability, um, we characterized it before using conditional entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2086.024,
    "end": 2094.447,
    "text": " In the Kogomar framework, expected K of X given Y is sort of the analog to Shannon conditional entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2094.887,
    "end": 2103.61,
    "text": "And that represents the length of the shortest program that prints X given that you know Y or that Y is accessible to your program.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2105.161,
    "end": 2127.983,
    "text": " And it's approximately equivalent up to logarithmic terms to kx minus ix colon y, where ix colon y is Kogomarov mutual information, which can be interpreted as the difference in program lengths for printing x, depending on if you know y or not, roughly speaking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2132.769,
    "end": 2137.492,
    "text": " There are a lot of similarities between Shannon information and Kolgomorov information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2137.652,
    "end": 2155.944,
    "text": "For example, mutual information in both cases is maximized if x is equal to y. In the Shannon case, because that means y uniquely determines x, and in the Kolgomorov case, because it means that given y, you don't require any extra bits to print x.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2158.217,
    "end": 2186.388,
    "text": " In fact, if you assume knowledge of the probability distribution p, then expected Kogomarov complexity and Shannon entropy are equivalent up to some constant factor, because it turns out that the most efficient way to describe a state x on average, given that you know the distribution, is to encode x with a description of length minus log p x bits.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2187.285,
    "end": 2208.255,
    "text": " Um, but if you don't know the distribution, um, which we want to make use of, uh, in, in the interpersonal case, because the parameters of the speaker's brain are not given, um, then the higher, the descriptive complexity of that unknown distribution, then the higher, the ceiling on the difference between expected Kogama of complexity and Shannon entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2209.016,
    "end": 2215.679,
    "text": "Um, uh, and in our case, we'd expect that to apply because the space of cognitive states is enormous.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2216.189,
    "end": 2226.374,
    "text": " the probability distribution over those states is very complex and the states themselves are in general complex to reconstruct, being very high dimensional vectors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2227.835,
    "end": 2245.083,
    "text": "The second advantage of Kogomorov complexity, in addition to allowing us to explicitly avoid conditioning on the probability distribution, is that Shannon entropy is a measure of statistical determinability of states as opposed to difference in unique states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2246.962,
    "end": 2261.415,
    "text": " So in Shannon information, entropy is fully determined by the probability distribution on states and it's unrelated to the meaning or structure or content of the states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2262.824,
    "end": 2271.251,
    "text": " Whereas Kolgomov complexity is concerned with the difficulty of reconstructing states, i.e.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2271.431,
    "end": 2277.056,
    "text": "absolute difference, which corresponds more closely to the lay definition of ineffability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2280.879,
    "end": 2285.322,
    "text": "Here are a number of results that we include in the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2285.362,
    "end": 2286.703,
    "text": "So the first one is quite simple.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2288.845,
    "end": 2298.63,
    "text": " You can't increase Kogomarov complexity by conditioning on more states because the program can simply choose to ignore the input if it doesn't help to shorten the length of the program.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2299.951,
    "end": 2311.717,
    "text": "So we have trivially that Ks given m, the complexity of conscious experience given the message, is at least as great as Ks given m and p phi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2313.178,
    "end": 2316.86,
    "text": "But you would expect this gap to be quite significant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2317.9,
    "end": 2340.274,
    "text": " uh because of the complexity of um p phi um so because in in our case and generally in non-toy cases um the probability distribution itself provides a lot of information so it it it significantly reduces the descriptive complexity of s if you're able to um condition on it um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2341.71,
    "end": 2366.826,
    "text": " This first result illustrates essentially the difference in ineffability from the tabular Rasa case on the left where you don't condition on Alice's brain parameters phi to the case where you can assume access to Alice's brain parameters, which is analogous to the Shannon entropy",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2369.396,
    "end": 2372.918,
    "text": " characterization that Eric was talking about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2374.338,
    "end": 2380.341,
    "text": "But the quantity that we're more interested in is this expression in the green box.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2380.881,
    "end": 2397.088,
    "text": "So K S given M and P tilde phi, which is the expected ineffability, well, in expectation, of Alice's experience S given the message and Bob's brain parameters tilde phi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2399.302,
    "end": 2421.234,
    "text": " You can show that this quantity is upper bounded by an expression that scales with K p phi given tilde phi, which is a measure of the cognitive dissimilarity or the descriptive complexity of Alice's brain given Bob's brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2422.435,
    "end": 2426.577,
    "text": "So in other words, if your experiences are ineffable to someone,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2428.061,
    "end": 2428.842,
    "text": " i.e.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2428.962,
    "end": 2440.612,
    "text": "the left-hand term in the green box is high, that implies that your brains are highly behaviorally dissimilar under our model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2443.474,
    "end": 2453.303,
    "text": "So we can use this result to provide an account for what Mary learned when she stepped out of her black and white room.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2455.251,
    "end": 2463.682,
    "text": " And essentially, what it's saying is that neurotypical Alice's experience of color is ineffable to Mary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2467.228,
    "end": 2470.049,
    "text": " which implies that they are cognitively dissimilar.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2470.789,
    "end": 2484.694,
    "text": "And cognitive dissimilarity is not the same as knowledge inadequacy, because knowing how the brain should respond to a particular stimulus is not the same as being able to execute that response when you're actually exposed to the stimulus.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2486.26,
    "end": 2497.902,
    "text": " So the cognitive dissimilarity principle is something that we generally believe intuitively, but it's also been studied in neuroscience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2499.043,
    "end": 2511.925,
    "text": "So the ability for the neural activity of two brains to synchronize, which is to say to behave in a mutually determined manner, appears to facilitate communication between individuals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2515.055,
    "end": 2521.162,
    "text": " There's also a connection to theory of mind, which is the skill of being able to infer the thoughts of others.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2521.903,
    "end": 2535.258,
    "text": "So if Bob's cognitive functions, FX and FS, which produce his working memory trajectory and his conscious experience, are optimized for decoding Alice's message M,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2536.282,
    "end": 2550.214,
    "text": " into her conscious experience S, then ineffability is reduced if Bob's conscious experience S tilde is conditioned on compared to M. Because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2552.676,
    "end": 2567.737,
    "text": " it implies that part of the computation of reconstructing S is executed during inference of tilde S, meaning that the smallest program from tilde S, Bob's conscious experience,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2568.297,
    "end": 2594.522,
    "text": " and tilde phi, Bob's cognitive parameters, to S, Alice's conscious experience, would make use of tilde S to reduce the sort of residual work that needs to be, the residual information that needs to be supplied in order to determine S, which would shorten the descriptive length of that program.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2595.433,
    "end": 2610.46,
    "text": " So in other words, making progress at inferring the conscious experience of others in your own cognitive processing could literally be interpreted as reducing the ineffability of their conscious experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2613.78,
    "end": 2616.101,
    "text": " Quickly, we're going to touch on the grounding problem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2616.541,
    "end": 2621.824,
    "text": "So as Eric mentioned before, two individuals will generally understand the same word or sentence in different ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2622.464,
    "end": 2627.647,
    "text": "And our measure of ineffability does capture this dissonance for two reasons.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2628.647,
    "end": 2640.773,
    "text": "And first, measures of ineffability, such as we saw in the previous slide, they are bound by a ceiling that scales with cognitive dissimilarity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2641.739,
    "end": 2645.042,
    "text": " or the Kogomarov complexity of p phi given p tilde phi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2646.184,
    "end": 2657.916,
    "text": "And phi includes all the parameters in Alice's computational graph, including those that parameterize functions defined on the input data d, and likewise for Bob.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2658.417,
    "end": 2659.758,
    "text": "So that means that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2663.102,
    "end": 2672.946,
    "text": " Alice's parameters phi are grounded in a representation that is at least partly shared with Bob's tilde phi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2673.266,
    "end": 2677.488,
    "text": "So if Bob's parameters implement a function that operates differently on input data,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2678.449,
    "end": 2694.9,
    "text": " compared to Alice, then they do not inform on each other to a great extent, and the ceiling on ineffability is increased via this K P phi given P tilde phi tan.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2695.8,
    "end": 2701.304,
    "text": " And secondly, conscious experience S is a function of phi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2701.905,
    "end": 2707.87,
    "text": "It's computed using a function that depends on phi, and likewise for Bob.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2709.071,
    "end": 2711.553,
    "text": "And phi contains Alice's long-term knowledge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2711.973,
    "end": 2722.081,
    "text": "Therefore, S is capable of containing information about the associations that Alice makes in the process of generating her conscious experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2723.209,
    "end": 2735.696,
    "text": " Um, and, and that's included in the reconstruction targets of, um, KS, uh, which is to say, um, the description of complexity of her conscious experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2740.144,
    "end": 2757.763,
    "text": " So our model offers an interpretation for the observations of Sperling, which were made in 1960 in this very famous experiment where he showed subjects a grid of characters briefly and then asked them to recall a specific row.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2759.632,
    "end": 2784.217,
    "text": " He observed that subjects were generally able to report the prompted row accurately, but not all the characters in the grid, despite being able to report that they had a conscious experience of, they sort of had, they consciously apprehended all characters in the grid.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2786.744,
    "end": 2795.53,
    "text": " And our model offers an account for this phenomenon in the following way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2796.25,
    "end": 2814.482,
    "text": "So upon being exposed to the grid of characters and being prompted to report the characters in a specific row, working memory contents represented by the attractor state A presumably contains the identities of those four characters in the prompted row.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2815.006,
    "end": 2827.11,
    "text": " as well as a summary over the grid, for example, the approximate number of characters or their arrangement, and an estimate of the information lost by that summary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2828.071,
    "end": 2831.712,
    "text": "Whilst information sufficient to discriminate all characters",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2832.655,
    "end": 2849.447,
    "text": " would exist at some point in the computational pipeline, but primarily in upstream sensory state V, from which working memory trajectory X and working memory output A are computed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2850.886,
    "end": 2869.463,
    "text": " Subsequently, since the attractor state A is directly accessible to verbal reporting processes, the characters of the prompted row, the grid details at summary level, and the presence of information loss would be directly reportable, whereas full grid details wouldn't.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2871.224,
    "end": 2872.045,
    "text": "And note that this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2873.715,
    "end": 2881.541,
    "text": " explanation would hold irrespective of where the distinction between conscious and unconscious is drawn.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2882.502,
    "end": 2893.89,
    "text": "So whether X, the working memory trajectory, which may contain sufficient information to discriminate all characters or not, whether X is considered conscious or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2898.354,
    "end": 2901.496,
    "text": "So as this suggests,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2903.442,
    "end": 2922.488,
    "text": " One of the points that we make is that, at least when it comes to characterizing richness and ineffability, the exact definition of what constitutes conscious experience, so the definition of F as phi in the computational pipeline, is not that important.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2927.327,
    "end": 2941.093,
    "text": " We utilize this minimal computational model without relying on the implementation details in order to allow us to make general statements about richness and ineffability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2942.393,
    "end": 2956.399,
    "text": "And as Eric hinted before, you can account for the report of ineffability from this computational, assuming this computational graph",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2956.699,
    "end": 2959.54,
    "text": " irrespective of how you define FS.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2960.44,
    "end": 2969.903,
    "text": "So if X is considered to be conscious, then the attracted dynamics bottleneck the amount of information accessible to working memory output and verbal report.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2970.303,
    "end": 2975.545,
    "text": "But if X is not conscious, then information lost during processing can still be reported on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2975.965,
    "end": 2983.287,
    "text": "It can still be approximately computed and reported on, leading us to report on ineffability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2986.577,
    "end": 2992.181,
    "text": " Um, so finally, uh, some, some future directions for this work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2992.842,
    "end": 2995.984,
    "text": "Uh, one of them is to, uh, link it to the neuroscience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2996.805,
    "end": 3011.376,
    "text": "Um, so for example, to, um, uh, actually get some empirical estimates of the amount of information loss, um, using neural correlates of working memory state, for example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3013.175,
    "end": 3014.719,
    "text": " And also,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3019.318,
    "end": 3026.322,
    "text": " I think for a deeper understanding of consciousness, you have to consider why it exists and not just how it manifests.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3026.722,
    "end": 3044.971,
    "text": "So this is something that we don't touch on on the paper, but the use of information bottlenecks in machine learning would suggest that information loss actually has a purpose and specifically the purpose is generalization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3046.196,
    "end": 3069.515,
    "text": " It improves the robustness of functions learned from data to noise, and it improves the ability of functions to perform optimally on inputs that were not seen during training, which is what generalization is defined by.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3072.433,
    "end": 3089.916,
    "text": " And this is important because if we want to incorporate sort of observations about consciousness into our artificial models, what we really want to capture is the benefit that consciousness affords biological models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3091.176,
    "end": 3101.038,
    "text": "And we might not need to transfer the actual form that it takes in human cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3103.991,
    "end": 3104.551,
    "text": " And that's it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3111.893,
    "end": 3112.273,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3112.753,
    "end": 3114.353,
    "text": "Thank you for the presentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3116.874,
    "end": 3125.636,
    "text": "Guillaume, it would be awesome if you could give some opening remarks, and then we can have a discussion and hear any questions from the live chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.616,
    "end": 3127.856,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.536,
    "end": 3130.617,
    "text": "Well, thanks again for the invitation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.843,
    "end": 3150.635,
    "text": " mind jazz on these beautiful topics so as opening questions and uh discourse i would say like uh a strong message here is that uh through uh the formalization that was just presented we have a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.887,
    "end": 3157.668,
    "text": " an account that allowed to make the bridge between access consciousness and phenological consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.828,
    "end": 3176.132,
    "text": "Something that was described very well in the paper that was cited of Yonel Nakash in Philosophical Transaction B, how you don't necessarily need something more than access consciousness to account for these phenomenal aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.372,
    "end": 3182.013,
    "text": "But it also left a lot of open questions, like typically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.344,
    "end": 3199.368,
    "text": " we have seen how there is an information loss within brain and between brains, but we can also complexify the within brain message passage, for instance, adding metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.468,
    "end": 3210.75,
    "text": "So, at Mila, we are also working on addition of cognitive architecture on top of global neural workspace with typically attention schema theory from Michael Graziano.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.604,
    "end": 3218.269,
    "text": " And so there is, again, in these meta-representational steps, a loss of information as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.95,
    "end": 3238.466,
    "text": "And I think from an empirical point of view, at both behavioral and neurophysiological level, there's also a lot to unpack there on how our metacognitive representation of ourselves is also an impoverished information from the real",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.674,
    "end": 3241.815,
    "text": " states that occur and underlying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.477,
    "end": 3250.703,
    "text": "And that connect well with the social dimension of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.763,
    "end": 3255.847,
    "text": "And here we tapped a bit on that with the ineffability at the interpersonal level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.667,
    "end": 3266.836,
    "text": "But in the case of the attention schema, there is a very interesting reversal from evolutionary standpoint of why the brain comes up to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.503,
    "end": 3280.567,
    "text": " to represent others at first, and then we are recycling the neural mechanisms to predict others' behavior on ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.587,
    "end": 3295.892,
    "text": "There's a kind of flipping of the traditional narrative in cognitive neuroscience with Graziano because the others come first in a way, and self-consciousness becomes a sort of side effect of having to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.567,
    "end": 3298.847,
    "text": " have all the mechanisms to deal with others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.908,
    "end": 3309.89,
    "text": "And here we don't talk too much about the representation of the cell, but I think it's a very interesting path following this work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.75,
    "end": 3325.773,
    "text": "Then there is also something that we didn't discuss too much, but we think about the trajectory to the attractor and how many trajectories can lead to one attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.653,
    "end": 3332.578,
    "text": " But interestingly, from a sequence of attractor, you can recover sort of a trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.658,
    "end": 3342.025,
    "text": "So if I have point A and point B and point C, by having the sequence IBC, I will tend to have a trajectory that looks alike each time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.885,
    "end": 3355.195,
    "text": "And so it's kind of heading towards the dynamics also of social interaction and culture, so typically cultural artifacts like musics or movies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.928,
    "end": 3363.855,
    "text": " are eliciting stuff from a subjective experience that seems like stronger than just words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.396,
    "end": 3369.019,
    "text": "And even, I mean, I'm saying stronger than words, but even words are sequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.679,
    "end": 3382.51,
    "text": "So in a way there is maybe in the dynamics of communication, a little bit of information that is retrieved by the interpolation of different discrete states, different attractors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.488,
    "end": 3388.789,
    "text": " So it's in the inequality that we saw.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.809,
    "end": 3403.833,
    "text": "So the inequalities are there, but maybe we can play a bit with those phenomena to see to what extent we can retrieve more information by playing on those dynamical phenomena in communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.374,
    "end": 3410.475,
    "text": "And regarding communication, so we talked about the grounding problem and how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.516,
    "end": 3418.421,
    "text": " The message and the attractors are kind of aligned between people through a shared statistical environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.843,
    "end": 3435.634,
    "text": "And I think the Kolmogorov framework is interesting in the sense of a generative model of the world that you have to share with others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3436.759,
    "end": 3441.401,
    "text": " In a sense, I'm working a lot on autism and I'm interested in neurodiversity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.383,
    "end": 3460.931,
    "text": "The fact that you have this cognitive dissimilarity in the information loss is also very interesting to interpret how diversity at the biological level can have an impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3461.958,
    "end": 3470.404,
    "text": " on how certain people would have more difficulty to communicate with others, specifically in a neurotypical world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.665,
    "end": 3475.768,
    "text": "Like we have a society that is very normative in design for neurotypical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.409,
    "end": 3486.577,
    "text": "And so people who are more outside the norm and are more neurodiverse would then have more difficulty to align their generative model and communicate with others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.037,
    "end": 3491.12,
    "text": "That's also something that would be nice to discuss or to explore later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.321,
    "end": 3505.767,
    "text": " And finally, so since we are on the active inference livestream, I would take the occasion to mention how it could connect with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.787,
    "end": 3519.413,
    "text": "We didn't really talk about the active inference formalism in the paper, but typically I'm coming back from a workshop on computational neurophenomenology, where we used",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.009,
    "end": 3530.374,
    "text": " the previous work of Varela on neuroscience and phenology to try to have a generative passage between first-person and third-person experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3530.754,
    "end": 3544.702,
    "text": "And we discussed during the whole week how computational models can be a third constraint to stabilize this relationship between first- and third-person perspective on consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.007,
    "end": 3551.349,
    "text": " I was among the rare people there, not completely convinced by active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.009,
    "end": 3565.534,
    "text": "And I was trying to argue about the need for plurality at the formalism level, even from a theoretical perspective and for plurality in those domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.574,
    "end": 3574.797,
    "text": "But at least from a formal point of view, to try to not bet all our eggs in the same basket, so to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.538,
    "end": 3583.203,
    "text": " And here it's a very nice example how even you can combine formalisms that were mutually exclusive in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.223,
    "end": 3598.474,
    "text": "So for typically coming more from the embodied cognition and Varela's work, people with embodied cognition tends to be more in dynamical system theory and very opposed to computationalism and information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.954,
    "end": 3603.958,
    "text": "Here we show in this paper that information theory and dynamical system theory can totally work hand in hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.537,
    "end": 3610.358,
    "text": " So it doesn't mean that we need to commit to one or to have all formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.378,
    "end": 3615.7,
    "text": "But to maintain this plurality, I think, is very important from an epistemological standpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.72,
    "end": 3630.123,
    "text": "And still, the connection with active inference that could be interesting, and that's one of the things that I kept from last week's workshop, is how, from a social interaction point of view,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3631.681,
    "end": 3641.949,
    "text": " synchronization and I worked out on interbrain synchronization and those phenomena synchronization can be optimality for information transfer, as we see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.529,
    "end": 3652.337,
    "text": "But in the context of active inference, it's also the optimal minimizer of free energy because you have the two generative models that are perfectly aligned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3652.357,
    "end": 3658.802,
    "text": "And so you don't have error in your prediction because the other person become a mirror of your own generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.594,
    "end": 3670.9,
    "text": " So that may be also some bridges and predictions that can show that those different formalisms are multiple ways of looking at the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3679.225,
    "end": 3680.005,
    "text": "Thank you Guillaume.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3680.445,
    "end": 3681.646,
    "text": "Awesome points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3683.817,
    "end": 3693.605,
    "text": " Feel free to discuss if you have any responses and just take it from there, Eric and Shu, or I can ask some questions or read some comments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3693.625,
    "end": 3696.187,
    "text": "Do you have any comments on Guillaume's thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3699.93,
    "end": 3700.831,
    "text": "Yeah, I think we have some.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3701.592,
    "end": 3702.513,
    "text": "Do you have things to say?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3702.553,
    "end": 3707.537,
    "text": "Yeah, that was a long list of comments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3712.266,
    "end": 3731.522,
    "text": " I find your comments about the autism link really interesting because actually that's pretty much directly what the message of the result is, is that cognitive dissimilarity is associated with difficulty in communicating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3733.663,
    "end": 3734.924,
    "text": "So, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3734.944,
    "end": 3736.366,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3740.376,
    "end": 3756.037,
    "text": " Actually, the last thing that you said about how if the communicator and the listener's brains are synchronized or if they're equal, there's no prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3760.071,
    "end": 3764.773,
    "text": " That's kind of the machine learning problem, actually, as a whole.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3765.373,
    "end": 3774.057,
    "text": "I don't know if this is a big thing, but the whole point of machine learning is to discover the true model that you're trying to learn so that you have no prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3777.299,
    "end": 3787.263,
    "text": "So I'm not an expert on active inference by any means.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3789.806,
    "end": 3798.612,
    "text": " But one thing that does make me a bit apprehensive about it is that it's so concerned with prediction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3802.395,
    "end": 3811.921,
    "text": "Generative models are about reconstruction and prediction, whereas cognition is about survival.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3815.704,
    "end": 3817.285,
    "text": "And prediction is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3818.925,
    "end": 3845.985,
    "text": " part of survival obviously i mean you need to be able to predict you know um i don't know uh not not not crashing into a car or something so that you don't die but but it's it's actually you know it's it's it's it's just a part um um and more generally uh the inference of cognitive states in the brain is not about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3846.889,
    "end": 3849.409,
    "text": " discovery of truth in some sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3849.429,
    "end": 3866.553,
    "text": "It's not about coming up with a true model or explanation for some phenomenon.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3866.993,
    "end": 3873.294,
    "text": "It's about sort of optimizing for your fitness,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3875.982,
    "end": 3884.928,
    "text": " So yeah, that's something that I don't quite understand sort of what the active inference perspective on that would be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3885.148,
    "end": 3887.149,
    "text": "I don't know if Daniel, you had some comments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3892.093,
    "end": 3892.333,
    "text": "Or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3894.355,
    "end": 3901.18,
    "text": " Okay, just jumping with active inference and then I'll leave more comments in the chat, but I think that's a great set of points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3902.261,
    "end": 3911.628,
    "text": "So if I can make one point to Guillaume's first, you spoke about in the presentation, the generalized ineffability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3912.643,
    "end": 3928.094,
    "text": " And it reminded me of a few times in active inference where we're hearing about generalized synchrony, generalized, which means like not necessarily lockstep or mirror, but mutually information encoding and not necessarily linearly correlate and,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3929.435,
    "end": 3953.034,
    "text": " synchronized like the end state of the metronomes but there's like complex information transfer especially in this multi-scale setting um generalized synchrony which is enabled by the general generalized coordinates which are the coordinates of motion of the path so these are kind of the summary statistics to describe the Taylor series expansion around that path or to better describe that path",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3954.414,
    "end": 3965.293,
    "text": " taken in some way and generalized homeostasis, which for certain environmental regularities, it may be sufficient to be entirely retrodictive, or there may be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3966.516,
    "end": 3995.936,
    "text": " physical or cyber physical constraints so that you'll have a system that is purely designed a different way so i wouldn't say any theory is necessarily too opinionated with respect to what you could describe and i think part of the reason to want such a descriptive approach which is what i feel like you all did by deciding to describe an analytics framework for ineffability rather than for example a mechanistic explanation but describing some",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3997.016,
    "end": 4018.469,
    "text": " evidence all of that was just to say pluralism in what were approaching that ineffable space from multiple compressions or bowls to even describe english words scientific models and it reminded me of the recent discussions with lance da costa",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4019.409,
    "end": 4024.654,
    "text": " who described how other discrepancy measures other than free energy could be used.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4024.794,
    "end": 4033.642,
    "text": "And that free energy has been used in machine learning, the variational autoencoders, all kinds of Bayesian applications, because it has a KL divergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4033.822,
    "end": 4043.73,
    "text": "And so it has some convenient variational optimization properties as a discrepancy measure, but it is not the only discrepancy measure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4044.651,
    "end": 4066.899,
    "text": " and you mentioned two in your discussion which were the shannon syntactic sort of classical information content and then the kolomogorov the program and so that is like another distance measure so in some ways these spaces can't or won't or don't even need to collapse",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4067.719,
    "end": 4078.873,
    "text": " below pluralism of at least several relatively stabilized kinds but i thought that was a very important point guillaume",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4079.611,
    "end": 4108.066,
    "text": " about explanatory pluralism and how we can be excited about one area of science or one way of knowing and it's compatible with others ways of knowing because we have some of those properties of differences that were discussed so those are first thoughts before even any active technicality yeah i mean go for it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4109.315,
    "end": 4113.359,
    "text": " No, I just want to remark that KL is distance between two distributions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4115.641,
    "end": 4115.881,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4116.822,
    "end": 4118.243,
    "text": "Whereas, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4120.104,
    "end": 4121.646,
    "text": "Anyway, yeah, Guillaume, continue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4122.787,
    "end": 4132.035,
    "text": "Yeah, I was just saying, in the case of autism, this typically shows how also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4133.168,
    "end": 4140.189,
    "text": " you don't necessarily need to go to the mechanistic neurobiology to have potential explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.13,
    "end": 4153.692,
    "text": "And so in the case of Kravr for explaining the brain, there's a very nice definition, very nice landscape of different kind of explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.692,
    "end": 4162.254,
    "text": "And in the same way, those different formalisms can give different perspective on how to understand what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.5,
    "end": 4177.905,
    "text": " autism has been very focused on the neurobiology at some point and the genetics, but maybe it's not at that level specifically that the functional understanding should occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4177.965,
    "end": 4191.73,
    "text": "I don't say it has no causal relationship because it's highly genetically irritable and so on, but sometimes the functional understanding is not necessarily at the very...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.934,
    "end": 4218.01,
    "text": " lowest level of explanation yeah so now to kind of move to active inference and really physics based approaches the trajectory recovery is going to have some maximum information representation with the generalized coordinates of motion it's how paths are represented in many settings",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4219.193,
    "end": 4244.438,
    "text": " and so that path of least action the bayesian mechanics on that landscape whatever it is empirically it's like fitting a spline in that space or doing some other kind of modeling whether it's spm modeling or hyperscanning there's some kind of generalized time series modeling",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4246.175,
    "end": 4252.338,
    "text": " between the present and artifacts, the past, the future, other entities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4256.119,
    "end": 4257.2,
    "text": "What do you mean, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.22,
    "end": 4258.06,
    "text": "I didn't get it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.628,
    "end": 4287.475,
    "text": " just that that kind of trajectory recovery is what is being parameterized in physics of consciousness type models or physics of cognition bayesian physics anything where a probability distribution has a position velocity acceleration and so on it's being path inferred continuous time um generative models and there's discrete time generative models in actinth",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4288.399,
    "end": 4291.201,
    "text": " and hybrid models, just like other Bayesian graphs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4291.902,
    "end": 4300.749,
    "text": "So in the continuous time setting where there's a Taylor series expansion, that's trajectory recovery.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4304.813,
    "end": 4305.033,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4305.453,
    "end": 4315.742,
    "text": "Well, I think more generally, maybe the point is that you could use Bayesian learning variational inference to learn a generative model of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4316.263,
    "end": 4318.184,
    "text": " these states that we're referring to, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4318.224,
    "end": 4336.973,
    "text": "If you had some kind of data sets that actually represents a sample from, let's say, the true model, then you could use variational inference to approximate that model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4342.128,
    "end": 4343.09,
    "text": " But you don't have to though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4343.331,
    "end": 4350.386,
    "text": "I mean, there are many generative modeling techniques in machine learning that don't fall under variational inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4353.547,
    "end": 4355.108,
    "text": " I'll read a comment and a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4355.368,
    "end": 4369.793,
    "text": "So, Joshua Bengio writes, Guillaume Dumas' idea about trajectories of consecutive attractors to recover information about likely trajectories that lead into each of these attractors that are normally lost in working memory is very cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4371.174,
    "end": 4378.377,
    "text": "And then, Shu, Eric, any relation between what you talked about and the compositional properties of conscious thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4380.33,
    "end": 4381.691,
    "text": " Yeah, I think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.851,
    "end": 4384.954,
    "text": "So in terms of compositionality of conscious thoughts,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.562,
    "end": 4393.305,
    "text": " I think what Joshua is referring to now is that our thoughts kind of compose concepts that we already have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4393.365,
    "end": 4403.89,
    "text": "So something like, you know, a sentence, if I think, you know, the fat cat, I'm composing these mental concepts of fat and cat, and that generates sort of a new experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4403.93,
    "end": 4407.052,
    "text": "So experiences are always generated from these building blocks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4408.312,
    "end": 4411.614,
    "text": "And then similarly, one thing that we didn't talk so much about is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4414.15,
    "end": 4419.555,
    "text": " conscious experiences, language and attractors can also have this shared compositional structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4419.615,
    "end": 4428.402,
    "text": "So like language, it's clear, you know, base space where it's combined to form new little phrases, new sentences that have novel meaning in a systematic way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4429.303,
    "end": 4430.844,
    "text": "How this could happen with attractors is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4433.446,
    "end": 4441.931,
    "text": " Well, kind of in the most basic case, different dimensions in this high dimensional state space might converge to different attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4442.011,
    "end": 4447.435,
    "text": "And so now, you know, one attractor that's converged to is really a composition of attractors along different dimensions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4448.477,
    "end": 4462.881,
    "text": " So this is a sense in which our experiences are compositional, our attractors that generate those experiences can have compositional structure, and this could be a reason why language itself is compositional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4462.901,
    "end": 4469.163,
    "text": "We're basically trying to come up with some way of describing or identifying compositions of attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4469.622,
    "end": 4477.888,
    "text": " I mean, I would add that compositionality is a mechanism for reducing descriptional complexity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4478.849,
    "end": 4491.719,
    "text": "So in fact, that's arguably the objective for the compositional nature of our thoughts and language.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4491.859,
    "end": 4496.983,
    "text": "Features like less time to describe, more robustness to noise,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4500.586,
    "end": 4511.478,
    "text": " Yeah, I mean, if you're trying to describe an instance of a state, obviously the descriptional complexity is much less if it's built up of concepts that you already know about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4515.498,
    "end": 4522.986,
    "text": " Yeah, just to bring this back to something I mentioned in the talk, I pointed out that attractors have this discrete structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4523.006,
    "end": 4525.549,
    "text": "There's a finite number of them, and we could assign labels to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4526.57,
    "end": 4531.555,
    "text": "But if these attractors are compositional, which would allow for a richer space, a richer number of attractors, basically,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4532.356,
    "end": 4561.825,
    "text": " it's finite but it's the space of total attractors is exponentially large right so we don't want a language that's assigning one unique word to every composition of attractors it would be an exponentially large language um we want some kind of uh language that will minimize the description like what she said you know you could have a language that's compositional yeah i think that provides a really i think you're muted daniel",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4563.854,
    "end": 4564.114,
    "text": " Sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4565.035,
    "end": 4590.615,
    "text": "It provides a very interesting and justifying rationale for using the description length as opposed to the KL divergence, which is maybe in some telepathy-enabled world or space, the KL divergence does help you move quickly or on some defined manifold, but...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4592.036,
    "end": 4617.633,
    "text": " in an encoding decoding space and on the computers that we have then writing shorter programs and or making smaller information theoretic compressions becomes one of the imperatives",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4618.697,
    "end": 4622.82,
    "text": " to take the kind of empirical approach that you are describing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4623.421,
    "end": 4633.208,
    "text": "Because though you've described mainly equations, these are all also computer packages that can be used to model different data sets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4633.929,
    "end": 4638.893,
    "text": "So what kinds of data sets do you think this is most proximally applicable to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4645.047,
    "end": 4653.427,
    "text": " Yeah, are you saying like what kind of data sets would kind of minimum description length compositional models be most useful for?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4654.383,
    "end": 4669.389,
    "text": " Or just with the approaches and measures that you described today, what kinds of data sets or behavioral and cognitive settings do you think that could be used as an empirical tool or measure for?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4669.409,
    "end": 4673.43,
    "text": "I think it'd be really interesting to hear about, does the data already exist?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4673.911,
    "end": 4675.951,
    "text": "Is it some hypothetical measurement?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4676.051,
    "end": 4678.392,
    "text": "Are there ways to even reanalyze?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4678.692,
    "end": 4679.953,
    "text": "Yes, Guillaume or anyone else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4684.127,
    "end": 4697.15,
    "text": " Yeah, I think like on language already, there is like a lot of things that have been done on the number of bites per seconds transferred, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.25,
    "end": 4712.554,
    "text": "And I guess like on large corpus of discussions or even in clinical settings, for instance, I'm working on the clinical alliance between a patient and a clinician, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.711,
    "end": 4723.86,
    "text": " This formalism of ineffability and information loss would be interesting to apply to as even a form of biomarker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.1,
    "end": 4726.962,
    "text": "I mean, even if at the language level, it's not bio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4728.503,
    "end": 4739.092,
    "text": "And then you can also apply those information theoretic measurements to physiological data, movement, neural data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.652,
    "end": 4742.735,
    "text": "So in my lab, we are reporting multiple brains simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.899,
    "end": 4769.752,
    "text": " we can totally try to empirically approach what we are describing in this paper and show that, for instance, in certain populations that are more challenged to communicate through neurodiversity, so what we discussed earlier, we can apply the same type of measurements with information theory instead of just classical neuroimaging measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.952,
    "end": 4771.353,
    "text": "So that would be, for instance,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.068,
    "end": 4774.631,
    "text": " empirical way of dealing with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4775.311,
    "end": 4790.045,
    "text": "What I'm very interested in would be to make the relationship between the access consciousness and the V basically process and the information loss that you have in your working memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4791.466,
    "end": 4796.691,
    "text": "Right now, I feel that the neuroimaging technologies are not at that level of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.725,
    "end": 4804.208,
    "text": " possibility, but who knows, maybe we're going to have soon the ability to disentangle that kind of stuff now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.349,
    "end": 4805.709,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4805.869,
    "end": 4806.829,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4808.59,
    "end": 4821.716,
    "text": "So the delimitation of what constitutes working memory in the brain, I think that's not a settled question, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4821.736,
    "end": 4823.697,
    "text": "I mean, there are lots of different",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4827.159,
    "end": 4828.56,
    "text": " possible approaches.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4832.103,
    "end": 4833.664,
    "text": "Yeah, I mean, it's totally up in the air.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4833.804,
    "end": 4841.971,
    "text": "Like classically in global workspace theory, they traditionally thought, okay, working memory is localized to prefrontal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4842.271,
    "end": 4848.035,
    "text": "Now the new perspective is emerging that, okay, maybe working memory is sort of distributed across the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4848.055,
    "end": 4853.4,
    "text": "We see kind of sustained attractor representations all over the place in this distributed working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4853.44,
    "end": 4855.121,
    "text": "So all these different pieces",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4856.522,
    "end": 4878.346,
    "text": " you know what what does what constitutes x what constitutes that working memory trajectory um and and also you know what constitutes the experience what's the function that goes from x from working memory to an experience uh all that is is up in the air when writing this paper we had plenty of discussions about you know what is the trajectory the whole trajectory conscious is just the attractor",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4878.886,
    "end": 4879.366,
    "text": " conscious?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4879.767,
    "end": 4882.268,
    "text": "Is there kind of sense in which both these things are true?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.328,
    "end": 4886.01,
    "text": "So like Guillaume was talking about access versus phenomenal consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4886.871,
    "end": 4898.018,
    "text": "Access consciousness refers to what I'm able to report, whereas phenomenal consciousness kind of refers more to the standard definition of what is my experience like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4899.139,
    "end": 4908.326,
    "text": " So our framework kind of illustrates that maybe we could unify these things where X, the trajectory, is some phenomenal experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4908.987,
    "end": 4922.619,
    "text": "It's in the moment, whereas your tractor is really the only thing you're able to report, remember, and you still know that something is missing between what you're reporting and what you were actually experiencing throughout.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4926.175,
    "end": 4930.717,
    "text": " Yeah, I mean, I think in terms of our model, it's pretty clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4930.737,
    "end": 4940.521,
    "text": "But I think actually grounding it in empirical data sets is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4944.67,
    "end": 4946.292,
    "text": " is a challenging question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4946.332,
    "end": 4951.455,
    "text": "The other thing is that Kogomarov complexity is more of a theoretical measure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4953.797,
    "end": 4962.564,
    "text": "So that's actually, I think, the reason why Shannon information is much more ubiquitous, for example, in machine learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4965.065,
    "end": 4972.031,
    "text": "Because basically, given a generative model, you can approximate it, for example, just using Monte Carlo",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4973.166,
    "end": 4989.778,
    "text": " estimation, but Kolgomorov complexity, yeah, it would be much more of an approximation, with a much greater error, I think, if you attempted to approximate that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4993.841,
    "end": 4995.222,
    "text": "So I guess that would be a potential concern.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4995.731,
    "end": 5008.194,
    "text": " Yeah, one advantage of it, if you could measure the Kolmogorov complexity, is it would allow you to kind of measure the ineffability of an experience on an individual case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5009.014,
    "end": 5014.916,
    "text": "So, for instance, like one thing we spoke about with theory of mind was that this complexity of the experience given the message,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5016.841,
    "end": 5027.266,
    "text": " We would think it would be much higher than an experience given Bob's experience, given the listener's experience, because the listener's brain is doing a lot of the work of decoding the message into a similar sort of experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5028.207,
    "end": 5035.65,
    "text": "So it'd be useful if you could see something like, are there certain types of experiences where the message is wildly insufficient?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5035.69,
    "end": 5038.832,
    "text": "You know, the complexity of the experience given the message is massive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5039.652,
    "end": 5042.313,
    "text": " But actually people do a really good job inferring the experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5042.893,
    "end": 5045.894,
    "text": "And maybe it would be different in a case of like autism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5045.934,
    "end": 5050.095,
    "text": "Maybe there's some sorts of experiences that they simply can't reconstruct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5050.675,
    "end": 5057.477,
    "text": "So I think there's some value in trying to create measures of Kolmogorov complexity to kind of handle these individual cases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5058.037,
    "end": 5060.538,
    "text": "The issue is, yeah, it's not really computable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5060.558,
    "end": 5065.819,
    "text": "You can't search through the space of all possible programs, but maybe there are kind of ways to get around this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5065.859,
    "end": 5068.26,
    "text": "For instance, you could sort of parameterize a program with,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5069.073,
    "end": 5070.834,
    "text": " I don't know, a neural network, let's say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5070.854,
    "end": 5075.578,
    "text": "You have a neural network going from message to some brain scan for an experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5075.638,
    "end": 5086.886,
    "text": "And then maybe the size of that neural network or the complexity of the network could be sort of a surrogate for the complexity of the program, the Shores program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5087.386,
    "end": 5087.687,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.248,
    "end": 5090.929,
    "text": "That's a cool idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5092.93,
    "end": 5093.831,
    "text": " That is really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5094.151,
    "end": 5107.36,
    "text": "It reminds me of using adversarial neural networks, which don't have as strong analytical guarantees as, for example, cryptography.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5107.921,
    "end": 5114.205,
    "text": "But then they kind of converge in being able to protect or change or modify information in certain ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5115.607,
    "end": 5122.437,
    "text": " But you aren't getting the same bounds or guarantees on the formality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5122.477,
    "end": 5126.663,
    "text": "And that's kind of like the discrete continuous dialectic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5128.337,
    "end": 5140.745,
    "text": " And so it's important to embody even that pluralism with respect to state spaces, because if the formalisms in any of these domains, the formalism for discrete and continuous, they're not always aligned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5141.466,
    "end": 5144.688,
    "text": "And those are definitely the areas that can be studied.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5146.169,
    "end": 5150.712,
    "text": "But for the space of empirical models that we're talking about,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5152.017,
    "end": 5155.939,
    "text": " as part of even then methodological pluralism in science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5155.979,
    "end": 5160.261,
    "text": "But if we're talking about statistical models, we wanna be able to intake the data at some point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5160.301,
    "end": 5167.665,
    "text": "So it has to have certain properties, which are even looser than the math.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5168.005,
    "end": 5169.786,
    "text": "And there's probably a lot that could fit in this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5170.446,
    "end": 5175.269,
    "text": "And I think it'll be interesting, like when you have a hyperscanning experiment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5176.613,
    "end": 5201.89,
    "text": " How do you include the environment or how do you deal with different number of sensors or different types of sensors, different kinds of action and report that people might encode their symbols through symbol, all kinds of accessibility and interface types, which I think returns to Guillaume's point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5201.95,
    "end": 5202.971,
    "text": "So yes, please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5204.457,
    "end": 5223.624,
    "text": " Yeah, actually, that's also reminding me that there is also a nice empirical playground associated with what we discussed is how we can maximize from an environmental perspective instead of the biological perspective, this information transfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5223.644,
    "end": 5227.866,
    "text": "So I'm working, for instance, with Michael Lipschitz, which is part of ALIUS as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.886,
    "end": 5232.227,
    "text": "From an anthropological standpoint, humans came out with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.321,
    "end": 5260.284,
    "text": " rituals or cultural uh practice to to maximize uh the alignments of people and those things also are uh very important in our society or to reach consensus and collaborate and so on and uh i guess like this can also of uh issue would be a very important i mean when we have to uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.021,
    "end": 5264.962,
    "text": " converge on optimal collective dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.923,
    "end": 5288.751,
    "text": "Here we are talking with Alice and Bob in a dyadic scale, but a nice follow-up also on this work would be at the group level, how you optimize consensus and collaboration on group skills, particularly for tackling climate change or social inequality and very challenging topics of society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5290.192,
    "end": 5290.392,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5292.796,
    "end": 5305.943,
    "text": " Yeah, so actually that touches on a, well, possibly weakness of the simple model that we use, which is that we don't incorporate any feedback loops.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5306.844,
    "end": 5315.609,
    "text": "So we have this very simple unidirectional model, which I think has advantages because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5317.01,
    "end": 5323.392,
    "text": " as well, because it sort of shows basic principles in a relatively easy to understand way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5324.212,
    "end": 5336.897,
    "text": "But you're right in that realistically, there's always feedback, not just at the interpersonal level, but obviously within the brain, working memory is top-down attention, actually.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5337.037,
    "end": 5342.879,
    "text": "So that's something that we didn't address in this talk.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5344.279,
    "end": 5369.678,
    "text": " Yeah, it would be really interesting to sort of unify our work with the field of pragmatics, which is exactly about this, like, you know, given many back and forth steps in dialogue, how do people come to a consensus, you know, and this could also kind of involve the active inference framework where, you know, as a listener, I'm going to ask questions that are going to try and reduce my, my uncertainty about the speedier state as much as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5372.671,
    "end": 5400.336,
    "text": " awesome thank you for these comments so in my experience computer scientists and those who have empirical data measurement experience they know that you can have different kinds of behavioral measurements or just columns in a database you could have heart rate and you can have video data and you kind of have this like open-ended it doesn't need to be just a matrix that gets multiplied in this extremely clean way",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5401.161,
    "end": 5421.09,
    "text": " I feel like that leads a lot of these very open-ended and flexible approaches which on one hand address the different forms and functions and settings that these kinds of questions are asked and like at the same time are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5423.647,
    "end": 5435.198,
    "text": " working, if not to address, at least to have continuity with classical discussions on a wide range of topics like sequence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5444.046,
    "end": 5446.609,
    "text": "Yeah, the question of, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5447.586,
    "end": 5449.79,
    "text": " not everything is a vector, not everything is a matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5450.251,
    "end": 5451.934,
    "text": "You could have more complicated data structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5453.076,
    "end": 5453.797,
    "text": "That's really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5453.837,
    "end": 5456.502,
    "text": "I think relevance to consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5457.584,
    "end": 5459.988,
    "text": "So it certainly seems like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5461.345,
    "end": 5467.588,
    "text": " our thoughts, our experiences have this sort of symbolic structure in a way, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5467.608,
    "end": 5471.15,
    "text": "You kind of think of them as like any thought, it's sort of a graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5471.19,
    "end": 5476.712,
    "text": "I have a couple of concepts in mind, maybe in working memory, and I have some idea of how they relate to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5477.053,
    "end": 5481.855,
    "text": "Now, if it's not a graph, it's something like that, maybe some kind of smooth representation of a graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5482.595,
    "end": 5494.023,
    "text": " um on the on the other hand when you just look at the brain all you see is neurons all you see is this distributed high dimensional neural activity so there's this really interesting question of of uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5495.497,
    "end": 5496.518,
    "text": " how you link them together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5496.538,
    "end": 5502.742,
    "text": "And I think attractor dynamics are another interesting avenue for getting there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5502.762,
    "end": 5504.803,
    "text": "And you kind of get a lot of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5504.823,
    "end": 5507.745,
    "text": "You get these high-dimensional continuous states that you could represent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5508.846,
    "end": 5512.448,
    "text": "You get sort of discrete states that you could represent, and they could compose together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5513.009,
    "end": 5517.892,
    "text": "So yeah, I think there's something there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5521.38,
    "end": 5536.898,
    "text": " To kind of extend that point to this very meta-science area of discussion around pluralism in science that Guillaume opened the box on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5538.63,
    "end": 5561.677,
    "text": " when practice in the behavioral lab if not much more broadly is using structures that have different column types then certain kinds of decisions that might have been taken to be in principle or like arguments for the superiority even contextually of one framework those are just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5563.217,
    "end": 5589.309,
    "text": " unveiled purely methodologically as modeler degrees of freedom like whether you use a generative model that's continuous time or discrete time continuous state space discrete state space the thermometer data how you discretized it where you put the thermometer all these broader factors that kind of instantiate the experiment in the pipeline they're just all embodied and cultured",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5590.612,
    "end": 5619.694,
    "text": " niche events in a scientific niche in a social niche and that's a very pragmatic or people might use other words or like realist or i don't know what adjective would describe that take on starting with the scientific community and formal modeling and the modeling process as its own behavioral object and then working to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5621.141,
    "end": 5648.33,
    "text": " have the empirical practice more general like leading the generality open-endedness with practice though that raises so many second order questions as well yeah well we can have also from a very pragmatic standpoint like we need to have reproducibility so to have like those uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5649.238,
    "end": 5676.271,
    "text": " norms in design of experiment and formal tools make sense but we need to just remind ourselves often that they also constrain our way of thinking and typically the history of science show us how mathematics is guided by the problems that we have to solve and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5676.803,
    "end": 5687.211,
    "text": " Typically, if we take quantum mechanics, it was not like the formalism was popped out at first and then quantum physicists use it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5687.251,
    "end": 5692.355,
    "text": "It's like it was a generative process and a collaborative effort between mathematicians and physicists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5693.176,
    "end": 5699.521,
    "text": "And interestingly, they come up even with two different formalisms that were shown to be compatible later on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5699.581,
    "end": 5704.925,
    "text": "So it's a nice tale in a way, showing how you can have even a stronger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5705.822,
    "end": 5716.046,
    "text": " intersubjective consensus by adopting different formalisms that then later on are shown to be compatible and equivalent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5716.066,
    "end": 5733.274,
    "text": "So here I have unfortunately to leave at some point to pick up my daughter, but we can go into category theory and more meta mathematics to try to show that those formalisms in the end are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5734.079,
    "end": 5755.812,
    "text": " potentially equivalent, but from a history of science, I think it's not just about the equivalence, it's also to have different viewpoints that confirm each other to make our idea, our model of the world intersubjectively stable, so to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5756.813,
    "end": 5756.973,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5758.032,
    "end": 5763.014,
    "text": " I'll give a small short closing comment Guillaume and then we'll talk a little bit more, Shu and Eric.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5764.595,
    "end": 5784.444,
    "text": "When I first saw some of your figures for hyperscanning and there were nodes that were being connected with different edges that were within and among brains and there was this one part slash dimension of my experience that was like you can't do that they're not connected it's like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5785.484,
    "end": 5787.225,
    "text": " But it's a statistical causal graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5787.406,
    "end": 5792.95,
    "text": "So they are exactly the same type of explanation and empirical data structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5793.07,
    "end": 5797.313,
    "text": "It's the same exact mutual information, linear causation, whatever you want to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5797.333,
    "end": 5800.235,
    "text": "An edge is an edge in that representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5800.675,
    "end": 5802.337,
    "text": "And that's the map territory situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5802.377,
    "end": 5803.518,
    "text": "They're not the ones that are touching.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5804.398,
    "end": 5814.786,
    "text": "And it was just like by seeing two levels and the way that the representation could be used, it was a proof by example what it meant at one level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5817.881,
    "end": 5819.483,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5819.823,
    "end": 5826.249,
    "text": "It was hard to publish at first because I think of that reason, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5827.77,
    "end": 5828.111,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5828.351,
    "end": 5828.951,
    "text": "Fair ball, Guillaume.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5830.252,
    "end": 5830.433,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5831.414,
    "end": 5833.015,
    "text": "Thanks again for the invitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5833.576,
    "end": 5833.916,
    "text": "Take care.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5838.416,
    "end": 5865.238,
    "text": " so what direction would you like to go or i can read another comment or anyone else in the live chat in our last minute okay let's um kind of uh read last comment from yasha wrote but these attractors presumably correspond to different concepts in the same sentence are not independently sampled sorry i was like verbatim but what are these structures in language",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5867.19,
    "end": 5894.108,
    "text": " in terms of like i thought that was very memorable um thing to say that words are sequences too it's like they're modular with respect to the dictionary but then even the phonemes or the the writing structures have their own compositional logic like a periodic table and then there's sub logics and then there's just different uses of different levels of description",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5896.653,
    "end": 5901.697,
    "text": " which is why we don't speak the same language unless we do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5905.779,
    "end": 5906.0,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5906.2,
    "end": 5911.724,
    "text": "Well, directly, I think what Yash was referring to is like when you sample a sentence, I guess,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5913.271,
    "end": 5917.393,
    "text": " Clearly, these are their own discrete things, but you're not going to be sampling them independently from each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5917.513,
    "end": 5924.136,
    "text": "It's like different words will cohere more or less, and also they'll cohere more or less given a context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5924.817,
    "end": 5928.579,
    "text": "You want to form some kind of sentence that describes some context or some observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5929.119,
    "end": 5936.142,
    "text": "So yeah, in regards to these compositional attractors, again, this is a simple picture where you have different attractors converging along different dimensions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5937.722,
    "end": 5942.125,
    "text": " obviously these attractors are going to affect the convergence of others, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5942.145,
    "end": 5945.507,
    "text": "So it's not like everything is just moving independently along different dimensions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5946.608,
    "end": 5946.768,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5947.448,
    "end": 5960.036,
    "text": "Yeah, I mean, simplifying assumption that we make in our simple computational model used in the paper is that we hide sort of dependencies as noise",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5961.128,
    "end": 5974.751,
    "text": " in the variables to avoid needing to consider these links explicitly to sort of highlight the main points about richness and affability that we wanted to make.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5977.132,
    "end": 5986.894,
    "text": "But I really liked your point, Daniel, about how there is sort of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5987.403,
    "end": 5993.608,
    "text": " the data, there's the physical reality, and then there's the compositional structure that is sort of imposed on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5993.708,
    "end": 5995.19,
    "text": "I mean, it's a model, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5995.23,
    "end": 6007.86,
    "text": "So it's a modeling assumption that you make and you have to choose at what level of abstraction to define that model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6007.98,
    "end": 6009.842,
    "text": "And it can feel a bit arbitrary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6018.979,
    "end": 6024.909,
    "text": " And then you also discussed the idea of, well, we all speak different languages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6024.929,
    "end": 6030.979,
    "text": "Yeah, an interesting question for that in our work is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6033.396,
    "end": 6038.459,
    "text": " Well, OK, would that imply that we have different attractor structures across different cultures that have different languages?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6038.539,
    "end": 6047.263,
    "text": "Is there an interaction there or are these just, you know, these different languages equivalent ways of describing the same state of attractors?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6047.323,
    "end": 6052.006,
    "text": "And I think, you know, it's it's it's somewhere in the middle, regardless of what language we all have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6052.486,
    "end": 6055.348,
    "text": "I think similar concepts and similar conscious experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6056.648,
    "end": 6081.135,
    "text": " uh but there's there's some kind of uh cases where you know you have a word in a given language that uh maybe identifies sort of a fundamental attractor and that's kind of like their part of their their conscious vocabulary i guess whereas you know regardless of what language we speak we'd be able to you know get in that conscious state ourselves but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6082.119,
    "end": 6088.823,
    "text": " maybe given our language, like the attractors that you would need to compose to construct this conscious state would be a bit more complicated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6088.863,
    "end": 6095.428,
    "text": "You'd need something like a longer sentence, a longer thoughts to have the same sort of experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6098.049,
    "end": 6098.39,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6098.69,
    "end": 6110.938,
    "text": "Well, one thing that brought to mind was neural patches on the skin, like different parts of the body have different density of sensory types.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6112.503,
    "end": 6122.915,
    "text": " from very fine scale touch and actuation to some more broader patches like where two needles, you can't determine the difference between them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6124.966,
    "end": 6142.941,
    "text": " and then that relates to many areas to kind of development of taste and differentiability being able to to determine differences and then you um of course use this very like evocative but also grounded",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6144.099,
    "end": 6156.928,
    "text": " dual representation of the samples that are discrete and may have compositional structure with a path that's moving through them and seeking to embed the topology of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6158.098,
    "end": 6181.909,
    "text": " sample points within a information geometry which is the kind that our actual statistics input and then the neural patches are regions where to one person it's like yeah I drove through New Mexico and to the other person it's like every inch they're having this rich experience they know the different stops",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6184.185,
    "end": 6207.863,
    "text": " and then I think one last great point from the presentation was um that we could kind of I'm not exactly sure I've said but emulate this informational characteristic and maybe not even have that the embodiment for that to even have Consciousness of course that'll be the debate then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6209.031,
    "end": 6238.405,
    "text": " but the debate used to be much less sophisticated than that and also people took principle stances yeah i wasn't totally clear on that that last point that you uh that you made principled stances on whether this would be emulating or simulating or approximating analytical framework for consciousness or whether this by implementing that machine",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6239.591,
    "end": 6255.855,
    "text": " that it would be implementing consciousness versus like the kind of linear regression package that does cognitive modeling that could be understood in a purely SPM-like framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6256.435,
    "end": 6266.838,
    "text": "And SPM doesn't take a package perspective, except maybe implicitly on like whether SPM models generate consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6267.856,
    "end": 6270.739,
    "text": " Most likely it's easy to say no because of generalized linear models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6271.499,
    "end": 6281.148,
    "text": "So some people may take an in principle stance that any description or simulation in certain ways, it's all good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6281.748,
    "end": 6283.67,
    "text": "We're definitely not generating anything conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6283.71,
    "end": 6294.76,
    "text": "It's just would purely be a hugely energetically expensive, potentially statistics exercise, which is fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6297.065,
    "end": 6314.476,
    "text": " Yeah, so I mean, the chain of reasoning of our work, I suppose, is that if you assume a certain model of consciousness, then that implies ineffability, as it is understood by information loss.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6315.236,
    "end": 6318.578,
    "text": "But obviously, information loss does not imply consciousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6322.313,
    "end": 6328.655,
    "text": " even though it's an attribute of how consciousness manifests in humans.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6332.196,
    "end": 6348.242,
    "text": "So yeah, I mean, this question of what is the necessary desiderata to declare whether a system is conscious or not is very",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6352.902,
    "end": 6355.785,
    "text": " is not what we discuss in the paper at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6357.447,
    "end": 6364.835,
    "text": "I mean, from my perspective as a machine learning practitioner, it's closer to what I said in the last slide.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6365.315,
    "end": 6369.78,
    "text": "I would like to get the benefits of consciousness in an artificial model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6370.421,
    "end": 6372.763,
    "text": "And it doesn't matter so much",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6373.9,
    "end": 6381.483,
    "text": " whether the form that takes is similar to how it manifests in biological systems or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6382.144,
    "end": 6382.764,
    "text": "Why should it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6383.904,
    "end": 6394.709,
    "text": "I mean, we don't have the kind of resources that evolution has had over a billion years to optimize for this model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6395.749,
    "end": 6396.53,
    "text": "So the question is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6397.813,
    "end": 6417.86,
    "text": " you know, how do we design systems that can benefit from, for example, the generalization and robustness properties that being very contractive in processing can give you rather than, you know, what's the exact definition of consciousness and how do we replicate that in the machines?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6417.9,
    "end": 6420.601,
    "text": "Because that to me is sort of a very superficial concept.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6424.469,
    "end": 6430.054,
    "text": " well, it's a more superficial problem in that it's looking at the how and not the why.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6430.074,
    "end": 6430.154,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6433.176,
    "end": 6436.339,
    "text": "Yeah, I have some thoughts on this also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6436.379,
    "end": 6436.92,
    "text": "So, I mean...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6438.802,
    "end": 6453.893,
    "text": " Jonathan Simon, who's a co-author on our work, he gave a really interesting presentation recently that I heard, which is whatever model of consciousness you assume, let's say global workspace theory, there's a minimal model of it that you could construct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6454.654,
    "end": 6459.077,
    "text": "We could easily construct some kind of model to make this really concrete.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6459.097,
    "end": 6465.982,
    "text": "There's a bunch of mini neural networks that are the sub-processes, and they're communicating through some shared RNN, let's say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6466.782,
    "end": 6482.301,
    "text": " So you can construct a minimal model like this, train it on some task, and then if your viewpoint was that a global workspace theory with such and such properties is what generates consciousness, well, then you'd be forced to say that your minimal model is conscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6483.262,
    "end": 6485.104,
    "text": "And this is, in a way,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6486.568,
    "end": 6491.393,
    "text": " I guess not problematic, but sort of counterintuitive, because the model could be doing really simple things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6491.473,
    "end": 6494.556,
    "text": "It could not even be reporting that it's having any consciousness at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6494.596,
    "end": 6495.857,
    "text": "It might not even have language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6495.877,
    "end": 6500.301,
    "text": "It might just be doing something like solving MNIST in a global workspace type architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6500.681,
    "end": 6504.344,
    "text": "Do you really want to say that that thing is conscious?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6505.706,
    "end": 6508.548,
    "text": "So, yeah, it is a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6509.867,
    "end": 6513.013,
    "text": " a problem, I think, with most theories of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6513.875,
    "end": 6518.304,
    "text": "Maybe one kind of exception in my view is theories that say",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6520.031,
    "end": 6541.667,
    "text": " know we basically have a representation that we're conscious so one canonical example I guess is Michael Graziano's attention schema theory which basically says our brain constructs a model of what attention is doing in the brain and that model basically just describes something that is like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6542.387,
    "end": 6563.076,
    "text": " experience it describes oh i'm aware of these things uh they they have these these properties uh you know i could report that i'm experiencing these things it's basically a representation a set of neural activity uh in in the brain and there um you don't have the same problem where you can construct a minimal model because presumably this representation of consciousness is is uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6563.676,
    "end": 6564.877,
    "text": " is really complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6565.998,
    "end": 6579.609,
    "text": "And then I guess another set of theories would say that even if you emulate whatever processes in the brain we think generate consciousness, the physical implementation might be really important over here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6579.669,
    "end": 6582.692,
    "text": "So the example that comes to mind is IIT, which would say",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6585.218,
    "end": 6597.163,
    "text": " it's basically a substrate dependent in the sense that you could have the exact same function, the exact same mechanism implemented in different ways, like, you know, on a computer processor or a neuromorphic hardware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6597.243,
    "end": 6597.884,
    "text": "And in one case,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6598.963,
    "end": 6603.765,
    "text": " There may or may not be consciousness, whereas you have the exact same function in another substrate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6603.845,
    "end": 6605.466,
    "text": "And yeah, it is conscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6605.666,
    "end": 6615.131,
    "text": "So that's, I guess, another class of theories that would say that emulation does not necessarily imply that you're actually generating consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6615.631,
    "end": 6615.711,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6618.251,
    "end": 6628.984,
    "text": " All in our last two minutes, what are your closing thoughts or next directions, exhortations to the humans and language models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6632.208,
    "end": 6632.388,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6633.029,
    "end": 6633.93,
    "text": "Well, I guess my...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6636.608,
    "end": 6642.172,
    "text": " I'm interested in this stuff a lot from a purely philosophical perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6642.292,
    "end": 6649.297,
    "text": "So, you know, the hard problem for me is really salience of, you know, why would any physical mechanisms generate consciousness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6650.337,
    "end": 6663.405,
    "text": "And the nice thing, at least for me about this work, the most satisfying part of it was that, you know, I initially had this intuition that experiences, you know, what the color red is, it's not just information, it's kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6664.206,
    "end": 6669.267,
    "text": " You know, underdetermined, there's something more than just information because I can't do things like describe it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6670.348,
    "end": 6676.349,
    "text": "But, you know, now now we have a theory that kind of kind of breaks that that intuition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6676.389,
    "end": 6683.331,
    "text": "And now I have a satisfying explanation, I feel, for why I can't describe my experiences, but under a physicalist framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6683.371,
    "end": 6686.292,
    "text": "So I think it'd be interesting to reason through some.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6687.955,
    "end": 6699.301,
    "text": " some other of the thought experiments that make the hard problem salient and kind of, yeah, develop some models that kind of break the intuitions for the hard problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6700.141,
    "end": 6710.887,
    "text": "In my case, at least, like, you know, I've seen it done in this scenario with the topic of ineffability, so there's no reason in principle that it can't be done across other aspects of the hard problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6712.208,
    "end": 6715.85,
    "text": "Yeah, so I think if I were to sum up the work,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6717.819,
    "end": 6720.28,
    "text": " in one very high level sentence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6721.241,
    "end": 6735.547,
    "text": "It's that, well, reasoning subjectively about subjectivity is very difficult, but reasoning objectively about subjectivity",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6736.88,
    "end": 6737.38,
    "text": " is easier.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6737.681,
    "end": 6751.531,
    "text": "And that's sort of what we do in the paper because we take an objective standpoint and we try to formalize or characterize subjectivity from that standpoint.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6753.493,
    "end": 6758.057,
    "text": "So yeah, that sort of makes the picture clearer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6760.619,
    "end": 6764.962,
    "text": "I mean, from my perspective, I'm interested in consciousness",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6767.091,
    "end": 6780.918,
    "text": " mainly in terms of what it offers, what it brings in terms of, for example, improving generalisation of artificial land models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6785.9,
    "end": 6787.641,
    "text": "Yeah, it's interesting because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6790.248,
    "end": 6802.577,
    "text": " So another work that I'm doing is formalizing generalization bounds for information bottleneck, which is a regularization principle used in machine learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6803.038,
    "end": 6816.687,
    "text": "So it's just really interesting how evolution has sort of discovered by itself this regularizer principle",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6818.135,
    "end": 6831.526,
    "text": " that it applies to human cognition, that we can also show mathematically actually does improve guarantees on generalization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6832.727,
    "end": 6835.269,
    "text": "That is really mind blowing to me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6835.589,
    "end": 6835.789,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6837.691,
    "end": 6837.891,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6840.053,
    "end": 6840.193,
    "text": "Wow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6841.806,
    "end": 6843.448,
    "text": " Great presentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6844.729,
    "end": 6846.27,
    "text": "So thank you both for joining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6846.511,
    "end": 6848.192,
    "text": "You're welcome back anytime.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6849.914,
    "end": 6850.514,
    "text": "Thanks so much, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6850.535,
    "end": 6851.255,
    "text": "It was a lot of fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6851.656,
    "end": 6852.076,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6852.116,
    "end": 6852.296,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]