[
  {
    "start": 8.39,
    "end": 24.889,
    "text": " hello and welcome everyone to the actin flab guest stream number 7.1 007.1 actually very nice number it's may 28 2021 and we have some very special guests on today who i will let themselves",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.95,
    "end": 31.315,
    "text": " introduce themselves, and then we'll go into a presentation, followed by a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.815,
    "end": 40.422,
    "text": "So any and all questions and comments, just put into the live chat during the presentation, and I'll be compiling those so that we can make sure to ask them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.963,
    "end": 43.025,
    "text": "So please, Miguel, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.666,
    "end": 45.186,
    "text": "Okay, hi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 45.487,
    "end": 46.928,
    "text": "Yeah, I'm Miguel Aguilera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.768,
    "end": 52.192,
    "text": "I'm working as a postdoc since a year now at the University of Sussex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.994,
    "end": 54.114,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.914,
    "end": 59.495,
    "text": " Yeah, so my name is Christopher Buckley.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 59.575,
    "end": 67.797,
    "text": "I'm a lecturer at the University of Sussex in both the Sussex Neuroscience and Sussex AI groups interested in sensory motor control in general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 69.538,
    "end": 69.798,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.198,
    "end": 72.839,
    "text": "So, Miguel, share your screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.919,
    "end": 75.98,
    "text": "I'll resize it and then we'll have a presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.02,
    "end": 76.74,
    "text": "Take as long as you'd like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.734,
    "end": 81.438,
    "text": " Okay, thanks a lot for the invitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.458,
    "end": 83.781,
    "text": "I'm really happy to present our work here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.821,
    "end": 93.932,
    "text": "It's been really fast because we just released the pre-print a few days ago, but it's cool to have the opportunity to do this discussion online so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.052,
    "end": 94.853,
    "text": "Okay, let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.413,
    "end": 96.294,
    "text": "Okay, can you see my screen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.035,
    "end": 99.378,
    "text": "Yep, and I'll resize it now, so go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.686,
    "end": 120.999,
    "text": " Okay, so this is a PowerPoint that we have just published with Miguel Aguilera, and I wrote it with Bermilich, Alexander Sanz and Christopher Buckley, all from Sussex, but except for Berendas now in Oxford.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.94,
    "end": 130.362,
    "text": " And so the work is to focus on some of the recent publications about the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.742,
    "end": 145.708,
    "text": "I guess most people watching will know that the free energy principle was conceived originally as a unified brain theory integrating experimental data and trying to describe the relationship between action, perception, learning, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.628,
    "end": 175.838,
    "text": " And more recently, the theory has evolved and tried to become more general, stating that any non-equilibrium dynamical system under some special conditions can be interpreted as performing Bayesian inference, and this will be a broader living system or a way to describe how certain living systems behave using the tools from Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 177.537,
    "end": 190.863,
    "text": " and and okay so so this is kind of so in principle this this kind of schema of how a brain is predicting an environment could be using different systems like a cell or different living beings and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.076,
    "end": 201.363,
    "text": " I imagine anyone familiar with the primary principle have seen this kind of pictures a lot, and we're trying to do different ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.443,
    "end": 210.07,
    "text": "So I think it's maybe a good thing to try to visualize things in any ways, because these ones have been repeated so many times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.87,
    "end": 219.276,
    "text": "Okay, so the idea is, so we are interested in exploring the different assumptions behind the principle because,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.377,
    "end": 234.666,
    "text": " In theory, the free energy principle applies to very diverse systems, but in practice, there has been very few attempts to explore all the steps of the theory in specific systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.406,
    "end": 236.727,
    "text": "What we want to do here is just that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.487,
    "end": 247.554,
    "text": " And we want to understand the free energy principle and its mathematical assumptions in the simplest system, in the simplest non-equilibrium system that we can find.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 247.674,
    "end": 251.717,
    "text": "And this is a linear Langevin dynamics that I will explain later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.561,
    "end": 256.226,
    "text": " and the assumption that the Coplings between elements are weak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.786,
    "end": 269.001,
    "text": "And in this very special case, we can compute all the relevant variables analytically, and this is a very interesting case for studying in depth all the mathematical details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.123,
    "end": 293.022,
    "text": " Okay, so the work I'm presenting today is related to the latest publications around the ideas of the FIP, the monograph, A Free Energy for a Particular Physics, and the most recent paper by Thomas, Lance, and Carl about Markov blankets, information geometry, and stochastic thermodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.248,
    "end": 297.35,
    "text": " And specifically, we want to focus on two questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.37,
    "end": 301.753,
    "text": "The first question is, how general is the free energy principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 301.973,
    "end": 313.84,
    "text": "That is, from all the systems that we can imagine can capture aspects of biological systems, how many of them conform to the assumptions that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.64,
    "end": 343.821,
    "text": " that the the principle requires and the second question is how informative is the principle about the behavior of a system so if if a system uh if the first point holds so if a system co conforms to all the requirements of the principle then how much how much do we know about the system right how much the principle is able to inform us about the behavior of this organism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.157,
    "end": 352.301,
    "text": " Okay, so we find two issues that I will explain later in detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 352.361,
    "end": 367.449,
    "text": "One is that some of the requirements of the principle make it challenging to find systems in the class of systems we explore that match the required assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 367.589,
    "end": 372.772,
    "text": "And the second issue we found is that one important step",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.804,
    "end": 393.563,
    "text": " in connecting the behavior of the system to the gradient of the free energy principle involves decoupling from the history of interaction of a system, and this creates problems in the interpretation of a system behaving as if minimizing a free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.663,
    "end": 395.144,
    "text": "I will explain that in detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.665,
    "end": 398.528,
    "text": "So before starting, just one quick",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.392,
    "end": 406.378,
    "text": " A note on the notation we are using, which is a bit different from the papers and some of the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.458,
    "end": 424.532,
    "text": "We are describing external, sensory, active, and internal state with this C, which is composed by external states Y, sensory states S, active states A, and internal states X. Here, also differently than in the papers, both symbols represent a vector and matrices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.333,
    "end": 436.032,
    "text": " So expectations instead, which were bold in some of the papers, here are represented by these m variables, like m, y, m, s, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.354,
    "end": 465.7,
    "text": " and sometimes the theory uses conditional expectations given a blanket state and in this case the the blanket state the conditional state is going to be between parentheses so this is the mean of y the mean of external states given b and also we can compute time derivatives as usual and we will represent marginal flows as these f variables that i will describe later okay so so first we try to summarize the different conditions and assumptions that one needs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.3,
    "end": 467.802,
    "text": " to derive the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.683,
    "end": 472.367,
    "text": "And I'm going to make a bit summary, which will be useful for later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.57,
    "end": 483.02,
    "text": "So first, the free energy principle assumes we have a system that we can describe as a Langevin stochastic differential equation, and this is just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.646,
    "end": 510.312,
    "text": " having a noise term, this omega, which is just random and uncorrelated, a white noise, and some flow function f that could be any potentially nonlinear function that describes this time derivative, this evolution, this deterministic part of the evolution of a variable c. And in principle, the omega is a Gaussian term and its covariance is just a diagonal matrix, a gamma,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.609,
    "end": 513.951,
    "text": " because all the noise is independent between elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.792,
    "end": 531.465,
    "text": "Okay, so the first condition that the free energy principle requires is that the flow function decouples what it's generally called autonomous and non-autonomous states, meaning that internal states X are not going to influence external and sensory states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.641,
    "end": 536.586,
    "text": " And external states are not going to influence active and internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.646,
    "end": 542.834,
    "text": "And so this is what we generally expect from a sensory motor loop in an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.615,
    "end": 548.921,
    "text": "And so we represent this evolution of the system like a neural integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.882,
    "end": 557.067,
    "text": " So the external states do not influence active and internal, and internal states do not influence external and sensory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.787,
    "end": 564.332,
    "text": "Okay, so we are going to require, restrict organisms to systems that have this sensory motor structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.133,
    "end": 567.954,
    "text": "The second condition of the principle is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.997,
    "end": 590.598,
    "text": " This system has a global attractor, that is, that the probability distributions of the state of a system converge to some specific probability distribution, which is called p. And this p can be described by the surprise, which is the negative logarithm of the probability, which is how surprising or how unlikely is a state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.827,
    "end": 615.277,
    "text": " And this condition proposes that this global attractor or this steady-stated distribution can be described by a decomposition, a helpful holds decomposition or an AO decomposition, which relates the flow function with the surprise via two matrices, Q and gamma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.357,
    "end": 618.499,
    "text": "Gamma, we saw it before, it was just the covariance of the noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.714,
    "end": 642.77,
    "text": " and q is a matrix capturing what's generally called the solenoidal flows in the system and q is an it's asymmetric and the solenoidal flows of the system mean mean that it capture the non-equilibrium influences in the system if if a system is at thermodynamic equilibrium then q is going to be zero",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.43,
    "end": 654.019,
    "text": " for all elements, but if the system has an exchange of matter or energy or has some asymmetry in the interaction between the parts, Q is going to be non-zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.581,
    "end": 672.894,
    "text": "Okay, so we are going to have this diffusion terms, gamma, which are these dotted lines, and then we are going to have cobblings between elements with these solenoidal influences that are captured by these blue arrows here, these weekly arrows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.826,
    "end": 675.507,
    "text": " Okay, so that's the second condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.567,
    "end": 679.93,
    "text": "And the last condition that the free energy transport requires is the Markov blanket condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.97,
    "end": 694.101,
    "text": "This is, yeah, maybe very well known, which requires that the sensory motor states S and A, which are generally called a blanket state, that we are going to call V, compressing the two,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.961,
    "end": 722.218,
    "text": " uh so the the condition requires that this variable and are going to play a very special role decoupling internal and external states in the following way and they are going to if if we complete a conditional distribution fixing v and of external internal states this states is going to be independent for a fixed v so they are not independent in general but they are independent for a specific blanket state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.412,
    "end": 746.481,
    "text": " So if these arrows are statistical dependencies, the given B, we have Y and X, but they are not statistically correlated for a given B. And in this sense, these blanket states are going to be like a boundary or a barrier between external and internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.99,
    "end": 765.813,
    "text": " Okay, so these are the conditions required by the free energy principle in our view, meaning that these are the prerequisites that we require for a system to display the properties proposed by the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.088,
    "end": 774.755,
    "text": " Okay, but aside of that, we interpret that the theory has some three extra assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.315,
    "end": 783.883,
    "text": "So these are not conditions, these are not prerequisites, but things that the theory expects to happen or expects to find, at least in some cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.764,
    "end": 791.83,
    "text": "And for explaining this, we explained before how the theory proposed that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.23,
    "end": 797.496,
    "text": " and variational free energy is involved in the behavior of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.736,
    "end": 810.593,
    "text": "So the free energy principle proposes that any system under these conditions that I described can be seen as minimizing or as if it's going to behave as if minimizing a variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.491,
    "end": 816.872,
    "text": " So for defining this free energy, we start with the surprise of the blanket state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 816.892,
    "end": 820.793,
    "text": "So the blanket state is what an agent can observe in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.453,
    "end": 831.095,
    "text": "The agent cannot access the environment directly because of the sensory metastructure that we have, but only can access the blanket state, the sensors and the actuators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.035,
    "end": 838.696,
    "text": "And if a system is behaving as if minimizing the free energy or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.917,
    "end": 849.3,
    "text": " And doing Bayesian inference, a system is going to behave as if minimizing the, yeah, the surprise of this state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 851.281,
    "end": 862.124,
    "text": "And okay, but the system cannot access this probability distribution directly, but because it doesn't really, cannot access the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.764,
    "end": 868.226,
    "text": "So instead of that, a Bayesian inference prescribes to use a lower bound of the surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.421,
    "end": 888.808,
    "text": " and okay which is called a variation of free energy and this variation of free energy consists on the surprise term plus some divergence with some kl divergence between the actual probability distribution of the environment given the blanket and a model q a simplified model of the environment and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.83,
    "end": 904.927,
    "text": " and by and by this inference consists in finding the parameters theta of this model that minimize this this distance so in this so when this distance is minimized then the agent has a model of the world and is predicting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.989,
    "end": 913.213,
    "text": " the states of the environment Y. Okay, so solving the Bayesian inference problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.293,
    "end": 931.662,
    "text": "So the simplest way of doing it is just doing a gradient descent minimization of this free energy, which ends up in being a gradient descent of the surprise of the environment Y at the most likely state theta and blank.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.665,
    "end": 936.14,
    "text": " Okay, so here theta just parameterizes the most likely state of y.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.252,
    "end": 958.041,
    "text": " Okay, so then the free entry principle defines the most likely states of the system and the environment, picks in a blanket, just like the mode or the argmax, but sometimes it has been proposed that the mean is enough for doing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.721,
    "end": 962.022,
    "text": "And since we are going to use linear systems, they both are going to be the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.062,
    "end": 964.884,
    "text": "So you can interpret this M as the mode or as the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.385,
    "end": 988.966,
    "text": " as the mean of y and x given b. And then, if you remember, we have these flow functions f. You can compute the average flow of the system y for a given b, which we saw in this assumption that can be described by this matrix q and gamma and the gradient on the surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.847,
    "end": 1003.57,
    "text": " So if we want to find something like the gradient of the surprise that we have here, the free energy principle proposes that we have to compute the average of the flow, given B, and we obtain something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.49,
    "end": 1007.651,
    "text": "And we can see here that the first term is just what we want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.691,
    "end": 1011.852,
    "text": "It's the gradient, it's related with the gradient of the surprise, but we have some extra terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.395,
    "end": 1042.354,
    "text": " And so if we have some gradient like this, we could, if we had something like the first term in this equation, we could interpret, we can use this gradient to perform, we could use this gradient to perform a minimization of this energy, which interpret, if we interpret it strictly, it could mean having some variable theta that follows this gradient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.453,
    "end": 1044.254,
    "text": " Oh, sorry, one second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.675,
    "end": 1045.935,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.637,
    "end": 1048.858,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.538,
    "end": 1051.68,
    "text": "So, so if we have some, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.76,
    "end": 1059.126,
    "text": "So, and the free energy principle suggests that this parameter theta is going to be the most likely states of external or then internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1059.727,
    "end": 1060.387,
    "text": "And we're going to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.028,
    "end": 1066.052,
    "text": "So we have, sorry, we have this equation here, this equation 12, and we just need the first term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.352,
    "end": 1069.515,
    "text": "So in general, the free energy principle proposes that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.199,
    "end": 1080.424,
    "text": " the couplings of this matrix Q are going to be zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1080.944,
    "end": 1089.709,
    "text": "So each element in this diagonal is a block, can have a number of dimensions, and the free energy principle assumes that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.353,
    "end": 1112.152,
    "text": " Well, one interpretation is that it assumes that removing these solenoidal couplings, these non-block diagonal couplings, then we are going to remove these elements that we don't want, and we are going to have a flow of the system equal to this gradient on the surface, that is the gradient that minimizes the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.174,
    "end": 1116.075,
    "text": " Okay, so this is the first assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.255,
    "end": 1125.198,
    "text": "If these two terms are equal to zero, then we have an average flow that goes in the direction of minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1125.458,
    "end": 1131.82,
    "text": "And this is interesting because we will have a system that points in the direction of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.04,
    "end": 1133.861,
    "text": "And I will explain that later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.621,
    "end": 1161.894,
    "text": " However, in some works, it is proposed that there's a more general form of this matrix that is not, it's also block diagonal, but not within Y and S and A, but within autonomous and non-autonomous states, so Y and S and A and X. And this has been referred as the general case, but for us at least, it's not that clear how you can derive in this case this gradient of the free energy and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.674,
    "end": 1168.596,
    "text": " Well, it's suggested that the solenoidal couplings can cancel out, but yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.176,
    "end": 1177.058,
    "text": "So, we are going to consider the two cases, but consider in principle just the case of a complete block of a diagonal matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.038,
    "end": 1184.36,
    "text": "So, this first assumption means that the solenoidal couplings between elements can be approximated as zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.42,
    "end": 1188.781,
    "text": "Okay, the second assumption,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.39,
    "end": 1197.432,
    "text": " is, okay, so we have a flow of external states that's pointing in the direction of minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1198.212,
    "end": 1202.833,
    "text": "But we want to interpret internal states as minimizing this free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.433,
    "end": 1206.134,
    "text": "So what the free energy principle proposes to solve this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.634,
    "end": 1215.616,
    "text": "So the proposal is that there is a smooth mapping sigma that connects the most likely internal states with the most likely external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.156,
    "end": 1231.799,
    "text": " So this MY is equal to sigma X. And the assumption is that there's a gradient, or there's a derivative of this mapping that exists, so the mapping is differentiable, and that it is invertible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.74,
    "end": 1240.501,
    "text": "And they propose that a sufficient requisite for this assumption too is that the mapping from B to MX is injected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.361,
    "end": 1252.946,
    "text": " Okay, and so if this mapping exists, then we can connect the external states with the internal states, and we know that the external states have a flow that points in the direction of minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.806,
    "end": 1261.389,
    "text": "And so the hope is that now internal states, if this mapping exists, are going also to have a flow that's pointing in the direction of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.829,
    "end": 1288.998,
    "text": " And the last assumption, and this is maybe more controversial, is that if one has a strict interpretation of the gradient descent of a free energy, the assumption will be that the dynamics of the most likely states are approximately equal to the dynamic to the average flow of the external state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.918,
    "end": 1314.247,
    "text": " so so this is the derivative of the average state and the right side will be the average of the derivative to some so so so this is saying something like this no approximately the derivative of the average is going to be equivalent to the average of the derivative because the flow is just the time derivative of the of the system uh so and if this assumption will be true then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.071,
    "end": 1323.986,
    "text": " not only the flow of external states point in the direction of the free energy, but also the dynamics of the system are minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.656,
    "end": 1332.16,
    "text": " And this is interesting because if we had this, if this is true, then we have some equation like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.32,
    "end": 1337.464,
    "text": "So the derivative of my is equal to the gradient respect to my of this surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.085,
    "end": 1343.309,
    "text": "So the dynamics of my are behaving as if minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.989,
    "end": 1354.337,
    "text": "So if this equation 20 is true, we know that the dynamics of the behavior of the system is going to be minimizing, actively performing a gradient descent on the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.567,
    "end": 1367.276,
    "text": " And if this is true and we have the mapping that Assumption 2 proposed, then we can use the chain rule to find the connection between the derivative of my and the derivative of my.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.296,
    "end": 1374.101,
    "text": "So the dynamics of the external states and the dynamics of the internal states just with the gradient of this sigma function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.742,
    "end": 1377.004,
    "text": "So this is just a chain rule of derivatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1379.025,
    "end": 1381.447,
    "text": "And with this step, then we can describe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.305,
    "end": 1407.868,
    "text": " dynamics of internal states as the dynamics of external states and use this gradient mapping to reach this equation 23 that tells you that the dynamics of the most likely internal states is doing a gradient descent on the free energy so this is the end of the argument of the free energy so if this is true then the internal states will be behaving as if minimizing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.769,
    "end": 1419.358,
    "text": " the free energy about external states and then the internal state will be behaving as if effectively performing a Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.9,
    "end": 1437.993,
    "text": "And well, we derived that from some of the steps in these publications in the monograph of a particular free energy for a particular physics and the most recent paper by Thomas about Markov-Langen's information geometries and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.613,
    "end": 1464.83,
    "text": " because they or at least it appeared to us that they were using the same symbol for the derivative of external states and the average flow and because so in some equation there is a connection between the ns so for the chain rule they use this symbol and what and so so this is why we interpret this in the in this way okay however and also from conversation from the authors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.01,
    "end": 1472.735,
    "text": " It's proposed that the free energy principle is not exactly proposing the behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.936,
    "end": 1490.368,
    "text": "So, an interpretation of the principle would be that the system is not doing a strict gradient descent as this assumption 3 that we label with this star, because it's in part our interpretation, but that an alternative to this assumption star 3 will be assumption star star 3,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.483,
    "end": 1502.049,
    "text": " which is that it is not the derivative of the most likely state that follows the gradient of the free energy, but just the flow, the average flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.069,
    "end": 1512.235,
    "text": "So the average flow of f is just the average of the derivative of y, given v, the conditional average with the conditional distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.815,
    "end": 1521.12,
    "text": "And the claim will be that if the flow is pointing, so if the average derivative is pointing in the right direction of the free energy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.894,
    "end": 1529.82,
    "text": " then you can interpret that the system is behaving as if, on average, it was performing a gradient descent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.521,
    "end": 1537.947,
    "text": "So this assumption star star three will be that not that the system is exactly doing a gradient descent on the free energy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.627,
    "end": 1540.289,
    "text": " but that it is doing on average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1540.369,
    "end": 1554.521,
    "text": "If we have many observations of the system, then we could see that they, on average, point to a many-way system of free energy, but maybe not if we just observe one system individually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.751,
    "end": 1560.154,
    "text": " Okay, and then this assumption of star three will be that, yeah, exactly that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.334,
    "end": 1570.942,
    "text": "If the conditional average flows follow the direction of gradient descent on the free energy, then the behavior can be described on average as if minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.363,
    "end": 1582.51,
    "text": "Okay, so this is the summary of the different conditions and assumptions of the principle in which we could have competing interpretations at some points like this assumption of three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1584.837,
    "end": 1590.009,
    "text": " Okay, this is a lot of steps and it is hard to intuitively",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.771,
    "end": 1597.436,
    "text": " have an idea of how we can expect from any of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.057,
    "end": 1610.246,
    "text": "So what we did is we tried to explore these different conditions and assumptions in a very easy system to solve and see what we can expect in this very simplest case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.447,
    "end": 1616.892,
    "text": "So the best way to really understand this is to have a toy model, the simplest we can have,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1619.106,
    "end": 1624.37,
    "text": " and see how easy or hard is for the different assumptions to be held by the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.27,
    "end": 1631.855,
    "text": "Okay, so we substituted the Langevin dynamics that we had before by just a linear Langevin dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1632.115,
    "end": 1633.076,
    "text": "So everything is the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.236,
    "end": 1639.662,
    "text": " And well, we have a factor for the noise, but this is going to be just one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.343,
    "end": 1647.553,
    "text": "And we have now the f function, the flow is just substituted by a linear multiplication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.573,
    "end": 1648.494,
    "text": "So we have a matrix J,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1649.884,
    "end": 1666.06,
    "text": " which is an invertible, a real, which is multiplying the state of the system minus some constant rho, which is just going to be an offset capturing the average state in a steady state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.189,
    "end": 1674.918,
    "text": " And this system is going to be a non-equilibrium system if the matrix J is not symmetric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.979,
    "end": 1678.442,
    "text": "So in that case, we are going to have a non-equilibrium system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.902,
    "end": 1682.106,
    "text": "And we are going to have, for example, spiral flows and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.774,
    "end": 1688.077,
    "text": " And the interesting thing is that this system has a steady state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1688.517,
    "end": 1700.303,
    "text": "If we let the system run for some time, it's going to have a steady state that's going to be a Gaussian distribution, because if everything is linear and the noise is linear, eventually the system is going to reach a steady state Gaussian distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.924,
    "end": 1704.526,
    "text": "And in the limit of time going to infinity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.206,
    "end": 1715.208,
    "text": " the average of this Gaussian is going to be just this raw parameter, and the covariance matrix of this multi-varied Gaussian is going to be this sigma star matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.489,
    "end": 1724.07,
    "text": "And this sigma star matrix cannot be solved analytically, but it's the solution of this equation 29.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.211,
    "end": 1729.812,
    "text": "It's an equation that involves the covariance of the noise gamma and the co-op links J.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.014,
    "end": 1739.717,
    "text": " If in equilibrium, this matrix, this equation can be solved analytically, but we are interested in more generally in non-equilibrium systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.997,
    "end": 1744.259,
    "text": "And this equation is called a continuous Lyapunov equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.299,
    "end": 1758.404,
    "text": "And in principle, it can be just solved numerically, which is not ideal for us because we want to access, to have the connections between the parameters and the matrix, but we cannot in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1761.604,
    "end": 1763.345,
    "text": " Okay, so what did we do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.166,
    "end": 1770.189,
    "text": "So in order to have a solution of this equation, a general solution, we assume the following.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.249,
    "end": 1782.275,
    "text": "We assume that the couplings of J can be defined as some diagonal term I, and this is negative just to ensure the stability of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.295,
    "end": 1787.718,
    "text": "So if I is positive and large, then you will have a diverging system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.238,
    "end": 1796.788,
    "text": " And then we have non-diagonal couplings C, and we assume that these C terms are small.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.108,
    "end": 1803.136,
    "text": "So if we have C square or C to the power of three, these are going to be neglectable terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.08,
    "end": 1811.082,
    "text": " And in that sense, we can say that we can solve this equation, you know, in terms of our power series expansion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.122,
    "end": 1816.604,
    "text": "So we can have like, so this will be equivalent to a Taylor expansion that you can see in calculus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.344,
    "end": 1831.528,
    "text": "And we can have an expression of the sigma, the covariance matrix of the solution in terms of increasing powers of C. So we have C, the linear term, the quadratic terms, and some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.318,
    "end": 1834.099,
    "text": " cubic terms that we are going to ignore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.899,
    "end": 1847.105,
    "text": "Okay, and to make things more easier, we are going to assume that the noise is homogeneous, so sigma is just identity matrix times some constant, some scalar constant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.065,
    "end": 1848.286,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.486,
    "end": 1859.171,
    "text": "So, okay, so we choose values of, so if y, so the conditions one and two are almost automatically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.971,
    "end": 1870.263,
    "text": " If Y is negative and larger than C, we have a global attractor and also we can define J to have the sensor motor structure that we want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.024,
    "end": 1873.507,
    "text": "And so we go directly to condition three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.392,
    "end": 1891.881,
    "text": " So condition three is the Markov blanket condition proposing that the blanket states or the sensor motor states play a very special role being a boundary between external states and internal states so that the distribution, the conditional distribution is an independent distribution given the blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.741,
    "end": 1893.762,
    "text": " y and x are independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.223,
    "end": 1914.919,
    "text": "So, in a Gaussian distribution, this condition is true if and only if the Hessian matrix, which is the inverse of the covariance, satisfies that the Hessian between y and x, the Hessian between internal and external states, remember that this can be a matrix if the dimensions of y and x are more than one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.063,
    "end": 1916.944,
    "text": " is equal to zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.446,
    "end": 1925.132,
    "text": "Okay, so we can very easily compute what's the form of this Hessian with these approximations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.672,
    "end": 1928.675,
    "text": "So we have the question, how common are Markov blankets?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.695,
    "end": 1938.304,
    "text": "From all the systems in the world, how often can we expect, if we have just random parameters, to find a Markov blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.494,
    "end": 1946.399,
    "text": " Okay, so we want this matrix H, which is the inverse of the covariance of the steady state distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.62,
    "end": 1958.567,
    "text": "And we can express this inverse, again, as a power series, and this is called a Newman series for computing the inverse of a matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.528,
    "end": 1960.809,
    "text": "And it has this form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.949,
    "end": 1966.713,
    "text": "We have, again, a linear term and a quadratic term and some cubic terms that we're going to ignore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.836,
    "end": 1976.624,
    "text": " Okay, and so we just need to know C to know how, what's H and to know if this corner of the matrix is equal to zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.565,
    "end": 1989.676,
    "text": "Okay, so C is going to be like this because we impose these specific sensor motor structures in which external states don't influence internal and internal don't influence external and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.977,
    "end": 1993.86,
    "text": "And so for the first order approximation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.123,
    "end": 1996.004,
    "text": " We have this equation 36.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1996.144,
    "end": 2009.15,
    "text": "Okay, so for a first order approximation, we just keep this term of the equation, which is C plus the transpose, just switching rows and columns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.97,
    "end": 2017.013,
    "text": "And we can see that if we sum C plus the transpose, the term in the corner is going to be equal to zero, which is what we want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.274,
    "end": 2025.019,
    "text": " So for a first-order approximation, we have an exact Markov blanket, and the Markov blanket is always going to be true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.119,
    "end": 2026.561,
    "text": "So this is good news in principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.701,
    "end": 2042.213,
    "text": "And, however, if we want more precision and we compute a second order, so we get these quadratic terms here, we find that the corner of the Hessian, the one that has to be zero, has this form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.357,
    "end": 2049.921,
    "text": " So in principle, this is not going to be zero or is going to be zero just for very special cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.762,
    "end": 2072.034,
    "text": "And if we look at the connectivity structure of the system, so the kind of sensor motor loop that we require in general is this canonical loop at figure A. So in principle, for this structure, very few systems are going to have a Markov blanket because this is not going to be zero exactly almost never.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.771,
    "end": 2077.153,
    "text": " However, there is some other configurations that are going to have a Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.273,
    "end": 2091.804,
    "text": "If we have a circular loop, like this case B, or we have something like this structure in C, then the terms appearing in this equation are, at least one of them is zero in both cases, and this is going to be zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.824,
    "end": 2098.269,
    "text": "So B and C are going to have a Markov blanket in general, but not A under a second-order approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.678,
    "end": 2113.027,
    "text": " And so under this canonical flow constraint, so case A, only a few systems are going to display an exact mark of blankets, although about one exception are going to be the circular loops or the symmetric loops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2114.339,
    "end": 2126.007,
    "text": " And however, to be fair, we have to say that in the case of weak couplings, the Markov blanket, this is still going to be a reasonable approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2126.868,
    "end": 2137.255,
    "text": "Because if we have some equation like this, so the first term, so even if we have something like this, this is a second order equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.035,
    "end": 2142.84,
    "text": " And all the other elements in the matrix are going to have first-order components that are going to be much larger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2143.421,
    "end": 2151.41,
    "text": "So even if we do not have an exact Markov blanket, it's going to be a reasonable approximation in most cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.611,
    "end": 2154.733,
    "text": "Okay, so this is condition one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.094,
    "end": 2155.934,
    "text": "Condition three, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.175,
    "end": 2157.296,
    "text": "So let's go to the next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.356,
    "end": 2158.617,
    "text": "The next one is assumption one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.858,
    "end": 2169.943,
    "text": " which states that the solenodal couplings between blocks of state have to be zero in order to have a flow that points in the direction of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.883,
    "end": 2178.027,
    "text": "Or we could relax this assumption and have these larger blocks but also requiring some zeros in here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.626,
    "end": 2195.92,
    "text": " Okay, so we can rewrite the previous solution of the steady state equation to find a connection between Q, gamma, and J. And doing that, we'll reach, rewriting the previous equation, we can reach this equation 40.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.615,
    "end": 2206.823,
    "text": " And again, this equation cannot be solved directly, in general, because it's another continuous Lyapunov equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.803,
    "end": 2221.454,
    "text": "But assuming that we have J equal C minus Y, and the coordinates are small, as we had before, we can do the same trick and have a new power series that connects Q with the values of C, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.574,
    "end": 2225.918,
    "text": "And has this form, which is similar, but a little bit different than the case before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2228.734,
    "end": 2231.681,
    "text": " Okay, but this case looks a little bit more complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.761,
    "end": 2235.731,
    "text": "So first we just completed the first order expansion of Q.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2237.499,
    "end": 2259.442,
    "text": " and it looks like this so so this is q for a first order case ignoring this the quadratic terms of c okay and again we see that there is in principle few cases where and the yeah where the assumption is held exactly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.163,
    "end": 2264.369,
    "text": " because we want to make zero all these terms here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.451,
    "end": 2272.02,
    "text": "And if we don't constrain the possible parameters, this is going to be true only in very, very special cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.361,
    "end": 2279.045,
    "text": " And we can see that one way to make zero many elements of this matrix is assuming that they are symmetric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.645,
    "end": 2290.352,
    "text": "If CYS is equal to the transpose of C, so if the connections from sensor to environment are equal to the connections of environment to sensor, then this is going to be zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.273,
    "end": 2299.738,
    "text": "And in that case, we obtain this matrix, which has a lot of zeros, but still there is these terms that we cannot get rid of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2300.499,
    "end": 2302.22,
    "text": "So if these cobblings are not zero,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.016,
    "end": 2307.881,
    "text": " then we don't have the assumption of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2308.942,
    "end": 2320.497,
    "text": "And this is important because this will be the connection from actuators to the environment, which in principle is something we expect in many cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.298,
    "end": 2335.433,
    "text": " And this is the connections from sensor to internal states, which is also something we expect in most sensory motor, or we intuitively expect from a cognitive system with a sensory motor group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.788,
    "end": 2357.598,
    "text": " and if we want to make these elements of the matrix equal to zero then we need to have something like this loop c in which these elements are symmetric the j's the non-diagonal j's are symmetric and also we remove the connections from sensor to internal states and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.098,
    "end": 2368.289,
    "text": " and actuators to external state, which is intuitively a bit strange, but I think in some of the literature of the free energy principle, this kind of loop has been used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.27,
    "end": 2375.676,
    "text": "And it has proposed that this could represent, for example, the membrane of a cell",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.377,
    "end": 2398.836,
    "text": " that separates the internal and external states in this kind of symmetric manner although i think there is some well there's some research on cell membranes indicating that asymmetries in the membranes are still important so this could be still a potential issue for finding systems that that that have this this zero this block diagonal q",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.074,
    "end": 2405.978,
    "text": " And if we consider the second-order approximations, things become spookier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.478,
    "end": 2422.911,
    "text": "We have many, many terms, and we see that these elements are just going to be zero in a very narrow set of cases, which is potentially problematic for asserting that the principle is general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.471,
    "end": 2426.714,
    "text": "This assumption will be general for many systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.24,
    "end": 2442.14,
    "text": " And this also gives you an idea that we are studying this very special case with very weak couplings, but having stronger couplings, in principle, would make things more complicated and not easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.624,
    "end": 2466.434,
    "text": " and okay so this is assumption one uh we only are going to get this block dioral and there are very specific circumstances and this as the only exception being this symmetric look with this very very special structure and so so this is so so in conjunction the mark of blanket exploration and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.337,
    "end": 2482.18,
    "text": " And the expression of these sojournal couplings will indicate that under the class of systems that we studied, the free energy principle will only emerge exactly for a very narrow set of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2483.12,
    "end": 2490.322,
    "text": "So this is interesting to think about how general the principle is or how can we expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.623,
    "end": 2514.76,
    "text": " it to be to be found in in in different classes of systems although we just restricted our analysis to these linear ones and okay so the second assumption and connected to the question of how general not not how general but how informative the system is the second assumption is is that we have this mapping between internal external states and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.167,
    "end": 2524.433,
    "text": " And if we compute the most likely internal and external states given a blanket, for a Gaussian distribution, we can do it very easily to compute in a conditional average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.914,
    "end": 2530.558,
    "text": "And so these are the equations you can find in textbook multivariate Gaussians.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.979,
    "end": 2543.968,
    "text": "And we find that if this requires to compute the generalized inverse of some matrix, and we find that we can, in linear systems,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.709,
    "end": 2555.917,
    "text": " In some cases, if the kernels of this matrix are correct, then we can derive the mapping, but these mappings, if we have the correct dimensionality, will exist very broadly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.518,
    "end": 2564.184,
    "text": "So this mapping is just going to be a linear matrix multiplication of the relation between m, y, and mx.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.624,
    "end": 2565.705,
    "text": "So this is good news.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2565.825,
    "end": 2573.091,
    "text": "First of all, this mapping exists, and it can be expected to be very broad if the dimensions of these variables are correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.32,
    "end": 2590.132,
    "text": " Although maybe we should note that in some of the literature, some of the verbal descriptions say that this mapping is a consequence of the Markov blanket, but what we found here is that they are in principle independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2590.772,
    "end": 2595.576,
    "text": "They could emerge even if there is not a Markov blanket, at least in linear systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.577,
    "end": 2603.403,
    "text": "And also we discovered that this result was also found independently,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.383,
    "end": 2609.267,
    "text": " by Lance D'Acosta in a work that is going to be published soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.887,
    "end": 2613.91,
    "text": "And it's, I think that they got to the exact same result as we did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.251,
    "end": 2619.794,
    "text": "Okay, so going to the last assumption which is maybe the most complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2621.055,
    "end": 2624.758,
    "text": "So the last step of the free energy principle was to say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.538,
    "end": 2630.839,
    "text": " we know that the flow of external state, the average flow y, is pointing in the direction of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.019,
    "end": 2635.2,
    "text": "And this means that the system is behaving as if minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.96,
    "end": 2641.561,
    "text": "And I described that there is two possible interpretations for this, a strict one and a relaxed one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2641.681,
    "end": 2652.803,
    "text": "So let's explore first the strict gradient descent interpretation, which would mean that the derivative of the average of the external states is equal to the average flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.453,
    "end": 2680.927,
    "text": " and we can compute that very easily in our linear system this this equation is the derivative of the average state and this equation is just the average flow and what we did for comparing both is just generating a dummy variable this tilde m which behaves as equally as the average flow so this this variable tilde n will be a variable that strictly minimizes the free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.107,
    "end": 2696.62,
    "text": " So this is the real dynamics of these most likely states, and this is what these most likely states will do if they were exactly minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.67,
    "end": 2705.493,
    "text": " And under our weak coupling approximations, we can see that we can get to a simplified version of these equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.273,
    "end": 2708.914,
    "text": "And we can see that both of them are a bit different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2709.735,
    "end": 2719.318,
    "text": "First, the real dynamics has a noise theorem because the fluctuations are going to affect the dynamics because the observations of the blanket are driven by noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.979,
    "end": 2722.36,
    "text": "So this is going to be a noisy dynamics, and this is not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.386,
    "end": 2728.829,
    "text": " And the second difference is that this term changes the sign here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2728.929,
    "end": 2730.99,
    "text": "So here is positive and here is negative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.911,
    "end": 2738.615,
    "text": "And this seems strange, but the reason of this is because this, so this is the real dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2739.717,
    "end": 2761.57,
    "text": " which depends on the previous state and this average flow it's history independent in some sense it just depends on the previous state of b but it doesn't depend on the previous state of y so to speak so in that sense the structure of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.106,
    "end": 2772.393,
    "text": " flow of this variable, of the dynamics of this variable is going to be different and in this case this difference is captured by this constant that has a different sign between one and the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2773.854,
    "end": 2780.86,
    "text": "And if we run a simulation of both equations we find that the behavior is very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.767,
    "end": 2785.289,
    "text": " And so this is the behavior of the real average variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2785.449,
    "end": 2794.815,
    "text": "So this is a system with two dimensions and you have this symmetric forms because we restricted the couplings to plus minus 0.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.611,
    "end": 2807.886,
    "text": " And if we represent this tilde m, so this is the system that strictly minimizes the free energy, we have this very, very different behavior, which has this kind of a random walk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.406,
    "end": 2813.873,
    "text": "And this is because this variable is integrating the fluctuations of the other one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.794,
    "end": 2819.958,
    "text": " So the error keeps accumulating and the behavior is very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.118,
    "end": 2838.912,
    "text": "So in principle, it's unlikely that... And these results were similar for many combinations of parameters, but in principle, it's unlikely that the dynamics of the most likely states are going to be... So the average flow is going to be informative about the actual dynamics of the most likely states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2839.955,
    "end": 2842.557,
    "text": " OK, so this is the strict version of the assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.718,
    "end": 2849.704,
    "text": "The relaxed version will be that only the average flow follows the gradient of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.701,
    "end": 2858.683,
    "text": " And if we interpret this, we find that there is two problems, or at least we thought that there is two problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.803,
    "end": 2875.368,
    "text": "The first problem is that a key step of the free energy principle uses the synchronization manifold, so the sigma function connecting external and internal states, and then derives a chain rule connecting the dynamics of MY with the dynamics of internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.241,
    "end": 2885.538,
    "text": " And this leads to saying that the flow of the internal states is following the gradient of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.607,
    "end": 2907.066,
    "text": " Okay, and so if we say that the free energy does not truly apply to the time derivatives of the most likely states, but just applies to the flow, then we cannot use the sigma mapping to derive this equivalence between what the external states are doing and what the internal states are doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.207,
    "end": 2911.37,
    "text": "And so we cannot, so this step becomes problematic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.746,
    "end": 2935.637,
    "text": " and if we want to connect the flows of internal states and the flows of external states as the as the energy principle proposes then one will need a new mapping because this mapping and this mapping are not the same and we computed in a linear system the two mappings and we find that the the mapping has a different expression and it is different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.496,
    "end": 2940.539,
    "text": " from the gradient of the mapping that's used in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.259,
    "end": 2953.947,
    "text": "So in principle, this relaxed interpretation will require a different mapping that's different than sigma because we are not interested on the flows of the most likely states, but just on these average flows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.029,
    "end": 2960.711,
    "text": "And, okay, sorry, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.579,
    "end": 2970.149,
    "text": " And well, more importantly, another problem arises, which is, yeah, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.509,
    "end": 2975.455,
    "text": "So if we have an strict, sorry, one second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.728,
    "end": 2983.734,
    "text": " Yeah, if we have a strict interpretation of the... Okay, sorry, I lost this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.815,
    "end": 2991.662,
    "text": "Yeah, if we have a strict interpretation like this, like, okay, internal states are doing a gradient descent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.363,
    "end": 3019.746,
    "text": " on the on the free energy so the derivative the temporal derivative is equal to the gradient of the so this is this is a definition of a like a textbook gradient descent okay and this is fine if we have this equation we know that the system is doing a gradient descent so the question is if we just have this equation here so the average flow is pointing in the direction of the gradient",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.049,
    "end": 3026.6,
    "text": " Can we really interpret that the system is behaving as if minimizing the free energy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.081,
    "end": 3032.412,
    "text": "So how informative is this average flow about the real behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.365,
    "end": 3035.206,
    "text": " So we try to explore this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.366,
    "end": 3044.23,
    "text": "So first in these simulations, we see that it may be little informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.41,
    "end": 3051.272,
    "text": "Even if we have a different mapping, maybe this average flow has little information about what the actual dynamics is doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.533,
    "end": 3057.015,
    "text": "And for exploring this further, and you can see it in an appendix, so for,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.749,
    "end": 3072.335,
    "text": " or for preprint, like the second appendix, we try to explore what is the connection between the average flow and the actual dynamics of the system in a very simple system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.355,
    "end": 3078.078,
    "text": "So we restricted our system to a bi-dimensional case with this non-equilibrium behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.158,
    "end": 3084.72,
    "text": "So the flows of the system have this spiral behavior, which, under noise, are going to be rotating in this .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.741,
    "end": 3087.422,
    "text": "So we have two variables, y and b.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.736,
    "end": 3116.318,
    "text": " and so this is the flow the actual flow of the system and we ask okay so in this system what is the the dynamics of the most likely states so this derivative of m y given v and we find that we have this negative slope which is well you have this this pink area because this is a random variable which is going to have noise and it's going to be noisy and so on but on average we have this negative slope",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.21,
    "end": 3124.002,
    "text": " meaning that the system is going to be minimizing is going to have an attractor at zero right if you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.084,
    "end": 3132.61,
    "text": " study dynamical systems and have a negative slope of a derivative, or at least on average, you are going to minimize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.83,
    "end": 3134.912,
    "text": "So if the state is negative, you are going to reduce it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.372,
    "end": 3136.553,
    "text": "You are going to increase it, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.973,
    "end": 3138.955,
    "text": "And if the state is positive, you are going to reduce it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3139.015,
    "end": 3143.478,
    "text": "So you are going to have an attractor at zero, which is what we see in the actual system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.299,
    "end": 3152.045,
    "text": "But at least for some combinations of parameters, which were like half of the possible combinations of parameters that we tried,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3152.905,
    "end": 3157.269,
    "text": " If you compute the average flow, it gives you the opposite behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.349,
    "end": 3166.336,
    "text": "Here the slope is positive, meaning that if you have a system that follows this slope, it's going to diverge to plus infinity or minus infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.677,
    "end": 3181.228,
    "text": "So this is intended as an example that the average flow can be a very poor description of the actual behavior of a system if what you have is a stochastic dynamical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3182.581,
    "end": 3207.15,
    "text": " and okay so so in general we cannot assume that under all circumstances the marginal flow is going to be informative as the behavior of a system and if even if you can derive all the steps or of the free energy principle it might be the case that in some systems the average flow that's pointing is pointing in the direction of the free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3207.91,
    "end": 3211.994,
    "text": " but the system is not behaving as minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.014,
    "end": 3214.296,
    "text": "We can see it in this example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.757,
    "end": 3221.443,
    "text": "The system is minimizing the value of y squared is going to zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3221.723,
    "end": 3224.365,
    "text": "The value of these variables is going to zero, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.046,
    "end": 3227.267,
    "text": " The average flow points in the opposite direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.287,
    "end": 3240.732,
    "text": "It tells you that the average flow, if you interpret the average flow as what the system is doing, then you will believe that the system is maximizing the square value of y, for example, because it's diverging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3241.013,
    "end": 3243.614,
    "text": "And what it's doing is just minimizing it because it's going to zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3246.61,
    "end": 3259.816,
    "text": " And so in principle, if the dynamics of the most likely states and the average flow are different, then yeah, so they are going to be in general different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.916,
    "end": 3270.621,
    "text": "And in that case, they are not going to be informative about the behavior of our system, except in various, maybe very specific cases as mean field approximations or this kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.864,
    "end": 3282.352,
    "text": " And this difference is because these marginal flows arise from a decoupling of a previous history of the system and we are not considering the effects of fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.512,
    "end": 3282.792,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.398,
    "end": 3308.098,
    "text": " and okay so just to finish and maybe let's give place to the discussion and in this work we explore the conditions to and the assumptions that are needed to derive the free energy principle in linear non-equilibrium stochastic systems and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.379,
    "end": 3317.761,
    "text": " And some of this has been explored for specific counter-examples as recent work by Martin Beale and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.041,
    "end": 3323.603,
    "text": "But I think it's interesting that we did this for a general class of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.643,
    "end": 3333.485,
    "text": "So it's not one example that we solved numerically, but we solved a family of weakly coupled systems and we see how general or not are the different assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.526,
    "end": 3340.331,
    "text": " And so first we explore that, we explore how general are the conditions and assumptions of the principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.571,
    "end": 3344.514,
    "text": "And then we studied under what conditions can we expect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.446,
    "end": 3351.627,
    "text": " the principle to be informative about the behavior of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.647,
    "end": 3365.953,
    "text": "And first we found that the Markov-Blanket condition emerged at least as a good approximation in the case of weak couplings, but if the couplings are not super weak, are not very weak, then maybe we cannot expect to be exact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.832,
    "end": 3369.392,
    "text": " in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.973,
    "end": 3380.034,
    "text": "However, solenoidal couplings are generally present in all blocks of the system and they are going to be zero just in very, very special cases as this symmetric loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3380.835,
    "end": 3393.577,
    "text": "So maybe a direction for the theory will be to explain exactly what happens when these solenoidal couplings are not zero and what happens in that case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.628,
    "end": 3409.538,
    "text": " And so in conclusion we will say that only very specific structures are going to satisfy the requirements to derive that the average flow is pointing in the direction of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.803,
    "end": 3431.05,
    "text": " And the second point about how informative the principle is, we saw that the connection between the free energy and the marginal flow of the system with the actual behavior of a system is in most cases very weak or even contradictory as one can point in one direction and the other in the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.85,
    "end": 3459.893,
    "text": " So we found that in general these marginal flows are not capturing the actual dynamics of a system and this is because this marginal flow is ignoring the history of interactions and we could intuitively think about this so we can imagine a system that has many trajectories and if we fix the blanket at some point it just means having different trajectories that are going to pass through this point and the average flow is just going to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3461.134,
    "end": 3465.796,
    "text": " compute the directions or the direction of the most likely derivative at that point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3465.856,
    "end": 3468.897,
    "text": "Well, the average derivative of the system at that point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.978,
    "end": 3475.36,
    "text": "But any individual system can have a very different behavior which is represented by the black line here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.74,
    "end": 3488.065,
    "text": "An intuitive example for this could be to distinguish between the population of an individual organism and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.786,
    "end": 3493.59,
    "text": " the behavior of an individual organism and the behavior of a population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.691,
    "end": 3504.879,
    "text": "And so you could think that on average, a population of organisms is behaving in a way that's maximizing evolutionary fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.7,
    "end": 3512.926,
    "text": "But this can be largely uninformative for describing the behavior of individual organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.227,
    "end": 3539.283,
    "text": " sometimes the kind of criticisms that we hear and do some proposals in evolutionary psychology and this kind of thing right so so even if at an average macro level you can detect some tendencies in many cases these tendencies can be uninformative about what an individual is doing right and so so we think that it's interesting to to think about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.121,
    "end": 3556.732,
    "text": " If and when and in which cases the conclusions derived by the free energy principle are going to be informative about the behavior of an individual or groups of individuals and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3559.621,
    "end": 3578.57,
    "text": " Still, we have to say that even if we did this kind of critical evaluation, we find that the motivation of the free energy principle is very suggestive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3579.83,
    "end": 3597.38,
    "text": " And we think that the aim of connecting ideas from variational inference with the dynamics of complex self-organizing system is tremendously important, as it could allow to apply the machinery of Bayesian and information theory to describe systems that are intractable in practice, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.24,
    "end": 3607.307,
    "text": " But we also think that it's somehow difficult to just derive a theory without a connection to specific models, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.368,
    "end": 3617.416,
    "text": "That can allow you to inspect in more detail some assumptions or some consequences of the assumptions that are difficult to grasp intuitively in many cases, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.119,
    "end": 3625.723,
    "text": "So in principle, we find that, yeah, that it will be interesting to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3627.301,
    "end": 3651.9,
    "text": " Yeah, that exemplifying the steps of the theory in a specific model is very useful to... Yeah, it's very useful to understand the connections between steps and how likely or not are different steps and that this kind of exercise can be really useful to... Yeah, it can be really useful to understand the kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.322,
    "end": 3656.026,
    "text": " the difficulties that we face when programming a theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.027,
    "end": 3662.636,
    "text": "And just one, so this is the prayer print that we just published, how particular is the physics of the pre-energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3664.078,
    "end": 3664.539,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3667.303,
    "end": 3667.644,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.356,
    "end": 3672.256,
    "text": " Thanks for this awesome presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.156,
    "end": 3677.377,
    "text": "There was a lot there and it was incredibly well presented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.137,
    "end": 3682.718,
    "text": "So for those who are watching live, I would invite them to write questions in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.258,
    "end": 3689.659,
    "text": "But first, Chris, I'll just pass it to you for an initial comments if you would like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.679,
    "end": 3694.54,
    "text": "Oh, unmute and then please continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.521,
    "end": 3699.181,
    "text": "Wait, Chris, you're muted and then continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.508,
    "end": 3716.278,
    "text": " Yeah, so I think, Miguel, that even though we found these flaws in the particular kind of technical presentation we've seen, we still find that the ambition of the free energy principle is laudable, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3716.298,
    "end": 3722.302,
    "text": "And it's something we really want to embrace, but yet we feel it needs some future development, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3722.862,
    "end": 3727.383,
    "text": " So, I mean, I summarise, there's two issues that Miguel has presented here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3727.403,
    "end": 3733.825,
    "text": "The first one is the problem about trying to characterise the interaction of an agent with its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3733.845,
    "end": 3734.965,
    "text": "So you can do this in two ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3735.545,
    "end": 3741.427,
    "text": "And one typical way is to draw kind of connections as direct functional connections between an agent and environment, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3741.447,
    "end": 3745.088,
    "text": "So the sensors and the motors and so on and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3745.328,
    "end": 3751.75,
    "text": "But there is a different way of understanding those interactions in terms of the Hessian or the covariance matrix, which kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3756.412,
    "end": 3759.545,
    "text": " And I think what Carl has done is kind",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3761.276,
    "end": 3766.618,
    "text": " the Hessian upwards rather than considering the functional connections that underlie those two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3767.539,
    "end": 3771.16,
    "text": "So he wants to assume there is a Markov blanket and wants to start there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3772.32,
    "end": 3776.942,
    "text": "And then he's not so concerned about trying to work out the class of systems that meet those conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3776.982,
    "end": 3778.323,
    "text": "And I think that's a valid thing to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3778.343,
    "end": 3783.665,
    "text": "It might be a very special set of systems, but I think Carl would claim that's the kind of systems I'm interested in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3783.925,
    "end": 3785.866,
    "text": "I'm not really interested in those other systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3786.166,
    "end": 3789.607,
    "text": "And what we've pointed out is that we can't find those very...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3789.787,
    "end": 3792.308,
    "text": " very generally in the class of systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3793.409,
    "end": 3805.995,
    "text": "And the second major issue that I think Miguel's work points out is this decoupling between description of the deterministic dynamics of the system versus the average dynamics of an ensemble of systems, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3806.395,
    "end": 3812.638,
    "text": "So in prior accounts of the free energy principle, you actually write the deterministic dynamics into your description.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3812.678,
    "end": 3818.121,
    "text": "So when you're using free energy principle to do cognitive systems, you are describing the deterministic dynamics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3822.928,
    "end": 3824.49,
    "text": " and flows on your expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3825.07,
    "end": 3830.556,
    "text": "But what the particular physics approach wants to do is try to find that deterministic dynamics within the physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3830.976,
    "end": 3837.222,
    "text": "It wants to see where it would lie within the kind of general stochastic dynamical systems theories of physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3838.083,
    "end": 3839.725,
    "text": "And that's where the problems lie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3839.765,
    "end": 3845.35,
    "text": "So it's very hard to go from the physics to the description in terms, a good description of the system,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3850.549,
    "end": 3860.048,
    "text": " So we find this problem of a decoupling between the description and the dynamics of the moments of a system versus the average over",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3863.45,
    "end": 3871.798,
    "text": " So over an ensemble system, the free energy might be a good description, but it's not connected to the causal explanation of the dynamics of a specific system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3871.818,
    "end": 3878.765,
    "text": "So you can't attribute kind of the right kind of mechanistic description to that particular system that you would like to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3879.846,
    "end": 3882.209,
    "text": "And yeah, so that's kind of my summary, maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3883.968,
    "end": 3885.85,
    "text": " Thank you for the succinct summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.89,
    "end": 3887.632,
    "text": "That's very helpful for many, I'm sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.652,
    "end": 3893.257,
    "text": "Karen, if you'd like to unmute, sorry, I heard a feedback when Chris was speaking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.537,
    "end": 3896.62,
    "text": "So if you can unmute or yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.801,
    "end": 3897.021,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.461,
    "end": 3901.025,
    "text": "Introduce yourself and then give any comments you'd like, and then I'll go to the questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.526,
    "end": 3903.827,
    "text": " Yeah, so hi, I'm Ben.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.907,
    "end": 3911.912,
    "text": "I'm obviously an author on this and I'm currently now a postdoc at Oxford, but I worked very closely with Chris and Miguel at Sussex for a long time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3912.653,
    "end": 3915.855,
    "text": "So yeah, also Simon later had something else, scheduling conflicts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3915.915,
    "end": 3917.436,
    "text": "I just jumped in for the questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3918.126,
    "end": 3925.011,
    "text": " But yeah, so I would just like, I think Chris did an excellent job of explaining the issue with the average dynamics versus the dynamics of the average.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3925.551,
    "end": 3939.981,
    "text": "But I would just like to go in and kind of reiterate, to me, the important thing about the Markov blankets is really this idea that the Markov, there is a huge distinction between the sort of statistical independence relationships and this kind of like causal actual relationship you get if you write out the dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3940.681,
    "end": 3942.442,
    "text": "And so it's quite easy to confuse these two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3942.482,
    "end": 3946.685,
    "text": "And indeed, I think we naturally conflated these two a lot until we started writing this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3948.466,
    "end": 3956.628,
    "text": " And a lot of the literature also, like, conflates these two, and, you know, they have these intuitive diagrams of, you know, like, the bacteria with its cell wall and everything, and that's the blanket and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.928,
    "end": 3961.729,
    "text": "But that's in the sort of causal level of the description, like, and the things causally have to pass through the blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3961.749,
    "end": 3969.53,
    "text": "That's not the same at all as the statistical description, which is, you know, the statistical dependencies between, you know, the blanket and the internal and the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3970.01,
    "end": 3977.132,
    "text": "And I think, yeah, it needs quite a lot of thinking about to what extent these causal mappings actually hold up and sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3977.973,
    "end": 3992.75,
    "text": " actually sustained by the statistical mappings or vice versa and we've found in linear systems there's lots of cases where they don't and they don't seem to matter at all and so yeah it takes a lot of kind of different intuitions really I think need to be built about what these Markov blankets mean on an actual sort of causal level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3994.329,
    "end": 3995.73,
    "text": " Thanks for this comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.81,
    "end": 3997.35,
    "text": "And again, people can write questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.83,
    "end": 4009.996,
    "text": "If I could just actually add something about the difference between the causal structure and the correlative structure, you could imagine on a market, there's companies that are causally related to each other, but their stock prices are not correlated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.036,
    "end": 4012.397,
    "text": "And similarly in the sell,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.297,
    "end": 4018.279,
    "text": " we often make networks that are based upon like gene co-expression, so genes with correlated expression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.639,
    "end": 4023.741,
    "text": "And then there's gene regulatory networks or protein-protein interaction networks that are like proteins that touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.261,
    "end": 4030.543,
    "text": "But those proteins usually don't have correlated expression because you might upregulate one that then represses another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.683,
    "end": 4034.685,
    "text": "So they're not expressed in a correlated fashion, but they have causal relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4036.365,
    "end": 4040.987,
    "text": "And it's people slipping between, oh, gene regulatory network, you know, co-expression, interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.867,
    "end": 4051.416,
    "text": " Certainly conflating the causal structure of a system with the physical structure or the correlative structure is a broad category error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.956,
    "end": 4065.128,
    "text": "And I think your work does an incredible job at highlighting the difference and where slipping between these easily confusable modes of thinking about networks and then also conflating that with reality or all of reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.349,
    "end": 4068.571,
    "text": "Just very well done to these points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.853,
    "end": 4070.053,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.393,
    "end": 4079.795,
    "text": "Another example would be the difference between structural connectivity, functional connectivity and effective connectivity in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.335,
    "end": 4093.618,
    "text": "You can have some structure and then you can have statistical correlations, but even then the dynamics can behave differently because you have these asymmetries in how one variable is connected to another and the opposite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.378,
    "end": 4105.548,
    "text": " and this is also in our work the relation with the solenoidal flows that capture something different than so yeah so it's you know very complicated to disentangle all these different levels and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.104,
    "end": 4109.927,
    "text": " But to do justice to the authors, I mean, I think they're aware of this difference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4110.027,
    "end": 4112.309,
    "text": "Obviously, Carl's group is very aware of this difference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4112.729,
    "end": 4119.614,
    "text": "But they feel that the theory sits above that, right, at the correlative structures, and they're not considering those causal structures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4119.634,
    "end": 4127.84,
    "text": "I think maybe some confusion might have emerged in previous papers, but in recent papers, I think it's very clear that they want to sit above the causal corrections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4129.563,
    "end": 4129.863,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4130.203,
    "end": 4141.357,
    "text": "So I hope that by bringing the math to examples of like the market evolution and FMRI, we can hopefully have a lot of people giving their perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.637,
    "end": 4145.582,
    "text": "So I'm going to just go with a question from the chat and then I have some questions that I wrote down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.143,
    "end": 4147.845,
    "text": "So first question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.706,
    "end": 4149.187,
    "text": " Thanks a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.687,
    "end": 4162.92,
    "text": "I was wondering whether you would assume that going to nonlinear systems, the limitations that you find would be even stronger, or would there maybe be an argument that there could be nonlinear systems that fulfill these assumptions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.98,
    "end": 4167.305,
    "text": "So what will relaxing the linear assumption do for the math that you described today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4171.024,
    "end": 4175.787,
    "text": " Okay, well, that's difficult to answer the question in general, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.567,
    "end": 4190.716,
    "text": "So, okay, so first, I think it's difficult to, well, it's difficult to solve because in nonlinear systems, in general, we cannot find the kind of analytical solutions that we have here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4190.756,
    "end": 4192.838,
    "text": "And even in the case of linear systems, we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.959,
    "end": 4215.425,
    "text": " found that we can only solve the case of weak couplings and in the case of weak couplings we could do the trick of considering different orders of expansions and we saw that including stronger couplings make things more difficult rather than rather than easier okay and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4216.44,
    "end": 4228.511,
    "text": " Intuitively, at least my intuition about nonlinear systems is that the case may be similar in many systems, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4228.631,
    "end": 4235.417,
    "text": "Having more intricate copelings, more intricate dynamical copelings could add",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.528,
    "end": 4243.331,
    "text": " extra terms to some of the matrices that we are expecting to be zero, like in the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.212,
    "end": 4251.395,
    "text": "But still, this is not something we can say because you will have unexpected effects from chaos, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.455,
    "end": 4255.737,
    "text": "And I think that's something that Carl proposes sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.398,
    "end": 4265.462,
    "text": "But I think maybe one interesting direction of research will be doing a similar expansion to the one that we did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.377,
    "end": 4277.999,
    "text": " to say, okay, we have an almost linear system, but we consider very small effects of non-linearity and see what kind of terms this adds to the matrices that we are expecting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.019,
    "end": 4291.801,
    "text": "So this could involve a very different analytical solution, but I think there is some forthcoming work from some people in Karlsruhe in that sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.961,
    "end": 4294.522,
    "text": "So I think it's an open question, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4295.402,
    "end": 4307.806,
    "text": " But I intuitively think that in many cases this is going to be challenging to see that non-linearity is going to be a solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4307.826,
    "end": 4316.49,
    "text": "The intuition is that you might be able to solve it in specific systems, but the idea that you'll solve it in a classic non-linear system seems...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4327.349,
    "end": 4330.051,
    "text": " old living system, that might be okay, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4330.752,
    "end": 4337.238,
    "text": "If you want to say something more general about the emergency self-organization in a class of physical systems, then perhaps run into trouble.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4339.076,
    "end": 4340.056,
    "text": " Two thoughts on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4340.116,
    "end": 4341.017,
    "text": "Well, go ahead, Varen, first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.037,
    "end": 4341.357,
    "text": "Go ahead, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.377,
    "end": 4346.799,
    "text": "I was going to say that I think, yeah, I agree with Chris, and that obviously with nonlinear systems, you have a much bigger space of systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.319,
    "end": 4351.001,
    "text": "And so you can probably find edge cases where all the conditions match perfectly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4351.481,
    "end": 4357.044,
    "text": "But I mean, the general intuition in dynamical systems is the nonlinear systems are a lot harder to deal with in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4357.104,
    "end": 4364.927,
    "text": "And so I'm not going to probably, you know, if it's not satisfied in linear systems, there's no obvious reason why it should be satisfied in nonlinear systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4365.467,
    "end": 4369.008,
    "text": " And especially the issue with the dynamics of the average versus the average of the dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4369.388,
    "end": 4375.849,
    "text": "Like the case we did where you have a linear Gaussian system is probably the ideal possible case for this, because obviously the average is a linear operator.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4375.889,
    "end": 4379.69,
    "text": "And for the Gaussian case, the mode and the actual average are the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4379.95,
    "end": 4383.65,
    "text": "And so you have all these nice properties, none of which will hold in the nonlinear general case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4384.15,
    "end": 4390.092,
    "text": "And so I think for that nonlinear system, it's almost certainly going to be much, much worse for that specific issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4390.532,
    "end": 4390.752,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.932,
    "end": 4392.272,
    "text": "Also to add on that, I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.385,
    "end": 4408.329,
    "text": " So one question is whether there is linear systems in which some of the problems are going to go away, but maybe the right question is what happens in the kind of nonlinear systems that we expect in living systems, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.03,
    "end": 4415.672,
    "text": "And what we know from living systems often involves bifurcations or critical points that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4417.199,
    "end": 4427.568,
    "text": " that lead to a long range correlations and correlations that propagate through the whole system and this kind of thing that can be very difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.689,
    "end": 4435.776,
    "text": "So the kind of isolation between internal and external states can be challenging when this is the case, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4437.571,
    "end": 4439.733,
    "text": " Thanks for all these excellent points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.334,
    "end": 4446.257,
    "text": "In complexity, we often talk about nonlinear as being like non-elephant animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.537,
    "end": 4447.618,
    "text": "It's like all of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.078,
    "end": 4451.661,
    "text": "So it's even harder, certainly, to make a general stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.181,
    "end": 4458.526,
    "text": "And Baron, that was a really interesting point that as the state space of what's possible increases, there may be more and more edge cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.346,
    "end": 4462.489,
    "text": "And that kind of brings it back to the question about evolved systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.169,
    "end": 4488.267,
    "text": " not every parameter combination of cells is going to be functional and so maybe we're only dealing with that vanishingly small amount or some other i'm not going to you know go to technical details on the fly but that could be one aspect um and uh also it was such an interesting point during the discussion when you explicitly brought it back to evolution like fitness is the law of the land in a way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.128,
    "end": 4504.559,
    "text": " at a level that doesn't explain motor behavior in the moment to moment they're nested time scales and so of course there's motor behavior that's maladaptive and long run you wouldn't see that under a stationary ecology and dot dot dot dot dot you start adding some assumptions in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4505.539,
    "end": 4533.245,
    "text": " and it's just i think a very fruitful mapping that will be explored for time to come with the relationship between popular population level claims under stationary environments population level claims under dynamical environments and then individual level claims under stationary and and changing environments so it's just a lot of topics that come into play and to have them integrate these kinds of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.985,
    "end": 4563.109,
    "text": " points that you're raising which are often implicit errors in other areas they're being drawn together and brought to the forefront in a way that is quite novel um okay again since the technical details i believe stand best in the presentation as you provided as well as in the paper we can take any questions but i think that will be the place where the discussion continues i just kind of want to ask a few other questions to provide a little context so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.769,
    "end": 4569.133,
    "text": " For maybe whoever wants to answer, how did you come to be studying the question this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.513,
    "end": 4573.156,
    "text": "Were you working with the FEP and exploring new kinds of math?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.636,
    "end": 4580.201,
    "text": "Or did you have more of experience with the mathematics and then see the FEP coming up onto the radar?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4580.241,
    "end": 4583.103,
    "text": "Like how did each of you come to be working on it this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.691,
    "end": 4595.193,
    "text": " I wrote a review a few years ago now of the original free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4595.233,
    "end": 4599.134,
    "text": "At that time, it was quite an enigmatic principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4599.154,
    "end": 4600.835,
    "text": "Not many people understood it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4600.855,
    "end": 4602.655,
    "text": "Originally, I didn't like it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4602.695,
    "end": 4610.658,
    "text": "I didn't like the idea of the notion of representation seems to be pregnant in the idea of the free energy principle kind of representing generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4611.158,
    "end": 4615.619,
    "text": "But I actually came to like it as a cognitive framework, and I still do like it as a cognitive framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4616.539,
    "end": 4624.401,
    "text": " And I still think within the regime of describing sensory motor loops and abstract sensing and cognitive systems, it's very, very useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4624.981,
    "end": 4636.904,
    "text": "But then, obviously, there's been a rapid development of the free energy principle into a grander claim, to find this principle in physics, in the classical physical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4637.744,
    "end": 4640.045,
    "text": "And that's where I started working with Miguel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4640.105,
    "end": 4641.925,
    "text": "Miguel's got a real strong background",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4646.015,
    "end": 4647.677,
    "text": " to really go back to some of those assumptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4647.957,
    "end": 4649.499,
    "text": "So I do separate the two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4649.519,
    "end": 4659.172,
    "text": "I think there's still a very fine, the cognitive account very appealing, even though we find these problems in these physics examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4661.864,
    "end": 4666.668,
    "text": " I started to be involved with the principle more recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.688,
    "end": 4669.63,
    "text": "For some time it was something that I had on the radar, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.267,
    "end": 4686.52,
    "text": " but actually understanding what it meant, it always seemed kind of scary and challenging, you know, with the equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4687.161,
    "end": 4692.669,
    "text": "And I guess that part of the motivation for doing this work is it was...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4694.078,
    "end": 4710.931,
    "text": " as a way of understanding what the theory consisted of because you could go through the mathematical descriptions and it's often really hard to know what they imply or what they mean exactly in the sense that they are complicated maths, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4711.991,
    "end": 4717.956,
    "text": "And I guess that during my research career, the way I have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4718.596,
    "end": 4728.503,
    "text": " I had for understanding complicated maths is by building models and this understanding by building philosophy data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4729.403,
    "end": 4740.211,
    "text": "So I think that the initial attempts to build this system, it was an attempt to really understand, okay, this step I can grasp mathematically more or less what it means, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4741.004,
    "end": 4747.408,
    "text": " But let's have a model and change parameters and play with it and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.568,
    "end": 4749.69,
    "text": "So that was more or less the journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.79,
    "end": 4758.295,
    "text": "And once having the model, then say, okay, can I have something more general than just some specific parameters?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4758.335,
    "end": 4762.157,
    "text": "So let's see how we can have an analytical solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.138,
    "end": 4792.166,
    "text": " and so on so so yeah so i think yeah this exercise is is very fruitful both on a personal level and also on a scientific level because you can on your way to learning you can develop things that can be useful for the theory more in general awesome thank you for those answers and also i was just getting feedback right now from you miguel so just mute while baron gives a okay go ahead baron",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4793.328,
    "end": 4798.151,
    "text": " Yeah, I just want to follow up on Miguel's point, really, about just the importance of actually trying to build these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4798.592,
    "end": 4808.939,
    "text": "Because I think, from my perspective, a lot of the developments and problems we discovered basically came from actually looking at specific models and thinking, hey, this doesn't quite work out as it says it should.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4808.959,
    "end": 4816.425,
    "text": "Because basically, things have just become an awful lot more clearer if you actually try and build them, rather than just staring at these symbols on the page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4817.265,
    "end": 4827.068,
    "text": " And so I think that's really the key to a lot of it, is simply trying to construct a system where it's working and say, hey, you know, things aren't going quite as, you know, the particular physics monograph says they should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4828.588,
    "end": 4828.888,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.369,
    "end": 4836.811,
    "text": "And it's so interesting and maybe even appropriate that action became relevant for this inference problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.311,
    "end": 4843.753,
    "text": "So it's not just conceptual because we must be engaging in the literature and conversation in the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4844.273,
    "end": 4873.008,
    "text": " and going through it ourselves in order to infer deeper we can't just wait at square one and look all the way to square one thousand we have to be working along the way individually and maybe as a group too so here's a question from the chat brilliant talk wonder if carl and others will respond to challenges presented in this paper also because the paper is written in such coherent style wonder what would you recommend for beginners to study in the fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.988,
    "end": 4897.242,
    "text": " nice question what do you wish you knew at the outset even if it's a new resource what courses or topics would you recommend having a familiarity with or what are the on-ramps for somebody who's not in this area of research and practice how can they best be on-ramping themselves",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.482,
    "end": 4900.543,
    "text": " I recommend Barron's GitHub.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4901.123,
    "end": 4908.184,
    "text": "He's got a nice repository of papers, which go from very introductory papers to very sophisticated papers in nicely organized ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4908.204,
    "end": 4909.985,
    "text": "I don't know if you want to provide that, Barron.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4910.165,
    "end": 4911.705,
    "text": "Is it publicly accessible?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4913.506,
    "end": 4915.366,
    "text": "Oh, yes, publicly accessible, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4915.466,
    "end": 4917.447,
    "text": "I could post that in the chat or something, if you want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4917.727,
    "end": 4921.888,
    "text": "Yeah, say hello in the YouTube chat, and then I'll make you a moderator, and you can post links.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.408,
    "end": 4924.448,
    "text": "So, great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4925.389,
    "end": 4927.129,
    "text": "So then, continue on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4929.09,
    "end": 4934.595,
    "text": " Yeah, I mean, regarding the actual question about what to sort of start with, I think that depends a lot on what you want to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4935.136,
    "end": 4943.684,
    "text": "So there's kind of three big separate topics in my mind, is that sort of the FEP, the sort of hardcore maths of the theory, as is presented in particular physics,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4944.464,
    "end": 4973.315,
    "text": " and for that i'm not sure there is necessarily a good beginners level resource at this point like there is essentially i mean our paper tries to go through quite straightforwardly and then they have you have the thomas parr mark of blankets and stochastic thermodynamics paper which sort of covers the main points but it's not like a tutorial it can just taste like this is xyz and then really it's just the particular physics monograph is where most of that information is like there isn't yet a really nice laying out of it and obviously we kind of try and do that in our paper but obviously",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4973.675,
    "end": 4976.076,
    "text": " We're also focused on the actual points you want to make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4976.136,
    "end": 4977.677,
    "text": "It's not just like specifically tutorial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4978.318,
    "end": 4983.741,
    "text": "Yeah, I mean, the other two things already, the active inference sort of discrete state-based active inference that people talk a lot about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4983.801,
    "end": 4988.443,
    "text": "I think the best resource for that at the moment is probably Lancelot Acosta's review on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4989.064,
    "end": 4998.409,
    "text": "And then there's, yeah, then essentially there's some several of Carl's papers, which I think I talk about in my GitHub repository, which is kind of going into more detail, but Lancelot's review for that is really good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4999.029,
    "end": 5008.695,
    "text": " And then there's a sort of more continuous states-based predictive coding style, which I think Chris's 2017 review is the best for that, to be honest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5009.936,
    "end": 5011.417,
    "text": "So yeah, those are the things that I would start.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5012.237,
    "end": 5013.338,
    "text": "And the files, yeah, the files.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5016.826,
    "end": 5022.509,
    "text": " Yeah, I think Chris's one is the one if you want to sort of understand the whole, the theory and all the math as a whole, because it works very nicely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5022.909,
    "end": 5030.412,
    "text": "Whereas Rafal's like if you want to build a predictive coding network which works and you have that sort of more focused on the neuroscience, Rafal's is the way to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5033.054,
    "end": 5046.16,
    "text": "If I can ask one note before Miguel's answer, when you said newer science, do you see them as just historically juxtaposed or do you see some of these approaches as encompassing one another or being prerequisite to one another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5048.414,
    "end": 5064.072,
    "text": " So I think the idea is that the sort of FEP in the particular physics monograph encompasses all of them in that, you know, the idea is that these are the specific models, you know, you have a specific variational density, specific generative model, and then you work through the math and you get these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5064.672,
    "end": 5066.653,
    "text": " these process theories, as Carl calls them out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5067.054,
    "end": 5075.958,
    "text": "I mean, I think in practice, though, they can stand alone away from whatever the particular physics monograph says, because they obviously make, you know, empirical predictions about the brain or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5076.038,
    "end": 5077.92,
    "text": "And so you can actually empirically test these.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5077.96,
    "end": 5082.662,
    "text": "And so even if all particular physics is wrong, then these things could be right and vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5082.682,
    "end": 5087.365,
    "text": "So even if all particular physics is perfectly right, and these things could just not be what the brain is doing, it could be doing something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5088.025,
    "end": 5093.128,
    "text": "So yeah, I think they stand alone, although in theory, the particular physics monograph is kind of meant to subsume them all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5094.738,
    "end": 5095.839,
    "text": " Thanks for that response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5095.959,
    "end": 5102.164,
    "text": "And Miguel, to that original question, what would you recommend a beginner to be learning and looking into?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.184,
    "end": 5105.647,
    "text": "Yeah, not so sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.767,
    "end": 5121.58,
    "text": "For me, so I think I started with Thomas Barr paper about Markov blankets and formation geometry, and then going back to the monograph of a particular physics and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5124.314,
    "end": 5130.56,
    "text": " But it was challenging because the maths are complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5134.083,
    "end": 5141.048,
    "text": "It was useful to Martin Beale's paper, A Technical Critic of the Free Energy Principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5142.049,
    "end": 5152.759,
    "text": " In the sense, it was very technical and formal, but it was useful that they tried to encapsulate the different conditions in a way similar to what we do here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5152.799,
    "end": 5161.327,
    "text": "And I think that was helpful to try to differentiate the different steps, which are not always so clear in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5163.242,
    "end": 5180.648,
    "text": " So yeah, I think there is, at least for the part regarding the free energy principle as described in a particular physics, we need maybe better tutorials and more materials that are focused to those introductions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5182.862,
    "end": 5202.235,
    "text": " thanks for these responses and i know in our act inf lab and in many other associated efforts that the focus on accessibility and communicating these ideas in a way that's gonna be helpful to people from many backgrounds is a top priority so way back in the introduction you know 120 time steps ago",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5204.036,
    "end": 5206.317,
    "text": " you talked about new visualizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5206.937,
    "end": 5216.241,
    "text": "And it's definitely the case that paper after paper will use some classical figures, let's just say, and I'm excited by visualizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.481,
    "end": 5220.323,
    "text": "And so was curious, just maybe whoever wants to go in for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5221.003,
    "end": 5225.825,
    "text": "What would the new representations do or be communicate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5226.245,
    "end": 5230.747,
    "text": "What style or what made you just wanting to explore visually?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.327,
    "end": 5232.928,
    "text": "And how is that in feedback with the research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.104,
    "end": 5238.426,
    "text": " Okay, yeah, I think that's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5238.586,
    "end": 5247.558,
    "text": "I like at some point, I keep looking through the literature, and it's paper after paper, the same, the same graph about in a brain sensory motor loop, the oscillus, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5247.578,
    "end": 5247.678,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5250.133,
    "end": 5259.278,
    "text": " At some point, it stops being useful because its visualization can give unique intuitions to some extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5259.378,
    "end": 5265.002,
    "text": "At some point, I wanted to know more about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5266.943,
    "end": 5268.244,
    "text": " It's not always straightforward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5268.264,
    "end": 5270.445,
    "text": "Okay, there's an arrow, but what does it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.565,
    "end": 5272.507,
    "text": "Or why is this bidirectional?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5273.267,
    "end": 5288.017,
    "text": "And yeah, so the different figures that we have, we developed them with the idea of, okay, how can we intuitively express these very complex assumptions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5288.117,
    "end": 5292.139,
    "text": "I don't know, how do you have a figure of a solenoidal flow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5293.5,
    "end": 5295.261,
    "text": " And this is really challenging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5295.842,
    "end": 5308.19,
    "text": "I'm not sure if we did a good job there, but I think many intuitions about the free energy principle are really hard to capture because they are quite complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5308.27,
    "end": 5319.137,
    "text": "And I think it's interesting to try to push in the directions of having new images that at least try to capture that intuition and what do they mean and how to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5321.32,
    "end": 5333.428,
    "text": " Yeah, because often I think you have to read the theory based on your intuition or covering with intuitions the part that you don't understand yet, especially if you're learning and this kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5333.509,
    "end": 5336.931,
    "text": "I think it's incredibly useful in general in science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5340.133,
    "end": 5342.135,
    "text": "Chris or Barron, would you like to add on that point?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5343.656,
    "end": 5345.879,
    "text": " No, I mean, we found it hard, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5345.999,
    "end": 5351.025,
    "text": "I mean, because there is so many different types of interactions we want to represent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5351.105,
    "end": 5356.851,
    "text": "I mean, typically monolithic arrows between agent and environment seems to dominate everything, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5356.891,
    "end": 5360.916,
    "text": "But when you start drilling down into this, you have the difference between causal and functional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5361.176,
    "end": 5363.899,
    "text": "Obviously, people like Pearl and stuff have done this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5373.562,
    "end": 5375.723,
    "text": " especially in the area of the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5376.083,
    "end": 5381.245,
    "text": "But yeah, I don't know whether, I think Miguel did a really good job, but it does look complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5381.786,
    "end": 5383.686,
    "text": "The final product is complicated looking, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5383.726,
    "end": 5388.268,
    "text": "But it does do justice to these different types of interaction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5389.769,
    "end": 5391.37,
    "text": "Aaron, anything on that or no?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5391.53,
    "end": 5392.17,
    "text": "Yeah, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5392.742,
    "end": 5395.203,
    "text": " Yeah, no, I would just say that I agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5395.263,
    "end": 5398.065,
    "text": "Like, I'm not naturally a sort of visual person who actually really looks at the figures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5398.165,
    "end": 5401.506,
    "text": "But I think just what Miguel did was actually really good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5401.546,
    "end": 5410.311,
    "text": "And it's the sort of thing that if you actually look at them and try and understand them, it will yield a lot of dividends in terms of quickly getting to grasp on precisely what's being said, what's not being said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5410.331,
    "end": 5415.173,
    "text": "Because yeah, it's very easy to have into this sort of hazy interaction without knowing what that really means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5415.765,
    "end": 5415.965,
    "text": " Mm hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5416.645,
    "end": 5419.046,
    "text": "It's the same again as a geneticist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5419.126,
    "end": 5422.468,
    "text": "It makes me think of, oh, you know, nodes are genes and edges are interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.208,
    "end": 5433.193,
    "text": "Which kind of those multiple classes and does one paper use it one way and go to the methods and it's one way in this paper and it's another one in another way, but it's being cited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5433.653,
    "end": 5439.996,
    "text": "And so it takes a lot of subtlety to pull back to that question about what kind of interactions are being discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5440.596,
    "end": 5444.658,
    "text": "And then, Chris, what you just said, there's like it's a high",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5445.731,
    "end": 5460.657,
    "text": " praise for the work that it does justice because that's what we hope the bleeding edge does for the rest of the knife and the handle is represent visually on a manifold that doesn't deceive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5461.337,
    "end": 5475.902,
    "text": " it's not drawing hard lines where none exist it's not making false positive or false negatives or false claims visually because visual rhetoric is how many people will learn and think about these things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.522,
    "end": 5487.952,
    "text": " And so it makes all the difference whether there's a bidirectional arrow graphically or not, because people are going to unpack it, especially if they're not going to go into the nth level of math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5488.192,
    "end": 5495.278,
    "text": "They're going to unpack it literally and with the knowledge that that's what the expert represented in their aim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5496.539,
    "end": 5505.964,
    "text": " I really do think it's particularly important for this field because there is a separation between this technical morass that sits at the bottom and obviously the ambition and what it promises.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5506.324,
    "end": 5514.147,
    "text": "So many people are attracted to this particular theory, but not everyone has got time to go in and decipher that morass.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5514.167,
    "end": 5519.65,
    "text": "So they're sitting at the level of these figures and trying to make discourse and so on at that level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5519.67,
    "end": 5524.172,
    "text": "So it's vital that those figures become very clear and very point",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5524.392,
    "end": 5525.453,
    "text": " in what they try to communicate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5525.513,
    "end": 5538.778,
    "text": "And any kind of lack of clarity is just going to send the whole community off in the wrong direction, particularly if you're not the kind of person who wants to go in and do statistical physics, you want to do more of the philosophy or cognitive science of these systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5538.998,
    "end": 5541.959,
    "text": "So it's vital that we get them right in this particular field, particularly, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5543.43,
    "end": 5563.143,
    "text": " Yes, I think there's an XKCD cartoon about where the fields are arranged, but especially when working with the theory itself, it should be lean and as low dimensional as possible and not anymore because otherwise it will be unpacked in ways that are just going to be completely discordant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.504,
    "end": 5572.15,
    "text": "But if it can be represented in sort of like a build in or like an opt in at this level, instead of trying to explain backwards from what we could do in the future in the math,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5572.952,
    "end": 5578.473,
    "text": " we need to start with the axioms and clarify what they are and then unpack those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.593,
    "end": 5584.574,
    "text": "And then it's like, just like with any other area of theory, did you disagree with the axioms or did you disagree with how they were applied?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.014,
    "end": 5594.416,
    "text": "Because those are the areas where there's sort of controlled space for discussion, but then something like, I don't think it would work that way in a human computer interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5595.316,
    "end": 5600.137,
    "text": "It's neither here nor there for the level of rigor that you approach the questions with today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5605.187,
    "end": 5630.223,
    "text": " um so i can ask any other questions or we can see if anyone else posts in the chat but that was actually one of my questions was are those all the axioms how do we represent axioms or how do we even know what those axioms are without getting into like too much of a whole you know incompleteness thing what are the axioms were they what you put in the paper and nothing else those are necessary and sufficient or is there some other stuff happening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5631.098,
    "end": 5640.665,
    "text": " Actually, it's our ambition, just to say before, I think I'll let Miguel answer that, but we have an ambition to write a kind of more accessible version of this paper, which hopefully will be done in the next few months.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5640.685,
    "end": 5642.046,
    "text": "So we want to do exactly that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5642.086,
    "end": 5653.034,
    "text": "We want to draw away from the hard statistical physics and have this paper underneath it, and then be even more clear about the kind of overall narrative of what we're suggesting here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5653.834,
    "end": 5657.017,
    "text": "And we can answer those questions that you asked very directly, hopefully.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5657.097,
    "end": 5659.919,
    "text": "But for the specific case, I'll let Miguel answer that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5665.721,
    "end": 5672.245,
    "text": " Yeah, I don't have much to add.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.046,
    "end": 5685.535,
    "text": "I think that the pre-energy principle has been an evolving theory and there is different versions of it in the different papers in the 10 years that it has been being proposed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5687.096,
    "end": 5703.882,
    "text": " At least for me it was a difficult job to try to summarize the theory in that way or to have the exact connections of steps because also sometimes some descriptions are verbal but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.682,
    "end": 5729.108,
    "text": " I think that's an important avenue for continuing the research in this field is try to do more accessible descriptions or try to encapsulate them in this way or try to show the sequence more clearly or at least for an introductory purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5729.755,
    "end": 5733.596,
    "text": " Yeah, it's been very much a living theory, the 300 people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5733.616,
    "end": 5741.739,
    "text": "I found this when I wrote the review back in the day, which is that there is this development that's very clear in the series of publications that comes out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5741.819,
    "end": 5746.96,
    "text": "And I think things have changed, obviously, as they develop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5747.0,
    "end": 5755.503,
    "text": "So trying to see the consistency across those types of things, which is the fundamental action and which is later introduced and so on, is very difficult.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5755.523,
    "end": 5782.95,
    "text": " actually and again I don't think it's a I don't criticise the authors of this because I think it is a living theory, it's something that's kind of really evolved in the literature, it's a very complex one so it had to be like that but yeah hopefully as we go forward in the next few years we can become more clear about these things and there'll be more and more people doing reviews and more critical evaluations like Miguel's done which will further ground this theory in a place where we can all agree on and agree on the axioms",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5785.044,
    "end": 5795.631,
    "text": " I just want to say that we should definitely not consider all the axioms and the free energy principle at the moment to be completely fixed in stone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5796.132,
    "end": 5799.274,
    "text": "I feel that it's still living and still evolving in many ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5799.294,
    "end": 5802.236,
    "text": "There's some cases where there's questions about do we actually need this axiom?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5802.536,
    "end": 5803.597,
    "text": "Can it be more general than this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5803.637,
    "end": 5804.798,
    "text": "Can it be less general than this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5805.418,
    "end": 5810.261,
    "text": "I think there's going to be a lot of more foundational discussion around the actual axioms underlying it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5810.862,
    "end": 5812.003,
    "text": "Now the people are just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5812.563,
    "end": 5818.948,
    "text": " really just starting to tackle particular physics in a really deep way that I think that there will, over the next few years, be lots of discussion about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5818.988,
    "end": 5828.015,
    "text": "And hopefully, in a couple of years, we'll have a much more precise statement of what the FEP says, what is needed, what isn't needed, and how everything fits together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5828.035,
    "end": 5835.981,
    "text": "But at the moment, it's still in a fair bit of flux, because really deep critique outside of Carl's group on particular physics is kind of just really starting in the last year or so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5837.722,
    "end": 5838.243,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5838.303,
    "end": 5838.523,
    "text": "Miguel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.764,
    "end": 5854.697,
    "text": " yeah yes i also want to add that okay so so we focus on on the free energy principle and and this claim that dynamical systems or self-organizing systems behave as minimizing the free energy but i think that's only one part of the universe of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5855.829,
    "end": 5863.193,
    "text": " you have the active inference, you have the design of systems that explicitly minimize the free energy, and that's a completely different field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5863.873,
    "end": 5874.038,
    "text": "And often this is also mixed and not sure, and yeah, and there's sometimes a mix between, so which is the axioms that are intervening in the specific papers,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5875.026,
    "end": 5886.872,
    "text": " where you are situated in your work is not always clear for anyone because of this evolution of the theory and these interconnections and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5887.652,
    "end": 5898.458,
    "text": "But I think that becoming more mature, as the field becomes more mature, this will be clear because sometimes this leads to confusion about what the theory means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5900.395,
    "end": 5904.756,
    "text": " People say, okay, the free and ready principle shows that every living system is minimized and free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5904.876,
    "end": 5908.677,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.957,
    "end": 5917.798,
    "text": "So it's different when you think of agents that do it by design or when you try to extend the claim to other systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5918.358,
    "end": 5927.96,
    "text": "So there is these different points of view and these different sides of the theory that I imagine that they are going to evolve into more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5928.919,
    "end": 5939.973,
    "text": " compartmentalize, even if they are interconnected, but in a way that they are clear the borders of the different planes and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5941.306,
    "end": 5967.483,
    "text": " it's gonna be uh an fep metaverse that is appropriate for the online age honestly because when i think about how the needle was pushed here github and interactive computational notebooks preprints like yours live streams like the one that we're on a discord server you know a reading group that was arranged by maxwell and others 10 years ago 20 years ago it would have been like what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5968.303,
    "end": 5970.746,
    "text": " And it certainly wouldn't have been accessible globally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5971.427,
    "end": 5986.805,
    "text": "So to see how the material and the informational culture and also social culture is changing in a time when participatory science and open science and all these kinds of transdisciplinary ideas are coming to the fore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5987.766,
    "end": 5990.389,
    "text": " It's just an awesome contribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5990.649,
    "end": 5997.135,
    "text": "So I'll offer any final thoughts from the chat and each of you a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5997.516,
    "end": 6005.263,
    "text": "But just to say from the lab that we really appreciate your willingness to jump on in short notice and work on it and share it in this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6005.483,
    "end": 6009.447,
    "text": "And also with these exciting directions that you've planned out and expect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.262,
    "end": 6015.524,
    "text": " I completely agree with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6015.544,
    "end": 6029.255,
    "text": "A shout out to people like Maxwell Ramstad who organized these Discord servers, which are really promulgating this debate in wide communities, which are really valuable as infrastructure for people like us to come in and do this type of research.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6029.576,
    "end": 6030.857,
    "text": "I completely agree with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6031.177,
    "end": 6033.739,
    "text": "This new infrastructure there is really important for this type of stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6035.761,
    "end": 6037.542,
    "text": "Aaron, any last comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6037.582,
    "end": 6039.404,
    "text": "And then Miguel, of course, final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6040.899,
    "end": 6068.869,
    "text": " know i just want to echo what chris said really about just the sheer importance of the reading group maxwell organized because i think that's where you know i i learned an awful lot about how particular physics work and you know how everything goes through in that monograph and i think a lot of people did there as well like i think that reading is what really built up enough expertise to you know make papers like this and obviously similar to martin stuff and just generally get everything together probably lots of stuff in the next year or so coming out actually made all of that possible really and so yeah also this is a family like if",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6069.409,
    "end": 6075.213,
    "text": " you're interested in learning more about the FOP, like email Maxwell, because he has recordings of all the reading group meetings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6075.793,
    "end": 6078.175,
    "text": "And so that's probably going to be a really good piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6078.655,
    "end": 6079.956,
    "text": "A good little lockdown, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6080.096,
    "end": 6082.097,
    "text": "Yeah, a lot of recordings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6082.117,
    "end": 6083.658,
    "text": "There'll be lots of material there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6084.259,
    "end": 6088.922,
    "text": "If you want to really drill down into technicalities, then those recordings will probably be really good as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6091.043,
    "end": 6091.304,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6092.104,
    "end": 6096.327,
    "text": "And Miguel, if you'd like to give any last comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.466,
    "end": 6116.427,
    "text": " Yeah, as you said, I think partly as Chris and Brent said, I kind of joined late to the group and just attended to the last sessions, but it was really helpful to dig through some of the discussions that took place there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6117.825,
    "end": 6128.393,
    "text": " In general, what could make the field advance is to make things accessible in different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6129.174,
    "end": 6141.284,
    "text": "This can be through resources, through communities, and also through more transparent models or easier to follow guides through the maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6141.304,
    "end": 6143.906,
    "text": "I think part of the difficulties in the field is that there is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6144.626,
    "end": 6160.034,
    "text": " this a disconnection between people that is doing mathematical work and people that is doing philosophical work and not only here but i think in cognitive science in general or or even more deeper views of systems biology and so on right and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6160.834,
    "end": 6190.36,
    "text": " and that this multi-level yeah i think it's very valuable this this efforts in in in trying to make things more accessible and easier to follow from yeah for people for from multiple disciplines i think that's a very valuable effort that we should try to do collectively because that's the only way and thanks a lot for hosting this session thank you we always talk about tools ideas and people they're a triple helix and so thanks for making it happen with all those today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6191.971,
    "end": 6192.695,
    "text": " Thanks very much for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6193.017,
    "end": 6193.238,
    "text": "Peace.",
    "speaker": "SPEAKER_00"
  }
]