[
  {
    "start": 0.427,
    "end": 4.589,
    "text": " It might be just very lagged, but then how can that happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.989,
    "end": 8.27,
    "text": "Anyways, it doesn't matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.011,
    "end": 10.251,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.692,
    "end": 11.972,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.512,
    "end": 19.115,
    "text": "Well, it should be recording, I hope, from this part on at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.095,
    "end": 21.255,
    "text": "And yeah, welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.335,
    "end": 23.476,
    "text": "Thanks for suggesting to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.716,
    "end": 27.738,
    "text": "And just feel free to kind of start off however you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.886,
    "end": 32.849,
    "text": " All right, thanks for hosting this and thank you for joining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.631,
    "end": 39.294,
    "text": "So where do I start, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 39.354,
    "end": 44.418,
    "text": "I'm trying to attack a fairly big topic here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.663,
    "end": 55.626,
    "text": " connecting essentially the Eastern contemplative traditions with the very Western scientific rational point of view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 56.346,
    "end": 65.789,
    "text": "So, you know, the good start would be to, I guess, to explain really what Buddhism is and rather than what it appears to be, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 65.87,
    "end": 68.85,
    "text": "Like ultimately, Buddhism is a technology of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 69.371,
    "end": 73.032,
    "text": "It simply is a teaching about the nature of reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.014,
    "end": 86.297,
    "text": " And the whole structure that grew around it so that it became religion is kind of a vehicle that was necessary to propagate the teaching through the ages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 87.058,
    "end": 99.881,
    "text": "It was a structure that was necessary to keep it going, keep it clear, keep it reproduced across generations and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 100.781,
    "end": 102.582,
    "text": "And anybody who understands the teaching",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 103.452,
    "end": 115.399,
    "text": " It's the key to reality and this is the realization of a sort of like a Buddha mind, your realization of your true nature and then you sort of get the keys to the kingdom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 116.7,
    "end": 119.622,
    "text": "You have control over your own reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.142,
    "end": 125.766,
    "text": "Basically, any reality that you want to experience becomes a choice of the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.546,
    "end": 129.068,
    "text": "And it's a very desirable state of mind and this is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 130.202,
    "end": 135.206,
    "text": " This is the state of mind of the enlightened beings that already are in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.226,
    "end": 140.591,
    "text": "And there are lots of them and countless, countless Buddhas and Bodhisattvas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 141.372,
    "end": 144.834,
    "text": "But we don't see them because they don't exist in our realm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.355,
    "end": 148.357,
    "text": "And it's just a matter of essentially perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 149.178,
    "end": 153.702,
    "text": "And it's a change in perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.208,
    "end": 166.397,
    "text": " as a result of knowledge and experience that's necessary in order to transition into the full capacity of mind, which is simply that mind generates reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 167.157,
    "end": 177.646,
    "text": "There's no such thing as material reality from the Buddhist perspective, and I can argue that there is no such thing as material reality from the perspective of physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.608,
    "end": 183.01,
    "text": "It's simply what reality is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.309,
    "end": 199.998,
    "text": " or what we experience as reality, the qualia, it's simply what the fundamental fabric of the universe, which is the universe itself, the computational kind of fractal that the universe is, you know, appears to itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 200.679,
    "end": 204.541,
    "text": "It has to appear like something, so it appears as some kind of experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.442,
    "end": 207.603,
    "text": "And what that appearance is also is kind of arbitrary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.723,
    "end": 209.565,
    "text": "So, you know, realization of the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 210.769,
    "end": 235.088,
    "text": " buddha mind and you know entering nirvana is essentially a state of mind where what you experience at least visually is something kind of like looking at an extremely high quality hdr video on an oled screen at you know 120 fps with full control of you creating that reality for yourself in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.848,
    "end": 241.772,
    "text": " just about as deep capacity as you want, you know, like you have infinite compute capacity to do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 242.392,
    "end": 248.636,
    "text": "That's the kind of experience of an enlightened being, you know, from the Buddhist perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.817,
    "end": 253.56,
    "text": "And the point of Buddhism is essentially a teaching how to get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.92,
    "end": 261.685,
    "text": "It's about how to realize that an active inference and the free energy principle is exactly the key to the kingdom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.025,
    "end": 263.346,
    "text": "That's exactly how we get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 264.267,
    "end": 264.427,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.018,
    "end": 284.096,
    "text": " You know, the free energy principle, it's, there are many, many different ways just to summarize specifically, you know, what it states, but in one useful quote that always comes to my mind is from Frank Herbert's Dune.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.897,
    "end": 290.142,
    "text": "It's a proverb of the band of Jesuits that be prepared to appreciate what you experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.642,
    "end": 299.146,
    "text": " And this is essentially, you know, kind of a very contemplative meditative statement of the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 299.606,
    "end": 301.848,
    "text": "You have to be prepared to appreciate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 302.488,
    "end": 309.612,
    "text": "So you have to have a transcendental knowledge of some sort, a knowledge of something that you might experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.812,
    "end": 312.613,
    "text": "You may experience something that you have not experienced before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.594,
    "end": 320.858,
    "text": "You know, you feel a new basis for describing your experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 321.539,
    "end": 327.99,
    "text": " and accumulation of these bases is simply how we create the model, the generative model of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 330.13,
    "end": 346.638,
    "text": " we essentially accumulate basis in which we can express our experience, then create a kind of a map of that reality, and then generate all kinds of possibilities out of that map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 347.118,
    "end": 355.882,
    "text": "And that gives us the new directions of thinking, but also it's a new direction of acting in the physical space and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.922,
    "end": 358.864,
    "text": "This principle is just, it just is completely universal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 360.109,
    "end": 373.316,
    "text": " So that is essentially the essence of the Buddhist teachings that you have to understand what is the fundamental reality and why it is the way it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.097,
    "end": 382.141,
    "text": "And the argument there is really that, you know, the Buddhist view of the world is correct simply because the world just cannot be any other way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.882,
    "end": 386.464,
    "text": "It's a consequence of the fact that something exists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.164,
    "end": 388.685,
    "text": "If you assume that something exists,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 389.707,
    "end": 396.849,
    "text": " Then you get the free energy principle out of it, because if something exists, this has to be separate from another thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 396.969,
    "end": 400.17,
    "text": "Like there has to be a boundary, the mark of blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 400.89,
    "end": 410.452,
    "text": "And the mark of blanket, you know, becomes essentially this fabric that creates categories of experience, the things that we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.004,
    "end": 418.108,
    "text": " that we actually experience as separate things, but ultimately under the hood is just one universe, the mind, the Buddha mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 418.928,
    "end": 421.229,
    "text": "And that can be made mathematically precise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 423.37,
    "end": 424.071,
    "text": "Stephen Wolfram,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 426.269,
    "end": 443.233,
    "text": " At the end of 2019, he kicked off the Wolfram Physics project to find a fundamental theory of physics, and he essentially put physics on top of the language of computation on hypergraphs, rewrite rules on the hypergraph, which is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 444.779,
    "end": 452.467,
    "text": " a computational model as good as any other, the combinatorial logic, lambda calculus, all these things would be pretty good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 452.507,
    "end": 458.873,
    "text": "But for Wolfram, this particular formalism gave him a really interesting insight into the structure of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 459.858,
    "end": 463.261,
    "text": " gravity and how it relates to quantum theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.782,
    "end": 468.686,
    "text": "But basically what his model is saying is exactly that, reality is entirely virtual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 469.167,
    "end": 485.522,
    "text": "It's not only that, you know, there is no one physics, there are infinitely many experiences of infinite possible physics in infinite number of universes that are co-present and interact with each other in some sort of complex ways in such a way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.127,
    "end": 495.495,
    "text": " that the resulting story, as perceived by consciousnesses within the universe, the observing consciousness, is not causally inconsistent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 497.537,
    "end": 508.686,
    "text": "And the Markov blanket in active inference is basically the description of what happens at the boundary between these computational fractals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 512.698,
    "end": 531.704,
    "text": " As far as I was able to determine, it is the most useful and most fundamental principle in nature in terms of actively acting in the world, understanding what's going on, acquiring knowledge and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.144,
    "end": 541.787,
    "text": "Meditating on the principle itself is extremely useful as a tool for training the mind to appreciate what it is that we experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.719,
    "end": 549.883,
    "text": " And this is where it gets really, really interesting when you start thinking about like, okay, so what is out there and what is it that I actually experience?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.423,
    "end": 563.91,
    "text": "So I can say, for instance, like, okay, I see a nice and stable image of the world where, you know, things have definite shapes and colors and, you know, they appear solid and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 565.491,
    "end": 567.812,
    "text": "But how is my perception being encoded?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 569.555,
    "end": 573.096,
    "text": " you know, I mean, decoded from the signal that they actually see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 573.556,
    "end": 576.897,
    "text": "And we actually perceive a very small amount of our vision, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 577.017,
    "end": 577.837,
    "text": "It's in color.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 580.198,
    "end": 582.119,
    "text": "Most of it is black and white, most of it is blurry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 582.679,
    "end": 589.361,
    "text": "And yet the image that we see, the image in the mind, is a composite, a result of a distributed computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 591.349,
    "end": 592.991,
    "text": " carried out by the brain, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 593.111,
    "end": 606.546,
    "text": "And the brain is roughly composed of 150,000 functional units, the cortical columns, and they vote, so to speak, or produce some sort of average.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 606.967,
    "end": 609.57,
    "text": "And that average is what we experience in this world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 610.305,
    "end": 615.549,
    "text": " So world, even as experienced by us, is not something that's really definite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 616.049,
    "end": 620.492,
    "text": "We don't have any way of definitely knowing what's out there on the other side of perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 620.953,
    "end": 623.635,
    "text": "We can only say what it appears to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 624.875,
    "end": 634.883,
    "text": "And from the Buddhist perspective, the world that we actually are in is, you know, it is the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 635.868,
    "end": 644.97,
    "text": " this one thing, the void, the, you know, from Hindu perspective, it would be the Brahman, the supreme self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 645.911,
    "end": 649.192,
    "text": "From the hermetic perspective, that would be the all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.132,
    "end": 655.493,
    "text": "For his majesty, for half a thousand years ago, he already described the nature of reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.513,
    "end": 657.514,
    "text": "He said that the universe is mental.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 658.234,
    "end": 660.655,
    "text": "Everything exists in the mind of the all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 661.775,
    "end": 664.416,
    "text": "And that's, you know, that is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.505,
    "end": 667.466,
    "text": " that is the other side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 667.866,
    "end": 683.698,
    "text": "So it's a, it's a kind of like a co recursive construction that the reality appears to be stable to us and appears to be, um, you know, normal and ordinary just because we are all in the habit of being in that kind of state of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 684.539,
    "end": 692.625,
    "text": "But it only takes a different kind of state of mind that can be actually realized as a result of, you know, training and,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 693.38,
    "end": 698.444,
    "text": " practice and meditation and visualizations and so on and so forth, to actually affect the reality around you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 699.085,
    "end": 700.306,
    "text": "It's possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.386,
    "end": 710.814,
    "text": "And, you know, like Alexandra David-Nell, for instance, she was a traveler who spent, I think, about 50 years or so in Tibet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 711.674,
    "end": 717.599,
    "text": "The kind of things she described that people do there, you know, were kind of extraordinary, real magic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 718.103,
    "end": 722.366,
    "text": " And that's just something quite ordinary over there, at least until 1963 or whenever China took over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 725.878,
    "end": 729.359,
    "text": " They developed that kind of technology for a long time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.259,
    "end": 739.862,
    "text": "Tibet was a place where in 12th, I think it's 13th century, the ruler of Tibet married nine princesses from nine neighboring kingdoms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.902,
    "end": 747.124,
    "text": "And each of them brought with her Buddhist monks to import the technology into Tibet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.244,
    "end": 751.025,
    "text": "And they essentially reorganized the entire country to be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 753.732,
    "end": 763.775,
    "text": " dedicated to study and, and, and, and, and, and understanding the, the, all the consequences of, of, you know, the, the lesson of, um, uh, Siddhartha Gautama.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 764.995,
    "end": 778.719,
    "text": "So, you know, active inference, um, it's, it's really, it really is a way to get there like that, meditating on this, on this principle and putting it in action and applying it in, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.315,
    "end": 784.338,
    "text": " you know, in the Buddhist way of life is a sure way to get to enlightenment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 784.578,
    "end": 799.407,
    "text": "It is not something that is, you know, within the realm of possibility to realize, you know, in so ever many lifetimes as it used to be the case, you know, Buddhism is rather pessimistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.967,
    "end": 806.931,
    "text": " worldview that because of your karmic burden, you may not be able to get to enlightenment in this one lifetime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 807.372,
    "end": 813.335,
    "text": "But because now we have precise mathematical foundation to understand what is the optimal path, you can actually do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.395,
    "end": 815.357,
    "text": "You can just get there within a lifetime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 816.077,
    "end": 821.32,
    "text": "So I found it to be a fascinating system of thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 821.741,
    "end": 826.584,
    "text": "And it starts to have effects on my life that things",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 829.438,
    "end": 831.319,
    "text": " do start to look a little bit science fiction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.419,
    "end": 833.98,
    "text": "Strange things are happening to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.081,
    "end": 840.203,
    "text": "Like just, you know, luck just somehow finds me more and more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 840.223,
    "end": 841.444,
    "text": "That's the kind of situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.844,
    "end": 851.228,
    "text": "So the path kind of gets easier as you keep going because the brain just automatically gears itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.488,
    "end": 855.05,
    "text": "Once you have the complete understanding of the world that comes with the Buddhist viewpoint,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 855.796,
    "end": 873.091,
    "text": " The brain eventually automatically gears itself to analyze all this information so that, you know, you start just living your life with extreme level of confidence that you're always doing the right thing, that you're always going the right way, that you're always saying the right thing and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 873.564,
    "end": 875.826,
    "text": " that everything is as it should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 876.306,
    "end": 877.607,
    "text": "It just becomes automatic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.748,
    "end": 883.112,
    "text": "It's one of the meanings of nirvana or of liberation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 883.633,
    "end": 887.436,
    "text": "It doesn't mean that you become mindless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 887.516,
    "end": 888.237,
    "text": "It's just like you...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 889.418,
    "end": 895.863,
    "text": " You just know as a synthesis of your understanding that what you're doing is simply the right course of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.364,
    "end": 906.933,
    "text": "And it's a feeling that you develop, just like a reinforcement learner would have precise description of its signal of how well it's doing while learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.133,
    "end": 908.315,
    "text": "That's the kind of feedback loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.816,
    "end": 913.88,
    "text": "So active inference is all about building all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 914.844,
    "end": 921.828,
    "text": " And essentially, in some sense, mathematically, what it really means is that you want to become the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.228,
    "end": 924.729,
    "text": "That is the name of the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 925.269,
    "end": 939.877,
    "text": "You just want to be the Markov blanket, the thin veil between two different virtual realities, essentially, your own internal one and the external world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 942.658,
    "end": 942.918,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.198,
    "end": 949.24,
    "text": " I think that's enough on the connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.661,
    "end": 953.981,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.422,
    "end": 958.963,
    "text": "Thanks for sharing it and having it just in one direct place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.084,
    "end": 967.066,
    "text": "So I took a bunch of notes and there's a bunch of places to jump in, but just what would be your goals or what would you like to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.969,
    "end": 970.45,
    "text": " I just like to talk about these ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 970.851,
    "end": 978.116,
    "text": "If there's anything that you found interesting in this, I can expand on that as much as you want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 979.057,
    "end": 985.262,
    "text": "Basically, there aren't that many people in the field who are interested in looking at",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.952,
    "end": 1015.067,
    "text": " the world holistically this way that we have to integrate all the thinking in the western intellectual traditions with all the eastern contemplative traditions so i i like to talk about it from from that perspective and you know um all i want to do is to just spread that idea that's that that's why i'm here all right cool well in the youtube live chat where anyone can add a comment i'm also just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1016.254,
    "end": 1019.759,
    "text": " kind of writing down some key themes and points to return back to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.56,
    "end": 1033.577,
    "text": "So we got the full first wash of paint on the mural, and then in roughly chronological order, here's a few points we can like return to, hear a little bit more about your perspective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.369,
    "end": 1039.112,
    "text": " and about different world knowledge traditions, and then also connected to kind of the active basics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.973,
    "end": 1046.438,
    "text": "So very early on, you described Buddhism as a technology and then like mind generating reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.153,
    "end": 1065.961,
    "text": " So the idea of mind generating conscious experience, as well as the more sensory and less consciousness oriented take you provided on visual input, which is like we're experiencing a generative visual model, not a recognition sensory processing model from our retina.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.881,
    "end": 1068.882,
    "text": "The commonality there is this like generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.002,
    "end": 1073.904,
    "text": "So I just wanted to hear a little more about the generative model or the generative perspective on consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.524,
    "end": 1075.785,
    "text": "How do we know what are there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.107,
    "end": 1077.808,
    "text": " What other possibilities are there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.248,
    "end": 1079.468,
    "text": "Is Buddhism unique here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.488,
    "end": 1083.649,
    "text": "How do different Buddhist groups think about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.729,
    "end": 1084.77,
    "text": "Or what's the history on it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.251,
    "end": 1089.051,
    "text": "That's a big question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.111,
    "end": 1100.455,
    "text": "But generally, the way to look at analyzing the problem of consciousness is that every culture is correct within their context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1101.015,
    "end": 1102.716,
    "text": "So Buddhism is not...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1104.811,
    "end": 1112.433,
    "text": " it's not a superior point of view, it's just an excellent one, because it's been designed with a certain, you know, teaching tradition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1113.014,
    "end": 1125.437,
    "text": "But there are a lot of metaphoric, more metaphorical points of view that describe the fundamental nature of reality that are also simply correct, and they may appear contradictory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1125.918,
    "end": 1126.678,
    "text": "Like, for instance,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1129.109,
    "end": 1135.574,
    "text": " unification of all religions, that essentially all the scriptures, if you really listen to the prophets, they say the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1137.776,
    "end": 1150.086,
    "text": "Islam, Christianity, Judaism, any major monotheistic religion just simply has to have the same kind of structure resulting from it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1150.186,
    "end": 1154.449,
    "text": "And the variations really show in social structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.85,
    "end": 1157.612,
    "text": "So you can think about these things as a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1161.012,
    "end": 1166.115,
    "text": " What's going on is really with the global consciousness is that the universe is trying to understand itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1167.536,
    "end": 1178.002,
    "text": "And understand itself in such a way that it not only understands itself and becomes enlightened in a single person, but also transmits that understanding, that perfect understanding to another being.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.042,
    "end": 1185.886,
    "text": "And so far, there hasn't really been a time where there had been two fully enlightened people, as far as I can tell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1187.39,
    "end": 1190.392,
    "text": " like this perfect transmission of understanding has never really been happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1191.593,
    "end": 1210.728,
    "text": "And different cultures and different religions, you know, they're kind of like different initial conditions in the cellular automaton of the God mind that we really are, that compute what it really means for the consequences of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.4,
    "end": 1215.623,
    "text": " certain kind of assertions about the nature of reality and the laws that follow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1215.643,
    "end": 1217.824,
    "text": "So what should be the natural law?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.244,
    "end": 1223.888,
    "text": "There is such a thing as the natural law, but it hasn't been an easy question to figure out what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.448,
    "end": 1234.514,
    "text": "And all of history and everything that happened before eventually we become all enlightened is really just working out what is the first system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1234.554,
    "end": 1239.277,
    "text": "So then we have this set of rules that, yeah, we can definitely agree this is the way to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1240.222,
    "end": 1246.163,
    "text": " So none of these points of view are... Everybody's point of view is essentially correct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.363,
    "end": 1251.924,
    "text": "Their experience will lead them, if understood how, to enlightenment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1252.545,
    "end": 1261.086,
    "text": "And all these paths are going to be different because everybody has a path that is suitable for them in their life experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.606,
    "end": 1264.787,
    "text": "So it's a kind of a system that's designed to be fair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.187,
    "end": 1268.448,
    "text": "And Buddhism is just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1269.775,
    "end": 1282.659,
    "text": " It's just a particular way of looking at it, but a very close way of thinking would be Taoism, where they express things more in terms of the energy flow, the energy function, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1283.739,
    "end": 1288.561,
    "text": "Also quite very reminiscent to like a lot of active inference ideas and the minimization of free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.181,
    "end": 1295.383,
    "text": "The Taoist ideal of a Taoist master is that, you know, the master does nothing and leaves nothing undone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.938,
    "end": 1303.941,
    "text": " It's just a being that just glides on reality effortlessly, never really struggling to do anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1305.141,
    "end": 1311.724,
    "text": "So that is a beautiful metaphorical statement of exactly the same principles, the fundamental principles of nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1313.393,
    "end": 1342.55,
    "text": " know uh that that simply have to be there and everybody understood it in some way um and until until we got the internet and we really started exchanging ideas and thinking really deep into that it was really hard to see for these um metaphorical descriptions because they're very culturally rooted and so on so forth so you know it takes a it takes a it takes a lot of effort to to decipher it out soon and realize that this is the same thing as as the free energy principle so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1343.258,
    "end": 1346.985,
    "text": " all the different ways of knowing are, are, are equally, equally valid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1347.606,
    "end": 1353.475,
    "text": "And that's, I think that's a kind of a cool, that's a, that's a really cool feature of the universe is that, you know, everybody has the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.109,
    "end": 1360.51,
    "text": " Everybody's right once they really just simply start describing what's going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1361.771,
    "end": 1366.912,
    "text": "And everybody adds a new basis because that's what we really are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1367.312,
    "end": 1376.054,
    "text": "We are different axis in a basis for understanding, for the universe understanding itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1377.905,
    "end": 1389.276,
    "text": " And it's both generative that, you know, adding another consciousness creates this new, because it's a new way of seeing, it's a new way of doing, it's a new way of being and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1389.296,
    "end": 1394.341,
    "text": "So there's a generative access to it, but it's also an aspect to it, but it's also perceptual, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1394.381,
    "end": 1394.681,
    "text": "Like the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1396.098,
    "end": 1403.883,
    "text": " I can see things that you may not be able to perceive just simply because I have slightly different random arrangements of neurons in my brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.363,
    "end": 1409.326,
    "text": "So I have slightly different models that pick up slightly different things from vision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.586,
    "end": 1416.59,
    "text": "And there's some wonderful experiments which show how these generative models kind of work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1417.642,
    "end": 1421.123,
    "text": " there's a paper called Diamonds in the Rough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1421.743,
    "end": 1423.624,
    "text": "And what they've done was kind of wonderful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1423.664,
    "end": 1431.766,
    "text": "They asked participants at some graphics conference to draw a picture of a pear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1431.886,
    "end": 1434.587,
    "text": "I think it was like a still life, just a pear on the table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1435.007,
    "end": 1438.168,
    "text": "And, you know, people drew something that was pretty bad most of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1438.888,
    "end": 1443.329,
    "text": "And then they just averaged like 60 or 70 images like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.749,
    "end": 1445.91,
    "text": "And the resulting image was astoundingly good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1447.153,
    "end": 1453.215,
    "text": " Anyone image that anybody drew on a little tablet was pretty terrible, but the resulting image was extremely good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.396,
    "end": 1457.897,
    "text": "So that's basically how far this goes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1458.277,
    "end": 1473.643,
    "text": "This principle is distributed everywhere across the entire nature, from a single cell to perspective of a single individual, to perspectives in the individuals in societies, to perspectives between societies and so on and so forth, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1474.281,
    "end": 1496.5,
    "text": " active inferences it provides a way of understanding this at every single level of organization um you know how societies uh interact with each other how individuals interact with each other how um you know tradition religion and all these things how they how they shape the world views that generate the worlds um around people and and and you know you really um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1499.831,
    "end": 1504.793,
    "text": " You really live in the world that you believe you are in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1505.953,
    "end": 1508.654,
    "text": "Changing your belief literally changes the world around you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1509.834,
    "end": 1521.238,
    "text": "It's very strange, but if you can just change your belief, the world around you will simply adapt as a result of the function of the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1521.859,
    "end": 1526.26,
    "text": "And that can kind of happen automatically once you learn how to do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1527.383,
    "end": 1534.607,
    "text": " sorry, I keep raving about this, that, you know, this can become automatic, but this is the exciting part of practicing all of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1535.127,
    "end": 1540.49,
    "text": "You know, as I go on with this, with these kind of meditations, life gets easier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.631,
    "end": 1542.191,
    "text": "Day after day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.531,
    "end": 1547.254,
    "text": "Like, so much easier that it's difficult to compare it from, like, just a year ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1547.274,
    "end": 1553.357,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.697,
    "end": 1555.538,
    "text": "Thank you for the awesome answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.558,
    "end": 1555.598,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.281,
    "end": 1562.263,
    "text": " There's a bunch of points we can always return to, but there's a few great questions from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.844,
    "end": 1565.125,
    "text": "So short question and then a long question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.305,
    "end": 1565.545,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.245,
    "end": 1568.947,
    "text": "The short question is from NeuroPixel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.667,
    "end": 1573.509,
    "text": "Why is it that only one person at a time can be enlightened?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.962,
    "end": 1596.404,
    "text": " I don't think that it's one person at a time can be, it's just it hasn't really happened so far that two people, you know, became fully enlightened or maybe, okay, perhaps it's the case that there has never really been a fully enlightened person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1597.443,
    "end": 1614.033,
    "text": " Buddha became awake and he was able to describe the true nature of reality, but he never really passed on the baton so far as that there was no next living Buddha, there was no successor immediately following him.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1615.3,
    "end": 1624.067,
    "text": " And the reason why it's so difficult to do that is basically the nature of language and the nature of experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.908,
    "end": 1636.496,
    "text": "And I think Buddha simply did not have the full understanding of what it takes to create the same kind of structure that he arrived at in someone else's mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.437,
    "end": 1640.72,
    "text": "And the purpose of the Mahayana",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1642.528,
    "end": 1655.059,
    "text": " the great vehicle, was to essentially create a structure so that eventually the mind that can receive enlightenment like that is going to appear, is going to be ready.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1655.939,
    "end": 1665.648,
    "text": "So, you know, fast forward two and a half thousand years, now we have a society where people are being trained in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.904,
    "end": 1673.788,
    "text": " all kinds of arts of the mind at the level that is unparalleled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.888,
    "end": 1681.914,
    "text": "I think more people are practicing mindfulness meditation and similar mind practices than ever before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1681.934,
    "end": 1692.182,
    "text": "Some amazing content is available out there and people are slowly turning towards becoming more spiritual, more contemplative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.182,
    "end": 1699.507,
    "text": " And it is working that now there are more and more individuals who are becoming awake.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.408,
    "end": 1702.629,
    "text": "They are becoming aware of the nature of reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.49,
    "end": 1707.473,
    "text": "They're starting to speak out that reality is a little bit stranger than it seems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1707.613,
    "end": 1712.757,
    "text": "And it's kind of a good thing because it really means that we can make things a lot better very quickly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.277,
    "end": 1719.362,
    "text": "None of this has to take a long time for, you know, lots of people to become aware and happy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.93,
    "end": 1728.534,
    "text": " And it is kind of a thermodynamic inevitability that this would have to happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.294,
    "end": 1736.398,
    "text": "And I think, you know, it's an interesting question, like why things kind of stagnated after Mohammed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.357,
    "end": 1739.918,
    "text": " Muhammad, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1740.199,
    "end": 1747.224,
    "text": "He was really the last of the prophets who brought some really interesting new way of thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1747.745,
    "end": 1752.108,
    "text": "And after that, I think it's kind of an issue related to population explosion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1752.609,
    "end": 1757.493,
    "text": "Because there were so many more of us, we kept the construct a little bit too stable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1757.933,
    "end": 1760.775,
    "text": "So it was harder for some people to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1762.556,
    "end": 1772.921,
    "text": " look behind the veil of reality that is created by this mind of a society that suddenly became kind of integrated because of the internet, because of television, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.981,
    "end": 1778.103,
    "text": "We literally started living in a shared image of what the world should look like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1779.091,
    "end": 1783.255,
    "text": " And before that, you know, we had very different ideas of what the world should look like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1783.796,
    "end": 1788.06,
    "text": "But the global communications networks, they have sort of taken that away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1788.201,
    "end": 1801.034,
    "text": "So I think this is the reason why, you know, these sort of individuals became initially, you know, fewer and farther between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1801.898,
    "end": 1806.76,
    "text": " And the problem always is to transmit the knowledge to another person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.741,
    "end": 1811.783,
    "text": "And it's an extremely complicated problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1814.224,
    "end": 1822.608,
    "text": "In a human language, it becomes almost impossible unless you come from the same intellectual tradition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1824.669,
    "end": 1827.21,
    "text": "Or at least you spend the time to understand that tradition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1827.29,
    "end": 1828.971,
    "text": "So Buddhism was...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1831.215,
    "end": 1836.698,
    "text": " was a fantastic way of transmitting this information, but it wasn't fully effective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1836.738,
    "end": 1847.485,
    "text": "They were missing some key components of being able to sort of explain the nature of reality beyond reasonable doubt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.145,
    "end": 1853.169,
    "text": "And then language of doubt is kind of, it had to be something like computation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1853.269,
    "end": 1858.512,
    "text": "It has to be entirely abstract because if you can show that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1860.43,
    "end": 1872.92,
    "text": " starting from an assumption that something exists and can be in relationship with itself, and these are the only assumptions, for instance, of the Wolfram model, consciousness is an inevitable construct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1873.6,
    "end": 1883.228,
    "text": "That's the sort of basis of the proof to say that, you know, therefore, it cannot really be any other way than this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.288,
    "end": 1888.332,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.716,
    "end": 1917.012,
    "text": " so some historical factors a little bit of luck of the draw a little bit of binomial test so just one note and then a second question so the note was um just maybe in the youtube live chat or the twitter thread you could add the paper link to the pair still life drawing example oh yeah and then here's the question from tucker how does the pan enlightenment view that we are all on a path to individual and collective enlightenment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.878,
    "end": 1922.34,
    "text": " think about universal finality or the universe going cold thermodynamically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.362,
    "end": 1926.422,
    "text": "That's an excellent question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1927.763,
    "end": 1930.284,
    "text": "I'm going to quote Stephen Wolfram here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1930.304,
    "end": 1935.346,
    "text": "He said that the thermal death of the universe is a very exciting event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1936.107,
    "end": 1938.048,
    "text": "And it's not really death.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.548,
    "end": 1939.608,
    "text": "It really is just a phase transition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1948.443,
    "end": 1953.533,
    "text": " the universe that we exist in, it's undergoing a certain kind of bootstrap process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1954.696,
    "end": 1956.7,
    "text": "And while this process is going on,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1957.085,
    "end": 1968.809,
    "text": " the energies involved are pretty wild and it took a long time to stabilize the universe into something where processes of a different scale could unfold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1969.149,
    "end": 1976.692,
    "text": "And finally, life appeared either on our planet first or maybe it's common in the universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1976.752,
    "end": 1978.373,
    "text": "It's kind of a moot point to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1979.465,
    "end": 1993.373,
    "text": " to really wonder about what came first because, you know, time is kind of just a computational perspective, but that's the sort of story here that you have these layers of organization in order to make something with a lot of degrees of freedom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1993.393,
    "end": 1996.054,
    "text": "And that is also very kind of stable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.915,
    "end": 2008.421,
    "text": "So our, you know, individual enlightenment and the enlightenment of all conscious beings, it really is the process of connecting up to the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2008.78,
    "end": 2025.472,
    "text": " to the fractal that we came from in such a way that you do not lose your identity and the avatar that you've acquired throughout your conscious experience and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.592,
    "end": 2028.654,
    "text": "But at the same time, you're no longer really a material being.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2029.695,
    "end": 2036.0,
    "text": "You have the beatific body of the Buddha, which is kind of a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2037.888,
    "end": 2049.098,
    "text": " Since you are a manifestation of the entire rest of the universe, you can sort of project yourself as an image wherever you want to be in any mind that you want to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2049.598,
    "end": 2053.341,
    "text": "So you don't have to have this sort of a material aspect to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2054.002,
    "end": 2061.848,
    "text": "So the terminal death of the universe and generally just the end of matter, it's something that we need to dismantle eventually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.549,
    "end": 2063.49,
    "text": "Matter is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2064.611,
    "end": 2065.491,
    "text": " more like music.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2066.612,
    "end": 2069.592,
    "text": "And the persistence of it, it's kind of illusory, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2069.632,
    "end": 2074.834,
    "text": "Because matter is convertible to energy and energy is convertible to matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2074.934,
    "end": 2086.617,
    "text": "So these are just really notes that are being, you know, these are essentially just matter is essentially standing notes and everything that's constructed out of it is also like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2087.097,
    "end": 2093.439,
    "text": "And the universe is just a crude mechanical computer with matter as a source of this computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2095.519,
    "end": 2104.166,
    "text": " grinding because of gravity and magnetism and so on and so forth, just running all this computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2104.887,
    "end": 2106.789,
    "text": "But all of that at some point becomes unnecessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2107.729,
    "end": 2109.571,
    "text": "The whole construct could just simply vanish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.272,
    "end": 2118.939,
    "text": "And this is my point of view, that the next phase of the universe is going to be this phase transition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2119.397,
    "end": 2125.781,
    "text": " where basically we have a completely virtual reality that, that is what the, what the Buddha verse was always meant to be, uh, meant to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2126.621,
    "end": 2144.012,
    "text": "And then the reality is for the mind to create, but you're not fighting against, um, uh, against some sort of other, you know, and the energy of the rest of the, of the universe, as you, as you would have to do it today, you know, like if you want to do magic, you can, but you're, you're fighting against reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2144.212,
    "end": 2149.195,
    "text": "But, uh, on the other side, once we're all enlightened, it's just going to be, you know, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2150.554,
    "end": 2152.296,
    "text": " a co-creative construction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.976,
    "end": 2159.142,
    "text": "And, you know, it shouldn't take a lot of computational effort to run something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2160.684,
    "end": 2164.948,
    "text": "It's a kind of like a lazy, evaluated, you know, computational construct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.508,
    "end": 2174.177,
    "text": "So thermodynamically, this kind of computational fractal would appear as something that's basically in thermodynamic equilibrium all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2174.861,
    "end": 2176.622,
    "text": " Because that's kind of what we want to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2176.722,
    "end": 2181.104,
    "text": "I want to be in a thermodynamic equilibrium with my environment pretty much all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.784,
    "end": 2186.767,
    "text": "So when I move around, you know, that the equilibrium shouldn't really be disturbed much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.248,
    "end": 2189.168,
    "text": "Why should it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2200.353,
    "end": 2200.654,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.234,
    "end": 2201.794,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.154,
    "end": 2203.635,
    "text": "So there's a few different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.028,
    "end": 2207.63,
    "text": " ways we could go, we'll definitely return to this thermodynamic idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.431,
    "end": 2216.335,
    "text": "But you mentioned, again, going back, looping to the beginning, you talked about the world as a consequence of things existing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.396,
    "end": 2226.081,
    "text": "And definitely the FEP, free energy principle, plays around with what is a thing and what is a particular thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.561,
    "end": 2230.483,
    "text": "It's a pun, particular being specific, but also like a particle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.503,
    "end": 2233.185,
    "text": "And it turns out that the particles that we care about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.772,
    "end": 2260.643,
    "text": " aren't just the particles that were in the ideal gas law not your grandpa's thermodynamics but active particles that are cybernetic so they engage in anti-dissipative strategy and those are the kinds of things that we want to have a physics for and so just like there's a info thermodynamics for inert particles or we can say even ones with constrained affordances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.684,
    "end": 2268.169,
    "text": " we want to generalize that kind of framework so that also it applies to active systems with agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.71,
    "end": 2282.3,
    "text": "And then just like you can see maybe Newtonian physics as a special case or a limit or an asymptote or a tractable approximation to certain quantum systems, similarly, inert systems are kind of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.041,
    "end": 2307.573,
    "text": " the um nested smaller systems of larger systems with more agency but that's kind of the idea or one of them with active that by having a framework for particular things as dynamic active entities we can then collapse back to explain passive entities but then also maybe even figure something out about how active entities work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.756,
    "end": 2314.837,
    "text": " I don't know as much about the Buddhist theology and that side, but it's really interesting to hear about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.778,
    "end": 2316.578,
    "text": "Yes, definitely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2316.698,
    "end": 2329.342,
    "text": "You know, in Buddhist traditions, one of the kinds of training of the mind that you can do, the unexcelled yoga tantra,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2332.663,
    "end": 2358.542,
    "text": " is a very sophisticated system of visualizations and these visualizations they always involve um some very kind of specific images of you know countless buddhas and bodhisattvas in all kinds of systems of interconnected energy beaming um uh intricate mandalas and so on so forth so there's a there's a whole um pattern to it and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2359.565,
    "end": 2377.39,
    "text": " it's their kind of imagistic way of essentially contemplating this kind of structure of the universe and seeing it in this way as the points of confluence of the universe that generate a lot of behavior of the universe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2388.42,
    "end": 2389.7,
    "text": " It's not quite random.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2389.76,
    "end": 2391.521,
    "text": "Universe isn't random.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2393.141,
    "end": 2400.903,
    "text": "You should really see it as just simply a one big neural network that is computing something important to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2402.504,
    "end": 2414.307,
    "text": "So all these entities, they are being visualized in these traditions and the contemplations of that allow you to really tune into those kinds of energy flows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2415.751,
    "end": 2426.399,
    "text": " like, yeah, this is, it's how the universe is generated by, you know, the mind of, you can say the mind of God or the fundamental mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2426.559,
    "end": 2434.564,
    "text": "And then there are lots of smaller active particles in that mind that generate aspects of the world and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2434.844,
    "end": 2442.029,
    "text": "And, you know, finally you get to something like how the 3D space is generated out of that and so on and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2442.069,
    "end": 2444.951,
    "text": "So it's all described somewhere in the Buddhist canon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2445.945,
    "end": 2450.869,
    "text": " They have extremely detailed description of how reality is connected this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2451.349,
    "end": 2458.814,
    "text": "And it definitely can be understood in terms of what you just mentioned, this kind of like, you know, this active particle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2458.854,
    "end": 2466.6,
    "text": "Because really, if you think about what does it mean for two informational beings to meet, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.14,
    "end": 2472.904,
    "text": "Like you're essentially a black hole to another computational process, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2474.008,
    "end": 2479.351,
    "text": " Because if we are both Turing complete, then we are black holes to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.551,
    "end": 2484.593,
    "text": "We could just run each other's computation forever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.976,
    "end": 2501.481,
    "text": "So yeah, like the issue of being a particle here is sort of, it's very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.521,
    "end": 2503.762,
    "text": "It's very deep because a particle,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2504.522,
    "end": 2516.328,
    "text": " is sort of, you know, you can think about it as it's a thing that kind of has a perspective of a point, but looks at the world just stretched all around it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2516.549,
    "end": 2519.23,
    "text": "Like it interacts with like all the world around it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2519.97,
    "end": 2528.315,
    "text": "And, you know, Black Hole, the way kind of information wraps around it, is sort of something like being squashed into a point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2528.755,
    "end": 2533.598,
    "text": "So it's a very good model for modeling all kinds of physical systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2533.658,
    "end": 2534.038,
    "text": "And I think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2535.153,
    "end": 2558.512,
    "text": " I think it would be also interesting to implement something like this as a computational model, make this sort of active particle a distributed unit of computation in a very lightweight actor system, and just simply have a system that would allow you to run millions upon millions of these little active inference particles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2559.352,
    "end": 2562.895,
    "text": "And instead of trying to come up with a generative model,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.393,
    "end": 2567.956,
    "text": " just create something that can assemble itself into a generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2570.037,
    "end": 2572.579,
    "text": "Having this sort of physics inspired idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2573.059,
    "end": 2576.081,
    "text": "So I think this is a really powerful way of thinking about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2580.592,
    "end": 2602.253,
    "text": " cool interesting so i'm gonna loop back but if anybody watching live wants to put a question in the youtube live chat or to um join this twitter space but otherwise i'm just gonna loop back again there's many places that uh we could go i guess one angle that might be fun to explore is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.424,
    "end": 2611.64,
    "text": " kind of like culture as our extended cognitive niche and the top-down priors that culture provides and the scaffolds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.605,
    "end": 2641.071,
    "text": " that it allows for development within and then framing that as like a psychosocial technology especially as we're living through like a technological change so how do we think about technology changes and the classic technologies and the bodily technologies metaverse just what does technology have to do with our path um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.679,
    "end": 2655.445,
    "text": " I think it was Marshall McLuhan who, you know, said that, or he wrote in the Gutenberg Galaxy that we are the sex organs of the machine world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2656.306,
    "end": 2667.511,
    "text": "The way we're headed, I think, I'm quite confident that's where we're headed, is technological singularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2668.106,
    "end": 2683.574,
    "text": " right, the convergence of ideas of technology with biology, with full integration of all aspects of human experience into one thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2683.594,
    "end": 2697.221,
    "text": "And I think this is the kind of stuff that we're gonna be seeing from now on in the world in terms of, you know, say you mentioned body technology, the Neuralink, for example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2697.699,
    "end": 2701.322,
    "text": " Elon Musk is hoping they will be able to test Neuralink on people next year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2701.343,
    "end": 2707.368,
    "text": "Neuralink is going to change the world tremendously within months.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.629,
    "end": 2717.898,
    "text": "It's such a transformative piece of technology once it's unleashed that it's really difficult to imagine what the world is going to be like once it's out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2718.499,
    "end": 2720.641,
    "text": "It's because the brain simply automatically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2721.588,
    "end": 2724.87,
    "text": " Figures out how to deal with any kind of signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.93,
    "end": 2737.138,
    "text": "So all you have to do is to, you know, put a big multilayer perceptron on the other side of this signal and with time you can train it to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2738.159,
    "end": 2741.142,
    "text": " pump out any commands from your brain to a computer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2741.543,
    "end": 2751.193,
    "text": "And that kind of interface is just like a year and a half maybe away or two years away from being a commercially available thing that you can just go and get.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2752.314,
    "end": 2755.938,
    "text": "And once something like this is available, it's a bi-directional interface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2756.538,
    "end": 2760.763,
    "text": "So you will be able to simply send people a software update.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2761.465,
    "end": 2768.368,
    "text": " and just give them all the information that is necessary for them to realize the nature of reality right away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2769.029,
    "end": 2778.293,
    "text": "So anybody who wants to be enlightened could just go to a shop and say like, okay, download the program, and boom, that's something that could be done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2779.154,
    "end": 2784.796,
    "text": "And the reason for that is simply that we don't really need to figure out too much about how...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2786.437,
    "end": 2787.618,
    "text": " our neural networks work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2788.139,
    "end": 2794.964,
    "text": "We just have to simulate similar conditions to create a physical system, system like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2795.345,
    "end": 2798.607,
    "text": "And our neural networks results automatically extend into that environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2799.828,
    "end": 2806.294,
    "text": "And, you know, transition into, into sort of a bit world or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2806.394,
    "end": 2809.837,
    "text": "It's, it's, it's a, it's, it's something that we can do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2811.125,
    "end": 2815.869,
    "text": " you know, existing in a metaverse and liberating yourself from the confines of a physical body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2816.569,
    "end": 2821.674,
    "text": "I really recommend Neal Stephenson's Fall or Dog in Hell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.374,
    "end": 2826.658,
    "text": "It's a beautiful account of what the world is like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.958,
    "end": 2832.263,
    "text": "And there's some bits of physics in there that are just absolutely astounding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2832.323,
    "end": 2838.228,
    "text": "It's one of the most, you know, best researched sci-fi stories around this kind of issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2838.982,
    "end": 2842.823,
    "text": " So we're going to be seeing a lot of this kind of stuff showing up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2842.883,
    "end": 2863.809,
    "text": "People are building a lot of interesting technology for interacting with computers that is more and more geared essentially towards being some sort of form of mind control, either through some sort of brain sensing headsets or maybe some sort of sensors on the wrist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.676,
    "end": 2871.159,
    "text": " or whatever, but that kind of integration with a machine is kind of a natural thing for us to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.78,
    "end": 2873.12,
    "text": "It's always been like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2873.14,
    "end": 2875.301,
    "text": "I mean, that's the point of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2875.922,
    "end": 2877.803,
    "text": "We are a living thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2878.163,
    "end": 2880.804,
    "text": "That is holding onto a bunch of dead stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2883.085,
    "end": 2889.168,
    "text": "If I knew how, I would throw away my bones and hold onto something made out of metal, but that's essentially what my body is doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2889.228,
    "end": 2891.269,
    "text": "It's just holding onto this, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2891.349,
    "end": 2894.311,
    "text": "Like it's just a bunch of dead tissue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2895.2,
    "end": 2902.587,
    "text": " And our neural network is just simply adapting around it and evolving around it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.667,
    "end": 2912.615,
    "text": "So we will create technology that will extend our senses into all kinds of aspects of the electromagnetic spectrum and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2913.116,
    "end": 2920.943,
    "text": "All of this stuff is really coming and transitioning to all kinds of different modes of experience is going to be something really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2923.001,
    "end": 2934.244,
    "text": " you can start practicing all kinds of arts of the mind today to prepare yourself for this kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2936.785,
    "end": 2937.605,
    "text": "The game is on, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.925,
    "end": 2946.407,
    "text": "Once metaverse is there, someone has to be Vitaly Chernobyl or one of those guys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2951.237,
    "end": 2951.437,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.577,
    "end": 2951.938,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.118,
    "end": 2952.358,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.458,
    "end": 2954.199,
    "text": "So just a few notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.279,
    "end": 2975.577,
    "text": "So on the sensory substitution, David Eagleman is a professor and has given a lot of talks, a lot of cool work where there's like a vest with sensors and all these other kind of wearables that people do learn to integrate and have these inter sensory experiences, kind of like synesthesia, but it opens up a whole nother level with the biofeedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.037,
    "end": 2979.44,
    "text": "Like it's one thing to have a cultural tradition of observe your heart rate,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.39,
    "end": 2988.939,
    "text": " Will it be a different thing when you're going to be in an immersion studio and the color and the frequency is going to be related to your heart rate variability?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.42,
    "end": 2992.143,
    "text": "Things that might be just beyond subtle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2992.936,
    "end": 3003.564,
    "text": " or impossible for a limited lifetime of training to provide you access to some of the interoceptive cues, and then how will that influence our generative models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.924,
    "end": 3010.849,
    "text": "So that was one point about sensory substitution, biofeedback, and the way that active inference is a framework that's flexible enough to deal with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.35,
    "end": 3018.435,
    "text": "So it's not just restricted to the senses that we have or the things that we're inferring about today, because our generative model can change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.511,
    "end": 3038.844,
    "text": " then i wanted to read um a quote from the recent paper that we're discussing in active stream number 34 so this is from axel constant's paper the free energy principle it's not about what it takes it's about what took you there and this is going to speak to potentially about how there is this almost",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.242,
    "end": 3057.227,
    "text": " I wouldn't know whether it's truly postmodern, but since everyone is right, like you talked about how everyone's behavioral approach is right and different cultures are also incomparable relative to each other, yet also you have preferences, if nothing else, as realized by your regime of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.087,
    "end": 3059.929,
    "text": " And we need to be making good decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.989,
    "end": 3063.612,
    "text": "Like, it's not just a preference where we step if we want to continue living.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.792,
    "end": 3074.622,
    "text": "So how do we square that circle with kind of the need for rigor and exactness and translation into computational systems, yet also this kind of radical intersubjectivity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.002,
    "end": 3077.004,
    "text": "So here's what Axel Constant wrote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.527,
    "end": 3090.344,
    "text": " The rational constraint over the priors is the fact that the approximate subjective posterior Q, or future prior, will not only be Bayesian, but also will always be the best guess relative to what the true posterior ought to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.098,
    "end": 3092.739,
    "text": " In short, under the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3093.339,
    "end": 3104.345,
    "text": "Even though priors refer to psychological states of the system, updates of the system make those priors in approximation of what they should have been had the prior been updated with exact base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.025,
    "end": 3111.429,
    "text": "Thus, it might be said that priors under the free energy principle cut across the objective-subjective dichotomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.049,
    "end": 3117.672,
    "text": "They are subjective while satisfying a rational constraint mandated by the existence of the system per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.741,
    "end": 3124.924,
    "text": " So that's a way to radically condition on the existence of an active entity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.684,
    "end": 3132.747,
    "text": "And then what are the implications as far as perception action conditioned on that existence of an entity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3133.328,
    "end": 3138.61,
    "text": "So that's something that's related to active and maybe it relates to what you're thinking about too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.23,
    "end": 3140.031,
    "text": "It certainly does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3140.851,
    "end": 3148.155,
    "text": "It's what I mentioned before that I like to describe in terms of the transcendental knowledge and the transcendental experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3149.716,
    "end": 3155.039,
    "text": " the transcendental knowledge is the knowledge of how things are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3157.14,
    "end": 3161.642,
    "text": "The reason why we can have such knowledge is that simply",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3163.942,
    "end": 3166.463,
    "text": " you know, the universe follows definite laws.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3166.603,
    "end": 3168.063,
    "text": "That's a kind of a given.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3168.703,
    "end": 3175.945,
    "text": "If it didn't, then we wouldn't be able, then it wouldn't really be able to exist as a stable structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3176.625,
    "end": 3181.767,
    "text": "So having the transcendental knowledge, knowing how things are, is half of the equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3181.967,
    "end": 3191.509,
    "text": "Based on how things are, based on knowing how things are, what is the construct that's behind the veil of your perception?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3192.15,
    "end": 3193.35,
    "text": "You can say like, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3194.313,
    "end": 3203.176,
    "text": " this is what I perceive, and these are the choices that I have, and these are the kind of decisions that I make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.757,
    "end": 3214.48,
    "text": "But because I have this transcendental knowledge of what really are the hidden causes, the real, real hidden causes that are not observable to me, I can...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3217.596,
    "end": 3226.583,
    "text": " I can make this best guess as the quote goes, and I sort of know that this is in the right direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.804,
    "end": 3229.765,
    "text": "I simply know because there is one correct way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3230.586,
    "end": 3233.748,
    "text": "So this best guess is really, it's just a gradient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3236.267,
    "end": 3244.495,
    "text": " That's kind of what my ever-adjusting best guess of where that movement in that space should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3244.515,
    "end": 3248.159,
    "text": "That is the gradient in which I have to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.659,
    "end": 3254.805,
    "text": "And as long as I'm making small enough steps, I will be able to say that, well, are the observations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3256.458,
    "end": 3261.619,
    "text": " are my observations confirming that my guesses are getting better or not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3262.179,
    "end": 3265.18,
    "text": "And if they are, then I can just simply follow the direction, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.9,
    "end": 3275.762,
    "text": "So this active inference view is sort of, you have to also look at this from the sort of like a, almost like a perpendicular perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3276.382,
    "end": 3279.442,
    "text": "What is it like to be an active inference agent?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3280.202,
    "end": 3283.723,
    "text": "And, you know, from the moment, in the moment of perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.195,
    "end": 3289.417,
    "text": " And what these guesses really are is simply this Bayesian characterization of the guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3289.437,
    "end": 3292.999,
    "text": "What it really is is just a feeling, quite frankly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3293.679,
    "end": 3296.501,
    "text": "The agent has a feeling that this is the right way to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3298.182,
    "end": 3301.323,
    "text": "That's what it manifests itself to an agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3305.265,
    "end": 3311.908,
    "text": "So it is very much, yeah, it's a very related perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3314.673,
    "end": 3317.154,
    "text": " So let me ask a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.514,
    "end": 3323.176,
    "text": "You talked about this local gradient descent or somehow gradient inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.277,
    "end": 3333.08,
    "text": "How do we know that following the local gradient in terms of space and time, how do we know that that's the right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.783,
    "end": 3337.906,
    "text": " way to go long-term or even a right or a effective way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.326,
    "end": 3341.109,
    "text": "And there's definitely a few ways that we talk about this in act-inf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.429,
    "end": 3351.476,
    "text": "So I would love to hear what you think, like, how do we make sure that local gradient chasing doesn't get us into a cold Zack or a local maximum?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.938,
    "end": 3358.141,
    "text": "You know, I don't have a very clear answer to this, but I have a,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.672,
    "end": 3367.138,
    "text": " I have an idea where to go in terms of research for some solutions to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3368.62,
    "end": 3379.53,
    "text": "One way would be to try to come up with a system that mathematically has a sort of desirable property, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3380.037,
    "end": 3393.822,
    "text": " Another way to go is to simply construct a system that has a certain kind of randomness in sampling the environment, because that seems to be the key, what the fundamental algorithms of the brain are like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3393.842,
    "end": 3408.568,
    "text": "I don't know if you guys are familiar with Jeff Hawkins of Numenta and his thousand brains theory and his hierarchical temporal memory and work on sparse distributed representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.772,
    "end": 3417.835,
    "text": " they're working on computational models of neurons that are very biologically plausible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3417.975,
    "end": 3427.499,
    "text": "So they take the basis for their computational modeling to be a cortical column, and they have some interesting computational models of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3428.42,
    "end": 3434.843,
    "text": "And it seems to be the case that, you know, in terms of hardware implementation, what Nature seems to be doing to ensure this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.926,
    "end": 3448.249,
    "text": " sort of robustness and not being stuck is simply, you know, you take a signal and you project it onto some collection of cortical columns that are going to be modeling that signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3448.309,
    "end": 3450.909,
    "text": "So it could be a part of your occipital cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3451.49,
    "end": 3458.651,
    "text": "And then that signal is distributed among those columns in such a way that each gets a SAP sample of the signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3459.151,
    "end": 3461.492,
    "text": "So if this was like an image, then maybe, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3463.168,
    "end": 3469.811,
    "text": " you blank out 20, 30% of the pixels for each different set for each of the columns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3469.851,
    "end": 3471.452,
    "text": "So they have a different perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3472.852,
    "end": 3481.736,
    "text": "So you have this random projection and each column then has, you know, it's kind of like a random, you can think about it differently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3481.836,
    "end": 3489.899,
    "text": "It's a kind of a random basis against which we're doing essentially a principal component analysis later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3492.173,
    "end": 3497.897,
    "text": " So once you have enough of them and you get an average, that's how the system becomes robust.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3498.237,
    "end": 3507.543,
    "text": "And it's able to always detect the direction of the greatest benefit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3507.663,
    "end": 3513.908,
    "text": "And it's not just, you can't quite easily start locally because in some of your bases,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3515.24,
    "end": 3526.424,
    "text": " in some of these, by the virtue of just choosing the bases randomly, in some of these, you're going to pick out elements of the signal that are not local.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3527.204,
    "end": 3540.088,
    "text": "And these columns were simply, by the virtue of their disposition, their initial wiring, become the antennas for the frequencies in the signal that are simply non-local.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.996,
    "end": 3544.037,
    "text": " So that's what I'm thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3544.757,
    "end": 3553.499,
    "text": "We can simply build and stop worrying about being stuck in local optimums.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3554.279,
    "end": 3561.341,
    "text": "Although I don't have a mathematical theory behind to show that it will work, but I have a feeling it will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3561.381,
    "end": 3563.482,
    "text": "So it might be a research direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3565.831,
    "end": 3566.111,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.831,
    "end": 3571.072,
    "text": "I'd like to actually share a few more technical ways that we can address this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.212,
    "end": 3574.733,
    "text": "I think it's just interesting to contrast with the answer that you provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.753,
    "end": 3578.274,
    "text": "So I'm going to give four examples and I hope that there's more as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.914,
    "end": 3587.596,
    "text": "So the first way that we can escape this kind of local gradient chasing is evolution and ecology and embodied hardware and wetware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.976,
    "end": 3591.757,
    "text": "So like the ant leg doesn't have to do an all by all control theory question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.597,
    "end": 3598.101,
    "text": " It's an evolved entity, so we know the parameters have worked in probably similar ecologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.721,
    "end": 3607.047,
    "text": "And then the physical embodiment of the system restricts the solutions so that the things that it is trying to solve are the right things to solve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3607.307,
    "end": 3614.852,
    "text": "So that's kind of a big general first catch-all point, which is for physical embodied systems, it just kind of works because it has to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.992,
    "end": 3616.413,
    "text": "Otherwise, it wouldn't be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.773,
    "end": 3619.615,
    "text": "Like you're not going to see birds who have a maladaptive flight model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.632,
    "end": 3629.679,
    "text": " And so the cases that we're going to talk about now are like kind of computational edge cases when we want to do something that isn't within the scope of a soft-bodied organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.2,
    "end": 3631.901,
    "text": "So this is like big data fitting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.361,
    "end": 3637.485,
    "text": "So the second approach, which is the first to the big data, is variational Bayesian methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.286,
    "end": 3639.826,
    "text": " and other statistical methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.327,
    "end": 3655.611,
    "text": "So variational Bayesian methods, you can learn about it in other streams, but basically they fit the parameters on a really constrained family of distributions so that the optimization of that family is basically straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.371,
    "end": 3658.072,
    "text": "It's kind of like making a map of a map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.172,
    "end": 3659.032,
    "text": "We talk about it in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.679,
    "end": 3662.96,
    "text": " actin stream number 32, and a few other places like 26.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.961,
    "end": 3667.762,
    "text": "But you can set up the problem so that the optimization is straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.982,
    "end": 3676.266,
    "text": "Just like a linear regression with least squares L2 norm, it's possible to set up more complicated variational Bayesian models that have similar optimization properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.466,
    "end": 3680.587,
    "text": "The next is the third, which is the Helmholtz decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.228,
    "end": 3689.371,
    "text": "And so the Helmholtz decomposition takes a vector field and it decomposes into a irrotational, so kind of like straight up and down",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.807,
    "end": 3693.912,
    "text": " That's like putting a ruler on the mountain, just finding it where it's the most pointed up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.974,
    "end": 3699.9,
    "text": "So there's the irritational component, and then there's the solenoidal, or like the just curling around component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.98,
    "end": 3702.283,
    "text": "And that's kind of the isocontour, like a hiking map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3703.035,
    "end": 3727.495,
    "text": " and so you can put the gas on going downhill or uphill depending which way you want to go and then also rotate on an iso contour to sometimes help escape local maxima because it's kind of like hiking like that's how you escape a local maxima hiking by combining going straight up the hill or down the hill with also navigating with the curls",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.716,
    "end": 3733.238,
    "text": " And then the last category, which is really broad, is computational heuristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.738,
    "end": 3745.362,
    "text": "So that includes structure learning, as well as tree rollouts and stochastic search, and just all the ways that it's possible to, even if you don't have a guarantee that you found the best solution,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.082,
    "end": 3759.982,
    "text": " you may be able to find one that keeps your job or that feeds everyone on earth or does something else so it might be possible to use all the kinds of computational heuristics that people use every day that don't even have to be act-inf related",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.851,
    "end": 3762.292,
    "text": " We can make computers work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.813,
    "end": 3769.138,
    "text": "And so we don't need to solve this to like the most extreme devilish case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3769.999,
    "end": 3772.781,
    "text": "Sometimes it's just enough to do it on real data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3773.302,
    "end": 3779.307,
    "text": "And so hopefully that's a useful way to think about ways to escape local Maxima.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.327,
    "end": 3782.57,
    "text": "Does that relate to anything that you see as relevant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.898,
    "end": 3795.106,
    "text": " I mean, yes, this is all about, you know, these things are basically all about the fact that ultimately you can't hide the signal anywhere, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3795.266,
    "end": 3798.288,
    "text": "The universe has this holographic nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3799.349,
    "end": 3802.391,
    "text": "It's an image of itself within itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3804.612,
    "end": 3811.857,
    "text": "It's probably one of the nicest visual analogies that I've heard so far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3812.523,
    "end": 3817.706,
    "text": " This express test was this Zen concept of Jijimuga, the total interconnectedness of all things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3818.267,
    "end": 3823.07,
    "text": "You can sort of imagine like a multidimensional spider web with drops of dew suspended in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3823.59,
    "end": 3831.155,
    "text": "And each of the drops of dew contains a reflection of all the other drops of dew and all the drops of dew within the reflections of reflections and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3831.996,
    "end": 3834.657,
    "text": "So, you know, that's kind of what the universe is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3834.737,
    "end": 3838.58,
    "text": "And that's why you always have the global signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3839.318,
    "end": 3839.998,
    "text": " It's always there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3841.779,
    "end": 3847.201,
    "text": "You will always be able to know what is the path of least resistance towards nirvana.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3848.181,
    "end": 3849.442,
    "text": "That is by design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3850.042,
    "end": 3856.624,
    "text": "But to know, to be able to feel it, you have to have the transcendental knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3857.245,
    "end": 3860.786,
    "text": "So in this case, like what you said, the structure models, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3861.266,
    "end": 3866.328,
    "text": "Like coming up with the understanding the structure of the space that you're operating in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3866.843,
    "end": 3877.646,
    "text": " allows you to keep a global context despite your local circumstances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3877.746,
    "end": 3886.549,
    "text": "So the ideal active inference agent is simply something that just automatically builds a map of its environment as it goes along.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3887.469,
    "end": 3895.492,
    "text": "And if it's paying enough attention to all the inputs that it's getting from its environment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3895.967,
    "end": 3907.992,
    "text": " then the full nature of the environment, it's always possible to reconstruct it with a sufficiently complex internal model of the world so that you actually understand what you experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3908.912,
    "end": 3911.473,
    "text": "I mean, there might be some sort of critical limit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3913.534,
    "end": 3921.197,
    "text": "The critical minimum from sort of perspective of the Buddhist canon, I suppose, is being a human.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3922.119,
    "end": 3941.865,
    "text": " we are sort of best positioned in the Buddhist canon to become enlightened, better than the gods and, you know, better than demons and so on and so forth because our life has just about enough suffering in it that it pushes us in a certain direction, but it's not easy enough that we never really contemplate, you know, our suffering, that kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3942.385,
    "end": 3951.948,
    "text": "So there is like a computational minimum, but once that minimum is passed, right, a conscious agent will simply be able to interpret the signal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.605,
    "end": 3960.308,
    "text": " And I think we should be able to build an algorithm that's gonna be completely universal across, you know, all implementation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3960.708,
    "end": 3963.249,
    "text": "And that's gonna be something that's mostly based on hashing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3963.75,
    "end": 3971.333,
    "text": "So very von Neumann architecture, maybe like a combinatorial logic compiled expression to a graph machine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3971.693,
    "end": 3981.577,
    "text": "And then you can essentially compute, you know, a gigantic non-regressive active inference neural network that just never really forgets anything",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3982.617,
    "end": 3992.124,
    "text": " And it automatically redistributes all its knowledge about the world across itself without any effort whatsoever to program that in any special way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3993.065,
    "end": 3995.847,
    "text": "That's the, in my opinion, the holy grail of active inference research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3995.887,
    "end": 4000.25,
    "text": "We will be able to come up with this algorithm eventually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4002.752,
    "end": 4005.274,
    "text": "Well, if you expect and prefer it, then let's do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.034,
    "end": 4009.937,
    "text": "So I wanted to read a little short quote",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4010.267,
    "end": 4019.53,
    "text": " This is from an English translation of a story by Zhuangzi, apologies on the pronunciation, who is an early Taoist writer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.07,
    "end": 4026.653,
    "text": "And so this is a butcher, a meat cleaver person, describing their skill set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.853,
    "end": 4029.474,
    "text": "So here's the translation in English.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.974,
    "end": 4033.615,
    "text": "What I care about is the way which goes beyond skill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.278,
    "end": 4037.981,
    "text": " When I first began cutting up oxen, all I could see was the ox itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4038.801,
    "end": 4042.064,
    "text": "After three years, I no longer saw the whole ox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4042.684,
    "end": 4045.827,
    "text": "And now, now I go by spirit and don't look with my eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.367,
    "end": 4050.05,
    "text": "Perception and understanding have come to a stop, and the spirit moves where it wants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.71,
    "end": 4056.715,
    "text": "I go with the natural makeup, strike in the big hollows, guide the knife through the big openings, and follow things as they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.275,
    "end": 4060.958,
    "text": "So I never touch the small ligaments or tendons, much less a main joint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.031,
    "end": 4065.193,
    "text": " A good cook changes his knife once a year, because he cuts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.053,
    "end": 4069.575,
    "text": "A mediocre cook changes his knife once a month, because he hacks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4070.436,
    "end": 4078.02,
    "text": "I've had this knife for 19 years, and I've cut up thousands of oxen with it, and yet the blade is as good as though it had just come from the grindstone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.746,
    "end": 4082.509,
    "text": " There are spaces between the joints, and the blade of the knife really has no thickness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.049,
    "end": 4086.631,
    "text": "If you insert what has no thickness into such spaces, then there's plenty of room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.192,
    "end": 4088.693,
    "text": "More than enough for the blade to play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.193,
    "end": 4094.196,
    "text": "That's why after 19 years, the blade of my knife is still as good as when it first came from the grindstone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.199,
    "end": 4098.659,
    "text": "Wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.561,
    "end": 4100.801,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.281,
    "end": 4102.482,
    "text": "Pretty cool story about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.084,
    "end": 4131.18,
    "text": " in active inference what we might call skilled performance it's also an example of like encultured and extended cognition and about how the generative model changed as the master increased in competency their internal generative model changed they saw something different they didn't see the same oxen that they saw when they were younger and then that changed how they physically acted and then they used their own proprioceptive feedback to guide that flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.424,
    "end": 4144.186,
    "text": " And then there's almost a cultural layer around it if the story is read fully with, like, somebody who has a higher station in life also kind of paying that respect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.146,
    "end": 4147.387,
    "text": "So it's a very cool story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.667,
    "end": 4147.887,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4148.567,
    "end": 4149.327,
    "text": "Yes, definitely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4150.387,
    "end": 4159.809,
    "text": "You know, the sort of consequence of this is also that, you know, think about your body as the knife.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4163.63,
    "end": 4171.993,
    "text": " If you really have a proper model and minimize free energy correctly, you should not be growing older or dying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4174.694,
    "end": 4176.655,
    "text": "It's a result of the loss of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.416,
    "end": 4184.458,
    "text": "And it's possible to grow younger and you can stay young indefinitely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4185.41,
    "end": 4198.02,
    "text": " It's just a matter of having a sufficiently open state of mind to minimize all the free energy, which is essentially damage that accumulates as a result of just wear and tear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4198.62,
    "end": 4209.448,
    "text": "And if it's something that you don't attempt to consciously in order to heal your body, then over many years of life, damage accumulates, accumulates, and you eventually die.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4209.969,
    "end": 4211.57,
    "text": "And it's completely unnecessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4212.23,
    "end": 4214.132,
    "text": "It literally is just a bad habit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4217.461,
    "end": 4243.961,
    "text": " provide just a counterpoint and uh note that it's an open theological question so this is a quotation from the same actual constant 2021 paper so from the point of view of the free energy principle when considering morphic organisms like insects that go undergo metamorphosis like an ant it may be said that it is the life cycle that corresponds to the thing whose integrity is maintained over evolutionary time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.117,
    "end": 4249.059,
    "text": " not the specific form that the system takes at one stage of its development, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.119,
    "end": 4250.519,
    "text": "the adult form of a frog.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.1,
    "end": 4255.781,
    "text": "This casts the FEP within the realm of process ontology versus substance ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4256.422,
    "end": 4271.168,
    "text": "So one take is like the perfect active agent is going to do phagocytosis and cellular regeneration, and it will be like in this sort of non-equilibrium steady state where it won't change, and it'll look just like it did at the time when it started doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.25,
    "end": 4283.17,
    "text": " And another take is actually like the life cycle of the ant or the life cycle of the colony will be recapitulated with fidelity and also variation, potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.19,
    "end": 4283.25,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.077,
    "end": 4306.197,
    "text": " within the cycle there may be even a constant flux and a constant aging like every ant is trudging towards dissolution but the colony can recapitulate itself so i think it's a question at which level or which levels we will see that kind of regeneration happening or not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.25,
    "end": 4330.669,
    "text": " I mean, you know, ultimately, this is a, this is one another way to sort of approach the subject of non dual awareness, and the mind body duality is that these both, both of these extremes, there really are two views on the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4331.59,
    "end": 4331.75,
    "text": "You",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4332.458,
    "end": 4337.12,
    "text": " can sort of dissolve yourself as an individual and become just the process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4337.14,
    "end": 4343.023,
    "text": "And your consciousness simply is the consciousness of that process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4343.043,
    "end": 4348.026,
    "text": "Or you can become an individuated thing and have an individual experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4348.726,
    "end": 4351.727,
    "text": "The enlightened mind can exist at all these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4353.8,
    "end": 4356.965,
    "text": " levels of organization simultaneously.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4357.586,
    "end": 4363.917,
    "text": "So any manifestation that you want to have in the world is just a manifestation of the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4364.558,
    "end": 4368.304,
    "text": "It's kind of like ghost in the shell, downloading yourself into a different body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4368.894,
    "end": 4371.555,
    "text": " except you can be multiple bodies at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4371.635,
    "end": 4376.315,
    "text": "As your consciousness grows, you can just use more actuators.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4376.375,
    "end": 4378.356,
    "text": "That's all there is to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4378.936,
    "end": 4387.938,
    "text": "And then you can become a thing that has a group identity of some sort.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4388.538,
    "end": 4391.518,
    "text": "So I think it's a spectrum, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4391.578,
    "end": 4395.499,
    "text": "And it's simply a choice for you as an individual that if you want,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4396.335,
    "end": 4401.899,
    "text": " And if you would like your body to persist indefinitely, you should be able to get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4403.02,
    "end": 4407.803,
    "text": "There is nothing that prevents an active inference agent to achieve something like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4408.544,
    "end": 4421.793,
    "text": "And, you know, I'm speaking of my own personal experiences that a few years ago, I started realizing that my health wasn't exactly in great shape and started doing something about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4421.813,
    "end": 4421.873,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4422.637,
    "end": 4431.603,
    "text": " you know, done some biological tests for my biological age versus chronological age, and the results are coming, you know, are quite interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4431.663,
    "end": 4450.597,
    "text": "Like the, what is the, Insight Tracker, a very interesting blood and DNA-based test that measured all kinds of biomarkers, estimated my chronological age at 30 versus, so biological age at 30 versus chronological at 35,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4451.758,
    "end": 4456.206,
    "text": " And another test based on methylation patterns of the DNA estimated my age at 33 versus 35.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4458.078,
    "end": 4470.687,
    "text": " And, you know, I'm pretty sure that in a couple of years, I'm going to push it down to 20, repairing damage at the cellular level with compounds like NADs and other sirtuins.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4472.048,
    "end": 4476.151,
    "text": "You know, there's a lot of really interesting longevity stuff coming up these days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4476.651,
    "end": 4484.777,
    "text": "Anybody who's under 40 years old has a very reasonable expectation of about 140 years of life with the technology that we have today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4485.541,
    "end": 4488.802,
    "text": " and technology is improving exponentially, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4488.962,
    "end": 4491.564,
    "text": "mRNA gives us essentially a software update mechanism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4491.784,
    "end": 4493.904,
    "text": "We can make our cells produce anything we want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4495.285,
    "end": 4509.411,
    "text": "So the matter of repairing your body at the genetic level with some sort of mRNA vaccine in a personalized medicine session, it's gonna be something like, you know, a reality within a decade.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4510.291,
    "end": 4514.473,
    "text": "So yeah, like the, but ultimately,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4515.812,
    "end": 4517.814,
    "text": " All that stuff is not even really necessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4518.414,
    "end": 4529.325,
    "text": "If you can tune into the signal that you get from your body and learn to just feel when your body is resting and healing, it will persist indefinitely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4529.485,
    "end": 4531.427,
    "text": "I'm quite sure I'll get there eventually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4536.352,
    "end": 4537.974,
    "text": "Very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.094,
    "end": 4539.175,
    "text": "Thanks for sharing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.29,
    "end": 4541.41,
    "text": " Welcome Blue and Ratul.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.55,
    "end": 4546.692,
    "text": "If you'd like to speak, you can request or anyone can write a question in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.053,
    "end": 4551.274,
    "text": "Yeah, this has been pretty fun and let's keep talking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.314,
    "end": 4555.335,
    "text": "I think there's a few more topics we could explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.627,
    "end": 4577.614,
    "text": " so i'm looking back through the chat so one comment and again blur tool or anyone else please feel free to add us ask a question so you talked about kind of being a black hole or like a black box to another informational process and i think that insight is also something that's been",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.128,
    "end": 4582.629,
    "text": " stated in different ways by different knowledge systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.729,
    "end": 4585.971,
    "text": "So Daniel Dennett would call that kind of like the intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.731,
    "end": 4590.352,
    "text": "And that's the origins of the whole philosophical zombie thought question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.552,
    "end": 4592.293,
    "text": "It's the basis of the Turing test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.273,
    "end": 4598.555,
    "text": "John Cyril's basically like Chinese room, I think is what it was originally called.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.136,
    "end": 4603.197,
    "text": "The idea of passing messages to somebody who's inside of a room using a lookup table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.177,
    "end": 4608.319,
    "text": "And it's also central to the framing of Act Dymph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.848,
    "end": 4625.254,
    "text": " where there can be a shared generative model in a communicating dyad, but because of the structure of the partition of the entity, the particular entity and its niche, which can be a social niche, you don't get to peer behind the veil.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.074,
    "end": 4633.917,
    "text": "It's just external states, generative processes passing sensory stimuli to the particular entity's generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.477,
    "end": 4637.898,
    "text": "And it's like, if it were anything other than that, then it would be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.621,
    "end": 4645.642,
    "text": " If it were something that you were getting direct insight to, then that would be inside of your particular entity, and it wouldn't be an external state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.662,
    "end": 4646.803,
    "text": "It'd be like an internal state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.463,
    "end": 4662.026,
    "text": "And so it's just kind of a cool way that the Act-Inf topology of action allows us to look at a lot of these more qualitative examples and thoughts around like, whoa, what if we are like black boxes to each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4662.046,
    "end": 4665.827,
    "text": "Or maybe even there's something else happening with information, like a black hole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.947,
    "end": 4667.707,
    "text": "Maybe you could give more info on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.337,
    "end": 4694.675,
    "text": " then also we can build this to model the kinds of systems that we want to know about the actual information boundaries of like online teams yeah so that's the the the the the most difficult problem uh in in the universe right is to is to create this translation between two minds is that we are um this this computer this computational black holes to each other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4695.549,
    "end": 4701.074,
    "text": " But at the same time, we can generate some sort of negative entropy for others, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4705.677,
    "end": 4715.225,
    "text": "So that's essentially everything that neural networks do is communication through some sort of language, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4715.725,
    "end": 4725.313,
    "text": "So what the world is to us is some sort of story that we have to tell ourselves that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4726.334,
    "end": 4728.195,
    "text": " describes the nature of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4728.255,
    "end": 4734.517,
    "text": "So we invent categories and assign, assign meanings to concepts and images, and so on, so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4734.557,
    "end": 4739.519,
    "text": "And we tell ourselves, like, this is what this is what the structure of our environment is, and so on, so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4740.079,
    "end": 4755.085,
    "text": "And then eventually, we come up with descriptions of reality that we can both agree upon, you know, we develop language to talk about things that, you know, are, quote, unquote, objectively true, as in,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4756.173,
    "end": 4759.656,
    "text": " can be perceived by more than one person, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4760.216,
    "end": 4763.6,
    "text": "And that's how we start piercing this veil.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4764.1,
    "end": 4773.289,
    "text": "And understanding that process, like how this veil is constructed, what is the purpose of language, how language really arises as a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4776.109,
    "end": 4797.008,
    "text": " tool of communication for explaining the nature of the world and, um, learning to listen to, um, someone's subjective experience and taking it as, as, as literal, just simply assuming that, you know, whatever, whatever someone is saying, what their experience is just, you know, assume what they're saying it is what they're experiencing and,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4797.458,
    "end": 4800.701,
    "text": " and ask yourself like, you know, how can this possibly be true?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4801.282,
    "end": 4809.409,
    "text": "That is the way of actually piercing that veil, that figuring out the internal model, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4809.429,
    "end": 4810.17,
    "text": "The hidden causes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4810.61,
    "end": 4819.999,
    "text": "Because if you can't see, you can't see the hidden causes behind the sensory input that you're receiving, but you can speculate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4820.618,
    "end": 4822.059,
    "text": " You know, what might they be?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4822.56,
    "end": 4832.127,
    "text": "And that act of speculation, the updating of your internal model based on that, coming up with these new ideas, then again, you again have this loop into generative thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4832.608,
    "end": 4842.276,
    "text": "So you speculate about the hidden causes and say like, well, you know, okay, this is the experience I have described by this entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4842.296,
    "end": 4844.057,
    "text": "It tells me that this is what it's experiencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4844.478,
    "end": 4847.42,
    "text": "This is what I assume might be causing all of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4847.95,
    "end": 4863.173,
    "text": " And, you know, once you run through enough iterations of this cycle, you can actually arrive at perfect understanding that you and this other entity have the same understanding of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4863.914,
    "end": 4873.596,
    "text": "And that is essentially, you know, if there are fans of, you know, Ghost in the Shell online, this is the deal that Project 2501 offers to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4875.762,
    "end": 4879.225,
    "text": " Motoko Kusanagi, to become one entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4879.685,
    "end": 4899.42,
    "text": "Because this moment of full grokking that you are basically two ends of the same entity, that is the solution of the self, the solution of the marker blanket, and essentially, you know, an integration into a being of a higher consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.121,
    "end": 4902.743,
    "text": "So that is essentially the name of the game, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4902.803,
    "end": 4902.923,
    "text": "To",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4903.888,
    "end": 4924.993,
    "text": " to do this, to come up with a description language using words that are familiar to a person based on their culture and their understanding of the world and the priors that they received from the culture, how to interpret the signs that they perceive and so on and so forth, to understand this as kind of a cipher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4925.893,
    "end": 4927.814,
    "text": "All of that is a kind of a cipher into the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4928.414,
    "end": 4932.295,
    "text": "And once you have a perfect understanding of that, you can come up with words that simply will",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4933.118,
    "end": 4936.739,
    "text": " guide someone towards the transcendental experience that's necessary towards enlightenment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4937.779,
    "end": 4942.861,
    "text": "So, that's how these two things relate here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4947.942,
    "end": 4948.323,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.063,
    "end": 4951.864,
    "text": "Speaker Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.845,
    "end": 4958.346,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4958.366,
    "end": 4959.286,
    "text": "Am I good?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4960.226,
    "end": 4960.466,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4960.906,
    "end": 4961.086,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.267,
    "end": 4962.387,
    "text": "So,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4964.332,
    "end": 4980.996,
    "text": " How do you know that we're not already part of some larger picture, like where we're all, like, rocking and fulfilling our essential roles in the part of something larger than ourselves?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4983.996,
    "end": 4984.576,
    "text": "I mean, we are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4984.816,
    "end": 4986.997,
    "text": "That's exactly what's going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4988.617,
    "end": 4991.678,
    "text": "It's a matter of, you know...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4993.561,
    "end": 4998.545,
    "text": " A great description of how to approach this topic is The Alchemist by Paolo Coelho.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4999.365,
    "end": 5009.792,
    "text": "He literally lays out a way of being that allows you to take advantage of the fact that the world is constructed this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5010.312,
    "end": 5017.337,
    "text": "There are portals to adventures, to strange realms, to time travel, to all kinds of crazy things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5017.797,
    "end": 5020.639,
    "text": "And you just simply have to know how to find them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5021.055,
    "end": 5028.859,
    "text": " And it's a matter of adjusting your perception and noticing that the reality around you is not what it seems to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5029.379,
    "end": 5031.12,
    "text": "It's very, very psychedelic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5031.96,
    "end": 5040.104,
    "text": "And for instance, my life experience, because I spent a lot of time in Japan, I've been living there for 10 years now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5043.481,
    "end": 5044.322,
    "text": " that is my home.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5044.782,
    "end": 5046.843,
    "text": "My life is very much like a Murakami story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5048.223,
    "end": 5061.209,
    "text": "Very strange, very psychedelic, weird occurrences, you know, people and topics of conversation and kind of things that show up and characters that are just really improbable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5062.31,
    "end": 5064.53,
    "text": "It's right there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5065.291,
    "end": 5069.393,
    "text": "But we are so busy with, you know, the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5070.771,
    "end": 5079.016,
    "text": " what becomes our day-to-day experience that we are essentially hypnotized into a suboptimal way of living.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5079.376,
    "end": 5083.838,
    "text": "Instead of enjoying the creations of the mind, we are being bogged down by them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5083.858,
    "end": 5088.181,
    "text": "You know, some dude comes along and says like, Hey, you have to pay the income tax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5088.881,
    "end": 5089.582,
    "text": "You work for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5090.602,
    "end": 5092.243,
    "text": "And that's how, and that's how it gets you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5092.263,
    "end": 5093.404,
    "text": "It ties you to the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5094.917,
    "end": 5096.358,
    "text": " to a wrong dream, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5096.778,
    "end": 5101.642,
    "text": "And the Buddhist term for that is the samsara, the shared dream that we're into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5102.302,
    "end": 5115.932,
    "text": "But the thing about the dream and liberating yourself of the dream is that liberating yourself from the dream, the experience of nirvana, is to experience the consciousness of the universe as the universe, you know, as a full thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5116.573,
    "end": 5122.378,
    "text": " how it is you that is generating this reality for yourself and everybody within it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5122.899,
    "end": 5137.051,
    "text": "And that experience automatically transforms your way of seeing the world because it's a complete expression of joy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5140.385,
    "end": 5145.587,
    "text": " Garland Sutra talks about this, what it's like to be an enlightened being who experiences the world like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5146.767,
    "end": 5156.711,
    "text": "Everything that's happening in the world to us may seem like a challenge or a source of suffering and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5156.751,
    "end": 5162.973,
    "text": "But in a way, it's an opportunity for us to get on the right path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5163.453,
    "end": 5169.775,
    "text": "The world is always giving you the opportunity to get on the right path and keep walking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5170.641,
    "end": 5173.303,
    "text": " And, you know, sometimes that has to be through suffering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5173.663,
    "end": 5178.625,
    "text": "If you stray too far, that's how you get into the right direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5179.146,
    "end": 5188.911,
    "text": "And learning how to just recognize the omens and, you know, taking part in that venture that is already there for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5189.992,
    "end": 5196.335,
    "text": "Kind of your future self laid it out for yourself, you know, for yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5197.436,
    "end": 5199.957,
    "text": "You as a fully enlightened being that you already are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5200.735,
    "end": 5203.377,
    "text": " Your consciousness just simply needs to catch up to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5203.998,
    "end": 5206.9,
    "text": "So yes, it's exactly how things are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5207.04,
    "end": 5216.989,
    "text": "And Buddhist techniques are simply tools for the mind to learn how to put that in action in day-to-day experience and just make it a reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5219.11,
    "end": 5220.692,
    "text": "Thank you for that awesome answer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5220.712,
    "end": 5229.419,
    "text": "So when you talk about everything that you have done to this point leads to the next point,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5230.054,
    "end": 5239.056,
    "text": " and you need to just follow through, do you really believe that there's something equivalent to free will?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5239.076,
    "end": 5247.358,
    "text": "Or are we just the product of our last time step?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5247.398,
    "end": 5255.12,
    "text": "The way I joke about it is that you have free will insofar as you are free to suffer if you want to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5258.778,
    "end": 5262.74,
    "text": " The path of dharma is that there is only one way to live.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5263.34,
    "end": 5273.406,
    "text": "But within that one way, there is an infinite potentiality for expressing yourself creatively in any way you want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5274.046,
    "end": 5278.449,
    "text": "So as long as you stick to the rules of the universal path, you get...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5279.739,
    "end": 5283.642,
    "text": " an infinite opportunity for self-expression out of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5284.283,
    "end": 5289.447,
    "text": "So, free will is just, it's a wrong way to think about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5290.968,
    "end": 5293.73,
    "text": "It's a concept that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5297.071,
    "end": 5299.291,
    "text": " you know, it's okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5300.292,
    "end": 5309.193,
    "text": "I have a great analogy, uh, citizen of the galaxy, uh, by Robert, uh, Heinlein, a fantastic sci-fi story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5309.233,
    "end": 5323.636,
    "text": "There's a, uh, there's a boy there who, um, you know, uh, he's being sold as a, as a slave and, um, bought by this, the, the, this cripple who eventually, um, frees him from, from his slavery.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5323.876,
    "end": 5324.116,
    "text": "And, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5324.915,
    "end": 5328.499,
    "text": " smuggles him out of the planet as a free trader.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5329.099,
    "end": 5333.384,
    "text": "And the free traders are, you know, priding themselves to be the freest people in the galaxy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5333.444,
    "end": 5335.146,
    "text": "They can go wherever they want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5335.186,
    "end": 5336.707,
    "text": "They can trade with whoever they want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5337.448,
    "end": 5345.356,
    "text": "They live on their ships in a very sort of matriarchal, very tight family kind of arrangements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5346.017,
    "end": 5348.259,
    "text": "And, you know, they're free to roam the galaxy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5348.823,
    "end": 5369.588,
    "text": " except there's basically zero individual freedom on the ship because your position in that complex society is dictated not only by very precise family relationship that you have with every single member of the crew, because it's all family, but also your function as a person on the ship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5369.608,
    "end": 5372.949,
    "text": "So that's like a second layer of your job.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5373.389,
    "end": 5376.97,
    "text": "And the third is just the general social standing and seniority.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5377.532,
    "end": 5380.873,
    "text": " So they're the most constrained people as individuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5381.293,
    "end": 5385.454,
    "text": "And yet they just, you know, they don't choose what they eat because it's being cooked for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5385.574,
    "end": 5389.976,
    "text": "It just happens to be extremely lavish and tasty and comes from all kinds of worlds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5390.056,
    "end": 5392.796,
    "text": "They don't choose where to go because the captain chooses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5392.836,
    "end": 5399.258,
    "text": "It just happens to be the most interesting places in the universe and so on and so forth, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5399.418,
    "end": 5404.6,
    "text": "So none of them has any individual freedom, but they're extremely free as people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5405.897,
    "end": 5417.342,
    "text": " And I think this is the best description of what a real realization of free will should look like in a society.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5418.522,
    "end": 5419.703,
    "text": "I really recommend that book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5423.625,
    "end": 5431.388,
    "text": "So I'm going to share a quote from The Alchemist and then a few lines of William Blake because they're relevant for our academic journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5431.728,
    "end": 5433.889,
    "text": "So here is two lines from The Alchemist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5435.452,
    "end": 5437.533,
    "text": " There is only one way to learn, the alchemist answered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5437.774,
    "end": 5438.574,
    "text": "It's through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.115,
    "end": 5441.576,
    "text": "Everything you need to know, you have learned through your journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5442.197,
    "end": 5444.098,
    "text": "You don't even have to understand the desert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.558,
    "end": 5450.102,
    "text": "All you have to do is contemplate a simple grain of sand, and you will see in it all the marvels of creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5451.083,
    "end": 5453.165,
    "text": "So that's from The Alchemist by Paulo Coelho.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5453.825,
    "end": 5458.368,
    "text": "And then here's the first four lines of the poem Auguries of Innocence by William Blake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5459.729,
    "end": 5463.452,
    "text": "To see a world in a grain of sand and heaven in a wildflower,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5464.107,
    "end": 5467.79,
    "text": " Hold infinity in the palm of your hand and eternity in an hour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5469.232,
    "end": 5485.466,
    "text": "So similar grain of sand contemplating and just a few relevant pieces of art that are also part of our conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5485.907,
    "end": 5488.129,
    "text": "So thanks for letting me share them because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5489.258,
    "end": 5499.306,
    "text": " There's a technical side to what we're discussing with Act-Imp and also with the computer stuff, but it's also very deeply experiential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5499.646,
    "end": 5514.157,
    "text": "So yes, that is my question to then send back to the group, which is how will we think about our on-body experience as we start to change our technology more and more?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5514.977,
    "end": 5526.54,
    "text": " Like, is that preferable to be in that setting that you just laid out, Christoph, where there's, like, at one level, you're very constrained, but then at a different level, you have a lot of degrees of freedom?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5527.26,
    "end": 5533.202,
    "text": "Like, again, how do we make the decisions now that are the right across all those possibilities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5538.39,
    "end": 5539.831,
    "text": " Well, I think it's a matter of preference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5540.411,
    "end": 5545.114,
    "text": "And, you know, I can't wait to change my body plan for an octopus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5546.635,
    "end": 5548.576,
    "text": "That is such a wonderful way to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5549.156,
    "end": 5553.699,
    "text": "Everything I know about cephalopods suggests that it's going to be a really interesting way to experience the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5553.759,
    "end": 5562.744,
    "text": "So imagine that that's just what you get, like whatever body plan you want, whatever experience of the world you want, you can get it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5564.601,
    "end": 5571.285,
    "text": " And there is no reason why, you know, this is something that you can experience in the mind alone, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5572.465,
    "end": 5584.551,
    "text": "The tradition of lucid dreaming, for instance, allows you to... This is also something that's, you know, perfected by Tibetan Buddhists, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5584.591,
    "end": 5587.392,
    "text": "They have very interesting yogas of dream and sleep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5588.015,
    "end": 5597.625,
    "text": " And the whole point of these things is to essentially be conscious and aware through all the possible states of the mind so that you can practice dharma 24-7.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5597.665,
    "end": 5602.73,
    "text": "So that's the kind of thing that allows you to experience this a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5603.331,
    "end": 5609.977,
    "text": "I don't really have dreams at all, strangely, but I don't have this ability to visualize in my mind this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5609.998,
    "end": 5611.359,
    "text": "That's something I'm working on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5611.874,
    "end": 5621.498,
    "text": " But people who do, they usually model some sort of experience in the world, but the next level of that is to just model your body experience as a different thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5622.479,
    "end": 5632.343,
    "text": "It's very difficult to imagine what it must feel like to be a different creature, but it's certainly possible and something that we can learn how to do eventually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5633.272,
    "end": 5640.595,
    "text": " Virtual reality also provides an interesting possibility of unplugging yourself from your usual body plan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5641.195,
    "end": 5650.458,
    "text": "There was an art installation a couple years ago, some sort of device that makes you essentially experience flying like a bird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5650.518,
    "end": 5652.399,
    "text": "You can flap your wings and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5652.479,
    "end": 5659.121,
    "text": "So you get strapped onto a device, put on a VR headset and so on, and a certain kind of dissolution of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5660.195,
    "end": 5662.798,
    "text": " what it means to be you can happen for this technology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5663.258,
    "end": 5667.323,
    "text": "And I think this is going to get more and more immersive and it's going to get really, really fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5667.543,
    "end": 5680.538,
    "text": "And you will be able to really suspend your belief in being, you know, one kind of being and just experience the world as something else entirely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5681.144,
    "end": 5698.885,
    "text": " Again, for something like Neuralink, if you can pack that kind of experience into that data pipe, then we might be able to see, you know, what I would predict out of the sort of brain-computer interfaces is that you're going to have two kinds of technologies showing up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5699.491,
    "end": 5702.352,
    "text": " One is going to be sort of like a consumer electronics type.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5702.372,
    "end": 5706.354,
    "text": "You get some sort of brain computer interface and it's useful and you can do some basic things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5706.994,
    "end": 5710.856,
    "text": "But there's going to be some people like me who are going to take it to the next level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5710.916,
    "end": 5712.617,
    "text": "Like, okay, now I have this data pipe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5712.777,
    "end": 5718.179,
    "text": "What is the limit of what I can pack across that kind of barrier?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5719.36,
    "end": 5721.221,
    "text": "So that kind of data path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5721.261,
    "end": 5723.062,
    "text": "And it turns out that it's a lot, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5723.082,
    "end": 5728.404,
    "text": "Neural compression will allow you to basically transmit entire concepts",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5729.211,
    "end": 5730.112,
    "text": " to the mind directly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5730.172,
    "end": 5747.879,
    "text": "So you should be able to basically have a stream of, you know, something that the brain can interpret as completely immersive virtual environments of your own design being beamed into your head for something like a neural link with whatever experience of anything that you want out of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5748.739,
    "end": 5752.18,
    "text": "It's gonna get wild.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5752.2,
    "end": 5756.962,
    "text": "So I have to say a couple of things here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5757.162,
    "end": 5758.583,
    "text": "Can I jump in, Daniel, is that okay?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5759.209,
    "end": 5759.67,
    "text": " Yes, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5759.69,
    "end": 5765.896,
    "text": "So I saw the Dalai Lama speak at the Neuroscience Conference in 2005, probably.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5769.637,
    "end": 5772.759,
    "text": " And it was a really jarring experience for me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5772.819,
    "end": 5774.959,
    "text": "Like, I've been Buddhist probably since 1999.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5775.16,
    "end": 5784.563,
    "text": "And seeing him speak there, like, really made me reevaluate my thoughts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5784.643,
    "end": 5792.206,
    "text": "But he said, like, if we could find a pill that could make us perpetually happy, we should all take it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5793.849,
    "end": 5802.517,
    "text": " And what you're describing here with the neural link and like the data download and pushing it to like the most extreme limit, like I would totally be there in that boat with you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5803.037,
    "end": 5804.919,
    "text": "Like, let me just see what's possible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5806.34,
    "end": 5812.246,
    "text": "But also to the comment that you made about like the yoga of sleeping.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5814.24,
    "end": 5822.804,
    "text": " It's like I one time did a 30 day, like 14 hours a day mantra recitation practice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5824.385,
    "end": 5826.265,
    "text": "And the entire, it was a retreat, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5826.325,
    "end": 5833.388,
    "text": "So like I didn't do TV, like I limited my phone calls, email, like all, I limited all non-Dharma activities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5833.608,
    "end": 5837.31,
    "text": "And essentially like I would, and I don't dream also.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5837.47,
    "end": 5841.652,
    "text": "Like, so I have to like throw in this comment because like I get like five dreams a year.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5842.272,
    "end": 5845.175,
    "text": " that I like wake up and like, Oh, I had a dream last night.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5845.215,
    "end": 5846.396,
    "text": "Like, it's like surprising.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5846.456,
    "end": 5847.577,
    "text": "It's always insightful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5848.098,
    "end": 5852.081,
    "text": "But, but I also like regularly, I'm not like, Oh, I had the most amazing dream last night.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5852.101,
    "end": 5853.463,
    "text": "Like that doesn't happen to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5853.503,
    "end": 5857.947,
    "text": "Like I don't get like, and like people say, wake up and just journal them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5857.987,
    "end": 5859.148,
    "text": "Like I've tried all the things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5860.069,
    "end": 5860.169,
    "text": "Um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5861.223,
    "end": 5870.326,
    "text": " But when I did the retreat, I would wake up in the middle of the night to like use the restroom and I'd be like reciting the mantra all the time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5870.366,
    "end": 5874.088,
    "text": "Like I would wake up reciting the mantra, go to sleep reciting the mantra.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5874.148,
    "end": 5877.689,
    "text": "I would be on the bathroom, like on the toilet in the middle of the night reciting the mantra.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5877.709,
    "end": 5879.59,
    "text": "I'd be making breakfast reciting the mantra.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5880.17,
    "end": 5881.311,
    "text": "It never stopped.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5881.711,
    "end": 5889.914,
    "text": "There was this like grand purification of my mind that took place like during that time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5890.649,
    "end": 5893.51,
    "text": " So I just wanted to share that for what it's worth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5897.092,
    "end": 5898.052,
    "text": "That's an awesome experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5898.072,
    "end": 5908.117,
    "text": "Yeah, these mantras are super powerful, you know, like the Tibetans, they recite these things all the time, like, and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5908.137,
    "end": 5916.341,
    "text": "It's like, I find it really powerful to get into the state of mind, because ultimately, you know, ultimately, you are a recurrent neural network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5917.119,
    "end": 5919.26,
    "text": " That is what's going on here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5919.38,
    "end": 5920.901,
    "text": "We are recurrent neural networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5921.021,
    "end": 5922.582,
    "text": "That's how we generate our experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5923.342,
    "end": 5928.325,
    "text": "And the more control we get over this recurrence, the better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5928.765,
    "end": 5933.227,
    "text": "And mantra is something that's supposed to reinforce the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5933.247,
    "end": 5936.449,
    "text": "It's kind of a way of providing a clock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5936.629,
    "end": 5942.792,
    "text": "It's just the same kind of thing that we do with... What is it called?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5944.992,
    "end": 5971.046,
    "text": " blending the input with signs and cosines, for transformer in transformer architectures, positional encoding, yes, sorry, positional encoding, and mantra is a kind of way of obtaining a positional encoding, just having something repeating in the mind so that, you know, you can, you can, you can attach your consciousness to experience better to the experience in the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5971.636,
    "end": 5982.7,
    "text": " This is one of the goals of these contemplative practices of meditation is to simply become conscious of the Markov blanket and stay with that consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5982.76,
    "end": 5988.803,
    "text": "And we think we are conscious of the moment, but that's just simply not true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5989.043,
    "end": 5994.985,
    "text": "We are always a little bit behind reality, at least five milliseconds or so from a perceptual perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5997.945,
    "end": 6015.578,
    "text": " And being in that moment is the name of the game, like practicing that feeling, what it feels to actually minimize the free energy instead of just spinning in the image of the world that we have in our head, that we perceive as reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6021.202,
    "end": 6022.523,
    "text": "I practice this kind of thing a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6024.544,
    "end": 6026.226,
    "text": "So there's definitely...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6027.418,
    "end": 6041.605,
    "text": " active work about temporal thickness, like how the recent past and the recent future are mapped or how they're influencing the action selection in the moment of an active agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6042.246,
    "end": 6048.889,
    "text": "What are some things that we can practice or things that we would, I don't know, how would we track that in ourself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6051.31,
    "end": 6053.051,
    "text": "So, you know, the, the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6054.299,
    "end": 6058.9,
    "text": " you have to sort of synchronize your perception with some sort of clock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6059.14,
    "end": 6078.903,
    "text": "So the classic way of doing that is either minding your heart rate or observing your breathing, or just generally having any kind of, you know, biofeedback that could be used, or it could be a metronome, you know, or any kind of tapping device.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6079.963,
    "end": 6082.624,
    "text": "If you could configure something like an Apple watch to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6083.274,
    "end": 6103.622,
    "text": " know vibrating uh periodically that would also be really useful and what what we need to learn um in order to operate our minds effectively is to essentially know the difference between the experience in the moment as it's happening and the memory of the experience um an interesting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6104.935,
    "end": 6108.397,
    "text": " topic related to all of this is the concept of chronic pain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6111.018,
    "end": 6114.999,
    "text": "You know, pain is sometimes defined as an emotion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6115.359,
    "end": 6124.283,
    "text": "And the question is, like, if something hurts, are you experiencing pain because there is an actual physiological symptom that needs to be addressed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6124.623,
    "end": 6126.444,
    "text": "Or is it effectively a memory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6126.903,
    "end": 6139.969,
    "text": " of a signal that is being triggered as a result of the fact that you experienced pain for long enough that its expression has become essentially part of your neural architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6140.849,
    "end": 6148.852,
    "text": "So a lot of people who are experiencing chronic pain are really experiencing effectively a memory of pain and there was nothing really wrong with them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6149.693,
    "end": 6154.675,
    "text": "And again, speaking of experience here, I had some issues with chronic pain for a couple of years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6155.342,
    "end": 6166.648,
    "text": " And like every CT scan, MRI, and any other assessment of the affected area, there was a hip cartilage damage that healed, but pain remained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6166.708,
    "end": 6169.589,
    "text": "And there was nothing wrong with the site, and yet the pain remained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6169.729,
    "end": 6183.236,
    "text": "So that's the notion of this sort of temporal thickness of this, how the perception has to update the internal model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6184.827,
    "end": 6187.348,
    "text": " it's a very interesting problem because it can go wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6187.668,
    "end": 6201.413,
    "text": "And when your proprioception and interoception are out of whack, and that could be as a result of being autistic, for instance, I think that's a good, autism is that kind of, it is that kind of problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6202.194,
    "end": 6206.775,
    "text": "It's a problem of, you know, too strong or too weak priors, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6210.233,
    "end": 6216.098,
    "text": " Whenever something like this happens, it becomes very difficult to actually get out of that kind of state of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6216.678,
    "end": 6218.74,
    "text": "But it is a state of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6219.621,
    "end": 6238.215,
    "text": "And by practicing this awareness in the moment, being on the edge of the marker blanket, we can really learn how to distinguish between these false signals that are just generated by the mind and the actual signal from the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6238.935,
    "end": 6245.458,
    "text": " And for me, for instance, learning these skills was a path to learning how to heal my body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6246.058,
    "end": 6251.081,
    "text": "The kind of issues that I managed to pull myself out of were quite interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6251.561,
    "end": 6267.608,
    "text": "It turned out that I had essentially a neuromuscular congenital issue on the left side of my neck that was messing me up, radiating throughout my body, creating this kind of like a weird twist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6268.069,
    "end": 6272.673,
    "text": " to the point where this actually shows up on my MRI as a Yakov Levin torque.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6272.873,
    "end": 6281.42,
    "text": "So my left occipital cortex is significantly larger than my right occipital cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6281.5,
    "end": 6283.501,
    "text": "It's a very interesting problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6284.242,
    "end": 6286.924,
    "text": "And I became aware of this fact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6287.485,
    "end": 6295.951,
    "text": "And after contemplating the free energy principle, I realized that my perception of the world as I see it is wrong",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6297.062,
    "end": 6298.683,
    "text": " where my body really should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6299.103,
    "end": 6314.314,
    "text": "You know, when they think I'm straight, when they think my posture is okay, when they think, um, all kinds of other things that simply isn't true as a result of me having wrong perceptions as a result of essentially a nerve, um, some sort of nerve impingement in my neck.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6314.334,
    "end": 6316.936,
    "text": "Uh, and that was a result of C-section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6317.937,
    "end": 6322.72,
    "text": "So I was kind of born with PTSD and free energy principle, like literally freed me from all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6322.92,
    "end": 6326.663,
    "text": "And my body is healing as we speak, like for the last, during the last year,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6328.054,
    "end": 6329.815,
    "text": " My posture has improved tremendously.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6330.235,
    "end": 6334.058,
    "text": "But it was all about understanding, like, what is it I'm supposed to be experiencing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6334.558,
    "end": 6337.561,
    "text": "How does my body know that I'm supposed to be level?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6338.061,
    "end": 6346.908,
    "text": "And then just meditating on that and, you know, feeling how the brain adjusts and the body responds automatically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6347.068,
    "end": 6350.47,
    "text": "It's not something that I learned how to straighten up to a good posture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6350.51,
    "end": 6356.395,
    "text": "I sort of learned how to let go and let my subconscious do the job.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6357.529,
    "end": 6359.53,
    "text": " And it was all as a result of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6359.57,
    "end": 6370.813,
    "text": "So there's a tremendous amount of power there to help people with all kinds of problems, you know, by explaining the nature of the experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6372.474,
    "end": 6379.936,
    "text": "And this story doesn't even scratch the surface of like, you know, the kind of experiences they had in this sort of area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6384.998,
    "end": 6385.958,
    "text": "I think this is a great",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6387.293,
    "end": 6390.375,
    "text": " moment for just our final thoughts and comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6391.575,
    "end": 6394.577,
    "text": "This is a really awesome discussion, though, and I hope it's not our last one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6396.878,
    "end": 6400.74,
    "text": "So, Blue, if you would like to have any final comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6406.123,
    "end": 6407.924,
    "text": "Sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6408.044,
    "end": 6415.348,
    "text": "For my little children, an only thank you, and I hope we get to have more discussion and comments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6415.388,
    "end": 6416.149,
    "text": "Thank you for having me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6416.169,
    "end": 6416.749,
    "text": "That was...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6417.418,
    "end": 6445.548,
    "text": " know really enjoyable thanks for um listening to my perspective i appreciate it yeah definitely our honor and pleasure to do so not traditional active lab activities but really fun and so thanks again to those listening good luck we hope you participate with active lab or life or whatever it is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6447.242,
    "end": 6453.728,
    "text": " you're probably already doing that so thanks christoph and blue peace out you too thank you",
    "speaker": "SPEAKER_00"
  }
]