[
  {
    "start": 8.095,
    "end": 26.077,
    "text": " all right hello and welcome everyone to the active inference live stream this is active inference live stream number 8.0 it is november 4th 2020 and i'm daniel friedman i'll be doing a solo contextualizing discussion today",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.137,
    "end": 29.998,
    "text": " Welcome to Team Calm, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.698,
    "end": 35.679,
    "text": "We are an experiment in online team communication, learning, and practice related to Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.299,
    "end": 46.402,
    "text": "You can find us on our Twitter account at Inference Active, at ActiveInference at gmail.com, at our public Keybase team, or at our YouTube channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.542,
    "end": 54.004,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.884,
    "end": 57.325,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.825,
    "end": 66.269,
    "text": "And as far as video etiquette for live streams, mute if there's noise in your background, raise your hand so we can hear from everyone, use respectful speech, behavior, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.09,
    "end": 75.813,
    "text": "So first, the announcement is that we have chosen the papers and the dates and the time for the rest of the ACT-M streams for 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.354,
    "end": 78.415,
    "text": "All meetings for the rest of 2020 will be from 7.30 to 9 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.635,
    "end": 78.715,
    "text": "PST.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.383,
    "end": 85.885,
    "text": " And the papers we'll be reading, number eight is Scaling Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.005,
    "end": 89.006,
    "text": "That's what this 8.0 is gonna be about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.067,
    "end": 92.208,
    "text": "And that's gonna be on November 10th and 17th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.288,
    "end": 98.211,
    "text": "Paper nine will be the Projective Consciousness Model and Phenomenal Selfhood, a 2018 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.351,
    "end": 102.713,
    "text": "Paper 10 is gonna be a Variational Approach to Scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.053,
    "end": 110.757,
    "text": "Paper 11 is Sophisticated Active Inference, Effective Inference, sorry, Simulating Anticipatory Effective Dynamics of Imagining Future Events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.12,
    "end": 113.983,
    "text": " And you can see the dates that all these events are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.343,
    "end": 118.469,
    "text": "So set aside the times if it's possible for you to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.11,
    "end": 123.916,
    "text": "And if you have a time zone or a kind of event that you wanna do that's not reflected here, just let us know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.457,
    "end": 125.519,
    "text": "And there's our Twitter address.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.5,
    "end": 128.122,
    "text": "All right, so,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.574,
    "end": 134.137,
    "text": " Here's what's going to happen in ActiveStream 8.0, this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.917,
    "end": 142.602,
    "text": "The goal of this talk is going to be to set the context for 8.1 and 8.2, which are going to be on this same paper, Scaling Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.322,
    "end": 148.625,
    "text": "This is a paper by Alec Shantz, Baltieri, Seth, and Buckley from 2019 with the archive 1911.10601.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.219,
    "end": 158.581,
    "text": " The video is an introduction to the context of some of these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.641,
    "end": 160.983,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.363,
    "end": 165.906,
    "text": "Definitely I learned a lot just reading through the paper and researching for this presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.587,
    "end": 175.873,
    "text": "So the idea is that this video will contextualize some of the ideas, math and notation and vocabulary of the Shantz paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.853,
    "end": 182.177,
    "text": "And the video should be accessible, though this is also hopefully cool and cutting edge research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.863,
    "end": 200.607,
    "text": " And the punchline, and don't worry if it doesn't make sense yet or the implications aren't clear yet, is that active inference is scalable and it's homologous to, so it's similar to, and potentially preferable to other common algorithms in a similar space like control theory or machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.567,
    "end": 204.147,
    "text": "So in 8.0, the first section is going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.849,
    "end": 216.555,
    "text": " some background on all the keywords that they used in this paper that they provided, and then talk about the goals, the abstract, and the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.776,
    "end": 224.38,
    "text": "Then the second part of 8.0 will be the key equations and notation and quotations walkthrough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.78,
    "end": 226.382,
    "text": "And we're going to do like the 80-20.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.722,
    "end": 232.046,
    "text": "So most of the notation, most of the meaning, but not all the sections, not all the symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.106,
    "end": 233.427,
    "text": "And then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.591,
    "end": 251.847,
    "text": " talk about figure one and figure two and what they represent and how that supports the conclusions of the paper and then in 8.1 and 8.2 we will all come together to discuss the same paper so save and submit your questions or put them as a comment and then get in touch if you want to participate in this one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.808,
    "end": 255.571,
    "text": " Okay, so let's start with the keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.112,
    "end": 258.694,
    "text": "So these were just the keywords that the paper provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.115,
    "end": 265.781,
    "text": "So I would think of them, these are the topics that this research is going to be on the cutting edge with respect to that field, hopefully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.382,
    "end": 275.391,
    "text": "So they are artificial intelligence, machine learning, and they mention also reinforcement learning and model-based reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 276.192,
    "end": 299.907,
    "text": " and then systems and control and information theory and then a keyword that wasn't on the paper but we can just add here is of course active inference and the free energy principle so um each of these keywords definitely you could have a course or a phd on so each one of them is going to get about one slide so of course go deeper into the resources mentioned or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.828,
    "end": 303.992,
    "text": " find other courses that teach these techniques because there's a lot to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.132,
    "end": 314.325,
    "text": "I'm just gonna kind of go through them in a way that builds towards where we're going with the math and with this research paper, and just know that there's other people's perspectives on these topics too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.286,
    "end": 317.929,
    "text": "So, first, artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.737,
    "end": 332.364,
    "text": " Wikipedia, when we last checked it, was saying that artificial intelligence or AI is intelligence that is demonstrated by machines, unlike the natural intelligence displayed by humans and animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.43,
    "end": 355.203,
    "text": " So even using this definition, or perhaps an alternate one, which I'll get to in a second, we can say that what AI results in today, 2020, is it results in maps, policies, individual and collective policies, recommendation engines, it results in encryption techniques and security, it relates to classification algorithms and things that influence us all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.618,
    "end": 364.025,
    "text": " Now, where I would come at this is by saying, well, AI is made and used by humans as part of their natural world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.866,
    "end": 367.348,
    "text": "And everything is natural in that it exists in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.476,
    "end": 381.622,
    "text": " And so by positing that there's an artificial type of cognition that is somehow distinct rather than extended or embedded, enacted by humans, does a few things that aren't very helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.662,
    "end": 386.024,
    "text": "And there's been some excellent other discussions of this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.545,
    "end": 393.228,
    "text": "Just to move it in a positive direction, I would just say that often other phrasing can be more helpful than calling it AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.848,
    "end": 395.089,
    "text": "So here's one example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.549,
    "end": 398.613,
    "text": " What we're going to talk about a lot today is computer statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.813,
    "end": 404.52,
    "text": "So using computers to do statistics, but basically things that pen and paper could do slowly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.04,
    "end": 410.847,
    "text": "So things that are about matrix calculations or about statistics with computers on big data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.86,
    "end": 416.846,
    "text": " Another way that AI can be meant today is like human in the loop AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.446,
    "end": 429.24,
    "text": "So human in the loop AI could describe a map or a recommendation engine to emphasize that it's human agency all the way through in the use affordances, as well as hopefully in what the designers considered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.683,
    "end": 449.648,
    "text": " Another phrasing of AI that can be helpful and also center the role of the human in deciding how to use it and how to design it is intelligence augmentation, which is clarifying that it's us who are augmented or even a more general phrasing than AI would just be the human technological niche, which would also include physical aspects of our niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.968,
    "end": 459.771,
    "text": "For example, what we talked about in 7.2, but that would include effects that aren't just simply in the sort of silicon chips and their interactions that AI captures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.138,
    "end": 462.739,
    "text": " All right, machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.119,
    "end": 476.65,
    "text": "So machine learning, there's a lot of things to say about it, it's a big area, but the main machine learning topics that come into play in this paper are reinforcement learning and model-based reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.33,
    "end": 485.096,
    "text": "So the simple reinforcement learner is an agent in an environment, and the agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.158,
    "end": 493.5,
    "text": " takes actions, A, that act on the environment, and then the environment sends back states and rewards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.18,
    "end": 502.541,
    "text": "And so sometimes it sends back just states directly, and then the reward is understood through a layer of perception by the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.942,
    "end": 505.262,
    "text": "Other times the environment directly sends reward back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.783,
    "end": 514.284,
    "text": "Where model-based reinforcement learning builds on that is by the introduction of this model, which is outlined in red here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.248,
    "end": 525.275,
    "text": " And in these types of model-based reinforcement learning, rather than learning the simple raw connection between successful behavior and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.778,
    "end": 538.982,
    "text": " and learning that as a behavioral correlation, the model-based reinforcement learner is able to have a model of, oh, for example, running is painful now, but then I'll feel better later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.462,
    "end": 547.565,
    "text": "And so then it allows one to pursue goals that are transiently unpleasant in order to get at larger term goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.905,
    "end": 556.208,
    "text": "So think about in a little maze, trying to get not just greedily towards the exit, but trying to take a step back to take two steps forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.779,
    "end": 565.325,
    "text": " So the similarities are that agents are acting on or within the environment and that their actions arise from policies, which are models of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.925,
    "end": 577.955,
    "text": "So what isn't likely, and those can be concurrent with what the organism actually can or can't do, quote, but at the very least, it's what ends up getting implemented by this organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.995,
    "end": 587.322,
    "text": "The agents modify their action policies based upon their reward from the environment, either in a direct way or in a symbolic way or in a model-based way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.254,
    "end": 592.598,
    "text": " they learn or to use the Bayesian phrasing, they update their model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.019,
    "end": 598.384,
    "text": "So in any case, it's gonna be computational because we're gonna be using computers and math to describe it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.905,
    "end": 604.63,
    "text": "But then Bayesians would say like the priors updated with evidence to generate the posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.491,
    "end": 607.854,
    "text": "And there's various ways that this learning or update can be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.614,
    "end": 612.038,
    "text": "Another similarity is that the environment sends rewards or signals to the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.465,
    "end": 620.13,
    "text": " And one area of debate or question to think about is, is the observation the reward or how is it the reward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.971,
    "end": 622.452,
    "text": "Is the learning itself the reward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.472,
    "end": 625.374,
    "text": "There's machine learning algorithms that have that kind of approach as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.114,
    "end": 630.978,
    "text": "And then does the observation symbolize or signal the reward or how do we think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.158,
    "end": 643.547,
    "text": " Those are kind of the ways that reinforcement learning and behavioral algorithms can be applied to both abstract data classification approaches, clustering and things like that, as well as direct plans for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.067,
    "end": 647.83,
    "text": "And it turns out that active inference is going to relate to reinforcement learning in an interesting way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.93,
    "end": 649.592,
    "text": "That's why the authors made it a keyword.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.752,
    "end": 650.993,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.02,
    "end": 660.286,
    "text": " Now, in a modern context, this reinforcement learning is going to be implemented with a, for example, neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.526,
    "end": 671.634,
    "text": "In this case, we have the environment sending the state to state S on the agent, and that's going to go through some sort of deep neural network DNN and result in some policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.649,
    "end": 675.33,
    "text": " So neural networks are inside the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.37,
    "end": 679.333,
    "text": "That's a way that we can implement it with basically software that's available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.054,
    "end": 692.544,
    "text": "And that allows for some types of scalable in the sense that we know how there's gonna be a relationship between how many models our parameters have, how big our model is and how effective it's gonna be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.144,
    "end": 699.049,
    "text": "And then it also allows for non-linear inference, not just a simple linear regressor, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.678,
    "end": 705.303,
    "text": " And sometimes the little and sometimes the big theta is used for parameters, but we'll get to that later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.243,
    "end": 716.733,
    "text": "And the neural network can be model-free, so it can just be sort of let loose to find the patterns in the data, or it can be using a underlying model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.074,
    "end": 724.441,
    "text": "So if a certain type of event is a priori taken to be much more likely, those kinds of observations can be used in a more weighted way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.8,
    "end": 735.564,
    "text": " One example of another modern reinforcement learning is this queue learning, which was used for some games and some types of things like that recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.144,
    "end": 745.848,
    "text": "And the insight is just another way of doing it is by mapping the queue table, which is the mapping of state action and reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.568,
    "end": 756.334,
    "text": " So that would be mapping your current state and your behavior in that state, like, oh, I'm tired, but I'm going to keep running because it's rewarding, let's say, but in some mathematical way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.134,
    "end": 763.278,
    "text": "And then the deep Q learning also represented here is when, again, it's not just a table, but it's a neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.318,
    "end": 769.542,
    "text": "So kind of the modern insight, just replace any other statistical module with a deep learning something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.862,
    "end": 774.605,
    "text": "And that allows for apparently some more nuanced policies to arise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.54,
    "end": 777.181,
    "text": " And then just one slide just to throw up there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.241,
    "end": 781.044,
    "text": "You can pause if you want to look at it, but it's from a paper called Deep Reinforcement Learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.264,
    "end": 785.247,
    "text": "And it shows just the depth of how many different areas this is kind of related to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.767,
    "end": 792.693,
    "text": "So these are the kind of structure of the problems and the areas that this paper is getting at with these keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.723,
    "end": 800.39,
    "text": " Okay, so let's start from this model-based reinforcement learning framework and then talk about systems and control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.211,
    "end": 810.08,
    "text": "So in this framing, we can look at the model-based reinforcement learning in green and the blue model-free reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.26,
    "end": 813.844,
    "text": "So model-free, again, is the direct mapping from experience onto policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.845,
    "end": 830.468,
    "text": " and the increasingly abstract model-based reinforcement learning is based upon the supervised learning of experience into updates for the transition model, generative model of the world, and then using that to implement some sort of planning process resulting in some policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.253,
    "end": 840.199,
    "text": " So control systems theory is about planning for action amidst uncertainty, because you have to plan for action and there's going to be uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.899,
    "end": 859.653,
    "text": "And there's various kinds of uncertainty, sometimes they're metaphors for each other, other times the methods are transferable, other times one system will suffer from one type of these challenges versus another, but it includes systems that are chaotic, like a double pendulum, stochastic, multi-scale, partially observed, noisy, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.954,
    "end": 885.658,
    "text": " so if you can't act you can't control you can only watch and that's really what differentiates control theory from just statistics because statistics is descriptive but systems and control approaches are more oriented towards understanding the dynamics of the systems in a way that can be intervened in so modeling this planning process and the policy explicitly and then also of course the caveat that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.849,
    "end": 909.659,
    "text": " not present in many of these models is the strategic axiom that non-action can be a form of action so the summary here is that we want to have a mathematical model a way to talk about how a system has to supervise or model their self their action affordances and their system and their world well that's the good regulator",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.58,
    "end": 912.861,
    "text": " And also have this action policy plan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.302,
    "end": 920.046,
    "text": "So supervised learning is about supervising your input and appropriately updating your generative model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.526,
    "end": 923.368,
    "text": "And then what is your generative model of the world for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.548,
    "end": 927.13,
    "text": "It's going to be about this policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.37,
    "end": 936.315,
    "text": "And here's a more classic control theory diagram with the way that the system, measuring element, controller, and effector are related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.335,
    "end": 937.676,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.611,
    "end": 966.623,
    "text": " information theory another keyword so there's probably another 500 hours of youtube to watch on info theory and a lot you could say about a lot of different areas um a simple way to phrase it is that information is the reduction of uncertainty whether it's actionable or not so it doesn't have to be connected to control theory it can just be purely descriptive like taking the shannon entropy of some dna strand",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.952,
    "end": 971.554,
    "text": " Information is always contextual, it's relational, it's model dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.614,
    "end": 977.938,
    "text": "There's a lot of critiques of this sort of naive Shannon interpretation of information theory sometimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.759,
    "end": 981.7,
    "text": "And the measurement or the comparison of information is challenging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.041,
    "end": 990.426,
    "text": "Like if you calculate the entropy of the biodiversity of insects and plants on the same island, they're not necessarily on the same scale, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.517,
    "end": 1002.06,
    "text": " And there's a lot of areas that info theory touches on, like semiotics and semantics, measure theory, dynamical systems, and signal processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.55,
    "end": 1009.316,
    "text": " Reduction of uncertainty is also not truth because, of course, wrong and precise estimates do exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.856,
    "end": 1014.421,
    "text": "And precise estimates of external states don't really facilitate effective action in many cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.441,
    "end": 1021.868,
    "text": "A lot of other related areas are the quantification, storage, and communication of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.75,
    "end": 1040.717,
    "text": " the measurement and comparison mentioned before how do you store and transmit information through time that's like memory how do you communicate that's about transmitting information through time and space protocols for communication um and when information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.307,
    "end": 1047.828,
    "text": " gleaned by a system, reduces its uncertainty about world states or causes or relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.808,
    "end": 1054.429,
    "text": "It can facilitate the updating of effective policy models and therefore action in some cases, but not all cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.55,
    "end": 1061.031,
    "text": "And when the action is effective, it can be rewarding or sustainable or high fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.071,
    "end": 1066.452,
    "text": "There's various ways that you can think about that kind of a success depending on the mechanism, scale of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.171,
    "end": 1071.534,
    "text": " And then the parameters are updated by this rewarding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.154,
    "end": 1081.842,
    "text": "So whether it's which genotypes of the plant are successful in a certain niche or whether it's which computer virus is mutating the best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.203,
    "end": 1088.448,
    "text": "It's this sort of learning slash development slash evolution process that ultimately we want to kind of move towards an integration of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.769,
    "end": 1089.949,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.004,
    "end": 1098.375,
    "text": " Just to talk a little bit more about information theory and also introduce this conditional notation, just for those who may or may not have seen it before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.451,
    "end": 1101.792,
    "text": " Why are we talking about information theory here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.252,
    "end": 1111.115,
    "text": "Because again, when we reduce our uncertainty about causal relationships and the statistical regularities in the world, we can enact better policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.676,
    "end": 1117.258,
    "text": "So let's get a grip on some basic information theory concepts, but also introduce this notion of a conditional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.738,
    "end": 1126.161,
    "text": "So the notation A vertical line B means A given B. So the part after the vertical line is the part you're conditioning on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.72,
    "end": 1129.883,
    "text": " H of A is the information content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.003,
    "end": 1135.83,
    "text": "How surprising is the random variable A in units or in bits?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.891,
    "end": 1147.044,
    "text": "And just to kind of combine these two bullet points, H of A given B is the information content of A conditioned on B. Sorry, there's a typo on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.016,
    "end": 1162.345,
    "text": " information of a semicolon b is the mutual information between a and b so that's shown in these sort of single overlap spaces on the venn diagram below and then also there's a triple overlap",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.408,
    "end": 1165.911,
    "text": " And you can also have overlap and conditionals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.491,
    "end": 1175.66,
    "text": "So the way that we're going to think about mathematics is just sort of like nested operations that hold different kinds of transformations and potential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.06,
    "end": 1178.663,
    "text": "And there's a lot of cool areas of information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.324,
    "end": 1181.245,
    "text": "James Gleick's a great writer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.766,
    "end": 1186.911,
    "text": "And this book by Stone in the middle is a good example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.091,
    "end": 1199.937,
    "text": " introduction and then this book by zanil at all algorithmic information dynamics is also a cool application and theory so let's return to a little variant of a slide that we've looked at kind of before",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.822,
    "end": 1209.411,
    "text": " which is this inactive versus Bayesian dichotomy slash divide that ultimately Actif is going to try to integrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.032,
    "end": 1217.96,
    "text": "So in the inactive worldview, we have the agent in the world, and they're enacting in this nexus of action and perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.073,
    "end": 1239.824,
    "text": " the outcome of this interaction is the embodied and ecological action sequence or policy from an embedded agent who makes slash is their behavior and just to go one more level now from this control theory perspective into the agent we can see that the agent has the sensory states on the in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.836,
    "end": 1253.558,
    "text": " input side then they have their causal model of the world and then their policy model in some sense these could be like one integrated unit or not we'll get there later and then we can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1255.191,
    "end": 1279.005,
    "text": " line that up with the bayesian structural representationalist view so in this view you have the data the observation which are sort of the base level observations or parameters in the model and then it through a recognition model hyperparameters are updated which result in a generative model of the data and this kind of a expectation maximization scheme",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.246,
    "end": 1290.71,
    "text": " results in this statistical convergence of a multi-level model that's representing, hence the representationalist, structures of the world, hence the structural part, maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.43,
    "end": 1302.334,
    "text": "And then just to line it up, we can think about that model that's a Bayesian control agent, let's say, it's going to have sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.494,
    "end": 1305.676,
    "text": "What is my robot sensor detecting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.256,
    "end": 1308.657,
    "text": "What is the causal model for what that means for the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1309.707,
    "end": 1333.25,
    "text": " pose of the robot and then the policy selection how are we going to correct so these uh both can be these two sides of the dashed line can kind of be internally consistent and we want to return to this question which is about how the free energy principle and active inference is going to say something about the relationship between the world and the agents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1334.949,
    "end": 1341.897,
    "text": " So we have action and perception, and we want them to be symmetrical in this kind of niche concept way we've talked about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.498,
    "end": 1347.043,
    "text": "We want to have the free energy principle be an axiomatic set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.764,
    "end": 1351.908,
    "text": "We want to build on top with a multi-scale active inference perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.549,
    "end": 1356.774,
    "text": " This is sort of where we want to be moving towards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.254,
    "end": 1362.299,
    "text": "How has Active Inference stepped into this gap and built up towards this goal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.2,
    "end": 1370.588,
    "text": "So Active Inference 1.0 and open to people building on slash correcting me on any of these parts here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.628,
    "end": 1372.731,
    "text": "This is just very rough epoch level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.996,
    "end": 1385.228,
    "text": " Active Inference 1.0 is an implementation of machine learning type algorithm that builds on free energy principle, as well as the inactivist approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.009,
    "end": 1389.272,
    "text": "And it relates the attunement of local sensory states and policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.613,
    "end": 1393.497,
    "text": "So in that way, it's kind of like the model-free reinforcement learner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.335,
    "end": 1396.556,
    "text": " and it focused on very discrete cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.116,
    "end": 1409.14,
    "text": "So just like on a grid, for example, and it used pretty simple expectation maximization algorithms and had relatively short range spatial and or temporal reach or depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.56,
    "end": 1416.623,
    "text": "It was more of a, let me see if my video, not sure what happened here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.005,
    "end": 1423.865,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.108,
    "end": 1451.875,
    "text": " so i'm gonna just re-add my camera sorry all right well c'est la vie anyways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.402,
    "end": 1470.409,
    "text": " Actimth 2.0 added temporal depth and niche interactions into the equations with a longer term planning phase and also added in this aspect of agent embeddedness and introduced the idea of valence and learning into the formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.369,
    "end": 1475.314,
    "text": " And this is kind of where Active Inference 3.0 and beyond go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.295,
    "end": 1484.424,
    "text": "So one direction they've been going is towards learning and affect and the sophisticated or counterfactual aspects of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.105,
    "end": 1486.026,
    "text": "Here's a citation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.099,
    "end": 1503.866,
    "text": " And then another direction that it was going towards is reflected by this scaling active inference paper, which is going to introduce the idea of the high dimensional data, the continuous variables, explore exploit behavior, and also homology to reinforcement learning and working at scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.386,
    "end": 1512.449,
    "text": "So for me, it was like the hero's journey reading this paper, because this is just a framework for a completion story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.669,
    "end": 1516.391,
    "text": "So this is the scaling active inference journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.506,
    "end": 1525.689,
    "text": " So it starts off with a call to adventure, which is the question, how can we model complex control tasks with active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.79,
    "end": 1530.932,
    "text": "Here's the beginning of the transformation, the challenges and the temptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.792,
    "end": 1536.714,
    "text": "Should one go to sleep or should they read Friston's bibliography?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.495,
    "end": 1540.616,
    "text": "The helper comes into the picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.776,
    "end": 1541.336,
    "text": "Here's Alec.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.984,
    "end": 1548.707,
    "text": " We have a transformative moment when we read and when we understand the paper Scaling Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.708,
    "end": 1556.772,
    "text": "Then we have our movement from dark to light, from reinforcement learning to active inference, from failure to control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.973,
    "end": 1568.418,
    "text": "Along the way, we receive the gift of meeting new friends, discussing cool ideas, having impact on systems, and making first-in memes, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.819,
    "end": 1570.66,
    "text": "So let's get to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.556,
    "end": 1573.563,
    "text": " So scaling active inference is the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.485,
    "end": 1584.127,
    "text": " The goal of the paper is presented as, we present a model of active inference that is applicable in high dimensional control tasks with both continuous states and actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.987,
    "end": 1593.608,
    "text": "Our model builds upon previous attempts to scale active inference by including an efficient planning algorithm, as well as the quantification and active resolution of model uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.328,
    "end": 1596.129,
    "text": "Our model makes two primary contributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.549,
    "end": 1602.89,
    "text": "First, we showed that the full active inference construct can be scaled to the kinds of tasks considered in the RL literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.57,
    "end": 1609.035,
    "text": " This involved extending previous models of deep active inference to include model uncertainty and expected info gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.756,
    "end": 1615.982,
    "text": "Second, we highlight the overlap between active inference, state of the art approach to model based reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.903,
    "end": 1625.891,
    "text": "So the non active inference phrasing here is how can we apply active inference to challenging control tasks and connect it formally to reinforcement learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.852,
    "end": 1634.618,
    "text": " So the abstract was, in reinforcement learning, agents often operate in partially observed and uncertain environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.279,
    "end": 1643.405,
    "text": "Model-based reinforcement learning suggests that this is best achieved by learning and exploiting a probabilistic model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.966,
    "end": 1653.553,
    "text": "Active inference is an emerging normative framework in cognitive and computational neuroscience that offers a unifying account of how biological agents achieve this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.73,
    "end": 1662.319,
    "text": " On this framework, inference, learning, and action emerge from a single imperative to maximize the Bayesian evidence for a shared niche of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.121,
    "end": 1669.968,
    "text": "However, implementations of this process have thus far been restricted to low dimensional and idealized situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.714,
    "end": 1685.826,
    "text": " Here, we present a working implementation of active inference that applies to high dimensional tasks with proof of principle results demonstrating efficient exploration and an order of magnitude decrease in sample efficiency over strong model-free baselines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.007,
    "end": 1697.556,
    "text": "Our results demonstrate the feasibility of applying active inference at scale and highlight the operational homologies between active inference and current model-based approaches to reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1698.457,
    "end": 1699.478,
    "text": "Okay, so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.66,
    "end": 1704.324,
    "text": " For some of you, that might be a lot of new ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.644,
    "end": 1707.127,
    "text": "Others may recognize a lot in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.587,
    "end": 1718.659,
    "text": "So let's just lay out the roadmap for how we're gonna get from A to Z, and then hopefully it will be approachable from all these different angles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.638,
    "end": 1746.498,
    "text": " section one is an introduction and two is about active inference and what work has been done in the area three is the model which is what we're going to focus on in this discussion and 3.1 is the generative model and the recognition distribution those are the p and the q models then there's a section on learning and inference policy selection trajectory sampling and expected free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.16,
    "end": 1750.742,
    "text": " as well as the section on the fully observed model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.902,
    "end": 1753.465,
    "text": "Those are the sections we won't go that much into today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.046,
    "end": 1768.337,
    "text": "Then there are the experiments related to exploration and exploitation, and the two figures related to the comparison of exploration strategies and the comparison of performance onto continuous control tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.838,
    "end": 1776.304,
    "text": "Then the relationship with previous work, specifically deep active inference model-based reinforcement learning and information gain theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.496,
    "end": 1779.347,
    "text": " Then there's a discussion and conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.368,
    "end": 1780.958,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.136,
    "end": 1794.319,
    "text": " This quote, which you can pause to read in full, I'm just going to pick up on the end of the top paragraph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.859,
    "end": 1810.404,
    "text": "While this approach, the previous work, provides an elegant framework for evaluating expected free energy, it can only be applied in discrete state and action spaces, meaning it is not directly applicable to the high dimension states and continuous actions considered in reinforcement learning benchmarks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.064,
    "end": 1834.375,
    "text": " So this is one reason why active inference discrete states-based learners have not been compared in the author's phrasing is that the reinforcement learning benchmarks that are used to test the adequateness or the efficacy of different reinforcement learning control theory algorithms are continuous tasks like the kind that we'll talk about in the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.195,
    "end": 1838.817,
    "text": "And so what this paper is going to do is employ an approach called",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.77,
    "end": 1847.196,
    "text": " Amortized inference, which we'll talk about more in a little bit, which utilizes functional approximators, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.356,
    "end": 1849.698,
    "text": "neural networks to parameterize distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.419,
    "end": 1856.584,
    "text": "Free energy is then minimized with respect to the parameters of the function approximators, not the variational parameters themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.304,
    "end": 1860.227,
    "text": "And then they restate what each of the sections in three are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.837,
    "end": 1863.878,
    "text": " Here's a notation reference sheet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.118,
    "end": 1880.142,
    "text": "It's not every single parameter, especially the statistical parameters that are distributional and a lot of the later sections too, but this is the sort of parameters that we're gonna see a bunch in the coming slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.802,
    "end": 1882.002,
    "text": "And we...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.373,
    "end": 1890.775,
    "text": " can really just already look at what a lot of the topics that the model's gonna cover are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.215,
    "end": 1900.038,
    "text": "So for example, the policy of the agent, the states that it's trying to estimate, and the true states with the hats, it's gonna be through time, it's gonna involve observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.579,
    "end": 1906.821,
    "text": "We're kind of seeing a lot of the ingredients of the reinforcement learning algorithms that we were talking about earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.321,
    "end": 1912.123,
    "text": "So let's talk about this amortized inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.479,
    "end": 1915.862,
    "text": " Here's what they write, the author's chance at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.723,
    "end": 1919.567,
    "text": "Amortizing the inference procedure offers several benefits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.448,
    "end": 1931.243,
    "text": "For instance, the number of parameters remains constant with respect to the size of the data and inference can be achieved through a single forward pass of the network rather than, let's say, back propagation training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.27,
    "end": 1939.735,
    "text": " Moreover, while the amount of information encoded about variables is fixed, the conditional relationship between variables can be arbitrarily complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.336,
    "end": 1947.44,
    "text": "In equation 3, which we'll get to, the parameters of the transition distribution data are themselves random variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.081,
    "end": 1951.083,
    "text": "In the current context, these parameters are the weights of the neural network, F.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.315,
    "end": 1958.239,
    "text": " This approach allows the uncertainty about these parameters to be quantified and cast learning as a process of variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.759,
    "end": 1963.222,
    "text": "The prior probability of theta is given by standard Gaussian, which acts like a regularizer during learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.443,
    "end": 1970.006,
    "text": "And this just talks about how free energy is going to be used to select the action policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.726,
    "end": 1972.727,
    "text": "So what is this amortized inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.867,
    "end": 1973.648,
    "text": "Why is it being used?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.85,
    "end": 1981.895,
    "text": " These papers on the bottom have a lot more information, but in amortized inference, the number of parameters used is flexible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.955,
    "end": 1993.003,
    "text": "You can have a small or a large model, but what's good about it is that you can also set the size of the model to not change even as more data is input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.323,
    "end": 2006.152,
    "text": " So this allows you to train on devices that you know are going to have limited computational power or use a very large but defined model size to implement on larger scale networks, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.954,
    "end": 2011.636,
    "text": "Again, the model can be trained with a single forward pass rather than more complex schemes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.177,
    "end": 2021.003,
    "text": "And then also there's all this degree of freedom when you can design the neural network because there's a lot of approaches that can be implemented with neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.958,
    "end": 2027.459,
    "text": " The general framing that they're going to be thinking about for this whole",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.679,
    "end": 2036.401,
    "text": " mathematical journey that we're about to describe is a partially observed Markov decision process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.021,
    "end": 2043.463,
    "text": "So these are the key variables that are going to be defining this organism-centric approach, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.103,
    "end": 2053.766,
    "text": "At each time step t, so that one's easy to remember, the true state of the environment, which is s with a hat, hat means that it's the real state, and the states are what are the important things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.126,
    "end": 2058.327,
    "text": "Those are like, is the bus going to hit me or not going to hit me, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.687,
    "end": 2088.007,
    "text": " but they could be various other things so we're keeping it general and then that s hat sub t so the real states through time exists in a state space with a certain dimensionality and there's also a real transition dynamics of the real states that's related to this p s with a hat t given the previous times and the action so that's saying that the time evolution of the system the real one with a hat s of t",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.947,
    "end": 2104.753,
    "text": " is related let me see if i can actually get the laser yep the s of t with a hat is related to the current time and the previous time and the actions and that has also a dimensionality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.076,
    "end": 2111.039,
    "text": " And agents do not have access to the true state of the environment, but might instead receive observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.139,
    "end": 2113.821,
    "text": "So O, observations, it's a good, easy one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.421,
    "end": 2124.128,
    "text": "And those have a certain dimensionality, which are generated to an actual observation distribution T, which is related to how observations are conditioned on real states of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.168,
    "end": 2128.631,
    "text": "So if it's really sunny outside, then you're really going to get photons if you look at the sun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.716,
    "end": 2135.718,
    "text": " As such, again, this is because agents only get observations and not the absolute truth from the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.138,
    "end": 2138.419,
    "text": "Agents must operate on their beliefs about states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.579,
    "end": 2140.519,
    "text": "So that's S without a hat through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.92,
    "end": 2146.081,
    "text": "Those have a certain dimensionality about the true environmental states, S with a hat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.061,
    "end": 2155.064,
    "text": "And then there's a difference between the true dynamics without italics and the model dynamics, which are always with italics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.143,
    "end": 2158.904,
    "text": " And here's how those equations are linked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.504,
    "end": 2161.285,
    "text": "Here's where Active Inference comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.025,
    "end": 2167.648,
    "text": "Active Inference proposes that agents implement and update a generative model of their world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.631,
    "end": 2191.648,
    "text": " italics p that means the model of the world of observations states policies and parameters of the world where the tilde is the sequence of variables through time so those are the observations and states through time and pi is the policy like if i have the policy of running every day then my observations through time are going to look like this you can imagine that one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.589,
    "end": 2199.835,
    "text": " And theta with italics is belonging to a larger version of theta, capital theta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.535,
    "end": 2203.978,
    "text": "And that denotes parameters of the generative model, which are themselves random variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.879,
    "end": 2207.501,
    "text": "And also agents maintain a recognition distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.541,
    "end": 2209.802,
    "text": "This is like P and Q, so mind the Ps and Qs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.723,
    "end": 2222.792,
    "text": " of the states through time and the policies and the theta parameters of the world representing the agents beliefs over their states policies and model parameters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.134,
    "end": 2230.497,
    "text": " All right, so in this part, we're going to look at the P model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.997,
    "end": 2232.398,
    "text": "Remember, it's the P's and the Q's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.359,
    "end": 2248.787,
    "text": "So the P is an agent implementation, that's why it's in italics, of a model of the observations through time, O with a tilde, states through time, S with a tilde, policy, and model parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.468,
    "end": 2250.728,
    "text": "So that's what this...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.909,
    "end": 2255.934,
    "text": " model is about, and it's implemented by the agent that we care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.456,
    "end": 2259.398,
    "text": "Here's what each of these lines says.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.838,
    "end": 2266.666,
    "text": "So the first line on the left side of the equation says p, which is that function that we have in big on the top,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.871,
    "end": 2291.203,
    "text": " is equivalent to uh the probability model of the parameters theta take those out then the probability of the policy is so if it's not possible for me to jump a thousand feet then it's not going to be part of my probability distribution if it is part of my power to jump a thousand feet then i'll consider it in my policy estimations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.023,
    "end": 2316.721,
    "text": " and then the big pi it's kind of like how sigma adds stuff up pi multiplies stuff up and so this is saying multiply it all out through time starting from the beginning t equals one and look at the p the agent model of o through time observations through time given states through time so the first part is just what's the probability of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.83,
    "end": 2322.133,
    "text": " given that I'm healthy, that I'm seeing this state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.274,
    "end": 2337.604,
    "text": "And then that's multiplied at each time point by the ways in which states S of T are conditioned on the prior states and the prior policies and the parameters of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.652,
    "end": 2350.449,
    "text": " So how all those things are linked, multiplied out through time, is what, at a first pass, describes this big equation on the top, the total model of OS pi theta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.779,
    "end": 2360.186,
    "text": " Then to dive into this P of observations given states through time model that the agent implements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.206,
    "end": 2362.067,
    "text": "N, big N notation means normal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.608,
    "end": 2378.622,
    "text": "And so this is saying the model of observations given the state estimates is a normal distribution, big N, with observations through time, with a certain mean and variance, mu and sigma, with a certain parameter, this lambda.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.722,
    "end": 2390.926,
    "text": " And together, these two, this kind of like duple, tuple of variables constitute this function lambda.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.526,
    "end": 2397.348,
    "text": "So the way that we're going to estimate these median variants may or may not be a least square.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.408,
    "end": 2400.069,
    "text": "It might be not an L2 norm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.469,
    "end": 2402.29,
    "text": "We could use a functional approach here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.69,
    "end": 2404.751,
    "text": "That's the insight of amortization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.27,
    "end": 2429.715,
    "text": " The probability of states, the probability transition model of how the agent believes states through time to be linked to conditional two, states at prior time and policy at prior time, and then the parameters of the world, is related to another normal distribution of states through time with another mu and sigma with a different probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.015,
    "end": 2453.605,
    "text": " subscript and for those mu and sigma we have f with the sub theta of how the states and the policies are related so this is another just sort of way to estimate the variance of different kinds of events happening therefore weight sensory inputs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.605,
    "end": 2460.136,
    "text": " Together, the state estimations distribution are, again, estimated by a function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.994,
    "end": 2483.959,
    "text": " p of theta is given as a normal distribution with a mean of zero and this identity matrix of covariance i believe and uh i think this is just reflecting a neutral initiating approach or regularization but i i'm this is not 100 sure about that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.079,
    "end": 2494.265,
    "text": " And this is reflecting that the probability model of policies is related to this softmax function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.505,
    "end": 2498.628,
    "text": "So it's a sigma, but it's not the same as sigma squared in a statistical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.609,
    "end": 2509.376,
    "text": "And it's the softmax function of the negative expected free energy of the policy, which we'll talk about in a later section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.037,
    "end": 2513.699,
    "text": "So that was our P. Let's look at Q.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.895,
    "end": 2521.917,
    "text": " Q is this agent recognition distribution, the Q with the italic, of states through time, policy, and model parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.498,
    "end": 2525.459,
    "text": "Here's how that one is defined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.839,
    "end": 2541.264,
    "text": "So Q is the probability of the parameters, theta, multiplied by the probability of the policies, pi, and then that same multiplication through time for all time of Q, which is the model of states given observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.021,
    "end": 2552.95,
    "text": " So previously we had POS, the second line here, probability of observations given states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.396,
    "end": 2560.798,
    "text": "Now we have QSO.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.539,
    "end": 2562.98,
    "text": "So this is kind of going the other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.022,
    "end": 2566.063,
    "text": "Q of theta",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.471,
    "end": 2582.004,
    "text": " is a normal distribution, kind of as we saw before, with its mean and variance parameters, same as the policy, and same as the cube model of the states given the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.726,
    "end": 2592.153,
    "text": "And it turns out that those mu and sigma are going to also have a functional that's going to approximate them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.918,
    "end": 2605.023,
    "text": " So to make active inference applicable to the kinds of tasks that are considered in reinforcement learning, the authors treated reward signals, observations, as observations in a separate modality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.383,
    "end": 2618.129,
    "text": "So that extends the generative model to include an additional scalar Gaussian, so that's another reward value of scalars like a single number, over reward observations with a unit variance in mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.008,
    "end": 2629.434,
    "text": " And that allows them to wrap this neural network, which is F sub alpha of the states, which is like this reward fully connected neural network with the parameters that they're then gonna train.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.234,
    "end": 2642.881,
    "text": "So that's really where the formal homology arises from the model-based reinforcement learning is that now we have pretty much the same architecture that was specified earlier in this discussion,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.641,
    "end": 2659.859,
    "text": " where the agent state is then of sensory input is run through this dnn and that results in this output of the policy or the reward but it's a little bit different but that's how we see a lot of the same homologies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.101,
    "end": 2665.226,
    "text": " All right, so what do the learners do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.927,
    "end": 2676.159,
    "text": "As new observations are sampled, agents update the parameters of the recognition distribution to minimize variational free energy, or F. So the F of the observation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.18,
    "end": 2700.932,
    "text": " is the expectation um okay well let me finish reading first this makes the what this f is going to do is make the recognition distribution q converge towards an approximation of the intractable posterior distribution p thereby implementing a tractable form of approximate bayesian inference all right so f",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.992,
    "end": 2724.019,
    "text": " of o through time with a tilde is the variational free energy of the observations through time so what is this magical free energy not magical it's just this equation in this case it is an expectation that is conditioned on a specific recognition model which is this expectation of q that's going to be related to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.719,
    "end": 2741.828,
    "text": " this um s pi policy and theta parameters uh variables what is this expectation going to be of that's everything that's about to be in square brackets this expectation is going to be the natural log ln",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.325,
    "end": 2752.195,
    "text": " which is a way to turn a question about maximizing the goodness of a model's fit into this minimizing the negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.455,
    "end": 2754.737,
    "text": "Sometimes there's a few ways that the natural law can help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.902,
    "end": 2763.965,
    "text": " The expectation is going to be the natural log of the recognition model minus the natural log of the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.365,
    "end": 2770.507,
    "text": "So again, that's the part that we cue that we can learn on, and then the part P that is characterized as intractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.047,
    "end": 2778.409,
    "text": "It turns out that this expectation is always bigger than or equal to the natural log of P of the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.87,
    "end": 2782.851,
    "text": "So that's just the P model of observations likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.212,
    "end": 2792.439,
    "text": " By minimizing the free energy of the observations through time, the agent converges heuristically towards this intractable p distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.372,
    "end": 2817.752,
    "text": " Given that Q is only over the states, policies, and parameters, and that P is really including and focusing on the observations, what this allows the agent to do is to focus on modeling the states and the policies and the parameters that are relevant via Q, and then potentially use math slash inactive behavior in this model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.433,
    "end": 2822.434,
    "text": " to tractably include, condition upon, or learn from its observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.934,
    "end": 2831.796,
    "text": "So we could bring previous knowledge to the table, just like Bayesian models allow for, but also have a way to deal with sparse or dense information as it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.156,
    "end": 2835.877,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.097,
    "end": 2845.039,
    "text": "Crucially, active inference also proposes that an agent's goals and desires are encoded in the generative model as prior preferences for favorable observations, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.139,
    "end": 2846.119,
    "text": "blood temperature at 37 Celsius.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.203,
    "end": 2851.106,
    "text": " Free energy then provides a proxy for how surprising, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.287,
    "end": 2853.87,
    "text": "unlikely, some observations are under the agent's model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.39,
    "end": 2860.557,
    "text": "While minimizing equation one provides an estimate for how surprising some observations are, it cannot reduce the quantity directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.218,
    "end": 2868.767,
    "text": "So here, equation one, we defined what F was, but it's just a definition and a bounding of what F is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.256,
    "end": 2878.142,
    "text": " It cannot reduce this quantity directly, so it's not really related to policy as directly approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.883,
    "end": 2882.445,
    "text": "To achieve this, agents must change their observations through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.526,
    "end": 2897.457,
    "text": "Acting to minimize variational free energy ensures the minimization of surprisal, negative natural log of the probability model of observations, or the maximization of the Bayesian model evidence, p of observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.319,
    "end": 2902.801,
    "text": " Since free energy provides an upper bound on surprisal, that was equation one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.861,
    "end": 2919.288,
    "text": "Active inference therefore proposes that agents select policy in order to minimize expected free energy, fancy G, where the expected free energy for a given policy pi at some future time is going to be defined this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.249,
    "end": 2928.874,
    "text": " So we want to do more than just update our internal model to bound our surprise on our observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.934,
    "end": 2931.655,
    "text": "We don't just want to fit the statistical descriptor model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.316,
    "end": 2939.7,
    "text": "We want to reduce the uncertainty in the future, which is a future time point, t tau, through the policy pi that we take now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.084,
    "end": 2959.1,
    "text": " this minimizable expected free energy function fancy g is going to take in the arguments of the policy selection and the future time step so fancy g fancy pi fancy t that's the free energy function in this case and what that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.333,
    "end": 2983.949,
    "text": " value which optimization on it is going to allow for effective action is going to be defined as is the expectation that's going to be related to q model which is about this observation states and parameters given policy models so given that my policy is this then how will the states and transitions of the world appear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.12,
    "end": 2990.981,
    "text": " And it's going to be the expectation of this quantity that's in brackets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.481,
    "end": 2994.322,
    "text": "It's going to be the log of states and parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.802,
    "end": 3001.043,
    "text": "So that's the Q of the S sub T and parameters given the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.543,
    "end": 3009.545,
    "text": "So that's what states will I be in and what will I think about along the way, potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.865,
    "end": 3012.706,
    "text": "These are just first pass verbal explanations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.746,
    "end": 3013.746,
    "text": "Just look at the math, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.271,
    "end": 3021.796,
    "text": " what states and parameters am I in now at a future time, given my policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.836,
    "end": 3027.582,
    "text": "So if I go out on a walk every day, how will it influence my states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.022,
    "end": 3029.603,
    "text": "What does my model have to be at that time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.504,
    "end": 3037.308,
    "text": " And then that quantity minus natural log of P, the observations, states, and the model given policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.328,
    "end": 3042.05,
    "text": "So that's the part that we want is actually the observations to be the correct values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.551,
    "end": 3046.933,
    "text": "But what we can do is just condition the states on policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.39,
    "end": 3062.823,
    "text": " And that G value is always greater than the negative, that's this last part of equation two, than the negative expectation of this Q, which is the observations conditioned on policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.863,
    "end": 3065.286,
    "text": "So that's like how things will actually turn out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.493,
    "end": 3073.854,
    "text": " of this log part of the generative model that is the observations given the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.255,
    "end": 3075.155,
    "text": "That's how things will go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.895,
    "end": 3097.561,
    "text": "So maybe there's other interpretations or other parts that are really critical, but I think this is one of the key formulations, which is that there's a policy related optimization problem that can be phrased in a variational way that is going to be bounded through a free energy like strategy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.454,
    "end": 3124.899,
    "text": " to estimate tractably some other function, Q, something related to that, of basically what we would want to know, which is like, okay, the observation that I look into my Bitcoin wallet and there's 15 Bitcoin, what policy do I have to take to see that observation or for that counterfactual to exist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.42,
    "end": 3127.762,
    "text": " if only one knew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.242,
    "end": 3131.065,
    "text": "So that's why there's this tractable, boundable equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.405,
    "end": 3131.846,
    "text": "Potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.866,
    "end": 3140.035,
    "text": "I think there's a lot to say here, and Alec and anyone else, I'd appreciate any other input, but that was just one read on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.987,
    "end": 3153.311,
    "text": " Okay, so that was most of the part that I wanted to go through at that level of depth, but then just to convey the other sections and what they do for the paper, but not go into every equation as much and then talk about the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.791,
    "end": 3157.332,
    "text": "So 3.2 is the learning and inference section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.013,
    "end": 3158.133,
    "text": "And...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.193,
    "end": 3177.845,
    "text": " in order to actually implement this optimization scheme as it's laid out it turns out there has to be an update process so is it going to be a sort of stick with what has worked or is it going to be novelty search those are kinds of things that optimization algorithms have to navigate the trade-offs that are implicit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.181,
    "end": 3181.444,
    "text": " with different strategies, depending on different problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.305,
    "end": 3189.893,
    "text": "And so this section defines how this F variational free energy is defined through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.455,
    "end": 3199.364,
    "text": "And I'm not going to cover the implementation details, but Alec would be cool if you showed us a simulation or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.056,
    "end": 3203.276,
    "text": " 3.3 is about policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.816,
    "end": 3204.497,
    "text": "Here's what they write.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.397,
    "end": 3212.441,
    "text": "Under active inference, policy selection is achieved by updating Q of policy in order to minimize free energy at fancy F.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.32,
    "end": 3239.306,
    "text": " given the prior belief that policies minimize expected free energy i the p of policy is related to this choice soft max related to the um negative g negative uh expected free energy of policy spaces with short as as specified in equation three free energy is minimized when the uh q",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.543,
    "end": 3251.828,
    "text": " distribution of policy is the same as the optimal free energy minimizing expectation of policies, across policies, just like the free energy optimal policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.388,
    "end": 3261.192,
    "text": "For discrete action spaces with short temporal horizons, basically G of policy can be evaluated in full by considering each possible policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.292,
    "end": 3262.372,
    "text": "So that's like Connect Four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.932,
    "end": 3268.735,
    "text": "You could just run out, or tic-tac-toe, you can run out every single option for the games at that branch point,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.707,
    "end": 3274.451,
    "text": " compute the absolute value of every single possible outcome, and then make your choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.171,
    "end": 3280.816,
    "text": "However, in continuous action spaces, there are infinite policies, meaning an alternative approach is required.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.216,
    "end": 3294.826,
    "text": "That's a really cool sentence because it really conveys well that actually the continuous action space, even for a single variable, is a truly different domain than a, let's just say, Prisoner's Dilemma game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.307,
    "end": 3296.928,
    "text": "There's sometimes almost...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.488,
    "end": 3319.293,
    "text": " no overlap in the algorithms that's why this paper actually reflects quite in advance and there's more details in that section 3.4 trajectory sampling so now how do you go from just having this distributional relationship between policies and other variables like related to generative models of the world and observation models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.936,
    "end": 3321.997,
    "text": " how are they going to get there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.477,
    "end": 3325.099,
    "text": "So to evaluate from the distribution to the specific policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.82,
    "end": 3333.385,
    "text": "So to evaluate the expected free energy for any specific policy, first they have to evaluate the expected future beliefs condition on that policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.906,
    "end": 3340.111,
    "text": "So one can't really undertake in this sort of normative framing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.831,
    "end": 3359.666,
    "text": " a secondary debate which we can definitely have about to what extent these are experienced cognitively by humans but we're just going to kind of go with it with the intentional stance and the sort of machine learning control theory take but and so beliefs it's not necessarily cognitive um we're just thinking about what the agent wants to do to succeed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.495,
    "end": 3368.797,
    "text": " But basically, if the agent doesn't have an expected future belief sequence for that policy, it will be extremely difficult for them to undertake it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.837,
    "end": 3380.14,
    "text": "And the fact that the transition model is probabilistic and the parameters of the transition model are random variables induces a distribution over future trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.6,
    "end": 3387.142,
    "text": "So rather than just playing out every possible chess move, we're thinking about how we are fitting a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.702,
    "end": 3390.023,
    "text": " more advanced kind of model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.104,
    "end": 3399.869,
    "text": "Chess is still discrete, so let's choose, we'll see a specific example, but this is just continuous optimization later in this figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.29,
    "end": 3406.674,
    "text": "But this is like having a distribution over future branch points in a chess game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.054,
    "end": 3416.26,
    "text": "So whether it's discrete or continuous, you can still have this element of uncertainty of a distributional range over future trajectories in state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3417.04,
    "end": 3422.185,
    "text": " So several approaches exist to approximate the propagation of uncertain trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3422.745,
    "end": 3430.892,
    "text": "For example, one can ignore uncertainty entirely and propagate the mean of the distribution, or one can explicitly propagate the full statistics of the distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.613,
    "end": 3434.255,
    "text": "So those are kind of two extreme approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.535,
    "end": 3439.62,
    "text": "One of them is just say, yep, ensemble modeling is tracking the mean, and so I'm going to keep that moving forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.12,
    "end": 3447.604,
    "text": " And then the alternative is basically to keep a summarization of the entire distribution and use that as what is being learned by the population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.845,
    "end": 3458.47,
    "text": "In the current work, it's utilized a particle approach whereby a Monte Carlo, so sampling-based scheme, samples are propagated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.91,
    "end": 3466.794,
    "text": "In particular, we consider this big B samples from the parameter distribution theta, which is drawn from cube theta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.42,
    "end": 3481.007,
    "text": " These sections convey how information on policy selection is accomplished in the model and how the policy fitness landscape is explored in order to implement predictive control on trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.627,
    "end": 3488.472,
    "text": "So the policy through time implement, it must involve some element of predictive control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.492,
    "end": 3491.714,
    "text": "All right, then there's section 3.5, 3.6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.452,
    "end": 3501.573,
    "text": " So 3.5 has details on computing this expected free energy value, as the title might suggest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.614,
    "end": 3513.035,
    "text": "In this section, they describe how to evaluate negative G for a policy, where they have used this notational convenience to talk about policies moving forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.455,
    "end": 3521.537,
    "text": "So kind of just made it like a naked pie, rather than this upper superscript that has to do with the time states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.456,
    "end": 3523.996,
    "text": " and uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3524.797,
    "end": 3536.81,
    "text": "And the negative expected free energy, which is what we are trying to get out here with the negative g, is equal to the sum of this negative expected free energies through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.471,
    "end": 3541.796,
    "text": "And then that is where there's a decomposition that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.795,
    "end": 3572.995,
    "text": " not my area but just i would think what it means is that there's a decomposition into this state information game gain and an extrinsic value component so this kind of breaks down into an explore and exploit component or some other trade-off we see this a lot with this negative g i would love it if somebody could uh talk a little bit why this is or if it always is the case but it always uh seems to be presented as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.195,
    "end": 3596.936,
    "text": " model accuracy penalized by model complexity or this plus this is it always two parts in the equation is it ever just one term can it be three terms here it's three terms but what um or four so i'm not exactly sure why sometimes it has more or less terms but that's what i'm curious about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.479,
    "end": 3608.722,
    "text": " Then in 3.6, they write, the model presented in the preceding sections serves as the most general formulation applicable in both partially observed and fully observed environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.802,
    "end": 3618.685,
    "text": "In what follows, we describe an implementation for the fully observed case, leaving an analysis of the partially observed case for future work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.305,
    "end": 3624.767,
    "text": "So it's just another wrapper around the fully observed case to have the partial observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3625.647,
    "end": 3631.75,
    "text": " And so they decided to use some benchmarks that facilitated them to basically have total observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.391,
    "end": 3633.652,
    "text": "And this isn't like cheating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.372,
    "end": 3639.255,
    "text": "The examples they're going to describe are kind of like balancing a dinner plate on a stick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.635,
    "end": 3642.556,
    "text": "So in that case, you do have total observation of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.777,
    "end": 3650.501,
    "text": "So just because you can't control well, it may or may not be possible given a certain stick and motor reflex time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.021,
    "end": 3653.102,
    "text": " But at the very least, you can observe everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.343,
    "end": 3655.724,
    "text": "So there's also unobservable control theory problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.105,
    "end": 3664.43,
    "text": "And then there's ones where the system is actually understandable and controllable, like the dinner plate, but you only get distorted or malicious information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.45,
    "end": 3669.074,
    "text": "There's other ones where you get perfect information, but only at time points and there's a game going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.814,
    "end": 3676.959,
    "text": " A lot of different ways that that can play out, but that's sort of the parts of the model that can get switched out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.699,
    "end": 3681.342,
    "text": "And that's what also I think it will be interesting to hear from any of the authors on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.508,
    "end": 3691.873,
    "text": " In section four, they go through some experiments and this is kind of the results phase of their paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.333,
    "end": 3702.38,
    "text": "And they describe how they investigate whether one, whether the proposed active inference model can successfully promote exploration in the absence of reward observations, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.52,
    "end": 3703.1,
    "text": "exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3703.3,
    "end": 3711.166,
    "text": "So that's what's really difficult for the model-free reinforcement learners to do is when it's not getting the reward, it doesn't do very well, can't explore very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.147,
    "end": 3713.288,
    "text": " because it's not winning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.949,
    "end": 3720.619,
    "text": "And two, whether the model can achieve good performance and high sample efficiency on challenging continuous control tasks, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3720.699,
    "end": 3721.42,
    "text": "exploitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.44,
    "end": 3723.363,
    "text": "So that's what requires tracking on something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.434,
    "end": 3729.517,
    "text": " We evaluate these two aspects of the model separately, leaving analysis of their joint performance, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.577,
    "end": 3732.919,
    "text": "the exploitation dilemma, to future work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.939,
    "end": 3744.305,
    "text": "So again, show it separately in the kind of pure use case, show that it can do either one, and then it will be something like a trade-off between the two of them or a wrapper layer that will end up mediating this trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.052,
    "end": 3762.206,
    "text": " All right, the explore task that they're gonna do is called Mountain Car, and you're a little car on the bottom of this valley, and you can push forward with the forward pedal, or you can push reverse with a reverse pedal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.047,
    "end": 3768.371,
    "text": " And you don't have a strong enough engine to get up to the yellow flag with just one go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.391,
    "end": 3772.854,
    "text": "It's like you're at the bottom of the hill and you're in gear 3.7 on your bike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3773.414,
    "end": 3775.556,
    "text": "But you can go up a little bit and back a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.696,
    "end": 3784.982,
    "text": "And so here you have to kind of explore and figure out a strategy that helps you explore more and more in order to get enough speed by going up this left hill in order to get to the yellow flag.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.782,
    "end": 3791.005,
    "text": " And then the exploit tasks that they're going to be talking about are twofold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.225,
    "end": 3792.866,
    "text": "There's the inverted pendulum task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3792.926,
    "end": 3796.027,
    "text": "So here we're still a little cart or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.588,
    "end": 3798.529,
    "text": "And we can move forward or backwards on a track.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3798.969,
    "end": 3802.391,
    "text": "And then there's the pendulum that we're trying to keep upright.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.811,
    "end": 3804.572,
    "text": "And so that's like the dinner plate on a stick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.692,
    "end": 3810.695,
    "text": "Then there's the hopper task, which is a jumping motor coordination task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.766,
    "end": 3820.689,
    "text": " So let's look at what they actually did for each of these two experiments and then see how the active inference learner stacked up against other algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.829,
    "end": 3826.951,
    "text": "So the mountain car example is a one-dimensional track positioned between two mountains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.051,
    "end": 3828.951,
    "text": "The goal is to drive up the mountain on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3829.191,
    "end": 3832.172,
    "text": "However, the car's engine is not strong enough to scale the mountain in a single pass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.893,
    "end": 3833.593,
    "text": "Similar to what I said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3834.173,
    "end": 3837.714,
    "text": "The only way to succeed is to drive back and forth to build up momentum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3838.154,
    "end": 3840.295,
    "text": "So what was cool about this, I thought, was that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.168,
    "end": 3848.053,
    "text": " The code was on the OpenAI site and on their github.com link is here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.613,
    "end": 3854.178,
    "text": "And so it could be really seen and played with and used as a standard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.298,
    "end": 3855.639,
    "text": "So it seems pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.979,
    "end": 3861.163,
    "text": "Didn't know about this resource for standardizing different learning algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.944,
    "end": 3865.326,
    "text": "So how did the active inference agent do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.207,
    "end": 3869.29,
    "text": "Well, it did well in this test, otherwise they wouldn't have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.034,
    "end": 3870.595,
    "text": " Made the Pape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.617,
    "end": 3876.306,
    "text": "And the way to read these graphs, A, B, and C are going to have the same X and Y axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.007,
    "end": 3881.015,
    "text": "So I put the map with a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.463,
    "end": 3904.871,
    "text": " engine on the top left so it kind of maps on to the bottom left panel a and so the position is related to the x-axis and so that's how far to the left and how far to the right that little train car goes and then the velocity is um whether it's at rest zero whether it's moving positively to the right or whether it's moving negatively to the left",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.411,
    "end": 3920.974,
    "text": " So the reward agent who just sort of pursues momentum, whichever way, I guess, only ends up getting a max speed of around 0.02 in either way, and then only moves like 0.7 or something in either direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.056,
    "end": 3941.241,
    "text": " The Epsilon Greedy Agent does manage to learn a short-range policy that we can see brings it a little bit further on one side, and it does take some rare excursions into slightly higher velocity regimes, but in the end, it doesn't really get too far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.461,
    "end": 3945.802,
    "text": "It learns how to go uphill when it's going uphill, but that only helps at a limited extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.562,
    "end": 3971.35,
    "text": " Whereas the active inference model as implemented has not just a more broad sampling within the state space conversions after 100 epochs, but their position extends to much higher range in the X and also a higher velocity distribution range in the Y. So it was more able to get out of this little ditch",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.89,
    "end": 3980.294,
    "text": " by being an active inference learner than by being epsilon greedy or just sort of model-free reward-based.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.414,
    "end": 3981.715,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.515,
    "end": 3988.538,
    "text": "The second optimization example presented in the paper is this Hopper v2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.598,
    "end": 3989.959,
    "text": "Again, didn't know about this resource.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.973,
    "end": 3992.776,
    "text": " So this one is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.457,
    "end": 3999.767,
    "text": "It is described as making a two-dimensional one-legged robot hop forward as fast as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.328,
    "end": 4001.37,
    "text": "And the code is also there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.39,
    "end": 4002.952,
    "text": "I'm not going to put the code up, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4003.772,
    "end": 4008.293,
    "text": " It kind of reminded me of this idea of evolutionary computation as control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.914,
    "end": 4012.335,
    "text": "And so sometimes there's so many angles to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.415,
    "end": 4017.696,
    "text": "First off, just this image with a checkerboard, floorboard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.796,
    "end": 4031.22,
    "text": "It reminded me of some simulators of evolutionary computation, like for Linux and stuff like that, where you could have these blocky aliens that would replicate and take up a ton of computational resources and just control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.4,
    "end": 4032.181,
    "text": " clash into each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4032.261,
    "end": 4033.663,
    "text": "And sometimes it was just the outline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.683,
    "end": 4036.846,
    "text": "Other times it was 3D blocks with this kind of a background and a floor plan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4038.227,
    "end": 4045.675,
    "text": "But here, what we're evolving is control strategies, not chromosomes representing genotypes or let's just say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.096,
    "end": 4051.641,
    "text": "But actually a similarity is this idea of the genetic algorithm and the genetic algorithm stochastic search.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.222,
    "end": 4070.393,
    "text": " because sometimes the way that these control policies are optimized is actually through steps that involve things like genetic search algorithms that switch over large sets of their parameters so there's some just interesting parallels and this i just thought was a cool example and at the intersection of motor behavior control",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.454,
    "end": 4085.01,
    "text": " But also complex state space estimation, even the beginnings of an inactive and maybe even embodied approach, because at some level of movement complexity, it's going to be implicit in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4085.905,
    "end": 4090.747,
    "text": " and distributed in it, just like other systems, that it has some notion of its own affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.328,
    "end": 4100.772,
    "text": "If it had 500 muscles and it was a human leg, it would have some sort of tensegrity structure that kept it balanced in a way that facilitated some types of actions, but not others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.193,
    "end": 4103.074,
    "text": "So very interesting choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.894,
    "end": 4111.242,
    "text": " And I'd like to hear from any authors or from other people, like, what are other benchmarks that are cool?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.762,
    "end": 4115.907,
    "text": "What other control systems problems are interesting or applicable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.848,
    "end": 4121.212,
    "text": "What about social versions or networked or communication based versions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4122.193,
    "end": 4122.874,
    "text": "So what were the results?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.393,
    "end": 4128.155,
    "text": " Okay, so here is how to look at these graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4128.415,
    "end": 4129.796,
    "text": "The x-axis is the epoch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4129.937,
    "end": 4131.758,
    "text": "So that's just the sampling through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.938,
    "end": 4134.46,
    "text": "That's how many generations of parameters are tried.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.181,
    "end": 4139.024,
    "text": "And here, the red lines indicate the same interval of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.504,
    "end": 4155.136,
    "text": "So C and D are related to epochs 1 through 100, and that's actually compressed up against a very small unit on A and B. And A and C, respectively, are for this inverted pendulum, and B and D are for the Haber task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.331,
    "end": 4162.975,
    "text": " So we can talk about the same phenomena looking at A and C in reference to the pendulum and B and D in the hopper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.515,
    "end": 4172.099,
    "text": "And in both of these cases, zoomed in or zoomed out, what is pretty apparent is that the y-axis is reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.319,
    "end": 4175.021,
    "text": "So that's just like in the hopper task is how far you're getting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.041,
    "end": 4182.965,
    "text": "And then in the inverted pendulum task, it's about your time maintained given a certain parameter combination for policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.186,
    "end": 4184.306,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.126,
    "end": 4190.945,
    "text": " In both cases, the reward sharply increases for the active inference agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4192.214,
    "end": 4220.937,
    "text": " and also just immediately uh starts climbing after some sampling within the first hundred or even the first uh several epochs probably because of the lower state space of the uh cart because all the cart can do is move forward and backwards have a policy on that like gas and brake and stuff like that that's it's all cooked into the physics of the pendulum i wonder if there's a inverted double pendulum task by the way that'd be kind of interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.835,
    "end": 4239.376,
    "text": " and um in the hopper task there's several more parameters at play i i didn't copy out the exact number but there's several more so it takes a couple more epochs reflected by the zero through um maybe 40 where the the average is like not really getting off the ground",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4240.077,
    "end": 4243.841,
    "text": " And this is being contrasted against the DDPG, which you can read more about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.861,
    "end": 4246.243,
    "text": "I'm just not going to go into what this algorithm is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.843,
    "end": 4250.046,
    "text": "I just trusted the authors use something that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.607,
    "end": 4255.511,
    "text": "Let's hear from anyone about what other alternatives could be tested against.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4256.212,
    "end": 4278.051,
    "text": " So those would all be things where I'm just not as up on the literature, but definitely would welcome the comments of someone from the machine learning field and what would be an impressive or useful demonstration of active inference or what would it mean to do a control theory simulation in this sort of a framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.131,
    "end": 4279.032,
    "text": "What else was used?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4280.351,
    "end": 4285.152,
    "text": " What else is the current state of the art for these inverted pendulum and hopper tasks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.272,
    "end": 4287.172,
    "text": "Just, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4288.073,
    "end": 4290.013,
    "text": "But it'd be great if anyone does know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.793,
    "end": 4295.694,
    "text": "So just to close out with the relationship to the previous work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.714,
    "end": 4303.456,
    "text": "Okay, this is from their closing section, which maybe it's a disciplinary thing, but often...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.662,
    "end": 4312.413,
    "text": " It's like a discussion section, but if it was relationship with previous work, I would have expected it to be a little bit more contextualizing and at the front of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.235,
    "end": 4316.919,
    "text": "So, but it read more like a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.648,
    "end": 4328.64,
    "text": " Related to deep active inference, which is like this through timeness of active inference, they write, our work builds upon these previous models by incorporating model uncertainty in its active resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.401,
    "end": 4339.291,
    "text": "We extend the previous point estimate models to include full distributions over parameters and update the expected free energy functional such that the uncertainty in these distributions is actively minimized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.972,
    "end": 4346.02,
    "text": " This brings our implementation in line with the canonical models of active inference from the cognitive and computational neuroscience literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.581,
    "end": 4349.345,
    "text": "So this is almost like saying, yeah, one more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.905,
    "end": 4356.714,
    "text": "Moreover, it enables us to evaluate the feasibility of active exploration under the scaled active inference framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.415,
    "end": 4382.334,
    "text": " apply the model to more complex control tasks and obtain increased sample efficiency relative to previous models so it's kind of like saying we've made this active inference model closer to what it has been speculated to be in the qualitative neurobehavioral realm which i think is a good reason to be reading it right now because it does fit in nicely with our discussions of behavior and of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.454,
    "end": 4388.316,
    "text": " neurobiology in the variational ecology discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.996,
    "end": 4392.338,
    "text": "So this is on the simulation side, how it comes to be this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.438,
    "end": 4400.482,
    "text": "So this is kind of cool because deep active inference is now being implementable through these kinds of models that are presented in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4401.142,
    "end": 4406.745,
    "text": "And previously it was like, oh yeah, I guess if it were deep active inference, then it would accommodate for narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.245,
    "end": 4412.387,
    "text": "And now this is the kind of framework where, oh yeah, okay, we could talk about narrative through time in this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.988,
    "end": 4413.228,
    "text": "Could we?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.724,
    "end": 4421.008,
    "text": " The second area they address, again, another key word for the paper, is model-based reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.049,
    "end": 4434.217,
    "text": "In the current work, we opted for Bayesian neural networks to ensure consistency with the variational principles espoused by the active inference framework, but note that ensembles can be made explicitly Bayesian with minor modifications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.638,
    "end": 4441.662,
    "text": "So they talked about several homologies to reinforcement learning and specifically amortized inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.063,
    "end": 4443.343,
    "text": "There's actually one quote that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.798,
    "end": 4458.33,
    "text": " I pulled out from one of the papers that are on the slide and that talked about how you might get the sense that this is like a win for free situation with just wrapping a functional around the estimation of these parameters because it's like, oh, it's a neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.37,
    "end": 4459.531,
    "text": "I'm implementing a neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.551,
    "end": 4462.413,
    "text": "So I have an additional degree of freedom to learn nonlinear policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4462.974,
    "end": 4464.916,
    "text": "But then the paper argued that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.181,
    "end": 4473.57,
    "text": " Actually, you're constrained because the functional is estimating the mean and the variance on this Gaussian outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4474.271,
    "end": 4483.883,
    "text": "And so it doesn't actually liberate a degree of output expressivity, but rather...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.286,
    "end": 4501.812,
    "text": " uh definable and a scalable way to implement on current computational hardware a way to implement this massive pencil and paper problem of estimating the gaussian mean invariance of super super complex high dimensional state spaces but that still is what it's doing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.392,
    "end": 4515.394,
    "text": " So, super interesting stuff, and also the note here that the ensembles could be explicitly Bayesian, so with all the kinds of variants and flavors that that introduces, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.522,
    "end": 4527.371,
    "text": " Anyone who's an enthusiast or expert in these areas, I would appreciate their perspective on what that means or why this is important or interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4528.432,
    "end": 4531.034,
    "text": "Then, info gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.575,
    "end": 4532.836,
    "text": "This was one of the keywords too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.557,
    "end": 4540.703,
    "text": " Identifying scalable and efficient exploration strategies remains one of the key open questions in reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.424,
    "end": 4553.556,
    "text": "Model-free methods such as the Greedy or Boltzmann choice rules, paging Dr. Proton, Sean, utilize noise in the action selection process or uncertainty in the reward statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.676,
    "end": 4561.118,
    "text": " A more powerful approach is to construct a model of the world, allowing the agent to evaluate which parts of the state space it has and has not visited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.638,
    "end": 4566.62,
    "text": "This allows for measures such as the amount of prediction error or prediction error improvement to be utilized for exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.94,
    "end": 4567.78,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.38,
    "end": 4579.024,
    "text": "If the learned model implicitly or explicitly captures probabilistic features, that's the statistical regularities of the niche, then information theoretic measures can be used to guide exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.827,
    "end": 4587.713,
    "text": " So there's so much to say here, and it's very interesting to bring in the information gain at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4588.413,
    "end": 4603.704,
    "text": "Really what it's saying is this learned model of active inference and the way that the exploration is tied into the generative model of the world such that action is facilitated not just towards the straightforwardly rewarding, that's sort of the model-free RL,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.855,
    "end": 4609.421,
    "text": " nor merely the deep model rewarding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.922,
    "end": 4613.147,
    "text": "That's like, I love running marathons because it's healthy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4613.267,
    "end": 4616.131,
    "text": "I'm not saying it's not healthy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.311,
    "end": 4619.315,
    "text": "It's the mindset that helps one get there for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.397,
    "end": 4621.038,
    "text": "And then...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.792,
    "end": 4644.923,
    "text": " this is saying we can actually go another level beyond that we can say with a deep generative model of what one is likely to be doing we can maximize precision which may be something you hear amongst the you know ultra ultra um committed of an area something like this is just how and who i am",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.803,
    "end": 4668.32,
    "text": " so in that sense it would be going beyond this whole oh well this many miles per day is healthy for me which is a great motivation it might be on might be a multi-scale thing um just one example and definitely i know you know even for me it's just changed like through life so it just shows how it's related to your niche your context your social relationships so many other areas and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.008,
    "end": 4680.561,
    "text": " And just to kind of close on one thought on this information gain, information gain surprised me at first because I was like trying to connect all of this to information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.322,
    "end": 4682.223,
    "text": "And I realized that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.166,
    "end": 4705.837,
    "text": " what it's about is reducing uncertainty on target parameters information is about reducing your uncertainty about things and it's just about reducing our uncertainty about something else or about more specifically something else being a multi-scale model that includes some attributes that we're probably pretty familiar with like the observation model some aspects that are homologous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.417,
    "end": 4730.068,
    "text": " to a reward model like sort of a preference model let's just say but then some aspects that are mainly maybe new and that might be the part about the free energy and then that area as i understand it is related to another type of information theory and model selection and the variational framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.848,
    "end": 4752.098,
    "text": " so if that is an area that anyone has insight into i think it's pretty cool maybe we could try to unpack that i'm not sure what it looks like but uh definitely something i wondered about and minding the p's and q's and thanks alec for a little bit of the email discourse about clarifying a few aspects of the paper because um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.161,
    "end": 4754.981,
    "text": " It was pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.422,
    "end": 4762.526,
    "text": "And I think there's a lot of implications and what systems we can possibly apply this to approximately or in the medium term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4762.566,
    "end": 4764.567,
    "text": "So tons of interesting stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.427,
    "end": 4769.049,
    "text": "We'll be talking about this on November 10th, 2020 and 17th at 7.30 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.069,
    "end": 4769.129,
    "text": "PST.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.189,
    "end": 4770.33,
    "text": "And I think that is it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4770.41,
    "end": 4771.17,
    "text": "And let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.653,
    "end": 4783.093,
    "text": " Yeah, one closing thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4783.774,
    "end": 4793.036,
    "text": "All we can have is a deep generative model of the space intertwined with action so that the parameters we explore are the ones that are at the trade-off of successful and optimally informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.876,
    "end": 4798.818,
    "text": "Sometimes we veer towards successful, which can be not optimally informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.278,
    "end": 4802.659,
    "text": "Other times we are getting informed greatly in a way that may not be successful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.239,
    "end": 4805.199,
    "text": "But overall, we manage that trade-off well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.64,
    "end": 4807.0,
    "text": "It's how we've gotten this far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.66,
    "end": 4809.1,
    "text": "So great work, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.201,
    "end": 4810.221,
    "text": "Thanks a lot for listening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4811.081,
    "end": 4811.801,
    "text": " Keep it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4813.282,
    "end": 4814.643,
    "text": "Thank you for participating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4814.983,
    "end": 4823.908,
    "text": "We do provide follow up forms to live participants and would be awesome if anyone had feedback or suggestions or questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.269,
    "end": 4835.335,
    "text": "You can stay in communication with us and up one more slide on that parameters reparameterization trick and the slides from that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4835.495,
    "end": 4836.816,
    "text": "But other than that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.844,
    "end": 4845.126,
    "text": " Thanks for listening and for bearing with the anomalous camera error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.906,
    "end": 4852.927,
    "text": "But yeah, I'm looking forward to the end of 2020 coming in with all these cool discussions we'll be having.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.487,
    "end": 4860.309,
    "text": "Would love to have some new participants come online or bring in some new perspectives that we haven't considered or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4861.448,
    "end": 4867.109,
    "text": " Talk about it from a beginner's perspective, from any number of fields as a starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4867.209,
    "end": 4868.47,
    "text": "Just let us know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.49,
    "end": 4872.39,
    "text": "That's the kind of stuff we just always appreciate hearing about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4872.831,
    "end": 4878.132,
    "text": "So have a good November and end of 2020 season.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.292,
    "end": 4881.733,
    "text": "And we look forward to talking with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.513,
    "end": 4882.753,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.133,
    "end": 4883.313,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]