[
  {
    "start": 8.513,
    "end": 31.709,
    "text": " hello and welcome everyone this is active inference guest stream 28.1 it's october 14 2022 today we are going to be hearing and discussing reconceiving rationality by giovanni rola so giovanni thank you so much for joining very much looking forward to this presentation and discussion so off to you thank you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.033,
    "end": 34.693,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.813,
    "end": 38.514,
    "text": "It was a pleasure to receive your invitation a couple of months ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.794,
    "end": 43.375,
    "text": "And I am delighted to be here and to have this opportunity to discuss my work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.976,
    "end": 52.297,
    "text": "As per your request, our suggestion, I am presenting this paper I wrote a couple of years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.078,
    "end": 58.699,
    "text": "And as we were talking backstage, I have changed my mind a few times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.759,
    "end": 62.68,
    "text": "And I'm going to make this clear during the presentation since I published that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.14,
    "end": 70.506,
    "text": " But it is a pleasure nonetheless to have the chance to present this view here and to share it with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.526,
    "end": 71.467,
    "text": "So I'm very happy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.628,
    "end": 75.871,
    "text": "So we'll be talking about reconceiving rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.071,
    "end": 84.899,
    "text": "And this is the itinerary I was thinking about presenting to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.179,
    "end": 89.362,
    "text": "So first, I'll be talking about rationality and contentless cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.185,
    "end": 100.711,
    "text": " Then I'll present my view, which I call radically inactive rationality, and say a few words about agency and proficient interaction and reasoning and rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.731,
    "end": 105.074,
    "text": "I'll close with a couple of objections, the first one being that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.894,
    "end": 112.496,
    "text": " Whatever I'm presenting here is too liberal in a way, excessively liberal, it encompasses too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.396,
    "end": 133.441,
    "text": "And the second objection, which I think is the one that may interest you the most, is whether it is in fact compatible with predictive processing or predictive coding, which is, of course, in the vicinity, it's near the, of course, it's central to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.341,
    "end": 160.018,
    "text": " So here is the, sorry, my initial thoughts on the matter is that traditionally, the very orthodox view on rationality assumes, to most of my knowledge, it's an assumption, really, that rationality must entail reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.072,
    "end": 165.083,
    "text": " that for instance, a belief B and an action A are rational, if and only if,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.933,
    "end": 168.975,
    "text": " there is the reasoning that underwrites the theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.516,
    "end": 172.637,
    "text": "And of course, it's just not any reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.017,
    "end": 183.184,
    "text": "The reasoning in question must accord with certain formal benchmarks, such as classical logic or probability reasoning or heuristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.904,
    "end": 191.149,
    "text": "So believing and acting rationally, according to this traditional view, require meeting certain formal standards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.456,
    "end": 202.939,
    "text": " And this, as I said, it seems to me to be largely an assumption about what it means to be rational, about defining rationality in terms of reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.519,
    "end": 217.923,
    "text": "So if rationality requires reasoning, and if reasoning involves the evaluation of beliefs against certain formal benchmarks, then rationality implies contentful cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.056,
    "end": 233.158,
    "text": " Where content, I take it to be minimally having accuracy conditions, being capable of being right or wrong, or on a more weightier notion, being true or false.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.819,
    "end": 237.159,
    "text": "So the idea here is that rationality necessarily involves content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.939,
    "end": 243.44,
    "text": "It involves beliefs, reasoning, and the comparison or... Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.46,
    "end": 247.221,
    "text": "It's about to update right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.122,
    "end": 253.504,
    "text": " I'm sorry, there was a pop-up in my window over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.204,
    "end": 259.867,
    "text": "So that would be, I think, the standard view on rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.648,
    "end": 271.533,
    "text": "And if it is so that rationality necessarily involves content, it is a good fit with classical cognitivism or cognitivism in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.498,
    "end": 278.941,
    "text": " which is the view that cognition necessarily involves representational content, at the very least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.202,
    "end": 291.008,
    "text": "For some cognitivists, of course, it might involve also conceptual content, but at the very least representational content, which has accuracy conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.134,
    "end": 321.447,
    "text": " But this classical view is not so good, does not provide so good fit with radically inactive and embodied cognition, which I am here thinking not specifically on radical inactivism by Hutu and Main in the recent books, but I think it also challenges other views that are not presented as radically inactive, but of course they share some core tenants with radical inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.389,
    "end": 334.455,
    "text": " We would call them radically embodied views of cognition, such as the views presented by Ezequiel de Paolo, Burman and Barandian in Sensory Modern Life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 335.036,
    "end": 338.558,
    "text": "You also have Gallagher's variety of an activism,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.638,
    "end": 351.943,
    "text": " in his 2017 book, and also the view by Tony Camelo in his 2009 book on ecological psychology and dynamical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.983,
    "end": 353.544,
    "text": "They all share common tenets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.564,
    "end": 354.204,
    "text": "And here I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.204,
    "end": 362.067,
    "text": "I know this is very controversial, but I'm treating those views as radically embodied views of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.587,
    "end": 366.129,
    "text": "But I'm specifically focused on radically inactive views of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.288,
    "end": 386.266,
    "text": " They all say that not all cognition is representational, contentful, which is in a way to say that we can think of basic contentless forms of cognition or a contentless level, basic level of cognition, which emerges through the active exploration of one's environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.207,
    "end": 390.971,
    "text": "And beyond radical inactivism by Hutu and Ming,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.262,
    "end": 399.536,
    "text": " This idea could be cashed out in terms of mastering sensory motor engagements, a matter of know-how,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.829,
    "end": 407.591,
    "text": " And knowing how to engage with your surroundings instead of knowing that stuff are so and so around you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.651,
    "end": 413.812,
    "text": "So this is very clearly what Di Paolo and colleagues and Camilo, for instance, do in their books.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.453,
    "end": 422.294,
    "text": "Radical inactivism has a certain tendency to skew sensory model engagements, sensory model schemes, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.755,
    "end": 428.676,
    "text": " But recent developments have, I think, incorporated that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.437,
    "end": 434.699,
    "text": "So this is the idea, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.2,
    "end": 449.946,
    "text": "So if we combine radically embodied views of recognition or radical activism and the classical view on rationality, what we have is something that Engel has described as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.956,
    "end": 460.179,
    "text": " And activism is the view that cognition is grounded in a pre-rational understanding of the world that is based on sensory motor acquisition of real life situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.399,
    "end": 470.001,
    "text": "And he explains this idea of pre-rational understanding by saying,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.184,
    "end": 486.911,
    "text": " by the ideas of Melopontine Heidegger, according to whom the relation to the world can be only one routine in practice, in acting, and practice in turn is mediated through the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.691,
    "end": 496.016,
    "text": "So what seems to be implicit here is that unlike acting and practice, rationality is not actually bona fide embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.738,
    "end": 500.66,
    "text": " It is something that is not at the very basic level of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 501.221,
    "end": 520.773,
    "text": "So this is what happens when we make room for a basic level of cognition rooted in act and in practice and divorce it from upper levels of cognition that are usually the Locke class of rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.394,
    "end": 522.594,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.264,
    "end": 532.589,
    "text": " The idea in summation is that contentless cognition or basic cognition, that which emerges through sensory motor engagements, is not rational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.67,
    "end": 541.134,
    "text": "So sensory motor engagements, however, virtues and prolific, they cannot be evaluated from the standpoint of rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.254,
    "end": 545.157,
    "text": "Only contentful cognition, high-level cognition, can be rational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.737,
    "end": 548.539,
    "text": "Cognition that is expressed, for instance, in beliefs and reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.335,
    "end": 566.953,
    "text": " And, well, this is something that I haven't touched upon on the paper, but it was my implicit motivation to deal with this subject, as someone that comes from philosophy of the mind, is the idea of the myth of the given, at least a version of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.277,
    "end": 589.955,
    "text": " It seemed to me at the time, and I was correctly persuaded by a reviewer not to touch on the subject, it was very convoluted in my initial presentation, but it seems to me that if we divide basic cognition from rational thought and action, and we do not point towards a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.668,
    "end": 610.284,
    "text": " there is no intersection between these two levels, it seems that radical inactivism and similar views would be committed to the myth of the given, popularized by Sellars and more recently by McDowell as a problem for imperialist views on the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.345,
    "end": 615.208,
    "text": "So it seems that this is, I think, a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.834,
    "end": 622.959,
    "text": " a philosophically interesting problem, but it's not something that is on the forefront of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.999,
    "end": 634.03,
    "text": "It was my implicit motivation here that to explain how can we combine the contentless or basic level of cognition through sensory motor engagements with rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.07,
    "end": 640.716,
    "text": "If we cannot, it seems that there is a given of some sort that is being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.297,
    "end": 645.86,
    "text": " not completely explained in our picture of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.48,
    "end": 648.081,
    "text": "So this is something I wanted to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.121,
    "end": 656.167,
    "text": "I still want to try to explore this intuition more clearly, but I haven't touched upon this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.808,
    "end": 670.016,
    "text": "But I think there's something in the direction of what I will show today is, I think it's a way to ease this accusation of being committed to the myth of the given.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.434,
    "end": 673.775,
    "text": " So how can we reconceive rationality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.835,
    "end": 691.562,
    "text": "I mean, I think in order to avoid that issue and avoid the idea that we have two levels completely separated from each other, where one, the higher one is the locus classicus of rationality and what else is beneath it is not rational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.142,
    "end": 699.165,
    "text": "I think the idea is to reject that rationality must be defined or entails necessarily reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.583,
    "end": 711.388,
    "text": " Rationality does not need to be so conceived, but then the challenge becomes to offer a positive proposal of what rationality is, if not reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.148,
    "end": 716.51,
    "text": "And here is Susan Hurley in a paper that, to my knowledge, is the only one that touches",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.43,
    "end": 741.027,
    "text": " on this subject, and I think she was also concerned about the myth of the given, by the way, at the time, and here is a long quote from her, if you don't mind me reading it, is that rationality might emerge from a complex system of decentralized higher-order relations of inhibition, facilitation, and coordination among different horizontal layers, each of which is dynamic and environmentally situated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.807,
    "end": 756.16,
    "text": " Rationality, reconceived in horizontal or modular terms, is substantively related to the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.64,
    "end": 767.169,
    "text": "It does not depend only on internal procedures that mediate between input and output, such as content, either for the organism as a whole or for a vertically-bounded central cognitive module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.93,
    "end": 781.936,
    "text": " Rather, it depends on complex relationships between dedicated world-involving layers that monitor and respond to specific aspects of the natural and social environment and of the neural network and register feedback from their responses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.517,
    "end": 790.26,
    "text": "This, to my knowledge, is the earliest case of someone working on the inactive approach, in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.301,
    "end": 794.142,
    "text": "Her play is obviously more...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.396,
    "end": 802.421,
    "text": " usually associated with the work of Alvano, which is also an activist, but in a different approach from radical activism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.521,
    "end": 818.551,
    "text": "And here is the earliest, and to my knowledge before I wrote that paper, is that the clearest proposal of rationality reconceived in negative terms, but it's not something that gained traction after her publication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.011,
    "end": 821.713,
    "text": "To my knowledge, at least, I haven't seen much since then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.329,
    "end": 836.978,
    "text": " And to summarize, the idea is that we have to change the explanatory focus, which is rationality is not exclusively thought of as a content-involving capacity in this proposal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.418,
    "end": 840.54,
    "text": "It is situated or world-involving, in Hurley's words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.321,
    "end": 843.642,
    "text": "And it is radically embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.662,
    "end": 845.823,
    "text": "It depends on bodily morphology and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.186,
    "end": 851.708,
    "text": " and how the organism is situated and acts in that environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.728,
    "end": 853.729,
    "text": "The idea would be minimally that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.789,
    "end": 858.011,
    "text": "So this is what I call radically inactive rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.485,
    "end": 879.509,
    "text": " is in a very loose definition so far, is that an Asian acts rationally insofar as she maintains a proficient interaction with her environment, coordinating her cognitive abilities according to environmental conditions of constraints and solicitations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.109,
    "end": 884.61,
    "text": "And of course, this sometimes requires adapting to unforeseen circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.33,
    "end": 887.691,
    "text": "The core intuition is this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.886,
    "end": 898.05,
    "text": " And it's interesting to compare this idea of radical and active rationality with another of Susan Hurley's ideas in a text from 2003.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.39,
    "end": 910.275,
    "text": "She says, reasons for acting, she argues that reasons for acting may be context bound, where she's arguing against Garrett Evans' generality constraint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.336,
    "end": 915.678,
    "text": "And this is the defense of her idea of islands of practical rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.824,
    "end": 928.031,
    "text": " So she is still treating rationality as essentially something that relates to reasoning here, but this kind of reasoning is bounded by practical context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.191,
    "end": 938.938,
    "text": "So this is a very progressive view if you compare with the traditional view I talked about at the beginning, but it's still more conservative than what I am trying to develop here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.73,
    "end": 958.539,
    "text": " So another thing that I think must be in the forefront of this proposal is that rationality implies agency and autonomy, because only something that an organism does can be said to be rational, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.519,
    "end": 966.723,
    "text": "So to use these ideas from the autonomist and activist camp,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.694,
    "end": 975.919,
    "text": " And from the theory of autopoiesis, a tyrannical system such as a Roomba cannot be rational because it's not an agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.679,
    "end": 979.721,
    "text": "It is not the author of its own behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.781,
    "end": 984.283,
    "text": "It is designed by external agents to work in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.883,
    "end": 986.784,
    "text": "So it's not strictly speaking an agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.824,
    "end": 995.269,
    "text": "So that is where I would draw the line of where, well, you cannot, it makes no sense to ascribe rationality to a Roomba, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.67,
    "end": 996.83,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.568,
    "end": 1004.69,
    "text": " For this, I use the notions of autonomy and adaptivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.51,
    "end": 1015.833,
    "text": "Di Paolo and others, you have also the recent book I mentioned before, Sensory Modern Life, and that famous paper from Di Paolo from 2005, where he talks about adaptivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.045,
    "end": 1021.689,
    "text": " to set these very general constraints on what it means to be rational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.55,
    "end": 1035.402,
    "text": "So, autonomous systems are thereby conceived as precarious networks, a precarious network of processes, because organization and physical boundaries are produced by the system itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.982,
    "end": 1041.047,
    "text": "The system is continually maintaining its own viability conditions, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.628,
    "end": 1056.153,
    "text": " known as sense-making, where the system explores environmental conditions that are favorable to its self-maintenance and avoids the ones that are detrimental to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.253,
    "end": 1068.037,
    "text": "So this is how I understand to be that the most general constraint on rational being that it must be an autonomous system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.569,
    "end": 1083.532,
    "text": " And the interesting thing here is that the concept of adaptivity that Paolo puts forth is that the capacity of an organism to improve its condition of self-production through internal structural changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.572,
    "end": 1091.133,
    "text": "So it involves the monitoring and regulation of internal changes in order to select the best available course of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.754,
    "end": 1093.474,
    "text": "This, I think, is another example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.954,
    "end": 1106.039,
    "text": " interesting concept to think of, to include in this idea of a radically inactive notion of rationality, one that is not necessarily committed to reasoning and content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.399,
    "end": 1122.966,
    "text": "So agency is realized through the exercise of situated abilities that promote changes within the organism in accordance with environmental constraints and solicitations, which means that how well an organism adapts in order to deal proficiently with its environment is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.131,
    "end": 1126.933,
    "text": " measure of or an indication of its rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.634,
    "end": 1146.788,
    "text": "The more rational an organism is, the more suited it is to deal with its environment and with unforeseen circumstances and in doing so the organism enhances the continuous exchanges between itself and the environment which is crucial for its survival and it is very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.129,
    "end": 1156.298,
    "text": " naturalized way of thinking of rationality is mostly a capacity to enhance chances for survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.479,
    "end": 1160.342,
    "text": "This is the overall idea here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1161.784,
    "end": 1164.647,
    "text": "So, as I said before, what about reasoning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.727,
    "end": 1167.209,
    "text": "I want to... I don't want...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.206,
    "end": 1170.627,
    "text": " commit rationality necessarily with reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.347,
    "end": 1174.949,
    "text": "And this is what radically inactive rationality is all about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.029,
    "end": 1181.212,
    "text": "But I don't want to exclude reasoning as a form of rational cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.122,
    "end": 1188.148,
    "text": " So what I'm saying is that it's not defined by reasoning, but it does not exclude reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.248,
    "end": 1200.48,
    "text": "Reasoning, I think, would be thought of as a special or a specific mode of rational agency, one that is exclusive to our knowledge to human beings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.321,
    "end": 1204.184,
    "text": "But it's not the defining feature of rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.251,
    "end": 1221.797,
    "text": " So for this, in order to explain this idea, I recall how Hutu and Satne and Hutu and Me, in a paper in the most recent book by Hutu and Me, they explain the emergence of higher cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.837,
    "end": 1228.78,
    "text": "The idea is that being able to engage in contentful cognition ultimately depends on being socioculturally embedded",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.912,
    "end": 1233.653,
    "text": " where contentful cognition emerged from sociocultural interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.713,
    "end": 1244.036,
    "text": "So as an individual takes part in sociocultural practices, they accept more ancient cognitive abilities to deal with symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.776,
    "end": 1255.359,
    "text": "And by doing so, in a long process of enculturation, of course, they become able to engage with symbols",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.425,
    "end": 1261.808,
    "text": " symbolic cognition, which is not internal representations per se, because it is publicly available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.528,
    "end": 1272.754,
    "text": "It's not mental representations in the traditional sense, but it has the features of symbolic cognition without the commitment to internal representation or mental representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.341,
    "end": 1288.506,
    "text": " So acting rationally in its most general sense is the idea that the proficient behavior of an organism is the proficient behavior of an organism in its environment and depends on the coordination of embodied abilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.387,
    "end": 1297.73,
    "text": "Whereas reasoning, if everything goes well, of course, is understood as contentful rationality for my specific mode of rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.29,
    "end": 1302.732,
    "text": "Reasoning is the proficient behavior of an organism in a sociocultural environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1303.865,
    "end": 1307.467,
    "text": " which is a more specific aspect of our environment, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.088,
    "end": 1318.975,
    "text": "And it depends on the coordination of socioculturally based or content-involving abilities, which are more recent in the human phylogenetic scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.356,
    "end": 1324.699,
    "text": "So, well, this is the biggest of the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.759,
    "end": 1329.402,
    "text": "This is, I think, the propositive part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.462,
    "end": 1332.304,
    "text": "And here are the objections I wanted to make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1334.225,
    "end": 1342.633,
    "text": " First one being that it's a very liberal view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.774,
    "end": 1344.535,
    "text": "It encompasses too much, one would say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.156,
    "end": 1356.227,
    "text": "Because if rational action boils down to the coordination of cognitive abilities, then rationality is something gradual for an organism could be more or less proficient in its environmental interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.939,
    "end": 1368.504,
    "text": " And the objection goes, according to radically inactive rationality, many organisms achieve and maintain an adaptive behavior in their niche with different levels of success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.344,
    "end": 1377.188,
    "text": "To which I am, well, someone could say radically inactive rationality is too liberal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.748,
    "end": 1383.411,
    "text": "And this is one objection that I've heard in person and I kept it to heart because I think it's very...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.971,
    "end": 1385.292,
    "text": " It's a very good way of putting it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.332,
    "end": 1387.793,
    "text": "Even snails are rational in this view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.513,
    "end": 1392.355,
    "text": "And to which I must say that I am willing to bite the bullet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.936,
    "end": 1396.798,
    "text": "Well, yes, it's more liberal than traditional views, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.818,
    "end": 1398.138,
    "text": "This is intended to be so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.819,
    "end": 1401.26,
    "text": "But I don't think that this is per se a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.66,
    "end": 1408.544,
    "text": "What I think is the positive part here is that it preserves the difference of degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.747,
    "end": 1424.359,
    "text": " Humans are way more rational than other animals, simply because we are able to perform a wide variety of actions in a wide variety of dynamic circumstances that are way beyond any other animals that we are aware of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.22,
    "end": 1433.587,
    "text": "So to come back to the example of the snail, the snail can perform a few complex actions, can move from one point to another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.168,
    "end": 1437.31,
    "text": "It can search for food and shelter and so on and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.251,
    "end": 1440.892,
    "text": " but they have a critically limited set of abilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.333,
    "end": 1447.796,
    "text": "If you surround the snail with salt, for instance, it is doomed to die by the hidratation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.577,
    "end": 1454.54,
    "text": "And humans, on the other hand, are much more adaptive and able to deal dynamically with many unforeseen circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.283,
    "end": 1465.529,
    "text": " My response to that objection is that yes, well, it is very liberal, but that's not the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.549,
    "end": 1473.136,
    "text": "The problem would be if it had the room for a difference of degree between how animals deal with their environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.26,
    "end": 1488.334,
    "text": " And this is the other objection, which I think may be the one that interests you the most, Daniel, is that, well, predictive processing seems to imply inferences and content all the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.975,
    "end": 1493.9,
    "text": "But at first, I must warn you and the viewers that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.986,
    "end": 1505.372,
    "text": " At the time I wrote this paper, I was much more optimistic about this possibility of combining an activism and predictive coding or predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.272,
    "end": 1515.518,
    "text": "And I think there are important points here, but there is this recent paper by Giampaolo and Evan Thompson and Randy Beer,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.178,
    "end": 1532.289,
    "text": " where they provide a critical assessment of the attempts to combine mainly the free energy principle and active and autopoietic theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.87,
    "end": 1541.116,
    "text": "So I am now mostly convinced by their arguments, but I think there are some interesting points of comparison here nonetheless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.378,
    "end": 1551.921,
    "text": " So predictive processing or predictive coding at the time I was writing and still to this day is all the rage in the cognitive sciences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.981,
    "end": 1557.322,
    "text": "I guess you can say that it's on its way to become one of the main paradigms out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.362,
    "end": 1563.744,
    "text": "So it is interesting to see if it provides a good fit with what I'm talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.987,
    "end": 1572.971,
    "text": " And in this view, cognition is understood as a process of error minimization that occurs in bidirectional neural hierarchies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.492,
    "end": 1574.832,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.025,
    "end": 1597.061,
    "text": " You have the generation of internal models for the activity of lower layers that anticipates the distal causes of sensorial stimuli, which is a top-down process, and the minimization of discrepancy between prediction and current stimulus signal by the application of priors, which is a bottom-up process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.408,
    "end": 1616.475,
    "text": " So here's, of course, active inference, which is understood by, for instance, in informal terms by Clark, that an organism moves its sensors in ways that amount to actively seeking or generating the sensory consequences that they or rather their brains expect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.556,
    "end": 1624.679,
    "text": "This is one way of understanding active inference in very informal terms, but I think it gets the job done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.743,
    "end": 1630.128,
    "text": " So, is the brain inferring the expected source of the received stimuli?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.769,
    "end": 1636.375,
    "text": "If it is, it seems that there is an issue with what I am talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.216,
    "end": 1640.619,
    "text": "So, the Rembolzian reading of predictive processing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.5,
    "end": 1659.027,
    "text": " which uses the broader Bayesian inference, right, says, for instance, that the process of perception is thus inseparable from rational, broader Bayesians, process of belief fixation and context top-down effects are felt at every intermediate level of processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.067,
    "end": 1667.69,
    "text": "This has called my attention the way that Clark is also talking about rationality all the way, but it's an inferential sort of rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.681,
    "end": 1682.886,
    "text": " And pervasive inference or reasoning seems to imply pervasive content, and then predictive processing seems to be incompatible with radically inactive rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.647,
    "end": 1694.951,
    "text": "Well, but there is, at the time there was, and I think we can still argue in favor of this non-hemorrhoids and reading of predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.072,
    "end": 1704.585,
    "text": " which uses, for instance, one first step would be to use a deflationary sense of prediction that Anderson and Camero in a short paper from 2013",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.189,
    "end": 1712.093,
    "text": " But fourth, where the values of two or more variables co-vary or vary reliably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.973,
    "end": 1718.116,
    "text": "So the value of one allows the observer to infer the value of another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.496,
    "end": 1729.283,
    "text": "And here the inference is happening at the level of the observation, not that one variable is inferring the value of another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.343,
    "end": 1731.765,
    "text": "So the idea would be, I think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.981,
    "end": 1735.541,
    "text": " that content is in the eye of the beholder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.042,
    "end": 1747.264,
    "text": "The person who interprets how the selection of sensorial input approximates internal predictions, here understood in the deflationary sense, can describe it in inferential and Bayesian terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.164,
    "end": 1759.286,
    "text": "So this is how I see, for instance, the idea put forth also by Bruneberg, Rietveld, and Kieferstein in that paper, which, if I'm not mistaken,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.441,
    "end": 1781.948,
    "text": " title is something like the brain is not a scientist and the argument is in this general direction that we are projecting how scientists construct brain activity as a feature of the brain itself as if it were predicting and inferring this more robust or weightier sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.243,
    "end": 1795.346,
    "text": " So what I'm trying to say here is that active inference, and I use double, I forgot the name of this in English, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.246,
    "end": 1802.308,
    "text": "It's not the literal sense of inference here, according to radically inactive inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.728,
    "end": 1826.867,
    "text": " uh rationality is that a norm for the efficiency of co-oriented behavior the agent has to act in certain ways in order for his his or her states come to fruition more efficiently less costly this does not imply the more contentious claim that the generative models themselves display and perform predictive inferences this is a very deflationary routine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.728,
    "end": 1835.75,
    "text": " into predictive processing to provide this combination with radically negative rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.268,
    "end": 1842.071,
    "text": " And here is Kirchhoff in a paper from 2018.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.193,
    "end": 1853.419,
    "text": "By model, it doesn't follow that an organism has an internal representational model of its niche, and that it is this model that does all the cognitive work, if you like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.159,
    "end": 1856.28,
    "text": "Instead, an organism is a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.32,
    "end": 1864.366,
    "text": "That is, the causal and statistical regularities reflected in some environment are reflected in some phenotype that is a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.566,
    "end": 1866.347,
    "text": "And, well...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1867.81,
    "end": 1886.672,
    "text": " This relates to something that recently my colleague Nara Figueiredo and I have been talking about, the idea of how organisms bring forth a world according to an activism, which is the idea that the organism and environment are historically co-determined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.894,
    "end": 1905.428,
    "text": " At a phylogenetical scale, this could be explained through the idea of niche construction, the idea that once an organism is active in its environment, it promotes changes that if they are stable enough, they can be inherited by its offspring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.908,
    "end": 1910.232,
    "text": "And these changes provide new evolutionary pressures that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.894,
    "end": 1914.856,
    "text": " that lead its evolutionary pathway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1914.956,
    "end": 1923.964,
    "text": "A similar idea has also been explored by Evans Scribano, this time relating niche construction and ecological psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.238,
    "end": 1938.289,
    "text": " So my response to that objection is that to act rationally means to achieve a proficient engagement with the environment through, in a way, prediction and error minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.349,
    "end": 1948.499,
    "text": "I'm willing to accept that characterization, but rational and broadly Bayesian processes need not imply contentful cognition if we...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.597,
    "end": 1952.118,
    "text": " if we understand that in a flash narrative sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.698,
    "end": 1964.841,
    "text": "Prediction and narrow minimization involve the selection of input and the coordination of linked abilities in world-involved manners, which is, well, exactly the main claim of radical and active rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.941,
    "end": 1974.344,
    "text": "So I think to that extent that predictive processing is not an enemy, it would be rather an ally of this idea instead of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.485,
    "end": 1976.965,
    "text": " arrival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.566,
    "end": 1987.633,
    "text": "But of course, there are other issues of compatibility that I haven't touched upon here, but that is all that I have for today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.753,
    "end": 1988.153,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.056,
    "end": 1992.336,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.856,
    "end": 1993.637,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.179,
    "end": 1996.719,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.822,
    "end": 2001.082,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2001.523,
    "end": 2002.984,
    "text": "Very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2004.224,
    "end": 2007.586,
    "text": " For those who are watching live, please feel free to write any questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2008.126,
    "end": 2011.148,
    "text": "I will gather my notes and let's begin the discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2011.168,
    "end": 2012.989,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2014.37,
    "end": 2017.332,
    "text": "Well, first, just thanks again for the talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2018.404,
    "end": 2029.958,
    "text": " How about a little context on how you came to be asking these questions in your current position and how your interests in this area developed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2029.998,
    "end": 2037.548,
    "text": "Because there's so many interesting ideas and I just wanted to learn more about how you came to this framing and sharpened your point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.369,
    "end": 2040.23,
    "text": " Okay, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.43,
    "end": 2047.156,
    "text": "That's a good question, because it's not often that you can explore these background matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.216,
    "end": 2053.141,
    "text": "So I was, at the time, I think I was writing my PhD dissertation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.221,
    "end": 2054.802,
    "text": "It was maybe 2017 or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.744,
    "end": 2064.788,
    "text": " And I was arguing for the idea that rationality must be something that is ultimately world-involving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.068,
    "end": 2080.997,
    "text": "There is a tendency to think of, well, even among, as I showed you, among embodied theories, we think of certain abilities to be essentially world-involving, such as acting and practice and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.122,
    "end": 2104.432,
    "text": " and perception, of course, but rationality remains something like a naturalizable notion, something that cannot be brought down to the level of, cannot be scaled down in a way, like perception that could be explained by certain dynamic engagement, so on and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.353,
    "end": 2109.995,
    "text": "So at the time I was thinking that, well, maybe this is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.164,
    "end": 2129.098,
    "text": " An issue because on other contexts, it is taken to imply that whatever perception is, if it is not articulated in a way to provide a certain fit with rational cognition, then perception is a given.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.898,
    "end": 2132.301,
    "text": " And this is the myth of the given I mentioned at the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.122,
    "end": 2142.914,
    "text": "And I thought that, well, maybe there is something of a myth of the given working here on an active cognition, but I think it's not fatal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.912,
    "end": 2165.95,
    "text": " because we could, in principle, argue that instead of construing perception and other basic forms of cognition as involving concepts and the like, maybe we could argue from the other direction, try to scale down rationality at a more naturalized level of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.086,
    "end": 2192.067,
    "text": " perceptual cognition and the like so that was the motivation and it was very it was a long review process and i believe that my first the first version of the paper that the viewer was very i think they were correct entirely i i endorsed the suggestion after all but he was very um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.069,
    "end": 2214.185,
    "text": " they were very adamant on taking that part, and I think it was for the better, because it is another literature, it is another, a lot of references that are not usually in conversation with an activism and embodied cognition, and it was very difficult just to put the matter in the same terms,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.966,
    "end": 2216.067,
    "text": " to advance my argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.087,
    "end": 2220.552,
    "text": "So it's something that I scratched out and I haven't thought too much about that since then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.572,
    "end": 2223.416,
    "text": "But I think it's something I would like to come back to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.216,
    "end": 2230.904,
    "text": "And maybe even probably someone has done so in these last few years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.984,
    "end": 2232.165,
    "text": "I'm not aware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.746,
    "end": 2233.627,
    "text": "I can't remember, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.568,
    "end": 2242.014,
    "text": " this relation between inactivism and the myth of the given, it seemed to me, it seems to be very obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.555,
    "end": 2253.083,
    "text": "So it is, I think, something that we could, we should, I mean, be able to explore, but there's not something that was in the forefront of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.324,
    "end": 2258.568,
    "text": "But I had this idea to talk about rationality in the fashionary sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.804,
    "end": 2266.427,
    "text": " And at the same time, I was reading a lot about coding from a philosophical perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.487,
    "end": 2277.933,
    "text": "Of course, I'm not, as I said, very well-versed in the technicalities and the formalities of the approach, but I was interested in the philosophical consequences there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.953,
    "end": 2284.596,
    "text": "And I thought, well, maybe there's something to compare here because as Clark's quotations show,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.475,
    "end": 2297.873,
    "text": " You can talk about rationality all the way, and that's something I wanted to develop, but not in a cognitiveist view, but in a radically embodied view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.494,
    "end": 2300.657,
    "text": "So that's the background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.106,
    "end": 2303.426,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2303.627,
    "end": 2304.007,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2304.628,
    "end": 2309.873,
    "text": "Could you maybe describe just what is the myth of the given?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.554,
    "end": 2313.918,
    "text": "What was the context that that myth arose in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.559,
    "end": 2318.503,
    "text": "And where do we go after bringing up the myth of the given?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2318.543,
    "end": 2321.326,
    "text": "Because I saw it as a concept that you wove in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2321.386,
    "end": 2322.888,
    "text": "So what was it about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.933,
    "end": 2347.292,
    "text": " Okay, so the myth of the given is that, well, there are several possible givens, depending on your flavor of philosophy of mind, but most classically empiricist views of the mind take the content of perception to be given prayer rationally, in a way that we have certain inputs that are just received by the mind, and the mind interprets it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.372,
    "end": 2351.375,
    "text": "So Sellers, Wilfred Sellers, is famous for...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.15,
    "end": 2379.296,
    "text": " having described this problem as a problem for not only empiricist views of the mind, but also for rationalists, but on the other side, rationalists usually take rational intuition as a given, which is to say that there is some level of cognition that is unarticulated, it's given, or some people talk about being pre-given,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.296,
    "end": 2386.859,
    "text": " But in a way, there is this level of cognition that is given and the mind has to interpret it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.419,
    "end": 2395.562,
    "text": "But if it is given in this way, it has no point of contact, no intersection between whatever...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.043,
    "end": 2402.589,
    "text": " whatever mind does in this basic level of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.369,
    "end": 2409.896,
    "text": "So my idea is to avoid the charge of being committed to the myth of the given.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.596,
    "end": 2420.986,
    "text": "But again, this is not something that is explicit in the nativist literature, but it's something that seems to be possible to develop in a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.253,
    "end": 2430.91,
    "text": " in this sort of comparison but it's not it's not on the it's not clearly there but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.758,
    "end": 2451.44,
    "text": " One way of solving the myth of the given is to say that perceptual content is already conceptual in nature, which is, for instance, how John McDowell does in Mind and World, that a perception joke comes with subtitles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.472,
    "end": 2455.034,
    "text": " You interpret the world as you do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.655,
    "end": 2465.643,
    "text": "But I think that one way or another way is to demystify, in a way, rationality and the upper layers of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.143,
    "end": 2480.254,
    "text": "Try to think of them in less contentful, in a less... Without committing them so, strictly speaking, with a level of content that is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.528,
    "end": 2483.79,
    "text": " divorced from basic levels of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.291,
    "end": 2501.606,
    "text": "That's one way I think of doing so and rationality seems to be the one key concept to do this because it's so usually assumed to be something exclusively human and something that is related to reasoning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.757,
    "end": 2511.603,
    "text": " And well, if it is so, then rationality cannot inform action, of course, if action is contentless in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.303,
    "end": 2530.555,
    "text": "So if rationality is essentially contentful and action is essentially uncontentful or contentless, then you do not have this touchstone, this intersection between two domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.465,
    "end": 2547.995,
    "text": " And this is something I wanted to avoid, but as I told you, it became so hard to express these views in sufficiently clear and general ways that by recommendation of a reviewer, I scratched it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.135,
    "end": 2561.083,
    "text": "I still think about it, but I haven't developed a proper line of argumentation that deals with it more clearly than I can do as I just did in very general terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.985,
    "end": 2564.165,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.545,
    "end": 2574.489,
    "text": "Well, some words that you associated with rationality were adaptivity and also proficiency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2575.129,
    "end": 2580.091,
    "text": "So what do you see as the relationship of rationality and fitness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.412,
    "end": 2584.273,
    "text": "Fitness as a biological function, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.913,
    "end": 2585.173,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.193,
    "end": 2586.593,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.094,
    "end": 2587.114,
    "text": "I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.249,
    "end": 2593.69,
    "text": " I think it is an intrinsic relation, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.73,
    "end": 2607.154,
    "text": "I think it is probably the most obvious consequence of rational action at the specialist scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.646,
    "end": 2627.78,
    "text": " When we talk about whether rationality is a feature of a certain species instead of individuals, I think fitness is one of the key concepts here to think this as the outcome of this rational action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.761,
    "end": 2636.246,
    "text": "So, although I do not say, I do not put those matters in the paper, I think it is possible to think it that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.286,
    "end": 2637.327,
    "text": "I don't see it as an",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.215,
    "end": 2642.397,
    "text": " as an objection to think of rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.417,
    "end": 2648.101,
    "text": "But again, it's very liberal and I'm willing to accept this consequence as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.241,
    "end": 2657.306,
    "text": "Every living organism, in a way, if it hasn't gone extinct yet, so it is in a way fitted to its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.346,
    "end": 2664.511,
    "text": "So I'm willing to say that it may involve a minimal level of rationality of dealing with a dynamically changing environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.68,
    "end": 2676.752,
    "text": " But, well, it's the price of having a very liberal, progressive notion of rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.772,
    "end": 2678.674,
    "text": "This is a consequence of it, I believe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.784,
    "end": 2687.166,
    "text": " So you've said that fitness is a consequence of rational behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.186,
    "end": 2694.609,
    "text": "Are there other consequences or how do we recognize rationality from the outside?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2694.769,
    "end": 2698.411,
    "text": "Other than just saying, well, the ant colony is thriving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2698.771,
    "end": 2704.553,
    "text": "So to the extent that it is rational, it is adaptive and exhibiting agency and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2705.674,
    "end": 2708.595,
    "text": "Is this such a deflationary rationality concept",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2709.215,
    "end": 2716.081,
    "text": " that all extant things, humans and otherwise, are merely described by it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2716.602,
    "end": 2728.553,
    "text": "Or are there some outcomes that we can use to disentangle, like, for example, irrational or irrational behavior from merely the consequences reflected by survival and fitness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2730.066,
    "end": 2730.386,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.307,
    "end": 2742.657,
    "text": "Well, I had to think very carefully about this because I don't want to trivialize this concept in a way that, well, everything is ipso facto rational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.878,
    "end": 2746.281,
    "text": "By the matter of fact, it is living, it is acting rationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.301,
    "end": 2746.961,
    "text": "But I think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.162,
    "end": 2758.93,
    "text": " In particular cases, one could identify certain actions that are inimical to the individual's self-sustainment in that niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.671,
    "end": 2766.436,
    "text": "So at the individual level, in particular cases, one can clearly see certain actions that could classify as irrational to the extent that they",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.677,
    "end": 2780.267,
    "text": " are detrimental to its survival, but at the species level, it's more difficult to argue in that way because to identify this kind of behavior or consequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.108,
    "end": 2782.91,
    "text": "But I think that in order",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.096,
    "end": 2790.82,
    "text": " not to trivialize the idea of rationale and say, well, everything that is living is in fact rational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.58,
    "end": 2800.226,
    "text": "You'd have to identify this sort of particular acts that are detrimental to one's survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.587,
    "end": 2809.432,
    "text": "So in the case of the ant colony, I don't know, maybe welcoming invasors would be a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.595,
    "end": 2818.578,
    "text": " would be the sort of behavior that would be prejudicial to its survival as such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.418,
    "end": 2819.718,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.758,
    "end": 2822.899,
    "text": "I don't know if this is... It's one possible way of thinking about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.939,
    "end": 2826.221,
    "text": "I had to think more clearly, but I can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.041,
    "end": 2829.122,
    "text": "Well, very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.562,
    "end": 2834.624,
    "text": "And you brought in, in that answer and in the presentation, like multiple...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2835.618,
    "end": 2852.209,
    "text": " nested timescales, just like EcoEvoDevo does from a more biological perspective, looking at how niche construction bridges the gap between slower phylogenetic processes and more rapid developmental processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2853.91,
    "end": 2863.317,
    "text": "So how does this embedded and multi-scale consideration relate to the content",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.753,
    "end": 2880.331,
    "text": " concept like is content going to be localized in one body or is the content distributed across entities or is the rationality distributed across entities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.252,
    "end": 2885.196,
    "text": " How would we even identify the locus of rationality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2885.537,
    "end": 2892.264,
    "text": "And that also kind of invokes the horizontal and modular conception from the quote that you provided.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2892.685,
    "end": 2899.012,
    "text": "So how do we identify salient spatial temporal scales and systems of interest?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2901.206,
    "end": 2923.712,
    "text": " Well, I don't know if I can answer this fully, but it seems to me that at the level of... If we're talking about content, for instance, content as accuracy conditions for symbolic thoughts, I think, fortunately, we have to say that it's not localized in a single individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.432,
    "end": 2925.613,
    "text": " it's publicly shared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.693,
    "end": 2943.16,
    "text": "So you can say that one consequence of this is that it's possible to think of different patterns of reasoning that have been engaged in different sites at different times, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.86,
    "end": 2949.643,
    "text": "And you can see that, well, they develop different levels, different rules for content formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.503,
    "end": 2951.704,
    "text": "And I think this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.168,
    "end": 2973.974,
    "text": " plausible to say that content is is localized that the the uh how can you say is shared among the co-specifics of talking about content domination at least but as for rationality i think one could um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.285,
    "end": 2993.795,
    "text": " identify in particular behaviors if it fits this kind of description of being proficient interaction and adaptive interaction between an organism and its environment, its niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.675,
    "end": 2997.457,
    "text": "So probably we could",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.744,
    "end": 3004.127,
    "text": " We could give different answers here for rationality and content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.607,
    "end": 3014.735,
    "text": "I am willing to say that content recognition is not something that happens in the head, something that is out there, in a way, shared among others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.535,
    "end": 3027.564,
    "text": "And this is something that the philosopher of mind has, at least since the 60s, the philosophers of mind have been argued for the idea that content is externally individuated,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.386,
    "end": 3045.621,
    "text": " And I think it is one of the idea by, for instance, Hilary Putnam and Tyler Burch and others that mental content is individuated at the community level or societal level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.482,
    "end": 3052.748,
    "text": "But on the other hand, I think rationality could be, in principle, individuated in particular behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.544,
    "end": 3062.01,
    "text": " but it would depend on the individual's goals and the niche it inhabits and so on and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.031,
    "end": 3072.558,
    "text": "There are, of course, contextual variables here that might be important to identify behavior as rational or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.5,
    "end": 3076.321,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.941,
    "end": 3082.145,
    "text": "Well, one phrase that really stuck with me was like, know how, not know that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3083.547,
    "end": 3088.674,
    "text": " perhaps a basal point in your work and a focus on the action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.135,
    "end": 3099.289,
    "text": "So I just wanted to hear about how action and practice as you wove them here today, how are those terms addressed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3100.57,
    "end": 3122.183,
    "text": " and how are things different today with the treatment of action and practice and know-how not know that than say in the helm holdsian days or even in ancient or in world knowledge traditions so okay cool so the idea i think would be that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.073,
    "end": 3148.566,
    "text": " There is a tendency from, it is a tendency from a very modern philosophy, but it has been very influential in the first wave of cognitive science to think of perception as a capacity to categorize the environment and to offer a description of environmental aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.626,
    "end": 3153.089,
    "text": "So for instance, perceiving that the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.029,
    "end": 3164.695,
    "text": " I don't know, the curve is to my left, is a matter of knowing that there is a thing with such and such properties to my left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.735,
    "end": 3170.598,
    "text": "And this is a kind of know-that, a kind of propositional attitude towards the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.678,
    "end": 3178.722,
    "text": "So I think the interesting thing about an activism in ecological psychology as well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.771,
    "end": 3198.054,
    "text": " And to the extent that they recall American pragmatism from the beginning of the century is to think of perception as a matter of not categorizing disparate properties in the world, but as disclosing possibilities for acting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.562,
    "end": 3218.996,
    "text": " And this is something that if we were to explain that in terms of, in epistemic terms such as knowledge, we wouldn't put it as a matter of knowing that the cup is to my left, but knowing how to grab the cup and do whatever I want to do with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.096,
    "end": 3225.881,
    "text": "If I want to drink a cup of coffee or if I want to use it as a paperweight, it will have different silent properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.582,
    "end": 3227.823,
    "text": "And this is something that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.375,
    "end": 3250.231,
    "text": " Although it has been, I think, very, I think in activism in ecological psychology and other embodied views of cognition, have been largely successful in shifting this discussion to this point, I think in more traditional cognitive sciences, you still have the idea that, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.192,
    "end": 3257.473,
    "text": " organisms perceived by describing, in a way, the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.073,
    "end": 3277.117,
    "text": "This is something that I think more traditional readings of predictive processing make clear, as in the idea that you are inferring about the source of stimuli, and this is not, I mean,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.458,
    "end": 3296.403,
    "text": " This is more easily amenable to the idea that the brain or the cognitive system knows that the world is so-and-so, the environment is so-and-so, instead of saying that the cognitive system knows how to engage with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.463,
    "end": 3307.087,
    "text": "And I believe the point that an activist and ecological psychologist are trying to make is to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.506,
    "end": 3329.023,
    "text": " And also working on the predictive coding and the free energy principle, et cetera, is to show that these notions, these frameworks could be amenable to the idea that the cognitive system is knowing how to engage, it knows how to engage the environment in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.043,
    "end": 3332.206,
    "text": "It doesn't need to be read in a handballed same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.637,
    "end": 3337.278,
    "text": " that the system is inferring that the world is so-and-so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.158,
    "end": 3340.299,
    "text": "I think this is one way of putting it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.799,
    "end": 3354.902,
    "text": "But also, philosophically, you have a large, at the beginning of the last few decades, a gigantic discussion about whether no cloud could be reduced to no debt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.822,
    "end": 3359.143,
    "text": "And then again, you have a background of this and other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.199,
    "end": 3371.401,
    "text": " philosophical discussion about whether know-how could be treated as an independent notion from that and whether you could reduce one to the other and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.581,
    "end": 3375.462,
    "text": "So I think it doesn't stop there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3375.542,
    "end": 3387.305,
    "text": "You cannot, even though I can make a claim for perception as a mother, knowing how there is still the background issue of whether know-how could be treated as a know-that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.489,
    "end": 3392.768,
    "text": " and this is something that I am also working on recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.53,
    "end": 3397.971,
    "text": " There's a lot to say there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3398.591,
    "end": 3403.193,
    "text": "It's such an interesting idea, especially with linguistic communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3403.834,
    "end": 3410.697,
    "text": "It's a little bit like the finger and the moon and talking about the moon, but the finger is only where it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.817,
    "end": 3413.058,
    "text": "And we're not talking about the pointer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.118,
    "end": 3415.139,
    "text": "We're talking about the reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3416.26,
    "end": 3416.84,
    "text": "And so to use...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3419.952,
    "end": 3445.01,
    "text": " a socio-cognitive form of communication in cultured language or in written academic discourse to peer through that or to reimagine that and see even what seems to be like the pinnacle of know that and still see it as know how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3447.862,
    "end": 3456.28,
    "text": " guess the question there is how do we read papers yes of course yes i think it is uh it is a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.29,
    "end": 3476.001,
    "text": " At the very least, it seems to be a very big problem because if we try to treat these cognitive capacities, as you mentioned, as a matter of know-how, it seems that we still miss something about communication, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.941,
    "end": 3486.027,
    "text": "And on the other hand, I think, and this is a matter of intuition, but I think that we could, in principle, talk about how...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.508,
    "end": 3497.541,
    "text": " understanding what you just said and trying to respond to it is a matter of knowing how to behave linguistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.563,
    "end": 3502.249,
    "text": "But I think that even this movement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.308,
    "end": 3507.732,
    "text": " to treat high levels of cognition as ultimately a matter of know-how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.553,
    "end": 3510.115,
    "text": "It still leaves something out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.136,
    "end": 3516.181,
    "text": "I mean, personally, I am unpleased with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.421,
    "end": 3519.524,
    "text": "I think at some level we've got to say that, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.965,
    "end": 3529.053,
    "text": " another kind of approach that is needed here to explain how we communicate, for instance, in a very articulate manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.093,
    "end": 3534.258,
    "text": "Not to say that it does not involve a normal, but it's not just that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.239,
    "end": 3540.344,
    "text": "I think that at least more than practical knowledge is needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3541.459,
    "end": 3555.025,
    "text": " But maybe the key here is to think of practical knowledge as basic and necessary for other kinds of knowledge that are needed to engage in this sort of exchange.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3556.305,
    "end": 3559.106,
    "text": "Maybe this is one way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.207,
    "end": 3564.529,
    "text": "I'm sure that, well, more has to be...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.033,
    "end": 3593.09,
    "text": " said about this to give a more informative answer, but this is at least my current position is that know-how provides the basis of our engagement with the world and with others, but at some juncture we have to be able to develop other kinds of understanding to explain the complex sorts of exchanges we have in our daily lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3594.915,
    "end": 3596.496,
    "text": " such as reading papers, as you said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.638,
    "end": 3599.038,
    "text": "I agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.058,
    "end": 3609.926,
    "text": "I think framing know-that as the basis and then recovering know-how is a challenge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.607,
    "end": 3617.752,
    "text": "And it's also a challenge to begin with the basal cognitive processes as being enacted know-hows",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3618.653,
    "end": 3643.872,
    "text": " And to reassemble those know-how pieces into know-that, again, it's not necessarily even a simple challenge, but would we rather confront the challenge of assembling symbolic, propositional, declarative, verbal, et cetera, cognitive processes from a more liminal, ecological, cognitive approach",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3644.973,
    "end": 3650.915,
    "text": " or try to recover the ecological from the Turing machine, in a sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3651.155,
    "end": 3665.159,
    "text": "So it seems like you're speaking in support of grounding in ecological, plausible basal cognitive processes and then working towards assembling the skyscraper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3667.239,
    "end": 3667.92,
    "text": "Yes, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.98,
    "end": 3668.56,
    "text": "Yeah, totally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.58,
    "end": 3668.82,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.84,
    "end": 3672.221,
    "text": "I think it's well, both are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.47,
    "end": 3690.733,
    "text": " Both approaches are difficult to assemble, as you said, to provide this sort of explanation, either bottom-up or top-down, but I am more favorable, of course, to the bottom-up approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.773,
    "end": 3703.096,
    "text": "I think it also, for another reason, it seems to, the point of departure seems to be a biological description of how we interact with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3703.696,
    "end": 3714.48,
    "text": " And the other way around, it seems to be much more difficult to explain how we come up with these biological questions, such as our body morphology and such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.0,
    "end": 3729.186,
    "text": "It seems that we have to first account for that, and then we get to the other questions, which are also hard to answer, but at the very least, I think it's a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.948,
    "end": 3734.809,
    "text": " the bottom-up approach is more integrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.289,
    "end": 3740.79,
    "text": "The chances are, it seems to be more in our favor in this sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.45,
    "end": 3755.873,
    "text": "And the way you just kind of framed it made me think that if you were to program a computer from scratch, it could be an abstract or a virtual computer, so it doesn't even need to have a specific embodiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3757.043,
    "end": 3779.371,
    "text": " And in that situation, one might be concerned with assembling know that, assert that, and assembling these declarative statements and logic processes into something that is more dynamical or interacting with the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3779.411,
    "end": 3782.972,
    "text": "However, that process of like full stack engineering",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3784.056,
    "end": 3790.382,
    "text": " with logic and silicone at the base is quite different from how we got here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3791.263,
    "end": 3794.526,
    "text": "And so it might, but it's complimentary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3795.967,
    "end": 3803.715,
    "text": "Well, you gave a little visibility into, I guess, the before, during and after of peer review.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3804.355,
    "end": 3807.158,
    "text": "So I was just curious what,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3808.533,
    "end": 3836.768,
    "text": " changed during and after the paper like over the last months or years or however long it was how did you evolve on this and then what do you see as relevant next steps whether they're for you or just general to be done are we looking for a brain measurement are we looking for a video camera in a forest are we looking for a conceptual advance what is going to move forward past your developments",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3838.567,
    "end": 3839.988,
    "text": " That's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3840.028,
    "end": 3849.916,
    "text": "I think I'm not completely satisfied with the way I argued for in the paper at the conceptual level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3850.657,
    "end": 3860.325,
    "text": "I don't know if any of this would be carried out in... I honestly don't know if it could, in principle, be carried out in other empirical terms, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.435,
    "end": 3869.098,
    "text": " I would write it a bit differently today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.459,
    "end": 3875.565,
    "text": "Not that I disagree with the paper originally, but I think I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.783,
    "end": 3884.626,
    "text": " There's some points that I would like to reframe, but they do not authorize, I think, yet a new paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.706,
    "end": 3888.087,
    "text": "But maybe in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3888.547,
    "end": 3901.852,
    "text": "But this is something that the questions such as the myth of Eve, which is still a philosophical question and a conceptual one, they still bother me, but I have yet to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.91,
    "end": 3907.051,
    "text": " to find the opportunity to develop these ideas more carefully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.091,
    "end": 3913.513,
    "text": "And the general view I put forth there, I think it still stands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.954,
    "end": 3927.097,
    "text": "But I would like, I still, I'm waiting for this chance to elaborate it further and see how far I can get, but I don't know yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.318,
    "end": 3931.499,
    "text": "I must admit, I don't know what are the future developments of this idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3932.244,
    "end": 3941.35,
    "text": " But I've been working on several isolated issues on this approach for the last few years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.45,
    "end": 3950.156,
    "text": "I've worked with the notion of information and scientific understanding and information for ecological and activists of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.697,
    "end": 3959.263,
    "text": "And recently, I am working more recently with a few colleagues on virtual reality and perception and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.11,
    "end": 3978.725,
    "text": " This is how I like to conduct my research, to find interesting questions and see how can I deal with them, but not necessarily find myself tied to one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.313,
    "end": 3981.694,
    "text": " One line of reasoning, by the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.174,
    "end": 3985.616,
    "text": "So this is what happened at the time I was working with rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.916,
    "end": 3994.882,
    "text": "I thought it was a very cool subject and I still think it is, but I haven't had the time to come back and reframe what I wanted to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.582,
    "end": 4001.026,
    "text": "But maybe sometime in the near future, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.846,
    "end": 4018.701,
    "text": " But the most recent thing I've been working on does not involve necessarily rationality, but I think some parallels could be drawn, which is that of virtual reality and how does virtual reality actually compares to cognition, because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.782,
    "end": 4026.665,
    "text": " Well, there's obviously something missing from perceiving in a virtual environment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.546,
    "end": 4043.333,
    "text": "There is, of course, if I'm on a virtual environment where I am under a kind of threat, I may feel something analogous to fear, but I'm not really fearing for my life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4044.381,
    "end": 4047.582,
    "text": " And immersion does that to the person on the virtual reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.642,
    "end": 4055.465,
    "text": "So is it rational to run away from that threat, that virtual threat and so on and so forth?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.485,
    "end": 4062.167,
    "text": "This is what I'm working on and maybe it provides a point of return to this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.023,
    "end": 4066.306,
    "text": " idea of radically inactive rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.007,
    "end": 4070.852,
    "text": "And in fact, the paper just got accepted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4070.972,
    "end": 4081.065,
    "text": "So as I was telling you before, I was so busy these last few days because we were correcting proofs, my colleagues and I, Nara Figueiredo and Guilherme Vasconcelos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.606,
    "end": 4093.171,
    "text": " And I was with a tight schedule to submit the corrected version of the paper in the last few weeks, and then I got the proof.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.248,
    "end": 4114.45,
    "text": " Well, maybe in the future I can come back to the issue of rationality, I'd like to, but I don't know if I... I don't know, I really can't foresee the developments of that, but in general I still agree with my original idea, but I'll frame it differently a little bit today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.263,
    "end": 4127.133,
    "text": " So the VR point, I'm sure there's a lot more to say there, but it reminded me of just the title, virtual reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4127.273,
    "end": 4128.294,
    "text": "It's a virtualization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4128.894,
    "end": 4133.198,
    "text": "And so in the same way that cognitive action planning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4134.153,
    "end": 4142.697,
    "text": " allows us to entertain policies that our body doesn't take, if only to evaluate them and choose against them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.317,
    "end": 4156.223,
    "text": "But we can go on a flight of fancy, have a whimsical policy selection process of counterfactuals mentally, but then our morphology is kind of like our lifeline.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4156.763,
    "end": 4159.705,
    "text": "If you actually fall off a ledge, then it's going to hurt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4160.365,
    "end": 4162.686,
    "text": "And then in virtual reality,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4164.045,
    "end": 4175.089,
    "text": " your embodied perceptual experience is quite literally a virtualization of survival critical situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4175.669,
    "end": 4179.391,
    "text": "So you might see yourself as being on a ledge, but you're on a flat floor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4180.871,
    "end": 4192.796,
    "text": "And then in that situation, if you're kind of a cognitive observer outside of the video game, you might say, well, it's rational for me just to fall off to see what happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4193.72,
    "end": 4197.503,
    "text": " So that's like, but then there's a layer of rationality within the space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4197.523,
    "end": 4200.765,
    "text": "It's like, what's a good move in the game?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4202.986,
    "end": 4211.753,
    "text": "And so it's kind of blurring the line between, it's blurring the criticality of the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4212.273,
    "end": 4216.476,
    "text": "And I'm sure you've thought about this much more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4216.536,
    "end": 4222.24,
    "text": "So how does this play into our virtual reality with the ways we think about and use and design these systems?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4223.507,
    "end": 4241.994,
    "text": " Well, the questions that motivated us to write a paper, Nada, Guilherme and I, was that in the technical literature, you see that a lot of researchers working with VR treat virtual perception as illusory, a kind of illusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.864,
    "end": 4250.209,
    "text": " But we were a bit bothered by that because on the other hand, it only works in VR because we embody the devices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.85,
    "end": 4253.071,
    "text": "Devices, they work for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.331,
    "end": 4256.794,
    "text": "You have the controllers, you have the headset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.774,
    "end": 4265.22,
    "text": "And it seems so weird to say that the user is under a kind of illusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.04,
    "end": 4281.165,
    "text": " And on the other hand, it seems that it's not actually cognition, because as you said, there is no biological relevance to those cognitive states, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.845,
    "end": 4290.908,
    "text": "For instance, if I see an apple in VR, it does not afford nourishing, but it makes sense within the game, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.388,
    "end": 4295.19,
    "text": "But it's different when I perceive an apple in VR.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.092,
    "end": 4312.029,
    "text": " an actual environment it is it affords nourishment it is something i can eat but not in vr i can pretend to so we coined this uh concept of illusion to explain uh it is as if we were",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.93,
    "end": 4333.205,
    "text": " face in an actual level but it involves also this volition of play this idea that we are not being misled because we put on the equipment we know we are in the game and this i think is a hot subject right now because there's metaphors and i am very skeptical of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.991,
    "end": 4346.188,
    "text": " whatever that can... People are very optimistic about the possibilities of the metaverse, and some authors really think that we could be in a simulation, strictly speaking, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.185,
    "end": 4357.216,
    "text": " I mean, the current technology shows us that it's very limited and you can pretend to be in a certain environment and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.796,
    "end": 4366.385,
    "text": "And this, I think, may offer new ways of thinking about rationality in this virtual environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.076,
    "end": 4372.137,
    "text": " in ways that may be rational to do something that environment has said to jump off the ledge and see what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.057,
    "end": 4384.6,
    "text": "And on the other hand, behavior aspects of doing so, sometimes people actually feel fear and people, for instance, treat phobias with virtual realities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.581,
    "end": 4394.843,
    "text": "And it's a lot of, there's a lot of interesting questions there that maybe, I mean, for future research,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.0,
    "end": 4405.447,
    "text": " It made me think about how the apple in real life, it could be calories for you, but also it could be calories for a fly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4405.827,
    "end": 4406.708,
    "text": "It could be thrown.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4406.768,
    "end": 4407.949,
    "text": "You could use it as a hammer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4408.33,
    "end": 4409.031,
    "text": "You could paint it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4409.351,
    "end": 4418.56,
    "text": "So ecology and the generative process, as we'd say in active inference, kind of is always going beyond that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4420.006,
    "end": 4444.706,
    "text": " whatever affordances were programmed in for a given object and then also um the current discourse on vr focuses heavily on headsets just speaking totally anecdotally not not my expert area um it seems a little bit interesting it's like as if the mobile phone discussion was only focused on rectangles of a certain size",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.317,
    "end": 4449.639,
    "text": " what makes this not virtual reality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4449.899,
    "end": 4454.002,
    "text": "It's like looking through a window and there's another fellow to speak with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4454.782,
    "end": 4456.103,
    "text": "So it's not attached to my head.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4456.143,
    "end": 4473.514,
    "text": "It doesn't have some of the motion tracking capacities that some technologies have, but it is a niche modification in peripersonal space and we can push signals and affordances to each other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4475.33,
    "end": 4497.138,
    "text": " so having a vr framing or really just a framing of rationality and perception cognition action cycles that aren't just constrained to one specific realization or hardware type and could run the gamut from total offline",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4498.237,
    "end": 4506.809,
    "text": " person in a field to somebody who's very in the matrix seems pretty relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4506.869,
    "end": 4514.16,
    "text": "Otherwise new technologies, even little variants and software updates will continue to just infinitely surprise and confuse",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4516.977,
    "end": 4523.14,
    "text": " Yeah, I think it's hard to define the boundaries of virtual reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.181,
    "end": 4531.525,
    "text": "I mean, we are here in an exchange which I think it could in principle be classified as a form of virtual reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.545,
    "end": 4533.907,
    "text": "Of course, I'm seeing you're on your sea mind, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4535.548,
    "end": 4546.894,
    "text": " I mean, most, I think, works nowadays, they define it ad hoc by saying that, well, must have a headset and sometimes a controller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.735,
    "end": 4549.496,
    "text": "But other than that, it's not virtual reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.596,
    "end": 4552.457,
    "text": "But yeah, it's hard to define, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.577,
    "end": 4563.544,
    "text": "It's not as straightforward as one would think because on talking commercially, of course, virtual reality means headsets and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.389,
    "end": 4584.722,
    "text": " and other paraphernalia, but... But a phone, just talking on the phone or a telegraph in that time, it would have been on that interface with that sensory modality and with those affordances, it is the virtualization that we have access to of just a different chapter today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4585.973,
    "end": 4586.994,
    "text": " Yeah, I think so, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.355,
    "end": 4595.866,
    "text": "Part of our paper was to argue that, in a way, embodying technological devices is obviously not new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4596.466,
    "end": 4597.968,
    "text": "It is the mark of being human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4598.843,
    "end": 4606.668,
    "text": " It's embodying technological device that what makes us what we are since the beginning using lithic technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.709,
    "end": 4628.623,
    "text": "And the fact that we can embody so proficiently a device, even if it is programmed to, for instance, within virtual reality to have something, a creature, you control a creature with new morphology, another morphology, for instance, even if that's the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4629.303,
    "end": 4633.184,
    "text": " It only happens so proficiently because we are able to embody the device.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.665,
    "end": 4646.869,
    "text": "Some experiments have shown that you can map, for instance, a twist of your wrist to a third arm that in virtual reality goes out from your chest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.549,
    "end": 4657.433,
    "text": "And people can learn to control this third arm that doesn't map into actual morphology, but it can be made to do so by a twist of the wrist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.8,
    "end": 4665.985,
    "text": " This is something we discussed in our paper that, well, you can only do that because you embody the device.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.105,
    "end": 4667.626,
    "text": "You can't say it's an illusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.487,
    "end": 4675.552,
    "text": "It's actually, well, part of what means being human is to embody technological devices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.572,
    "end": 4679.715,
    "text": "So I would go that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4679.895,
    "end": 4686.56,
    "text": "I mean, I know it blurs the distinction between virtual and non-virtual, but I think that's one way of dealing with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4688.951,
    "end": 4689.171,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4689.511,
    "end": 4693.953,
    "text": "Is there anything else you want to talk about, ask, or just kind of prelude?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4695.394,
    "end": 4699.336,
    "text": "Well, I'd like to thank you for the opportunity to discuss this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.376,
    "end": 4700.896,
    "text": "It was very nice for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4701.056,
    "end": 4701.977,
    "text": "I really enjoyed it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.077,
    "end": 4707.86,
    "text": "And this is a very nice and comfortable environment to discuss these issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4708.46,
    "end": 4710.421,
    "text": "And thank you once again, Dan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.061,
    "end": 4711.361,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4711.401,
    "end": 4711.661,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4712.061,
    "end": 4715.023,
    "text": "Awesome discussion and important topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4715.083,
    "end": 4717.604,
    "text": "And we'll be happy to talk to you again anytime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4718.797,
    "end": 4719.039,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4719.2,
    "end": 4719.562,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4720.328,
    "end": 4720.67,
    "text": "Farewell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4720.831,
    "end": 4721.113,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  }
]