[
  {
    "start": 10.24,
    "end": 10.561,
    "text": " Hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.023,
    "end": 12.343,
    "text": "Welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.866,
    "end": 22.961,
    "text": "It is June 26th, 2025, and we are live in Active Inference Guest Stream 113.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.343,
    "end": 25.365,
    "text": "Welcome, Jack, as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.286,
    "end": 36.062,
    "text": "We are with Sergio Jaques, and we will be discussing Bayesian mechanics of economic choice, computational foundations of economic behavior,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.042,
    "end": 39.313,
    "text": " There will be a presentation followed by a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.855,
    "end": 43.909,
    "text": "So thank you again for joining and looking forward to the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.399,
    "end": 48.441,
    "text": " Thank you for joining, Jack.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.042,
    "end": 53.991,
    "text": "And thank you for the Active Inference community for inviting me to share my current research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 54.873,
    "end": 57.317,
    "text": "As Daniel said, I am Samuel or Sergio.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 57.497,
    "end": 58.078,
    "text": "I have both names.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.98,
    "end": 60.823,
    "text": "I am residing in Mexico City.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 61.004,
    "end": 65.512,
    "text": "I am a second year PhD candidate in artificial intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 65.552,
    "end": 70.521,
    "text": "And my current research basically focuses on applying the Active Inference framework",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 70.501,
    "end": 73.546,
    "text": " to understand economic choice and financial decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.688,
    "end": 85.407,
    "text": "Just to notice that this is joint work with Ernesto Moya, PhD, my thesis supervisor, and Luis Alberto Quesada, PhD as well, which are two Mexican academics as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 86.069,
    "end": 89.134,
    "text": "Well, let's begin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 90.312,
    "end": 113.4,
    "text": " basically i'm going to be speaking a lot about this paper that we recently published but i'm also going to give you a brief introduction about the main things that we're trying to bring together which are basically topics from neuroeconomics topics naturally from basin mechanics and the active influence framework and topics from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 113.38,
    "end": 135.203,
    "text": " classical or neoclassical economics and psychology so we're given that we are trying to merge all of those fields and as you probably know here in the community the free energy principle is very interdisciplinary itself so i think i would take some time to explain the intellectual journey of these different fields and how we think they nicely come together",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.183,
    "end": 157.174,
    "text": " So we'll start with economics, then we would move to how psychology meets economics, then a little bit of the thermodynamics of information, both for neuroeconomics and active inference, and then how the divisive normalization model from neuroeconomics can be derived formally from the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 157.154,
    "end": 161.761,
    "text": " So that's the basic or the key insight from our paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 162.342,
    "end": 170.876,
    "text": "And finally, I'll share some of the future directions for the future work that we intend to do for this year or the end of this year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 171.216,
    "end": 171.978,
    "text": "So let's start.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.52,
    "end": 180.411,
    "text": "So I would like to start by sharing the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.779,
    "end": 189.492,
    "text": " let's say the intellectual journey of how economists usually think about valuation and about encoding value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 190.133,
    "end": 193.738,
    "text": "So let's start with a Swiss mathematician, Daniel Bernoulli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 194.519,
    "end": 206.517,
    "text": "And as you probably know, he's very well known for creating classical utility theory or expect or classical expected utility theory, which basically said that that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.172,
    "end": 213.607,
    "text": " Economic agents or people don't encode absolute monetary values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 213.828,
    "end": 216.174,
    "text": "We don't encode absolute monetary values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 216.214,
    "end": 218.74,
    "text": "We encode what he called moral value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 219.201,
    "end": 222.97,
    "text": "And moral value was just a way of saying subjective value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.95,
    "end": 241.633,
    "text": " so monetary values are i mean are subjective on how much we want something on the time we are on the on the place we are so basically that's what he formalized and he formalized it as a weighted sum of expected probabilities and payoffs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.968,
    "end": 258.137,
    "text": " Now, later on, very famously, when Neumann and Morgenstern published their famous work, Theory of Games and Economic Behavior, where many of you listening probably have heard it because that was the foundation of game theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 258.117,
    "end": 273.139,
    "text": " But one key insight was that when they published this work, they just expanded Bernoulli's expected utility theory to account for the specific axioms that economic agents should abide to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 273.119,
    "end": 281.658,
    "text": " in order to be what we usually came to refer to as rational, to make rational decisions or rational choices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 282.199,
    "end": 290.858,
    "text": "So these axioms were that our decisions should be complete, they should be transitive, and this is very, very important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.838,
    "end": 307.412,
    "text": " when i prefer a to b and b to c uh we should follow this this this ordinal uh property and our choices should be value independent independent of the other choices independent of past choices so that was another another choice",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 307.392,
    "end": 323.371,
    "text": " And if our rational agent or our economic agent abides by these axioms, the key point here is that what naturally follows and can be derived mathematically is that this agent would be maximizing its expected utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.491,
    "end": 331.02,
    "text": "And this is key because this is another way, for example, in the active inference slang or language that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 331.0,
    "end": 349.954,
    "text": " this economic agent would be pursuing a goal so it's another way of saying it it's going to be focused on goal directedness so so just keep that in mind and we will see how that impacts us later so this this framework uh basically impacted",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 349.934,
    "end": 364.956,
    "text": " all of neoclassical economics and modern economic development and another key aspect of von neumann and morganston's theory is that they thought of the probabilities of events and the payoffs as objective so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 364.936,
    "end": 367.561,
    "text": " What do we refer with that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 368.022,
    "end": 375.797,
    "text": "For example, if we are going to roll a die, we know the exact probabilities and we can compute them exactly, analytically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 376.198,
    "end": 385.375,
    "text": "So that's pretty much what they meant, that we know the objective probabilities of specific economic outcomes and we know the payoffs in advance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 385.355,
    "end": 396.164,
    "text": " However, naturally, you can start thinking that that's rarely the case, with the exception of, for example, specific random games or casino-like games.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 396.966,
    "end": 400.596,
    "text": "Later on, Paul Samuelson, which",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 400.576,
    "end": 412.532,
    "text": " probably one of the, let's say, leading figures in economics, in your case in economics, came to say that we really don't know the preferences of economic agents or economic agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.233,
    "end": 416.358,
    "text": "I mean, we cannot get inside their brains to know their preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.818,
    "end": 430.397,
    "text": "So in his paper, Consumption Theory, in terms of revealed preference, he basically said, we cannot know the preferences in advance, but we can observe their choices and infer their preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 430.377,
    "end": 438.869,
    "text": " So that was the first type of a bit of Bayesian approach to economic decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 439.21,
    "end": 452.048,
    "text": "But later on, Leonard Savage, or better known as Jimmy Savage, famously published the Foundations of Statistics in the 1950s, where he established subjective expected utility theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 452.028,
    "end": 460.476,
    "text": " meaning that he established that we definitely don't know the preferences in advance and we don't know the objective probabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.836,
    "end": 465.301,
    "text": "The only thing we have is beliefs, beliefs like in the active inference framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 465.601,
    "end": 468.203,
    "text": "So those beliefs are subjective probabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.804,
    "end": 477.652,
    "text": "However, one important aspect here is that even though he established that we will have these beliefs and these objective probabilities, these would be a normative theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 477.973,
    "end": 481.596,
    "text": "So normative theory is a way for economists to say rational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 481.576,
    "end": 511.212,
    "text": " because many many people not coming not acquainted with the theory of economics uh hear rational and they just think of i don't know like captain spock or something like that so when we say rational we really say normative and what we refer to is that the economic agent is making logically consistent choices abiding by these axioms transitivity independence uh completeness and we can also add continuity all right so that's basically how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.9,
    "end": 517.606,
    "text": " rational choice theory evolved from its beginning and pretty much up to nowadays.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 517.646,
    "end": 520.358,
    "text": "Now, then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 521.772,
    "end": 530.483,
    "text": " many, many other researchers and economists came to say, all right, so that's the theory, but let's observe how do people actually behave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.923,
    "end": 536.21,
    "text": "So let's build a descriptive theory, not a normative theory of how people should behave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.01,
    "end": 542.397,
    "text": "And the first key figure in this story, it's Maurice Alai.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.377,
    "end": 556.335,
    "text": " uh which was a french economist uh he also was a nobel laureate in economics and he came up what later became known for uh as that the allied paradox so the allied paradox basically said that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 557.243,
    "end": 572.687,
    "text": " many sophisticated decision makers including leading economists like jimmy savage consistently violated the independence axiom that we just referred to so so what what did that mean that basically meant that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.667,
    "end": 585.459,
    "text": " when facing different choices and rearranging the menu of choices or the opportunity set of choices, even Nobel laureate economists didn't abide by the independence axiom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.779,
    "end": 601.054,
    "text": "So that was one of the first, let's say, empirical validations that the axioms of rational choice theory were consistently violated, even by the people that came up or that developed a theory for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 601.034,
    "end": 607.442,
    "text": " Later on, and most famously, Kahneman and Tversky introduced psychology into economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 607.482,
    "end": 611.026,
    "text": "So that was the point where psychology formally met economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 611.587,
    "end": 618.695,
    "text": "And they came up with a formal descriptive theory, which was later called prospect theory in the 1980s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 619.977,
    "end": 622.62,
    "text": "So basically, prospect theory was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 623.444,
    "end": 627.812,
    "text": " an empirical theory contrary to the previous theories, which were mainly theoretical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 628.554,
    "end": 633.583,
    "text": "And they literally observed how people make economic decisions on their uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 634.164,
    "end": 640.356,
    "text": "And they came up with the graph here that we have in the right-hand side corner,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.336,
    "end": 643.0,
    "text": " which you can see that has a sigmoid function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.4,
    "end": 649.269,
    "text": "So let's contrast that function with a classic utility theory function from Bernoulli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 649.689,
    "end": 660.825,
    "text": "So you can see that for the classic utility function from Bernoulli is basically explaining what we usually learn about in Economics 101, which is diminishing marginal returns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 660.805,
    "end": 663.188,
    "text": " we experience diminishing marginal returns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 663.449,
    "end": 666.353,
    "text": "That's a basic utility function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.834,
    "end": 673.083,
    "text": "But what Kahneman and Tversky find out was that that was not how people behave in reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.504,
    "end": 680.133,
    "text": "They observed that they behave like this with this utility function, which is this sigmoid shape utility function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 680.714,
    "end": 686.763,
    "text": "And the key aspect of this utility function is that there's a discontinuity between gains and losses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.184,
    "end": 689.547,
    "text": "They more or less found that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 689.527,
    "end": 710.826,
    "text": " uh people read or the brain registers with twice the intensity losses to gains so that was a key key insight and a key violation of traditional rational choice axioms uh so we can speak about a discontinuity between gains and losses uh and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 711.262,
    "end": 721.832,
    "text": " Popularly, this theory came to be known as the, let's say, irrational argument for economic behavior or economic decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.633,
    "end": 738.788,
    "text": "But the thing was that many economists pushed back against this and many other decision scientists pushed back against this because this theory essentially said people behave and take irrational decisions very often.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 738.768,
    "end": 740.471,
    "text": " They are subject to biases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.911,
    "end": 745.819,
    "text": "They take a lot of their decisions with heuristics that make them fall into traps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 746.38,
    "end": 750.387,
    "text": "So essentially, it was saying that people are not very smart.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 750.447,
    "end": 752.029,
    "text": "People are idiots, even.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 752.65,
    "end": 754.313,
    "text": "So that's what they said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 754.293,
    "end": 775.44,
    "text": " Now, later on, Richard Thaler and Loewenstein and other relevant figures who will also would be well in the case of Richard Thaler was also awarded the Nobel laureate in economics, pretty much imported prospect theory formally into economics and established what we now know as a field of behavioral economics, which is accounting for these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 775.42,
    "end": 791.978,
    "text": " uh biases and heuristics into economic decision making and pretty much checking how consistently these biases and heuristics make us violate the traditional axioms of neoclassical economics however however",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.835,
    "end": 803.62,
    "text": " They, I mean, everything was like Paul Samuelson said, we infer the preferences, we infer what is happening in the brain by observing behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 803.98,
    "end": 808.17,
    "text": "It was still not a neurophysiological theory or anything like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.711,
    "end": 811.738,
    "text": "So that was pretty much how we have been",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.718,
    "end": 832.495,
    "text": " uh evolving now let's move let's switch breaks and let's move to some other things happening specifically in computational neuroscience so in computational neuroscience more or less in the same along the same time there were a lot of very interesting discoveries so famously simon laughlin's 1981 study",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.475,
    "end": 852.002,
    "text": " of fly photoreceptor neurons demonstrated that the optimal computation on their constraints on their energy constraints would be one that looked like this where where the fly or in this case that the flies neurons photoreceptors would spend more on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.982,
    "end": 858.049,
    "text": " representational resources on the parts that were more common or more likely to appear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.53,
    "end": 877.473,
    "text": "Meaning that, for example, for certain light intensity that was more common to appear in its environment, the fly or the flight photoreceptor neurons would encode those, would give a higher probability of encoding that level of light more often than very rare events in its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.493,
    "end": 881.938,
    "text": "So basically what we are seeing is that the fly photoreceptors are mapping",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 882.357,
    "end": 891.23,
    "text": " the environmental statistics in order to optimize or to compress the amount of limited energy it has in its brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.691,
    "end": 895.056,
    "text": "So as we know, neural computation is very expensive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.496,
    "end": 904.77,
    "text": "The brain, even though it's only more or less 2% of the body's weight, it uses about a fifth of the body's energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.75,
    "end": 915.362,
    "text": " So naturally, that means that it's very metabolically costly, and it needs to be very, very efficient on using that energy for its representational capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 915.923,
    "end": 929.458,
    "text": "And also, we can bring evolution and adaptiveness to the mix because naturally, the fly, as long as it performs this type of action and other type of actions better, is going to be able to survive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 930.479,
    "end": 934.183,
    "text": "I mean, it's just going to be able to adapt",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.163,
    "end": 936.03,
    "text": " more optically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.05,
    "end": 945.844,
    "text": "Then we can also introduce Landauer's principle from Rolf Landauer, who said, decreasing stochasticity in choices decreases information entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.55,
    "end": 954.361,
    "text": " and layer the famous InfoMax principle, which says the brain optimizes mutual information between output and input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 954.381,
    "end": 967.68,
    "text": "So that basically said, we have, for example, for the fly, the fly has an unlimited number of pixels or the stimuli that it has to encode, but it has a very limited",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 967.66,
    "end": 995.524,
    "text": " input capacity so it has to compress that and it compresses that by assigning different weights and assigning higher probabilities to the in this case the light intensities that that came that came up more often and when we take the integral of that function we can see that we're going to see this sigmoidal this sigmoidal shape or the sigmoidal cdf so just remember that because that's going to come up later",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 997.732,
    "end": 998.059,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 998.63,
    "end": 999.895,
    "text": "So how can we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.769,
    "end": 1005.456,
    "text": " take these insights and bring them back to economic decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.997,
    "end": 1029.831,
    "text": "So if we assume what rational choice theory said to us, that we essentially make decisions with uniform precision, we don't have information asymmetries, as neoclassical economics said, then what that means in terms of information processing is that neoclassical economies like von Neumann and Morgenstern assumed that there was no cost",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1029.811,
    "end": 1045.288,
    "text": " in representation so and we can translate that uh geometrically as uniform precision and you can see as you can see in the graph so without depending on the reward magnitude the fine rate is going to increase just linearly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.64,
    "end": 1047.762,
    "text": " However, the reality is very different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1048.143,
    "end": 1059.554,
    "text": "The reality is that if we put some noise into the mix and the noise is represented by that gray area, you can see that the reward magnitude by adding just a little noise is going to be huge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1060.155,
    "end": 1060.855,
    "text": "It's going to be huge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1061.476,
    "end": 1063.418,
    "text": "So it can be 20 or it can be 40.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1063.538,
    "end": 1064.259,
    "text": "So it's huge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1064.859,
    "end": 1070.685,
    "text": "So what this means in terms of Laughlin's fly experiment is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1071.188,
    "end": 1091.492,
    "text": " assuming that this was the brain how the brain was encoding value the brain would be very wasteful on encoding all of the possible rewards at the same at the same rate or at the same probability so that would be very wasteful in terms of energy for the brain so the reality as we came to know is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1091.472,
    "end": 1100.662,
    "text": " that the optimal way of allocating energy resources for the brain is to allocate them for those events that came up more likely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1100.902,
    "end": 1103.265,
    "text": "So that's a key aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1103.285,
    "end": 1117.84,
    "text": "Now, another important thing is that this also tells us that the violations commonly discovered by Alai, Kahneman, Tversky, and other behavioral economists perhaps weren't actually violations to rational choice theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.04,
    "end": 1120.703,
    "text": "Perhaps rational choice theory was wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.683,
    "end": 1132.583,
    "text": " And in reality, those decisions are in fact optimal, are in fact normative, but normative under the assumptions that we have thermodynamic constraints, that we have a limited representational capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1132.944,
    "end": 1142.1,
    "text": "So if we assume that we have those limits on representation, then those decisions become rational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1142.12,
    "end": 1142.32,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.076,
    "end": 1147.302,
    "text": " So then how should value be represented in the brain?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1147.943,
    "end": 1158.378,
    "text": "Let's remember from Barlow's efficient coding hypothesis, neural systems evolve to maximize information transmission while minimizing metabolic cost.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1158.398,
    "end": 1162.384,
    "text": "So let's see the sigmoidal curve in the panel C.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1162.364,
    "end": 1166.329,
    "text": " So that's basically the sigmoid function that we just showed you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.849,
    "end": 1178.583,
    "text": "And notice that it's remarkably similar to the value function that Kenem and Tversky discovered through the behavioral experiments, the very well-known loss aversion sigmoidal function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.324,
    "end": 1189.215,
    "text": "And also notice that the optimal precision allocation produced a curve that is a reference-dependent response function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1189.195,
    "end": 1216.772,
    "text": " um so basically what what this means is that what behavioral economies interpret as cognitive biases might actually be uh an optimal representation or an optimal computation of the brain of value under biological constraints so basically we can see that notice the what i just told you the gray area if we assume uniform precision in the lower right hand side corner in b",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1216.752,
    "end": 1220.356,
    "text": " the noise made that the reward magnitude was huge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1220.536,
    "end": 1224.221,
    "text": "So the amount of energy expenditure is going to be huge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.241,
    "end": 1235.994,
    "text": "However, if we assume the sigmoidal function, which that would be the function that we would get as we saw with Laughlin's under thermodynamic constraints, the noise is very small.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1236.235,
    "end": 1238.157,
    "text": "The reward magnitude is very small.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1238.677,
    "end": 1245.325,
    "text": "So that's basically the evidence or the, yeah, I mean, the demonstration that the brain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1245.305,
    "end": 1250.742,
    "text": " is very efficient when using that sigmoidal shape instead of using that uniform shape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.86,
    "end": 1257.205,
    "text": " All right, now moving to neuroeconomics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.926,
    "end": 1265.937,
    "text": "Basically, neuroeconomics arise mainly from combining neuroscience, psychology, and economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.538,
    "end": 1274.589,
    "text": "And one of the leading figures I'm going to tell you about, well, some of the leading figures, let's start with David Hager.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1275.03,
    "end": 1283.682,
    "text": "David Hager, which was, if I remember correctly, at NYU, came up with other authors like Simon Shelley and Carandini.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1283.662,
    "end": 1287.008,
    "text": " with the famously divisive normalization model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1287.549,
    "end": 1289.171,
    "text": "So what is divisive normalization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.632,
    "end": 1303.375,
    "text": "So divisive normalization is basically a computational algorithm that the brain uses to, well, originally it was used to explain how the brain or how the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1303.355,
    "end": 1307.639,
    "text": " that V1 primary visual cortex encode the visual information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1308.08,
    "end": 1324.136,
    "text": "So basically, if we look into the graph, what Higer and colleagues pretty much found is that neurons in the retina basically encode information, but they don't encode it, as we saw with Laughlin's, equally or uniformly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1324.677,
    "end": 1331.944,
    "text": "What they do is that they divide the specific input or the excitatory input that we want to see",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1331.924,
    "end": 1361.779,
    "text": " it divides them by that pool of surrounding neurons so so by dividing them by the that pool of surrounding activity of of neurons what it's basically doing is it's subtracting it's taking out that redundant information so that's pretty much what it's doing when dividing it by that by those surrounding neurons so that makes the again that makes the the brain or in this case the neurons in the retina much more effective and much more efficient",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1361.759,
    "end": 1375.974,
    "text": " And if we see how the value encoding looks like, so we can see that the graph in the right looks pretty much the same as Laughlin's graph for fly photoreceptors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1376.756,
    "end": 1377.658,
    "text": "Later on,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1378.145,
    "end": 1392.458,
    "text": " other neuroeconomists came to see that that divisive normalization algorithm not only worked for accounting for information in the primary visual cortex, it also worked for olfactory information, for sound,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.775,
    "end": 1396.462,
    "text": " and also for encoding value in the posterior parietal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.103,
    "end": 1409.046,
    "text": "So basically, what later came to be known is that it appears that device normalization is a canonical neural computation and not only for vision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1409.549,
    "end": 1418.099,
    "text": " And later on, Louis, Ken Louis, showed that value representations in the brain can be well-described via divisive normalizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1418.779,
    "end": 1435.438,
    "text": "Also by this time, neuroeconomists have founded the main brain areas that are probably responsible for the main activities of encoding value, specifically the ventromedial prefrontal cortex and the striatum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1435.418,
    "end": 1450.98,
    "text": " So even though there are other brain areas that also play a role, for example, the amygdala lines of cases and the like, the ventromedial prefrontal cortex and the striatum definitely have been shown to be the key areas involving value representation in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1451.534,
    "end": 1473.103,
    "text": " Now, later on, Paul Glitchmer here, which is also a professor at NYU, he actually directs the Neural Institute at NYU, came to, I mean, just kept working on this work also with David Hager and pretty much imported divisive normalization from neuroscience, from vision neuroscience into economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.083,
    "end": 1485.503,
    "text": " And later, with joint work with Timula, which is now, I think, in Australia or in Israel, later they published their work on expected subjective value theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.844,
    "end": 1491.533,
    "text": "Now, notice that subjective value theory looks a lot like Savage's subjective value theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1491.553,
    "end": 1495.88,
    "text": "But this is a neuroscience-based subjective value theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.94,
    "end": 1500.407,
    "text": "So even though it looks a little the same, it's not the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1500.387,
    "end": 1512.338,
    "text": " so basically they he established he took this device normalization model and established that and he used this formula to say that the brain can basically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1513.567,
    "end": 1518.996,
    "text": " well, that value representation in the brain can be shown to follow this exact formula.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.437,
    "end": 1532.74,
    "text": "So what this formula is saying is subjective value, SD, is dependent on the excitatory value, the value that I'm trying to evaluate or the payoff, divided by a fixed constant,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.293,
    "end": 1544.028,
    "text": " plus what we call the payoff expectation, which is the normalization factor, which in the case of vision neuroscience was the sum activity of the pool of neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1544.389,
    "end": 1549.035,
    "text": "But in an economic interpretation, it could be the alternative options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1549.055,
    "end": 1554.703,
    "text": "So if we have a menu of economic options, it will be the average sum of those options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.144,
    "end": 1557.968,
    "text": "If we are speaking about intertemporal choice,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.948,
    "end": 1563.326,
    "text": " it could be the weighted average of those payoffs across time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.667,
    "end": 1566.557,
    "text": "So basically, again, what we are saying is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1568.005,
    "end": 1572.633,
    "text": " is that the value representation in the brain is context dependent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1572.653,
    "end": 1580.988,
    "text": "So what this model is basically bringing to economics is context modulation, context modulation in economic decision making in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1581.669,
    "end": 1589.102,
    "text": "And I mean, just for you to know, in the standard divisive normalization model, Higer used usually FR,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1589.082,
    "end": 1593.534,
    "text": " instead of ST to represent that ST can be interpreted as neuronal firing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1593.815,
    "end": 1600.573,
    "text": "So it's literally a neurophysiological model for economic value representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1602.218,
    "end": 1603.982,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1604.002,
    "end": 1604.965,
    "text": "Now, moving on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1606.126,
    "end": 1610.97,
    "text": " If we dig deeper into the model, we can see that it has two key parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1611.11,
    "end": 1623.882,
    "text": "It has alpha and M. So what alpha is in this type of model, it's considered a free parameter, but in an economic context, it can be considered, for example, the risk tolerance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.823,
    "end": 1632.169,
    "text": "Because that parameter alpha controls the shape or the curvature of the function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1632.51,
    "end": 1636.133,
    "text": "So notice that if we increase alpha,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1636.433,
    "end": 1656.636,
    "text": " we get pretty much in the in in panel a we get bernoulli's utility function the same function that daniel bernoulli discovered like 200 years ago if we increase alpha we get that's that type of shape and then if we decrease it a bit we get kahneman taversky sigmoidal function",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.616,
    "end": 1669.033,
    "text": " So the key aspect here is that this model is a more general model because it allows us to account for different utility functions that have come up in both neoclassical economics and behavioral economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1669.394,
    "end": 1671.199,
    "text": "But again, this is a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1672.512,
    "end": 1692.715,
    "text": " neuroscientific neurophysiological representation uh it just happens to look like neoclassical and behavioral economics and also for m which again is the pay of expectation uh what it does is that it moves the the mean the center of the of the of the utility function so we can move it by increasing m",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1692.695,
    "end": 1714.973,
    "text": " And what that means in terms of Bayesian decision-making is that depending on my experience, on past outcomes, on my past preferences, that's going to shape, that's going to move the shape or the center point of my objective value utility function, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.496,
    "end": 1716.576,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.935,
    "end": 1723.421,
    "text": " Now, moving on into the active inference framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1723.501,
    "end": 1730.691,
    "text": "I mean, this is going to be pretty familiar to many people here listening to a talk in the community.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1731.172,
    "end": 1746.293,
    "text": "But for those maybe not so well acquainted with the free energy principle, we can trace back, let's say, the intellectual origins of the free energy principle to Helmholtz, who basically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1747.302,
    "end": 1772.517,
    "text": " discover that that we have as we have as individual unconscious inference and this might might sound very similar to what paul samuelson said that we cannot look inside brains to see what preference of people the people have that was pretty much at the same time i think but he was speaking about neurophysiological processes later on hinton and mumford uh came up with the first energy-based models",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.497,
    "end": 1776.862,
    "text": " which later became very famous, for example, with the Boltzmann machine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1777.643,
    "end": 1786.795,
    "text": "And those were the very first models that were energy-based and that considered hidden or latent variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1787.315,
    "end": 1789.098,
    "text": "So that's a key aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1789.678,
    "end": 1793.543,
    "text": "And specifically, Moonforth came up with the Bayesian approach to vision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1793.995,
    "end": 1816.999,
    "text": " Later on, predictive coding with Rao and Ballard, pretty much, or predictive processing, laid out the ground for later on Professor Friston to come up with a free energy principle and its, let's say, practical framework, which is the active inference framework, and later on with Bayesian mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1817.3,
    "end": 1828.877,
    "text": " So the key aspect here is that we can regard economic choices essentially as predictions about future outcomes or beliefs about states on their uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1829.237,
    "end": 1834.785,
    "text": "Because even if we are going to make an economic decision in the present,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1834.765,
    "end": 1860.199,
    "text": " we're gonna see we're gonna think about future outcomes about how much would we like this chocolate this coffee what if i spend my salary in this or that how is going to impact that on my finances so almost all economic choices naturally inevitably have to do about how to do with the future and have some uncertainty embedded in them now",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1861.883,
    "end": 1871.493,
    "text": " For those who maybe are not acquainted with the free energy principle, but for those who are, I think it's never wasteful to go again to explain it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1871.934,
    "end": 1889.713,
    "text": "So basically, what the free energy principle claims or says is that if we observe that things exist, if something persists over time and its identity can be re-identifiable in the environment, it has a given structure, then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1890.436,
    "end": 1900.701,
    "text": " It must be true that it must encode or instantiate a statistical model of its environment, or we can call it a generative model, an internal model of its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1901.443,
    "end": 1904.57,
    "text": "There we have the famous free energy principle formula.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1904.991,
    "end": 1906.555,
    "text": "And the key aspect here is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.535,
    "end": 1909.101,
    "text": " the free energy principle has two aspects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1909.642,
    "end": 1921.911,
    "text": "It has an accuracy term, which basically that could be rendered as we're going to see later as the expected utility in economics, expected utility theory, the log evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1921.891,
    "end": 1925.917,
    "text": " And that's basically how accurate are my predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.457,
    "end": 1929.201,
    "text": "I wanted to have the most accurate predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1929.562,
    "end": 1933.447,
    "text": "So that's basically the reward in terms of reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1933.467,
    "end": 1940.757,
    "text": "And in terms of the complexity term, the complexity terms brings into the model an entropic term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1941.278,
    "end": 1943.741,
    "text": "So what does entropy bring into the model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.881,
    "end": 1945.283,
    "text": "It brings flexibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1945.263,
    "end": 1967.575,
    "text": " it brings flexibility for example in the economic context flexibility for preferences we have to we want to be flexible in our preference because we have uncertainty in the world so perhaps now i like something but later i will not like that and i would prefer x to y so basically the model can account for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1967.555,
    "end": 1978.088,
    "text": " for biases that were regarded in behavioral economics, like intransitive decisions or just flexibility in preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1978.237,
    "end": 1992.237,
    "text": " Now, the question would be, does the expected values theory that uses the devising normalization model from neuroeconomics can emerge from the perceptual inference part of the free energy principle?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.617,
    "end": 1994.7,
    "text": "So that's the question that we are asking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.361,
    "end": 2000.368,
    "text": "And why specifically the perceptual inference in the perception action cycle of the free energy principle?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.769,
    "end": 2002.371,
    "text": "Because even though",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2003.212,
    "end": 2019.448,
    "text": " active inference is well the active part or the action the action part of the cycle is very important because when we have references we have preferred outcomes we're going to be looking for information we're going to engage in information gathering activities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2019.428,
    "end": 2024.357,
    "text": " However, the initial value representation in the brain is going to be perceptual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.697,
    "end": 2025.619,
    "text": "It's going to be perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2026.08,
    "end": 2031.89,
    "text": "So we can say that if the model exists, it's going to be living in the perceptual inference section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.411,
    "end": 2038.602,
    "text": "And later on, we can add the information gathering aspect through the action component in the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2040.742,
    "end": 2049.357,
    "text": " So as we mentioned, what active inference does is that it assumes that agents, and in this case, economic agents, are not passive observers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2049.838,
    "end": 2058.312,
    "text": "They're going to look to fulfill their preferences, their outcomes, and to have better information to make better economic choices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2058.292,
    "end": 2074.956,
    "text": " Now, as we just saw, if we take out the complexity or the entropic term from the free energy principle, what we get is just the expected log probability of our preferred outcomes that can be more or less approximated by the expected utility in economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.376,
    "end": 2084.89,
    "text": "So that formula, that expected utility in economics, was basically what von Neumann and Morgenstern formulated almost 100 years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.87,
    "end": 2098.05,
    "text": " So basically, if we think about this model in an economic context, what we call preferences in economics can be regarded as prior beliefs or preference distributions under the free energy framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2098.07,
    "end": 2098.913,
    "text": "Now,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2099.112,
    "end": 2099.894,
    "text": " What is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2100.034,
    "end": 2103.844,
    "text": "I mean, how is active inference useful for economics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2104.445,
    "end": 2115.433,
    "text": "Well, the first thing is that it can unify the epistemic value or the information gathering aspect of economic behavior or strategic behavior and decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2116.139,
    "end": 2120.986,
    "text": " Also, as I just mentioned, epistemic versus pragmatic actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2121.667,
    "end": 2130.318,
    "text": "So, I mean, economic agents and strategic agents need to evaluate the cost of gathering information versus increasing their position.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2130.619,
    "end": 2135.285,
    "text": "So again, as we mentioned, having a limited precision is not viable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2136.046,
    "end": 2137.388,
    "text": "Having more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2137.368,
    "end": 2141.856,
    "text": " well, less stochastic or less noisy decisions is costly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2142.196,
    "end": 2146.344,
    "text": "So we need to evaluate the cost or just weight the cost of those decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2146.965,
    "end": 2160.388,
    "text": "And finally, as we also know, there's a lot of research coming out on the free energy principle and active inference applications to artificial intelligence systems that this framework allows us to track back",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2160.368,
    "end": 2167.855,
    "text": " all of the specific decisions and all of the specific preferences and pretty much all of the parameters in the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2168.256,
    "end": 2173.261,
    "text": "So contrary to other machine learning techniques like neural networks, this is not a black box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.281,
    "end": 2180.468,
    "text": "This is a transparent model that allows us to trace back every decision made in the model to the specific parameters of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2180.828,
    "end": 2189.937,
    "text": "So it's a very transparent and explainable decision system if implemented specifically in an AI system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.148,
    "end": 2210.507,
    "text": " all right so moving on to the key uh key let's say contribution of the paper so what we just we just uh we showed is that if we if you start from the free energy principle and expect free energy you can derive from that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2210.943,
    "end": 2216.895,
    "text": " the divisive normalization model as assumed by the expected subjective value theory of Klinschmer and Timula.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2217.596,
    "end": 2230.622,
    "text": "And basically, if you do all of the math, you can get to the free energy minimization and get M, like the internal model or the mean on their perceptual inference,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.041,
    "end": 2232.063,
    "text": " as that formula.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.484,
    "end": 2247.49,
    "text": "And we can see in the lower box that that formula and each component of the formula can be mapped directly to the expected subjective value theory or the divisive normalization model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2247.911,
    "end": 2254.483,
    "text": "So what the lemma says is under a hierarchical generative model with Gaussian priors and likelihoods,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.463,
    "end": 2263.598,
    "text": " perceptual inference through the free energy principle converges to our representation, which is that representation there, which is equivalent to divisive normalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2263.959,
    "end": 2265.621,
    "text": "So what is going on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.922,
    "end": 2276.319,
    "text": "As we said, the upper part of the model is basically the predicted value, the excitatory value that we are trying to encode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.78,
    "end": 2280.606,
    "text": "And we are dividing it by a baseline plus",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.586,
    "end": 2286.715,
    "text": " weighted average, which in this case is a precision weighted prediction error minimization term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.735,
    "end": 2294.686,
    "text": "And again, what we are doing is we are subtracting, we are taking out all of the irrelevant information that we already know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.926,
    "end": 2299.292,
    "text": "We already know from our experience, from past outcomes, or we just don't care.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.352,
    "end": 2300.474,
    "text": "It's irrelevant information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2300.574,
    "end": 2309.226,
    "text": "So we are taking it out by making that division in order to just focus on the specific value that we are trying to encode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.206,
    "end": 2329.965,
    "text": " so in short what we are doing is that we can show that the free energy principles allows us to account for context-dependent economic decisions and also reference-dependent economic decisions as posited by behavioral economic theory but in this case again is not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2330.502,
    "end": 2353.084,
    "text": " a bias in is not a heuristics per se is actually an optimal decision it's a normative model so in the case of uh of the economic uh let's say language this is a rational model of economic decision making but it's rational by assuming thermodynamic constraints uh so in that sense it becomes rational",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2353.064,
    "end": 2379.156,
    "text": " so we're really we're really excited about it about this because what it says is that from neuroscience we can derive some of the let's say of the the the oldest paradigms in economic theory but we can test them and validate them both mathematically in this case but also empirically because i didn't mention that but the divisive normalization algorithm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2379.136,
    "end": 2404.705,
    "text": " has been tested empirically in humans and in non-human animals as well from I don't know like monkeys and I think even bees so basically we can see that the device normalization model is a very robust model and as many people in the community here in the activist community know the free energy principle as well can be mapped into a neural process theory so moving into that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2405.478,
    "end": 2425.542,
    "text": " Basically, the future directions of our work is that we want to operationalize this work into the practical version of the active inference framework, which is into a graph, into a partially observable mark of decision process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2425.582,
    "end": 2431.89,
    "text": "Basically, what we want to build is an agent that makes economic or financial decisions in the market.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.36,
    "end": 2441.04,
    "text": " And how is this model better than, for example, a transformer type of architecture that does this type of economic decision making?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2441.641,
    "end": 2446.673,
    "text": "Number one, it's the traceability, as we just mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2446.754,
    "end": 2467.642,
    "text": " When we use transformer-like architectures or neural network architectures for things like financial decision-making or things like health decision-making, it's very sensible because we cannot really account for what the model is doing or how the model is coming up with its output.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.662,
    "end": 2474.01,
    "text": "In this case, with this type of graph in focus, we can have traceability of the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2473.99,
    "end": 2476.113,
    "text": " Number two, everything is explicit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2476.494,
    "end": 2478.156,
    "text": "All of the parameters are explicit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2478.857,
    "end": 2479.879,
    "text": "So that's another thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.259,
    "end": 2487.59,
    "text": "We can, for example, make beta and gamma and the rest of the parameters very, very explicit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2487.65,
    "end": 2491.215,
    "text": "For example, we can use gamma as investor confidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2491.235,
    "end": 2494.4,
    "text": "We can use beta as decision uncertainty in the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.941,
    "end": 2501.23,
    "text": "And finally, we can use the Bayesian update belief equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.21,
    "end": 2523.808,
    "text": " who account for adaptive learning because naturally when you become an investor or for any other type of economic decision setting you learn as we just mentioned you learn about past outcomes if you have bad outcomes while investing you usually become more conservative uh your risk tolerance changes your priority and financial objectives change with time so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2523.788,
    "end": 2532.377,
    "text": " So basically, this model also allows us to have that flexibility for how the agent is adapting in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.717,
    "end": 2545.951,
    "text": "So basically, this is a future work that we're currently building, and we hope to have empiric results perhaps later this year or at the beginning of 2026.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.252,
    "end": 2551.197,
    "text": "So this is pretty much the future work we're working on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.615,
    "end": 2555.12,
    "text": " And yeah, and that's pretty much the end of the talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2555.942,
    "end": 2557.965,
    "text": "We'll open up the space for questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2558.426,
    "end": 2559.087,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2559.227,
    "end": 2561.43,
    "text": "And here's my contact and my LinkedIn as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2561.871,
    "end": 2566.478,
    "text": "If anybody listening wants to add me or contact me, I'm all ears.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2566.859,
    "end": 2567.459,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2567.54,
    "end": 2569.402,
    "text": "And thank you to all for listening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2571.926,
    "end": 2572.367,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.507,
    "end": 2573.148,
    "text": "Very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.292,
    "end": 2575.632,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.164,
    "end": 2581.089,
    "text": " Well, those watching live can write a question in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.09,
    "end": 2584.113,
    "text": "Let us begin with Jack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.273,
    "end": 2590.821,
    "text": "Would you like to say hello and give any initial reflection or a question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.841,
    "end": 2591.141,
    "text": "Hey there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.161,
    "end": 2601.014,
    "text": "Yeah, I mean, I really find it fascinating that what we might consider biases in a lot of economics kind of turn out to be optimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.597,
    "end": 2604.538,
    "text": "You know, one thing I...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.413,
    "end": 2624.907,
    "text": " want to understand more is why is it important that you can derive some of these up-to-date economics models from active inference like what does that say that they are so related um and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.237,
    "end": 2654.657,
    "text": " it natural to think that they would be like when you set out you think maybe like maybe this won't work like tell me a bit more about the fact that they are so related yeah well i think that um a long-standing inspiration in the economics field is to make economics as scientific as possible within the social sciences so historically economics imported a lot of things from physics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2654.637,
    "end": 2664.974,
    "text": " like thermodynamic equilibrium and many other things, just precisely trying to make it as scientific as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2665.335,
    "end": 2680.78,
    "text": "But what happened is that it became highly technical and highly mathematical, but always assuming that economic agents behave as if, so theoretically, so just like a highly theoretical field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2680.76,
    "end": 2700.672,
    "text": " So what happened initially with behavioral economics, and I think can happen now with neuroeconomics and by importing tools like the free energy principle or methods, is that we can make economic theory, we can validate or we can test economic theory in real life experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.995,
    "end": 2705.299,
    "text": "Or in my case, also mathematically,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2705.279,
    "end": 2708.382,
    "text": " but mathematically like the Pythagorean theorem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.542,
    "end": 2715.51,
    "text": "I mean, even though we can demonstrate the Pythagorean theorem mathematically, we can also test it in reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2715.53,
    "end": 2728.483,
    "text": "What happened with economic theories is that we prove them mathematically, assuming certain very implausible axioms, and later we just said, well, it's demonstrated, but assuming those axioms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2728.943,
    "end": 2731.506,
    "text": "So what this allows us to do is to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.486,
    "end": 2760.463,
    "text": " prove it mathematically as well but by accounting for a in this case for a narrow process theory that can be testable in uh in empirically so that I think that that's a key a key insight and in this case a free energy principle uh I mean if we as myself and I think of many people listening in the community assume I I don't know I mean I don't want to use the the word true but it's a very good model to explain how uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2760.882,
    "end": 2784.173,
    "text": " to explain self-organization and how things exist if we think that that's a very useful model then it should apply to this as well so that i think that's another thing on the second part of the question thank you i'll ask a question then jack you can you can go again or i'll read one live chat so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.524,
    "end": 2805.874,
    "text": " does this help us think about the microeconomic macroeconomic relationship like what what do we get from this cognitive approach or from bayesian statistical approaches that might connect those two differently than how they're understood to be connected now yeah yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.58,
    "end": 2823.07,
    "text": " I mean, a recent trend that I think has been going on in the last decade perhaps in just standard economics is that there has been, let's say, I mean, let's just say that macroeconomics has,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2823.607,
    "end": 2824.908,
    "text": " has decreased in popularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2825.329,
    "end": 2834.919,
    "text": "So for example, famously, MIT is no longer requiring to take microeconomics as a mandatory course, even within the economics major.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2835.359,
    "end": 2847.732,
    "text": "So that tells you that, in a sense, we are migrating to, yeah, I mean, just to explain economic in the individual level and then trying to go up to add them up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2848.272,
    "end": 2851.015,
    "text": "So I mean, at least from my perspective,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.754,
    "end": 2862.433,
    "text": " The future of macroeconomics, and again, that's my personal opinion, would be starting with these type of empirically grounded microeconomic models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2863.274,
    "end": 2875.956,
    "text": "So we can regard these type of approaches like a microeconomic model, and then moving it up in a microeconomic setting, but relying on complex systems, in complex adaptive systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2875.936,
    "end": 2883.851,
    "text": " So in that sense, again, I think that the pre-energy principle blends very nicely with that type of approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2883.871,
    "end": 2887.157,
    "text": "So that would be my opinion on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2895.533,
    "end": 2896.054,
    "text": "Go ahead, Jack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.7,
    "end": 2921.097,
    "text": " maybe I have a more general question and it might not be answerable by you but I wonder why biology would be so optimal um I guess um because you know when economists do experimental research and they find oh maybe people have biases and stuff maybe maybe that makes sense like why would we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.667,
    "end": 2944.485,
    "text": " be optimal but then kind of what you're saying is well we are optimal given the constraints that we have the fact that we're biological and we don't have infinite energy and things like this so um i don't know if that's a question but more a comment of um i just don't understand too much about biology and like how optimal is it given the constraints that we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.718,
    "end": 2957.293,
    "text": " Well, I mean, what I would, I mean, I think Daniel is very quick to answer that, but what I would say about that is, for example, the other day I was reading a paper from Maxwell Ramstead and he said that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2958.623,
    "end": 2965.735,
    "text": " that we can regard the free energy principle as a sort of generalization of the second law of thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.937,
    "end": 2975.772,
    "text": "So in that sense, what we could say is that for things to exist and not to dissipate, they need to be extremely effective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2975.752,
    "end": 2997.878,
    "text": " so it's very i mean just for the loss of physics is very unlikely for very complex systems like us and brains like us to exist who came to be and to and to actually i mean kept existing it's very unlikely so in that sense i think that uh i mean we can regard uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2997.858,
    "end": 3020.524,
    "text": " our structure our this decision making systems i mean just how we function as very optimal given the the the unlikelihood of us to to exist uh specifically given that the complexity that i mean the complexity of our structure so that would be my claim but but but surely i'm not a biologist so i don't know daniel if you have something to say about that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3021.415,
    "end": 3021.756,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.377,
    "end": 3040.251,
    "text": "So that history you told of the decision-making and the way that that was great as a non-economist, and it reminded me of optimal foraging theory, where sort of a simple version of optimal foraging theory would be like, how much...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.231,
    "end": 3060.906,
    "text": " resources are being obtained per unit time then once you start to bring in different trade-offs like water loss or the costs of movement you start to get closer and closer to empiricism and then the sort of death blow to that just seeds per minute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.886,
    "end": 3079.654,
    "text": " measurement is the subjectivity of beliefs like well there's predation risk so you could ask is this behavior optimal given predation risk but then in a way when you get to the subjectivity of predation risk",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.545,
    "end": 3085.473,
    "text": " That's like kind of asking, well, is this an optimal investment strategy given the volatility profile?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.813,
    "end": 3087.496,
    "text": "And it may or may not be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.556,
    "end": 3091.302,
    "text": "There may be a better performing trade strategy given a market condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.023,
    "end": 3101.237,
    "text": "But in a way, once you get to subjectivity, which is the sort of nucleus of decision-making, you get to that tautology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.504,
    "end": 3105.273,
    "text": " which is like, well, they're acting as if these are the conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.293,
    "end": 3111.929,
    "text": "So given their subjective evaluation, they are acting in this Bayes optimal way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.61,
    "end": 3117.522,
    "text": "And so in a way that sort of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.594,
    "end": 3142.311,
    "text": " fake out almost like oh it's rational but that's so much of the debate that at least i've heard from afar is this debate what is rationality are are people in their decision making rational or not and it's like when we're doing bayes optimal modeling even if it's going to be a pathological state it's like there's something about the parameterization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.747,
    "end": 3146.514,
    "text": " where it is optimal for this repetitive behavior to arise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.215,
    "end": 3158.875,
    "text": "It's not that everyone around this person or the person themselves wants to be having this thought or action per se, but optimal doesn't mean that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.175,
    "end": 3164.084,
    "text": "It means like the ball is at the bottom of the bowl, but the bowl shape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.164,
    "end": 3168.231,
    "text": "So it's like the starting point for Bayes optimal modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.599,
    "end": 3198.218,
    "text": " is that by taking constraints into account including interior constraints subjective constraints and evaluations then it's tautological and not really an account to say that it's optimal it's just sort of things are how they are and all the work goes into structuring and doing the inference on what those constraints are and so it's like the framework says less about what's optimal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.788,
    "end": 3223.75,
    "text": " but it lets us look at traders with a variety of portfolios and say we're already going to take it as a granted that they are acting in their own base optimal way so what is the structure and the parameterization that enables that and in that way feels like it moves forward not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.489,
    "end": 3246.126,
    "text": " trying to imagine a time before there was this debate of rational or irrational, but just as you structured the presentation, moving to a place where we can empirically ask, what are those objective and subjective constraints that make decision-making actors act the way they act?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.73,
    "end": 3252.894,
    "text": " You're in the AI program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.495,
    "end": 3256.742,
    "text": "So just how did that come to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3257.463,
    "end": 3263.474,
    "text": "And how did you come to this economics topic in that program?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3264.276,
    "end": 3264.516,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.378,
    "end": 3271.59,
    "text": "Basically, my background originally is in finance or let's say financial economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3271.57,
    "end": 3275.935,
    "text": " I later pursued graduate studies in engineering mathematics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3276.896,
    "end": 3285.705,
    "text": "And while at that, I did my thesis on complex adaptive systems or complex systems engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.887,
    "end": 3291.712,
    "text": "And that inevitably or eventually led me to active inference on the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3292.733,
    "end": 3298.219,
    "text": "And at the same time, well, when I became very excited about that, like, I don't know, like three, four years ago,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3298.199,
    "end": 3305.374,
    "text": " I also pursued the graduate studies in psychology and focused on mathematical psychology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3305.795,
    "end": 3311.647,
    "text": "So that was like the natural bridge for me to go into the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3312.148,
    "end": 3314.352,
    "text": "So later when thinking about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3314.332,
    "end": 3341.841,
    "text": " what field I wanted to pursue for my PhD I thought well I mean usually economists are very I don't know I don't know why but they usually work like a lot in silos I mean they work on things like I don't know like law and political science and sociology but not so much in other areas like I don't know like not not so much in technology and stuff like that usually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3341.821,
    "end": 3367.12,
    "text": " uh also in finance i mean they just don't work in these type of things uh and in psychology i mean we i didn't have a i mean at least here in mexico we didn't have we i don't think we have a very strong mathematical psychology program so the only place i thought i could merge decision sciences cognitive science and and my interest in economics was in ai",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3368.146,
    "end": 3382.877,
    "text": " And given that the recent literature, or I mean, I don't know, the last five years, the literature that has been coming up about applying the active inference framework for practical applications, I don't know, like inverses and stuff like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3383.418,
    "end": 3387.507,
    "text": "I just thought that that was like the perfect route for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3387.527,
    "end": 3388.99,
    "text": "So that's pretty much the story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.539,
    "end": 3409.797,
    "text": " which economic actors or firms would have a different day-to-day experience how if these kinds of relationships were better understood well i think that for example on the type of agent i am i intend to develop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3410.3,
    "end": 3438.214,
    "text": " one one reason why i mean i don't know if you you have a different opinion but uh i haven't seen many ai agents for economic advisory i mean there's some there's some there's some robo advisors but they're very let's say very simple uh and again the reason why they're they're very simple i think is that it has been proven and it has been tested that llms cannot plan",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3438.852,
    "end": 3467.307,
    "text": " so for example the other day i was listening to a talk from professor carl friston and he said that at least for him an agent for it to be an agent needs to be able to plan so i i completely share that insight so if he if it could mean if it has been proven that llms cannot plan then at least for me they are not very useful for financial advisory because the key for financial advisory is financial planning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3467.675,
    "end": 3481.718,
    "text": " So in that sense, I think that looking for other type of architectures, in this case, the partially observable market position process that is proposed by the Active Influence Framework, could be better for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3481.758,
    "end": 3484.603,
    "text": "I mean, just for the fact that it can plan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3484.583,
    "end": 3508.633,
    "text": " and second because it's explainable and as i was saying a key aspect also about or the key disadvantage of using transformer-like architecture for some sort of financial advisory is that it's not explainable so if somebody loses all of their savings so what's going to be the explanation or just hallucinated or something like that so i think that that's a practical application",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3517.507,
    "end": 3531.201,
    "text": " There will be some very interesting economic arenas and futures with all these different kinds of agents making different belief updating and policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.422,
    "end": 3533.943,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3533.963,
    "end": 3535.145,
    "text": "Yeah, policy selection as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3537.987,
    "end": 3540.27,
    "text": "Jack, do you have anything else you want to ask?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.875,
    "end": 3546.636,
    "text": "No, not really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.358,
    "end": 3547.778,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.199,
    "end": 3549.96,
    "text": "It was really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3549.98,
    "end": 3553.643,
    "text": "So what else will you do in your PhD?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.945,
    "end": 3559.529,
    "text": "Hypothetically, where would you like to take in the second half of the PhD?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.79,
    "end": 3571.659,
    "text": "Well, basically, finish building this agent and hopefully get to test it with real people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3572.52,
    "end": 3576.083,
    "text": "So that would be my intent for the next couple of years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3578.729,
    "end": 3580.271,
    "text": " Anything else you want to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.912,
    "end": 3594.445,
    "text": "Well, just again, if somebody wants to get in contact for, I don't know, any type of research, opportunity, collaboration, or anything, there's my email, my academic email, and my LinkedIn profile as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3595.045,
    "end": 3597.187,
    "text": "So happy to collaborate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3598.408,
    "end": 3598.509,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.529,
    "end": 3602.513,
    "text": "Well, thank you again for the very cool presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3603.594,
    "end": 3604.174,
    "text": "Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.474,
    "end": 3605.035,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.055,
    "end": 3605.155,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.636,
    "end": 3606.196,
    "text": "Until next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.376,
    "end": 3606.677,
    "text": "See you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.917,
    "end": 3607.317,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3607.998,
    "end": 3608.078,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]