[
  {
    "start": 1.67,
    "end": 4.171,
    "text": " Hello, it's March 1st, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.332,
    "end": 10.474,
    "text": "We're in cohort two of the Pardal textbook group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.514,
    "end": 17.177,
    "text": "We're in meeting 18, our first discussion on chapter eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.958,
    "end": 29.982,
    "text": "First, Michael, if you wanted to just raise the context or question that you wanted to begin with, and we'll just pick up there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.844,
    "end": 40.264,
    "text": " You're on mute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.284,
    "end": 41.165,
    "text": "I'm not sure if you're asking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.969,
    "end": 47.35,
    "text": "Sorry, my microphone was off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.43,
    "end": 47.65,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.171,
    "end": 48.411,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.051,
    "end": 58.959,
    "text": "So the map territory fallacy, I was wondering what this is and whether you could perhaps elaborate a little bit on that fallacy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 60.661,
    "end": 60.981,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.755,
    "end": 70.659,
    "text": " I'm moving it to chapter 9, even though we're in chapter 8, because we're going to bring in a figure from chapter 9.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.779,
    "end": 77.283,
    "text": "Ali, do you want to give a first thought on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.724,
    "end": 80.184,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.225,
    "end": 89.269,
    "text": "Actually, map territory fallacy is one of the fallacies that is widely used to somehow...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.007,
    "end": 119.553,
    "text": " somehow criticize free energy principle because as the concept may the name of the concept may suggest some believe that it's a kind of fallacy to somehow conflate the map with the territory so by this I mean that free energy principle claims that well we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.615,
    "end": 130.441,
    "text": " So very informally, we have a map of the principle or the theory or whatever, and the territory that it applies to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.581,
    "end": 133.803,
    "text": "So the system or the agent that we're trying to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 134.383,
    "end": 150.113,
    "text": "But on the other hand, by claiming that the system or the agent actually does the kind of inference that recovers the map itself,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.456,
    "end": 161.559,
    "text": " Some people believe that this kind of conflation that map converts into territory or the vice versa is a fallacious claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.38,
    "end": 165.141,
    "text": "So we need to separate map from the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.541,
    "end": 170.222,
    "text": "But in this recent paper on the map territory fallacy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.297,
    "end": 179.281,
    "text": " Ramstead et al argued that actually this is not a fallacy at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.881,
    "end": 185.145,
    "text": "It is the structure of the FEP theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.205,
    "end": 197.113,
    "text": "So in other words, we're well aware that there is a kind of inference as if epistemology happening here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.133,
    "end": 198.374,
    "text": "So yeah, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.212,
    "end": 202.773,
    "text": " It's a bit more extensive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.833,
    "end": 214.776,
    "text": "They have lined up some number of arguments to defuse this map territory fallacy fallacy and why it's not fallacious at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.777,
    "end": 220.318,
    "text": "So yeah, that's basically the gist of it, in my opinion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.146,
    "end": 226.51,
    "text": " Does it have to do with a distinction between model and process?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.29,
    "end": 235.297,
    "text": "And the model is the, maybe the model is the map and the, no, the other way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.417,
    "end": 241.141,
    "text": "The process is the map and the model in the external world, I understand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 242.102,
    "end": 245.505,
    "text": "No, the external world is the, what is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.605,
    "end": 249.228,
    "text": "Process is the external world and the model is the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.383,
    "end": 254.585,
    "text": " I mean the generative model of the agent itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.605,
    "end": 278.756,
    "text": "It definitely relates to that but on the other hand it also relates to this concept of self-evidencing which is a way to describe the mechanism by which the model in the environment or let's say the agent in the environment models itself according to the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.469,
    "end": 280.51,
    "text": " generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 280.63,
    "end": 287.676,
    "text": "So it's a kind of, as the name suggests, a self referential way of modeling the system in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.779,
    "end": 297.583,
    "text": "Yes, it's definitely a roller coaster, and not a resolved one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.584,
    "end": 300.505,
    "text": "But still, we can look to some of these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.82,
    "end": 329.191,
    "text": " key recent works so the map territory fallacy would be just like it's been since the classical Borges writing this realization like the map is not the territory kind of related like all models are useful or some models are useful but none are true like correlation is not causation this sort of broad space of aphorisms that's basically like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.839,
    "end": 358.077,
    "text": " instrumentalism isn't realism as we might say it so that's the map territory fallacy would be making the fallacy that the map is the territory i made a linear regression between cancer and heart disease ergo they are actually causal that way and when we're using active inference framework one might be slightly more tempted than the linear regression",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.229,
    "end": 372.039,
    "text": " to say, well, because I've generated a model that has a structure that seems to articulate certain natural things, this is like an explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.96,
    "end": 374.081,
    "text": "It might even have predictive power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.861,
    "end": 380.846,
    "text": "And so that might lead somebody to make this kind of a fallacy that the map is the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.469,
    "end": 387.271,
    "text": "Then Ramstead et al have kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.965,
    "end": 416.625,
    "text": " agreed and amplified which is saying actually when when you use the map territory fallacy to criticize the kind of cognitive modeling in the fep and bayesian mechanics you're acting fallaciously and there's several angles on that unpack more in the paper one angle is you might be um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.85,
    "end": 433.243,
    "text": " chopping off more than you want to like you may realize it or not your critique may extend to simply all quantitative modeling and many people want to like excise fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.394,
    "end": 444.178,
    "text": " from the space of scientific modeling in good graces, but then they don't wanna, for example, dismantle the architecture of using statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.098,
    "end": 462.826,
    "text": "So that's one angle, which is like, if you actually seek out the root of your descent with this kind of cognitive modeling, you're gonna be cutting off a lot of what is just understood to be statistical modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.44,
    "end": 474.424,
    "text": " So it's like, you've gone so far into denying the map territory relationship that you've actually biopsied more than just the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.225,
    "end": 490.091,
    "text": "And then they go further, which is that several features of the FEP make it the ideal model of generic systems in statistical physics, which is a bit of an abstract statement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.231,
    "end": 491.892,
    "text": "So we can bring it back to the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.004,
    "end": 514.503,
    "text": " with figure 9.1, which just as Michael brought up, this came up in the PAR recent book stream with PAR, where we asked what was happening in this figure and had some discussion on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.704,
    "end": 519.908,
    "text": "And here's the experimenter in the outer shell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.795,
    "end": 537.999,
    "text": " Making a cognitive model, that cognitive model of let's just say the rat in the tea maze has an aboutness that reflects the experimental setting and context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.545,
    "end": 563.858,
    "text": " so it's making the experimenter human in this outer shell is making a cognitive model which is a map so all the caveats of linear regressions apply maps not the territory don't want to fall into the map territory fallacy however it's also the case that that cognitive model that map is map-like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.2,
    "end": 569.261,
    "text": " in its relationality to the experimental context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.161,
    "end": 582.665,
    "text": "So there's this view from the outside, black box, cognitive model being proposed as a hypothesis, discrete time, chapter seven, continuous time, chapter eight, whatever it may be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.345,
    "end": 591.527,
    "text": "But also the aboutness of that map is about this generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.642,
    "end": 619.352,
    "text": " which is the generative process handing stimuli to the generative model of the agent and so that duality view from the inside and view from the outside makes the FEP uniquely the ideal model of generic systems so they're saying yeah for sure don't do the naive fallacy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.467,
    "end": 623.489,
    "text": " but don't engage in the fallacy fallacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.509,
    "end": 630.294,
    "text": "And then one final piece is if anyone has a dissent with this, let's just see their alternative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.395,
    "end": 646.346,
    "text": "Let's not simply tolerate a standalone criticism, which is actually like a space for improvement, but is anyone seriously proposing an alternative to this structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.927,
    "end": 649.128,
    "text": "And the answer is not really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.689,
    "end": 649.789,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.433,
    "end": 661.479,
    "text": " Just to add slightly more detail to what you just explained in terms of the paper itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.24,
    "end": 669.965,
    "text": "Well, they actually lay out two lines of argument against map territory fallacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.886,
    "end": 676.01,
    "text": "One is, as I mentioned, the misconception that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.966,
    "end": 686.591,
    "text": " uh, process and the model or the map and the territory are conflated, uh, which they say they're not actually conflated, but the territory behaves as if it were a map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.611,
    "end": 688.692,
    "text": "So it's a kind of nested representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.712,
    "end": 702.158,
    "text": "Uh, and, uh, the other line of argument is as, uh, Daniel mentioned, uh, rises from a kind of misunderstanding of, uh, the, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 703.451,
    "end": 713.753,
    "text": " the kind of modeling used in statistical physics, and in particular, the principle of maximum entropy to model the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 713.893,
    "end": 730.396,
    "text": "So the way that, I mean, in FVP, the way that agent models or self-evidences the environment is through CMAP or a constrained maximum entropy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.057,
    "end": 732.877,
    "text": "So yeah, I just wanted to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.576,
    "end": 736.28,
    "text": " add those two bits of detail there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.781,
    "end": 737.081,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.606,
    "end": 740.827,
    "text": "Michael.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 743.975,
    "end": 752.9,
    "text": " So isn't this that a map and a territory implies that there is an isometry between the map and the territory?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 753.72,
    "end": 761.945,
    "text": "But in free energy, in several points, they claim these things are independent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.225,
    "end": 765.747,
    "text": "So the process and the model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 766.387,
    "end": 769.628,
    "text": " is actually independent through these Markov blankets and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.409,
    "end": 780.292,
    "text": "And we cannot actually know what happens outside the world, which is quite different from that idea of map and territory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 781.953,
    "end": 783.393,
    "text": "Well, great questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.433,
    "end": 791.476,
    "text": "I think there's two threads there that are very tightly intertwined, but they're really important to consider separately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.516,
    "end": 794.958,
    "text": "So first, you said, is there an isomorphism or an isometry",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.476,
    "end": 798.836,
    "text": " between the map and the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.737,
    "end": 807.301,
    "text": "Isomorphism in the strict sense, meaning identical structure, is not required.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.261,
    "end": 809.202,
    "text": "The generative process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.047,
    "end": 819.734,
    "text": " Even just talking about the map, the generative process could be a continuous variable and the generative model could be like discrete or a binary and categorical variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.295,
    "end": 828.962,
    "text": "So isometry is not even required between the internal states and the external states within the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.283,
    "end": 834.887,
    "text": "And then it's an even broader space where you don't even know if isometry even applies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.939,
    "end": 839.984,
    "text": " to, for example, the structure of the real territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.525,
    "end": 846.151,
    "text": "So for sure, isometry or isomorphism is not required.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.253,
    "end": 853.64,
    "text": "Some kind of adaptive resemblance will come to be seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 854.605,
    "end": 857.206,
    "text": " That's like the good regulator theorem from cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.926,
    "end": 867.93,
    "text": "Any regulatory adaptive system is as if, that epistemology that Ollie mentioned, it's as if it has an effective model of its niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.69,
    "end": 880.534,
    "text": "Again, that doesn't need to be isomorphic, but evolution or far from equilibrium thermodynamics does make it the case that you're gonna get swept off the table if you can't adapt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.383,
    "end": 896.395,
    "text": " And so over generations and through development, it'll come to be the case that there's functional relationships and a semiotic process, but it doesn't have to be as stringent as an isomorphism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.375,
    "end": 904.661,
    "text": "And the second aspect was the statistical independence that is the technical definition of a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.821,
    "end": 907.783,
    "text": "So Markov blanket, it's the nodes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.815,
    "end": 913.476,
    "text": " upon which two other sets of nodes in a Bayesian graph are conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.316,
    "end": 919.157,
    "text": "So the fact that we're invoking the Bayes graph right off the bat, we know that we're talking about the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.757,
    "end": 922.157,
    "text": "So territories don't have Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.418,
    "end": 923.958,
    "text": "Maps do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.978,
    "end": 927.758,
    "text": "So already we're within the map discussion space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.359,
    "end": 935.88,
    "text": "And what the Markov blanket does is it precludes direct",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.247,
    "end": 941.749,
    "text": " consequences, direct causal impact from internal and external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.209,
    "end": 944.571,
    "text": "So no telepathy, no telekinesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.551,
    "end": 946.491,
    "text": "It's just a model constraint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.752,
    "end": 955.756,
    "text": "However, still through the blankets, there can be the propagation of causal influences on a base graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.436,
    "end": 963.299,
    "text": "For example, a light could turn on in the generative process that could shine photons onto the sense state, and then that could update the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.041,
    "end": 986.219,
    "text": " implications can still propagate on a base graph through the conditional independence of the Markov blanket, just like person A could tell person B and then person B could tell person C. And that doesn't mean that person A told C. Yes, Michael, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.413,
    "end": 992.274,
    "text": " So you're talking about the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 992.714,
    "end": 1001.616,
    "text": "But does this apply also to the notion of maps and territory as, for instance, Google Maps, for instance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1003.317,
    "end": 1008.178,
    "text": "They should have a more strict notion of isometry, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1009.198,
    "end": 1011.839,
    "text": "It's just a question of what you were talking about,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1013.519,
    "end": 1032.89,
    "text": " free energy principle or the notion of maps and territory in general so to what extent does this metaphor you think that this metaphor really applies to arbitrary depths um if i make my question clear um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1034.788,
    "end": 1038.491,
    "text": " I'm just, for those who are watching the video, I just have to like, my screen is like frozen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.511,
    "end": 1042.735,
    "text": "So I'm just needing to kind of reset the screen share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.375,
    "end": 1050.121,
    "text": "But I mean, arguably Google Maps, it depends on what you mean by an isometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.241,
    "end": 1053.924,
    "text": "That's a two-dimensional GPS landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.965,
    "end": 1060.449,
    "text": "So some kind of distorted representation, like making it flat or,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1063.53,
    "end": 1086.103,
    "text": " is done within the bounds of what's useful i'm not sure what what else needs to be claimed for the purposes of google maps okay and so you're saying the same also applies to this uh these markov blankets and the free energy principle what do you think ollie",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.035,
    "end": 1096.096,
    "text": " Again, we go back again and again to Peirce's taxonomy of symbols.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.276,
    "end": 1115.66,
    "text": "Actually, maps, so either, I don't know, Google Maps or circuit diagrams or these kinds of maps can act as a kind of icon for the object instead of the index.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.144,
    "end": 1119.924,
    "text": " Sorry, I thought I got disconnected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.485,
    "end": 1123.045,
    "text": "Icon instead of index.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.125,
    "end": 1133.368,
    "text": "So an icon is a kind of sign that stands for the object through the relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.568,
    "end": 1144.631,
    "text": "So this kind of relation between the icon and the object is a kind of structure-preserving mapping, especially in the case of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.004,
    "end": 1152.491,
    "text": " geographical maps or any other cartographical different mappings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1153.732,
    "end": 1159.578,
    "text": "But in my opinion, when we talk about maps and territories,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.836,
    "end": 1176.66,
    "text": " in relation with physical systems or biological systems or whatever, we use this term in a slightly more broader and a much more looser term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.02,
    "end": 1183.501,
    "text": "And it doesn't require to be an exactly structure preserving mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.941,
    "end": 1186.502,
    "text": "So it's more like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.402,
    "end": 1211.273,
    "text": " a mathematical mapping between a mathematical relation between a sets of object or sets of states and the other sets of states namely generator processes and the generative model so that's it I mean there isn't any need to impose any additional requirement for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.157,
    "end": 1236.126,
    "text": " uh the exact structure of those mappings it's a general mathematical mapping per se awesome yeah one other piece like from the empirical practice side that i think informs our philosophy of science is very rarely is the empirical researcher simply interested in producing one final model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.21,
    "end": 1252.644,
    "text": " modeling is almost always an iterative process that involves the maintenance and diversification and selection from portfolios of models so the findings of a paper might be like this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.022,
    "end": 1274.145,
    "text": " bayes space that we explored of models these structural families suggest that the two factors are better than the one factor or that short-term memory does interact with valence in this way so right off the bat empirically we're talking about portfolios of models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.343,
    "end": 1284.106,
    "text": " Hence, there's obviously a multiple-to-one mapping of maps to system of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.847,
    "end": 1296.231,
    "text": "Ergo, it's a bit limited to try to over-interpret any map and even get into this discussion of whether it's actually the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.771,
    "end": 1297.271,
    "text": "It's not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.812,
    "end": 1298.812,
    "text": "That's why we're doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.272,
    "end": 1300.172,
    "text": "That's statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.353,
    "end": 1301.213,
    "text": "That's modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.486,
    "end": 1304.547,
    "text": " We have a whole host of models on our computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.327,
    "end": 1320.994,
    "text": "None of them are the territory, but it's so tantalizing because first off, unlike the linear regression, we're talking about the action perception loop, which brings this sort of tangibility within our grasp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.215,
    "end": 1329.058,
    "text": "And also there's this question of language with the instrumentalism and the realism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.129,
    "end": 1347.171,
    "text": " being mixed together conceptually and linguistically well the agent is minimizing free energy is it though or is it the modeler's generative model of the actual embodied organism so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.618,
    "end": 1369.436,
    "text": " Somebody who knows that may be able to speak or interpret flexibly and understand that when people are talking about an organism minimizing surprise or the imperative for an organism to minimize surprise, be able to, on one hand, lean into the realism and on the other hand, lean into the instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.777,
    "end": 1376.762,
    "text": "But neither of those, I guess, is like a standalone...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.982,
    "end": 1403.813,
    "text": " interpretation or or straightforward implication from any set of formalisms let's go to chapter eight and let's see how it plays out with continuous time all right as it's our um first discussion in eight let's uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.735,
    "end": 1431.16,
    "text": " scan through and then we'll come to the questions next week okay so everything flows nothing stands still one of the cherished expressions of process philosophy and dynamicism chapter 8 compliments 7 by continuing the discussion of generative models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.23,
    "end": 1433.751,
    "text": " Chapter 7 was about discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.551,
    "end": 1437.093,
    "text": "Chapter 8 is on continuous state-space models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.194,
    "end": 1457.765,
    "text": "And it'll be brought up in multiple ways that continuous time models, continuous perceptual models, and continuous action models are often well-suited for proximate generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.706,
    "end": 1460.247,
    "text": "Not using the term formally, but just like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.306,
    "end": 1486.508,
    "text": " dealing most proximally with incoming sensory data and on the action side dealing most proximally with motor actuation turns out that those settings often are continuous in nature like the amount of pressure on a proprio receptor or the amount of volume by an auditory sensor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.68,
    "end": 1512.94,
    "text": " the sensory sides and on the action side like the angle of an elbow or the amount of force being exerted by a muscle those perceptual and motor settings are really amenable to continuous modeling whereas discrete time models are often amenable to categorical symbolic and discrete settings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.556,
    "end": 1543.586,
    "text": " section 8.2 and just raise your hand if you have like a want to add something or a question 8.2 from chapter 4 the generative model in continuous time can be written as a pair of stochastic equations determining how states hidden states x generate data observables y so that's the top equation is the data are being generated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.482,
    "end": 1569.004,
    "text": " by a generator function on x, hidden states, plus a noise term on y, and change in x, x dot, derivative on x, is a function of the current state of x and v, which are slowly varying causes or contexts, plus a noise term on x.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.236,
    "end": 1573.659,
    "text": " This is a classical formalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.479,
    "end": 1580.624,
    "text": "And in the context of SPM and brain imaging, this is like, why is the fMRI or the EEG measurements?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.746,
    "end": 1589.071,
    "text": "X are the unobserved neural states, neural activity dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.732,
    "end": 1591.573,
    "text": "And there are some sensor noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.554,
    "end": 1598.198,
    "text": "And then the dynamics of neural activity, which again are unobserved, inferred from data,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.099,
    "end": 1610.348,
    "text": " are a function of current state of those neural activity patterns and slowly varying causes, which might be like an attentional factor or might be an experimental factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.13,
    "end": 1619.115,
    "text": "And more broadly, just this partition into like signal and noise comes up again and again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.476,
    "end": 1619.696,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.998,
    "end": 1626.061,
    "text": "I just wanted to point out the second equation is also called",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.553,
    "end": 1628.694,
    "text": " Ito's stochastic differential equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.174,
    "end": 1637.536,
    "text": "So if someone come across that term, that's exactly this second equation of 8.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1639.197,
    "end": 1639.817,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.239,
    "end": 1652.621,
    "text": "These stochastic calculi help us do integrals and derivatives on stochastic processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.596,
    "end": 1660.356,
    "text": " Action is absent from equation 8.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.716,
    "end": 1668.678,
    "text": "This is because, as outlined in the recipe, action is part of the generative process, not the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.458,
    "end": 1678.48,
    "text": "So this is potentially like saying the consequences of action are part of how things are actually generated, which is to say the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.32,
    "end": 1683.701,
    "text": "Even though action selection is a function of a generative model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.855,
    "end": 1710.864,
    "text": " the consequences of action in terms of modifying how the world changes are occurring in the generative process um if we write down the dynamics of the real world generative process but of course this is like the dynamics of the map of the real world we would have to include action so we have a very similar equation but u is now replaced",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.266,
    "end": 1739.256,
    "text": " for v and there's bold g and f this is a general formalization with this sort of observable layer caused by hidden states and the change in the hidden states being related to their current state and causal factors so they're going to specify in equation 8.3",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.392,
    "end": 1747.853,
    "text": " a simple version that's compatible with the above and noiseless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.173,
    "end": 1751.214,
    "text": "So it's a point attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.394,
    "end": 1756.275,
    "text": "When x is less than v, the expected rate of x is positive and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.995,
    "end": 1759.055,
    "text": "So this is a set point attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.716,
    "end": 1771.298,
    "text": "They're going to define a generative process where action will change to fulfill the predictions of 8.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.877,
    "end": 1802.563,
    "text": " so this is an active movement towards a point attractor so that point attractor might reflect a preferred target for the eyes or a preferred location in space for a limb and this is bringing us from this totally general setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.852,
    "end": 1819.794,
    "text": " into an active attainment or an active agency exertion that's compatible with those formalizations they're going to take it one level more complex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.406,
    "end": 1827.929,
    "text": " A more sophisticated model recognizes that forces generated by muscles change velocity, not the position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.949,
    "end": 1830.971,
    "text": "So you don't just pick up and move your limb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.632,
    "end": 1838.456,
    "text": "You're actually modifying a derivative of position, which is velocity and acceleration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.737,
    "end": 1847.942,
    "text": "And so here we start to see a little bit of what could be extended into higher and higher derivatives with the generalized coordinates of motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.956,
    "end": 1870.081,
    "text": " But now F of X and V, which is to say the function that is a function of the current state of the hidden state and the slowly causal varying factors are going to be explicitly written as this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.761,
    "end": 1873.202,
    "text": "X1 is the position and X2 is the velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.382,
    "end": 1876.063,
    "text": "Now this generative model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.293,
    "end": 1904.118,
    "text": " is describing Hooke's law so this is a spring movement it's a conservative spring we can write down a generative model that predicts the dynamics that would unfold if there was a spring drawing a limb to a desired location so that's like one level more advanced than the point attractor which just linearly picks up the arm and moves it to the point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.074,
    "end": 1911.716,
    "text": " Now we have like this Hooke's law spring force drawing and oscillating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.576,
    "end": 1914.797,
    "text": "And then we can imagine you can keep on going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1914.857,
    "end": 1918.858,
    "text": "You can have a damping spring and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.098,
    "end": 1918.858,
    "text": "8.3."
  },
  {
    "start": 1921.118,
    "end": 1931.861,
    "text": "Continuous time formalizations are well suited to characterization of movements and really just nonlinear dynamical systems wherein discretization of time and space is efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.83,
    "end": 1937.955,
    "text": " hashtag live stream 52, discretization algorithms and optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.917,
    "end": 1957.532,
    "text": "Figure 8.1, we're returning to the spinal reflex case from chapter five, descending predictions, getting mashed up with incoming proprioceptive data, resulting in an error residual,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.547,
    "end": 1967.909,
    "text": " that is modifying the trajectory of the actions in the face space shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.63,
    "end": 1973.451,
    "text": "X is the position of the limb and V is where it's being drawn to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.471,
    "end": 1978.332,
    "text": "X is current position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.612,
    "end": 1981.953,
    "text": "V is the target location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.949,
    "end": 2007.041,
    "text": " 8.1 precision attention and sensory attenuation we could talk more about it but this related to a discussion that we had um in office hours last week about the uh sensory attenuation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.071,
    "end": 2039.429,
    "text": " here are some of our discussions we talked about why it's relevant to model sensory attenuation which is like the reduction of precision on proprioception in order to facilitate action selection and that's also kind of described here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.675,
    "end": 2068.307,
    "text": " precision sensory input you just get shut down no movement is executed it's catatonic they're going to move into two classical dynamical systems one with uh predator prey like dynamics lock of volterra and the second with chaotic dynamics lock of volterra",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.775,
    "end": 2073.616,
    "text": " predator prey model, also called a winnerless competition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.378,
    "end": 2080.979,
    "text": "Equation 8.6 gives the Lotka-Volterra dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.0,
    "end": 2087.882,
    "text": "And here on the top is the winnerless competition amongst plant herbivore and carnivore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.088,
    "end": 2117.664,
    "text": " also one could imagine this is like activity patterns in the fmri or eeg with different brain regions and that's exactly how it's been used and here is the phase space this is like three three lines plotted on time axis but we can also think about that as a trajectory in a three-dimensional space so some sort of cube and these there's just one point abc or phc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.045,
    "end": 2121.786,
    "text": " that are moving in this three-dimensional space on some trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.346,
    "end": 2134.529,
    "text": "And then here, if you look at one side or the other of a cube, you can look at how there's something like a slowly drifting limit cycle when you project down to a given axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.589,
    "end": 2144.811,
    "text": "Now they're going to move that log of Volterra, winnerless competition, predator-prey dynamic into sequential action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.284,
    "end": 2159.972,
    "text": " Here's how sequential action has been used in eye blink conditioning experiments and in writing generation of sequential information patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.732,
    "end": 2163.734,
    "text": "And also in the PAR Bookstream 2.1,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.195,
    "end": 2187.848,
    "text": " was a great discussion by thomas so he said early act inf it was continuous it was generalized filtering and then there was the engagement with action people started thinking about how to get sequential dynamics emergence of sequences from continuous dynamics was a key step towards purposeful planning that's figure 8.3",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.938,
    "end": 2201.824,
    "text": " Then it's like, okay, that's all good for making this kind of semi-regularized scribble, but what if you wanted actual policy selection on which word to write?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.845,
    "end": 2207.487,
    "text": "That's going to be really hard to bake into a Locke-Volterra model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.748,
    "end": 2215.431,
    "text": "So things moved into the explicit discrete state space model with the POMDP formalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.168,
    "end": 2219.769,
    "text": " And that led to planning as inference and all these other features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.67,
    "end": 2233.916,
    "text": "And now we're moving back into these hybrid and hierarchical models where continuous state spaces are reintroduced as a low level of hierarchical modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.936,
    "end": 2235.697,
    "text": "8.2, learning continuous models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.67,
    "end": 2240.011,
    "text": " Continuous state spaces are a lot like discrete state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.732,
    "end": 2246.594,
    "text": "In discrete state spaces, you're basically taking a sum across a finite number of entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.095,
    "end": 2250.656,
    "text": "In continuous state spaces, you're taking an integral from here to there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.797,
    "end": 2254.678,
    "text": "And there are different approximations that facilitate those integrals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.639,
    "end": 2263.642,
    "text": "The PMDP formalization of Chapter 7 has largely superseded the use of generalized Locke-Volterra systems in ACT-INF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.094,
    "end": 2274.156,
    "text": " but it's still extremely didactic and pedagogical and used in the lower levels of hierarchical models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.336,
    "end": 2285.879,
    "text": "Now they're going to move from the Lac of Volterra to the Lorenz attractor system, which has some parameters that are reflective of weather systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.079,
    "end": 2290.42,
    "text": "That's been studied in the context of birdsong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.551,
    "end": 2296.855,
    "text": " And they're going to use the Lorenz attractor in the Birdsong case to talk about generalized synchrony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.396,
    "end": 2301.379,
    "text": "So generalized synchrony doesn't mean lockstep synchronization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.46,
    "end": 2307.244,
    "text": "It means that there are entities whose dynamics are on a manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.374,
    "end": 2330.445,
    "text": " other words their dynamics are not untethered from each other there's mutual information such that they're co-ambulating on a lower dimensional manifold so the birdsong example has been in multiple papers it's a chaotic attractor that's underlying the emission of birdsong by the two birds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.693,
    "end": 2360.392,
    "text": " live stream 32 is on coupled chaotic systems so that's where the math are unpacked the most but here we can just see on the right side of figure 8.5 that after learning there's a tightening of the first and the second birds expectations towards a manifold",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.686,
    "end": 2367.768,
    "text": " It's called singing from the same hymn sheet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.448,
    "end": 2370.169,
    "text": "Briston's quite fond of that phrasing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.991,
    "end": 2378.796,
    "text": "And each bird contributes sections of the song, and there's some interesting connections back to sensory attenuation again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.378,
    "end": 2387.382,
    "text": "Section 8.5 goes into hybrid, discrete, and continuous models, which we've basically been talking about multiple times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.043,
    "end": 2388.783,
    "text": "So figure 8.6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.384,
    "end": 2391.806,
    "text": "First off, note that the G should be connected to the pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.092,
    "end": 2417.982,
    "text": " then note the fractal rake structure we have the rake here figure 4.3 on the bottom continuous time v x x prime double prime and so on but these continuous time models lower half of figure 4.3 are embedded within a discrete time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.491,
    "end": 2448.972,
    "text": " higher level a b d s t minus one t t plus one so we see both parts of figure 4.3 discrete time on top d b a past present and future and now we're seeing it as a top level nesting continuous time lower level model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.293,
    "end": 2465.801,
    "text": " and here x derivative of x second derivative on x key difference between discrete time and continuous time models michael",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.697,
    "end": 2469.938,
    "text": " Yeah, I have a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2471.019,
    "end": 2481.187,
    "text": "What happens if the embedded time frames are not fitting into the upper frame?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2481.347,
    "end": 2493.337,
    "text": "So if, for instance, here the lower parts overlap with the states of the upper part, so you have a time frame and maybe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.097,
    "end": 2501.66,
    "text": " and chopping up of time into segments, but the segments overlap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2502.78,
    "end": 2506.502,
    "text": "Is there a possibility to model such kinds of things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.242,
    "end": 2508.543,
    "text": "Yeah, a few thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.583,
    "end": 2509.183,
    "text": "Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.623,
    "end": 2511.664,
    "text": "The first is that the continuous time model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.674,
    "end": 2515.235,
    "text": " doesn't make explicit predictions about the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.016,
    "end": 2519.477,
    "text": "The continuous time model is a lot like a Taylor series approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.198,
    "end": 2538.646,
    "text": "So although it embodies through the generalized coordinates, which are one, two, and three shown here, but could be up to six or more, it embodies some patterns that extend beyond the present, but the continuous time formalization is actually always real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.286,
    "end": 2539.787,
    "text": "That's one answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.945,
    "end": 2557.856,
    "text": " A more empirical answer is if you have a model where there's like sort of clashing timescales, you're going to end up with multicolinearity in fitting the data to empirical results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.237,
    "end": 2568.883,
    "text": "So you'll get a variety of model fitting aberrations because the variance is going to be partitioned in a sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.132,
    "end": 2597.223,
    "text": " a discordant way so some random seed might partition a lot of the variants up here and then another random seed partitions it down here so if there's discordant overlap you're just going to end up with a headache trying to get that model to be useful so no one's going to stop you but that doesn't mean that it's going to be an effective architecture for actual parameterization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.562,
    "end": 2608.184,
    "text": " So does it mean we need to squeeze somehow the stuff into these boxes, into these rectangles, embedded rectangles?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2608.904,
    "end": 2613.265,
    "text": "There's not really a way to have these overlapping boxes there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2614.445,
    "end": 2616.686,
    "text": "What's the case that we're thinking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.846,
    "end": 2621.287,
    "text": "Because pretty much here is the movement of time at some click.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.782,
    "end": 2627.088,
    "text": " And then this could be every second is when the new limb location is chosen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.108,
    "end": 2632.957,
    "text": "And then within each second, there's the continuous movement of the limb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.103,
    "end": 2638.264,
    "text": " Yeah, so for instance, they talk about a sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2638.584,
    "end": 2643.846,
    "text": "So we have words and sentences, paragraphs, texts, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.386,
    "end": 2649.867,
    "text": "But now, if you look at prosodic features, they may overlap with sentence boundaries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2649.927,
    "end": 2655.569,
    "text": "So you wouldn't have a kind of pause structure that fits into the sentence structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2656.429,
    "end": 2671.91,
    "text": " There could be two different ways of chopping up the sentence in an acoustic way and in terms of words and sentences and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2673.647,
    "end": 2697.487,
    "text": " i think it's a super interesting question which is like this strict nesting like well isocades continuously let's just say and they're recognizing letters okay letters are strictly nested within words words are strictly nested within sentences paragraphs and so on and one might want to go oh and paragraphs are strictly nested within narratives it's like well no not necessarily",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.328,
    "end": 2727.874,
    "text": " there might be a narrative boundaries that are up down left right of the paragraphs so let's see it start by just graphing it how you see it and then let's go from there but in principle it's not going to be addressable but when you actually write it out you may discover again a portfolio of model structures which can be used empirically to differentiate hypotheses",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.691,
    "end": 2730.532,
    "text": " And they're maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.232,
    "end": 2741.238,
    "text": "So maybe it turns out that a simpler model where prosody is sentence delimited is more effective because there's so fewer parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.898,
    "end": 2744.6,
    "text": "So the Bayesian information criterion favors that model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.081,
    "end": 2749.463,
    "text": "But that doesn't mean that prosody is sentence delimited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.264,
    "end": 2759.009,
    "text": "It means that a statistical structure with sentence delimited prosody was selected for information theoretic purposes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.666,
    "end": 2784.182,
    "text": " map territory but we want to say things about the territory so that's always the challenge we do a regression between ant foraging activity and the humidity and we want to say when it's more humid the ants forage more that seems like the natural thing to say and it might be our motivating question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.404,
    "end": 2794.691,
    "text": " But it's always hard to remember that it's like, ah, higher values in the humidity measure are correlated with higher foraging activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.911,
    "end": 2797.914,
    "text": "It's like, just say that foraging increases with more humidity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.954,
    "end": 2804.158,
    "text": "But that is the departure point of the map territory fallacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.602,
    "end": 2808.722,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.293,
    "end": 2815.016,
    "text": " It's often more resolvable than people want to know in the specifics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.896,
    "end": 2822.44,
    "text": "That's the deflationary perspective and less resolvable than we want to know in principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.341,
    "end": 2823.601,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.463,
    "end": 2830.445,
    "text": "And also one reason behind formulating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.778,
    "end": 2850.025,
    "text": " sorry, the continuous dynamics in terms of Taylor's series is because it also maps onto the Lagrangian formulation of mechanics because one of the reasons Lagrangian mechanics is used instead of the traditional",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.046,
    "end": 2874.843,
    "text": " Newtonian mechanics is to just get rid of time parameters so instead of time they use momentum and also the Lagrangian so we don't need time explicitly defined or described in order to account for the behavior of the trajectories or to describe the behaviors of the trajectories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.354,
    "end": 2900.767,
    "text": " All we need is this series of successive differentiations in the terms of Taylor series to be able to describe the whole behavior of the system because accounting explicitly for time parameter is much difficult to model than",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.491,
    "end": 2912.644,
    "text": " than describing these dynamical systems in terms of their generalized coordinates, in other words their Lagrangian formulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2914.208,
    "end": 2928.716,
    "text": " In the path integral formulation of FEP, that's basically the solution proposed by Dalton, Friston, and others to use Lagrangian formulation to describe these systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.576,
    "end": 2929.796,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.636,
    "end": 2931.057,
    "text": "Good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.898,
    "end": 2934.298,
    "text": "Equation 8.8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2936.119,
    "end": 2951.855,
    "text": " is describing the transformation from the discrete target selection of the upper level of this model and the way that that is received by the continuous time model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.355,
    "end": 2960.383,
    "text": "So here the discrete time target selection is then received by the continuous time I-saccade model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.668,
    "end": 2991.705,
    "text": " that is an experimental setting that has been studied relatively extensively here in the middle of figure 8.7 we see the target selection being modeled and the circadian and here's the calling back to that spring-like movement here's like the acceleration and then the dampening as the target is fixed upon",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.789,
    "end": 3002.775,
    "text": " So isocating has been studied relatively extensively in the context of information-driven continuous modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.437,
    "end": 3007.459,
    "text": "Box 8.3 is a bit of a side note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.981,
    "end": 3031.589,
    "text": " on discretization so a gaussian mixture model or very related is a k means model where one takes a cluster of data points in space and asks how many clusters k fit this scattering of points",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.369,
    "end": 3040.213,
    "text": " You could just have 1k with just a point in the center, and then there's some variance distribution around it, or you could say 2k.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.874,
    "end": 3047.558,
    "text": "And then you can look at the error profiles to determine an adequate number of clusters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.958,
    "end": 3058.964,
    "text": "Somewhere between one cluster and one cluster per data point, there's going to be a k-means value that is statistically optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.816,
    "end": 3083.149,
    "text": " 8.6 in this chapter, which is relatively short and in some ways kind of introducing the continuous time formalism so that we can get to these important topics like hybrid models, they overview applications of continuous time GMs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.029,
    "end": 3086.05,
    "text": "This is a huge topic and much has been left out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.15,
    "end": 3086.991,
    "text": "See table 8.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.992,
    "end": 3089.913,
    "text": "Synthetic birdsong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.522,
    "end": 3095.864,
    "text": " Ocular Motor Delay, Conditioned Reflex, Smooth Pursuit Eye Movement, 2012.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.305,
    "end": 3100.006,
    "text": "Psychosis, Illusions, 2012.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.428,
    "end": 3105.069,
    "text": "Cicades, many papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.53,
    "end": 3114.494,
    "text": "Action Observation, Attention, Hybrid Discrete Continuous Models, Self-Organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.695,
    "end": 3120.817,
    "text": "It's a foundation for further exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.076,
    "end": 3144.029,
    "text": " they focused on movement prediction it simplifies the treatment of motor control we don't need any additional machinery or inverse models and this was also a topic picked up in the skilled performance discussion of hippolyto at all talking about interactionism rather than instructionalism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.779,
    "end": 3153.584,
    "text": " They talked about the Lotka-Volterra winnerless competition, Predator Prey, and the Lorenza Tractor chaotic system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.305,
    "end": 3164.631,
    "text": "In all those cases, it was possible to find this concept of generalized synchrony, which isn't lockstep, but it's like a mutual information or a manifold co-traversal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.712,
    "end": 3193.749,
    "text": " and then they introduce the hybrid models which tend to have continuous lower level dynamics and discrete higher level dynamics that's it for today next time we're going to come back to chapter 9 which is going to be talking about model-based data analysis fitting models to data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.229,
    "end": 3208.1,
    "text": " and next week uh we'll do chapter eight questions and come through it again and preview nine so thank you fellows see you next time",
    "speaker": "SPEAKER_00"
  }
]