[
  {
    "start": 2.95,
    "end": 3.25,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3.271,
    "end": 4.072,
    "text": "Greetings, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4.933,
    "end": 9.741,
    "text": "Welcome to cohort four on June 20th for chapter one discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.663,
    "end": 21.821,
    "text": "We're going to get to chapter one discussion in one second, but I wanted to just show one area of development and something that people can explore and then mention one thing about math learning group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.141,
    "end": 25.026,
    "text": "So first, in the equations page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 25.259,
    "end": 29.005,
    "text": " there's a few sub pages that might be interesting to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.045,
    "end": 39.821,
    "text": "First, where we previously had the equation screenshots, so you could like mouse over equation 2.1 and click on the screenshot, we added the LaTeX.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.342,
    "end": 46.331,
    "text": "So this is just a plain text code that renders in Coda.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.392,
    "end": 50.236,
    "text": "Then there's some sub views that use Coda AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.737,
    "end": 52.6,
    "text": "So this explanations view,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.677,
    "end": 61.788,
    "text": " These prompts, basically, just to show what it looks like in code AI, explain the LaTeX as if I'm not familiar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 61.809,
    "end": 64.272,
    "text": "How would a high schooler be interested in this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.013,
    "end": 66.155,
    "text": "What's some summary code?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.816,
    "end": 68.198,
    "text": "Where is this equation important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.959,
    "end": 70.581,
    "text": "And can you explain the variables?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.182,
    "end": 73.165,
    "text": "It's not perfect, but it gets pretty far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.405,
    "end": 74.166,
    "text": "Very cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.838,
    "end": 76.079,
    "text": " This is the explanations page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.66,
    "end": 77.861,
    "text": "There's a philosophy page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.542,
    "end": 82.086,
    "text": "Just one column, but it's just bring up 10 philosophy questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.127,
    "end": 87.692,
    "text": "And a lot of these are like awesome discussion starting points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.914,
    "end": 91.997,
    "text": "You know, what does divergence mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.237,
    "end": 92.798,
    "text": "All these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.878,
    "end": 94.159,
    "text": "And then also languages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.3,
    "end": 96.842,
    "text": "So here's just a few languages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.044,
    "end": 100.626,
    "text": "But we can add...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.893,
    "end": 129.297,
    "text": " people's preferred languages just totally feel free to make a suggestion and we can add more AI columns um so we have to keep on exploring this because the latech representation with plain text is really amenable to this kind of language model work so just mention that and then also um someone in cohort 4 is interested in math learning group I think they're um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.357,
    "end": 157.697,
    "text": " potentially interested in like a morning time UTC but if somebody else is interested then we can kind of get this going so it could be in the discord but if anyone is interested to pick up with math learning group and basically just it can be an unrecorded session in the discord another hour um to go over the equations um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.512,
    "end": 165.053,
    "text": " Sorry about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.637,
    "end": 176.109,
    "text": "So if anyone is interested, maybe just write a comment here and just say, here's some times I'd want to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.609,
    "end": 179.213,
    "text": "Just basically like a math study time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.575,
    "end": 189.428,
    "text": "And then let's just see if there's any specific options for what times people want to do such activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.209,
    "end": 190.89,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.208,
    "end": 193.151,
    "text": " on either the AI or the math learning group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.171,
    "end": 196.957,
    "text": "Does anyone have any just general thoughts or questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.997,
    "end": 210.598,
    "text": "Otherwise, we'll move to chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.618,
    "end": 214.684,
    "text": "All right, so let's head over to chapter one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.812,
    "end": 233.736,
    "text": " um just right off the bat before we get to the um questions it would be awesome if anyone could just share any of their reflections on chapter one just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.336,
    "end": 241.409,
    "text": " Anything about their experience reading it or what what they felt it was like or what stuck with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.429,
    "end": 245.017,
    "text": "or anything that kind of raised after they.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.037,
    "end": 248.485,
    "text": "read Chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.956,
    "end": 290.841,
    "text": " um yeah yeah um so i've had some familiarity with active inference for a while so a lot of what i read already tracks for me um but that said i'm curious about variational uh free energy is like a particular it seems that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 291.142,
    "end": 302.734,
    "text": " So active inference seems to be based on a particular form of Bayesian inference that it relies upon like this variational formulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 303.355,
    "end": 304.616,
    "text": "I'm more curious about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 304.696,
    "end": 316.068,
    "text": "I assume the textbook will get much more into what's specific to variational free energy as opposed to some other formulation of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 316.609,
    "end": 320.693,
    "text": "But yeah, that's something that I'm kind of still chewing on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 320.96,
    "end": 344.537,
    "text": " right now thank you anyone else yeah I read uh chapter one a while ago and I think I just dove deeper into it knowing that you know we're looking for questions and stuff but I really appreciated the um the video that you and Ali did so I watched that for the first time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 345.395,
    "end": 369.799,
    "text": " um today and I really appreciated the heads up to actually read ahead to chapter 10 which I'll do yeah that looks good um for me in this this more in-depth reading um action really stuck out to me um so I went to the ontology to look at the definition of action uh that's like central to my area I'm in motor neuroscience",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.948,
    "end": 393.88,
    "text": " uh and I can relate to the idea that action has to have a goal purpose but I noted that in the ontology that gold purpose is not in the definitions it's more of a general sort of behavioral definition um and then I started to think about you know in our area we also use uh in action so like action imagery",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 395.429,
    "end": 421.926,
    "text": " and observational learning which you're not really acting you're you're watching somebody else and and so I posted that question about um does action have to change the world and what do we mean by that do we mean like I'm going to change the physical world that we all share or am I actually sharing my internal uh changing my internal model of the world through action",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.813,
    "end": 448.943,
    "text": " yeah so in summary I really got hung up on this this action um terminology cool but those are some great things to explore anyone else with uh just any thought about chapter one am",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.48,
    "end": 473.918,
    "text": " yeah i i'm i was familiar with the bayesian brain hypothesis about like the you know our mind is kind of a predictive mechanism and yeah but but like this framework and you know the more i thought about it the more i started seeing like these patterns around me like thinking about",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 474.269,
    "end": 498.64,
    "text": " you know the different uh things that I observe in in that sense of active inference like uh the action and the perception and and like specifically I saw it like in children's behavior uh for example like uh you know the ability to to change their mind and and the relief in",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 499.531,
    "end": 526.905,
    "text": " in contrast with like stubbornness sometimes you know when they're very stubborn and kind of like uh you know they will do whatever they can to change their reality although you know they can't necessarily do so but so it was it was very interesting just uh thinking about like uh various behavioral um patterns that i see around me and translate them into this framework",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 529.079,
    "end": 529.408,
    "text": " Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 529.819,
    "end": 530.416,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 536.538,
    "end": 552.305,
    "text": " I have a question about saliency, because I'm quite familiar with the definition of saliency in visual science, in which something is silent if the visual features involved are different from what you have in a neighborhood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 553.567,
    "end": 559.457,
    "text": "But I think that saliency has a much more general definition in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.437,
    "end": 578.104,
    "text": " so quite interesting to understand you know uh how it is quantified uh and what's the yeah it's proper definition you know it's generalization uh how we generalize you know the very simple definition in uh in vision science cool",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 578.54,
    "end": 607.517,
    "text": " uh for me uh i'm a psychiatrist so um talking about helen freud who invented the psychoanalytic theory was influenced by helen holtz and as you can see in the chapter one and also at chapter two helen holtz said that perception is an unconscious inference process and which is quite interesting because um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 607.683,
    "end": 622.705,
    "text": " So the psychoanalytic theories are based on the assumption that individuals make interrelationship based on their childhood memories and experiences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 622.685,
    "end": 649.401,
    "text": " Based on the fact, I got quite curious about whether we can explain psychoanalytic theories based on active inference or other computational models that are based on these assumptions or theories that are inspired by Helmholtz or other scientists who are also having similar points.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 653.313,
    "end": 681.379,
    "text": " cool there's definitely some other people in the in the textbook group and around so i hope that they can continue on this topic anyone else want like a general um topic or we can return to some of these mentioned points as well as some of the other asked questions um just uh i don't want to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.815,
    "end": 698.842,
    "text": " track too much, but just in response to Junghoon, I, and maybe you're already familiar with this, but the way I ended up at Active Inference was through the work of Mark Soames and neuropsychoanalysis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 699.723,
    "end": 704.551,
    "text": "My dad, so I would strongly recommend checking him out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 704.571,
    "end": 708.497,
    "text": "And he wrote a piece where he completely wrote rewrites",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 708.983,
    "end": 720.137,
    "text": " Freud's early scientific paper using the terminology of active inference, I think it's great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 720.157,
    "end": 731.952,
    "text": "And I'd be happy to explore the relationship between psychoanalysis and active inference more potentially within the confines of this group in the textbook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 731.972,
    "end": 732.532,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 732.773,
    "end": 733.894,
    "text": "I heard about him.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 734.161,
    "end": 738.768,
    "text": " I never actually read his papers, so I'll look it up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 738.808,
    "end": 739.049,
    "text": "Thanks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 739.069,
    "end": 739.914,
    "text": "Thanks for bringing up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 741.081,
    "end": 741.302,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.658,
    "end": 768.699,
    "text": " I think you're muted, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.101,
    "end": 787.203,
    "text": "Ali, you want to unmute and go for it, or?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.264,
    "end": 797.597,
    "text": "Yeah, I just wanted to mention your work in relation to",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 797.78,
    "end": 801.884,
    "text": " I mean psychoanalytic understanding of active inference.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 802.965,
    "end": 825.084,
    "text": "It's not completely in line with Mark Stone's line of research, but it provides an alternative path through some of the psychoanalytic ideas of active inference based on his own spatio-temporal philosophy of neuroscience.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 825.845,
    "end": 826.065,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 828.29,
    "end": 854.567,
    "text": " right well let's just revisit some of these topics and then turn to the questions but we're totally just chilling and and whichever um ways that people want to go or anyone who wants to raise your hand like you know what whatever comes to mind let's just do it while we're here um some of these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.374,
    "end": 878.277,
    "text": " as with the many coats of paint idea we're just gonna kind of give like a first or a few thoughts on and we're gonna be revisiting in the coming chapters because like this is the topic chapter one is just kind of like opening the door so let's we're gonna certainly address all of this once",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.257,
    "end": 903.437,
    "text": " all these topics are going to come back like again and again because the ontology gets revisited so much so um active inference being based upon the variational free energy as opposed to some other formulation we're going to talk about this a lot more in chapter 2 and in equation 2.5 we're going to meet the variational free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.569,
    "end": 916.911,
    "text": " And so leading up to equation 2.5 and in the discussion around 2.5 and in chapter two and elsewhere, we're going to talk about like, what do we mean by variational free energy and why is active inference using it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 917.872,
    "end": 923.822,
    "text": "Essentially, it's a really tractable and optimizable heuristic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.055,
    "end": 928.303,
    "text": " that lets us carry out Bayesian inference efficiently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.985,
    "end": 941.389,
    "text": "Because there's situations where if you had infinite computing resource, you could do exact Bayes, you could just plug and chug and just do the matrix multiplication and get the exact correct answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.369,
    "end": 944.932,
    "text": " However, with large data sets, that's not really tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.573,
    "end": 956.524,
    "text": "And so in Bayesian statistics, and this is even outside and before active inference, people use variational methods because they're super effective computationally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.064,
    "end": 959.827,
    "text": "So, for example, a variational autoencoder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.228,
    "end": 968.355,
    "text": "A variational autoencoder is a widely used machine learning method or a Bayesian statistical method",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.69,
    "end": 978.824,
    "text": " And a variational autoencoder finds the optimal fit for data, not underfitting or overfitting, through finding the variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.706,
    "end": 988.638,
    "text": "So in active inference, a lot of times there's a lot of interpretation and a lot of extension of what free energy is in all of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.299,
    "end": 997.11,
    "text": "But it's also possible to kind of pull back to this pretty non-contentious Bayesian statistical interpretation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.428,
    "end": 1010.287,
    "text": " and just consider variational methods as being part of Bayesian statistics and used to tractably optimize challenging inference problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.09,
    "end": 1013.933,
    "text": "So we're going to talk more about that in chapter two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.293,
    "end": 1016.216,
    "text": "Anyone have a thought or a question on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.578,
    "end": 1021.003,
    "text": "Ali, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.023,
    "end": 1024.228,
    "text": "I wanted to...",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1024.765,
    "end": 1034.659,
    "text": " point to the distinction between variation of free energy and expected free energy, because as it says here, active inference is based upon the variation formulation.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1035.48,
    "end": 1043.331,
    "text": "It's true, but the perceptual part of active inference theory is based on variation of free energy.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1043.612,
    "end": 1051.583,
    "text": "But when it comes to action policy selection and decision-making, the parameter to be optimized is actually expected free energy,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1052.255,
    "end": 1053.938,
    "text": " which is expressed in equation 2.6.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1054.398,
    "end": 1076.695,
    "text": "So basically those two equations between variation of free energy expressed in equation 2.5 and expected free energy expressed in equation 2.6 can be seen as parallel to each other, but they're used to formulate different aspects of active inference.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1077.155,
    "end": 1079.359,
    "text": "One is for perception and the other one is for action.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1080.689,
    "end": 1081.17,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.49,
    "end": 1082.091,
    "text": "Thank you, Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.972,
    "end": 1084.613,
    "text": "Two ways to minimize free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.655,
    "end": 1088.278,
    "text": "Update your mind through perception and learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.399,
    "end": 1090.9,
    "text": "Action through change in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.902,
    "end": 1097.328,
    "text": "The only thing you can't do is put your thumb on the scale and directly change your sensory outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.048,
    "end": 1107.439,
    "text": "So you prevent the thumb going on the scale because you don't have a line going from the internal states out to the sense states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.605,
    "end": 1128.634,
    "text": " so that the set states are only coming in that's the inbound dependency and then that leaves two avenues for reducing um free energy perception and action and we're going to talk a lot more about this in chapter two when equation 2.5 and 2.6 come into play okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.285,
    "end": 1157.49,
    "text": " continuing on this theme of action so action was brought up and obviously like this is one of the really exciting pieces this is what is going to be referenced throughout the book a unified approach on perception and action or all these different ways which we see active inference presented like going beyond passive or perceptual inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.187,
    "end": 1162.313,
    "text": " So does action have to change the world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.474,
    "end": 1166.667,
    "text": "Is this changing the physical environment or can we change the generative model through action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.1,
    "end": 1173.066,
    "text": "Thank you, Holly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.953,
    "end": 1204.622,
    "text": " yeah so maybe i'll just yeah please so i think you know i think you know the when ali brought up expected free energy you know you're you're making changes to your policy your brain uh your model and um and so then what's happening is that and what i find interesting uh is the leverage points and this concept that making a very slight change in your understanding of the world has a much larger effect than",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1204.973,
    "end": 1207.316,
    "text": " an actual, you know, physical action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1207.356,
    "end": 1209.979,
    "text": "You can see it there in that image.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1211.081,
    "end": 1223.217,
    "text": "So I thought, and I don't know if, I don't know if a variation of the energy and the expected free energy really take that into account that, you know, that these, you know, the leverage points or not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1223.237,
    "end": 1225.059,
    "text": "I thought maybe some people have some ideas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1230.586,
    "end": 1233.63,
    "text": "Well, it's like, like in nested modeling,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.678,
    "end": 1259.753,
    "text": " like for a generative model that only sees up to this point the optimal leverage point that's detected is going to be so and so but that a deeper generative model might be able to see uh more leverage points Ali uh well rather than uh describing action as something that changes the environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.543,
    "end": 1268.342,
    "text": " If we want to talk a bit more precisely, what action means in active inference is actually",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1269.318,
    "end": 1273.546,
    "text": " one in which active states intervene causally in external dynamics.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1274.608,
    "end": 1287.131,
    "text": "And formally, it means a kind of Jacobian coupling between the external states that depend upon the active states or active intervention.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1287.672,
    "end": 1292.862,
    "text": "So what we mean by changing the environment",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1293.247,
    "end": 1307.205,
    "text": " we mean more precisely the kind of active state that would lead to a kind of causal intervention in the environment and not something that just, I don't know,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1307.978,
    "end": 1327.489,
    "text": " changes something per se and this kind of distinction comes into play when we want to talk about covert and overt actions as discussed in phenomenology which will come to later in the book but yeah I think that would be helpful to",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1330.49,
    "end": 1352.346,
    "text": " awesome yeah so many things to look ahead to overt action is physically manifested embodied action covert action or internal action is attention or mental action and so that is like something that doesn't necessarily um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.967,
    "end": 1375.06,
    "text": " change outside of the generative model but it's it's modeled with attention and action inside the model and there's actually um even a very cool um recent work on uh transparent and explainable artificial intelligence and again just looking ahead",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.373,
    "end": 1390.246,
    "text": " Here, they use attention and meta-awareness as internal or covert attention generative models in an artificial intelligence way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.266,
    "end": 1403.359,
    "text": "But this model was actually developed in a meditation and phenomenology setting where the action selection was internal attentional control, not external control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.592,
    "end": 1423.98,
    "text": " um yeah i'll put the um this is the explainable ai paper in the chat and then also just again looking ahead one place to to what is this concept of action this is figure 4.3 which is kind of like a rosetta stone figure pi are going to be the actions that are selected from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.551,
    "end": 1430.889,
    "text": " And where those actions intervene is how the hidden states of the world change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.732,
    "end": 1437.328,
    "text": "So if the hidden states S changing through time is like the true temperature in the room,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.815,
    "end": 1465.611,
    "text": " and at each time point t you have a thermometer reading that gets emitted from the true temperature so we're only able to observe the observables which is the thermometer readings and there's the true underlying changes in temperature or you could think of this as the true underlying activity of the neural system and the observation is the fmri that's kind of where this comes from in terms of like friston's lineage with spm and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.35,
    "end": 1474.283,
    "text": " if there's two actions you can take, turn on the heater or not, it causally intervenes in how states change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.864,
    "end": 1479.391,
    "text": "Maybe if you don't turn on the heater, it just passes the hidden state on forward without changing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.411,
    "end": 1483.698,
    "text": "And if you do turn on the heater, it increases it by one per time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.718,
    "end": 1486.502,
    "text": "So that's one sense of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.14,
    "end": 1512.169,
    "text": " then also just by by mousing over um we see it from the ontology and also we we can update the ontology it's it's never like these things are locked definitions just to be clear but we see a really common pattern which is that there's like a broad and a narrow sense a lot of these terms in the acting of ontology action belief attention salience",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.149,
    "end": 1539.017,
    "text": " things that people have brought up today there's like a broad sense qualitative definition which largely or exactly is how we would use this day to day just action is what occurs super general term and then there's like a narrow or a more technical definition which sometimes conveys how this is operationalized in generative modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.166,
    "end": 1550.387,
    "text": " So more specifically, actions are the active states that the agent generative model is going to select.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.669,
    "end": 1555.356,
    "text": "And so that's like more of the quantitative and formal definition of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.758,
    "end": 1561.427,
    "text": "And then we'll explore a lot about how is action selected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.88,
    "end": 1584.58,
    "text": " Because that is the entire expected free energy imperative, is the selection of action and how goal orientation, preference orientation, expectation orientation is embedded within action, despite there not being a reward function, as we might see in reward learning, reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.117,
    "end": 1593.285,
    "text": " we're going to have a different approach for adaptive and flexible behavior that's not based upon reward learning or a reward function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.492,
    "end": 1601.393,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.413,
    "end": 1605.497,
    "text": "Any other thoughts or just any other ideas on this in action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.738,
    "end": 1606.038,
    "text": "Martin?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.34,
    "end": 1611.023,
    "text": "So does action have to have movement?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1612.724,
    "end": 1615.009,
    "text": " It's one thing I'm looking at here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1615.029,
    "end": 1617.455,
    "text": "I mean, the overt versus the covert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1617.515,
    "end": 1620.241,
    "text": "So overall, I have to have some movement that I could observe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1622.466,
    "end": 1630.986,
    "text": "But you said earlier that you could have the covert, like, for example, attention being a covert action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1632.755,
    "end": 1637.102,
    "text": " Yeah, well, depending on the system of interest, action could be an API call.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.662,
    "end": 1641.548,
    "text": "So certainly it doesn't have to be a person's body that we're modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.568,
    "end": 1644.673,
    "text": "It could be a computational or a purely informational system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.675,
    "end": 1650.502,
    "text": "And then covert or internal attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.542,
    "end": 1653.647,
    "text": "I mean, you could argue it has some physical informational substrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.428,
    "end": 1658.374,
    "text": "So it's not like it's happening in some...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.455,
    "end": 1684.108,
    "text": " know alternative plane of existence but for the purposes of the modeling it might not be realized through gross morphological movements yeah thanks yeah and and it's going to be super cool like how we're going to when we look at um figure 4.3 as kind of this cognitive kernel or this kind of firmware element",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.645,
    "end": 1702.788,
    "text": " And then, again, when we take it to, when we look at how these models compose, even just starting to see familiarity here in figure two, we see basically this figure 4.3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1703.769,
    "end": 1706.913,
    "text": "Downward facing E, that's the inference part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.094,
    "end": 1710.497,
    "text": "Hidden state and observations and policy intervening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.158,
    "end": 1712.059,
    "text": "That's like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.0,
    "end": 1714.382,
    "text": "Downward facing E.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.003,
    "end": 1743.07,
    "text": " policy intervening and then that just gets nested and so that speaks to the composability of these kinds of Bayesian graphs and then in when you look at a specific model it becomes clear which actions are associated with overt movement and which actions are associated with covert attention um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.552,
    "end": 1746.955,
    "text": " Okay, any other thoughts or questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.58,
    "end": 1767.322,
    "text": "Yeah, I guess just to briefly kind of add to the table under action, like on page 10, ever so briefly, the authors make the distinction between exploration and exploitation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1767.362,
    "end": 1772.989,
    "text": "And that seems like a really interesting or useful",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1773.695,
    "end": 1774.796,
    "text": " division to me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1775.577,
    "end": 1785.248,
    "text": "So both of them seem to be both of them are related to minimizing free energy or expected free energy in this context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1785.788,
    "end": 1790.033,
    "text": "And yeah, exploration is to resolve uncertainty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1790.053,
    "end": 1803.027,
    "text": "So I view that as like taking in new information versus exploitation, which has to do more with, yeah, acting on the world to bring your",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1803.361,
    "end": 1818.154,
    "text": " your observations into line with whatever your goal is or your plan is, your set point, to use that word from cybernetics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1818.174,
    "end": 1818.615,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1819.175,
    "end": 1822.118,
    "text": "And here's a really clear claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.258,
    "end": 1832.147,
    "text": "In contrast with other frameworks, policy selection, so behavioral selection, inactive inference automatically balances exploration and exploitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.848,
    "end": 1833.368,
    "text": "Now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.736,
    "end": 1841.312,
    "text": " This is a very strong version of the claim, as we'll explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.332,
    "end": 1846.583,
    "text": "It's not that simply making an active inference model does automatically balance it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1847.204,
    "end": 1854.9,
    "text": "It's not like just writing it out is going to make the startup work and the ship work and the plane fly and all of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.42,
    "end": 1857.002,
    "text": " It can be read too strongly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.683,
    "end": 1859.967,
    "text": "It's not that it's automatically going to be effective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.627,
    "end": 1870.822,
    "text": "However, it sets the stage or it provides an accounting system for the adaptive finessing between exploration and exploitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.924,
    "end": 1876.711,
    "text": "And we'll explore that more in chapter two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1877.652,
    "end": 1884.702,
    "text": "When we look at what is it that expected free energy and variational free energy are, and then how is it that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1885.222,
    "end": 1913.018,
    "text": " that policies are selected behaviors are selected that are able to adaptively finesse between more exploratory behavior when there's information to learn and more exploitative behavior when there's kind of pragmatic value on the table and maybe it's more important to just get the pragmatic value rather than to um continue learning but that's where we see um variation in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.622,
    "end": 1920.65,
    "text": " behavior, ultimately, variation in cognition and behavior, when there's too much attention paid to epistemic or to pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.411,
    "end": 1930.621,
    "text": "And that's a lot of where like these like precision psychiatry, cognitive modeling things come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.641,
    "end": 1936.207,
    "text": "And it even Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.227,
    "end": 1938.229,
    "text": "Any other thoughts or questions on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.913,
    "end": 1947.939,
    "text": " it kind of connects to even the next point that was on salience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1949.322,
    "end": 1964.485,
    "text": "So salience, again, just as it is in the ontology, not that it's the only or the final definition, but it's just the extent to which a cue is going to be attended to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.505,
    "end": 1969.954,
    "text": "A cue that is not salient has no attention to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.322,
    "end": 1976.597,
    "text": " and something that's not being attended to, the consequences for the queue are diminished.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.358,
    "end": 1985.277,
    "text": "In the limit case, if you didn't pay attention to something, it just, you know, didn't cross your radar, it doesn't update the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.83,
    "end": 2011.011,
    "text": " that's like attention to zero in the other extreme case when the attention is super high it's like you're updating your prior to just whatever it is the new data point is you perfectly attend to it and it is like the same as having like no memory so no attention is like totally pushing your prior forward full memory full attention no memory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.881,
    "end": 2037.623,
    "text": " then finding out what is an adaptive amount of remembering and learning and forgetting um salient observations are those that resolve uncertainty that's the information that we're seeking out is the information that reduces our uncertainty about something and then how much it reduces it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2038.21,
    "end": 2048.238,
    "text": " We're going to talk about some formalisms, especially in chapter two for comparing like, is this sequence of observations or that sequence of observations going to be more salient?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.419,
    "end": 2050.48,
    "text": "Which one is going to have higher epistemic value?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.321,
    "end": 2053.243,
    "text": "Which one is going to reduce my uncertainty more?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.224,
    "end": 2057.026,
    "text": "Which one will I learn more by viewing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.247,
    "end": 2059.848,
    "text": "Which one will update my priors more?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.349,
    "end": 2061.81,
    "text": "Which one should I pay attention to more?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.651,
    "end": 2067.795,
    "text": "Those are all kind of like related questions for like which information is going to be the good information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.092,
    "end": 2076.66,
    "text": " And these are the two sides of the joint imperative for expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.242,
    "end": 2080.684,
    "text": "Information gain and pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.266,
    "end": 2085.549,
    "text": "Epistemic value, how good is the information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.451,
    "end": 2090.014,
    "text": "Pragmatic value, what is the utility?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.816,
    "end": 2093.257,
    "text": "Am I gonna be at homeostasis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.98,
    "end": 2098.002,
    "text": "Exploration, exploitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.281,
    "end": 2119.325,
    "text": " And so expected free energy is like this unified imperative that contains both of those elements such that different policies can be ranked or evaluated or upweighted based upon how well they contribute to both information gain and pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.689,
    "end": 2125.272,
    "text": "Comes up in chapter two, but just wanted to kind of preview it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.963,
    "end": 2141.852,
    "text": " Any other thoughts or questions or let's go to the questions table and just like the questions that people are most interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.759,
    "end": 2152.843,
    "text": "Okay, first I'm gonna go to the chapter four or cohort four questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.044,
    "end": 2160.251,
    "text": "So just to make sure that even if they have few upvotes that all of your questions can be addressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.271,
    "end": 2162.413,
    "text": "So we'll first look at this question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.731,
    "end": 2186.663,
    "text": " and then we'll turn to chapter one questions overall so as always like you know whenever you're watching or participating even if it's a chapter that was long discussed ago or you know up ahead just add questions it's it's really awesome and upvote them so that and develop the discourse so we can have good short answers for these okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.398,
    "end": 2191.984,
    "text": " Page nine, action minimizes free energy and surprise by changing the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.045,
    "end": 2194.828,
    "text": "Okay, so I talked a little bit about that previously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.511,
    "end": 2204.503,
    "text": "Does this imply that the agent implements action to alter their world or the action is implemented to change the agent's model of the world or both?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2206.105,
    "end": 2215.62,
    "text": "Can an agent implement action not solely to minimize their free energy, but free energy in another agent, for example, using action demonstration for observational learning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2218.57,
    "end": 2220.582,
    "text": " Does anyone have any thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.009,
    "end": 2265.553,
    "text": " okay just starting with the observational learning two two quick angles so this again everyone can add more in live stream 53 um sequence there were some paleoanthropologists and we discussed observation learning a lot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.77,
    "end": 2289.381,
    "text": " they highlighted how a lot of times people have focused on the kind of moment of innovation for example in um creating stone tools in in human cultures and history but it's not just about the one innovator making the stone tool it's actually in the moment of observational learning when the onlooker",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.817,
    "end": 2299.017,
    "text": " is able to either understand or not understand and ultimately adopt or not adopt or to copy or not to copy that behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.216,
    "end": 2301.799,
    "text": " And so they approach this from an active inference perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.8,
    "end": 2311.108,
    "text": "And this also brings up ideas like thinking through other minds, T-T-O-M, which is kind of like the active version of theory of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.889,
    "end": 2327.485,
    "text": "But thinking through other minds or thinking with other minds is more explicitly like one's generative model in a social environment also includes a generative model of what the other is thinking and doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.848,
    "end": 2340.844,
    "text": " And so if one is in an encultured setting where action demonstration can be used for observational learning, then these are the kinds of dynamics that are possible to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.205,
    "end": 2352.76,
    "text": "So that's one angle is, yes, it's been considered in a social encultured setting, how like gesture and demonstration and observation might play a role in transfer learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2353.781,
    "end": 2358.788,
    "text": "A more technical and general response is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.19,
    "end": 2388.606,
    "text": " in multi-agent systems you have agent reducing their own free energy making their own perception action cycle but also you have like the joint distribution now you have the nest mate going about their own way but then in the aligned or the healthiest or adaptive setting the colony is also reducing its expected free energy so one agent or neuron or an estimate or a person",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.839,
    "end": 2414.172,
    "text": " might undertake an action that increases their own surprise transiently as part of a distributed cognitive system that has a joint free energy that is reduced through that action so it's not necessarily like every single subunit is always and only reducing its free energy per se but the adaptive hole",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.177,
    "end": 2438.91,
    "text": " is going to reduce its free energy and that might be um entailing some subunit increasing its surprise uh yes young then anyone else uh yeah i mean i think i'm i keep thinking in a way as a psychiatrist so uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.295,
    "end": 2450.014,
    "text": " It feels like psychoanalytic therapy itself is something a therapist is doing, trying to minimize the free energy of the client.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2450.635,
    "end": 2477.352,
    "text": " because like they provide explanations and interpretations about why they are doing such behavior or why they are making such relationships with others so I guess maybe in a broad aspect I would say uh giving providing explanations about why some individuals are behaving in such way would be another action that actually reduces the free energy of another agent",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2482.343,
    "end": 2493.838,
    "text": " that's very cool yeah like by providing a narrative summary it's a sense-making tool that helps explain and make sense of their perceptions and actions uh Martin",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.046,
    "end": 2518.577,
    "text": " yeah it's really interesting thanks for that uh it just got me thinking um you know sometimes we we I guess we try to free um minimize energy and others directly like I'm a university teacher so by teaching I'm trying to reduce you know their free energy um but sometimes you find it's best to let them",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2520.363,
    "end": 2545.189,
    "text": " find their own way so I'm just thinking about like in psychoanalytics which is a very distant field from my area but uh letting others interpret meaning from their situation rather than framing it for them if that makes sense and just thinking you know maybe this is a side topic but would active inference speak to what's a better approach",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2546.57,
    "end": 2576.273,
    "text": " or want to do it for the other or to let the other explore in a way let them work through that space of energy free energy and then find their own way to minimize that yeah great topics oh yeah I think that's a really good uh point because like at in psychoanalysis we sometimes like um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.383,
    "end": 2587.518,
    "text": " have to choose whether to give a very direct interpretation, or sometimes we let the patient to understand what's going on by themselves.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2587.618,
    "end": 2593.247,
    "text": "But it's always a controversial question about what to do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2594.028,
    "end": 2603.863,
    "text": "Well, we do have some theories and some sense about what to do on certain situations, but",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2604.637,
    "end": 2633.648,
    "text": " it's quite a pity that we don't really have like a very uh scientific grounds for what to do in psychoanalysis so I think that's a really good point the other thing that's just come to mind is uh this this came up with this chapter in fact is so if we're working to minimize our free energy right and we sort of acting in a world to minimize surprise how do we avoid confirmatory bias",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2635.754,
    "end": 2660.192,
    "text": " you know so I'm thinking now that the world is flat so I I am going to reinforce that model because if I don't then that's going to create some uh free energy right it's going to create surprise so I'm going to act in the world I'm going to hang out with people who who don't challenge that and I'm thinking back into psycho um a psychiatry practice or counseling maybe uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.083,
    "end": 2684.475,
    "text": " people may have ingrained sort of models in the perceiving the world just based on that model um resulting confirm it's very biased yeah this is a is a very important topic especially as the as they put it existential imperative is self-evidencing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.894,
    "end": 2697.293,
    "text": " to repeatedly remeasure my body at homeostatic temperature, to be unsurprised about remeasuring myself at homeostatic temperature is to maintain homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.655,
    "end": 2711.193,
    "text": "So in reward learning, you would say, well, homeostatic temperatures are the most rewarding, that's the top of the reward function, and then we're gonna basically hill climb to get to the most rewarding body temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2712.295,
    "end": 2714.378,
    "text": "That's the reward learning paradigm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.51,
    "end": 2722.066,
    "text": " In Act-Inf, your preferences, your expectations, the C vector, is what you expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.387,
    "end": 2724.952,
    "text": "I expect to find myself at body temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2725.152,
    "end": 2726.395,
    "text": "That's the bottom of the bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.736,
    "end": 2733.109,
    "text": "I'd be the least surprised at 37C, and I'd get more surprised as I went out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.089,
    "end": 2760.379,
    "text": " and now we're going to go to the bottom of the bowl and we're going to pursue the most likely course of action bound our surprise with expected and variational free energy and so with the imperative as self-evidencing and surprise bounding we're going to pursue likely paths of action rather than with the imperative being reward learning the imperative is to maximize reward",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.304,
    "end": 2768.634,
    "text": " However, does self-evidencing mean that we seek out homophily?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.495,
    "end": 2773.22,
    "text": "Does it mean that we just shut our eyes and go into the dark room?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2773.24,
    "end": 2776.044,
    "text": "These are really important topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.084,
    "end": 2779.549,
    "text": "And for example, in the dark room problem,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.727,
    "end": 2783.251,
    "text": " It has been discussed for many years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.732,
    "end": 2798.354,
    "text": "People say, well, if the imperative of the generative model is to reduce surprise, then why don't people just go into sensory deprivation where there's highly predictable sensory inputs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.215,
    "end": 2802.16,
    "text": "And this has been discussed and addressed for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2802.721,
    "end": 2808.169,
    "text": "But the short answer is while you're in the room, reducing your uncertainty about your visual field",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.6,
    "end": 2830.258,
    "text": " you're increasing your uncertainty about a variety of other aspects that are required for operation of the organism and so you kind of net on balance uncertainty is rising while you're in the room which is why we are always adaptively moving around and seeking information and all of this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.234,
    "end": 2840.404,
    "text": " However, you can always set up a constrained or a toy generative model that exhibits any given limitation or pathology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.985,
    "end": 2844.628,
    "text": "That's not too surprising itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.649,
    "end": 2860.245,
    "text": "But to actually use this as an accounting system for the kinds of adaptive and interesting behavior that organisms do exhibit, that's the interesting piece, not whether you can make a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.343,
    "end": 2888.055,
    "text": " visual input only generative model that may select to be in a dark room but if you have an active visual entity that can turn on a light it may turn on the light or if it has a hunger uh cue it may need to seek food eventually so it's a little bit of a non-sequitur a kind of over interpretation of a thought experiment that's just really in a little bit of a um partial",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.082,
    "end": 2891.445,
    "text": " way trying to come at this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.506,
    "end": 2896.753,
    "text": "So you can imagine that there are situations where self-evidencing goes right and where it goes wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.316,
    "end": 2901.0,
    "text": "And that's exactly the space that we're exploring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.124,
    "end": 2913.418,
    "text": "A lot of times when I think about homeostasis and temperature, I think about, you know, like Huberman and many kind of biohackers want you to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2913.787,
    "end": 2940.925,
    "text": " uh you know experience cold contrast therapy and especially if you are sensitive to cold you know it's very important that you get in there and do your cold punch your cold showers and so that's that's i think that's an interesting example where you're changing that you know that set point basically by by doing other activities that seem opposite to what you know what would what would make you comfortable",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2943.318,
    "end": 2944.119,
    "text": " Cool, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.344,
    "end": 2949.644,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2954.849,
    "end": 2956.371,
    "text": "Any other thoughts or questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.411,
    "end": 2960.975,
    "text": "Or let's look at like one or a few of these asked questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.076,
    "end": 2963.638,
    "text": "Just a general question, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.658,
    "end": 2971.746,
    "text": "So when we post questions, because I posted that one, I had to go to the main table to post a question and then it feeds into the cohort four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2971.906,
    "end": 2972.987,
    "text": "Is that how it works?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2973.473,
    "end": 2996.14,
    "text": " couldn't actually post yeah directly into there yeah um all the uh it's it's all there's only one underlying questions object so each of these like different views so if you just go here and just like hit enter you'll add a new row and you can ask a question in cohort four and then that'll be like in chapter one and in cohort four",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2997.031,
    "end": 3021.013,
    "text": " um and so that it'll come up when we go to chapter one questions as well or you could um go the other way yeah or you could ask and but then it might not necessarily be tagged to cohort four but it doesn't really matter what cohort it you know as long as it's in the chapter that's a good place got it thanks cool well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.225,
    "end": 3047.001,
    "text": " um one distinction and and you know i look forward to seeing some of you um next week in the other time also discussing chapter one um or next week at this time where we'll be in chapter six with cohort four you're all welcome to join but a really key distinction that's that's um raised in figure 1.2",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3047.791,
    "end": 3067.572,
    "text": " is the high road and the low road and this is basically going to structure chapters two and three the low road is going to describe how the low road is basically Bayesian statistics that's how we're going to do cognitive modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.699,
    "end": 3071.664,
    "text": " But you could use Bayesian statistics to model anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.064,
    "end": 3073.647,
    "text": "You could do it on health records.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3073.707,
    "end": 3075.79,
    "text": "You could do it on weather data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.331,
    "end": 3082.941,
    "text": "So Bayesian modeling doesn't have to be about adaptive, cybernetic, autopoetic agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.722,
    "end": 3087.648,
    "text": "Bayesian statistics, the how can be about anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.668,
    "end": 3089.07,
    "text": "Chapter two, low road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.928,
    "end": 3117.589,
    "text": " chapter three is going to be the high road and the high road is like the kind of what or why and it's self-organized self-evidencing systems and so this describes more like the specifications for adaptive agents this is like what they need to be doing to be observed repeatedly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.89,
    "end": 3147.778,
    "text": " by an observer and or by themselves in this kind of like sophisticated reflexive sense but it doesn't necessarily say how that happens it turns out where the why and the how meet is active inference we're going to be using Bayesian statistics that's how to model adaptive cybernetic entities that's why and so that's kind of going to be explored in the chapters two and three low road high road",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.015,
    "end": 3160.528,
    "text": " So that's kind of the big structuring motif, ultimately, of this textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.861,
    "end": 3171.362,
    "text": "Olivier?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.704,
    "end": 3173.665,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3174.64,
    "end": 3179.846,
    "text": " In the figures, there is an order, you know, in all the items on the lower road and the high road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3181.367,
    "end": 3186.973,
    "text": "Is the order important to understand anything or just, you know, one group and another group?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3189.476,
    "end": 3191.599,
    "text": "It's a schematic ordering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3191.759,
    "end": 3197.465,
    "text": "I believe that there is a way to read them in order, but it's not an exhaustive or a unique ordering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.026,
    "end": 3203.972,
    "text": "So, for example...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.315,
    "end": 3216.551,
    "text": " Sorry, is someone closing the... Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.571,
    "end": 3223.742,
    "text": "So Bayes' theorem is just describing basically tautological statements about conditional and joint probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.944,
    "end": 3232.535,
    "text": "This gets used in a generative model, which is basically a model that can be used in a recognition capacity or in a generative capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.556,
    "end": 3234.178,
    "text": "That's the tail of two densities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.863,
    "end": 3240.791,
    "text": " In simple settings or passive settings, we're interested in perception as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.093,
    "end": 3253.551,
    "text": "But once we go into the anticipatory or the predictive setting, we're interested not just in dealing with incoming streaming data, but basically making ongoing predictions, now casting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.539,
    "end": 3265.887,
    "text": " The next kind of into the unknown step that now casting can take is action as inference, because it's not enough to just deal with incoming streams of data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.907,
    "end": 3268.654,
    "text": "Sometimes you want to take the action to open the book to find out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.782,
    "end": 3296.903,
    "text": " that idea of perception and planning as inference is unified in the Bayesian brain and it turns out that variational Bayesian methods are going to give us some tractable optimizable approaches for approximate Bayesian computation where exact base probably doesn't apply or is really challenging just like we kind of mentioned earlier so that gets us to doing variational Bayesian optimization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.165,
    "end": 3322.587,
    "text": " on perception and planning as inference in the Bayesian brain that's active inference so that's kind of low road ordering the high road ordering is starting with the free energy principle which is a non-falsifiable principle just like the principle of least action in classical mechanics this is like a principle for informational systems and systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.786,
    "end": 3350.818,
    "text": " under this principle are seen as being in the game of self-organization via surprise minimization you'll continue to find yourself organized if you're continually minimizing your surprise about who and what you are that is um supported or described by a partitioning conditional independent structure called a markov blanket which we're going to explore",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.102,
    "end": 3361.655,
    "text": " And the Markov blanket can be seen as carrying out self-evidencing through this kind of anticipatory real-time predictive processing, which is related to predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.956,
    "end": 3378.375,
    "text": "And in the extended, embedded, inactive setting, that can be understood as basically self-authoring, self-meaningmaking, and ultimately even extended niche construction, which gets us to active inference from the high road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.553,
    "end": 3388.165,
    "text": " So again, not exhaustive or unique ordering, but certainly something that they have considered and laid out a certain way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.31,
    "end": 3396.217,
    "text": "Thank you everyone for this awesome chapter one discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3397.158,
    "end": 3405.51,
    "text": "I hope to see you either next week at the other time or whenever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.592,
    "end": 3414.639,
    "text": " And just leave a comment on this page here if you want to start up the math group, so thank you all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.585,
    "end": 3418.15,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]