[
  {
    "start": 6.049,
    "end": 31.171,
    "text": " hello and welcome to the active inference lab this is the active inference lab and the active inference live stream today we are in active inference live stream 18.1 on march 23rd 2021 welcome to the active inference lab everyone we're a participatory online lab that is communicating learning and practicing applied active inference you can find us at our links here the",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 31.772,
    "end": 36.815,
    "text": " This is a recorded and an archived live stream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 37.675,
    "end": 43.238,
    "text": "All backgrounds and perspectives are welcome here, and we'll be using good video etiquette for live streams.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 44.479,
    "end": 56.725,
    "text": "Today, we're in live stream 18.1 in our first of two participatory group discussions on the Predictive Global Neuronal Workspace paper, and we're with the authors here, Ryan Smith and Christopher White.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 56.825,
    "end": 59.387,
    "text": "So thanks to both of you for joining today.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 60.799,
    "end": 67.083,
    "text": " Today in 18.1, the goal is just going to be to discuss and learn and ask some questions about this awesome paper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 67.924,
    "end": 70.346,
    "text": "And we're going to go through some introductions and warmups.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 70.566,
    "end": 75.649,
    "text": "And then I believe Christopher will have some slides to share with us and set some context.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 75.809,
    "end": 82.694,
    "text": "And then we'll just proceed with probably a bunch of questions that we all have about the paper, as well as some questions from the live chat.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 83.815,
    "end": 93.578,
    "text": " To get started, though, let's just go around and introduce ourselves and we can each just give a short introduction or check in and then pass it to somebody who hasn't spoken.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 94.158,
    "end": 95.078,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 95.378,
    "end": 101.54,
    "text": "I'm in California and I will pass it first to Dean Dean.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 101.62,
    "end": 106.321,
    "text": "I'm up here in Calgary in Canada and I'll pass to Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 108.507,
    "end": 109.447,
    "text": " Hello, I'm Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.507,
    "end": 114.629,
    "text": "I'm up in Toronto in Canada, and I'll pass it over to Christopher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.29,
    "end": 116.83,
    "text": "Hi, thanks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 117.19,
    "end": 118.211,
    "text": "I'm Christopher White.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 118.431,
    "end": 120.852,
    "text": "I'm a PhD student at the University of Cambridge.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 121.592,
    "end": 133.557,
    "text": "And this is, just to give some brief context, this paper is really a work that kind of came out of my master's thesis that I was doing with Ryan, but we've kind of continued on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 134.947,
    "end": 135.388,
    "text": " working on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 135.468,
    "end": 141.972,
    "text": "So hopefully we can chat about both this paper and then at some point chat about some things that we've been continuing on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 142.733,
    "end": 144.514,
    "text": "And so I'll pass to Blue.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 144.534,
    "end": 149.278,
    "text": "Hi, I'm Blue Knight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 149.298,
    "end": 156.663,
    "text": "I am an independent research consultant based out of New Mexico, and I will pass it to Dave.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 158.916,
    "end": 164.44,
    "text": " Dave Douglas, I'm in the mountains of the northern Philippines where it's almost the end of spring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 164.46,
    "end": 176.668,
    "text": "I'm retired from IT, especially from machine translation, working on the semi-technical aspects of our education project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 179.189,
    "end": 180.25,
    "text": "And then I believe Ryan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 182.226,
    "end": 183.848,
    "text": " Yeah, so I'm Ryan Smith.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 184.489,
    "end": 188.152,
    "text": "I'm an investigator at the Laureate Institute for Brain Research.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 188.673,
    "end": 191.015,
    "text": "And I, yeah, we're in Tulsa, Oklahoma.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 191.095,
    "end": 195.039,
    "text": "Basically, I run a lab focused on computational neuroscience and computational psychiatry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 196.476,
    "end": 198.757,
    "text": " Well, I'm sure we'll talk a lot more about that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 199.397,
    "end": 208.902,
    "text": "Let's maybe just go right to Christopher's slides and then we can pick up just with conversation or with this slide deck as needed.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 208.942,
    "end": 213.505,
    "text": "But Christopher, go ahead and share your slides and I'll make them the full screen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 214.505,
    "end": 214.985,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 217.507,
    "end": 218.147,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 224.61,
    "end": 226.251,
    "text": "Okay, so I'm assuming you can see my hand.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 227.321,
    "end": 256.055,
    "text": " yeah screen are you seeing we're seeing our jitsi ah okay how about now yep looks good okay well i now i it seems like i can't both look at the even with the dual monitor set up it doesn't seem like it it wants to share the same screen that jitsi is on and that's okay so it means i just can't see anyone um so just give me a shout um so this this is these are slides that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 256.645,
    "end": 259.707,
    "text": " from a talk I gave at UCL about Midway through last year.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 263.008,
    "end": 273.133,
    "text": "And so I may need some reminding of bits of this paper because we did write it quite a while ago, although it did only just get published in December last year.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 274.934,
    "end": 284.598,
    "text": "Okay, so the idea with this paper was really just to kind of formalize some things that had been around in the literature",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 285.199,
    "end": 292.563,
    "text": " for a while and namely putting global workspace theory into kind of a predictive processing framework.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 294.985,
    "end": 300.468,
    "text": "And so there'd been, so Carl Friston has a really nice 2012 paper that kind of did this somewhat formally.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 301.528,
    "end": 306.771,
    "text": "Jacob, but it didn't really connect that deeply with the global workspace literature at all really.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 308.352,
    "end": 312.995,
    "text": "Jacob had in chapter 10 of his 2013 book, Jacob Hovey, sorry,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 314.597,
    "end": 342.85,
    "text": " has a really wonderful chapter where he discusses the relationship between phenomenal unity and global workspace theory and how predictive processing framework in general and active inference kind of broadly conceived fit in with global workspace theory and how these ideas can kind of help make sense of some puzzles within global workspace theory and also kind of give predictive processing a theory of consciousness as it were.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 345.249,
    "end": 367.017,
    "text": " And then in terms of, I published a brief paper kind of building on Jakob's work where I kind of said, hey, here's, that's where the predictive global neural workspace comes from, or that term, which is just a term that I kind of want to introduce just to denote basically kind of predictive processing approaches to a global workspace style architecture.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 369.338,
    "end": 372.58,
    "text": "And so when Ryan and I started chatting because of that paper,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 374.46,
    "end": 382.764,
    "text": " Really, our goal was to put some fairly vague conceptual ideas into a more computationally precise framework, and that's what we did here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 385.185,
    "end": 395.17,
    "text": "And so the idea was really just to use a fairly straightforward, deep, temporal, partially observable Markov decision process, solved via active inference, and show how",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 397.318,
    "end": 410.868,
    "text": " by kind of tuning some of the parameters, you can get basically all of the global work, a very large section of the global workspace literature and all of those empirical results kind of just falling straight out of the model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 411.689,
    "end": 417.113,
    "text": "And what's I think really important to me, so my background is in cognitive science and philosophy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 417.794,
    "end": 425.279,
    "text": "And so I did my undergrad in cognitive science and did my master's in a computational cognitive neuroscience lab.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 427.017,
    "end": 432.882,
    "text": " And so, although I work on for a long time for a while is really interested in visual awareness and visual consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 433.262,
    "end": 434.723,
    "text": "I was around a lot of experimentalists.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 437.525,
    "end": 443.37,
    "text": "And it's really important to me that all of these ideas are testable and we actually specify testable predictions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 444.531,
    "end": 456.2,
    "text": "And so really what we were doing in this paper was trying as best we could to one reproduce a bunch of existing results, but also kind of extend the model and show where it actually gave testable predictions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 457.774,
    "end": 461.876,
    "text": " And some of those have actually been confirmed recently, which is kind of nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 463.437,
    "end": 467.359,
    "text": "So I'll just kind of flip through some things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 467.379,
    "end": 468.84,
    "text": "There are just a couple of things I want to highlight.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 469.14,
    "end": 471.901,
    "text": "And so the first thing is just to kind of define terms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 473.482,
    "end": 478.224,
    "text": "So we called it an active inference model of visual consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 478.384,
    "end": 487.389,
    "text": "And that was really just a kind of, so consciousness is the way I think about it, at least maybe this is somewhat idiosyncratic, but consciousness to me is just a kind of a catch-all term.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 489.069,
    "end": 489.91,
    "text": " It isn't one thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 491.17,
    "end": 496.273,
    "text": "There are lots of sub things within consciousness that I think can come apart.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 496.634,
    "end": 505.839,
    "text": "And so Block kind of very famously in 1995 proposed the term access consciousness, where this is just content that can be reported from the first person perspective.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 505.859,
    "end": 508.641,
    "text": "And it is available to kind of cognitive control processes and working memory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 508.801,
    "end": 509.621,
    "text": "That's not a quote from him.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 509.641,
    "end": 511.782,
    "text": "That's kind of me paraphrasing, but that's roughly speaking the idea.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 512.283,
    "end": 517.786,
    "text": "And so that allows room for there to be other processes or unconscious processes, say in the visual system,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 518.411,
    "end": 523.094,
    "text": " of which you aren't aware and, but can nonetheless influence behavior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 523.114,
    "end": 537.363,
    "text": "And he then also proposes, say his chief in that paper, his chief kind of worry is distinguished between access consciousness and phenomenal consciousness where phenomenal consciousness is kind of the experiential aspect of this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 537.443,
    "end": 543.007,
    "text": "And he thinks that they, so this is now, and he thinks that they can come apart and that's what's controversial.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 543.067,
    "end": 546.549,
    "text": "So I don't personally agree that they can come apart, but I think it's a,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 547.333,
    "end": 568.477,
    "text": " a useful distinction nonetheless and so i think in terms of thought experiments i don't remember where it might not be it might be in that paper it might be elsewhere but he's kind of talked about the example that at least to me was really intuitive was if you imagine someone with a jackhammer or if you're doing if you're working at a desk and you can hear a jackhammer in the background you might",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 571.566,
    "end": 577.551,
    "text": " At some point, you will become aware of the jackhammer, but it was kind of a part of your experience all along.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 577.731,
    "end": 579.533,
    "text": "You just weren't aware of it, in a way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 580.553,
    "end": 584.236,
    "text": "And to me, that sounds rather odd, but that's fine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 584.316,
    "end": 585.758,
    "text": "We can set that aside.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 585.938,
    "end": 587.039,
    "text": "We're just defining terms here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 587.539,
    "end": 589.16,
    "text": "Yeah, I mean, obviously, I agree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 589.2,
    "end": 597.607,
    "text": "I mean, I think there's lots of cases like inattentional blindness and change blindness and things like that where you might think you were aware of something the whole time, but actually you weren't.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 597.647,
    "end": 598.708,
    "text": "But anyway, side thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 599.321,
    "end": 599.902,
    "text": " Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 599.942,
    "end": 604.686,
    "text": "I think like there are people I think I've forgotten who coined this term, but it's like the refrigerator light illusion.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 605.307,
    "end": 607.849,
    "text": "Like you open the refrigerator and the lights on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 607.889,
    "end": 608.81,
    "text": "Do you think it was always on?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 609.571,
    "end": 609.931,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 611.233,
    "end": 612.013,
    "text": "I have a nice analogy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 613.014,
    "end": 615.937,
    "text": "OK, so just briefly about the global workspace.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 616.157,
    "end": 623.945,
    "text": "So this idea kind of started in the late 80s with Bernard Barr's and was then Stan Hahn's group really just took it and ran with it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 625.398,
    "end": 642.546,
    "text": " And so the idea is roughly speaking, there's this prefrontal parietal network that connects in like kind of motor processes, attentional processing, perceptual systems, memory, and all of these systems are in some sense competing for access.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 644.207,
    "end": 652.971,
    "text": "And they are otherwise relatively kind of modular and disconnected, but when they, what is access to the global workspace or the content that kind of wins",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 654.466,
    "end": 657.108,
    "text": " Gains access to global workspaces broadcast throughout the system.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 657.128,
    "end": 666.075,
    "text": "So it enables kind of otherwise isolated subsystems to share information in a common format.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 668.676,
    "end": 672.439,
    "text": "And he's identified this with a prefrontal-parietal network.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 674.02,
    "end": 676.802,
    "text": "And this, like prima facie, there's quite a bit of evidence for this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 677.082,
    "end": 680.465,
    "text": "So across meta-analysis in report paradigms,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 681.451,
    "end": 686.674,
    "text": " So actually people kind of like actually report their experience in binocular rivalry and phenomenal masking.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 688.515,
    "end": 696.86,
    "text": "There is a network of frontal parietal regions that is active for conscious, but not unconscious.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 697.44,
    "end": 698.04,
    "text": "You're cut off.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 698.08,
    "end": 698.661,
    "text": "We can't hear you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 699.321,
    "end": 699.661,
    "text": "Oh, really?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 700.042,
    "end": 701.442,
    "text": "I can actually still hear him.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 702.803,
    "end": 704.024,
    "text": "Oh, maybe it was just me then.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 704.404,
    "end": 704.924,
    "text": "Oh, good.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 705.024,
    "end": 705.265,
    "text": "Oh, good.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 705.305,
    "end": 705.705,
    "text": "No worries.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 705.745,
    "end": 707.046,
    "text": "Thanks for pointing it out there, Ryan.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 707.506,
    "end": 709.307,
    "text": "And yeah, continue along.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 709.327,
    "end": 709.487,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 710.236,
    "end": 718.102,
    "text": " Yeah, so there's basically, the long and the short of it is that across meta-analyses, there actually does seem to be quite a bit of evidence for the view that there's this fronto-paranal network.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 719.223,
    "end": 722.865,
    "text": "And this story gets more complicated when we get into no-report paradigms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 722.926,
    "end": 728.87,
    "text": "Maybe we can chat about that at the end or next session, because that's kind of the work that Ryan and I are really kind of concentrating on at the moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 731.552,
    "end": 738.117,
    "text": "Okay, I think we can, so I'll just kind of talk briefly about these two and then kind of move on to the model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 740.206,
    "end": 747.893,
    "text": " Um, so the idea, so basically in a cross event related, um, potential studies.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 748.193,
    "end": 754.159,
    "text": "So this is a kind of meta contrast marketing study on the right, on the left and on the right, there's an attentional blink.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 755.12,
    "end": 755.9,
    "text": "I think goodness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 755.98,
    "end": 756.401,
    "text": "Yes, it is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 756.421,
    "end": 764.368,
    "text": "Um, basically what you can see is that there's this red line on the left and there is this little P3 it's literally labeled with a P3 B here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 765.959,
    "end": 794.41,
    "text": " and there is this late kind of seemingly non-linear all or nothing event-related potential over frontocentral electrodes that seems to characterize reported versus non-reported consciousness content sorry reportable rather not not and what this actually this is actually I should just flag for anyone who's kind of actually in the neuroscience of consciousness who is watching this this is no longer considered a",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 795.22,
    "end": 796.361,
    "text": " neural corollary of consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 796.481,
    "end": 797.222,
    "text": "And I agree with that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 799.283,
    "end": 801.504,
    "text": "It seems to drive, be driven by task demands.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 802.265,
    "end": 810.891,
    "text": "But nonetheless, it is still a question why it is that when something is conscious and task relevant, you get a P3B.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 811.511,
    "end": 812.852,
    "text": "And that's kind of what we tackle in the paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 816.394,
    "end": 824.88,
    "text": "And so really all of the evidence for the global workspace theory, I think it can be summed up quite nicely with this 2006 kind of taxonomy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 825.487,
    "end": 831.79,
    "text": " And so the idea is that you can orthogonally manipulate stimulus strength and attention.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 832.93,
    "end": 837.572,
    "text": "So stimulus strength, you might just imagine that either might be like time of presentation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 837.612,
    "end": 842.874,
    "text": "So if you have a classic kind of masking experiment, you'll have, I don't know, it might be a Gabor patch.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 843.414,
    "end": 846.175,
    "text": "Then just after it, there'll be some static noise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 846.836,
    "end": 851.998,
    "text": "And the static noise kind of masks, is the mask to the Gabor patch.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 852.018,
    "end": 855.079,
    "text": "And depending on the time, kind of the distance between",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 855.543,
    "end": 861.967,
    "text": " the mask and stimulus, you can render something unreportable.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 862.047,
    "end": 866.229,
    "text": "So, and nonetheless, it can still in some circumstances influence behavior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 867.73,
    "end": 874.214,
    "text": "And so you can imagine that stimulus strength might be something like either you can, you could get, it might be contrast.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 874.254,
    "end": 875.835,
    "text": "It might be the distance between the mask.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 875.875,
    "end": 876.855,
    "text": "You could do both.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 876.875,
    "end": 880.177,
    "text": "It doesn't really matter for our very course purposes here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 883.259,
    "end": 884.88,
    "text": "And then in terms of,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 885.492,
    "end": 886.793,
    "text": " you can also vary attention.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 886.873,
    "end": 889.795,
    "text": "So either have attention to the task or attention to be distracted away.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 889.975,
    "end": 897.22,
    "text": "And the idea is that when there's a weak bottom-up signal and attention is absent, you basically just get very little activity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 897.42,
    "end": 901.303,
    "text": "It's whatever activity there is, it's confined to very early striate cortex.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 902.324,
    "end": 914.833,
    "text": "When you have attention is present, but the signal is still weak, you get some priming, but it's still unavailable for report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 915.818,
    "end": 944.191,
    "text": " and so at that level it starts to influence behavior then at kind of the pre-conscious level or what they call pre-conscious borrowing a term from freud um this is where this is this is attention inattentional blindness effectively so you have a very strong stimulus the gorilla can be walking across the room and wave at you it can be in the dead middle of the fovea and yet people still won't report it and the idea is the idea this is kind of activity that's still very strong it's within the visual system but it's kind of gated out of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 945.399,
    "end": 970.557,
    "text": " awareness via a lack of attention at least most of the time and then when in this last quadrant here when you're attending something and there's a strong signal you get this widespread kind of bifurcation in neural activity that characterizes aware versus unaware states and so we kind of had or",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 971.084,
    "end": 980.892,
    "text": " Tim Jones- You personally, I had a couple of reasons, those are a couple of reasons to be a bit suspicious about this, and I actually do think web workspace theory has been updated to kind of accommodate these but nonetheless we'll go through them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 980.912,
    "end": 993.984,
    "text": "Tim Jones- So basically unconscious information can still be decoded from frontal regions so pfc activity is not synonymous with consciousness, so the idea is that you could might have.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 995.796,
    "end": 1003.179,
    "text": " The idea that there is just a global workspace and you enter it loosely associated with PFC and entering it is sufficient for consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1003.199,
    "end": 1003.879,
    "text": "This can't be right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1005.84,
    "end": 1006.86,
    "text": "They have a solution to this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1007.221,
    "end": 1016.404,
    "text": "They then basically introduced a Bayesian model of conscious report where consciousness also requires a stimulus representation to be separable from a noise distribution.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1017.225,
    "end": 1018.205,
    "text": "I really like this model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1019.626,
    "end": 1022.747,
    "text": "In the beginning of my master's thesis, I spent a lot of time kind of like playing around with the code.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1022.787,
    "end": 1023.227,
    "text": "It's really cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1024.076,
    "end": 1026.578,
    "text": " But it's an ideal Bayesian observer.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1027.338,
    "end": 1029.539,
    "text": "It doesn't really give any neural predictions at all.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1030.1,
    "end": 1031.861,
    "text": "I don't know.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1032.061,
    "end": 1033.482,
    "text": "And that's fine limitation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1034.022,
    "end": 1035.163,
    "text": "It's an ideal Bayesian observer.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1037.144,
    "end": 1043.167,
    "text": "That still would be nice if we had something a little bit more neurally detailed.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1044.408,
    "end": 1048.31,
    "text": "Christopher, could you actually just unpack that slide 13?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1048.39,
    "end": 1052.473,
    "text": "Just what are the disks representing and how does this relate to Bayesian statistics?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1053.602,
    "end": 1054.182,
    "text": " Oh yeah, sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1054.262,
    "end": 1057.164,
    "text": "So basically each of these axes is a source of evidence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1057.644,
    "end": 1075.272,
    "text": "So evidence for stimulus Y, evidence for stimulus X, and then basically these two colored lines, the pink colored line or the green colored line correspond to different decision criteria that you're imposing on a space.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1077.068,
    "end": 1089.697,
    "text": " So the idea is that two alternative forced choice tasks where you're forced to choose between two things versus report something as present or absent actually employ different decision criteria.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1090.818,
    "end": 1104.968,
    "text": "And so you can imagine these as essentially a multivariate, each of these as a Gaussian distribution, each of these circles as kind of a univariate Gaussian distribution, where if you are in the blue, you",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1105.62,
    "end": 1107.842,
    "text": " that's kind of stimulus to the left.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1108.403,
    "end": 1114.028,
    "text": "If you're all the way to the right or on the X axis, that is stimulus on the right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1115.029,
    "end": 1121.315,
    "text": "Um, where, and then this green thing kind of close to the, around the origin is a noise distribution.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1121.335,
    "end": 1122.636,
    "text": "So this is just saying there's nothing there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1123.016,
    "end": 1129.883,
    "text": "And basically what conscious audit awareness is on this account is basically these, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1131.397,
    "end": 1140.162,
    "text": " distributions or either left or right being far enough away from the origin that they don't overlap substantially with the noise distribution.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1140.282,
    "end": 1145.525,
    "text": "So when you impose the decision criteria on the space, you are confident that you have seen something.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1148.047,
    "end": 1148.867,
    "text": "Does that kind of make sense?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1149.468,
    "end": 1149.728,
    "text": "Nice.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1149.808,
    "end": 1150.168,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1150.188,
    "end": 1151.169,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1151.549,
    "end": 1152.129,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1152.189,
    "end": 1156.512,
    "text": "And then seen versus unseen ignores the noise distribution.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1156.592,
    "end": 1158.353,
    "text": "It's just separates left versus right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1160.325,
    "end": 1161.586,
    "text": " So really cool model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1161.626,
    "end": 1166.248,
    "text": "I really like it, but yeah, unfortunately not quite as nearly detailed as I would like.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1167.848,
    "end": 1170.87,
    "text": "Second problem is the P3B does not equal awareness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1172.871,
    "end": 1175.592,
    "text": "So these are two paradigms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1175.752,
    "end": 1179.954,
    "text": "So it's now being replicated in a no report condition basically",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1180.888,
    "end": 1194.772,
    "text": " There's really sophisticated experimental techniques that allow you to basically access or gain access to a person, make inferences about what a person saw without having them make explicit reports.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1195.092,
    "end": 1201.334,
    "text": "And when that happens, you see that basically the P3B, which was at one point taken to be a signature of awareness, just vanishes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1201.874,
    "end": 1203.214,
    "text": "And that's a bit of a problem.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1204.775,
    "end": 1206.015,
    "text": "So I'd like an explanation of that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1207.87,
    "end": 1213.633,
    "text": " And then the last one isn't really a problem so much as just a point of absence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1213.773,
    "end": 1222.858,
    "text": "So there's a really large body of evidence showing that expectation seems to be a pretty crucial factor in determining the content of visual consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1224.699,
    "end": 1231.502,
    "text": "So across paradigms, continuous flash suppression, monocular rivalry, motion-induced blindness, blah, blah, blah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1231.682,
    "end": 1236.865,
    "text": "There's all of these areas where to show that expectations probably along the lines of similar to attention",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1238.132,
    "end": 1260.292,
    "text": " should be a part of part of any taxonomy or any taxonomy that claims to kind of try to be complete of the factors underlying conscious access and the global neural workspace as it stands doesn't really describe how expectations are implemented um and so our job or what we saw",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1261.587,
    "end": 1281.653,
    "text": " ourselves is doing really in this paper was just to kind of show how we could account for all of this existing work, namely the taxonomy, and also explain how the P3B doesn't equal awareness or show how that dissociation arises very naturally.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1282.333,
    "end": 1288.575,
    "text": "And three, show how expectations could be plausibly be implemented and give kind of a more",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1290.285,
    "end": 1296.889,
    "text": " give a model that generates predictions about expectations, I should say, and has a story about how they implement it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1300.03,
    "end": 1300.971,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1301.051,
    "end": 1304.292,
    "text": "And I think the real thing is it's okay to revise a model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1304.833,
    "end": 1310.176,
    "text": "Like revising models is, that's just good science.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1312.077,
    "end": 1314.818,
    "text": "And I think one of the parts",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1315.262,
    "end": 1325.171,
    "text": " global workspace theory that made me a little bit suspicious lately is that the revisions of problem one and two, they didn't generate surplus neural predictions, really.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1325.612,
    "end": 1335.141,
    "text": "They were just kind of, they abandoned the P3B as a signature of conscious access and they endorsed an ideal Bayesian observer model of subjective reports.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1335.541,
    "end": 1339.065,
    "text": "But neither of those things, they were kind of responses",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1339.901,
    "end": 1345.662,
    "text": " to problems that didn't themselves generate new predictions that go on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1347.762,
    "end": 1352.203,
    "text": "And that's kind of a characteristic of what's been called degenerative research programs by Lakota.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1355.404,
    "end": 1365.585,
    "text": "And so, I mean, we can argue about whether this is a fair characterization of global workspace theory, but I think this is kind of at least a nice way of setting up where we were coming from.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1365.605,
    "end": 1368.746,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1369.688,
    "end": 1375.573,
    "text": " Would you like to give a primer on active inference of partial observable Markov decision processes?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1375.693,
    "end": 1378.316,
    "text": "I'm not sure how much more you want me to talk or whatever.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1379.337,
    "end": 1382.119,
    "text": "I mean, this was an hour long.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1382.419,
    "end": 1385.842,
    "text": "I have an hour worth of slides, so I could talk forever.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1386.163,
    "end": 1389.846,
    "text": "But maybe do you want me to skip to the results or just summarize the model or what?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1390.492,
    "end": 1393.174,
    "text": " Let's actually hear your take here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1393.214,
    "end": 1395.015,
    "text": "This is just a really awesome presentation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1395.135,
    "end": 1405.703,
    "text": "And then everybody here, maybe let's write down a question or two, so then we can have another, however many minutes you want of the slides, have about an hour or a little more for questions, and then we'll have next week for questions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1405.743,
    "end": 1409.025,
    "text": "But it's really great to get this information out there, because the way you're sharing it is awesome.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1410.026,
    "end": 1410.426,
    "text": "Yeah, cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1410.546,
    "end": 1410.726,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1410.906,
    "end": 1416.31,
    "text": "Well, I'll try and be a little bit more detailed when I go through the slides, because I've kind of just been clicking through things at the moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1416.49,
    "end": 1418.832,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1421.713,
    "end": 1430.697,
    "text": " So what, just a brief, this is, this is a little bit of a point of confusion and Ryan may want to kind of come up, describe this as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1430.757,
    "end": 1432.477,
    "text": "So what is active inference?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1432.537,
    "end": 1437.119,
    "text": "Well, it's both a noun and a verb and as a noun, it's kind of, you can use it to describe two things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1438.4,
    "end": 1446.523,
    "text": "It's a, it's just a mathematical framework that allows one to formulate models of kind of behavior using equations that are kind of justified a priori.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1447.957,
    "end": 1451.44,
    "text": " from a very general set of assumptions about the nature of self-organizing systems.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1452.201,
    "end": 1473.437,
    "text": "It's also that you can attach a process theory to that mathematical framework that allows you to give predictions about various neurophysiological variables, like firing rate of neuronal populations, ERPs, and kind of how neuromodulators like dopamine or noradrenaline affect things like firing rate and ERPs, and also behavior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1475.339,
    "end": 1500.212,
    "text": " also used as a verb and especially in kind of maybe pre-2016 literature that's basically what it was it was basically an extension of predictive coding to motor control and so people often use active inference just as a catch-all for basically the predictive coding version of motor control and there's been all sorts of confusion in the literature where people are taking kind of active inference as",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1501.331,
    "end": 1504.554,
    "text": " a theory basically of Markov decision processes, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1504.574,
    "end": 1513.382,
    "text": "And they're conflating that, and because Markov decision processes, being a decision process, is kind of a model of Bayesian decision, Bayes optimal decision making.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1514.283,
    "end": 1526.194,
    "text": "And then if that's conflated with a theory of motor control, or you use a motor control account of decision making, you're going to get, say, bizarre things that don't actually track what's going on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1527.697,
    "end": 1537.884,
    "text": " Yeah, I mean, I would, that's the main point, if anything, that I would, you know, kind of, you know, fully emphasize is that, like, old active inference is a theory of motor control.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1537.904,
    "end": 1538.825,
    "text": "I think it's old, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1538.845,
    "end": 1539.806,
    "text": "I mean, people still do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1540.342,
    "end": 1556.805,
    "text": " But at the inference where that just means, you know, like, hold a prior constant and make a reflex arc, move the body to, you know, minimize the prediction error with respect to that prior about, say, like, you know, like, proprioceptive position or something like that, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1557.125,
    "end": 1563.686,
    "text": "That's just a theory about once you've decided what to do, how to get the body to move accordingly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1563.706,
    "end": 1569.607,
    "text": "That doesn't have anything to do with deciding what to do accordingly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1570.202,
    "end": 1593.191,
    "text": " you know before trying to implement right so another control thing is just you know how do i move how do i get the body to move how i want to using something predictive coding ish right whereas you know we're talking about kind of like current reference is is again it's a it's a theory of decision making um which is like totally different i really think these these these",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1593.626,
    "end": 1599.07,
    "text": " There should be two different terms, right, for these things now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1599.17,
    "end": 1601.652,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1602.272,
    "end": 1602.573,
    "text": "Thanks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1602.873,
    "end": 1604.234,
    "text": "And Stephen, do you have a quick question?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1605.715,
    "end": 1607.236,
    "text": "Yeah, I'd just be curious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.316,
    "end": 1620.446,
    "text": "As you're here, you're doing work in this paper here with the neuronal context of how deductive choices are made, and it taps to the phenomenological context",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.666,
    "end": 1644.122,
    "text": " questions as well do you think that's when these you see these problems happen a lot because when when people are you're trying to move between different aspects of um fields of practice which are sometimes thought about separately you know phenomenology phenomenology is often talked about in the inactivist field and you've got the neuroscience and they're often clean and separate but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.046,
    "end": 1658.691,
    "text": " when you need to bring them together and try and talk about this bigger picture, the distinction, the distinctions you're making become even more important, if that makes sense, because it seems to be a lot of conflation that happens with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.711,
    "end": 1660.111,
    "text": "So I'll just be interested in your thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.832,
    "end": 1669.555,
    "text": "Um, so I think one thing to say is, so I, I like an activism, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1670.12,
    "end": 1672.841,
    "text": " especially what's kind of been called computational and activism.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1672.941,
    "end": 1675.841,
    "text": "I've forgotten, there was a really awesome paper out in Synthes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1676.361,
    "end": 1680.882,
    "text": "I've forgotten the name of that author, but sorry about that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1681.683,
    "end": 1692.925,
    "text": "But to me, that stuff doesn't really have that much to do with what I would call consciousness or what I think of as consciousness as like a cognitive scientist, I suppose.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1694.678,
    "end": 1700.903,
    "text": " When I think of awareness, I think of a very sharp, my explanatory, the thing that I'm trying to explain is very specific.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1701.964,
    "end": 1710.791,
    "text": "It is there are these states of which you are unaware, some of which you can become aware of, say, for example, like the inattentional blindness case.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1712.09,
    "end": 1713.111,
    "text": " or in phenomenal masking.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1713.551,
    "end": 1715.912,
    "text": "In some cases, there is a visual stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1716.073,
    "end": 1724.437,
    "text": "In one case where it's unaware and there's a very small change, physical change to the stimulus, but there's this radical nonlinear change in whether you can report it or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1725.778,
    "end": 1732.242,
    "text": "I'm interested in that contrast between reportable stimuli and non-reportable stimuli.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1732.922,
    "end": 1740.947,
    "text": "Now, along with that comes when stimuli are reportable, generally speaking, there is a, we might also be interested in",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1742.248,
    "end": 1748.933,
    "text": " in characterizing the content of experience, as it were, not just the availability for report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1749.834,
    "end": 1752.856,
    "text": "So we're going to get to that actually towards the end of the presentation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1752.896,
    "end": 1757.899,
    "text": "We actually do endorse a version of the Phenomenal Access Consciousness Distinction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1760.922,
    "end": 1768.407,
    "text": "But really, I think to answer, to repeat myself somewhat and answer the question,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1769.195,
    "end": 1776.32,
    "text": " All that I'm trying to explain with this model is that distinction between content that's accessible and content that's not accessible.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1776.781,
    "end": 1778.282,
    "text": "Everything else, I don't really mind.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1778.502,
    "end": 1780.283,
    "text": "Like, people can call it whatever they like.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1782.064,
    "end": 1783.085,
    "text": "I'm not interested in modeling it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1784.626,
    "end": 1784.887,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1784.947,
    "end": 1794.774,
    "text": "So, I mean, in general, right, I mean, again, this just speaks to kind of having precise theoretical constructs and having a good kind of taxonomy of these things within a particular area.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1795.487,
    "end": 1805.363,
    "text": " And also, you know, if you're going to try to do any kind of interdisciplinary work, right, where you have constructs in one kind of field and you want to find some way to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1806.129,
    "end": 1835.614,
    "text": " map them onto, right, or translate them into what you think they ought to be, right, in some other, you know, in some other theoretical language, right, then, I mean, then also specifying that in a precise way and how you kind of recover one from the other in terms of the way they're operationalized empirically, right, I mean, it's also something that you have to do, right, to do this work well, you know, so, I mean, like, you know, Chris already started, right, to kind of describe people",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1836.499,
    "end": 1839.582,
    "text": " really loosely, at least not in all cases.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1839.782,
    "end": 1841.183,
    "text": "Obviously, some people are very precise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1841.323,
    "end": 1854.894,
    "text": "But in some cases, the word consciousness or awareness gets thrown around to mean a ton of different things, which makes it confusing and also makes the term imprecise and therefore not really all that useful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1856.836,
    "end": 1874.407,
    "text": " For instance, there's a distinction that people make between what we're talking about, whether a particular content, particular represented content in the brain, if people report experiencing it versus if people report not experiencing it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1875.468,
    "end": 1880.051,
    "text": "But then there's also some people talk about levels of consciousness, which is a totally different thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1880.411,
    "end": 1883.933,
    "text": "That's like being in a coma versus being in a minimal coma.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1884.394,
    "end": 1892.741,
    "text": " you know, like a vegetative state versus, um, you know, being like awake, but really sleepy, you know, versus being really alert, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1892.761,
    "end": 1893.421,
    "text": "That kind of thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1894.242,
    "end": 1896.924,
    "text": "Um, you know, and there's, which is a totally separate thing, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1896.944,
    "end": 1901.448,
    "text": "I mean, you can kind of think of one as a, as a precondition in some sense for another, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1901.488,
    "end": 1907.993,
    "text": "Like you have to be in a level of consciousness that corresponds to being awake, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1908.313,
    "end": 1912.136,
    "text": "To have any, you know, or, or again, or like dreaming, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1912.54,
    "end": 1925.003,
    "text": " But your brain has to be in a certain general state of consciousness level-wise to be able to have the experience of one particular content over another, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1925.123,
    "end": 1937.627,
    "text": "So that's just saying being awake is a precondition for studying the thing that we're interested in, which is why you become conscious of one thing versus another given very similar stimulus conditions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1937.647,
    "end": 1938.987,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1939.261,
    "end": 1942.803,
    "text": " You know, so there are, I mean, and there's more, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1942.923,
    "end": 1943.984,
    "text": "Different distinctions, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1944.024,
    "end": 1951.568,
    "text": "Like, I mean, like Bruce said, there's this, you know, distinction between, or, you know, potential distinction between phenomenal consciousness, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1951.608,
    "end": 1962.874,
    "text": "Just like the, what it's like to be experiencing something versus this access consciousness thing, which is roughly being aware of the thing you're experiencing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1964.375,
    "end": 1966.916,
    "text": "And like I said, several people think",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1967.421,
    "end": 1968.622,
    "text": " this kind of thing can come apart.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1969.822,
    "end": 1975.226,
    "text": "I also am very skeptical about that, you know, e.g.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1975.286,
    "end": 1979.228,
    "text": "the fridge light example that Chris mentioned earlier.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1980.389,
    "end": 1990.495,
    "text": "You know, I mean, like I said, at the end of this paper, we do in some sense describe how our model can identify something like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1991.175,
    "end": 2007.964,
    "text": " something like two different types of access, where one type of access is kind of what's minimally necessary for empirically verifiable phenomenology, whereas the other is more kind of what determines the actual reporting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2010.266,
    "end": 2018.19,
    "text": "So there is something like a distinction in our model, but it's not the standard kind of phenomenal consciousness versus conscious consciousness distinction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2019.079,
    "end": 2034.943,
    "text": " Um, but anyway, I mean, there's, so my point is there's all these different sorts of things, you know, you mentioned like, uh, so many mentioned like the, like, you know, phenomenal, like the literature where people just kind of describe, you know, the way that phenomenology is or kind of the dynamics and phenomenology and things like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2034.963,
    "end": 2040.664,
    "text": "And then also is like kind of completely different or kind of descriptive, you know, field, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2040.684,
    "end": 2045.685,
    "text": "That doesn't have to do with this distinction about what becomes, you know, experience versus not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2046.794,
    "end": 2063.914,
    "text": " So, I mean, the general kind of, I mean, this is already kind of like long-winded answer, but just, I think very precise terms and very precise mappings between terms in different fields are necessary to do this kind of thing well at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2064.134,
    "end": 2065.255,
    "text": "And that's not always the case.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2066.136,
    "end": 2067.858,
    "text": "I, yeah, just to briefly follow up on that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2069.975,
    "end": 2096.933,
    "text": " really what i'm interested in this is this kind of was put out in bernard bars he called it the goodness i might butcher this i've gone um basically a minimal contrast approach where you have some content of which you're aware some content which you're unaware and up to all of a up to some limit the the physical properties of the stimulus should be almost identical there might best be 10 milliseconds extra between the mask and the stimulus",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2097.455,
    "end": 2098.855,
    "text": " And that's the only thing that renders it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2099.076,
    "end": 2111.3,
    "text": "So then the idea there is that we can contrast the neuronal kind of consequences of being aware of a stimulus versus unaware, independent of hopefully the physical properties of the stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2113.801,
    "end": 2118.042,
    "text": "And so, so just to give an example and just to make sure that I'm being charitable.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2118.902,
    "end": 2127.065,
    "text": "So there was recently a special issue of, I'm fairly sure special issue of the journal of consciousness studies on like",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2128.139,
    "end": 2129.08,
    "text": " consciousness and plants.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2131.781,
    "end": 2137.544,
    "text": "And I guess one thing that I'm not entirely convinced of is that we're really talking about the same thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2138.164,
    "end": 2138.904,
    "text": "I think that's great.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2139.004,
    "end": 2143.626,
    "text": "And people smart, we should let smart people do what they want and study all of these things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2144.006,
    "end": 2155.912,
    "text": "But I'm not convinced, for example, that the process or it will take a lot of convincing to convince me that something like phenomenal conscious, whatever you want to call phenomenal consciousness in a tree or a plant is",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2156.698,
    "end": 2163.601,
    "text": " really has anything at all to do with this minimal contrast approach in like the neuroscience of consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2165.102,
    "end": 2165.322,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2165.342,
    "end": 2169.504,
    "text": "I mean, one, one other, one other thing, again, just like things kind of popping up in my head here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2169.664,
    "end": 2172.725,
    "text": "Um, I mean, it seems like we have a fair amount of time, so I don't think it's problematic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2173.385,
    "end": 2184.67,
    "text": "Um, and it's going on a bit here, but, um, um, well, okay, wait, I, now I totally, uh,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2185.539,
    "end": 2187.684,
    "text": " I totally had a blank on what I was going to say.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2189.218,
    "end": 2193.22,
    "text": " Well, I guess we can move forward.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2193.6,
    "end": 2193.86,
    "text": "Okay.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2194.36,
    "end": 2195.101,
    "text": "Thanks, Brian.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2195.141,
    "end": 2197.882,
    "text": "Also, maybe you could talk like a little closer into your microphone.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2197.902,
    "end": 2199.723,
    "text": "It gets a little quiet sometimes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2199.903,
    "end": 2200.203,
    "text": "Okay.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2200.483,
    "end": 2200.803,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2200.823,
    "end": 2201.144,
    "text": "All right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2201.484,
    "end": 2201.944,
    "text": "Continue.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2202.024,
    "end": 2205.366,
    "text": "And I'm really curious to see how active inference is going to play into this.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2205.666,
    "end": 2206.286,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2206.306,
    "end": 2206.526,
    "text": "Sorry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2206.586,
    "end": 2207.767,
    "text": "I just remember what I was going to say.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2208.567,
    "end": 2216.831,
    "text": "So I think another thing that sometimes gets plated is, is just representing things versus being aware of them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2217.857,
    "end": 2218.638,
    "text": " Um, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2218.678,
    "end": 2222.5,
    "text": "So, so, you know, like a major, so it's a, for example, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2222.52,
    "end": 2230.265,
    "text": "I mean, in the, in the act of the inference literature, there are other papers that describe, um, you know, things like Jacobian monism, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2230.305,
    "end": 2243.773,
    "text": "Is something that like, I'm like one of Carl's recent papers, um, you know, where, where more or less it's a story about how via the free energy principle, you can come to have systems where the internal states of the system",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2244.763,
    "end": 2251.226,
    "text": " From the parameterize or track in some way the states of the world outside of the system Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2251.286,
    "end": 2271.254,
    "text": "So so in a really broad sense you have some some some way in which the internal states are Representing or keeping track of right the external states That as a kind of representation Or that kind of seeds of internal representations of what's kind of going on out in the world but the idea of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2272.13,
    "end": 2282.738,
    "text": " you know, with this sort of literature is, is that the brain can represent a bunch of stuff at the same time, but only some of the stuff that's being represented becomes conscious at any given moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2283.398,
    "end": 2283.698,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2283.718,
    "end": 2286.04,
    "text": "So like I can flash like a word.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2286.499,
    "end": 2291.061,
    "text": " I can flash like, so unlike some studies, for instance, I could flash the word guilt for you really fast.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2291.761,
    "end": 2303.126,
    "text": "Um, and you won't report ever having seen the word guilt, but you'll, you'll actually behave in ways that are more consistent with, uh, feeling guilty or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2303.687,
    "end": 2304.007,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2304.267,
    "end": 2309.029,
    "text": "Or, or I mean, simpler like perceptual or semantic priming examples where you might flash something really quickly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2309.069,
    "end": 2315.292,
    "text": "Again, a person doesn't, um, you know, say they are aware of having seen anything, but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2315.805,
    "end": 2320.688,
    "text": " They'll say complete word stems in one particular way versus another, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2320.708,
    "end": 2323.41,
    "text": "If I flash an elephant for you really fast, you don't know I see it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2323.47,
    "end": 2324.27,
    "text": "You don't know you see it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2324.69,
    "end": 2328.633,
    "text": "And I give you like a word stem like E-L, you know, and it's like complete the word.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2328.673,
    "end": 2333.275,
    "text": "People are more likely to say elephant than they would be if you didn't flash it, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2333.315,
    "end": 2334.496,
    "text": "Or something like that, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2334.516,
    "end": 2339.259,
    "text": "So behavior is affected by something that was clearly caught, right, by the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2339.459,
    "end": 2344.402,
    "text": "But despite that it was represented, you didn't become aware of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2344.864,
    "end": 2345.024,
    "text": " Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2345.044,
    "end": 2354.087,
    "text": "So I just want to make that distinction as well, that being conscious of something is distinct from whether it, whether the brain actually, uh, in some sense knew it was there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2357.709,
    "end": 2357.889,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2358.289,
    "end": 2358.449,
    "text": "Yeah."
  },
  {
    "start": 2359.569,
    "end": 2359.81,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2359.97,
    "end": 2363.551,
    "text": "So, um, just the idea.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2363.571,
    "end": 2369.893,
    "text": "So we used a partial observer Markov decision process, um, as our model, a hierarchical one, I should say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2370.213,
    "end": 2374.595,
    "text": "Um, so this is just a single level Markov decision process and just very briefly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2375.388,
    "end": 2379.009,
    "text": " POMDPs, I'm just going to call them MDPs just for brevity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2380.949,
    "end": 2386.83,
    "text": "They describe transitions among kind of hidden, unobservable variables in the sensory data they generate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2386.87,
    "end": 2393.012,
    "text": "So you can have a hidden state of the world and the observations generated by that hidden state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2393.752,
    "end": 2403.594,
    "text": "And the goal of active inference is to infer the states and the sequences or action sequences or policies, pi, from the set of observations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2406.025,
    "end": 2408.847,
    "text": " And so I'll just kind of step through very basically how this would work.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2408.907,
    "end": 2418.334,
    "text": "So you could just have a very simple case right here where this is just a graphical representation of Bayesian inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2418.695,
    "end": 2430.023,
    "text": "We can just have a hidden state, and we have a prior over that state, and we have some likelihood mapping between that hidden state and some state of the world.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2431.524,
    "end": 2433.206,
    "text": "I think I'm getting feedback from someone's computer.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2435.424,
    "end": 2437.024,
    "text": " Okay, try again.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2438.345,
    "end": 2441.186,
    "text": "I think it's yours, Ryan.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2441.426,
    "end": 2447.627,
    "text": "I can see if I can... Continue, Christopher.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2447.687,
    "end": 2447.927,
    "text": "Thanks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2448.528,
    "end": 2449.268,
    "text": "Okay, thanks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2449.348,
    "end": 2449.708,
    "text": "That's better.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2450.768,
    "end": 2454.209,
    "text": "Yeah, it's funny how that messes with you.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2454.229,
    "end": 2458.69,
    "text": "We've got predictive models of when our speech timing should be coming in.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2458.81,
    "end": 2459.871,
    "text": "At least we know that you're awake.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2460.731,
    "end": 2460.911,
    "text": "Okay."
  },
  {
    "start": 2465.856,
    "end": 2472.678,
    "text": " So we've got, yeah, so this, this comes out to basically, if you then invert this model, this is just exact Bayesian inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2474.579,
    "end": 2480.061,
    "text": "Um, now if we start moving through time, we have to add in transition probabilities.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2480.141,
    "end": 2483.802,
    "text": "And so this just imagine this first level of model is just a Markov chain.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2484.363,
    "end": 2494.006,
    "text": "It's just, you have some initial state, you transition into your first state, then you have state transitions that govern how you, how those states change over time, but you also.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2494.602,
    "end": 2497.785,
    "text": " have variables that you don't ever get to see this Markov chain.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2498.325,
    "end": 2502.128,
    "text": "All you get to see is a set of observations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2502.889,
    "end": 2508.473,
    "text": "And so the idea is these observations are generated by these hidden states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2511.496,
    "end": 2519.402,
    "text": "And so the task of inverting these models is to infer the most likely hidden state conditioned on some stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2521.884,
    "end": 2539.809,
    "text": " And so you get this little sigma here is a softmax function, and basically you can derive message passing algorithms, or using message passing algorithms rather, you can derive very simple update rules that allow you to come up with posterior probabilities over states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2542.27,
    "end": 2548.675,
    "text": " And then actions under this framework are then just kind of state transitions that the agent has control over.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2549.295,
    "end": 2559.483,
    "text": "So you can imagine in like a psychophysics experiment, the actions, this is a super limited set of action space for the agent.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2559.783,
    "end": 2562.325,
    "text": "Basically they can hit left or right and they might be able to move their eyes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2563.194,
    "end": 2565.235,
    "text": " So those would be the policies that they can control.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2565.355,
    "end": 2569.376,
    "text": "Everything else, the state, the screen, those are hidden states, but they're just not transitions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2569.876,
    "end": 2572.777,
    "text": "Transitions between those hidden states aren't things that the agent can control.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2575.238,
    "end": 2578.639,
    "text": "Okay, so then in a way, so how do we select actions?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2579.059,
    "end": 2583.26,
    "text": "Well, we select actions according to the frangifunctional.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2583.98,
    "end": 2590.122,
    "text": "So this has two component and you select the action or the policy rather that is kind of,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2590.748,
    "end": 2593.589,
    "text": " best minimized expected free energy, where this has two terms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2594.009,
    "end": 2595.73,
    "text": "The first is the expected cost.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2597.35,
    "end": 2612.636,
    "text": "So this is kind of the KL divergence or the difference between our predicted outcomes, which is this Q here, and our predicted outcomes under some policy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2615.017,
    "end": 2618.398,
    "text": "So what the outcome I expect, given that I take a certain action.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2619.179,
    "end": 2645.09,
    "text": " and the predict and just our um and our preferred observations so these are things like having preferences for winning versus losing um where the agent generally but you can encode the agent wants to win or not to lose or something like that the second term here this is the exploratory component this is the expected ambiguity where this is basically the expected entropy",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2645.976,
    "end": 2647.037,
    "text": " of the likelihood mapping.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2647.077,
    "end": 2655.485,
    "text": "And so the idea here is that you seek out actions or seek out states of the world that have a precise mapping to sensory outcomes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2656.085,
    "end": 2666.174,
    "text": "And so, for example, if you're in a hotel room that you've never been in before, it's really dark, the best way, best actions to take to minimize your uncertainty is just to turn the light on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2667.836,
    "end": 2672.34,
    "text": "Because that will give you a really precise mapping between the hidden states of the world out there",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2673.457,
    "end": 2676.48,
    "text": " And kind of the observations that you generate, all that they generate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2677.52,
    "end": 2682.965,
    "text": "And so the idea is that expected free energy is minimized when both of these terms are minimized.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2685.126,
    "end": 2687.248,
    "text": "And it's actually a little bit more complicated than this, I should say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2687.308,
    "end": 2693.473,
    "text": "So policy selection isn't just the minimization of expected free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2693.493,
    "end": 2696.355,
    "text": "It also involves minimization of variational free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2696.636,
    "end": 2699.658,
    "text": "But I would just say, what's the model stream to get into that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2700.745,
    "end": 2727.713,
    "text": " For our purposes in this conversation, we can just say policies are selected that best minimize expected free energy and variational free energy, where variational free energy is also basically a stand-in where the optimal posterior here that you infer will also kind of, you infer the optimal posterior by minimizing variational free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2727.733,
    "end": 2728.173,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2731.454,
    "end": 2734.036,
    "text": " So what about, I haven't really talked about the brain so far.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2736.138,
    "end": 2738.92,
    "text": "One of the beautiful things about active inference is that it comes with a process theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2741.322,
    "end": 2749.169,
    "text": "And so belief updates, that is changes to your posterior overstates correspond to changes in activation levels in response to input.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2749.91,
    "end": 2756.776,
    "text": "And the matrix entries here, D, B, H, C, blah, blah, blah, blah, these are all,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2757.925,
    "end": 2759.386,
    "text": " H actually isn't really a matrix.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2759.726,
    "end": 2761.007,
    "text": "I guess it's a matrix entry, sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2761.468,
    "end": 2761.948,
    "text": "What is H?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2763.229,
    "end": 2763.589,
    "text": "Entropy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2767.752,
    "end": 2771.395,
    "text": "So you can just... These correspond to synaptic connection strengths.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2771.655,
    "end": 2784.544,
    "text": "I mean, this is just like a very standard assumption across neural network literature, really, and just in neuroscience in general, where synaptic changes in weights of synaptic connections...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2785.494,
    "end": 2787.816,
    "text": " correspond to some kind of like function approximation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2791.279,
    "end": 2795.902,
    "text": "Okay, and so then you get these kind of somewhat intimidating looking equations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2796.002,
    "end": 2797.844,
    "text": "We can just select the ones that are really relevant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2798.364,
    "end": 2801.326,
    "text": "So this first one here is state prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2801.507,
    "end": 2813.816,
    "text": "And so minimizing state prediction error in perception corresponds to essentially the inference of the posterior probability",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2814.266,
    "end": 2816.246,
    "text": " q of s. Whoops.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2817.007,
    "end": 2821.488,
    "text": "And you can cast this as a gradient descent on variational free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2821.548,
    "end": 2824.108,
    "text": "And that's actually where we get our ERPs from.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2827.009,
    "end": 2834.19,
    "text": "Christopher, could you go into a little detail what the variational means independently or as related to the free energy here?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2835.05,
    "end": 2835.631,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2835.651,
    "end": 2841.072,
    "text": "So variational free energy is just to distinguish it from something like thermodynamic free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2842.6,
    "end": 2845.222,
    "text": " So there are formal relationships between these things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2845.282,
    "end": 2848.965,
    "text": "I would just say, read Carl Friston's work if you want to know about that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2849.286,
    "end": 2857.673,
    "text": "But basically, variational frangie is the KL divergence between a generative model and your approximate posterior distribution.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2857.953,
    "end": 2866.14,
    "text": "And what you're trying to do is change the approximate posterior distribution slowly but surely.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2866.22,
    "end": 2868.462,
    "text": "So change it bit by bit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2868.502,
    "end": 2870.844,
    "text": "So you nudge it in the direction of steepest descent.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2872.361,
    "end": 2886.968,
    "text": " until it basically, this error term here, which is basically the difference between the log difference between your generative model and your approximate posterior, you change S until that difference is at the minimum.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2891.25,
    "end": 2898.733,
    "text": "And the rate at which that changes, so this little V dot here is your ERP.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2899.608,
    "end": 2902.89,
    "text": " So the idea, um, and I'm going to go into that a little bit more in a moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2904.13,
    "end": 2915.516,
    "text": "Um, so the idea is that you have our log probability of our posterior is essentially a non-normalized log probability, and it can be positive or negative like a voltage.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2917.077,
    "end": 2925.701,
    "text": "Um, and then you have, you can have your ERPs and this is just like your change in membrane potential over neuronal populations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2927.246,
    "end": 2930.987,
    "text": " And that corresponds to roughly speaking like these big potentials we see at the scalp.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2931.848,
    "end": 2941.071,
    "text": "And then we have a normalized firing rate where you will basically, we normalize the depolarization variable by branding it through a softmax function.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2942.331,
    "end": 2952.234,
    "text": "And the softmax function is just a generalization of a logistic function to more than one input, more than two classes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2955.188,
    "end": 2978.759,
    "text": " And what's nice about using a generalization of a sigmoid function is that everyone who's looked at, like, rate models of population nodes, for example, or what's sometimes called mean field models, these basically, you can have this firing rate versus input curve, where on the x-axis, you have the amount of input that you're driving into the population, and on the y-axis, you'll have the firing rate of the population.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2980.199,
    "end": 2984.081,
    "text": "It's a logistic function, so it's going to be bounded, roughly speaking, between zero and one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2987.027,
    "end": 3011.408,
    "text": " So what you'll end up with is this kind of sigmoid-style looking curve that we treat as probability distribution, but can also be interpreted as kind of this lovely biophysically plausible, well, I don't know about plausible, but biophysically sensible, maybe, interpretation as a normalized firing rate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3012.675,
    "end": 3019.659,
    "text": " And that kind of allows us to translate between this kind of normative models, thinking about probability distributions and what the brain is actually doing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3019.679,
    "end": 3025.103,
    "text": "Okay.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3025.223,
    "end": 3026.143,
    "text": "So everyone kind of happy with that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3027.444,
    "end": 3027.624,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3027.644,
    "end": 3028.665,
    "text": "Steven, do you have a quick question?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3029.846,
    "end": 3031.066,
    "text": "Just one quick question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.387,
    "end": 3041.133,
    "text": "Just is the expected free energy on policies more important at level two and level one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.597,
    "end": 3044.76,
    "text": " it kind of can soft max itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.401,
    "end": 3053.531,
    "text": "Um, or is it, that's a bit simplifying, but does, does expected free energy go all the way down or is it a bit more higher up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3053.591,
    "end": 3055.113,
    "text": "It depends how you set up a model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3055.473,
    "end": 3059.138,
    "text": "You can generally have models that, uh,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3061.124,
    "end": 3067.769,
    "text": " You can have policy selection at both levels, you can policy selection at just the lower level or just the higher level, depends what you're trying to model really.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3068.85,
    "end": 3076.457,
    "text": "Generally speaking in models, so in the model we're going to be using, I'm going to introduce in just a moment, we don't have policy selection at the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3078.478,
    "end": 3079.98,
    "text": "We have policy selection at the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3080.94,
    "end": 3088.967,
    "text": "But you might, for example, there's work by Thomas Parr and Ryan and I kind of working on some similar work as a part of my thesis where",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3090.117,
    "end": 3097.103,
    "text": " Basically, the idea is that the higher working memory-ish prefrontal level, you have goal-directed policy selection.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3097.783,
    "end": 3102.026,
    "text": "And at the first level, you just have kind of epistemically guided policy selection.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3102.887,
    "end": 3111.074,
    "text": "And so the policies that are being selected at the first level might be something like where in the visual field to point your attention or to move your eyes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3112.235,
    "end": 3113.876,
    "text": "And that's just kind of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3114.485,
    "end": 3125.714,
    "text": " determined by the salience of various items, which in this framework corresponds to essentially the information gain offered by all the precision of the first level A matrix.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3125.734,
    "end": 3129.097,
    "text": "So hopefully that answers your question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3130.378,
    "end": 3130.938,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.581,
    "end": 3140.386,
    "text": "So as just a little bit of kind of a generalization of that, I mean, really, and Chris will go into this, but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3140.967,
    "end": 3149.729,
    "text": " But the way this is modeled officially is just each lower level trial is just a full trial, as in if you were modeling it separately.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3150.29,
    "end": 3158.552,
    "text": "The higher level is just putting a prior on whatever the starting prior is for each lower level trial.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3160.312,
    "end": 3164.634,
    "text": "So I mean, in a sense, you're modeling these trials.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3164.654,
    "end": 3169.195,
    "text": "You could think about each trial either at the lower level or the higher level as being modeled",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3169.764,
    "end": 3171.325,
    "text": " independently in some sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3171.385,
    "end": 3174.005,
    "text": "Each one can have a set of policies.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3174.145,
    "end": 3177.327,
    "text": "Each can have anything that a single-level model could have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3177.427,
    "end": 3182.768,
    "text": "It's just that the higher level is putting priors of some kind on the lower level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3183.429,
    "end": 3189.891,
    "text": "And then posterior observations at the lower level are then feeding back in as the observations for the higher level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3191.671,
    "end": 3196.933,
    "text": "So just think about them as just separate kind of trials",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3197.515,
    "end": 3200.718,
    "text": " on different timescales where they're just connected by their priors and posteriors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3201.799,
    "end": 3202.439,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3204.161,
    "end": 3212.427,
    "text": "And so I guess what we did here was we wanted to have something like to implement something global neural workspace like in a deep active inference architecture.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3212.748,
    "end": 3221.194,
    "text": "And what I want to highlight, I have mixed feelings about defining the term the predictive global neural workspace because people lump this model in.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3221.214,
    "end": 3225.438,
    "text": "The few people who have been kind enough to cite this work have",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3225.928,
    "end": 3231.092,
    "text": " lumped us in into like models of this as being kind of just another version of the global neural workspace.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3232.132,
    "end": 3233.273,
    "text": "I don't think that's accurate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3234.774,
    "end": 3241.639,
    "text": "We took the global neural workspace kind of and all of the phenomena that it encompasses kind of as something that we want to explain.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3242.219,
    "end": 3247.963,
    "text": "Both Ryan and I really like a global neural workspace, like Stan DeHaan, Bernard Barthes, huge heroes of mine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3248.464,
    "end": 3253.267,
    "text": "And aside from kind of like my personal love of the theory, it's also interesting",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3253.979,
    "end": 3268.088,
    "text": " among kind of neuroscientists and philosophers who work on consciousness about 30, the majority of them, which is about 35% or something like that, uh, in 2018 said that they regarded it as the most promising neuroscientific theory of consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3268.869,
    "end": 3273.231,
    "text": "And so we thought, okay, if we're going to go into this literature, this is what we should be modeling.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3273.311,
    "end": 3276.974,
    "text": "Like the phenomena encompassed by this theory is where it should be the starting point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3277.814,
    "end": 3281.457,
    "text": "Um, but with that said, it's, our model is an active inference model through and through.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3281.477,
    "end": 3281.517,
    "text": "Um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3284.764,
    "end": 3288.645,
    "text": " And so it really does kind of stand on its own independently of the global neural workspace.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3288.705,
    "end": 3290.046,
    "text": "And so I just kind of wanted to flag that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3290.666,
    "end": 3298.488,
    "text": "And so I don't use those words or in the draft of the paper that I'm writing at the moment, kind of following up on this one, I don't use those words and I don't do it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3299.188,
    "end": 3299.908,
    "text": "That's very deliberate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3302.989,
    "end": 3304.49,
    "text": "But anyway, sorry, that was an aside.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3304.51,
    "end": 3307.05,
    "text": "That was a very esoteric aside of that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3307.69,
    "end": 3313.012,
    "text": "Anyway, so the idea here is that we implement something global neural workspace like in a deep temporal",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3313.305,
    "end": 3314.465,
    "text": " deep temporal architecture.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3314.565,
    "end": 3320.387,
    "text": "So this second level, we identify, centrally deep level, we identify with the workspace.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3321.667,
    "end": 3330.489,
    "text": "And so as Ryan was just talking about, you have these states, the second level, which are really like beliefs about how trials at the first level evolve over time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3333.509,
    "end": 3341.271,
    "text": "And so they provide a prior at each time step of the lower level, they provide a prior over the hidden state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3342.222,
    "end": 3348.426,
    "text": " And then when there's posterior inference at the first level, after that's happened, it then shoots back up to the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3348.726,
    "end": 3351.307,
    "text": "And that acts as an observation for the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3353.809,
    "end": 3354.169,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3354.589,
    "end": 3370.098,
    "text": "So the idea here is that the functions we typically associate with conscious processing take place at the level of the hierarchy that's kind of deep and temporally deep enough to abstract away from processes that are entrained by the moment-to-moment sensory flux.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3370.902,
    "end": 3378.824,
    "text": " And this allows the agent to kind of construct a report of its experience or to do any other kind of quite abstract cognitive task.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3379.424,
    "end": 3385.046,
    "text": "And so the idea is that ignition occurs when a first level state is inferred by the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3385.726,
    "end": 3394.368,
    "text": "So ignition, sorry, is basically like what Dahan has called this nonlinear bifurcation of this frontoparietal network in the neuronal activity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3394.388,
    "end": 3398.429,
    "text": "So the idea is that ignition for our model occurs when the first level state is inferred by the second level",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3399.005,
    "end": 3403.608,
    "text": " with a high enough posterior probability to kind of influence policy selection at the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3405.909,
    "end": 3406.15,
    "text": "Whoops.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3407.05,
    "end": 3408.691,
    "text": "So, okay, onto the task.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3410.132,
    "end": 3418.958,
    "text": "So this is a very kind of general task structure, which we borrowed from a really awesome empirical study done by Michael Pitts in 2014 and colleagues.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3419.718,
    "end": 3424.481,
    "text": "So the idea was at the first time step, there was a forwards mask presented and so,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3426.215,
    "end": 3428.156,
    "text": " Second time step, there's a target stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3428.476,
    "end": 3432.897,
    "text": "So these little lines in the center can rearrange themselves into a square.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3433.317,
    "end": 3436.178,
    "text": "And at the second time, there's then a backwards mask at the third time step.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3436.799,
    "end": 3443.781,
    "text": "And the agent is then asked to construct a report of its experience, so whether it's say whether it saw something or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3444.281,
    "end": 3452.264,
    "text": "And the idea, roughly speaking, these little colored circles on the outside, this is how we manipulate attention and how Michael Pitts manipulated attention.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3454.654,
    "end": 3463.399,
    "text": " And so they either had people attend to the inside and perform a task, basically click a button whenever the square changed or click a button whenever the circle changed.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3464.78,
    "end": 3472.844,
    "text": "And so they manipulated kind of what was task relevant and I'll get into how they manipulated awareness in a moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3473.744,
    "end": 3479.307,
    "text": "But roughly speaking, the way we implemented the model, this is kind of a Bayes net representation of the model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3480.528,
    "end": 3482.109,
    "text": "And then if we just kind of click through it,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3482.751,
    "end": 3490.154,
    "text": " At time one, there is a forward mask presented, and this just corresponds to a black with a square trial.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3490.174,
    "end": 3494.216,
    "text": "So that's the full, this is kind of a, at least the second level, there is a full sequence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3494.836,
    "end": 3497.017,
    "text": "This is beliefs about the full sequence over the full trial.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3497.517,
    "end": 3498.698,
    "text": "So this is a time step one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3500.199,
    "end": 3502.059,
    "text": "There's a report, hidden state factor here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3502.139,
    "end": 3504.66,
    "text": "It's in weight because we haven't asked it to construct a report yet.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3505.221,
    "end": 3510.443,
    "text": "Then at the first level, each of these second level states kind of implies a first level state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3511.53,
    "end": 3512.09,
    "text": " that makes sense.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3512.371,
    "end": 3524.241,
    "text": "And each of these first level states kind of implies a observation and attention in our model was basically, we just hard coded in as a, but we didn't have to hard code it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3524.321,
    "end": 3525.682,
    "text": "You can get these things to emerge.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3525.702,
    "end": 3529.265,
    "text": "We just, it's just a little bit easier in our case to do it this way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3529.825,
    "end": 3537.752,
    "text": "We basically hard coded in so that attention corresponded to modulations of the mapping of the precision of the mapping between",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3538.257,
    "end": 3544.121,
    "text": " his first level hidden states, kind of whether there was a square or lines out there in the world and the observations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3544.741,
    "end": 3545.281,
    "text": "So, okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3545.301,
    "end": 3552.085,
    "text": "So first, first time point forwards mask, we see a sequence type is going to be a square.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3553.246,
    "end": 3555.247,
    "text": "There's a trial phase one report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3555.267,
    "end": 3555.688,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3555.748,
    "end": 3562.772,
    "text": "Next one, we see trials moved to, we've now see the target has now rearranged itself into a square.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3563.427,
    "end": 3565.007,
    "text": " We did this for two time steps.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3565.147,
    "end": 3568.548,
    "text": "And we did the reason we did it for, we present the target stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3569.148,
    "end": 3578.631,
    "text": "The two time steps is to allow recurrent feedback processes from the first level to kind of the first level to second level and recognize what's going on and feed back on to the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3579.111,
    "end": 3583.012,
    "text": "Kind of give that, that was kind of our way of modeling this ignition style process.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3584.152,
    "end": 3586.452,
    "text": "Then fourth time step, we take away the mask.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3586.552,
    "end": 3588.913,
    "text": "We replaced the little square of just the mask again.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3589.893,
    "end": 3592.974,
    "text": "And then from five to eight,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3593.595,
    "end": 3597.217,
    "text": " that we allow the model to construct a report of its experience.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3597.237,
    "end": 3605.64,
    "text": "So basically this scene hidden state here implies a sequence of language processing states at the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3608.662,
    "end": 3609.462,
    "text": "I see a square.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3609.482,
    "end": 3610.643,
    "text": "Yeah, just read it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3610.663,
    "end": 3611.623,
    "text": "It says, I see a square.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3611.743,
    "end": 3613.404,
    "text": "And then what would it say if it was unseen?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3615.405,
    "end": 3616.185,
    "text": "I didn't see anything.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3618.586,
    "end": 3620.267,
    "text": "I mean, and to be fair, just to be clear,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3623.003,
    "end": 3648.442,
    "text": " we could have and the model would be exactly the same in all aspects we could just chop off this kind of language processing part of the model and the model would behave exactly the same way and we could still use it to generate reports and all of that stuff what we wanted to do was really just kind of use this as kind of an intuition pump for what having this deep temporal representation",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3649.324,
    "end": 3650.784,
    "text": " allows models to do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3650.884,
    "end": 3658.646,
    "text": "So holding something at that level allows sequences or a cascade of hidden states to kind of evolve at lower levels.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3658.706,
    "end": 3672.389,
    "text": "That might be something like constructing a sentence with a goal in mind, or it might be something like, I don't know, making a cup of coffee, where you have to hold multiple tasks in mind and break things down into subcomponents, blah, blah, blah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3673.339,
    "end": 3673.479,
    "text": " Yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3673.659,
    "end": 3679.902,
    "text": "As opposed to mapping to button that says yes or no, if it's just a two button option, then it's a one time step paradigm.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3680.702,
    "end": 3681.282,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3681.302,
    "end": 3683.643,
    "text": "I mean, we, we could do that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3683.663,
    "end": 3685.364,
    "text": "I mean, it'd be completely identical.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3685.944,
    "end": 3690.326,
    "text": "Um, this is just kind of a, a nice way of showing what these models can do really.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3690.846,
    "end": 3691.046,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3691.086,
    "end": 3695.888,
    "text": "I mean, so this was, this was partially for a, for a kind of, to make a theoretical point, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3695.968,
    "end": 3698.969,
    "text": "That is you could say, right, we're showing a two level model here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3699.574,
    "end": 3706.657,
    "text": " But, you know, the brain probably has, you know, I don't know how many levels, but a very large number of levels, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3706.677,
    "end": 3707.357,
    "text": "Not just two.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3709.037,
    "end": 3720.181,
    "text": "So, you know, you could kind of level the concern or question at us that like, you know, why is it that this second level is the one that corresponds to conscious access, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3720.221,
    "end": 3723.923,
    "text": "As opposed to just any other level that's above some level, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3723.963,
    "end": 3727.064,
    "text": "In the brain, since there's a big hierarchy in the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3727.822,
    "end": 3752.999,
    "text": " know so the the idea here is is that you know we're appealing to a certain level of deep temporal structure right like um you can you can flash a stimulus at somebody and they can see it over a very short time scale right of like you know half a second or something really fast but actually but the sorts of cognitive processes that um can integrate that together",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3753.789,
    "end": 3779.354,
    "text": " right and generate you know a set of thoughts right that corresponds to being aware of that right constructing a um constructing a sentence or any of the things that chris mentioned um those are much deeper slower integrative cognitive processes right so the idea is that there is a level in the brain that is integrative enough and that represents things over a deep enough temporal scale",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3780.094,
    "end": 3795.663,
    "text": " that it has the minimal resources to integrate things together, hold them in mind, generate sequences of the sequences of words that would be necessary to communicate that you saw something or not, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3795.683,
    "end": 3806.39,
    "text": "So it's that abstract deep temporal structure that is the necessary conditions for what you need to get empirically confirmable awareness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3810.06,
    "end": 3811.801,
    "text": " Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3811.821,
    "end": 3811.961,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3812.061,
    "end": 3814.542,
    "text": "And just some brief kind of modeling notes about what we did.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3815.123,
    "end": 3825.228,
    "text": "So to model attention and stimulus strength, we basically just altered the precision of the first level A matrix mapping by passing it through a softmax function twice where one of the softmax temperature.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3825.448,
    "end": 3831.431,
    "text": "So when you pass something through a softmax function, you have a temperature on it and the temperature decides how precise it is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3831.511,
    "end": 3835.573,
    "text": "And we just had a different temperature for each iteration of the softmax function.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3836.713,
    "end": 3839.555,
    "text": "And so the idea was then we had an ordering basically of precision.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3840.276,
    "end": 3846.278,
    "text": " where the most precise was attention present, stimulus strength high.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3846.579,
    "end": 3850.34,
    "text": "The second was attention absent, stimulus strength high.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3850.44,
    "end": 3852.841,
    "text": "Third was blah, blah, blah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3853.141,
    "end": 3854.202,
    "text": "You can imagine how that goes on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3854.762,
    "end": 3858.923,
    "text": "And the reason, this sounds pretty abstract and a bit cooked up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3859.244,
    "end": 3860.424,
    "text": "And that's true to an extent.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3860.924,
    "end": 3867.667,
    "text": "But I think this does actually really correspond to, so if you look at something like divisive normalization in vision,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3868.277,
    "end": 3891.004,
    "text": " where attention basically is a, you will have some tuning curve, neuronal tuning curve, and basically like how precise that tuning curve is, is modulated by both the contrast of the stimulus and then the contrast, the stimulus gets fed into some attentional process where that will together determine kind of the tuning curve.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3893.545,
    "end": 3895.946,
    "text": "That was a very kind of rough and ready explanation",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3897.368,
    "end": 3898.369,
    "text": " tuning curves, but whatever.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3899.549,
    "end": 3909.774,
    "text": "And then our threshold for report, we basically just set up the model to have a preference for receiving correct versus incorrect feedback at the final time step.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3910.354,
    "end": 3916.657,
    "text": "And 2EF behavior was basically modeled by simply decreasing the preference for being incorrect to encourage guessing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3917.837,
    "end": 3920.919,
    "text": "And so I think this was just kind of our first pass at doing report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3921.479,
    "end": 3924.62,
    "text": "I don't think this is how the brain does report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3926.567,
    "end": 3937.829,
    "text": " We actually, in our follow-up model, we've got a much nicer way of doing this, but I think it worked in the sense that it was able to kind of quite accurately capture a number of empirical findings.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3937.909,
    "end": 3941.69,
    "text": "So that's kind of good enough for me at this first model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3943.371,
    "end": 3949.672,
    "text": "Okay, sorry, that was a lot of preamble, but we can get into the results.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3949.692,
    "end": 3950.932,
    "text": "So foundational simulation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3952.132,
    "end": 3954.593,
    "text": "This was just like kind of full, like a very high precision,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3955.347,
    "end": 3961.668,
    "text": " stimulus was presented to the model kind of with either on a square present or a square absent trial.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3962.428,
    "end": 3964.909,
    "text": "And this is just kind of to test it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3965.369,
    "end": 3966.009,
    "text": "So great.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3966.829,
    "end": 3970.45,
    "text": "When there was a square present, the model reported seeing it 100% of the time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3970.79,
    "end": 3973.15,
    "text": "You see this nice kind of bump at the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3973.25,
    "end": 3978.611,
    "text": "At the first level, where the firing rates for square increase when we present it, it goes down.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3978.931,
    "end": 3983.652,
    "text": "So Chris, let's just make sure that people understand how to interpret these things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3985.458,
    "end": 4000.712,
    "text": " So just so people understand, so time in these plots goes from left to right, and the gray scale from white to black, black corresponds to 100% probability, and white corresponds to zero probability.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4001.472,
    "end": 4004.275,
    "text": "And the gray, so it's something like 50-50.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4005.175,
    "end": 4012.442,
    "text": "And these are cast in terms of firing rates here, so darker than implies a higher firing rate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4013.723,
    "end": 4022.066,
    "text": " So the top plot on the left that says second-level firing rates, that just means it first sees the black circles on the outside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4022.746,
    "end": 4038.271,
    "text": "So it's confident that it's either going to be the sequence that has black circles and black square, or the second row, the other sequence, which would be black circles and just lines with no square.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4039.188,
    "end": 4048.654,
    "text": " Um, so basically once it sees the black circles, then it knows, okay, this could either be a sequence where there's going to be a black square or when there's not going to be a black square.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4049.694,
    "end": 4067.005,
    "text": "Um, so then at the, and that, and you can tell what the stimulus was because if you look at the first level firing rates, so again, the next kind of plot down the bottom, um, row there corresponds to seeing the lines and the top one corresponds to seeing the square.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4067.782,
    "end": 4071.284,
    "text": " So basically what happens here is it starts out just seeing the lines.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4072.004,
    "end": 4088.173,
    "text": "And then at the second time step there, you can see it kind of bumps up and the agent's really confident that it's seeing a square, which at the second level corresponds to becoming fully confident that it's gonna be the sequence of black circle and square.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4088.193,
    "end": 4096.297,
    "text": "And then the stimulus goes away at time point four, which you can see at the first level and then stays again, just lines for the rest of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4097.758,
    "end": 4112.47,
    "text": " And then the bottom two plots show the actual outcomes, where again, black is the agent's sort of confidence in what it did and the cyan dots correspond to the actual ground truth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4113.665,
    "end": 4127.847,
    "text": " So that's just showing that the agent waited for the first three time steps and then reported seen and kept that seen while it generated the sequence of words at the following four time steps.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4128.628,
    "end": 4134.169,
    "text": "And then the right one just kind of shows it started out silent for the first four time steps.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4134.449,
    "end": 4142.61,
    "text": "And then the words that it observed itself report where I see a square, which is just those dots moving down the diagonal to the right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4144.305,
    "end": 4148.626,
    "text": " So that's just so people know how to interpret what these plots mean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4149.406,
    "end": 4150.327,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4150.347,
    "end": 4161.429,
    "text": "And another clarifying point would just be that the same simulation is leading to all of these behavioral outcomes and neural correlate predictions and a bunch of other things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4161.489,
    "end": 4165.45,
    "text": "So it's like one integrated model and the model stream is kind of where they built it up.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4166.571,
    "end": 4167.231,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4167.251,
    "end": 4172.372,
    "text": "Okay, so we kind of talked through all of that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4173.686,
    "end": 4181.15,
    "text": " Okay, so in terms of the taxonomy here, what we wanted to do was basically recreate that taxonomy that we talked about earlier.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4182.53,
    "end": 4197.337,
    "text": "So this was modulating signal strength from high to low and from kind of, and whether attention was present or absent, and then looking at the corresponding firing rates and looking at like the percent scene and percent correct, that kind of thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4198.018,
    "end": 4203.16,
    "text": "Also, percent scene is report behavior and percent correct, which is forced choice behavior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4204.6,
    "end": 4206.9,
    "text": " Okay, so kind of a couple of things to highlight.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4208.201,
    "end": 4214.382,
    "text": "Firing rate first level is enhanced kind of most strongly in the conscious quadrant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4214.682,
    "end": 4215.282,
    "text": "That's nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4215.342,
    "end": 4217.362,
    "text": "That's again what we see in empirical findings.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4219.222,
    "end": 4224.203,
    "text": "High firing rate for kind of square sequence at the second level, even when reports are low.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4224.383,
    "end": 4225.324,
    "text": "This is kind of nice, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4225.364,
    "end": 4229.624,
    "text": "Because I talked about earlier, you can have kind of a firing rate at the set.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4229.664,
    "end": 4233.985,
    "text": "You can have kind of activity in prefrontal regions that is generally speaking higher",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4234.755,
    "end": 4243.639,
    "text": " below the threshold for report, that is nevertheless, oh, sorry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4244.039,
    "end": 4257.204,
    "text": "When I say below the threshold for report, report frequency of reports are relatively low, but you can still have a preference for, you can still have a higher firing rate or the representation of showing that there's a representation of the stimulus basically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4259.285,
    "end": 4261.426,
    "text": "And then the last thing to highlight is this,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4262.079,
    "end": 4271.786,
    "text": " the highest firing rate for the kind of the square sequence at the second is at the second level is in the conscious quadrant, which we kind of might think about in terms of ignition.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4274.909,
    "end": 4275.149,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4275.269,
    "end": 4283.475,
    "text": "So then ERPs, we see the real thing to highlight here is that we see a large P3 like event related potential in the conscious quadrant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4283.675,
    "end": 4287.178,
    "text": "Again, like a lot of the empirical findings in the report literature.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4289.435,
    "end": 4300.278,
    "text": " Whereas first level ERPs seem to be fairly unmodulated by conscious access, essentially, which is, again, what we see.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4302.278,
    "end": 4307.72,
    "text": "So now to a very, that was kind of a very abstract kind of taxonomy where we're just manipulating factors.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4308.16,
    "end": 4317.662,
    "text": "What we wanted to do here was show, take a concrete empirical result and show how we could basically use literally exactly the same model to reproduce it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4318.792,
    "end": 4322.434,
    "text": " So this is a really clever paradigm by Michael Pitts that I talked about before.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4322.955,
    "end": 4330.119,
    "text": "And so the idea is that you will have these kind of three phases to an experiment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4330.439,
    "end": 4340.365,
    "text": "In phase one, the participant is just told to attend to the dots on the outside of the screen and hit a button when they dim.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4340.845,
    "end": 4348.45,
    "text": "And what the participant isn't told is that every now and again, these lines in the middle will rearrange themselves into a square pattern.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4349.892,
    "end": 4353.115,
    "text": " Then at the end of the first phase, they seek like 300 trials.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4355.137,
    "end": 4361.583,
    "text": "And at the end of the first phase, they are then given a debrief and they asked, all right, so how many people saw a square pattern in the middle?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4362.263,
    "end": 4363.264,
    "text": "And roughly speaking, it's about 50%.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4363.605,
    "end": 4369.35,
    "text": "And this is now actually really well replicated result across kind of different varieties of inattentional blindness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4369.43,
    "end": 4373.474,
    "text": "Roughly speaking, about 50% of people don't report seeing it when it's not task relevant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4373.914,
    "end": 4374.475,
    "text": "So that's nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4374.935,
    "end": 4375.536,
    "text": "So then they,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4376.252,
    "end": 4380.197,
    "text": " Then all of those, so then they have 50% of people who didn't report seeing it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4383.921,
    "end": 4385.803,
    "text": "And then in fact, but are now aware of it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4385.904,
    "end": 4388.647,
    "text": "And then phase two, they do exactly the same tasks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4388.667,
    "end": 4390.329,
    "text": "They're attending to the disks on the outside.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4390.349,
    "end": 4390.869,
    "text": "So it's irrelevant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4394.867,
    "end": 4396.848,
    "text": " still task-relevant, but they're now all aware of it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4396.988,
    "end": 4399.83,
    "text": "And in the debrief at the end of the second phase, everyone reports seeing it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4400.05,
    "end": 4404.093,
    "text": "And so now they've got this contrast between aware versus unaware.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4404.773,
    "end": 4409.876,
    "text": "So phase one versus phase two, where the only thing that's different between them is whether you're aware of the stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4410.877,
    "end": 4414.098,
    "text": "And the stimulus in the middle is task-relevant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4414.118,
    "end": 4415.819,
    "text": "And what you can see, there's no P3B.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4417.841,
    "end": 4423.404,
    "text": "There's no late positive central component in the ERPs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4424.741,
    "end": 4434.567,
    "text": " Then the final phase, aware task, the kind of the aware phase, so all the participants are aware, but they now make a task relevant and have them basically attend to the dot, to the squares in the middle.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4434.907,
    "end": 4437.188,
    "text": "And what you see there is this big P3B.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4438.229,
    "end": 4438.929,
    "text": "Very noticeable.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4440.71,
    "end": 4440.99,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4441.631,
    "end": 4445.393,
    "text": "So just to kind of sum up this slide to summarize what I just said.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4447.194,
    "end": 4447.654,
    "text": "Then great.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4447.714,
    "end": 4454.098,
    "text": "So basically what we did was we just used a different inverse temperature parameter to modulate, to kind of represent each state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4454.403,
    "end": 4464.169,
    "text": " So phase one, very low temperature parameter for attention, attention, attention, temperature parameter.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4464.249,
    "end": 4467.692,
    "text": "That was kind of, and so this is, you can kind of see the precision of the A matrix.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4468.072,
    "end": 4472.535,
    "text": "Here we bump up for phase two, we bump up the inverse temperature parameter just very slightly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4473.275,
    "end": 4477.838,
    "text": "This is kind of roughly speaking to correspond to like a diffuse attention parameter.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4478.658,
    "end": 4482.78,
    "text": " So you're not particularly attending to one thing, one particular feature of the stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4482.8,
    "end": 4484.861,
    "text": "You're attending just kind of diffusely to the whole screen.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4485.601,
    "end": 4496.546,
    "text": "And in the last state, we basically model the attention to make task relevant by making a very high or very precise temperature parameter where you basically get almost something that looks like a likelihood, like an identity mapping.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4499.687,
    "end": 4499.888,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4500.368,
    "end": 4504.83,
    "text": "And so these are the ERPs and the firing rates that you get out of it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4505.45,
    "end": 4507.511,
    "text": "And this is my favorite slide in the whole plot.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4508.167,
    "end": 4508.948,
    "text": " Oh, in the whole paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4510.449,
    "end": 4525.423,
    "text": "What you see is basically results that look very, very, like, shockingly similar to the empirical results, especially for a model that is so incredibly simple, like ours is, relatively speaking, at least in terms of biophysical detail.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4526.561,
    "end": 4529.143,
    "text": " And so what you see is at the first time step.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4529.183,
    "end": 4530.504,
    "text": "So there's basically no ERP.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4530.624,
    "end": 4532.445,
    "text": "So first phase, basically no ERPs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4532.765,
    "end": 4542.871,
    "text": "And so we, we give the model feedback on every trial, but what you should see is it's a little bit darker for the square for the, until we give it feedback and tell it, no, you were wrong.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4544.392,
    "end": 4548.714,
    "text": "You did, we did actually present squares and the model changes its mind.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4549.135,
    "end": 4551.976,
    "text": "It was fairly sure that it had seen lines.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4552.797,
    "end": 4553.057,
    "text": "Then the,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4553.83,
    "end": 4565.672,
    "text": " The second one, we bump up the tension parameter, and now the model sees things, and it reports seeing the stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4566.012,
    "end": 4574.114,
    "text": "So I should say, in phase one, our model saw the stimulus 49% of the time, basically identical to the empirical result, which is 50%.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4574.514,
    "end": 4578.454,
    "text": "Phase two, it saw it 99% of the time, basically the same as the empirical results.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4578.674,
    "end": 4579.374,
    "text": "Report phase two is 100%.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4579.414,
    "end": 4581.555,
    "text": "And then phase three, it's 100% of the time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4583.286,
    "end": 4589.829,
    "text": " Um, and there there's little, but by the way, I should say what the way I generated these results is basically I ran several hundred truck.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4590.129,
    "end": 4598.574,
    "text": "I basically set up, just ran a four loop over the stimulus, over the code and for each condition and had it generate, I think.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4599.854,
    "end": 4603.436,
    "text": "So each kind of iteration of the four loop generated 300 trials.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4604.096,
    "end": 4607.718,
    "text": "And I then averaged over maybe 10 iterations of that four loop.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4608.939,
    "end": 4611.72,
    "text": "So, um, each with a different random seed.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4614.111,
    "end": 4617.212,
    "text": " And so what you should see, sorry, that was a quick aside.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4617.492,
    "end": 4627.016,
    "text": "The crucial thing is that in this last point, there is this, when there's a very precise stimulus mapping at the first level, there is this abrupt change in firing rates at the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4628.496,
    "end": 4641.481,
    "text": "And that abrupt change corresponds to the appearance or the emergence of the P3B, where the P3B, where remember that ERPs are generated, they are the rate of change of posterior beliefs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4642.845,
    "end": 4645.787,
    "text": " And so the model suddenly becomes very confident that it saw a square.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4645.927,
    "end": 4656.393,
    "text": "And so you see this big ERP boost in the P3, which corresponds to a very precise input mapping that comes along with something with a stimulus being task relevant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4658.635,
    "end": 4668.781,
    "text": "And so there we've kind of got this really nice explanation of this kind of somewhat counterintuitive result about the dissociation of the P3 and awareness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4671.963,
    "end": 4672.203,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4672.546,
    "end": 4678.028,
    "text": " And then the last thing we're going to touch on is just kind of we then decide to extend the taxonomy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4679.628,
    "end": 4688.771,
    "text": "So basically, this is exactly the same, but we also now manipulated whether a prior was consistent with, i.e., a valid expectation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4688.931,
    "end": 4699.714,
    "text": "So we gave the model kind of we made it, roughly speaking, two times the model thought it was, roughly speaking, two times more likely to see a stimulus than see a square than lines.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4702.353,
    "end": 4705.154,
    "text": " And or two times more likely to see lines than squares.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4705.434,
    "end": 4706.754,
    "text": "And then we presented it with squares.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4706.955,
    "end": 4709.355,
    "text": "And so that's kind of the consistent and inconsistent prior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4710.196,
    "end": 4719.639,
    "text": "And then the key result is that across all of this, expectations boost the effective feedback on firing rate, which is nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4721.499,
    "end": 4727.161,
    "text": "And in terms of ERPs, what we see is something, this very specific prediction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4728.487,
    "end": 4752.829,
    "text": " when there is so these are kind of like fairly small differences but they are differences um only when attention is present do you really do you see a p3 that's again in line with the empirical literature but crucially when there's a consistent prior of or a valid base to say a valid expectation you should see a reduced p3b in contrast to when there's kind of flat priors",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4753.493,
    "end": 4755.374,
    "text": " and when there is an inconsistent prior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4755.414,
    "end": 4759.275,
    "text": "And this is actually something that has been empirically, that has been confirmed recently.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4759.615,
    "end": 4762.036,
    "text": "Again, this was something Michael Pitts was on this paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4762.056,
    "end": 4764.277,
    "text": "If anyone's interested, I can kind of post a link to the paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4765.317,
    "end": 4766.198,
    "text": "And that's really nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4766.238,
    "end": 4767.278,
    "text": "We didn't plan for that to happen.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4767.738,
    "end": 4770.359,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4771.98,
    "end": 4772.72,
    "text": "It is slightly annoying.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4772.74,
    "end": 4778.942,
    "text": "I would have liked to cite it in the paper, but the paper actually came out before ours was accepted for publication.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4781.075,
    "end": 4781.455,
    "text": " Oh, sorry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4782.116,
    "end": 4784.237,
    "text": "After ours was accepted publication, rather.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4784.257,
    "end": 4785.759,
    "text": "That's what I meant to say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4787.46,
    "end": 4787.8,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4787.84,
    "end": 4794.585,
    "text": "And just a very quick summary of the results with really what is a really kind of like surprisingly simple model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4794.866,
    "end": 4803.172,
    "text": "We can reproduce a very wide range of canonical results from minimal contrast paradigms, including kind of fMRI and ERP findings.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4804.393,
    "end": 4807.335,
    "text": "So this includes, we can account for unconscious PFC activation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4807.856,
    "end": 4810.738,
    "text": "We can account for the association of the P3 and conscious access.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4812.13,
    "end": 4816.774,
    "text": " where the P3, roughly speaking, reflects the velocity of conscious working memory updates.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4816.954,
    "end": 4817.855,
    "text": "I kind of like that phrase.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4819.616,
    "end": 4825.641,
    "text": "And four, we have an explicit and formally defined role for prior expectations and their implementation of process theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4826.402,
    "end": 4829.124,
    "text": "And then we've got a number of key predictions that emerge from this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4829.885,
    "end": 4836.11,
    "text": "So P3 is attention dependent and should its amplitude be inversely proportional to expectation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4837.932,
    "end": 4839.713,
    "text": " Feedback from frontal parietal regions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4840.234,
    "end": 4841.634,
    "text": "This is a very specific prediction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4842.195,
    "end": 4851.861,
    "text": "Feedback from frontal parietal regions should be enhanced on conscious trials, and it should disinhibit granular layers in the relevant sensory population sensory cortex.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4851.901,
    "end": 4857.324,
    "text": "That's a very specific prediction that falls out of the process theory that can be tested with DCM.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4857.985,
    "end": 4865.71,
    "text": "And then consistent expectation, again, consistent expectation should disinhibit granular layers in sensory cortices, while inconsistent priors should inhibit them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4867.825,
    "end": 4869.967,
    "text": " Okay, so any questions at this point?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4871.848,
    "end": 4874.37,
    "text": "Christopher, thanks for this awesome presentation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4875.071,
    "end": 4878.333,
    "text": "Do any of the panelists maybe want to queue up a question?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4878.694,
    "end": 4886.76,
    "text": "How about you do this last slide with a bat, leave on that sort of phenomenological note if you want to, otherwise we can return to the panel.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4886.86,
    "end": 4887.321,
    "text": "Yeah, perfect.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4887.721,
    "end": 4888.401,
    "text": "Yep, sounds good.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4888.421,
    "end": 4893.465,
    "text": "So all the panel, prepare a question or a thought and then raise your hand when you're ready and give a last thought here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4893.525,
    "end": 4894.006,
    "text": "Thanks, Christopher.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4895.186,
    "end": 4895.626,
    "text": " Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4895.646,
    "end": 4898.068,
    "text": "So just like a brief aside on phenomenal consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4898.709,
    "end": 4901.311,
    "text": "So we associate that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4901.531,
    "end": 4902.532,
    "text": "So I'll just back up a little bit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4902.552,
    "end": 4902.652,
    "text": "Sorry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4903.092,
    "end": 4910.078,
    "text": "There might be a puzzle in that we associate global broadcast and the availability of information for report with the second temporary deep level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4911.519,
    "end": 4919.465,
    "text": "Our experience, although it's kind of like there is a depth to it in the sense that experience is kind of smeared over time, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4920.246,
    "end": 4922.988,
    "text": "There is an integration window that's relevant for experience.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4924.235,
    "end": 4927.296,
    "text": " It certainly doesn't occur at the level of whole sequences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4928.477,
    "end": 4929.697,
    "text": "And so there's a puzzle here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4929.857,
    "end": 4931.758,
    "text": "So where does experience live, as it were?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4931.958,
    "end": 4933.559,
    "text": "Where is the content of experience?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4934.299,
    "end": 4938.621,
    "text": "And Brian and I have been chatting about this, and this is a view that's still evolving.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4938.681,
    "end": 4953.407,
    "text": "But broadly speaking, I think what's right about this or what we should say is that the first level states that the content that we are conscious of are the first level states that have",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4953.923,
    "end": 4962.727,
    "text": " a high enough precision either through kind of bottom-up precision or because there's a really precise prior that comes down from the second level A matrix.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4964.748,
    "end": 4977.494,
    "text": "So basically the message that's being passed back up to the second level has high enough precision to influence policy selection or to pass the threshold, the posterior belief threshold for conscious access and report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4978.812,
    "end": 4982.734,
    "text": " And so this kind of has the nice consequence that it keeps experience at the relevant level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4983.054,
    "end": 4993.319,
    "text": "So it's updated at each time step when we get new stimuli in, and yet it has a distinct kind of link to report and behavior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4996.721,
    "end": 5007.727,
    "text": "Yeah, so I mean, just to expand on that a little bit, I mean, the kind of idea is just that as opposed to, and again, Chris partially said this, but just to kind of reiterate, the idea is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5009.103,
    "end": 5020.231,
    "text": " what you consciously experience is a consequence of both the posterior overstates at the first level and whatever the second level likelihood is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5021.032,
    "end": 5027.476,
    "text": "So it's a function of both the posterior there, S1, and what the structure is of A2 there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5029.378,
    "end": 5035.102,
    "text": "And a way to think about that is, if you were to rearrange A2 so the mapping was different,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5037.27,
    "end": 5043.746,
    "text": " And S1 had the same posterior, then that would update the beliefs at level two in a different way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5045.009,
    "end": 5045.21,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5045.822,
    "end": 5069.16,
    "text": " So if I arrange A2 one way, even though S1 there is still sensitive to the same stimulus, then if I rearrange A2 one way, then the posterior at S1 is going to lead to awareness of one thing, whereas if A2 is set up a different way, then the second level will gain awareness of a different thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5070.08,
    "end": 5073.603,
    "text": "So in some way, the phenomenal content that you become aware of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5074.249,
    "end": 5094.808,
    "text": " depends on the nature of this link between what messages the way that the messages at the second level are kind of decoded in a sense right what the second level takes to be the meaning of the messages that get passed off from the first level um so so there's this kind of nice thing like chris mentioned where it's the updates um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5095.774,
    "end": 5098.816,
    "text": " that the first level gives to the second level at each time point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5098.836,
    "end": 5102.818,
    "text": "So phenomenology kind of stays at the temporal scale of experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5103.518,
    "end": 5108.721,
    "text": "But phenomenal content still depends on a certain type of access, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5108.761,
    "end": 5113.284,
    "text": "It depends on the first level having a specific type of influence on the second level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5115.981,
    "end": 5116.862,
    "text": " Brian, thanks a lot.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5116.942,
    "end": 5117.942,
    "text": "It's really interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5118.482,
    "end": 5120.644,
    "text": "So let's return to the guest, the panel mode.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5120.844,
    "end": 5122.465,
    "text": "Christopher, awesome presentation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5123.025,
    "end": 5127.968,
    "text": "And the first question is going to be from Dave, and then anyone else can raise their hand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5129.829,
    "end": 5130.489,
    "text": "So Dave, go ahead.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5132.331,
    "end": 5138.094,
    "text": "My question is about possible involvement of the Airtos, the reticulothalamic activating system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5138.869,
    "end": 5152.34,
    "text": " either in your data or the data that are drawn on neurological data in the other relevant studies, is there any representation of possible contributions by the ERTAS, by the midbrain?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5153.841,
    "end": 5167.132,
    "text": "And is there any accommodation in your model of something, maybe not explicitly the ERTAS, but data that might originate there, say the endogenous attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5169.162,
    "end": 5194.075,
    "text": " um so subcortical structure is really interesting and as for the reticular thalamic activating system i'm curious did you did you get that from this book by bernard bars so a cognitive theory of consciousness where he first introduced global workspace theory and he has a whole chapter devoted to the reticular thalamic activating system oh that's great i will definitely have to get that no actually i got that this from uh",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5194.495,
    "end": 5205.281,
    "text": " The work that Jaak Panksepp and Mark Solms did, especially the 2013 thesis of the conscious id.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5205.842,
    "end": 5209.023,
    "text": "He is, of course, a very close collaborator with Carl Friston.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5209.043,
    "end": 5212.005,
    "text": "He just brought out a full-length thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5212.642,
    "end": 5240.776,
    "text": " book on the conscious id especially as um active inference interacts with that so so my my actual main focus of research is on um emotions um you know so applying computational models to emotions and um i'll just say that i um i have very strong disagreements with the um the kind of theory proposed by yach and mark we actually published kind of a joint like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5241.528,
    "end": 5252.618,
    "text": " on paper debate where me and, um, a colleague Richard Lane kind of debated back and forth with Yach and Mark about the right way to think of, um, the way consciousness works.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5252.778,
    "end": 5264.208,
    "text": "And I'll just say that, you know, their view places this really strong role of affect where they, they more or less say that these midbrain, you know, structures, um, like the PAG, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5264.228,
    "end": 5268.452,
    "text": "The, um, uh, or equiductal gray.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5269.085,
    "end": 5275.928,
    "text": " Um, send these afferent signals up to kind of activate the rest of the brain and that somehow permeates it with this kind of necessary emotion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5275.948,
    "end": 5278.168,
    "text": "Um, and that's kind of primary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5278.188,
    "end": 5293.654,
    "text": "Um, whereas, whereas kind of the way that, um, the way that we've, the kind of structure of the sort of thing that we've defended is just that no, like the global broadcasting ish kind of thing applies to all types of information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5294.318,
    "end": 5294.518,
    "text": " Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5294.598,
    "end": 5305.188,
    "text": "So if you have a representation of your beliefs about your emotional state, that has to be attended to and sort of sent into the workspace, just like any other stimulus for you to become aware of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5306.67,
    "end": 5313.096,
    "text": "And so, I mean, these sorts of midbrain structures, they do a lot of really interesting, like, interoceptive and visceral regulation processes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5314.497,
    "end": 5319.522,
    "text": "And, you know, they do have this sort of general, like, upward modulation role while they kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5320.24,
    "end": 5341.914,
    "text": " you know my view is they kind of keep the cortex in general in a state where it's capable of of representing things being sensitive to simulate holding different states active and other states not so it it essentially it allows things to be represented in general and then to become consciously accessible um but you know with respect to um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5342.834,
    "end": 5371.274,
    "text": " way that kind of emotions feed in and whether the uh the midbrain structures actually contribute content in and of themselves we just have theoretical disagreements about that can i also briefly follow up on that so the contrast the reason i think that frontal parietal regions in cortex are so important is because there are a huge just amount of empirical literature now in neuroimaging",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5372.034,
    "end": 5388.546,
    "text": " And also very recently, data from kind of invasive neurophysiology in monkeys and most recently in mice showing that, yes, when there is this contrast between conscious versus unconscious, these are the things that are differentially modulated.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5389.366,
    "end": 5399.474,
    "text": "Now, there are some very impressive findings very recently coming from Matthew Larkham's group showing basically that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5400.706,
    "end": 5427.223,
    "text": " you can wake creatures up from general anesthesia by stimulating the medial dorsal nucleus and the thalamus and there are these crucial connect like reciprocal connections between layer five of the cortex and the medial dot so and the thalamus and when those goes out basically uh general they go out under general anesthesia and when you are awake or when like whiskers are stimulated in bowel cortex",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5427.742,
    "end": 5433.885,
    "text": " when the mouse kind of reports as in it says its whiskers were stimulated, this circuit goes off essentially.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5434.565,
    "end": 5446.491,
    "text": "So I think the thalamus is crucial, but kind of Allah, Dahan and everyone else, I think the reticular thalamic activating system and all those subcortical structures, these are background conditions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5447.951,
    "end": 5453.454,
    "text": "Similar to what Ryan said, it puts the cortex in kind of the state where it could be aware of something, but",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5454.378,
    "end": 5462.562,
    "text": " The actual contrast between something being broadcast versus not broadcast or being reported versus not reported does not rely on those structures.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5463.222,
    "end": 5474.968,
    "text": "And I would just want to see from those authors, I would actually just want to see them engage with something like the visual awareness literature and show that those structures are differentially involved.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5478.968,
    "end": 5479.67,
    "text": " Thanks for that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5480.292,
    "end": 5486.268,
    "text": "Steven, go for it, and then Dean, Blue, or actually then Scott, and then Dean or Blue if you want, but Steven with a question, then Scott.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5489.227,
    "end": 5491.089,
    "text": " Yes, so thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5491.749,
    "end": 5507.581,
    "text": "Just a question, just to be clear, so effectively you tagged the degree in prediction confidence and that mapped against the data that's empirical, if I'm right in understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5508.162,
    "end": 5514.606,
    "text": "So as the model showed a difference in confidence, that was showing a correlation to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5515.467,
    "end": 5516.628,
    "text": " how firing happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5517.188,
    "end": 5539.357,
    "text": "And I'd just be curious to know if you think that this sort of key level or something where this firing or deductive piece can happen, where there's a shift between maybe a more Markovian, gothic process to something more semi-Markovian,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5541.118,
    "end": 5570.648,
    "text": " and less ergodic and you so that an organism can make non-ergodic choices in conscious awareness uh so i mean a couple of things so i'm not sure about the ergodicity comment so i think you can probably have i'm not sure how semi-markovian systems relate to ergodicity i assume that you can have a semi-markovian system in a ergodic system that doesn't like that wouldn't surprise me um yeah so basically when you move from a",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5571.626,
    "end": 5573.267,
    "text": " I just don't know, actually, just to flag that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5574.068,
    "end": 5582.952,
    "text": "But I'm not particularly up on a lot of the physical physics that relates to how these models work.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5583.953,
    "end": 5589.876,
    "text": "But yes, when you move from a first-level model to a second-level model, they are semi-Markovian.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5590.936,
    "end": 5593.138,
    "text": "And can you just maybe define that a little more?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5593.198,
    "end": 5594.258,
    "text": "What does that mean to you?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5594.538,
    "end": 5595.379,
    "text": "What does that enable?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5595.399,
    "end": 5598.0,
    "text": "And maybe that will get at what Stephen was asking, too.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5600.1,
    "end": 5605.984,
    "text": " Basically, the model is no longer just purely dependent upon the previous state at the first level of the model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5608.045,
    "end": 5613.849,
    "text": "There is more information that is determined at the second level than what just goes on at each time step of the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5614.35,
    "end": 5615.771,
    "text": "That's basically it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5615.811,
    "end": 5619.833,
    "text": "Yeah, so I think we have a sentence about this somewhere.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5619.873,
    "end": 5626.518,
    "text": "Yes, what the temporally deep scale buys you is essentially what we were saying before.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5626.798,
    "end": 5628.179,
    "text": "All of those cognitive actions",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5628.891,
    "end": 5640.293,
    "text": " that allow you to do things like construct reports, make plans, et cetera, et cetera, and kind of abstract away from moment by moment sensory flux.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5640.813,
    "end": 5643.074,
    "text": "All of these things depend upon there being a second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5645.134,
    "end": 5651.116,
    "text": "And that might be reflected in the brain, from the granular smooth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.316,
    "end": 5653.536,
    "text": "No.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5653.596,
    "end": 5657.557,
    "text": "So granular cortex is, generally speaking, like,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5660.751,
    "end": 5664.353,
    "text": " So the cortex has six layers, roughly speaking across.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5664.993,
    "end": 5690.486,
    "text": "And as you kind of move up or move towards the center of some centrifugal hierarchy, depending on who you talk to and what kind of anatomical maps you believe, that type of thing, layer four of that, the granular cortex, which is essentially the input layer from the thalamus and the feed forward layer that gets smaller and smaller and smaller until when you're at kind of the center of this hierarchy or this centrifuge.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5692.362,
    "end": 5694.743,
    "text": " you essentially have no granular cortex at all.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5696.983,
    "end": 5700.284,
    "text": "This is kind of ties in Lisa Felden Barrett's done a lot of stuff with this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5701.164,
    "end": 5702.785,
    "text": "I have problems with that view, to be honest.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5702.805,
    "end": 5708.426,
    "text": "They kind of say the top of the hierarchy is where they think consciousness lives.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5711.547,
    "end": 5720.449,
    "text": "I have a rather vehement disagreement in that I just think there's absolutely no evidence that that's true in terms of neuroimaging evidence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5721.355,
    "end": 5724.418,
    "text": " The areas that are relevant seem to be these frontoparietal regions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5725.439,
    "end": 5729.121,
    "text": "They do have a somewhat well-defined layer four.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5729.422,
    "end": 5731.764,
    "text": "It's not completely agranular.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5732.464,
    "end": 5733.185,
    "text": "It's not granular.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5733.325,
    "end": 5734.085,
    "text": "It's somewhere in between.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5734.105,
    "end": 5736.928,
    "text": "Yeah, I don't know.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5737.048,
    "end": 5740.771,
    "text": "I think they, one thing to say about, I know Ryan has very specific views about this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5740.831,
    "end": 5743.133,
    "text": "And I should say that I really love Lisa Feldman Barrett's work.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5743.153,
    "end": 5744.073,
    "text": "I just think she's wrong about this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5750.18,
    "end": 5764.515,
    "text": " I just want to go with kind of the empirical contrasts right and not speculate too much about very specific implementation details so look they kind of go from a very loose model of kind of predictive coding and then map it to these like.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5766.177,
    "end": 5769.16,
    "text": "cellular data kind of details about the structure of neurons.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5770.815,
    "end": 5779.32,
    "text": " I am more interested in going from these computational properties to basically what would measure the level of neuroimaging, because I think that's what is most tractable experimentally.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5779.84,
    "end": 5783.262,
    "text": "And then if we're, and there's still a lot of debates about that neuroimaging level, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5783.682,
    "end": 5789.886,
    "text": "If we kind of hammer it out and decide what's going on at the neuroimaging level of analysis, then good.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5790.829,
    "end": 5796.751,
    "text": " then we can start having more serious discussions about particular involvement, particular types of cortex.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5796.771,
    "end": 5798.231,
    "text": "But I just don't think we're there yet empirically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5798.711,
    "end": 5815.636,
    "text": "Yeah, I mean, I would say, yeah, just to kind of echo that a little bit, you know, it's important to realize that it's not as though, you know, the particular sets of, you know, little node neurons and synaptic necrins and the kind of like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5816.539,
    "end": 5835.577,
    "text": " know hypothetical columns um you know that chris showed earlier in terms of the neural process theory um that's just kind of one example of a way you could set it up there's there's a very very large number of ways that you could connect up neurons together in different structures that would implement basically the same algorithm",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5837.092,
    "end": 5844.797,
    "text": " And in addition to that, there are different message passing algorithms that you can use to solve the same graphs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5846.198,
    "end": 5851.701,
    "text": "An active inference isn't defined by some particular message passing algorithm, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5851.761,
    "end": 5856.685,
    "text": "Like Thomas Parr has shown this specifically in a paper where you can have different neural implementations",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5857.505,
    "end": 5862.19,
    "text": " that require more or less neuronal resources to implement.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5862.59,
    "end": 5879.325,
    "text": "It's kind of a trade-off between efficiency and accuracy where, you know, for instance, like really, really accurate methods passing algorithms like belief propagation, they require more neurons to do, but they're a little more accurate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5880.487,
    "end": 5883.129,
    "text": " And the brain could use that, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5883.229,
    "end": 5891.235,
    "text": "Or the brain could use variational message passing, which is not quite as good of an approximation, but requires less resources to do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5891.255,
    "end": 5900.381,
    "text": "So the point being is that there's not really that strong of commitment to that level of kind of circuit detail in active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5900.441,
    "end": 5907.966,
    "text": "It's more just a theory of you can have this pattern of synaptic connections that implement the matrices, and we represent",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5908.507,
    "end": 5912.21,
    "text": " posterior beliefs over states with these firing rate functions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5913.671,
    "end": 5916.193,
    "text": "And then you take the rate of change in those to put the PRPs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5917.314,
    "end": 5924.52,
    "text": "But so this is kind of the issue with it doesn't really make sense to me anyway at this point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5924.62,
    "end": 5926.061,
    "text": "Again, it's echoing what Chris said.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5927.362,
    "end": 5931.786,
    "text": "To start with, hey, let's assume that this one very specific",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5932.566,
    "end": 5935.671,
    "text": " way of setting up neurons to do this is the right one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5936.252,
    "end": 5947.329,
    "text": "You know, let's just assume that and then figure out what must be true about different areas of cortex based on their layer, based on their cortical column layer structure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5948.19,
    "end": 5960.686,
    "text": " Um, so, so then it's definitely, I mean, it's super interesting and probably has, um, you know, a really meaningful, interesting mapping between the differences between granular and granular and a granular.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5961.327,
    "end": 5963.229,
    "text": "Um, with respect to computational function.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5963.99,
    "end": 5966.774,
    "text": "Um, but, um, but again, you know, like, I don't think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5967.752,
    "end": 5979.582,
    "text": " until we've really nailed down that there is this one particular circuit implementation, it doesn't really make sense, in my opinion anyway, to kind of infer from that direction the function.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5980.402,
    "end": 5986.867,
    "text": "I should say, just to kind of echo that, I think if you work in your imaging, it doesn't make sense.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5987.007,
    "end": 5996.595,
    "text": "If you work in mouse, in a mouse model, and you were literally testing hypotheses at the circuit level, then it would make sense something to do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5998.223,
    "end": 6016.959,
    "text": " well right but in that case you're literally testing like the predictions of specific message passing algorithms yeah exactly so that was kind of a testing that's testing for message passing algorithms that's not assuming a particular one and inferring from that so anyway I mean but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6017.403,
    "end": 6033.632,
    "text": " I mean, if you, I mean, for people who are interested, I mean, we, you know, so I and a couple of previous papers have, you know, kind of built multi-level active inference models similar to this, but specifically about emotional awareness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6034.893,
    "end": 6045.599,
    "text": "You know, the sort of show how you can get, you know, from simple kind of lack of awareness of single emotional states all the way up to being aware of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6046.021,
    "end": 6073.279,
    "text": " feeling multiple emotions at the same time and being able to report them and things like that that kind of show how a structure not too different from this one can generalize to emotions or really to any other sort of thing that you could experience and be aware of, whether that's coming from inferring things about your own kind of bodily state and its emotional meaning from interoception or whether it's something like vision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6074.599,
    "end": 6096.948,
    "text": " So, I mean, we haven't covered that stuff in any of these sorts of things before, but that stuff is also out there that might kind of help at least show what kind of the view on our end is about how active inference can account for emotional phenomena and be consistent with the current literature on emotional awareness as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6098.356,
    "end": 6099.817,
    "text": " Thanks for these awesome answers.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6100.217,
    "end": 6104.619,
    "text": "Scott with a question, and then I'll ask one from the chat, and then Dean or Blue or someone else.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6112.403,
    "end": 6113.404,
    "text": "Here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6113.444,
    "end": 6113.704,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6113.744,
    "end": 6116.085,
    "text": "Great and fascinating presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6116.385,
    "end": 6121.007,
    "text": "I was wondering, this book, The Intelligent Movement Machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6122.728,
    "end": 6123.249,
    "text": "Graziano.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6123.289,
    "end": 6123.449,
    "text": "Graziano.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6124.676,
    "end": 6136.86,
    "text": " Yeah, and it talks generally about the cortical mapping being predicted by the movement repertoire in the motor cortex and kind of that embodiment kind of element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6137.26,
    "end": 6152.505,
    "text": "One of the things I wanted to ask about, and I think it follows from this most immediate prior part of the conversation, is when we have an active inference setting and that model is being employed for multiple things,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6154.201,
    "end": 6181.197,
    "text": " perception, and I won't use the phrasing right because my active inference terms aren't all up to snuff, but when the inputs into the individual who's performing the active inference, that system, are from various sensory inputs and various temporal distance, so there's several inputs, and then they're being synthesized into a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6182.483,
    "end": 6187.806,
    "text": " an action or an externality, something's going to reach out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6187.846,
    "end": 6190.928,
    "text": "And again, my apologies for not internalizing all the definitionals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6192.308,
    "end": 6203.975,
    "text": "What are some of the cortical mappings or have you found cortical mappings that embody that process of synthesizing multiple inputs into a single action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6205.29,
    "end": 6217.219,
    "text": " What are the core, what are the structural correlates of the process of synthesis of multiple different strands of active inference into a single action potential?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6217.279,
    "end": 6220.102,
    "text": "I'm using the wrong words, but nice question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6220.282,
    "end": 6222.764,
    "text": "Is this a question essentially about multimodal integration?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6223.624,
    "end": 6223.865,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6223.985,
    "end": 6224.785,
    "text": "So, yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6225.526,
    "end": 6230.73,
    "text": "Um, so I guess I think active inference is probably, you could, you might be able to build a specific.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6231.851,
    "end": 6233.192,
    "text": "So I think there are two parts of this question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6233.212,
    "end": 6234.053,
    "text": "That's an interesting question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6234.533,
    "end": 6234.573,
    "text": "Um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6235.086,
    "end": 6238.427,
    "text": " First part is I'll just kind of answer the active inference end of it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6239.328,
    "end": 6243.83,
    "text": "The way I think about active inference at least is just as a really useful modeling and mathematical framework.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6244.39,
    "end": 6249.092,
    "text": "And I think it's possible to build multiple active inference models of any phenomena.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6250.193,
    "end": 6258.977,
    "text": "So I would want to hammer out an empirical paradigm and then figure out, okay, what models could I build of this?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6259.497,
    "end": 6260.597,
    "text": "So that's kind of the first part.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6260.797,
    "end": 6262.358,
    "text": "Second part is just about multimodal integration.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6262.518,
    "end": 6264.359,
    "text": "Are there kind of places that hows",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6265.242,
    "end": 6269.145,
    "text": " I haven't looked at multimodal integration since I was an undergrad.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6269.165,
    "end": 6274.209,
    "text": "I'm just trying to remember like my third year Cognuro courses.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6274.31,
    "end": 6285.339,
    "text": "I think there are places in like posterior parietal cortex where there is integration between multiple modality, like you might say like vision and one other thing or whatever it is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6285.759,
    "end": 6288.862,
    "text": "And then that gets shot off to motor cortex implemented in actions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6288.882,
    "end": 6291.003,
    "text": "So I don't know.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6291.083,
    "end": 6293.405,
    "text": "I think I would just say, look at the motor planning literature.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6295.472,
    "end": 6301.136,
    "text": " There's lots of stuff about Bayesian visual writer integration.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6301.556,
    "end": 6310.662,
    "text": "And just to follow up, one of the things that leads to is I was wondering about the situated cognition opportunities for those syntheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6311.503,
    "end": 6317.747,
    "text": "So for instance, you have hysteresis, or my son used to say stereotypes are a real time saver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6317.987,
    "end": 6318.828,
    "text": "He said it as a joke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6320.142,
    "end": 6323.605,
    "text": " So the idea is you have externalities that facilitate the synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6324.145,
    "end": 6332.851,
    "text": "So they're actually not cortical structures, they're social and linguistic and rhetorical structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6332.971,
    "end": 6349.001,
    "text": "Where I'm exploring is could those be described with some of the same models as the cortical structures so you're actually able to have a scale-independent description of the processes both in a social and a cortical cognitive context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6349.637,
    "end": 6353.623,
    "text": " for the synthesis of multiple multimodal inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6355.386,
    "end": 6357.149,
    "text": "So I'm not sure about the scale independent part.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6357.905,
    "end": 6384.899,
    "text": " yeah yeah i i i hear what you're at no scott it's a beautiful question i see where you're coming from because we've been talking about the scale free formulisms with chris fields and others and then this whole nested markov blankets like you could have the neuron and then the neural you could go within a model and just like you said um your model doesn't presuppose that awareness is actually at a higher level you're just saying there is a structure that's deep temporal structure and that's the state that's the timeline that you are at but there could be another level",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6385.399,
    "end": 6395.225,
    "text": " And then mechanistically or functionally, how that level plays out is going to come back to a task specific measurement, which is and a plurality of models.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6395.685,
    "end": 6397.046,
    "text": "So still good points.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6397.346,
    "end": 6411.154,
    "text": "I mean, part of part of I mean, I think, you know, I mean, to go back to I mean, there's lots of like, nice opportunities, right to build active inference models would be very simple, you know, for like, multiple multimodal or cross modal, right integration tasks, you know, like, for instance, like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6411.861,
    "end": 6435.964,
    "text": " um i haven't seen this done um but maybe i have to look back but things like the double flash illusion or the rubber hand illusion or you know any any of these kinds of yeah multimodal things i mean like like a double flash illusion is really nice right because i mean more or less for people aren't familiar um you either play one or two tones and they are coincident with a single flash of light",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6437.441,
    "end": 6446.027,
    "text": " And it just turns out that when you play two tones really quick, then people perceive two flashes of light when there was really only one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6447.788,
    "end": 6458.915,
    "text": "And the reason for that is, so there's just this kind of like prior in the mix, presumably, that coincident, you know, things that are coincident temporally have the same hidden cause.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6460.096,
    "end": 6466.1,
    "text": "But also at the same time, the temporal resolution of audition is just better.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6466.87,
    "end": 6496.065,
    "text": " um this is more trustable than the temporal resolution of vision um so so you can just say look like the system just trusts right it has beliefs that the auditory system has higher precision and that there's a high probability of common causes of coincident input therefore there must have been two flashes um given that there was two cones um you know i mean that's just one example of like a really simple well-known empirical task um of cross-modal integration",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6496.707,
    "end": 6498.674,
    "text": " that would be pretty easy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6498.694,
    "end": 6502.046,
    "text": "I mean, probably without a lot of without even a ton of tweaks to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6502.574,
    "end": 6506.237,
    "text": " that the kind of structure of the model that we're using here, you could do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6506.317,
    "end": 6519.488,
    "text": "And all you'd really have to do probably is just assign the right precision to the auditory and visual input, where those are jointly generated by the same hidden cause or hidden state in the model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6520.668,
    "end": 6527.174,
    "text": "And so basically, it's either you're just inferring one cause or two causes, and that either generates receiving one flash or two flashes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6527.194,
    "end": 6530.336,
    "text": "I mean, anyway, it would be simple to do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6532.103,
    "end": 6542.969,
    "text": " Um, and, uh, like I said, I don't know if I don't not aware of that having been done in a kind of formal active inference and DP literature, but, um, you know, I mean, there are known, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6543.029,
    "end": 6549.613,
    "text": "Like neural correlates of this stuff and, you know, they're in part where you'd expect them to be right there at like the borders, right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6549.673,
    "end": 6556.617,
    "text": "Of like auditory and visual processing and like association cortex, um, like posterior association cortex, um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6557.509,
    "end": 6581.193,
    "text": " and uh you know so it'd be really really really cool project right to try to build a model of something like that and then uh just see right whether the predicted uh neural time courses um actually better kind of single out right the the areas the association areas where the kind of borders of vision are different it seems like it's it's almost like a situated synesthesia",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6581.912,
    "end": 6590.575,
    "text": " where you have the Gabor Square, where you have the frequency and time variance, but one of the variants is being hijacked by another perception in the visual field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6591.368,
    "end": 6619.302,
    "text": " right you know so the you're you're it that you it's crossing over to that other sense is very interesting thank you thanks um i'm going to ask a question from the chat and then if anyone wants to give probably a short final note but then we'll end around the hour so that we can have a whole second discussion next week the question in the chat is um to the authors what would you say the main limitations of the model are or where are some next things you're building on but what are the main limitations of the current model and then how are you going to be building",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6621.516,
    "end": 6623.277,
    "text": " So, I mean, there's lots, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6624.618,
    "end": 6626.679,
    "text": "So I'll just list them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6627.08,
    "end": 6628.62,
    "text": "I think we list this in the paper somewhere too.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6628.641,
    "end": 6632.243,
    "text": "For starters, it's a discrete model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6633.223,
    "end": 6638.747,
    "text": "We treat the whole visual system as basically like one discrete hidden state to be inferred by the high level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6638.787,
    "end": 6645.511,
    "text": "That's obviously like not true, but it's a good enough approximation to actually think reproduce a bunch of findings.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6646.732,
    "end": 6648.393,
    "text": "It would be nice to have a multi-level model",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6649.793,
    "end": 6652.694,
    "text": " Now, with that multi-level model, I think there are some empirical cases.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6652.734,
    "end": 6668.961,
    "text": "There's this thing called the partial awareness hypothesis by Sid Kuder, where they talk about having partial access, or the global workspace having partial access to different parts of the hierarchy, and that giving rise to kind of odd experiences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6669.081,
    "end": 6677.945,
    "text": "So you might have something like, you might have really good access to the fact that the color of Ryan's shirt, but not to the fact that it's a shirt, or vice versa.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6680.518,
    "end": 6681.438,
    "text": " So that would be nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6681.578,
    "end": 6688.08,
    "text": "I'm not sure quite how to do that in a hidden Markov model situation, but that would be nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6688.36,
    "end": 6693.281,
    "text": "Second thing is we really just model kind of report paradigms here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6693.301,
    "end": 6703.823,
    "text": "So where we're going with this is we're trying to extend this explicitly to model some no report paradigms and actually casting kind of thinking about that in a more precise way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6704.383,
    "end": 6708.224,
    "text": "And so we've actually built another model and we're kind of writing it up at the moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6709.024,
    "end": 6709.464,
    "text": "I mean, it's not...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6710.584,
    "end": 6722.39,
    "text": " It's kind of a side project because it's not a part of my PhD thesis, but the idea is roughly speaking to actually have a model that is able to explain a lot of the weird findings in the no report literature.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6722.41,
    "end": 6732.416,
    "text": "And also I think we have a much more principled, we now have a much more principled account of report that I'm really quite excited about.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6733.436,
    "end": 6736.698,
    "text": "Then just like, I guess on a last limitation would just be,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6738.976,
    "end": 6744.378,
    "text": " And this isn't really a limitation because Ryan has got a lot of work in emotion and interoception on this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6744.398,
    "end": 6746.819,
    "text": "And I know that's somewhere that his lab is like really pushing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6747.68,
    "end": 6754.943,
    "text": "But it would just be nice if we could use these very similar architectures and apply them to something like interoceptive awareness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6756.563,
    "end": 6767.848,
    "text": "And I would find it personally very compelling if you had one, I think it's too demanding to have one model, but one very general model structure that generalizes across",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6768.444,
    "end": 6774.048,
    "text": " visual consciousness to interoceptive awareness, to like auditory awareness, to smatter sensory awareness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6774.569,
    "end": 6775.43,
    "text": "That would be really nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6777.631,
    "end": 6778.632,
    "text": "Awesome answer.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6778.972,
    "end": 6780.273,
    "text": "Ryan, do you want to add anything?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6780.434,
    "end": 6782.295,
    "text": "And then we'll have any final comments.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6784.116,
    "end": 6790.041,
    "text": "You know, I mean, I think, I think Chris covered most of the kinds of limitations or, I mean, I don't know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6790.061,
    "end": 6796.006,
    "text": "I mean, I would just say like, like, yes, I mean, it would be, it would definitely be nice to do something like have a,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6796.496,
    "end": 6812.787,
    "text": " So there are what are called mixed models where you have kind of a discrete model like ours on the top, but then the kind of posteriors, some predictions downward that essentially set set points for a continuous level below it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6814.188,
    "end": 6820.472,
    "text": "So then you can have a continuous state space where, for instance, it's a lot more plausible, right, to think that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6821.997,
    "end": 6831.059,
    "text": " the sorts of inferences that are being made in kind of like early visual processing or on a, you know, on a continuous, a continuous state space, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6831.079,
    "end": 6835.52,
    "text": "It doesn't have to be like motion speed one, motion speed two, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6835.6,
    "end": 6839.541,
    "text": "It can be, it can be continuous values, um, for, for things like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6840.322,
    "end": 6845.263,
    "text": "Um, but, um, like another thing that I, you know, I mean, you know, Chris mentioned interception and emotion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6846.621,
    "end": 6853.625,
    "text": " I mean, that's something, like I said, I mean, we have empirical paradigms that we've been setting up to test just this kind of thing in interoception.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6853.645,
    "end": 6864.511,
    "text": "And we have a paper under review right now where we applied a computational model to interoceptive perception and like a gastrointestinal interoception task.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6865.111,
    "end": 6867.593,
    "text": "That's not a multi-level model at the moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6868.713,
    "end": 6875.437,
    "text": "And that paradigm doesn't have, probably doesn't have enough trials to do contrast between",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6876.229,
    "end": 6884.986,
    "text": " um conscious versus unconscious um stimulations but we're kind of working on that um so that would be nice um another thing",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6885.7,
    "end": 6890.864,
    "text": " that Chris kind of mentioned the example of being aware that the shirt is red but not a shirt.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6890.904,
    "end": 6905.154,
    "text": "That kind of thing also is really important for modeling emotional awareness because a lot of times people might feel some kind of bodily sensations, kind of like a pit in their stomach or a fast heart rate or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6905.335,
    "end": 6914.982,
    "text": "They might be conscious of that but not infer one step above and be conscious of the fact that that's associated, say, with feeling fear.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6915.689,
    "end": 6915.949,
    "text": " Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6916.009,
    "end": 6918.871,
    "text": "Like like people with like panic disorder, for example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6918.951,
    "end": 6919.151,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6919.191,
    "end": 6926.596,
    "text": "They might feel like a strong heartbeat, but they might instead infer, oh, that means I'm having a panic attack or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6926.736,
    "end": 6928.758,
    "text": "Or they might infer, oh, I'm having a heart attack.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6929.358,
    "end": 6929.478,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6929.498,
    "end": 6933.841,
    "text": "So there are different kind of conceptualizations that you can you can infer from.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6934.201,
    "end": 6934.462,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6934.622,
    "end": 6939.485,
    "text": "Patterns in lower level interseptive experience, some of which are emotional and some of which are not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6941.206,
    "end": 6944.588,
    "text": "But and this is where it becomes interesting is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6945.768,
    "end": 6949.709,
    "text": " You might also prime an emotion category.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6951.149,
    "end": 6961.911,
    "text": "Like I mentioned with the guilt example, I could prime guilt so that higher level concept representation is activated, but does not enter into awareness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6962.771,
    "end": 6970.313,
    "text": "So you can kind of have multiple levels in a hierarchy where each level can independently or compete for broadcasting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6972.912,
    "end": 6991.617,
    "text": " You know, I've been thinking about ways to do this model-wise, and the best thing we've come up with right now, just in terms of the practical implementations we have, would be to, for instance, like have an interoceptive level and then have the emotional level above that, but have the interoception representations also get kind of like duplicated and passed up to the second level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6992.237,
    "end": 6998.299,
    "text": "So then they can also kind of equally compute, right, for access to like a third level that would be like the workspace level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6999.122,
    "end": 7007.446,
    "text": " Um, but anyways, I mean, these are all things that are kind of in progress, but just by way of saying, um, this additional limitation is you can only be in our model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7007.466,
    "end": 7015.29,
    "text": "You could only be conscious of conscious or unconscious of one type of processing or love one level of abstraction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7015.31,
    "end": 7022.494,
    "text": "Um, which is not, you know, the case in the, which is not the case in the, it's not the true case.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7024.994,
    "end": 7027.177,
    "text": " Thanks a lot for these awesome answers.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7027.958,
    "end": 7030.502,
    "text": "Always a great time with the two of you on the stream.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7031.123,
    "end": 7034.568,
    "text": "So just thank all the participants who joined us live.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7035.048,
    "end": 7037.131,
    "text": "And in the calendar event, there's a form.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7037.151,
    "end": 7039.735,
    "text": "So it'd be helpful if you want to add feedback on the form.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7040.416,
    "end": 7043.758,
    "text": " And then we're going to be having 18.2 next week.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7043.798,
    "end": 7045.72,
    "text": "At the same time, it's going to be the same paper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7046.24,
    "end": 7053.605,
    "text": "So hopefully we'll all get another chance to reread the paper, listen to this stream because Christopher, what you said was really deep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7054.105,
    "end": 7058.228,
    "text": "So again, much appreciated to all and we'll see everyone next week.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7059.409,
    "end": 7059.769,
    "text": "Thanks guys.",
    "speaker": "SPEAKER_07"
  }
]