[
  {
    "start": 8.629,
    "end": 9.39,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.67,
    "end": 10.911,
    "text": "I think that we're going now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.612,
    "end": 13.253,
    "text": "This is the Active Inference Livestream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.493,
    "end": 18.218,
    "text": "It's Active Inference Livestream 18 on March 17th, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.12,
    "end": 21.921,
    "text": "Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.322,
    "end": 28.847,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.088,
    "end": 31.049,
    "text": "You can find us at any of these links here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.489,
    "end": 34.811,
    "text": " This is a recorded and an archived live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.192,
    "end": 38.195,
    "text": "So please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.176,
    "end": 44.822,
    "text": "All backgrounds and perspectives are welcome here and we'll be using good video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.042,
    "end": 47.044,
    "text": "And Steven, thanks so much for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.144,
    "end": 52.95,
    "text": "Always awesome to have you on for the conversations and this will be very fun convo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.144,
    "end": 73.975,
    "text": " here looking at the calendar we can see at the shortened length that we're down in the end of march 2021 in number 18 which is going to be about the paper the predictive global neuronal workspace a formal active inference model of visual consciousness by christopher white and ryan smith",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.166,
    "end": 103.062,
    "text": " and this video in 18.0 is going to be about setting the context for 18.1 and 0.2 whether participating in these discussions with the authors if you're listening to this before those events happen or contextualizing um in sort of a bi-directional way for listening to those later discussions so if you're in the active inference community this might be exposing you to some new questions and perspectives if you're from outside the active inference community or you're not familiar with it then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.482,
    "end": 130.497,
    "text": " this will be highlighting how active inference is an integrative framework across a few different other ideas these dot zero videos are just introductions to the ideas because you could take a whole course of learning on any one of them so they're just little uh suggestions and hints related to the ideas and where this paper is going as far as the punchline is that we can build on this uh predictive global neuronal workspace model and think about it in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.65,
    "end": 138.675,
    "text": " being implemented by active inference type models and get new insights, predictions, and hopefully explanations and applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.815,
    "end": 148.321,
    "text": "And in 18, we're gonna pretty much go through a lot of the paper as far as their goals and the questions and many of their copious figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.362,
    "end": 153.465,
    "text": "And it'll be good to talk to Ryan and Christopher when they join for the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.465,
    "end": 162.068,
    "text": " For 18.1 and 18.2, we're going to be discussing this paper, so save and submit your questions and get in touch with us if you want to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.509,
    "end": 170.332,
    "text": "Okay, so here is the paper, Predictive Global Neuronal Workspace, A Formal Active Inference Model of Visual Consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.792,
    "end": 182.357,
    "text": "Before we read the goals and claims, Stephen, maybe you could just say hello and introduce yourself and what got you excited in this paper just personally before we dive into the paper itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.394,
    "end": 185.074,
    "text": " Thanks, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.274,
    "end": 196.5,
    "text": "Yeah, well, my background is that I'm doing a practice-based PhD at the Solomons Institute of Applied Psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.68,
    "end": 205.584,
    "text": "So I'm interested in how active inference can help understand some of the processes that I've been working on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.325,
    "end": 215.219,
    "text": " for understanding pre-reflective phenomenological awareness and people's sense making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.399,
    "end": 219.847,
    "text": "So that kind of ties in to how I'm also interested in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.474,
    "end": 243.327,
    "text": " ryan and christopher's work because they're bringing this into the psychological domain but also bringing that into the phenomenological domain in ways which are practically predictive and so that's really really exciting and i'm i see a lot of opportunities for this modeling work and i've",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.647,
    "end": 258.583,
    "text": " actually spoken to Ryan about this to try and link in with other ways of people doing sense making etc so and this particular paper I think is really interesting because we've got a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.801,
    "end": 284.354,
    "text": " exciting philosophical ideas around global workspace concepts in neuroscience and an area that I've only partly explored but to have this integrated into a predictive model that can be tested at certain scales in certain ways and to have people who've got the sort of rigor and the kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.441,
    "end": 297.171,
    "text": " the ability to focus down and choose experimental and practical ways to explore this, which Ryan and Christopher have, is really helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.251,
    "end": 304.617,
    "text": "So I'm looking at this from a few different ways, and hopefully that will be something that other people will find useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.683,
    "end": 305.923,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.684,
    "end": 309.946,
    "text": "So this is kind of a big paper and topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.487,
    "end": 314.83,
    "text": "So we're going to frame it first with just how the authors represented their goals and claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.93,
    "end": 318.814,
    "text": "And then we're going to kind of pull back to just the bigger questions about the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.434,
    "end": 322.456,
    "text": "And then we're going to go through basically the keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.937,
    "end": 329.282,
    "text": "So if when reading what the authors are setting out to do, it's like, why would you even want to travel from A to Z?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.362,
    "end": 330.603,
    "text": "We're going to go to define them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.983,
    "end": 334.146,
    "text": "So Stephen, do you want to read the first one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 336.804,
    "end": 345.429,
    "text": " of uh on six oh wait you're muted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.522,
    "end": 359.966,
    "text": " So goals and claims of the paper here, we've got formalizing ideas first introduced by Howie and White and Friston.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.986,
    "end": 379.334,
    "text": "So they argue that conscious access or ignition, which is this kind of sudden awareness that things come into our awareness, is a fundamentally inferential process that depends upon a level of processing of sufficient temporal depth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 380.174,
    "end": 404.59,
    "text": " to contextualize and coordinate lower levels of processing so that's actually quite um has a few implications that so and should i carry on is that okay sure um then also to build on the previous conceptual contributions in this area mentioned above um they they will be substantiating arguments with a series of detailed computational simulations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.604,
    "end": 414.188,
    "text": " These simulations are based upon the first principles account of perception and action selection offered by active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.929,
    "end": 420.872,
    "text": "So that's, again, that's one of the real foundational benefits that this is testable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 421.432,
    "end": 427.075,
    "text": "And then also they end by examining the relationships between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.102,
    "end": 445.176,
    "text": " the predictive global neuronal workspace, which they've introduced as a concept, and alternative models, and briefly address potential concerns about how phenomenal consciousness could plausibly be situated within the model that they're going to present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.976,
    "end": 452.662,
    "text": "However, this paper is chiefly concerned with what Block terms access consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.742,
    "end": 459.808,
    "text": " which is defined as the availability of information for verbal report, voluntary action, and executive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.228,
    "end": 463.611,
    "text": "For brevity, they will use conscious access.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.631,
    "end": 468.856,
    "text": "They use conscious access and consciousness interchangeably throughout the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.876,
    "end": 474.622,
    "text": "So just to really, you know, this gives them a practical starting point to work on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.002,
    "end": 475.102,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.848,
    "end": 504.988,
    "text": " ice yep there's a lot in these goals but one of the key pieces is that they're talking about informational availability in terms of report paradigms and then they're going to be connecting big questions in multi-scale systems and cognition to active inference so let's unpack that a little bit in terms of just what are the bigger questions not in the author's words that we identified this paper as relevant for so people who are maybe working in these areas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.948,
    "end": 509.669,
    "text": " And the first one is which one of these do you want to just go for first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.81,
    "end": 516.631,
    "text": "I might just mention the first one and then if you can pick it up after that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.651,
    "end": 524.313,
    "text": "So, yes, basically, they're just there is a question really that they're exploring, can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 525.083,
    "end": 541.574,
    "text": " simulations using generative models of belief updating give you principled schemes in active inference to extend to other proofs for a predictive global neuronal workspace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.594,
    "end": 553.242,
    "text": "So does this lead to sort of a plausible route doing this sort of simulation to a predictive approach to this whole paradigm?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.693,
    "end": 582.074,
    "text": " nice and it's related to the second question which is what are the unique predictions and explanations of active inference so it's the first question is kind of asking how can we use the simulation the generative model how can that be used to get to unique evidence or unique claims or unique experimental design and then something that's related to active inference's role is how could this reposition the distinctions that people make between access",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.035,
    "end": 600.471,
    "text": " consciousness and phenomenological consciousness so access consciousness as per the previous slide is the informational accessibility phenomenological consciousness is the awareness or the qualia and an example of something that's in access consciousness but not phenomenological would be like a subliminal sound",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.112,
    "end": 622.201,
    "text": " because you're not experiencing it it's subliminal but it can influence somebody so that is within their access consciousness because informationally it leads to differential behavior or the planting of an idea but it's not phenomenologically experienced so it's not just one basket with what um is being met with consciousness yes stephen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.061,
    "end": 641.067,
    "text": " Yeah, and just to clarify a little bit on that as well is that they are using this idea for this access consciousness whereby you can access it in a way that you could report on it, like you're saying, and that may be there, like you say, as a qualia,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 642.587,
    "end": 649.789,
    "text": " and it may be transiently available, but you may not be able to access it from a reporting paradigm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.869,
    "end": 661.592,
    "text": "So the way they frame access consciousness is to really give a temporal depth and a sense of how stuff comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.712,
    "end": 667.454,
    "text": "So the idea with access consciousness is it's either accessible or it's not, whereas phenomenological consciousness is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 668.342,
    "end": 672.189,
    "text": " kind of more of that flux, which is when we think of consciousness, it's hard",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.399,
    "end": 675.02,
    "text": " is not really something you can put in a box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.06,
    "end": 681.201,
    "text": "Whereas access consciousness, you can't put it in a box either, but they're more able to, so they can model it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.461,
    "end": 682.762,
    "text": "So it's useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.202,
    "end": 683.402,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.082,
    "end": 697.126,
    "text": "They also are setting out to address how the active inference model can integrate different ideas like Bayesian brain and global neuronal workspace in neuroscience and combine that with more psychological applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.646,
    "end": 699.647,
    "text": "And also they're asking in this paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.467,
    "end": 716.898,
    "text": " how can they perhaps integrate with other existing active inference models to sort of extend other work like related to the global neuronal workspace and also bringing it into a specific visual modality and experimental task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.818,
    "end": 721.421,
    "text": "So we had a bunch of questions making .zero as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.901,
    "end": 726.484,
    "text": "So what is just one or a few of the questions that you just wanted to raise and why did you raise it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.876,
    "end": 734.206,
    "text": " You made it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.755,
    "end": 748.719,
    "text": " Some of the questions that came up for me was, you know, just how does this all fit together into what's potentially in the future?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.739,
    "end": 761.865,
    "text": "So I'd be really interested to get Ryan and Christopher's sort of take on some of these distinctions, you know, just like you were talking about that potential for it to go into multisensory integration and beyond.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.445,
    "end": 766.247,
    "text": "So how does visual consciousness or awareness of that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.827,
    "end": 768.988,
    "text": " differ from general awareness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 770.729,
    "end": 781.774,
    "text": "And how does the ability of the predictive global neuronal workspace give these detailed simulations and resulting predictions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.094,
    "end": 785.336,
    "text": "So what's the potential for that in other fields and sectors?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.276,
    "end": 791.799,
    "text": "So one of them might be to help influence psychological perspectives on people's professional practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.9,
    "end": 818.198,
    "text": " as with people are starting to make even what it means to take a perspective how much is that access consciousness effectively when i start to bring something to my perspective am i bringing something to my access consciousness when medical understanding of conscious awareness or when people start to understand about self-reporting in general and how people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.259,
    "end": 841.36,
    "text": " know and people who are working with knowledge and bring things up because a lot of knowledge workers are using interviews and reporting paradigms and there's a big question about well how do you deal with first person normally it's first person perspectives which is one thing and then there's first person experience and how do you even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.611,
    "end": 846.193,
    "text": " get those two resolved in some sort of coherent way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.233,
    "end": 851.617,
    "text": "So I think that's something that would be really interesting to hear more on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.798,
    "end": 853.038,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.638,
    "end": 855.039,
    "text": "Good thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.339,
    "end": 861.744,
    "text": "And we're just always curious about where Active Inference comes from and where we can apply it and learn it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.724,
    "end": 864.385,
    "text": "Why does it really matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.926,
    "end": 868.668,
    "text": "Well, there's sort of a theory arm and an applications arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.389,
    "end": 870.81,
    "text": "The theory arm is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.843,
    "end": 885.192,
    "text": " This paper is exploring some experimentally tractable, unique predictions of an active inference type model and showing how it goes beyond Bayesian brain, global neuronal workspace, predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.552,
    "end": 890.716,
    "text": "It integrates across and it goes beyond several of these theoretical neuroscience modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.596,
    "end": 891.876,
    "text": "And then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.777,
    "end": 913.202,
    "text": " the paper is part of a broader network of research and work by ryan and others that we'll hopefully hear more about just as to how could this shape the kinds of clinical and community psychology practices that people are performing because this is related to all these types of uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.778,
    "end": 915.118,
    "text": " topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.539,
    "end": 918.041,
    "text": "So any thoughts on this before we go to the abstract roadmap?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.822,
    "end": 937.319,
    "text": "Yeah, I suppose it just comes back to this idea of ways of knowing what does it mean to, to know and be aware and have awareness, um, that, that actually is often sort of implicitly sort of in the background, but this gives a way to make some things more explicit, which I think could be really valuable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.922,
    "end": 940.062,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.068,
    "end": 949.49,
    "text": " So the abstract, just because I think we'll have enough to actually talk about with a paper, people can pause it to read the full thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.191,
    "end": 957.773,
    "text": "They're in the first part of the abstract framing the need to move beyond the global neuronal workspace model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.942,
    "end": 967.868,
    "text": " In the second half of the abstract, they report what they did, which is demonstrating their integrative model, which we're going to be able to look at and explain what they actually did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.449,
    "end": 977.055,
    "text": "And they find that that model is able to reproduce a lot of other findings from previously non-unified experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.016,
    "end": 988.183,
    "text": "And then they close with a discussion on how they can build upon previous work in this integrative and active inference style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.062,
    "end": 990.723,
    "text": " and where that leads to as far as predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.623,
    "end": 1003.969,
    "text": "So that's sort of reflected in their roadmap in that they give a basic broad introduction, then specific theoretical backgrounds on active inference and deep temporal modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.73,
    "end": 1007.311,
    "text": "They then spend the bulk of the work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.581,
    "end": 1022.246,
    "text": " presenting and many figures presenting the results and recapitulating several specific phenomena that are important to reproduce and also impressive to reproduce in a simple framework and one where we can see all the parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.086,
    "end": 1034.011,
    "text": "And then they close with basically a discussion about where their work is fitting in relative to other work and concluding, summarizing and stating a few next steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.371,
    "end": 1037.812,
    "text": "So how did that strike you or what would you add to that, Steven, if anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.608,
    "end": 1040.889,
    "text": " No, I think that's a good summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1040.969,
    "end": 1046.791,
    "text": "I think in some ways we might be that the authors would speak a bit more to how that taxonomy came about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.871,
    "end": 1057.576,
    "text": "And there's some nuances in there in terms of how and why they selected what they selected and which would be really interesting to to have them really step through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.596,
    "end": 1058.296,
    "text": "But and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.077,
    "end": 1071.102,
    "text": " But overall, the way they've modelled this out into a very practical, real-world kind of context, I think, shows their potential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1071.442,
    "end": 1086.789,
    "text": "And then what does that mean for this temporal structure then links back to other work around temporal depth, which is, you know, the kind of... Since I think it's 2016 has been what a lot of the active inference...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.748,
    "end": 1095.417,
    "text": " work has certainly in the modeling has really been yielding is this idea of temporal depth and what it can mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.518,
    "end": 1097.099,
    "text": "So that'd be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.36,
    "end": 1098.261,
    "text": "Nice, great point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.381,
    "end": 1101.725,
    "text": "Earlier models of active inference were sort of like instantaneous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.961,
    "end": 1104.763,
    "text": " or one-step models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.404,
    "end": 1113.372,
    "text": "And a lot of the ongoing research is about the integration of multiple scales or multiple coarse grainings of temporal dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.313,
    "end": 1115.975,
    "text": "So here are the keywords of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.035,
    "end": 1118.518,
    "text": "So if someone was listening to it from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.179,
    "end": 1132.808,
    "text": " any background and was curious about, well, why does it matter to connect some of these things or why is it important or how does that implication arise from integrating or what have previously people done if not with this integration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.488,
    "end": 1135.249,
    "text": "That's where the keywords kind of come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.01,
    "end": 1137.171,
    "text": "And we're gonna go through",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.237,
    "end": 1139.297,
    "text": " Basically a slide for each.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.118,
    "end": 1152.682,
    "text": "They are computational neuroscience, predictive processing, Bayesian brain hypothesis, active inference, consciousness, visual consciousness, global neuronal workspace, and the predictive global neuronal workspace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.702,
    "end": 1156.003,
    "text": "So let's start with computational neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.09,
    "end": 1169.772,
    "text": " A lot you could say about this, a lot of people's department and research, but we can just look at it pretty naively as the intersection of computational approaches and neuroscience research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1170.492,
    "end": 1176.893,
    "text": "So computational could mean using computers, which a lot of things are nowadays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.514,
    "end": 1184.675,
    "text": "Using computers could be descriptively modeling statistics, or it could be generatively modeling a system like with a simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.495,
    "end": 1190.866,
    "text": " But also, the computational approaches might include using computational metaphors to describe systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.106,
    "end": 1194.233,
    "text": "That might be considered computational as well, like computationalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.441,
    "end": 1205.406,
    "text": " On the other hand, neuroscience is about studying brains, but increasingly non-neural cell types in the brain, in the body, in the niche, in the society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.166,
    "end": 1217.912,
    "text": "So all these different aspects of behavior in the brain, and it uses all different kinds of approaches, some of which are computational, which brings us to the overlap, which can look like a few different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.092,
    "end": 1224.315,
    "text": "It could look like computational brain metaphors, the brain is a computer, or it does information transfer of this type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.596,
    "end": 1254.157,
    "text": " um it could look like doing descriptive or generative modeling on computational uh representations of neurological data it could look like brain computer interfaces so that's sort of computational neuroscience and steve i know that you like kind of saw where that could go beyond where most people would think about computational neuro do you want to mention it here on the next slide um maybe on the next slide and just um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1255.205,
    "end": 1265.026,
    "text": " I suppose in some ways it's just to try and highlight some of the thought practices I had to go through to get my head around what this means and how I could bring it together with the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.819,
    "end": 1267.02,
    "text": " the active inference process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.06,
    "end": 1289.06,
    "text": "So the challenge you slightly have with active inferences and predictive processing that goes with this is that it challenges the computer metaphor that we've kind of got embedded of how the brain works, either the model or the thought that we sort of bring in signals and then we have a computational awareness, we think it and then we do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.881,
    "end": 1302.05,
    "text": " it's this sort of open system so these predictive processes and this cybernetics so it kind of when we're talking about computational neuroscience",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.607,
    "end": 1326.679,
    "text": " in relation to the systems neuroscience the non-linear dynamical systems that active inference is part of um it's it's a bit more of an open um kind of process approach so i suppose that to for someone who's trying to understand this i think it i found it helpful to start to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.359,
    "end": 1337.044,
    "text": " to think about the computations of dynamic process that develops over time when it's used in this sort of context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.625,
    "end": 1349.791,
    "text": "And those sorts of ways that these models are, which is different to kind of system dynamic models, which are much more like flows on something which is defined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1349.851,
    "end": 1352.252,
    "text": "It's this kind of evolving process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.272,
    "end": 1354.934,
    "text": "And of course, the free energy principle then ties into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.675,
    "end": 1358.659,
    "text": " because it's all about being able to work with those dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.18,
    "end": 1361.843,
    "text": "So I don't know, does that make sense what's there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1363.578,
    "end": 1366.619,
    "text": " People can let us know if it makes sense or helps them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.959,
    "end": 1370.241,
    "text": "I think that the nonlinear dynamical systems is a big topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.361,
    "end": 1382.886,
    "text": "One way that that has been operationalized in neuroscience is the Bayesian brain hypothesis, because Bayesian statistics is often used to model nonlinear dynamical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.366,
    "end": 1386.668,
    "text": "So if we're thinking about the brain as a nonlinear dynamical system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.248,
    "end": 1390.05,
    "text": " it makes sense to think about the brain as a Bayesian device.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.871,
    "end": 1396.495,
    "text": "And this is from the 2018 interview with Fristin and Martin and myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.896,
    "end": 1406.622,
    "text": "And in this paper, we summarized and characterized the Bayesian brain hypothesis, predictive coding, and the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.483,
    "end": 1412.749,
    "text": " and asked, how are these different models similar or different from one another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1413.87,
    "end": 1418.395,
    "text": "In fact, he had suggested that these three frameworks are variations of the same basic mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.096,
    "end": 1427.385,
    "text": "So if you're wanting to learn more about the background of the Bayesian brain and how it differs in specific ways from predictive processing, free energy principle, active inference, et cetera,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.305,
    "end": 1436.19,
    "text": " then read his response here or read the interview because it can help with some people's understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.691,
    "end": 1439.172,
    "text": "Let's just go through it at an overview level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.933,
    "end": 1454.943,
    "text": "Predictive processing is specifically looking at how error is propagated through systems which can be hierarchical or must be hierarchical and therefore are amenable to a Bayesian hierarchical modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.443,
    "end": 1457.705,
    "text": "So in this sort of diagram on the right,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.485,
    "end": 1463.966,
    "text": " It shows how at the very bottom level you have muscular output, action, and sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.646,
    "end": 1474.008,
    "text": "And then what's happening in this cascade of hierarchically nested systems is that predictions are coming down and prediction errors are moving up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.208,
    "end": 1475.869,
    "text": "But it's not a spatial thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.909,
    "end": 1476.849,
    "text": "It could be in or out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.929,
    "end": 1478.809,
    "text": "It's just about how it's laid out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.589,
    "end": 1487.371,
    "text": "And predictive processing turns out to be a way to get somewhat effective Bayesian-like behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.915,
    "end": 1490.256,
    "text": " because it's even how we fit some of our algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.656,
    "end": 1494.718,
    "text": "We just start with the prior and then we inch it closer depending on the error signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.998,
    "end": 1499.48,
    "text": "So learning based upon the error signal is a really common algorithmic maneuver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.96,
    "end": 1507.003,
    "text": "And so predictive processing and the Bayesian brain are sort of like compatible theories because the Bayesian brain is just saying it's gonna be something Bayesian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.503,
    "end": 1508.364,
    "text": "Predictive processing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.224,
    "end": 1524.755,
    "text": " is a theory because it makes predictions that are falsifiable about what is being represented in the communications between levels and namely that you'd have prediction going one way and prediction error heading back the other way anything to say about that before we continue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.559,
    "end": 1527.4,
    "text": " No, that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1527.52,
    "end": 1535.564,
    "text": "The only thing I'd add is that what's going to be mentioned is how there's this temporal depth piece starts to make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.604,
    "end": 1539.806,
    "text": "You could have like a level of processing goes to another level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.966,
    "end": 1543.608,
    "text": "And that's something that the same basic principle is driving it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1543.868,
    "end": 1544.349,
    "text": "So, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.689,
    "end": 1544.909,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.569,
    "end": 1549.511,
    "text": "So here is a really informative piece from the first in 2018 interview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.425,
    "end": 1560.829,
    "text": " Friston wrote, the Bayesian brain hypothesis per se does not trouble itself to commit to a particular process theory other than requiring implicit beliefs to conform to Bayes' rule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.289,
    "end": 1570.534,
    "text": "So similar to how free energy principle doesn't have a specific process theory that's downstream, it's a more like a general overarching, does it conform or not to this principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.394,
    "end": 1579.798,
    "text": "The Bayesian brain hypothesis is a corollary of the free energy principle and is realized through processes like predictive coding or abductive inference under prior beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.834,
    "end": 1588.763,
    "text": " However, Bayesian brain is not the free energy principle because both Bayesian brain hypothesis and predictive coding are incomplete theories of how we infer states of affairs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.584,
    "end": 1601.017,
    "text": "And then here is so interesting where he wrote, it's this inactive, embodied, extended, embedded, and encultured aspect that is lacking from the Bayesian brain and predictive coding theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.818,
    "end": 1607.119,
    "text": " precisely because they do not consider entropy reduction through action as well as through inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.779,
    "end": 1626.923,
    "text": "So it's all well and good to have the inference engine that's driven in this thermodynamic way towards entropy reduction, but it takes on a whole other level and integrates with control theory and action in the niche when you go from saying, well, yes, the brain is a Bayesian statistical inference device for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.643,
    "end": 1630.184,
    "text": "And that's really one of the key pieces of active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.064,
    "end": 1633.327,
    "text": " which is why we went to it here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1633.347,
    "end": 1637.011,
    "text": "And this is the definition of the authors in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.132,
    "end": 1637.712,
    "text": "That's what they wrote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.073,
    "end": 1640.015,
    "text": "So Stephen, where would you say active inference fits in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.035,
    "end": 1640.816,
    "text": "What do you have to say about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.096,
    "end": 1641.757,
    "text": "Well, I like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.857,
    "end": 1643.119,
    "text": "This is a really helpful slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.139,
    "end": 1644.36,
    "text": "Well, there's a couple of things that come up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.481,
    "end": 1646.603,
    "text": "One thing is the fact that it talks about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.604,
    "end": 1666.476,
    "text": " abductive inference and it's talking about this idea you know predictive coding and you know Ryan Smith and Christopher they're talking about prospective sometimes ideas of you know we're predicting how things are going to happen well that's really interesting because most research in terms of like social science is mostly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.316,
    "end": 1692.564,
    "text": " you know retrospective or inductive or deductive um and abductive is um this abductive emergent thing is is actually very um hard to get at but actually is is showing that this predictive uh rather than retroactive knowing is what's driving everything um so i think that that in itself is quite useful to think about um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.916,
    "end": 1694.637,
    "text": " Yep, nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.278,
    "end": 1708.033,
    "text": "It's interesting that he mentioned it there and that active inference, how does it implement potentially some of these cool aspects that are lacking from the Bayesian brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.234,
    "end": 1711.938,
    "text": "So where does active inference build on Bayesian brain approaches?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.679,
    "end": 1714.08,
    "text": " Here's what active inference is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.6,
    "end": 1730.627,
    "text": "So the way that the authors, Ryan Smith and Christopher White wrote it in this paper on the first sentence of their primer is active inference, a corollary of the free energy principle is the first principles approach to modeling approximately Bayes optimal behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.487,
    "end": 1734.229,
    "text": "So you can look at their primer in this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.148,
    "end": 1743.211,
    "text": " which is really awesome, as well as their very extensive tutorial on active inference and model stream number 1.1 through 4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.852,
    "end": 1749.014,
    "text": "So we just really appreciate the clarity that Ryan and Christopher bring to this area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.96,
    "end": 1772.192,
    "text": " but basically what's happening is active inference is allowing us to formalize the process of the environment giving data through sense to the organism which in the generative modeling of that data which is like bayesian modeling but that's inference and then it connects it to external states again closing the loop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.083,
    "end": 1778.846,
    "text": " via action as well as internal dynamics or endogenous fluctuations on either side of the interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.687,
    "end": 1782.808,
    "text": "Only by defining the interface do we get this kind of a clean separation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.549,
    "end": 1792.774,
    "text": "So that's where Active Inference allows us to say, yes, it's Bayesian in terms of how it recognizes data and it acts in an ecosystem that also has other agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.574,
    "end": 1795.135,
    "text": "That's where Active Inference comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.155,
    "end": 1802.099,
    "text": "All right, so now to sort of switch gears to consciousness and visual consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.032,
    "end": 1806.633,
    "text": " So let's just start with sort of the obvious, what is consciousness question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1807.394,
    "end": 1809.454,
    "text": "And just, we're just talking about this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.594,
    "end": 1814.596,
    "text": "So we're not talking about like something that's, you know, some sort of theological question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.156,
    "end": 1817.257,
    "text": "Remember that it's access consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.417,
    "end": 1819.098,
    "text": "It's self-report paradigms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.018,
    "end": 1830.144,
    "text": " And you can read more about their perspective on that in the limitations and multiple other places where they really are clear about the pros and cons of using visual modality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.665,
    "end": 1832.206,
    "text": "So it's not olfactory consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.246,
    "end": 1833.066,
    "text": "It's not a sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.126,
    "end": 1834.167,
    "text": "It's not multimodal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.527,
    "end": 1839.75,
    "text": "They're doing a sense specific task and it's reported awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.131,
    "end": 1848.916,
    "text": "So what do you think about that, Stephen, or in your thinking or learning about consciousness, where would this sort of a narrow approach figure in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.61,
    "end": 1868.041,
    "text": " Yeah, well, I think that, you know, when they talk about the pros and cons, you know, the pros are that we are actually able to generate data through reports, and it gives us a way into this whole area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1868.281,
    "end": 1872.804,
    "text": "And by the sort of the detail of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.28,
    "end": 1881.264,
    "text": " how the design has been done, it negates some of the challenges and makes us get some workable insights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.485,
    "end": 1889.909,
    "text": "And one of the cons is that, or one of the downsides that they're facing is you can't genuinely report",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.124,
    "end": 1892.184,
    "text": " being conscious of nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.224,
    "end": 1897.166,
    "text": "You can't say, I'm no longer conscious of any of that thing, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.186,
    "end": 1898.006,
    "text": "And they acknowledge that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.326,
    "end": 1904.627,
    "text": "There's always something in your field of vision when you're being asked to self-report around if something's present or not present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.068,
    "end": 1910.069,
    "text": "So they've had to do some workarounds to get the results that are usable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.389,
    "end": 1914.01,
    "text": "But that was something they can speak to better than me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.87,
    "end": 1941.196,
    "text": " cool i agree it'll be like um what are the author's big motivations what is their long-term vision for consciousness research why have they chosen vision first what would be the next most tractable sense so definitely there's a lot of uh questions to have for them and also this is a great note from them brief note on phenomenology and the phenomenal consciousness access consciousness distinction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.676,
    "end": 1964.677,
    "text": " so again i just we kind of hit this point because it's one of the it's one of the keywords of the paper is consciousness and a lot of times when uh we see scientific research on consciousness so-called it's just it's always critical to be clear about what's being discussed and the authors thankfully here really are clear which actually leads some people to be almost disappointed it's like oh but what about the big phenomenology it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.578,
    "end": 1988.402,
    "text": " maybe we'll get there or maybe we won't or you could have any story you want on that but it's almost like if the sales pitch is too much hype then people it's what they expect so then when there's a more narrow focused paper they act like it introduces uh all these critical challenges that are just being glided over by a paper that doesn't define consciousness or doesn't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.962,
    "end": 1995.445,
    "text": " go so specifically and carefully into the distinctions between access and phenomenal consciousness, because not everyone will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.546,
    "end": 1997.206,
    "text": "And yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.907,
    "end": 2000.047,
    "text": "Yeah, I like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.028,
    "end": 2015.534,
    "text": "The way they talk about this, they acknowledge this question about this threshold and start to sort of decide on where they're going to fit in with that, I think is really valuable, because this idea of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.168,
    "end": 2041.251,
    "text": " the question that's sitting in the background with phenomenological uh consciousness there when they talk about this moment-to-moment sensory flux and in a way it ties to the um uh chris field's work that we were doing with quantum contextuality potentially um is you know what's this kind of flux idea that's in the background and when does it get",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.614,
    "end": 2044.896,
    "text": " over to the contextuality of awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2045.757,
    "end": 2049.121,
    "text": "So just to show it linking to some of the other papers that have come up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.322,
    "end": 2053.587,
    "text": "And then for this, you know, it shows you the importance of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.336,
    "end": 2069.841,
    "text": " experimental design and the modeling simulation design and how the way the design ends up evolving itself kind of gives us some insights of how you might structure our understanding of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.041,
    "end": 2075.763,
    "text": "The sort of questions they had to ask and answer to build the model in itself is quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.783,
    "end": 2075.863,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.588,
    "end": 2101.579,
    "text": " yep so they're um really clear about that and we can talk more about it let's go to the neuro side so we kind of talked a little bit about the philosophical question of consciousness and the systems dynamics and control theory question of active inference but then there's this neuroscience side and area that they're in and that's what's also moving towards applications in the clinic for example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.559,
    "end": 2116.487,
    "text": " And what we can do here is present some of the early and latter citations related to the global neuronal workspace, global workspace theory, GWT, or there's a bunch of related ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.728,
    "end": 2125.493,
    "text": "Sorry if the acronyms are not always consistent, but what the global neuronal workspace, I guess, is probably what we should use and predictive GNW.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.716,
    "end": 2132.1,
    "text": " are they're integrative models that are on one hand for neuronal function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.741,
    "end": 2143.669,
    "text": "So through philosophically neutral frameworks like cascade theory or network theory, you can describe how you get patterns like ignition or cascades through networks or propagation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.52,
    "end": 2150.445,
    "text": " then it can be applied and say, ah, what if that ignition is so-called consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.225,
    "end": 2153.127,
    "text": "Access consciousness, there's a strong argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.147,
    "end": 2157.25,
    "text": "You can say, look, if the data doesn't get to the other end of the pipeline, it's not going to get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.65,
    "end": 2161.373,
    "text": "So if it does get there, it had to have propagated through a critical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.974,
    "end": 2163.855,
    "text": "So that is the easier way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2164.81,
    "end": 2189.569,
    "text": " bar and then the harder bars is that information propagation equivalent to phenomenal consciousness experience qualia and the answer as we know from subliminal stimuli is just no it's not but that's what people often want to get at addressing which is how does the brain quote make consciousness or what brain states are associated with quote consciousness meaning awareness in our first person experience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.512,
    "end": 2196.356,
    "text": " which even under the most generous vision is just a part of our total system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.376,
    "end": 2197.577,
    "text": "What do you think about that, Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.998,
    "end": 2201.42,
    "text": "Yeah, I think that's a good, you make a good point there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.58,
    "end": 2207.785,
    "text": "And this move from the sort of more broader workspace to this neuronal workspace then brings in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.744,
    "end": 2230.176,
    "text": " the actual understanding which again ryan and christopher have of of neuroscience and the way that the the firing happens so that gives an insight and also the thing that i think is interesting is that they're talking about consciousness as being this um belief um updating or prediction that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.24,
    "end": 2253.069,
    "text": " barely on off like it's like things come in they come out of consciousness whereas in other cases that might be more of a gradual flux of awareness there's something going on here which because that flips in and out of consciousness that gives you a way to use belief updating schemes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.849,
    "end": 2254.489,
    "text": " to model it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.209,
    "end": 2258.51,
    "text": "And I'd be interested to hear how they see that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2258.69,
    "end": 2258.891,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.191,
    "end": 2259.451,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.491,
    "end": 2260.031,
    "text": "Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.151,
    "end": 2264.912,
    "text": "So here's kind of a classic neuroscience diagram from this 2005 early paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.492,
    "end": 2267.473,
    "text": "Left side is the single neuron scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.513,
    "end": 2269.414,
    "text": "You have receptors in a membrane and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.814,
    "end": 2297.742,
    "text": " different currents that are happening at a very very micro level and meso level with circuits and then more of a macro level with the activation that's propagating across regions of the brain and then another way that was helpful was looking at this i think it could have even been 1998 paper the global neuronal workspace model of conscious access from neuronal architecture to clinical applications so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.843,
    "end": 2306.208,
    "text": " lest we think that it's a new idea to apply neuroscience in clinical settings or think it's too soon or too late.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.408,
    "end": 2311.391,
    "text": "It's just always going to be sort of what people are recalibrating to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.152,
    "end": 2322.178,
    "text": "And in this figure, it's connecting sort of the multifaceted attributes of the self and consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.539,
    "end": 2325.541,
    "text": "So again, used maybe vaguely, maybe detailedly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.738,
    "end": 2336.681,
    "text": " like long-term memory of the past, evaluating systems of value, attentional focus, regimes of attention, as we would say, perceptual systems in the moment, and then motor systems in action in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.181,
    "end": 2348.785,
    "text": "So it's like if all those things are being connected and what connects the sound in the ear to the memory, to the action pattern, like if someone says march, what connects that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.945,
    "end": 2355.207,
    "text": "And the answer is something like a system at criticality that propagates from a sensory modality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.227,
    "end": 2372.143,
    "text": " and if it were quieter it wouldn't have been heard it wouldn't have propagated if it's the wrong language it doesn't propagate so it kind of only catches when it's all aligned with the rhythmic oscillations and the prior state of the network which is equivalent to constituting a bayesian belief network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.064,
    "end": 2394.773,
    "text": " so that's sort of the global neuronal workspace model is it's going to be integrating all these features that are kind of disparate cybernetic features memory past present future self other thinking through other minds all these features of neuroscience that everyone's trying to understand and model and put that in a network science frame so that maybe it could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.274,
    "end": 2407.922,
    "text": " brought into the clinical applications, just like their title is getting at even 20 years ago, or other avenues like how do we discuss neuroscience with the public?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.542,
    "end": 2410.604,
    "text": "What kind of metaphors will they receive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.704,
    "end": 2415.727,
    "text": "Is it like a network that activates or an avalanche that falls or a program that halts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.648,
    "end": 2418.89,
    "text": "Different ways that people think about systems neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.291,
    "end": 2422.112,
    "text": "Any thoughts on that before we can continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.475,
    "end": 2444.759,
    "text": " Yeah, I think just generally speaking, this idea of this integration is really useful when people are thinking more broadly about, you know, often people are thinking about us as a system, but you people fall into this trap of I'm a kinesthetic thinker or a visual thinker, you know, some of these kind of folk psychology systems things and NLP and that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.819,
    "end": 2448.02,
    "text": "And this approach gives a plausible way to understand what it's,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.333,
    "end": 2451.354,
    "text": " It's all one integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.594,
    "end": 2465.026,
    "text": "And it's not that you have someone going off and their visual system is in one part of the brain and this piece, you know, and in a way this is permeating how culture kind of thinks the brain works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.887,
    "end": 2470.811,
    "text": "And then bringing that in with the free energy is a way that it could actually integrate and it could be part of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.231,
    "end": 2475.615,
    "text": "And now with this prediction dynamic, it is quite...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.017,
    "end": 2486.304,
    "text": " It is quite possible that this could start to be more understood more generally as a model that is how we sort of work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.325,
    "end": 2501.659,
    "text": "You know, as to the different styles of learning or sensory modalities, it could be that some cognitive diversity is such that the same symbols on the page will ignite something that the audio doesn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.762,
    "end": 2510.464,
    "text": " depending on where they can have their regime of attention, which is a culturally inherited and co-created artifact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.484,
    "end": 2525.688,
    "text": "So it allows, instead of just saying, well, it's left brain, right brain, or it's this kind of person, that kind of person, it's about the dynamics of the system and, oh, would it be possible to do some sort of exercise to sensitize you or to allow you to perceive some dimension that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.368,
    "end": 2533.321,
    "text": " your brain hadn't seen, just like there's a good music or a good wine or something, but it's something that is encultured and trained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.163,
    "end": 2536.768,
    "text": "So let's get a little bit specific into the neuroscience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.639,
    "end": 2538.919,
    "text": " before we go to the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.679,
    "end": 2543.28,
    "text": "And that's just to talk about this ERP or event related potential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.181,
    "end": 2551.062,
    "text": "And the ERP is a pattern that's kind of like a collective behavior of an electromagnetic field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.882,
    "end": 2556.804,
    "text": "It's based upon EEG measurements, which are electroencephalograms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.064,
    "end": 2561.805,
    "text": "And those are just like electrical measurements around the scalp usually, but it can be other places too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.985,
    "end": 2569.348,
    "text": " And each of the little leads, each of the measuring points on the EEG is a reference channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.029,
    "end": 2590.54,
    "text": "And then what happens is you could be taking these time series of the electrical potential at these different reference points and then using techniques like SPM and other approaches to reconstruct in a generative capacity the electromagnetic field that gave rise to that data distribution of event leads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.6,
    "end": 2592.72,
    "text": " references, channels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.501,
    "end": 2598.082,
    "text": "Then you can align time series to events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.442,
    "end": 2610.666,
    "text": "Like if you clap your hands 10 times separated by 30 seconds, you could take that big time series and then align all the claps and then ask, is there like a coordinated probabilistic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.726,
    "end": 2614.467,
    "text": "Not every channel does it, but when you align it, you can see that, yeah, there is a dip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.56,
    "end": 2625.483,
    "text": " And so that's the ERP is when there's this spatial temporal pattern that might play out over tens or hundreds of milliseconds as shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.283,
    "end": 2633.805,
    "text": "And in different brain regions, it's known to have a canonical form and even diagnostic value in certain situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.029,
    "end": 2648.542,
    "text": " there's a lot more to learn about here friston's work buzaki many others but it's a big area but that's kind of what it is it's like a pattern of space and time in an electromagnetic field in response to an event any thoughts on that because it kind of comes into play for the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.085,
    "end": 2678.459,
    "text": " yeah nice and and i noticed they i am this event related potential so yeah again it's giving you a way to to think about what happens when so they've got a p1 p2 and and p3 they talk about p3 more i noticed in the paper um as this kind of main sort of lag but it gives it gives a sense of this um temporal dynamics that are played there's an idea that there's something happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.099,
    "end": 2688.189,
    "text": " which is more cumulative, maybe takes more time to register.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.192,
    "end": 2696.959,
    "text": "But this model gives a plausible way where that could hint that some of the faster",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.439,
    "end": 2718.675,
    "text": " processes are actually sort of more closer to this flux and some of the others are closer to this awareness yep it's a lot like the pqrst system on the heart ekg and so you can say oh there's long qt interval it's because there's sort of a normal shape of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.395,
    "end": 2743.626,
    "text": " with variation and then if something is outside of a certain bound you can say this sort of interval is too long and then you can have a model of heart cells and if you had a model of heart cells with just the channels and you were getting the range of expressivity absorbed observed in the biological system it's pretty meaningful so let's look at figure one the first half of figure one i guess figure one a we could call it but we'll have figure one b two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.912,
    "end": 2748.857,
    "text": " This is kind of the classic active inference graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.518,
    "end": 2754.305,
    "text": "This is one of our favorite figures and it's good that they put it in all kinds of papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.347,
    "end": 2766.83,
    "text": " What it describes is the relationship between, starting at the bottom, observed measurements in the world that are mapped through matrix A to hidden states of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.19,
    "end": 2768.93,
    "text": "Like, is it actually light in the room?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.63,
    "end": 2770.29,
    "text": "Is the hidden state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.39,
    "end": 2771.771,
    "text": "And then you get photons on your eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.291,
    "end": 2775.612,
    "text": "And then there's a pretty clear mapping there, but A could be probabilistic as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.972,
    "end": 2781.393,
    "text": "So that's about states that are hidden to observations through time that are observed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.403,
    "end": 2793.547,
    "text": " Then this is actually a second level model where at each hidden state, it's evaluating what is gonna be the state outcome mapping under a future time series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.567,
    "end": 2805.472,
    "text": "So this is a little bit, not the basic, basic version, but hopefully you'll have listened to a few other, like their model stream where they walk through from really the fundamental, which is just the state outcome mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.132,
    "end": 2808.533,
    "text": "So go to the model stream if you haven't seen this before at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.214,
    "end": 2809.374,
    "text": "Then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.314,
    "end": 2839.623,
    "text": " um d is the prior that plays into these second level state estimates and just like the b matrix at the lower level defines the transition between hidden states the b2 as opposed to b1 second level b matrix describes the transition frequency and patterns of the states at the higher level so this is kind of like that nice nesting you could have the higher level state changing and then lower level states changing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.635,
    "end": 2845.736,
    "text": " What does influence the higher level state transition matrix?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.336,
    "end": 2847.257,
    "text": "Pi, policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.837,
    "end": 2864.101,
    "text": "So that's the innovation or one of them of active inference, which is that instead of just estimating how states change, hidden states change through time, we estimate a conditional related to how our policies influence states changing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.601,
    "end": 2866.322,
    "text": "That's the pi coming into B2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.862,
    "end": 2896.745,
    "text": " our policies are selected from our affordances and they're sort of differentially weighted in terms of their instantaneous uh attractability in terms of this g functional which is a expected free free energy minimization of policy down here g of pi not just some abstract g floating out there in space but of a policy and it takes in arguments like c the preferences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.257,
    "end": 2899.298,
    "text": " and C is the preference vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.698,
    "end": 2899.839,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.919,
    "end": 2901.68,
    "text": "So I think that's all the letters on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.261,
    "end": 2902.481,
    "text": "Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.641,
    "end": 2913.252,
    "text": "Any thoughts on this, Stephen, or we can go to this figure one B. No, I think, well, I think this is a one thing I've noticed is also they've got at the top, the variational free energy, which is kind of the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.973,
    "end": 2916.895,
    "text": " the broad kind of dynamic that flows, as you mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2916.975,
    "end": 2933.903,
    "text": "And like you just mentioned, it's the, when you start to got the policies involved, you've got this expected free energy, which is more tied to how that might relate to particular actions for the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.664,
    "end": 2941.988,
    "text": "So I think that makes, and also I suppose the other point that's there, you mentioned there, you know, the B1 matrices,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.186,
    "end": 2946.289,
    "text": " it could almost be assumed that that's like the flux.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.889,
    "end": 2951.853,
    "text": "It keeps churning over and it will work out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.053,
    "end": 2954.475,
    "text": "It will come and start to populate its values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.076,
    "end": 2959.239,
    "text": "Whereas these higher levels, you have your priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.419,
    "end": 2965.864,
    "text": "It might not be that important where my retina is in its state at this moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.145,
    "end": 2968.887,
    "text": "It will just populate and start to come to some equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.927,
    "end": 2972.249,
    "text": "Whereas what I think I'm seeing, my prior,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.283,
    "end": 2999.377,
    "text": " might be at these higher levels a more significant parameter and that's reflected in that model cool very nicely said about how our priors or system priors even to remove the whole awareness consciousness thing system priors are semantic it's like i expect i'm a veterinary scanner or i'm a check scanner at the atm i expect a check",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.177,
    "end": 3005.101,
    "text": " It's like it doesn't expect the pixel to be in this spot and the green and this way to be here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.702,
    "end": 3007.163,
    "text": "It expects something semantic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.684,
    "end": 3024.578,
    "text": "And part of the challenge with talking about observations and making meaning from data and sense-making from large data and scaling sense-making is that the bottom level data is almost by definition meaningless, especially with respect to the larger level semantic question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.239,
    "end": 3029.964,
    "text": " So yeah, there's parts of the check that are sub-meaningful, but the pixel can't be too meaningful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.625,
    "end": 3033.368,
    "text": "Otherwise, you need to do a whole other model to really break that down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.989,
    "end": 3039.435,
    "text": "So it is interesting that the D prior enters at the second level state, but there's no D1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.836,
    "end": 3042.919,
    "text": "So maybe it's not shown, or maybe we can ask where that is coming from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.38,
    "end": 3043.76,
    "text": "Let's look at...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.027,
    "end": 3068.506,
    "text": " it's not necessarily so important for the modeling and so that that in a way this this is quite useful for showing i mean in some ways they say that's where autism can have challenges because that there's not that ability to know where to put your priors and and to resolve things so um just one other point in here is they don't in the expected free energy for vision",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3069.036,
    "end": 3077.201,
    "text": " because they're looking at sort of salience of vision or the idea of risk, which is sometimes shown in that expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.241,
    "end": 3086.266,
    "text": "It's not in there, because I suppose for this model, that's not really relevant for the vision system in the type of way that they're exploring consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.306,
    "end": 3094.611,
    "text": "So it just shows, again, that the way that the equations or the terms can be constructed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.851,
    "end": 3105.419,
    "text": " is related to the nature of what's most relevant to the type of dynamic that's being looked at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.659,
    "end": 3107.28,
    "text": "And I think that's quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3107.56,
    "end": 3107.781,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.901,
    "end": 3112.204,
    "text": "It's not the free energy of the system with a no function in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.765,
    "end": 3120.071,
    "text": "It's a calculated free energy that is related to policy as implemented by some actor in the space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.811,
    "end": 3146.305,
    "text": " so it's not just like we're making one general free energy principle model of some system we're doing task specific specific behavior and i'm sure that ryan and christopher will have a lot to add on that so here's the second half of figure 1b or figure one and it takes some of those letters that we saw in the first part of figure one a b c d and then also adding in e i think down there which is the kind of affordances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.245,
    "end": 3155.52,
    "text": " uh prior which is not here but it connects to pi as well so there's a few other aspects and then it maps it onto",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.145,
    "end": 3170.649,
    "text": " parts of the brain, human style brain, that are tractable or plausible, or where the architecture of how those brain regions are connected or functionally linked through dynamic causal modeling, SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.249,
    "end": 3178.051,
    "text": "So if there's a functional or an anatomical connection between these brain regions, with that directionality, it seemed to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.409,
    "end": 3202.747,
    "text": " some might think of it as confirmatory or supportive evidence for that biological systems do free energy principle or active inference another way of thinking about it is it's the computational realization of a process that surprisingly or unsurprisingly can be modeled with active inference type models there's a few different ways you can think about it but they're kind of laying out this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.076,
    "end": 3206.6,
    "text": " probabilistic graphical Bayesian network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.301,
    "end": 3211.068,
    "text": "And they're kind of laying that out onto the brain's neuroarchitecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.709,
    "end": 3214.052,
    "text": "And there's a lot more papers that go into detail here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.056,
    "end": 3217.278,
    "text": "Any thoughts or ready to continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.619,
    "end": 3222.982,
    "text": " Yeah, I think an interesting question is like, where does the body come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.522,
    "end": 3235.692,
    "text": "Like this is one level of the nesting, but how far is this model towards just basic group communication models or some other type of modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.792,
    "end": 3239.134,
    "text": "Anyways, let's return to the sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.177,
    "end": 3241.418,
    "text": " specifics of their experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.598,
    "end": 3257.705,
    "text": "They included figure one, I think, to be just very clear about active inference, which is great because it helps the paper be accessible to those who are outside the field and also everybody in active inference can always go back to the basics and the terms because it just always helps us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.905,
    "end": 3264.528,
    "text": "Here's what they do in the results, the first part, and then we're gonna go look at figure two and the task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.288,
    "end": 3266.669,
    "text": "So results, section three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.648,
    "end": 3270.27,
    "text": " As a proof of principle, we first simulated 200 trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.71,
    "end": 3277.794,
    "text": "So they're gonna be having a behavioral paradigm where they can have a fully in silico, fully simulated experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.274,
    "end": 3281.256,
    "text": "So it's gonna be like an experiment that a person could do, but they're gonna totally simulate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.256,
    "end": 3286.419,
    "text": "And some of them are gonna have square presence and some obviously won't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.299,
    "end": 3304.204,
    "text": " and then there's going to be model parameters that relate to attention and model parameters that relate to stimulus strength so off the bat you might imagine okay well if the stimulus is stronger like the sound is louder to some point it's going to be easier to say yep i heard that sound",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.904,
    "end": 3330.572,
    "text": " so if it's a bold line versus if it's a tiny faint you know gray on gray situation and then there's also the attention so if it said oh pay no attention to the middle look away and then something flashed in the middle you're less likely to see it than if you were to be looking at the middle so that's the kind of an experimental setup that they're going to be simulating completely in silicon here is what they're going to show in figure two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.833,
    "end": 3336.736,
    "text": " there's this sort of visual pattern at time point one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.037,
    "end": 3349.468,
    "text": "And this is what also allows them to use discrete time models, like as currently shown the active inference model, where it's like T1 is here, T2 is here and T3 is here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.129,
    "end": 3359.436,
    "text": " So they can actually get a lot of power out of this sort of like checkpoint type, almost Kairos driven analysis, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.337,
    "end": 3368.424,
    "text": "And then they show an ambiguous stimulus where it replaces these diagonal lines partially with a square.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.125,
    "end": 3370.866,
    "text": "And then it flips back to the bars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.767,
    "end": 3397.437,
    "text": " the agent is then required to either uh say yes I saw a square or no I didn't see a square so that's the sense and here's the action so if anyone has made it this far and was still like wait but they didn't explain you know consciousness of this system or of theology it's it's not this paper this is only about this task paradigm any thoughts on that or continue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.403,
    "end": 3399.543,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.764,
    "end": 3399.984,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.985,
    "end": 3413.241,
    "text": "So this was just useful in terms of from their thinking, in their discussion, for those who want to read a little more about why the timescales are the way that they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3414.304,
    "end": 3423.988,
    "text": " Okay, figure three is a Bayesian network description of the generative model with arrows showing dependencies between hidden state factors and outcome modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3424.448,
    "end": 3427.53,
    "text": "Okay, so this is kind of like at first I was like, wait, what is this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.57,
    "end": 3433.853,
    "text": "It looks like an app or a game or something like a network model, but it is actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.733,
    "end": 3438.955,
    "text": "So at the level one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.544,
    "end": 3443.066,
    "text": " Let's look at these are the hidden state factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.286,
    "end": 3445.748,
    "text": "These are the report would be I'm waiting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.808,
    "end": 3449.191,
    "text": "I haven't reported yet, which is actually a state seen or unseen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.031,
    "end": 3454.975,
    "text": "So this is sort of one of the hidden state S factors that we're going to fit with data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3455.876,
    "end": 3462.541,
    "text": "Then there is the trial phase, which is the time steps of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.562,
    "end": 3468.385,
    "text": "And then there's going to be the sort of visually differentiating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.622,
    "end": 3491.649,
    "text": " features of the model so it's sort of like you know round one inning one first out it's kind of like identifying where you are in the model as a state in the model which is something that was really important in this framing of the model so check out the model stream because it matters if you're in trial two row three or trial four row two or something like that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.609,
    "end": 3502.18,
    "text": " and then at the very bottom level is the square or the lines here there's also this red or black thing so i'm not going into that but it's whether there's the square or the lines being seen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.154,
    "end": 3508.697,
    "text": " And then words, silent or I see a square didn't see anything, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3509.437,
    "end": 3512.679,
    "text": "So it's sort of like the generative models if they saw it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.039,
    "end": 3522.264,
    "text": "So we need to have some integrated way to combine the trial phases and what is actually being displayed, which we control in the experimental context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.095,
    "end": 3541.315,
    "text": " with their hidden perception as to for example the sequence of two different things so if it was first the square or the diagonal and then red or black you could have four different combinations and if it is held across trials you had to have like been aware of it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.222,
    "end": 3547.585,
    "text": " So the thinking would go like, I'm gonna read you a color and then a name, and then you're gonna tell me both in a row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.326,
    "end": 3560.193,
    "text": "And so that's a report that they're going to be able to say, and then that's the attentional mask because that allows them to say, not report on the color, but report on just the square being there or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.913,
    "end": 3565.256,
    "text": "So it's kind of like everything in this experiment is like locked down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.856,
    "end": 3569.759,
    "text": "Not that everything, the person's shirt color and how they felt about it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.791,
    "end": 3578.644,
    "text": " not that that is all explained in this model, but it's sort of modeling the input and the output and then leaving the rest actually for context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3580.507,
    "end": 3582.45,
    "text": "So we can hear more about that from the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.55,
    "end": 3583.492,
    "text": "Anything on figure three?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.826,
    "end": 3589.349,
    "text": " Yeah, no, I think they can speak to that more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.469,
    "end": 3601.722,
    "text": "I think one thing that was interesting is they use these different words rather than just like red or just basically saying red when you see red or black when you see black.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.643,
    "end": 3609.371,
    "text": " They had a rationale there to separate it out so that it helped them have a bigger time window.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.391,
    "end": 3613.135,
    "text": "But I think they could speak to that better than I can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.455,
    "end": 3613.595,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.076,
    "end": 3614.296,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.356,
    "end": 3617.299,
    "text": "The level two outcomes are level one hidden state factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3618.2,
    "end": 3640.8,
    "text": " so the higher level is getting um connected to the lower level in this way and then also if you really follow some of these lines like wait only maps to silent and that only maps to the observable silent scene maps to different things and unseen they both are i see and you know could be uh that's it i see that's where the divergence point is they're both about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.701,
    "end": 3659.335,
    "text": " a perspective and perception and then a square that's only for this thin dash for seen or i didn't see anything from the unseen condition so it's kind of showing how even the lexical tokens are mapped from probabilistic estimates",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.621,
    "end": 3662.623,
    "text": " of higher order models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.123,
    "end": 3667.267,
    "text": "And that also relates to this quantization and this quantum nature of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.287,
    "end": 3670.61,
    "text": "And it's like, you're forcing them to say, I saw it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.27,
    "end": 3672.051,
    "text": "It's not a slider.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.171,
    "end": 3673.252,
    "text": "How sure were you saw it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.392,
    "end": 3675.754,
    "text": "You could design that experiment, make that model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.495,
    "end": 3683.661,
    "text": "But in this paper, there's a lexical interpretation of their actions because they're only given the option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.181,
    "end": 3685.182,
    "text": "Yes, I did see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.482,
    "end": 3686.563,
    "text": "No, I did not see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.364,
    "end": 3709.626,
    "text": " so by constraining the experiment you can uh do things again leave it up to someone to debate whether that is cutting too much away all right so four is a split in half and here's where they sort of are just proof testing their simulation that's the foundational simulation and this is just to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.956,
    "end": 3722.07,
    "text": " check some of the basis of their model and what we can see on this left one is that when the square is shown so here's the four possible hidden states it's like four horse racing lanes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.308,
    "end": 3724.949,
    "text": " And we can see that there's this gray.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3726.71,
    "end": 3730.392,
    "text": "The red one is never even on the table because they haven't even brought that level into play yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.033,
    "end": 3739.397,
    "text": "But there's this gray competition, 50-50, I'm not sure, that's just reflecting the prior of whether it's going to be the dashes or the squares.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.417,
    "end": 3741.118,
    "text": "Because did you see it or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.218,
    "end": 3742.639,
    "text": "And not is going to be the dash.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3743.4,
    "end": 3745.481,
    "text": "And then the stimulus occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.321,
    "end": 3750.264,
    "text": "And then there's rapidly a convergence towards, yep, I saw it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.278,
    "end": 3773.699,
    "text": " that convergence is associated with a transient period of elevated firing rates of the first level of the model so that's where we're going to get some of the cross experimental modality work because this isn't just a bayesian phenomenological analysis of probability it's actually linked to a mechanistic process model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3774.645,
    "end": 3783.588,
    "text": " So if you found a brain region that were firing that way and removing it did the same thing that removing this did, all of a sudden you'd start to be seeing a lot of model reification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.029,
    "end": 3789.811,
    "text": "And then they also tie in the probabilistic component and firing rates, the first level firing rates in the self-report.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.531,
    "end": 3794.473,
    "text": "And then conversely on the square absent condition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.58,
    "end": 3796.18,
    "text": " It's the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.34,
    "end": 3803.704,
    "text": "It's gray, and then there's no transient period of firing, and then it just converges towards not seeing anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.304,
    "end": 3808.686,
    "text": "So it was like it was waiting, it was waiting, and then it converged upon not seeing anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.806,
    "end": 3810.987,
    "text": "So that's figure four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.127,
    "end": 3815.709,
    "text": "That was just sort of like, because they're like, oh yeah, after three, four, five, like I'm waiting, I'm waiting, I'm waiting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.509,
    "end": 3818.01,
    "text": "No, just didn't happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.351,
    "end": 3820.211,
    "text": "So that was one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.431,
    "end": 3824.493,
    "text": "Now let's look at another little bit more nuanced way to look at that in five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.598,
    "end": 3828.363,
    "text": " So here there's two axes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.423,
    "end": 3831.468,
    "text": "It's kind of like a Punnett square or Eisenhower matrix, a two by two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.389,
    "end": 3834.533,
    "text": "And it's called a four-way taxonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3834.633,
    "end": 3836.436,
    "text": "So just like we kind of hinted at earlier,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.563,
    "end": 3862.294,
    "text": " you can tune model parameters to have low or high endogenous attention and then you can tune model parameters so that the stimulus is like shriek is weak versus strong so that would be like thick versus thin line or it could be rapidly flashed versus not so you can imagine if it's a weak signal and the attention is absent very few are going to see it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.795,
    "end": 3869.277,
    "text": " if it is a strong signal and attention is being paid, you'd expect a higher amount to see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.958,
    "end": 3880.022,
    "text": "So empirically what you do to make the attention increased or what you do to increase the signal strength, that's a detailed question, but their model is doing quite a few things here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.282,
    "end": 3887.986,
    "text": "And so it's a high energy, high density representation because they're showing that basically they do recapitulate that pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3888.956,
    "end": 3900.702,
    "text": " with high percent seen self-report and high correctness rates with an archetypal firing rate at the first and the second level that are reminiscent of ERPs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.362,
    "end": 3906.244,
    "text": "And the ERP P3 looking like arises at the second level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.744,
    "end": 3910.706,
    "text": "So it's not like the data have a structure that give rise to the P3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.267,
    "end": 3913.768,
    "text": "It's like the P3 is an emergent behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.748,
    "end": 3928.593,
    "text": " of something that as you're saying is more like forming and unforming at the lower level and the semantics and then the response that we actually observe the system do is this higher level and then it's absent in the other three cases",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3929.864,
    "end": 3932.085,
    "text": " And in those cases, the accuracy here is almost 100%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.046,
    "end": 3933.486,
    "text": "In this, it's 58, 47, 61.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.506,
    "end": 3936.147,
    "text": "So it's about 50, 50.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3937.588,
    "end": 3940.789,
    "text": "And remember, they have to make a forced choice and they're not always sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.909,
    "end": 3942.23,
    "text": "Their confidence isn't 100%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.191,
    "end": 3955.557,
    "text": "So that just shows that like you get confidence and experience and firing rate and second, but not first level ERP dynamics in the high attention, high signal strength condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.377,
    "end": 3982.875,
    "text": " very clean finding and then you can disentangle attention and signal strength and then just show that like whether you pull one away or the other you destroy the erp you root you reduce the number of people who the simulation runs that said they saw it and it reduces the accuracy to a large extent so that's like a big finding of the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.164,
    "end": 3987.185,
    "text": " Any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.466,
    "end": 3989.026,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.046,
    "end": 3991.148,
    "text": "That's really good to go through that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3991.468,
    "end": 3998.274,
    "text": "I think because there's a lot in this diagram, it can be a little bit to first see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.314,
    "end": 4001.056,
    "text": "And I think just looking at that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.551,
    "end": 4015.315,
    "text": " you know, first level and noticing how all four quadrants have got this Perry stimulus time, this kind of first level firing is present, like you just mentioned in the, in the black graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4015.355,
    "end": 4020.436,
    "text": "And then, you know, only on that awesome, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.456,
    "end": 4022.717,
    "text": "Do you have this very strong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.777,
    "end": 4030.619,
    "text": "So this, this does indicate that when you have sufficient signal in relation to attention,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4031.96,
    "end": 4037.842,
    "text": " bang, you know, it has a certain on-off-ness to it, which is kind of what they're trying to show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4038.222,
    "end": 4046.525,
    "text": "Very nice to connect it to the ignition model of the neuronal workspace, which is like, yeah, if it's loud but you weren't paying attention sufficiently,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.512,
    "end": 4052.673,
    "text": " then you're not going to, or the other quadrant, it's like, it doesn't ignite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.133,
    "end": 4062.136,
    "text": "But when you get both together, when you get somebody looking at the screen and it's the right stimulus, it's not just a little bit different than them not looking at the screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.856,
    "end": 4063.896,
    "text": "It's so different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.056,
    "end": 4065.436,
    "text": "It's qualitatively different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4065.456,
    "end": 4066.557,
    "text": "It's a categorical difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.397,
    "end": 4073.859,
    "text": "And so that is something that's reflected categorically in this model, flat versus not flat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.259,
    "end": 4075.679,
    "text": "Now it's a simple model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.634,
    "end": 4084.604,
    "text": " but it makes me, but yeah, it's a simple model, but this is like a lot for a simple model to show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.927,
    "end": 4088.409,
    "text": "I was just going to make a little anecdote there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.449,
    "end": 4092.374,
    "text": "It's something slight as a side, but when my daughter was, I think she was like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.371,
    "end": 4116.545,
    "text": " nine months old we had the fire alarm go off and it was literally like ear-breakingly loud she was sleeping through it all um so you know that i know it's not but the same kind of idea is there this idea that because obviously i know it's sleep but it's still an attentional state uh it wasn't and you'd expect someone to always wake up because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.105,
    "end": 4117.885,
    "text": " of the loudness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4118.385,
    "end": 4120.366,
    "text": "It is an attentional state, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.766,
    "end": 4127.448,
    "text": "And it's encultured and it's developed and somebody could have phases or, you know, all these things can come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.528,
    "end": 4130.469,
    "text": "It is like, is the noise hitting the eardrum?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4130.689,
    "end": 4130.929,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.569,
    "end": 4132.73,
    "text": "Are the neurons firing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4133.31,
    "end": 4135.631,
    "text": "That's where predictive processing has a lot to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.651,
    "end": 4141.532,
    "text": "And that's why it was an important theory because the centralized processing theory would be like, it hits the baby's eardrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.073,
    "end": 4144.593,
    "text": "It goes full force, loud sound incoming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.713,
    "end": 4146.574,
    "text": "And then there's the nap time region",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.054,
    "end": 4148.536,
    "text": " And that just says, nope, I'm asleep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.756,
    "end": 4150.558,
    "text": "We just don't listen to sound when I'm asleep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.639,
    "end": 4157.806,
    "text": "The predictive processing model is that there's a generative capacity, like we're sleeping almost semantically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.427,
    "end": 4163.493,
    "text": "And that propagates in a way that dampens the ignition of loud sounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.537,
    "end": 4174.962,
    "text": " So the net effect is loud sounds don't wake the sleeping baby, but it's extremely different if there's like this central commander that's receiving the raw sensory input and processing, it's not what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.562,
    "end": 4184.186,
    "text": "And it is much more like this generative semantic capacity of systems to have meaningful modes that are distractible or not distractible to different stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.367,
    "end": 4187.548,
    "text": "So pretty nice, good baby story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.708,
    "end": 4192.61,
    "text": "So here's another phenomena that they're gonna recapitulate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.539,
    "end": 4195.2,
    "text": " So let's expand it in six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.361,
    "end": 4199.243,
    "text": "So this is the inattentional blindness task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4200.764,
    "end": 4212.033,
    "text": "And it's just another task where basically they're going to differentiate a few different experimental treatments that usually would be used to pull out inattentional blindness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4212.713,
    "end": 4217.737,
    "text": "But sort of just the summary of this is in phase three,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4219.082,
    "end": 4242.08,
    "text": " which was the self-report, you can read the caption for what they are, but similarly, depending on which pieces and phases you add in, you get the existence of the simulated ERP and a high fraction of having seen it if there was attention, but then in the case where it wasn't seen, then it just is like a totally flat piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.191,
    "end": 4254.077,
    "text": " So this is just, then from the caption says, in phase two, firing rate plots illustrate how more gradual updates in the second level beliefs do not produce P3 like ERPs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.237,
    "end": 4259.22,
    "text": "So it's interesting to think about how they can actually titrate stimuli",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.18,
    "end": 4265.685,
    "text": " and find out, oh, was the system updating all of a sudden or was there more of like continuous updating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.385,
    "end": 4277.574,
    "text": "But these are just kind of going into specific examples that are like laid out in a clear way, but it's just, it's a lot of info that might be interesting for some, but there's five more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.594,
    "end": 4279.636,
    "text": "So let's just rapidly kind of go through the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4279.656,
    "end": 4279.876,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.137,
    "end": 4285.4,
    "text": "Figure seven is another layout of their experimental results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.744,
    "end": 4296.373,
    "text": " And again, it's a sort of spread where on the left, you have no attention, absent attention, and the right, there is a regime of attention parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4297.414,
    "end": 4301.898,
    "text": "And then similarly, weak strength signal on the top, strong strength signal on the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.039,
    "end": 4331.058,
    "text": " and they're looking at the effect of a third dimension so this could have been like a hypercube of statistical results and that's what this model and the markov decision process allows is instead of just making one model and crafting it we could make like a spectrum of 5000 models that are just incrementally different and then report the whole distribution so here within each quadrant the left is inconsistent prior and the right is a consistent prior so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4331.818,
    "end": 4335.843,
    "text": " So here, consistent prior, strong signal, high attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.043,
    "end": 4341.629,
    "text": "Now we can kind of imagine that's like the focus, you know, paying only attention to that and blasts right in your face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4342.21,
    "end": 4343.171,
    "text": "And it's like 100% saw it and 100% were correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.42,
    "end": 4349.362,
    "text": " Really salient stimuli, really clear self-report.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.942,
    "end": 4352.443,
    "text": "No one's really doubting that they perceived it with qualia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.643,
    "end": 4353.784,
    "text": "So these are the easy cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4354.404,
    "end": 4356.926,
    "text": "Okay, everything else is the gray zone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.526,
    "end": 4366.731,
    "text": "Because if you have an inconsistent prior, again, it's just a model, we're just experimenting and thinking about it, but it's interesting that 94% saw it, 95% are correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.332,
    "end": 4374.736,
    "text": "So even with high attention and high signal strength, if your priors, I'm not sure about what I'm seeing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4375.728,
    "end": 4385.132,
    "text": " Then one out of 20 people in the simulation, again, just loosely, one out of 20 will still not see it, but it was right there and they were paying attention to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.592,
    "end": 4388.873,
    "text": "So there's a lot of kind of psychology anecdotes about stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.933,
    "end": 4393.635,
    "text": "Like the whole room says that line A is longer than line B. And then the last person just is like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4394.818,
    "end": 4399.442,
    "text": " I guess it's that way, even though they think that they're there to actually speak the truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4399.522,
    "end": 4403.325,
    "text": "So people can look at the percentages and read more stories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.786,
    "end": 4413.034,
    "text": "But this is a very interesting modeling framework, because we can talk about how these different components of certainty and sense and action are related in different people's perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4417.881,
    "end": 4436.652,
    "text": " I mean, this could be interesting as well, where it talks about this inconsistent prior, when you even have a strong, you know, a strong signal, but if you've got an inconsistent prior, you may not be aware of something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4437.172,
    "end": 4444.677,
    "text": "And there's this challenge in a way where people can be tricked, you know, like we've seen with the internet and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4446.399,
    "end": 4456.231,
    "text": " Cambridge Analytics, if you feed things through at a level where it's not a strong enough signal, but it has associative qualities, you may be starting to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4457.472,
    "end": 4481.103,
    "text": " have that feed into your consciousness at another level but it's not activating your awareness um so i think that some of these questions you know that um you know and people might not notice that happening because when they do pay attention they you know every they they they they think they've seen everything there is to see but there may be some things which are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4482.389,
    "end": 4494.475,
    "text": " just inconsistent with their priors as much as they're weak you know they could be and there's a there's a little bit of an interplay potentially there that could be going on which we're not aware of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4495.16,
    "end": 4518.907,
    "text": " nice and then also like even on the other extreme if it's consistent prior but low attention and weak signal you still sometimes report it and you still might be correct even at a higher amount of correctness and so a lot of times um belief and faith are as are as if they're to be ridiculed and that's just so far off from the way that everything is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.017,
    "end": 4525.039,
    "text": " Figure eight is again, another two by two with attention and signal strength.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.659,
    "end": 4536.262,
    "text": "And they're just really going into detail now overlaying this prior consistency, inconsistency question and adding a neutral prior as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.643,
    "end": 4539.983,
    "text": "And now overlaying those three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.123,
    "end": 4545.085,
    "text": "So it'd be almost like there was three cells here, but now overlaying those as three traces of the ERP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4546.434,
    "end": 4570.953,
    "text": " what they're showing is that you get sort of the prior is like a fine tune it's like a tweak but it remains pretty much to be the case that you see the categorical difference uh amongst each quadrant and interestingly the one that dips down gives like a quasi p3 is the consistent prior strong signal low attention",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.826,
    "end": 4576.432,
    "text": " So that's like, you're not really paying attention, but something loud happens and you're sure that it's possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.318,
    "end": 4586.822,
    "text": " that's actually the one that comes closest to actually inducing, and we can look at here, percent C95, low attention, high signal strength.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.702,
    "end": 4603.468,
    "text": "So it's pretty interesting that it's easier to have, again, you'd have to calibrate it to real people, but it's easier to notice something when it's a strong signal, even if you weren't paying attention, than it is if you are paying attention, but it's a weak signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.534,
    "end": 4608.857,
    "text": " but maybe there's values for which it's one way or the other, but it really separates those two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.897,
    "end": 4614.261,
    "text": "Like, is this a subtle point in the text or is this person just not paying attention to the sentence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4614.921,
    "end": 4624.288,
    "text": "And those are sort of two questions and you want them both to be clear and so that you can align the regime of attention, but that's why this is such a cool framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4624.308,
    "end": 4625.229,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.701,
    "end": 4640.833,
    "text": " We're not gonna go into too much detail here, but this is a experimental paradigm laid out with sort of classical psychologist style of, quote, independent manipulation of expectation, stimulus, strength, and attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.533,
    "end": 4645.757,
    "text": "So they're able to use repetition and variation in a specific way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4646.317,
    "end": 4664.526,
    "text": " so that you can disentangle certain attributes from the sequence of behavior, which is something that we actually heard about from Adam Saffron and Colin DeYoung in the first streams of this year with the way that you could look beyond the personality surveys to the cybernetic big five personality traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.206,
    "end": 4670.329,
    "text": "So this is kind of like similar, it's revealing higher order parametric values",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4671.189,
    "end": 4699.239,
    "text": " from behavioral sequences that disentangle or just like a gambling paradigm might be high risk low risk high reward low reward so you're disentangling a few different attributes the person's model it's kind of like that but for visual consciousness access attention and then just to go through the a1 and a2 supplements just before we kind of hit some closing thoughts so a1 is their specification of the first level generative model matrices so let's definitely have them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4701.161,
    "end": 4722.493,
    "text": " talk about these but if you'll remember from the model stream it's all about specifying the matrices and the calculations are all about matrix multiplication small or big or nested series of matrices or lists of lists of lists and so each of these outcomes at each level when we're looking at figure um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4723.453,
    "end": 4734.19,
    "text": " three this kind of colorful connectivity model each one of these are basically reflected by a row or a value in a matrix choose spaces 17 matrices",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4736.249,
    "end": 4764.713,
    "text": " seeing a theme with the matrices and how they can represent different things like attention or a word so then a certain combination of rows is i didn't see a square or i see a square but there's semantic meaning to the composition of a matrix and then you can do probabilistic inference using that matrix and then the second supplemental figure is the second level matrix structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.186,
    "end": 4768.088,
    "text": " It's like, you thought the movie was long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.148,
    "end": 4770.61,
    "text": "Wait till you see the higher level matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.05,
    "end": 4775.253,
    "text": "And here it's similar, except now we're dealing with these hidden joint states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.434,
    "end": 4785.302,
    "text": "And that's why that was the second level in the model where these higher level states that also deal with the behavior of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.409,
    "end": 4810.855,
    "text": " nice figures by them and they really laid it all out yet still it's kind of a lot to think about so let's have them walk through what they are but i guess with that i'll just kind of bring into the ideas and questions where we can go and see when you just talk for as long as you want just what what do you think or what was like where do we take that or who do you think would find that interesting or important",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.929,
    "end": 4839.804,
    "text": " yeah i think um well now i think that we've we will find that a lot of people who are trying to um understand how this modeling can be applied into other contexts and i think there's there's probably going to be more and more of a movement for people to offer modeling um approaches",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4841.027,
    "end": 4858.827,
    "text": " more broadly so there's going to be people who are going to want to make models as people are going to want to work with people doing models people want to look at what the implications of the models are so i suppose that's something that this paper is definitely from what we've been talking about um and um so maybe even asking um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4860.268,
    "end": 4874.641,
    "text": " ryan and christopher a little bit there about you know how would someone maybe engage as they're working with those types of matrices and looking at the outputs to sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.694,
    "end": 4901.771,
    "text": " put that into a transdisciplinary team in context you know um that could be quite interesting um because this is this is all um you know it has this potential really but then without without you know asking too much of them but maybe you know and because um that that sort of thing and maybe just how if there's different ways when you start to think about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4903.01,
    "end": 4931.67,
    "text": " A transformation matrix and the B matrix and the D matrix, you know, just how those things can be, you know, are there any good practices for just helping keep your head straight with all of that as people start to, you know, because I know for Ryan and Christopher, it's second nature, you know, they can switch in between, but it does take a little bit of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4934.103,
    "end": 4940.728,
    "text": " It takes a bit of tacit knowledge to start to really embody what's going on in there and how that translates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4942.293,
    "end": 4965.319,
    "text": " into this kind of common language and so um but uh you know this paper i think gives a sense of that but it's still um hopefully that's where this live stream might be useful for people is as we go through that um especially when it got into some of the later model scenarios um yeah i got a little bit it was a little bit like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4966.164,
    "end": 4995.042,
    "text": " a lot of processing to try and work out what exactly was the paradigm that's going on um and again that might be because this is specific to people working in visual consciousness and some of these types of you know experiments so um so that would be you know that that type of broad question i think might be quite interesting to uh and maybe even it will yield other model streams in the future if they're even interested um that build on that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.246,
    "end": 4998.387,
    "text": " But otherwise I think that covers it for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4998.908,
    "end": 4999.188,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.308,
    "end": 4999.548,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.628,
    "end": 5000.989,
    "text": "Well, well said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.009,
    "end": 5001.189,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.229,
    "end": 5009.714,
    "text": "Thanks for kind of bringing the specifics of the model, but also all the ways in which, especially through teamwork and communication, we can be working on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5010.991,
    "end": 5026.33,
    "text": " having an impact and that's really an interesting area i can see why you're interested in it but what a fun discussion it is always good to read the work of christopher and ryan it's really just informative at multiple levels",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.091,
    "end": 5028.572,
    "text": " So we'll close with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.873,
    "end": 5031.375,
    "text": "Thanks again, Stephen, for participating here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5032.135,
    "end": 5037.32,
    "text": "And we'll hope that people are interested in coming on live for 18.1 or 0.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5037.98,
    "end": 5042.884,
    "text": "Or if it's after those dates, then just leave in comments and kind of continuing the discussion that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5043.765,
    "end": 5044.866,
    "text": "Well, that's it.",
    "speaker": "SPEAKER_00"
  }
]