[
  {
    "start": 1.766,
    "end": 1.903,
    "text": " Thank you."
  },
  {
    "start": 9.192,
    "end": 12.334,
    "text": " Hello and welcome to the Active Inference Livestream.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 12.774,
    "end": 20.798,
    "text": "This is the Active Inference Lab and we are here in Active Inference Livestream 18.2 on March 30th, 2021.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 21.999,
    "end": 24.32,
    "text": "Welcome everyone to the Active Inference Lab.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 24.841,
    "end": 30.424,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 31.984,
    "end": 34.266,
    "text": "Sorry, the video just changed a little bit.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 34.326,
    "end": 34.626,
    "text": "There we go.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 36.285,
    "end": 42.486,
    "text": " All backgrounds and perspectives are welcome here and we'll all be following good video etiquette for live streams.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 43.527,
    "end": 53.849,
    "text": "Today we're here in session 18.2 on March 30th having the follow-up discussion with the authors and other participants on this Predictive Global Neuronal Workspace paper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 54.649,
    "end": 63.871,
    "text": "And today the goal is really to follow up on the last week's discussion, continue discussing and learning about this very cool paper and",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 64.631,
    "end": 81.918,
    "text": " why the authors did what they did and what are the implications for different areas so today we're just going to go through some introductions and warm-up questions and then we'll be able to walk through the paper and the slides and ask a few questions to the authors and get a few different perspectives",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 83.246,
    "end": 89.851,
    "text": " So for the introductions, we'll just go around and introduce ourselves and then pass it to somebody who hasn't spoken yet.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 90.512,
    "end": 91.072,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 91.372,
    "end": 94.855,
    "text": "I'm a postdoc in California, and I'll pass it to Alex.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 98.257,
    "end": 98.598,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.418,
    "end": 100.099,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.399,
    "end": 101.5,
    "text": "I'm Alex Vyatkin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.24,
    "end": 106.243,
    "text": "I'm a researcher in Systems Management School in Moscow, Russia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.164,
    "end": 110.747,
    "text": "Also, I'm a co-organizer for Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.049,
    "end": 113.449,
    "text": " And I pass it to Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.65,
    "end": 116.67,
    "text": "Hello, I'm Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.69,
    "end": 118.39,
    "text": "I'm based in Toronto.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.551,
    "end": 126.132,
    "text": "And I do a lot of work with social topographies and landscapes for social drama.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.852,
    "end": 131.593,
    "text": "And I will pass it over to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.874,
    "end": 136.314,
    "text": "Hi, I'm Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 138.355,
    "end": 139.795,
    "text": "I am retired.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.413,
    "end": 144.774,
    "text": " I'm hanging out in the loft of my cabin, which is not very well lit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.274,
    "end": 149.595,
    "text": "I'll pass it to Ryan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.235,
    "end": 152.195,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 152.316,
    "end": 153.356,
    "text": "So I'm Ryan Smith.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 154.296,
    "end": 159.377,
    "text": "I'm a investigator at the Laureate Institute for Brain Research in Tulsa, Oklahoma.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 160.657,
    "end": 163.618,
    "text": "Yeah, I mainly work on computational modeling of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 164.747,
    "end": 173.52,
    "text": " empirical behavior in different psychiatric disorders, as well as some theoretical work on emotions and emotional awareness and interception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 174.962,
    "end": 177.186,
    "text": "I guess I'll send it to Chris.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 181.383,
    "end": 183.163,
    "text": " Hi, I'm Christopher White.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 183.243,
    "end": 194.706,
    "text": "I'm a PhD student at the University of Cambridge in England, and I mostly work on active inference or computation using active inference with computational models of cognitive control.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 195.947,
    "end": 199.908,
    "text": "But a lot of my previous work is kind of focused on visual awareness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 201.428,
    "end": 202.748,
    "text": "So I'll pass it to Adam.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 205.029,
    "end": 206.409,
    "text": "Hi, I'm Adam.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 207.349,
    "end": 209.35,
    "text": "I'm a postdoc at",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 210.287,
    "end": 216.749,
    "text": " Johns Hopkins School of Medicine Center for Psychedelic and Consciousness Research.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 216.769,
    "end": 222.97,
    "text": "I'm also a research fellow at the Kinsey Institute, and I'm interested in consciousness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 222.99,
    "end": 224.31,
    "text": "If you will, too.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 224.33,
    "end": 228.011,
    "text": "Is that everyone?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 230.012,
    "end": 230.252,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 230.532,
    "end": 239.074,
    "text": "Does anyone want to raise their hand and give a thought on one of these warm-up questions, which are just what are something they're excited or curious about today?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 240.718,
    "end": 263.58,
    "text": " something that they liked or remembered about the paper or last week's discussion to sort of jump start where we we were at um or maybe really quickly at the beginning christopher wanted to clear up something and then we'll kind of go into questions so maybe everyone could write down a question and then christopher go for it yeah show us i said two things that like",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 264.298,
    "end": 289.8,
    "text": " just false um last time why i just made mistakes i kind of want to correct them so the first one i was specifically referenced someone asked a question about the thalamus and its involvement in consciousness and i kind of referenced a whole body of work from matthew larkham's group um and i think i said the medial dorsal nucleus and it's not it's central lateral nucleus and thalamus um i think like 99 people wouldn't care but anyone who knows anything about the thalamus would be like pained by that um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 290.888,
    "end": 297.77,
    "text": " And the second thing was I was talking about King and DeHaan's Bayesian model of conscious access.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 298.23,
    "end": 300.411,
    "text": "I think I described the model as univariate Gaussian.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 301.211,
    "end": 302.451,
    "text": "That's also not correct.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 302.571,
    "end": 311.814,
    "text": "It's a multivariate Gaussian, although you can extend the same model to a univariate case.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 312.234,
    "end": 313.034,
    "text": "Anyway, it doesn't matter.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 314.094,
    "end": 315.895,
    "text": "But I just wanted to kind of correct those two things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 318.527,
    "end": 319.907,
    "text": " Thanks for the correction.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 320.508,
    "end": 325.269,
    "text": "So if everyone could raise their hand and first, um, we'll go with Adam and then Steven.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 328.751,
    "end": 333.612,
    "text": "Um, I was, uh, curious about, uh, what Chris just said.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 333.652,
    "end": 338.654,
    "text": "So like medial dorsal, that would be, um, what Thelma is for interior cingulate in the frontal lobes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 338.674,
    "end": 343.296,
    "text": "Kind of like the gateway to, um, like amygdala at all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 343.756,
    "end": 344.556,
    "text": "Would that be right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 345.919,
    "end": 348.021,
    "text": " And then what, so the central lateral, like who's that looping with?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 348.061,
    "end": 348.461,
    "text": "I forget.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 350.683,
    "end": 352.725,
    "text": "I think central lateral would be looping.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 352.885,
    "end": 360.831,
    "text": "I was specifically thinking about like a loop between layer five pyramidal neurons and central lateral thalamus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 363.133,
    "end": 373.702,
    "text": "So if I could ask a question there, just why are we identifying brain regions or what would it mean to be identifying brain regions one way or the other in humans or some other species?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 377.498,
    "end": 393.942,
    "text": " So this particular body of work, not to go too far on a tangent, but there's this really impressive body of work that basically has identified both level of consciousness and content of consciousness with burst mode firing in layer five of cortex.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 395.382,
    "end": 401.123,
    "text": "I think most of this evidence is from a mouse model, so interpret that as you will.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 404.451,
    "end": 406.093,
    "text": " Yeah, Adam, or you can use the actual Jitsi.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 406.113,
    "end": 407.274,
    "text": "Raise your hand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 408.395,
    "end": 408.935,
    "text": "But yeah, go on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 410.136,
    "end": 428.072,
    "text": "I mean, for me, it would partially be what systems might contribute to wakefulness or different aspects of consciousness, depending on how we want to carve the joints on it in different respects.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 428.152,
    "end": 430.134,
    "text": "So let's say...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 431.784,
    "end": 434.326,
    "text": " stimulating the medial dorsal was more important.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 434.986,
    "end": 451.677,
    "text": "Well, then that might implicate the specific relays, its ability to form phalamocortical loops or phalamostriatocortical, like the whole what it helps to bind together functionally and other functions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 453.278,
    "end": 455.66,
    "text": "It would tell you what processes might be involved.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 455.74,
    "end": 459.363,
    "text": "So maybe action or salience, that might be important.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 459.403,
    "end": 460.043,
    "text": "Or maybe it's like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 460.421,
    "end": 463.002,
    "text": " frontal lobes as hub, but like which part of the frontal lobes?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 463.462,
    "end": 467.104,
    "text": "Is it the parts that are like a general topologically central hub?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 467.164,
    "end": 469.445,
    "text": "Or does it look kind of like a motor bits?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 469.505,
    "end": 471.046,
    "text": "Or does it look like something else?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 471.126,
    "end": 480.07,
    "text": "And so it'd be trying to look for like fish around for clues about what's important in what ways, but it might mean, but it's easy to tell stories.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 482.451,
    "end": 483.132,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 483.512,
    "end": 485.813,
    "text": "So Steven, and then anyone else who has a question?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 488.43,
    "end": 503.303,
    "text": " So yeah, I'm just really excited about the... When I listened last week, you talked about temperature being used in the models, and you had different places where you used different amounts of temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 503.823,
    "end": 505.945,
    "text": "I think it's in the SoftMac function to show...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.487,
    "end": 536.27,
    "text": " different types of model scenarios so i'll just be curious i'm just excited about maybe um just the general way that you um use your thinking to build the models to inform how you start to look at consciousness and the way the brain works as much as the way that you find the results from the models so that i'd be interested in that those sort of two sides",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.452,
    "end": 552.192,
    "text": " So, so I mean, one, one thing I just want to make sure this is clear is that, you know, like computational neuroscience borrows or has been historically ended up borrowing a lot from terminology and physics and engineering and things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 553.216,
    "end": 558.42,
    "text": " You know, so there's some of these sorts of terms that can be a little funny, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 558.52,
    "end": 575.21,
    "text": "So like temperature, like a temperature parameter or typically an inverse temperature parameter is something that's borrowed from physics that just kind of has to do within the physics sense, kind of how much, you know, with how much energy particles are kind of bouncing around against each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 575.968,
    "end": 585.857,
    "text": " Um, and, um, you know, in a very oversimplified way of putting it, um, but, but so it just means essentially there's more kind of randomness right in the, in the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 586.017,
    "end": 595.685,
    "text": "So in the context of, um, of this, um, you're just applying that same equation to describe essentially the amount of noise in decision-making.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 596.325,
    "end": 602.991,
    "text": "So, uh, uh, higher temperature in this case, just is just a parameter in an equation that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 603.907,
    "end": 608.931,
    "text": " controls how deterministic versus stochastic decision-making processes are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 609.471,
    "end": 618.177,
    "text": "So I just want to make sure that it has... I just want to make sure it's clear to anyone listening that it has nothing to do with actual physical temperature, like being hot or cold.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 618.237,
    "end": 622.58,
    "text": "It's just a parameter that kind of modulates how random decision-making is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 624.281,
    "end": 626.623,
    "text": "So I just wanted to make that clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 626.663,
    "end": 631.646,
    "text": "So in this case, it's just controlling... So for example, if",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 632.665,
    "end": 649.888,
    "text": " if the temperature parameter is really low or the inverse temperature has a really high value, then that just means that say, even if the model was only like 51% versus 49% confident in one thing over another, it would always choose the action associated with the 51%.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 650.228,
    "end": 660.69,
    "text": "Um, whereas if the temperature value temperature parameter value was high or as low, um, or as high, or the inverse temperature parameter is low.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 661.388,
    "end": 686.057,
    "text": " then um that means that the like for instance that with 51 of the time it would choose the um the action associated with 51 proper with 0.51 probability it would choose that one less often than it would if the probability was a 0.7 um you know and less probability than that than if it was if the probability was 0.9",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 687.216,
    "end": 709.287,
    "text": " So essentially just having a low inverse temperature parameter value just allows the actual frequency of choice to kind of scale in some sense with the actual probabilistic beliefs over the different states in the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 711.629,
    "end": 712.269,
    "text": "Thank you, Ryan.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 712.649,
    "end": 716.151,
    "text": "We'll have Christopher, then Adam, and then anyone else who raises their hand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 720.689,
    "end": 722.57,
    "text": " So just to kind of contextualize that a little bit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 724.231,
    "end": 729.414,
    "text": "So a softmax function is exactly the same function as a Boltzmann distribution from statistical physics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 729.694,
    "end": 737.338,
    "text": "So often if you have a, you'll just use the same terminology because it has, and in the physics case, it has like a literal physical interpretation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 737.898,
    "end": 738.718,
    "text": "In this case, it doesn't.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 740.059,
    "end": 745.222,
    "text": "So that's kind of why there's that overlapping terminology.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 746.108,
    "end": 755.36,
    "text": " In terms of deciding why or on those parameters or actually building them in, it was really just kind of came from thinking about what attention does.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 755.581,
    "end": 759.546,
    "text": "So what we're trying to modulate there was attention and signal strength.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 759.906,
    "end": 761.008,
    "text": "And both of those things",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 762.156,
    "end": 765.239,
    "text": " in some way modulate the strength of feed forward input.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 765.559,
    "end": 770.124,
    "text": "So when you think about that, you then kind of think, okay, what part of the model corresponds to that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 770.164,
    "end": 779.073,
    "text": "Well, it's the likelihood matrix that maps, that decides the precision of the mapping between external observations and first level hidden states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 780.094,
    "end": 782.796,
    "text": "And so both the idea is that both",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 784.966,
    "end": 795.852,
    "text": " attention and kind of external signal strength, or it might be something like contrast, whatever, will jointly determine the precision of that mapping.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 797.072,
    "end": 806.918,
    "text": "And then there's lots of different ways where you can kind of cash that out if you actually want to get into kind of the neurobiology of it, like the normalization model of attention or bias competition or something like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 806.998,
    "end": 809.339,
    "text": "But kind of extracting away from that detail,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 810.336,
    "end": 813.579,
    "text": " Basically, it just modulates the A matrix, the computational level of analysis.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 814.319,
    "end": 816.04,
    "text": "So that was kind of the thinking that went into it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 818.282,
    "end": 819.263,
    "text": "Very interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 819.663,
    "end": 821.605,
    "text": "Adam, then Stephen, then anyone else.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 830.291,
    "end": 831.592,
    "text": "Okay, Adam, can you be ready to speak?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 831.733,
    "end": 832.313,
    "text": "But go for it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 833.074,
    "end": 833.774,
    "text": "Yeah, sorry about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 834.415,
    "end": 837.397,
    "text": "Oh, it's kind of off the current topic, but from before.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 837.938,
    "end": 847.16,
    "text": " So some quick Googling turned out the central lateral seems to be looping largely with parietal and temporal association areas.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 847.781,
    "end": 862.024,
    "text": "So that's potentially interesting in ways that indirectly could like speak to debates on the physical substrates of consciousness, like the brouhaha between IIT and GMWT said more like the front of the brain or the back of the brain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 862.084,
    "end": 864.405,
    "text": "And in which senses do they mean consciousness?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 867.159,
    "end": 867.88,
    "text": " But it's interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 867.9,
    "end": 875.23,
    "text": "I actually am having trouble finding an image of like a diagram of the thalamus actually shows the central lateral nucleus.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 875.27,
    "end": 877.533,
    "text": "It's all just like, I see central medial, but not central lateral.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 878.074,
    "end": 882.96,
    "text": "It seems like they might be kind of like tucking it in with the pulvinar, whatever that means.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 884.703,
    "end": 884.963,
    "text": "Stephen?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 886.977,
    "end": 888.938,
    "text": " Yeah, I just say thanks for that feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.958,
    "end": 889.638,
    "text": "That was really useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.658,
    "end": 901.004,
    "text": "And I think also, because I've got a background in chemistry, I keep thinking about the Gibbs free energy where it talks about temperature times change in entropy in that term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.064,
    "end": 909.288,
    "text": "So it's like that the temperature is multiplied into the amount of entropy change there is to make it more significant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.328,
    "end": 909.789,
    "text": "So that would...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.569,
    "end": 915.013,
    "text": " kind of mirror why it's a bit like you're putting in noise or entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.053,
    "end": 917.335,
    "text": "So that's quite useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.716,
    "end": 919.416,
    "text": "So yeah, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 920.137,
    "end": 922.098,
    "text": "Yeah, welcome, Blue.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 923.8,
    "end": 928.103,
    "text": "You or anyone else can raise their hand, but one chemistry metaphor.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 928.544,
    "end": 938.171,
    "text": "And again, Ryan, as you brought up, it's not always like a literal meaning, but thermodynamic versus the kinetic alternative for a reaction.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 938.732,
    "end": 939.953,
    "text": "So like the thermodynamic...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 940.493,
    "end": 958.167,
    "text": " outcome for the candle is to burn because it has all this pent up energy but it doesn't spontaneously combust because the kinetic barrier the activation barrier is too high and then when there's like an enzyme or a spark of energy then in the right situation the product can go all the way down",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 958.908,
    "end": 966.329,
    "text": " the big delta G to the kind of ultimate thermodynamic least energy versus the more kinetically accessible.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 966.749,
    "end": 968.69,
    "text": "And so that's kind of like information foraging.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 969.11,
    "end": 976.671,
    "text": "There's sort of the perfect citation you would find if you had the right surge and it was that low temperature or something analogous.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 977.131,
    "end": 982.372,
    "text": "But then if it's too kinetically constrained, then the attention is drawn away.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 982.992,
    "end": 987.193,
    "text": "I'm not sure if that will map directly in this whole active inference scenario.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 988.314,
    "end": 993.977,
    "text": " mode, but it's just kind of another chemical informational distinction.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 995.338,
    "end": 996.238,
    "text": "Well, I mean, it depends.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 996.298,
    "end": 997.959,
    "text": "I mean, it depends how you're using it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 998.039,
    "end": 1010.686,
    "text": "Like in this, in this case, there's not really much of a connection because we're just essentially, we're just using a temperature parameter and a softmax function to control the precision of a mapping.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1010.746,
    "end": 1014.368,
    "text": "Well, in a few different places for attention and for stimulus strength, we're just.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1015.166,
    "end": 1022.552,
    "text": " using it to change the precision of the mapping between states and observations at the first level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1023.793,
    "end": 1039.386,
    "text": "So it just controls essentially how strong a sensory signal ends up updating beliefs, posterior reserve states at the first level, and then modulated by a second temperature parameter that does the same thing, but that accounts for attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1039.666,
    "end": 1042.889,
    "text": "So these sorts of things jointly control",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1044.061,
    "end": 1049.804,
    "text": " essentially how much evidence sensory input provides for posterior giver states at the first level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1049.824,
    "end": 1052.565,
    "text": "You know, so we're using it for that kind of thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1052.625,
    "end": 1062.309,
    "text": "And then we also use it for controlling deterministicness or choice at the second level of the model in terms of action selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1063.35,
    "end": 1070.312,
    "text": "So in all those cases, I don't personally see a direct relationship between that and the kind of thermodynamic",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1071.837,
    "end": 1077.442,
    "text": " thermodynamic aspect of temperature of getting over, you know, energy barriers and things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1077.943,
    "end": 1082.788,
    "text": "But I mean, I could be, I could be, I could be just not thinking through it all the way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1084.389,
    "end": 1086.131,
    "text": "Stephen, then anyone else?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1088.328,
    "end": 1090.309,
    "text": " Yeah, I think that makes a lot of sense, what you're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.389,
    "end": 1106.261,
    "text": "And I suppose the nice thing with the modeling is that you've got this potential to, I know you're using it, like you say, as this way to bring in noise or softmax, but it gives you that way to increase and decrease it, which in real life, when you do empirical work, it's hard to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.361,
    "end": 1117.829,
    "text": "So it's one of the strengths of the modeling that you can change that parameter and see, it seems to be one way that you really get insights into the dynamics of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.853,
    "end": 1129.795,
    "text": " Yeah, I mean, in terms of just being able to modulate, or mimic the influences of attention on modulating the background perception of the signal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1132.655,
    "end": 1135.756,
    "text": "Yes, Steven, or Dean, and then Steven.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1138.157,
    "end": 1140.897,
    "text": "Yeah, I just had a quick question here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.757,
    "end": 1149.559,
    "text": "And maybe this is far too oversimplified, but when you guys were doing this work, I started also looking at the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1151.155,
    "end": 1164.24,
    "text": " the effect paper that I think the two together gave me a better sense of some of the work that I was doing around helping people walk into these novel situations pre-reflectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1165.121,
    "end": 1176.065,
    "text": "And there is a tendency to want to commit, to want to pay attention, to want to give over whatever you have in terms of processing power to figuring out what's going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1176.545,
    "end": 1180.727,
    "text": "But we had to spend quite a bit of time on helping people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.55,
    "end": 1208.188,
    "text": " get the idea that there's this channel there's this kind of sweet spot and when you were talking about degrees it brought it up for me again the idea of how to help a person know when they're over committing when they're over correcting and when they're over compensating so when they're trying to do this estimation how do they know that they're not seeing the moon walking bare because they're so committed to counting up the number of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1208.8,
    "end": 1209.86,
    "text": " basketball passes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1209.9,
    "end": 1218.762,
    "text": "I wonder if you guys had spent a little bit of time looking at the other end of the of the channel when people actually readjust back in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.802,
    "end": 1221.523,
    "text": "And I know that's that's probably where the degrees part comes in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1221.583,
    "end": 1223.383,
    "text": "But I was just wondering about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.403,
    "end": 1234.186,
    "text": "So I mean, are you imagining are you imagining in some kind of like clinical scenario where a person like biased attention away from something that could be, say, aversive if they were to focus on it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1234.766,
    "end": 1235.546,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1236.816,
    "end": 1246.987,
    "text": " Yeah, so I mean, there's probably a mechanistic relation in a sense, just in the broad sense of how we think attention is implemented, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1247.108,
    "end": 1256.779,
    "text": "So for example, if you think that a person is avoiding paying attention to something because it would be aversive,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1258.369,
    "end": 1267.213,
    "text": " then you can end up with this kind of implicit reinforcement of attentional policy selection, which we don't directly have in this model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1267.254,
    "end": 1278.619,
    "text": "The agent is choosing what the precision is associated with attention in this model, but that's something that can be added and it's something that we have actually added in some more recent work that we're doing right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1278.639,
    "end": 1285.522,
    "text": "But the idea there, or one way to think about that would be that whenever a person essentially starts",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1286.055,
    "end": 1292.678,
    "text": " to pay attention to the thing that would be aversive, then it starts to feel aversive, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1292.698,
    "end": 1303.263,
    "text": "So then if they pay attention away again, then the choice of paying attention away actually ends up being negatively reinforcing because the bad feeling goes away, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1303.723,
    "end": 1313.448,
    "text": "So then what that ends up doing, at least according to this kind of reinforcement learning account, is that that ends up assigning higher value to the policy of attending away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1314.824,
    "end": 1322.609,
    "text": " Over time, the probability of attending away just ends up getting higher and higher because it makes you feel better every time you do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1322.649,
    "end": 1326.432,
    "text": "Then this avoidant attention can become really habitized.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1330.074,
    "end": 1331.755,
    "text": "That's one way of thinking about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1331.815,
    "end": 1338.62,
    "text": "In the clinical setting, you want to help people potentially start to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1340.711,
    "end": 1359.301,
    "text": " you know, gradually, you know, expose themselves to, to, you know, pay attention to this thing that's aversive in hopes that if they're able to kind of do that in a sustained way, then over the long run, the aversiveness will go down as they kind of learn to better deal with the thing that they've been avoiding attentionally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1360.621,
    "end": 1367.545,
    "text": "You know, so, so that's, that's, you know, fairly tangential to, right, the kind of thing we're trying to do here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1368.165,
    "end": 1369.766,
    "text": "But, you know, but there's a,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1370.37,
    "end": 1386.42,
    "text": " there's a connection in this very kind of broad sense in that if you can control attention and choices of what to pay attention to can be reinforced, then that's one way you can kind of end up with this, this kind of thing where a person might not even know, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1386.48,
    "end": 1390.483,
    "text": "That they've developed this strong habit, you know, not to pay attention to something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1390.543,
    "end": 1391.784,
    "text": "It just becomes very automated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1392.604,
    "end": 1397.907,
    "text": "Um, you know, the same way, the same way any other behavior can be habitized via repeated reinforcement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1398.688,
    "end": 1398.728,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1399.465,
    "end": 1406.67,
    "text": " but here just it would be a kind of a cognitive action as opposed to a more overt behavioral action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1406.69,
    "end": 1408.912,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1408.932,
    "end": 1410.233,
    "text": "Very interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1410.653,
    "end": 1412.214,
    "text": "Thanks for that question and response.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1412.594,
    "end": 1415.116,
    "text": "Adam, and then anyone else who raises their hand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1415.136,
    "end": 1428.526,
    "text": "I guess to come out of left field, in what you were just describing, it seems like that could have some relation to maybe",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1429.09,
    "end": 1458.298,
    "text": " grounding like psychodynamic like concepts in terms of if these patterns of attentional approach and avoidance can move from your C matrix to your E matrix you can end up finding yourself in these sort of like garden paths of attending and coming to inferences for reasons that you might not even understand just on the way your policy selections of attention have been shaped for conditions that are might be too numerous and varied for you to track and so",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1459.696,
    "end": 1459.816,
    "text": " Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1459.836,
    "end": 1459.936,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1459.956,
    "end": 1463.477,
    "text": "I mean, there's, I mean, we've written, you know, we've written a few papers on this, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1463.517,
    "end": 1472.339,
    "text": "Like, or I have with some colleagues, I mean, again, you know, my focus, um, you know, is, is largely in, you know, in terms of emotion and psychiatric conditions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1472.419,
    "end": 1472.699,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1473.219,
    "end": 1484.661,
    "text": "And I wouldn't, um, I would say it's a way of, of, um, recasting the sorts of behaviors that psychodynamic approaches are trying to capture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1485.202,
    "end": 1492.747,
    "text": " but to do it in a way that doesn't actually posit the existence of these sorts of repressive, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1492.847,
    "end": 1496.85,
    "text": "Like, you know, like unconscious, like there's no unconscious agent, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1496.87,
    "end": 1497.991,
    "text": "There's no id, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1498.011,
    "end": 1504.916,
    "text": "That's being posited, that's sitting there keeping these things out of awareness, but somehow they're still present unconsciously, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1504.936,
    "end": 1506.357,
    "text": "There's nothing like that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1506.397,
    "end": 1513.862,
    "text": "It's just a very simple story of having reinforced patterns of attention that, you know, so it,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1515.137,
    "end": 1527.582,
    "text": " It's a way of capturing the phenomena that I think psychodynamic approaches are often trying to capture, but it doesn't posit a lot of the ontological, a lot of the entities that are posited in psychodynamic approaches.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1530.524,
    "end": 1530.804,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1531.404,
    "end": 1532.804,
    "text": "Stephen, then anyone else?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1532.824,
    "end": 1533.505,
    "text": "Adam, go for it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1533.585,
    "end": 1533.685,
    "text": "Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1539.468,
    "end": 1546.989,
    "text": " Not saying you're Freudian, but you're actually finding the baby in the bathwater, rescuing it, cleaning it up, contextualizing it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1547.229,
    "end": 1549.03,
    "text": "Why did people have these intuitions to begin with?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1549.17,
    "end": 1550.17,
    "text": "What was the grains of truth?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1551.63,
    "end": 1559.471,
    "text": "I'm wondering if through this, this could lead to this kind of patterns of attending, some of which you're not tracking.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1560.132,
    "end": 1568.653,
    "text": "This could be an account of what would lead to potentially mismatch or discrepancies between things like stated and revealed preferences.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1569.582,
    "end": 1584.894,
    "text": " or a thing like your actual affective disposition with respect to thing and then what you think is going on and then those could potentially go across purposes in ways that could be difficult to explicitly model and potentially have like problematic sequelae or not.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1585.655,
    "end": 1594.982,
    "text": "But I'm wondering if like this could lead to like a mismatch or across purposes of attracting states at different levels.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1596.491,
    "end": 1599.592,
    "text": " Um, I mean, I'd probably need more concrete examples to try to figure that out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1599.632,
    "end": 1601.572,
    "text": "I mean, that's probably something I'd have to think about more.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1602.373,
    "end": 1606.234,
    "text": "I guess one quickly would be like, um, implicit affect tests or something like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1606.314,
    "end": 1612.956,
    "text": "Like you say, like, um, uh, I'm not racist, but then it turns out, no, no, you are.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1613.296,
    "end": 1625.159,
    "text": "And like, if you actually look at the reaction or something like that, or I am really happy in this relationship, but then like I measure your heart rate variability and it's crap or things like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1625.359,
    "end": 1625.439,
    "text": "Um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1626.109,
    "end": 1632.21,
    "text": " Just this, your actual affective state might end up being different than what you think it is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1632.23,
    "end": 1643.413,
    "text": "And there can be like a lack of self-awareness, like a difficulty coming to coherent modeling of yourself because of these like shaped paths of attention.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1643.473,
    "end": 1645.314,
    "text": "Like you might like miss the mark about you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1645.334,
    "end": 1648.334,
    "text": "Cause it was like difficult to see something like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1648.554,
    "end": 1651.515,
    "text": "I mean, I would, I would think that, you know, I mean,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1652.182,
    "end": 1664.671,
    "text": " perhaps there are sort of some instances of the sort of thing you're talking about that could be captured by the kind of mechanisms that, you know, we're talking about here or the kind of tangential extension of them that we're talking about here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1665.732,
    "end": 1668.734,
    "text": "But I'm not confident that all of them could.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1668.774,
    "end": 1678.401,
    "text": "I imagine there's a number of mechanisms that you might appeal to to describe some of those things like, you know, implicit, yeah, like, I mean, if you're talking about like implicit associations on like an IAT,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1679.986,
    "end": 1705.785,
    "text": " right or something or something like that that's probably my intuition is that's probably different from you know it's more kind of like a like a like a right which i know chris has actually been working on models of true tasks um but um right which is which is probably pretty different from um um some of the other examples that you were giving but but yeah i mean like i said i'd have to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1706.294,
    "end": 1715.918,
    "text": " Taking a particular example, I'd probably have to think it through a little more to think about what kind of generative model would be able to reproduce the kind of behavior you're talking about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1717.439,
    "end": 1726.383,
    "text": "Or most likely, there would be multiple generative models that could reproduce it, and then you'd have to do some kind of experiment to do model comparison and see which one actually best accounts for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1727.263,
    "end": 1735.367,
    "text": "But again, I wouldn't feel really confident saying what that might look like just in the very kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1736.101,
    "end": 1738.687,
    "text": " abstract general description we're talking about right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1740.571,
    "end": 1740.832,
    "text": "Nice.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1741.333,
    "end": 1741.614,
    "text": "Nice.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1742.115,
    "end": 1742.917,
    "text": "Thank you for the response.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1743.177,
    "end": 1743.438,
    "text": "Steven?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1745.916,
    "end": 1755.263,
    "text": " Yeah, just bringing this point with this model that's now maybe getting into the modeling part is I think that's interesting with the awareness base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.283,
    "end": 1759.186,
    "text": "There's a lot of work with awareness-based systems change and looking at awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.826,
    "end": 1769.073,
    "text": "And I'd be interested in your thoughts on how we can move beyond being trapped in a psychology of the individual",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.793,
    "end": 1797.025,
    "text": " and you know pathology of the individual and it moves into the intersubjective multi-scale so like you talk about tasks but you it also could be used in taskscapes you know organizational contexts or groups of people so i just think that there's um because the the it's not nailed down to like a psychological model of the person's thoughts and feelings but more a general model of the attentional structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.865,
    "end": 1802.947,
    "text": " And it has an ability to move between scales and context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.027,
    "end": 1807.448,
    "text": "So I just think I've put that out there as something that seems quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.468,
    "end": 1811.85,
    "text": "I mean, there's more to you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1812.01,
    "end": 1814.371,
    "text": "Oh, go ahead, Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1816.671,
    "end": 1823.854,
    "text": "So I think the utility of models like these is to identify a very specific phenomenon.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1825.024,
    "end": 1853.12,
    "text": " and that namely having conscious access to some content and not others um so i have conscious access to what's in front of me my visual field at the moment if i direct my attention around my body i can bring up all sorts of like i can suddenly become aware of different kind of smarter sensory um bits of information and all of these have very specific kind of neural signatures as it were",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1853.971,
    "end": 1863.235,
    "text": " What we're trying to do is really propose a model at a computational level of analysis and algorithmic level of analysis that explains these.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1863.475,
    "end": 1878.602,
    "text": "And outside of that, I'm not sure to what extent actually talking about awareness, intersubjective awareness, is it all the same thing?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1880.291,
    "end": 1886.572,
    "text": " as talking about awareness as someone who works in neuroscience of consciousness, for example.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1887.313,
    "end": 1890.673,
    "text": "They might be, but I don't see any evidence that they are.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1893.414,
    "end": 1895.534,
    "text": "Pretty interesting, because it's in the title of the paper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1895.995,
    "end": 1899.295,
    "text": "So many people might think of it differently.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1900.536,
    "end": 1902.556,
    "text": "I mean, it's just an interesting question, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1904.042,
    "end": 1905.562,
    "text": " Sorry, what's in the title of the paper?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1906.363,
    "end": 1912.044,
    "text": "Just the idea that the visual consciousness is involved.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1915.005,
    "end": 1920.606,
    "text": "Well, but I mean, but again, I mean, this is a model of a particular visual consciousness past, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1920.746,
    "end": 1926.248,
    "text": "I mean, so it's meant to account for things that are seen in the visual consciousness literature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1927.123,
    "end": 1952.897,
    "text": " um you know there is the structure is abstract enough that you know we would and we say this in the discussion that it ought to apply to cases of having access to one bit of information versus another um in other domains right like in the auditory domain or you know something that i've been working on you know with a bunch of colleagues at um you know at library where i am um you know is trying to see if the same sort of thing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1953.818,
    "end": 1958.08,
    "text": " It looks like it's present in the interoceptive domain, for example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1959.68,
    "end": 1977.247,
    "text": "So I think it's right to say that we would hope anyway that it's abstract enough that it can account for any piece of information that you either gain access to or not when it's being represented somewhere.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1978.191,
    "end": 1985.799,
    "text": " whether it's, you know, right now, as I'm talking to you, I'm not necessarily aware of what my heart's doing, but now I choose to pay attention to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1985.859,
    "end": 1990.023,
    "text": "And all of a sudden, okay, I can kind of feel that it's beating at a certain rate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1990.163,
    "end": 2000.574,
    "text": "I believe, I believe, I believe that I, that I feel, I wasn't conscious of that before, despite the fact that my brain was unconsciously tracking, you know, what my heart was doing that whole time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2001.297,
    "end": 2001.537,
    "text": " Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2001.577,
    "end": 2006.223,
    "text": "So it could apply to being aware or not aware of any stimulus.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2007.124,
    "end": 2017.878,
    "text": "So, I mean, to the, so only to the extent that when we say something about inner subjective awareness, only to the extent that that means something about a piece of information that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2019.489,
    "end": 2046.285,
    "text": " know before i was attending to it i didn't know you know was there but now that i'm paying attention to it that i do so for example like if i happen to um notice that a person's smiling or something like that um even though they were smiling at me the whole time you know maybe my brain had picked up on the fact that they were smiling but um i wasn't aware of it until i focused my attention on it or something like that right or even maybe more abstract than that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2046.861,
    "end": 2074.044,
    "text": " know when my brain sort of had unconsciously detected the smile there might even have been some further inference that that means something about them being happy right so so there might even be a case where um i either do or do not gain access to this unconscious inference or this posterior belief that the person is more likely happy than unhappy or something like that right but uh but i mean these are sorts of cases they would have to be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2074.704,
    "end": 2076.665,
    "text": " tested in their own right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2077.025,
    "end": 2086.171,
    "text": "My broad point is just that it's an abstract structure where all it is meant to account for is when your brain is representing something and you either become aware of it or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2088.252,
    "end": 2090.954,
    "text": "I mean, if I could just kind of build on that slightly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2091.575,
    "end": 2091.935,
    "text": "So I think",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2094.916,
    "end": 2105.667,
    "text": " One, it's very tempting when we've got computational models that are relative, when we've got lots of equations sitting in front of us to kind of think that, I think it's easy to get an illusion of rigor where there is none.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2107.849,
    "end": 2112.834,
    "text": "The thing that makes these models meaningful is that we can, we're tracking some real world phenomenon.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2116.334,
    "end": 2134.05,
    "text": " In terms of the abstract model structure, it may be the case that say you have group dynamics where there's some group, some aspect of that, maybe the individual behavior of individuals within a group evolves at a really quick time scale.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2134.651,
    "end": 2138.655,
    "text": "And then the group decision-making evolves at a slower time scale.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2139.255,
    "end": 2148.077,
    "text": " You may be able, you could, in principle, fit a two level partial observer Markov decision process to this as a model of that behaviour.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2148.917,
    "end": 2151.258,
    "text": "But that would be very, very difficult.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2151.418,
    "end": 2160.68,
    "text": "I think even in that case, even though we're fitting the same model, I don't think that those are at all the same phenomenon, although there may be similarities across them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2162.02,
    "end": 2168.642,
    "text": "I would be extremely resistant to calling one visual awareness or that a group has visual awareness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2171.553,
    "end": 2172.154,
    "text": " Interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2172.354,
    "end": 2175.176,
    "text": "And of course, a parallel debate in the ant world.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2175.456,
    "end": 2180.02,
    "text": "Is there a colony awareness or a single six-legged ant awareness?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2180.38,
    "end": 2183.402,
    "text": "Or how should we think about distributed systems?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2183.462,
    "end": 2186.365,
    "text": "And aren't we all kind of just distributed systems all the way down?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2186.985,
    "end": 2188.727,
    "text": "So Adam, and then Steven.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2195.052,
    "end": 2199.195,
    "text": "So this would be related to, I guess, different types of interest subjective or",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2199.842,
    "end": 2202.303,
    "text": " intrasubjective awareness that you might believe is a model for.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2202.323,
    "end": 2225.174,
    "text": "I recently uploaded a preprint after some conversations with people from the Brain Institute at Chapman University, basically trying to do the beginnings of an active inference account of LeBay phenomena and readiness potentials that are a little bit less deflationary with respect to volition and conscious causation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2225.995,
    "end": 2228.176,
    "text": "And so in essence, I was",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2228.919,
    "end": 2241.047,
    "text": " thinking of the actual moving your hand being an accumulation of model evidence with respect to appropriate receptive pose.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2241.768,
    "end": 2251.214,
    "text": "And it might be some sort of conjunction of also whether or not your will or feeling of urge was part of it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2251.254,
    "end": 2255.637,
    "text": "You could think of that as inference over your affective state.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2256.135,
    "end": 2266.239,
    "text": " And that if these things are in what kind of alignments could help to explain whether you're like aware of readiness potential activity or whether this awareness is actually feeding back and contributing to it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2266.86,
    "end": 2278.605,
    "text": "And so I feel like your model could potentially like provide like a very precise contextualization of this really subtle what's going on and I would like to collaborate.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2280.365,
    "end": 2283.967,
    "text": "So, I mean, just again, Brad, just to make it really,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2284.952,
    "end": 2286.113,
    "text": " maybe that could be the case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2286.153,
    "end": 2291.977,
    "text": "I have no idea, but it could only potentially be the case if what you're talking about, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2292.018,
    "end": 2305.268,
    "text": "Like what you're, you know, motivated to do or what you're, you know, in the process of about, you know, being about to do or, you know, whatever aspect of, um, you know, action or action tendency or, you know, anything like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2305.948,
    "end": 2311.753,
    "text": "Um, the only way this could apply is if you think that that information about what your,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2312.902,
    "end": 2317.244,
    "text": " you know, what you're motivated to do or something like that, you know, whatever it is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2319.244,
    "end": 2326.187,
    "text": "Only if it's the case that you think that is a represented piece of information that you can attend to or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2327.107,
    "end": 2339.372,
    "text": "And then you could sort of gate into the higher kind of deeper temporal level of the model that would inform verbal reporting and sort of other goal directed uses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2340.346,
    "end": 2355.517,
    "text": " So it would only be the case, I guess my point is this, is if the representation associated with action that you're talking about is, in some sense, formally equivalent to a representation of something visual that you can attend to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2355.537,
    "end": 2359.299,
    "text": "That makes sense.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2359.319,
    "end": 2365.543,
    "text": "So it's, so the preprint is like, it's like a three, I think like a three page, more of a promissory note.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2366.164,
    "end": 2369.006,
    "text": "But if I could like pick your brain later about like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2369.631,
    "end": 2375.295,
    "text": " if you think there's like a way we could actually get some like empirical traction and like nailing down the specifics along the lines you're saying.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2375.315,
    "end": 2398.731,
    "text": "Well, if you have a, I mean, if you have a task and that task involves people paying attention to the aspect of action that you're talking about, then in principle, you could have people, you could have people, you know, in some sense cue them or prime them or something like that, that engages that sort of action bias or action motivation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2400.017,
    "end": 2429.218,
    "text": " and again they can either attend to it or not or report on it or not in that case yes but otherwise probably not it's a little tricky I think in terms of like the action that would be attended to would be of a couple varieties but none of them few of them would be directly observable so it's like you could say like it's the action of the neural activity in terms of like the ramping activity like do they have access to that but the I was thinking it could also be like the action of like mental acts and like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2429.56,
    "end": 2451.153,
    "text": " rehearsing like imagining in a kind of sophisticated affective inference sense like am i going to move my hand or not what would that be like and then that being contributing to that signal um but and where like actual awareness of this like fictive meant this fictive action could be part of what would contribute to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2452.499,
    "end": 2454.641,
    "text": " whether or not you feel ownership of it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2454.761,
    "end": 2455.922,
    "text": "It's interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2455.962,
    "end": 2458.104,
    "text": "Some people don't show readiness potentials.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2458.164,
    "end": 2458.664,
    "text": "They just act.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2458.704,
    "end": 2459.445,
    "text": "Other people do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2460.486,
    "end": 2465.95,
    "text": "Like schizophrenic patients, they tend not to show readiness potentials before they spontaneously raise their hand.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2466.01,
    "end": 2470.134,
    "text": "But it would be hard to get this... The action is internal.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2471.375,
    "end": 2473.056,
    "text": "And so I don't know what you can do with that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2474.177,
    "end": 2480.102,
    "text": "Yeah, it just seems like you have to have some kind of behavioral readout that can be fit to...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2482.114,
    "end": 2489.439,
    "text": " to a model of this to be able to say that this explains the ability to consciously report on it or not, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2490.299,
    "end": 2502.287,
    "text": "So I guess could you use, like, right before leading to, like, the action, there tends to be, like, it starts out, like, more bilateral, and then the ramp activity tends to go lateral, and then the hand moves.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2502.947,
    "end": 2506.889,
    "text": "Could you use, like, that sort of signal as the readout?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2508.07,
    "end": 2509.231,
    "text": "Like the ensemble activity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2510.063,
    "end": 2514.985,
    "text": " So in principle, you can fit models to neural activity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2515.005,
    "end": 2521.709,
    "text": "I mean, you can fit models to anything that the generative model generates.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2522.429,
    "end": 2537.897,
    "text": "But I'm not necessarily all that confident that you'd be able to justify the claim that because the model in one case generates a readiness potential signal,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2538.584,
    "end": 2542.725,
    "text": " that that has anything to do with having conscious access to something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2542.745,
    "end": 2555.609,
    "text": "And you have the other problem, like if you're using like the ensemble activity, it's still the interpretation, like awareness of what, what are we even talking about with the awareness of the whole point is to try to like contextualize what those signals mean.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2556.529,
    "end": 2557.409,
    "text": "And so, yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2558.01,
    "end": 2558.17,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2558.19,
    "end": 2565.992,
    "text": "I mean, the point is, I mean, in the majority of cases, you know, either directly or indirectly, you know, like verbal report, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2566.072,
    "end": 2566.472,
    "text": "It's still,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2567.162,
    "end": 2571.166,
    "text": " kind of gold standard for whether someone has access to something, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2571.246,
    "end": 2575.289,
    "text": "Even in no report paradigms, you're still later, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2575.71,
    "end": 2578.532,
    "text": "Asking them to report what they were experiencing at the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2579.073,
    "end": 2592.705,
    "text": "Um, um, so it's, I mean, in the, yeah, the issue is that in some sense, all kind of supportable or accepted sort of evidence for being consciously aware of something, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2594.286,
    "end": 2606.461,
    "text": " is, is always ultimately, and Chris, you can correct me if you think this is wrong, but, but I mean, I think that it always ultimately comes down to verbal report or some reliable correlate of verbal report, whether at the time or later.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2607.813,
    "end": 2608.393,
    "text": " I agree with that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2608.413,
    "end": 2629.164,
    "text": "So I think I'm not an expert in no report paradigms, but to my knowledge, all of them, the reason we trust no report paradigms is because our measure, whether that is a particular mode of eye tracking or it is just like incidental memory afterwards, all of those things correlate really, really well with report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2629.204,
    "end": 2635.587,
    "text": "And that's the thing that kind of like makes us trust them as measures of conscious access independent of report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2637.659,
    "end": 2642.424,
    "text": " Yeah, I think it's always reporter foundational, unless we have really, really good evidence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2642.464,
    "end": 2644.827,
    "text": "Otherwise, I think we have to take them kind of at face value.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2646.628,
    "end": 2646.909,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2647.249,
    "end": 2649.131,
    "text": "We'll return to the stack.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2649.271,
    "end": 2652.635,
    "text": "So Blue, and then Stephen, and then anyone else who raises their hand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2655.811,
    "end": 2661.578,
    "text": " So Adam always brings me into this metaphysical thought space whenever he talks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.918,
    "end": 2671.089,
    "text": "And I just was wondering, in terms of this visual model, you hear the expression that people see what they want to see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2671.79,
    "end": 2674.573,
    "text": "And so have you thought about maybe testing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2676.415,
    "end": 2702.534,
    "text": " like there's the the idea of paying attention to something and so we thought about testing like whether you know people can deceive themselves in this visual process right like some self-deception or even like the you hear like the power of manifestation like can people bring into their awareness something because they simply want it to be there i mean have you thought about this or testing the model in this way yeah i mean if you go to a figure um maybe scroll down is it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2703.223,
    "end": 2725.928,
    "text": " which one so we have a we have a actually I'm not sure uh so that's the erps yeah that attacks the extended taxonomy so we start with this kind of four-way taxonomy between which to Han proposed um along with some other of his colleagues of the kind of factors underlying whether you'll have conscious access to a stimulus and you kind of broke it down into whether",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2726.761,
    "end": 2735.227,
    "text": " attention was weak or absent, present or absent, or whether kind of this how strong the signal strength was weak or strong.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2735.987,
    "end": 2739.91,
    "text": "And then we extended this by adding in prior expectations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2741.051,
    "end": 2743.993,
    "text": "So the extent to which you expect a stimulus to appear.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2745.133,
    "end": 2750.357,
    "text": "And there is now like one of the big motivations this work is that there is an enormous body of work now.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2751.109,
    "end": 2760.552,
    "text": " showing that expectation does play a fairly fundamental role, I think, in determining the contents of visual awareness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2761.292,
    "end": 2773.336,
    "text": "So as for whether you can voluntarily bring something into awareness, the answer is I think that's more to do with attention, I suspect.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2773.557,
    "end": 2777.658,
    "text": "But say, for example, if you are looking at a bistable image,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2779.093,
    "end": 2790.157,
    "text": " you can attend to one part of that image and then have the, if it's a, I think it's called a NECA cube, you can have the cube flip versus if you attend to another part, it'll flip back.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2791.377,
    "end": 2795.779,
    "text": "And you can do kind of similar deliberate moves of attention with a lot of bi-stable images.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2799.3,
    "end": 2804.562,
    "text": "So also I think there's some really cool, there is some interesting kind of back to the,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2805.58,
    "end": 2825.462,
    "text": " of expectation thing and expecting seeing what you expect to see a lot of that depends upon how strong your bottom-up evidence is if you are much more likely so there are paradigms that kind of distract people but basically condition them into expecting a stimulus to appear um and",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2826.448,
    "end": 2838.53,
    "text": " you can get kind of accidental hallucinate, or you can basically like induce people to blur what is essentially a hallucination in those cases, or mistakenly report something that we know as a fact, the experimentalists as experimentalists, they weren't there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2839.13,
    "end": 2846.652,
    "text": "I think there are two examples that what I have in mind at the moment is a really clever set of studies by Jean Arou, but I know Ryan, and maybe you can talk about this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2847.032,
    "end": 2853.133,
    "text": "There's also a lot of work on conditioned hallucinations from a group at Yale who I know you collaborate with.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2854.423,
    "end": 2876.75,
    "text": " yeah so yeah and that was that was yeah something i was actually going to bring up is and this is this is not yeah because i mean i agree with you chris in most cases i think it's going to have to do with some kind of like motivated selective attention um that kind of like biases say different possible uh interpretations that you have posteriors over states for the posteriors into the first level",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2877.643,
    "end": 2902.772,
    "text": " um but um but yeah definitely you can have these expectation effects although i don't necessarily think of those as being um voluntary right i'm not sure that um like like selective attention is definitely a kind of controllable cognitive action whereas shifting uh prior expectations i'm less confident that that can be cast that way um but but um priors definitely have a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2903.396,
    "end": 2912.083,
    "text": " and influence right on what your posteriors of our states are given some stimulus, especially like Chris said, when the stimulus strength is fairly low or noisy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2912.103,
    "end": 2928.316,
    "text": "Um, you know, so, so some of the work that, um, yeah, Al Powers and his group at Yale, and then, um, that I've been, we've been collaborating to build active inference models for this stuff, um, is, uh, yeah, these sorts of conditioned hallucination paradigms in people with psychosis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2928.999,
    "end": 2941.167,
    "text": " So the way these paradigms work is that you start out always showing people a light and that is always coincident with a tone that appears in some white noise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2943.108,
    "end": 2952.474,
    "text": "And so on the first several trials, there's a fairly strong tone that plays in the white noise every time they hear a light or every time they see a light.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2953.221,
    "end": 2959.245,
    "text": " Um, and it's thresholded so that they would perceive that tone, uh, 75% of the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2960.225,
    "end": 2969.771,
    "text": "Um, and then, and then after several of those trials, um, there starts to be cases where, um, the, the tone is still present, but it's weaker.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2969.931,
    "end": 2972.593,
    "text": "So they only would detect it 50 or 25% of the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2973.153,
    "end": 2978.296,
    "text": "And then there are trials where the light comes on, but no tone is played and there's just white noise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2979.157,
    "end": 2982.579,
    "text": "Um, and what, um, what they have found.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2983.326,
    "end": 2991.25,
    "text": " is that people with psychosis have a higher probability of reporting hearing tones when the light shows up, even when there was no tone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2992.131,
    "end": 3008.519,
    "text": "So they build up this expectation to hear a tone whenever they see the light, and somehow those prior expectations that the tone will be there have a stronger influence over whether they hallucinate the tone or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3009.519,
    "end": 3012.781,
    "text": "That influence is stronger in people that have hallucinations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3013.699,
    "end": 3026.625,
    "text": " than in people that don't have hallucinations, which has kind of led to this idea that what's going, you know, part of the computational issue in people with psychosis that are more likely to have hallucinations,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3027.341,
    "end": 3034.504,
    "text": " is that prior expectations are in some way really precise and therefore gonna dominate perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3035.665,
    "end": 3044.549,
    "text": "And that could be either because the prior expectations themselves are really precise or because beliefs about the actual sensory signal are",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3045.309,
    "end": 3047.833,
    "text": " Those are believed to be very imprecise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3048.594,
    "end": 3058.668,
    "text": "But in either case, the relative precisions are supposed to, are thoughts that kind of favor prior expectations in psychosis to a greater degree than people without psychosis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3059.589,
    "end": 3059.929,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3060.717,
    "end": 3061.817,
    "text": " Can I just follow up really quick?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3062.197,
    "end": 3062.357,
    "text": "Yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3062.758,
    "end": 3062.998,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3063.478,
    "end": 3069.679,
    "text": "So it's interesting that you brought the auditory thing into this, but the auditory hallucinations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3069.759,
    "end": 3078.902,
    "text": "And I wonder if it's a visual cortex thing or if it's involved more with the auditory cortex, because even when Chris was talking, you know, you think about like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3079.702,
    "end": 3095.334,
    "text": " people have seen like when you have two things played simultaneously auditory tracks that like it's like listen for the phone number and then you hear the phone number but then if you're not listening for the phone number you're you're hearing something else so it's interesting that that the auditory system like the the selective attention",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3095.834,
    "end": 3122.557,
    "text": " in the auditory track really is is much more apparent like where you see the blue dress versus the white dress or the gold dress or whatever color it was like the two dresses is not so selective it's like look for the blue dress or look for the white dress if you set up that expectation in the visual system it's not as um prevalent i think yeah i mean i will agree that yeah it's definitely harder to switch the uh interpretation from the blue to the yellow when i've tried that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3123.058,
    "end": 3125.839,
    "text": " I can, I can get myself to do it, but it's way more effort for you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3125.859,
    "end": 3126.179,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3126.879,
    "end": 3138.823,
    "text": "Um, and, uh, yeah, I mean, I don't know, Chris, if you have any ideas about why exactly that would, that would be, I mean, I know cases of like, you know, attention and binocular rivalry and things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3138.863,
    "end": 3152.227,
    "text": "In those cases, I think there are cases where I think selective attention can play a bigger role, like the Necker cube, for example, um, that's maybe a little more analogous to the kind of like, uh, multi, uh, channel auditory input.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3152.247,
    "end": 3152.327,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3153.089,
    "end": 3155.411,
    "text": " I think it just depends on how you set the task up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3155.431,
    "end": 3159.114,
    "text": "I'm not sure if the comparison is really a fair one, I suppose.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3159.374,
    "end": 3169.883,
    "text": "I think you definitely can set up a lot of... Expectations play a huge role in the visual system, I think is one thing to say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3171.364,
    "end": 3178.85,
    "text": "Whether you have voluntary control, whether those things come under the purview of voluntary attention is another thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3181.428,
    "end": 3204.873,
    "text": " i still think there are lots of cases depending on how you set up the problems i think binocular rivalry is a good one or even something like actually literally like where you move your eyes i know that sounds trivial but um whether your eyes are moving around a page or not kind of determine determines uh some different types of visual illusions so if you think about um maybe illusion isn't even the right word",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3207.312,
    "end": 3210.255,
    "text": " But what's the, sorry, we're working on a project about this right now.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3210.275,
    "end": 3210.955,
    "text": "What's it called again?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3211.296,
    "end": 3212.597,
    "text": "Thomas Parr's paper on this, Ryan.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3212.617,
    "end": 3213.237,
    "text": "Do you remember?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3213.257,
    "end": 3214.178,
    "text": "It was Troxel fading.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3214.679,
    "end": 3215.379,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3215.7,
    "end": 3216.04,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3216.22,
    "end": 3227.931,
    "text": "If you Google Troxel fading, I think that's a really powerful example of where just kind of selective attention has a really major role on whether you perceive something as present or absent.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3232.173,
    "end": 3232.353,
    "text": " Yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3232.894,
    "end": 3234.016,
    "text": "Very interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3234.096,
    "end": 3241.065,
    "text": "It's almost like there's ambiguous and non-ambiguous stimuli in different domains and maybe even interpersonal variation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3241.506,
    "end": 3245.311,
    "text": "One person being really good at picking up on something subtle in one domain or not.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3245.832,
    "end": 3248.736,
    "text": "So we'll do Steven, then Dean, then Adam.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3251.397,
    "end": 3257.403,
    "text": " I think this ties in actually to what I was mentioning earlier about when you scale things up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.543,
    "end": 3258.885,
    "text": "And I agree with what you're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.905,
    "end": 3269.656,
    "text": "When you scale things up, it may be useful to think about how someone facilitates the attention of people in a group and how you take them and how you think about taking their attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.676,
    "end": 3274.12,
    "text": "But it doesn't mean that whatever they consciously have intersubjectively together",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.881,
    "end": 3277.763,
    "text": " is now read by the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.823,
    "end": 3281.945,
    "text": "So its usefulness may be in how people's attention is taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.005,
    "end": 3290.991,
    "text": "And I think it ties to this hypnosis thing as well, because I think your model speaks to top-down and bottom-up happen at different scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.051,
    "end": 3293.973,
    "text": "Because often we think top-down, we think executive function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.673,
    "end": 3297.715,
    "text": "And executive function is telling me what I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.355,
    "end": 3300.517,
    "text": "But like you say, you can have a subconscious level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.437,
    "end": 3304.839,
    "text": " of trying to think what something is, even if it's in the subconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.119,
    "end": 3306.579,
    "text": "And hypnosis is doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.639,
    "end": 3310.081,
    "text": "Hypnosis is playing the game with someone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.462,
    "end": 3318.805,
    "text": "Or with these optical illusions, you say to someone, you're looking at this cube from above or below, and it flips.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.265,
    "end": 3322.307,
    "text": "But it's not that you're being told it's this type of cube.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.027,
    "end": 3344.086,
    "text": " and your executive functions pushing it it's it's still top down but it's it's happening at a um a more subconscious what we might call a subconscious level and i think that's quite interesting so if i could just speak to that i think there are a couple of things going on there so i would talk about executive function well i mean i think it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3346.977,
    "end": 3375.536,
    "text": " one thing that this is a bit of a tri-point but top-down is a very ambiguous term um i think what where so you can mean kind of that can mean anything from basically like recurrent loops from higher quarters from cortices that are higher up the cortical hierarchy um to something like top-down intent like a voluntary control of attention via executive like frontal parietal networks or something like that um so those are just different different phenomena um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3377.361,
    "end": 3393.17,
    "text": " I think in our model control of attention would presumably be at, if, if we were to build a model of this would be at this, you, you would put the dorsal attention network at the second slower time scale for model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3393.491,
    "end": 3396.752,
    "text": "I think maybe Ryan, you can, we can speak to this as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3396.772,
    "end": 3397.933,
    "text": "I haven't really thought about this much.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3398.914,
    "end": 3404.337,
    "text": "Um, I would have been a little more, uh, like executive control network.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3405.398,
    "end": 3433.643,
    "text": " sort of thing I guess would have done a little bit more what I would have thought about just kind of off the top but yeah you're probably right about that I mean visual attention right I mean obviously right the dorsal attention network is you know kind of defined or originally yeah like went specifically to yeah like visual attention and things like that or kind of quote unquote top down visual attention but in terms of the kind of directing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3434.096,
    "end": 3441.34,
    "text": " right, visual attention in a goal-directed way, then I think that would be more executive control network.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3441.541,
    "end": 3442.381,
    "text": "That's how I would thought of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3443.302,
    "end": 3451.667,
    "text": "I mean, on the hallucination point, I did my undergrad at Macquarie University and they have a whole hallucination group there within the cognitive science department.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3451.767,
    "end": 3456.39,
    "text": "And so I just feel like acutely aware of the fact that I don't know anything about it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3458.027,
    "end": 3485.486,
    "text": " and it's also an extremely complicated phenomenon you can use hallucination to like as a model of various delusions like you can uh induce is it called like mirror basically like mirror agnosia where you don't no longer recognize yourself mirror self-agnosia or something where you no longer recognize yourself in a mirror like it's a really powerful tool but i have absolutely no idea how it works and so i'd be very kind of i think it's very tempting as kind of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3487.031,
    "end": 3490.512,
    "text": " modelers and theorists to kind of go into various experimentalist domains.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3490.592,
    "end": 3493.872,
    "text": "Like, hey, here's how my overarching framework explains your thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3496.953,
    "end": 3498.953,
    "text": "And I kind of want to resist that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3500.373,
    "end": 3506.674,
    "text": "I know a little bit about visual consciousness and how expectation, all that stuff works there, but hallucination is such a hairy topic.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3506.714,
    "end": 3507.275,
    "text": "I just don't know.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3507.295,
    "end": 3513.016,
    "text": "Yeah, I mean, I would also say, I mean, in the comments, there's a few different things that have been brought up here, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3513.056,
    "end": 3514.536,
    "text": "But, I mean, in terms of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3516.327,
    "end": 3536.203,
    "text": " It's not clear, for example, but the kind of auditory hallucination story that I was talking about earlier in terms of having relatively more precise prior expectations, creating a stronger tendency for auditory hallucinations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3536.963,
    "end": 3563.6,
    "text": " it's not it's not clear at all that that kind of story mechanistically is generalizes to other domains so i mean actually in the individual domain there's this whole other body of work where it looks like people that have delusions um again as part of the sort of as part of psychosis right um actually um show the opposite weighting in the visual system right so where they actually um assign um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3564.706,
    "end": 3569.788,
    "text": " too much precision to low-level bottom-up visual signals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3571.049,
    "end": 3589.817,
    "text": "So they end up, there's these interesting cases where they end up, if you look at eye tracking, they end up doing, people with delusions end up actually, or psychosis, schizophrenia, end up doing better at certain tasks than healthy people, but worse at others.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3590.417,
    "end": 3592.518,
    "text": "So like one example of this is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3593.331,
    "end": 3615.725,
    "text": " if you have people just kind of try to follow, just visual tracking, follow a kind of moving target, then if that target switches directions really quickly, then the people with psychosis end up actually following it better than healthy people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3616.965,
    "end": 3622.809,
    "text": "Because healthy people kind of continue to follow it for a little bit after the turn in the kind of predicted direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3623.767,
    "end": 3652.311,
    "text": " um right so prior expectations are kind of playing a stronger role um so they actually do a little better whereas if instead you have something where the um where the target temporarily kind of moves behind some kind of barrier um then healthy people do better whereas people with schizophrenia kind of you know lose it because prior expectations don't do enough um to keep them kind of following what the trajectory would have been right as it goes behind the visual occlusion and there's there's lots of other cases",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3653.098,
    "end": 3679.834,
    "text": " um for instance in like the proprioceptive domain where people have talked about the same kind of thing where people with um schizophrenia actually do um better like things like force matching illusions um and stuff or yeah um force matching tasks um um and i mean there's more to the the story there um but but um but people have tried to link that to like um delusions about agency um and things like that so but so just general point being that um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3680.509,
    "end": 3697.683,
    "text": " that the way that a computational mechanism looks like it happens in one, say, sensory domain can still operate very differently in the other sensory domain, even in the same disorder, in the context of the same psychosis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3698.844,
    "end": 3706.91,
    "text": "So these things don't necessarily, they shouldn't be expected to generalize across domains.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3708.118,
    "end": 3734.257,
    "text": " is um is one one point um the other the other point was um you know in relation to you know things like hypnosis which um i don't know a lot about um as part of a textbook chapter um i was uh asked to write a paragraph or two on hypnosis so i kind of looked into that literature a little bit um and it's actually pretty messy they're very different there are multiple different theories about hypnosis work",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3735.209,
    "end": 3753.099,
    "text": " Um, and I mean, one of them, you know, can relate to this idea that, um, that, um, you know, if, if the hypnotist repeatedly like give suggestions that are set up such that, um, they will be confirmed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3753.219,
    "end": 3753.419,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3753.439,
    "end": 3756.621,
    "text": "So it's like, hold out your, the hypnotist says, hold out your arms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3757.201,
    "end": 3760.443,
    "text": "And then he says, um, your arms are going to start to feel heavy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3760.981,
    "end": 3761.981,
    "text": " And then they'll start to fall.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3762.482,
    "end": 3762.702,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3763.042,
    "end": 3770.624,
    "text": "Obviously anybody who holds out their arms, they'll eventually start to feel heavy and they're heavier and they'll start to drop just as a result of your muscles, your shoulder muscles getting tired.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3771.225,
    "end": 3771.445,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3771.805,
    "end": 3784.009,
    "text": "So if you do a number of those things and the kind of, uh, Things the hypnotist, the predictions made by the hypnotist are confirmed, then, you know, it could be that you're just coming to assign a really high reliability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3784.696,
    "end": 3788.737,
    "text": " to whatever the hypnotist says, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3788.837,
    "end": 3804.4,
    "text": "So in that case, if the hypnotist just comes to be assigned really high precision, then you can just adjust prior expectations in a way that just kind of dominate or can end up having a much stronger influence on what you do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3805.54,
    "end": 3807.861,
    "text": "And that's kind of one idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3808.021,
    "end": 3812.862,
    "text": "But again, there's several other theories of hypnosis that just have to do with kind of conforming",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3813.826,
    "end": 3837.411,
    "text": " um kind of social roles and things like that that you're told to um that you're kind of told to do and i mean anyway so i wouldn't necessarily feel that confident um saying much about about how this relates to hypnosis other than that in a broad sense it can involve manipulating um sort of tricky ways of manipulating prior expectations and other in other people but again i mean even that is pretty speculative",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3838.635,
    "end": 3864.111,
    "text": " mean so if i could just quickly throw something in another complicating factor so even within visual the visual system having a strong prior in one domain or doesn't generalize to others there's this really great paper that just came that came out i think last year in cognition where they looked at representational momentum mooney images and um goodness i think there was one other i think it was illusory contours and they had one other",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3866.328,
    "end": 3868.569,
    "text": " top-down expectation kind of paradigm.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3869.289,
    "end": 3872.671,
    "text": "And there were large individual differences between all of them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3873.111,
    "end": 3879.233,
    "text": "And there were also large individual differences in kind of the effect of prior expectation across those different tasks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3881.254,
    "end": 3888.957,
    "text": "So I think there's just kind of a lot of complicating facts, like moving parts and a lot of this stuff that we have to deal with when we talk about these things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3890.578,
    "end": 3895.84,
    "text": "Okay, we're going to return to the stack and go to Dean, and then a question from the chat, and then Adam.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3897.896,
    "end": 3925.798,
    "text": " so i'll go back and be ambiguous um so when i was looking at your diagrams and one of the things that really i wanted to ask this question but we ran out of time last week um do you think we can say that if a person says i see this or i do not see that see this the or yes or no um can we can we apply an idea that there's a certain amount of acceptance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3926.644,
    "end": 3928.366,
    "text": " and a certain amount of letting go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3928.466,
    "end": 3933.891,
    "text": "And I, I kind of bundled that under we reconcile, or is it something completely different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3933.931,
    "end": 3944.4,
    "text": "I mean, how do you, how do you look at this now when a person's actually looking at something and going, okay, I do not see the box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3944.861,
    "end": 3947.002,
    "text": "Is it just, is it that simple?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3947.042,
    "end": 3947.983,
    "text": "That's a simple yes, no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3948.003,
    "end": 3949.845,
    "text": "Or do you think there's something more built into it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.147,
    "end": 3952.768,
    "text": "Um, so,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3956.572,
    "end": 3959.814,
    "text": " There is a whole cottage industry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3959.834,
    "end": 3966.437,
    "text": "I feel like cottage industry might even be an understatement on how to collect verbal reports and the proper ways of doing it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3966.497,
    "end": 3972.119,
    "text": "So there's like a perceptual awareness scale where you in some sense have a description of the content.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3972.139,
    "end": 3973.58,
    "text": "So you have, I didn't see anything.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3973.6,
    "end": 3977.281,
    "text": "I maybe saw something, but there was no specific content.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3977.381,
    "end": 3978.702,
    "text": "Like you have a vague feeling.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3979.102,
    "end": 3980.803,
    "text": "You saw something, but it was a bit blurry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3980.863,
    "end": 3982.624,
    "text": "And then you had like a full vivid experience.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3982.644,
    "end": 3983.284,
    "text": "That's one way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3983.604,
    "end": 3984.885,
    "text": "You can have people place bets.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3986.696,
    "end": 3989.277,
    "text": " Um, that's another way you can have people do confidence ratings.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3989.577,
    "end": 4012.243,
    "text": "Um, lately there's been some incredibly clever work basically looking at, so just give a shout out to people who I, whose work I really admire, like Hakuan Lau and, um, Megan Peters have a really great paper in eLife where they basically look, show that people seem to have optimal in the sense of like Bayes optimal introspective access to their own performance.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4012.923,
    "end": 4015.804,
    "text": "So basically when they are",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4017.677,
    "end": 4024.961,
    "text": " they will, people never behave correctly without kind of knowing that they behaved correctly as it were.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4025.201,
    "end": 4029.183,
    "text": "If you do these like very tightly controlled experimental situations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4031.244,
    "end": 4036.207,
    "text": "So yeah, I think maybe I was a bit flippant before when I said you have to take reports as foundational.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4036.267,
    "end": 4045.852,
    "text": "I stand by that statement, but there is like years and years and years of like careful psychophysics have gone into being like, yeah, these things are reliable.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4048.419,
    "end": 4064.211,
    "text": " And basically it comes down to, I wouldn't believe if someone said, yeah, I see something, but they were getting like 50% on a forced choice task about the orientation of a Gabor patch, but they were claiming they would see it, I just wouldn't believe them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4064.331,
    "end": 4068.954,
    "text": "Generally speaking, you would expect if you see something, your performance should also go up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4071.196,
    "end": 4073.958,
    "text": "That is not to say, however, that you can't have",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4075.598,
    "end": 4084.329,
    "text": " Um, for increased performance without awareness, there is some convincing evidence showing that those two things dissociate and that's kind of what we were trying to show here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4084.409,
    "end": 4084.549,
    "text": "Right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4085.05,
    "end": 4085.17,
    "text": "Right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4086.368,
    "end": 4087.549,
    "text": " So hopefully that answers the question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4088.11,
    "end": 4089.09,
    "text": "Yeah, it does.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4089.11,
    "end": 4089.37,
    "text": "Nice.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4089.751,
    "end": 4096.615,
    "text": "Yeah, I noticed on this extended taxonomy, the bottom right, it's like consistent prior, high attention, strong signal.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4096.675,
    "end": 4097.856,
    "text": "It's the perfect storm.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4098.096,
    "end": 4100.418,
    "text": "And then it's 100% seen, 100% correct.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4100.938,
    "end": 4107.282,
    "text": "And then again, kind of taking it loosely mapping to our experiences with other attention phenomena.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4108.237,
    "end": 4115.923,
    "text": " Like if you're sure about seeing, and of course, the way that you tuned prior or inconsistent prior, these are variables that are in the model.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4115.983,
    "end": 4116.904,
    "text": "So people can play around.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4116.944,
    "end": 4126.632,
    "text": "This isn't like a specific yes, no, but just examples of how rich the phase space is in terms of what the model can do and what it can capture.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4127.213,
    "end": 4130.195,
    "text": "So here's the question from the chat, and then it will go to Adam.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4130.275,
    "end": 4131.716,
    "text": "So the question from the chat is,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4132.657,
    "end": 4161.759,
    "text": " any thought about the possibility of using this model to investigate lucid dreaming related phenomena like the failure of implicit metacognition while dreaming thank you so how about dreaming or lucid dreaming so that stuff is super interesting i mean i don't think this model captures that at all except in like a very in like a computational sense like i don't know what task would be modeling specifically but like we can if we're being a bit metaphorical about it um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4163.854,
    "end": 4166.337,
    "text": " So presumably, I don't know anything about lucid dreaming.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4166.697,
    "end": 4178.028,
    "text": "I presume it's a case where basically you are dreaming, so you have kind of, you're not just asleep, you have kind of a experience that goes along with it, and also you are aware of the fact that you are dreaming.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4181.271,
    "end": 4182.413,
    "text": "That's really interesting.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4182.493,
    "end": 4184.535,
    "text": "I think it would have to come back to the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4187.91,
    "end": 4216.982,
    "text": " don't know how we one would capture metacognition in this framework i think that's one thing to say i don't know what it would be maybe ryan you have some thoughts on this but it would relate to basically how how one thinks about metacognition in these deep temporal models yeah i mean i mean i mean metacognition in and of itself comes in a bunch of different flavors right i mean so there's kind of you know beliefs about",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4218.871,
    "end": 4221.175,
    "text": " how good your memory is, for example, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4221.195,
    "end": 4223.097,
    "text": "It can be kind of metacognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4223.137,
    "end": 4231.029,
    "text": "It's, you know, it's like beliefs about your beliefs or beliefs about patterns in your attention or, you know, there's a bunch of, bunch of different types of,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4231.778,
    "end": 4233.198,
    "text": " metacognition, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4233.238,
    "end": 4238.8,
    "text": "It's just sort of beliefs or operations over representations of your own cognitive processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4239.561,
    "end": 4258.747,
    "text": "So I mean, the tricky part is that you kind of have to have a higher level that's treating what you chose to do in terms of a voluntary cognitive process that observes that and then infers something about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4260.626,
    "end": 4280.416,
    "text": " And the way that that ends up influencing the cognitive operation level below, the way that that higher metacognitive level ends up setting priors on the lower level, I'm not sure the right way to think about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4280.976,
    "end": 4290.221,
    "text": "I mean, you'd have to look at literature on the way metacognition affects performance on cognitive tasks, which I'm definitely not an expert on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4291.457,
    "end": 4297.044,
    "text": " One thing to say just very briefly would just be in the discussion section of our paper, we discussed alternative models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4297.825,
    "end": 4304.032,
    "text": "I think probably the model that's closest to ours in the literature would be Steve Fleming's higher-order state space model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4305.814,
    "end": 4306.134,
    "text": "And I think...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4307.352,
    "end": 4317.054,
    "text": " There he explicitly discusses ignition-related phenomena and kind of metacognitive inferences about the presence or absence of stimuli.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4317.134,
    "end": 4321.195,
    "text": "So I would say if you're interested in that kind of stuff and how to think about it in a Bayesian framework, look there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4321.215,
    "end": 4321.995,
    "text": "It's a really great paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4322.655,
    "end": 4331.577,
    "text": "Yeah, I mean, another one, I mean, that comes to mind, I know, is that there's a paper by where the first author is Klaus Stefan from 2016.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4333.946,
    "end": 4343.295,
    "text": " where he talks about the way you can apply active inference models to model homeostatic and allostatic control processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4343.775,
    "end": 4359.53,
    "text": "So basically like anticipating, for example, that your temperature is going to drop and therefore increasing temperature, body temperature a little in advance so that when it subsequently drops, you stay within a kind of survivable homeostatic range.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4360.949,
    "end": 4371.415,
    "text": " I'm just using temperature here as an arbitrary example of any kind of variable, internal bodily variable, like glucose levels or hormone levels or anything like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4372.556,
    "end": 4387.966,
    "text": "But they do talk about this level, a metacognitive level that you can add above the allostatic regulation level that more or less tracks the efficacy or the kind of success of the allostatic level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4389.561,
    "end": 4405.149,
    "text": " and how if the allostatic level repeatedly fails to keep homeostatic variables or keep bodily variables within homeostatic ranges, then the higher level can basically infer that allostasis will fail.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4406.47,
    "end": 4416.496,
    "text": "And they show how that can plausibly lead to certain sorts of symptoms of depression when you have low beliefs about the efficacy of your own allostatic processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4417.805,
    "end": 4426.11,
    "text": " So, I mean, that's a paper that I'd recommend looking at for one example of the way that you might apply one type of medical condition on top of the Bayesian.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4427.17,
    "end": 4430.212,
    "text": "I also just remembered a paper came out yesterday.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4430.532,
    "end": 4431.292,
    "text": "I shared it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4431.512,
    "end": 4432.233,
    "text": "Sorry, I forgot about this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4432.273,
    "end": 4432.793,
    "text": "I just shared it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4432.873,
    "end": 4434.794,
    "text": "I shared it on Twitter yesterday, if you want to look.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4435.294,
    "end": 4438.396,
    "text": "It came out of Mike Allen's group.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4438.816,
    "end": 4439.917,
    "text": "I've forgotten the first author's name.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4439.937,
    "end": 4440.777,
    "text": "I'm really sorry about that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4442.918,
    "end": 4443.119,
    "text": "But...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4444.782,
    "end": 4453.328,
    "text": " uh, they explicitly discuss like predictive processing and active inference theories of consciousness in relation to interoception and metacognition.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4453.528,
    "end": 4455.51,
    "text": "And they have a whole discussion of this type of thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4455.53,
    "end": 4461.334,
    "text": "So if you're interested, maybe just like check my Twitter page or at Mike Allen's Twitter page.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4461.354,
    "end": 4463.716,
    "text": "Sounds good.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4464.376,
    "end": 4467.478,
    "text": "Um, we'll go to Adam and then anyone else who raises their hand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4467.498,
    "end": 4472.022,
    "text": "Hi.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4472.422,
    "end": 4472.522,
    "text": "Um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4474.07,
    "end": 4476.091,
    "text": " perhaps tying a few of these things together.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4476.111,
    "end": 4501.987,
    "text": "I was wondering, with respect to hallucinations and psychosis and forms of delusions, if maybe some of it, you could potentially model it in terms of not having access to mental acts, which might have associated efforts copies that could potentially be adjusting precision",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4502.816,
    "end": 4509.261,
    "text": " and are also having, uh, different components of the associated mental act, which you may or may not attribute to you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4509.301,
    "end": 4531.098,
    "text": "Like some, so like aspects of interoceptive inference that could lead to senses of like willing or ownership, but then by not having access to this potentially where, where the access itself, uh, of the action generation could, um, basically adjust what you're, how you're attributing, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4533.644,
    "end": 4562.318,
    "text": " what sense you're making of the associated perceptual uh events so it's like um how do i say this so it's like if you're uh talking to yourself in thought or something like like thought is in your speech like ragotsky uh let's talk about like well if you don't have access to like the generation part on for some reason i don't know how much it can be separated but then like the voice might just like appear to you in a way where you don't have a sense of ownership if there's not like the right type of like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4562.93,
    "end": 4569.233,
    "text": " maybe interoceptive coupling to the generation process, or just like a lack of metacognition to contextualize it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4571.435,
    "end": 4572.935,
    "text": "Yeah, I really like this idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4573.015,
    "end": 4583.361,
    "text": "I mean, one thing to keep in mind here is that, you know, the sort of thing that you're talking about when people have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4584.104,
    "end": 4589.288,
    "text": " sort of different experiences of, or where there are different contents and experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4589.368,
    "end": 4590.729,
    "text": "I mean, basically that's what you're talking about, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4590.749,
    "end": 4593.41,
    "text": "Different contents that can be an experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4594.031,
    "end": 4602.677,
    "text": "Those, those are just in a model like this going to amount to different sorts of state spaces that you can infer posteriors over, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4603.297,
    "end": 4612.724,
    "text": "So, you know, you can have beliefs about how much ownership you have over your body, or you can have beliefs about something going on in your body interoceptively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4613.345,
    "end": 4622.211,
    "text": " And all of those things are just going to be, you're going to have some sort of afferent signal and you're going to have some prior expectations, obviously.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4622.231,
    "end": 4627.375,
    "text": "And then you're going to infer some posterior over whatever the contents are of the thing in question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4628.115,
    "end": 4628.696,
    "text": "Right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4628.716,
    "end": 4642.385,
    "text": "So, so anything along the lines of what is the, what is the content of one thing versus another is just going to amount to a particular level in a model that infers posteriors over particular contents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4643.346,
    "end": 4658.52,
    "text": " So none of that is going to have to do directly with our model, other than the fact that given posteriors over any content, if our model were applicable to that, you could just treat those contents as the lower level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4659.401,
    "end": 4668.449,
    "text": "So you'd have inference over some content, and then our model would say something about the processes that make that content conscious or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4669.41,
    "end": 4671.29,
    "text": " or consciously accessible or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4672.411,
    "end": 4695.314,
    "text": "So the only thing that our model might be able to say is if you swap out the squares versus lines in our model, whatever the beliefs are at the lower level, if you swap that out with representations of some other content, whatever it is you're interested in, something about the body or something about what sequence of speech",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4699.031,
    "end": 4701.853,
    "text": " that you're hearing or anything like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4702.353,
    "end": 4703.674,
    "text": "What word you just heard.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4703.694,
    "end": 4714.381,
    "text": "Swap that out as the content of the lower level and our model might be able to say something about the processes that determine whether those contents become accessible or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4714.941,
    "end": 4717.243,
    "text": "But beyond that, our model doesn't have much to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4718.584,
    "end": 4720.745,
    "text": " Yeah, I mean, if I could say something on that as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4721.465,
    "end": 4730.27,
    "text": "I really like the idea, I think, just along similar lines to Ryan, because it just casts decisions about ownership as just having access to some content or another.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4730.37,
    "end": 4747.779,
    "text": "And so for me, the essence of any type of conscious access or awareness process is basically whether it's integrated into this temporally deep representation, and in doing so, available to all of these sub-processes a la global workspace theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4749.059,
    "end": 4767.143,
    "text": " And so I think this kind of relating this to kind of the metacognitive point, I think this is actually a spot where maybe this is a difference between our theory versus an active inference theory that gave an explicit role for metacognition.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4769.743,
    "end": 4777.445,
    "text": "So for me, it's just the fact that you can be aware that it is, you're aware of it because it's integrated into this representation, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4778.443,
    "end": 4786.185,
    "text": " Whereas maybe a higher order person would be, no, you have to also infer that you are seeing it or that I am seeing it or something like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4789.346,
    "end": 4795.848,
    "text": "And so I think there's actually like really interesting empirical questions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4795.888,
    "end": 4797.429,
    "text": "That's all I can say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4798.709,
    "end": 4805.611,
    "text": "But I hope that we can kind of, I don't know, maybe it would be nice to see a discussion of kind of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4806.741,
    "end": 4812.484,
    "text": " active inference theories of visual awareness of metacognition versus active inference theories of like visual awareness in general.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4813.184,
    "end": 4813.364,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4813.444,
    "end": 4816.666,
    "text": "I don't know if you, I know you've written a lot about kind of different theories of consciousness, Adam.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4816.706,
    "end": 4817.986,
    "text": "So I don't know if you have any thoughts about that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4821.788,
    "end": 4829.992,
    "text": "I mean, I know that, um, you know, there's this preprint, um, by, um, the first, the first author is, um, is Smith Lars.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4831.513,
    "end": 4835.895,
    "text": "Um, well, I can't remember, uh, uh, his first, the rest of his first name, but,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4836.36,
    "end": 4846.645,
    "text": " but his last name is Smith, that does propose a type of model of metacognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4846.905,
    "end": 4857.17,
    "text": "In theirs, attention works a little differently than in ours, but essentially you do have a second level that controls a precision parameter on the first level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4857.651,
    "end": 4864.094,
    "text": "And then there's a third level in there that confers things about control of,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4864.98,
    "end": 4868.823,
    "text": " the control of the temperature parameter at the first level, if I'm remembering right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4869.544,
    "end": 4878.812,
    "text": "And they use it as a way of, the way they talk about it as a way to think of meditation and mindfulness and things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4879.812,
    "end": 4887.939,
    "text": "I don't remember it in enough detail to say a lot about my specific feelings on that, but that is an example that I'm aware of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4888.26,
    "end": 4893.024,
    "text": "Again, it's just a preprint at this point, but of another attempt to try to model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4894.085,
    "end": 4895.305,
    "text": " something like metacognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4898.186,
    "end": 4898.486,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4899.346,
    "end": 4900.126,
    "text": "Interesting questions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4900.226,
    "end": 4901.386,
    "text": "Adam, did you want to say something else?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4901.546,
    "end": 4903.147,
    "text": "Yep, go ahead.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4903.507,
    "end": 4908.087,
    "text": "Yeah, so I basically want to throw your model at everything.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4909.728,
    "end": 4923.27,
    "text": "But in terms of metacognition and what I've worked on in the past, mostly I've been focusing on trying to cross-reference various theories to see the points of overlap and non-overlap, mostly considering",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4924.048,
    "end": 4951.033,
    "text": " accounts of dynamic modularity that might apply to a global neural workspace architecture or like integrate information theory where you can think of their complexes of integration those modules as themselves being like do an iit handling of those and seeing like where's the overlap basically trying to give semantic content to iit um via like gnwt is like an architecture for bayesian model selection and the whole thing kind of being adjudicated by free energy principle and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4951.966,
    "end": 4955.929,
    "text": " mostly an active inference, not nearly in the technical depth that you have.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4956.549,
    "end": 4964.435,
    "text": "I'm only beginning to move into things like metacognition and, uh, like higher order forms of consciousness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4965.156,
    "end": 4969.019,
    "text": "And the ideas are like really, uh, speculative.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4969.039,
    "end": 4981.208,
    "text": "Like, so like one idea is that like, as you're like, um, let's say, um, imagining like enacting something, you might start out from like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4982.074,
    "end": 4986.037,
    "text": " generating like experience from an egocentric perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4986.838,
    "end": 5001.349,
    "text": "But then this enactment would auto associatively also have third person allocentric representations, like from like the ventral visual stream or something like this, where like you've seen people or yourself doing similar things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5001.409,
    "end": 5011.697,
    "text": "And so you might then like be able to get access to in the mind's eye, this like third person point of view on you with some unfolding, like some sort of like moving back and forth between",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5012.504,
    "end": 5027.197,
    "text": " In the models I'm working with, phenomenal consciousness and accessible consciousness, there's a sense in a Rudroff projective geometric modeling, it's always from this first-person, egocentric point of view.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5027.237,
    "end": 5035.784,
    "text": "But then the idea is you then are looking at an objectified you, and this would be part of metacognitive awareness and contextualizing you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5036.676,
    "end": 5044.238,
    "text": " in terms of like you doing actions and then this third person little homunculus doing actions that you're seeing in your mind's eye and moving back and forth.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5044.839,
    "end": 5047.279,
    "text": "That's like the basic space I'm moving into.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5047.319,
    "end": 5050.28,
    "text": "I don't know how much of that's going to work or how you would model that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5050.3,
    "end": 5065.645,
    "text": "I mean, like one thing, just kind of... Kind of, I mean, again, just to, I mean, when you think about this kind of in formal terms, right, then if you're in some sense, if you're",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5067.151,
    "end": 5091.771,
    "text": " the content you're describing as a belief that you are doing something right um so that's just the content in the space space right so same kind of thing right swap out our lower level with a state space that is beliefs about what i am doing right then it's just the same thing right you have a representation about what you are doing and in our model you would either um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5093.476,
    "end": 5100.745,
    "text": " you would either gain access to the representation of that content or not via its integration with this deeper temporal level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5102.047,
    "end": 5106.893,
    "text": "Granted, beliefs about what I am doing or not is already",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5107.426,
    "end": 5131.669,
    "text": " right pretty pretty temporally deep um but were those sorts of contents to apply to our model and that's what it would say it would say that those contents need to be integrated with this deeper temporal uh model that is able to form posteriors over something that incorporates that um and uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5132.389,
    "end": 5151.456,
    "text": " So again, I mean, at the end of the day, it really just comes down to this distinction about the content being represented and whether or not the posteriors associated with that content get integrated with the higher level, the sorts of things that the higher level described here can do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5153.379,
    "end": 5170.088,
    "text": " So, so it's just a question about whether something like that is the content that you want to be, uh, using in a goal-directed way or reporting, um, or, or, or whether just, uh, just representations of the, of the lower level kind of visual content.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5170.569,
    "end": 5170.809,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5170.969,
    "end": 5174.511,
    "text": "And that being integrated with this level is, is what's, is what's involved.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5174.531,
    "end": 5179.934,
    "text": "So to me, again, this just has to do with different levels of representation and what the contents are that you're becoming conscious of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5180.875,
    "end": 5181.595,
    "text": "Um, so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5182.105,
    "end": 5186.587,
    "text": " Oh, and by the way, just to mention, I looked up the paper I was mentioning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5187.527,
    "end": 5202.653,
    "text": "So it's called Towards the Formal Neurophenomenology of Metacognition, and the first author is Lars Sandberg-Smith, just to do justice to remembering who the first author's full name was in the name of the paper I was talking about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5203.974,
    "end": 5206.435,
    "text": "Sorry, I think you started saying something at the same time, Chris.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5207.315,
    "end": 5208.856,
    "text": "Yeah, Christopher, then Adam.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5211.401,
    "end": 5220.15,
    "text": " I was going to change the topic very slightly, but I was wondering, so how you think about phenomenology or phenomenal consciousness?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5220.17,
    "end": 5224.834,
    "text": "Because to me, it comes down to the nature of the representation that you're gaining access to.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5224.914,
    "end": 5230.059,
    "text": "So to talk about, like, you talked about the projective consciousness model, which is really cool work.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5230.559,
    "end": 5233.562,
    "text": "There, this perspectival nature of consciousness comes from",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5234.52,
    "end": 5242.527,
    "text": " the structure of the generative model and the fact that they're using this projective geometry and that's built into the structure of the generative model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5244.068,
    "end": 5259.161,
    "text": "I'm just curious about how you think about this and how that kind of maps on to IIT, because at least as I understand IIT, like phenomenal consciousness is kind of a... It's never really been clear how the content of consciousness fits into IIT for me.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5259.522,
    "end": 5259.962,
    "text": "Like it's all...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5262.444,
    "end": 5267.908,
    "text": " Anyway, yeah, I'm just interested to hear your thoughts on how it all fits together with global workspace theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5272.651,
    "end": 5275.253,
    "text": "I would say there's some kind of giant bag questions in IET.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5276.334,
    "end": 5287.562,
    "text": "I think, though, it's not nothing that they start from axioms of what they think should be part of phenomenology and then work their way to this sort of way of handling systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5288.069,
    "end": 5292.913,
    "text": " In terms of, I think it's a decent prior for like what we should look for in like physical substrates.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5293.953,
    "end": 5317.17,
    "text": "I wouldn't like completely like throw it off, but they then would say, if you have these axioms that characterize experience, intrinsic existence, composition, information, integration, exclusion, if you have these different properties, then it is sufficient to bring about phenomenality because they started from phenomenality.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5317.635,
    "end": 5319.856,
    "text": " Oh no, I don't think that follows at all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5320.357,
    "end": 5328.361,
    "text": "That being said, I think it does potentially like give us some priors in trying to think about physical and computational substrates of consciousness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5328.381,
    "end": 5329.942,
    "text": "So that would be like the cross-referencing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5330.522,
    "end": 5346.171,
    "text": "And then the other part would be like, how do you think, so if you're thinking of global neuronal workspace as like potentially like a trading off of modularity as being part of the physical implementation, well then the question is like, so when do you have like larger big modules functioning as like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5346.701,
    "end": 5348.182,
    "text": " dynamic cores or workspaces?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5348.662,
    "end": 5351.844,
    "text": "And when do you have more fragmented local processing?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5351.924,
    "end": 5361.549,
    "text": "In theory, you could get Bayesian model selection with discrete updating with a bunch of small beta complexes close to the modalities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5362.109,
    "end": 5368.672,
    "text": "Or it could be this big sprawling alpha complex that's multimodal in all these different ways.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5368.932,
    "end": 5372.534,
    "text": "But then you're moving back and forth between these degrees of synchrony.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5372.554,
    "end": 5375.636,
    "text": "It seems like IIT could potentially be useful there for",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5376.482,
    "end": 5377.222,
    "text": " describing that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5377.242,
    "end": 5379.744,
    "text": "So that was one of the ideas of that interrelation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5381.265,
    "end": 5399.876,
    "text": "In terms of bringing it to Rudroff, for me, the object I would want that would be potentially a minimal condition for phenomenality would be some sort of joint distribution over your body pose and visuospatial awareness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5401.897,
    "end": 5414.066,
    "text": " as like the minimal thing for me, at least for human like consciousness and like a series of, um, basically roughly at alpha frequencies, a series of estimates of that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5415.828,
    "end": 5424.454,
    "text": "And, and, and then, and thinking of this as iterative Bayesian model selection via a global workspace architecture, but not necessarily one where there's like access.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5425.055,
    "end": 5430.799,
    "text": "That's like a more sophisticated kind of consciousness in terms of you wouldn't necessarily, I would call it like it's pretty darn global.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5431.155,
    "end": 5438.8,
    "text": " You have something like spanning all the posterior cortex, but it's not the kind of workspace you're dealing with where you're actually having knowledge and access.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5441.422,
    "end": 5442.742,
    "text": "Thanks, Adam.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5443.583,
    "end": 5446.285,
    "text": "So if anyone else wants to, they can raise their hand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5446.425,
    "end": 5449.467,
    "text": "Otherwise, I think there was a very good request.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5450.568,
    "end": 5452.769,
    "text": "You did just ask one, so let's mix it up.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5452.909,
    "end": 5458.373,
    "text": "But there was a very good request, actually, if Ryan or Christopher, you could just...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5459.193,
    "end": 5473.574,
    "text": " look at this part of the figure which i know is a structure we walk through in the model stream as well and just kind of map some of these bigger ideas that we've been talking about to some of the letters just in a way where people can now look at this",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5474.275,
    "end": 5492.765,
    "text": " outline, say, okay, the experiment, I'm kind of on the page, we talked about a bunch of visual and interoceptive kinds of experiments, just where did it map in this paper, so that people will always be able to go back to this paper, look at the code, and then kind of map some of these bigger metaphors to the experiment that you did here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5492.785,
    "end": 5497.727,
    "text": "Do you want to take this Ryan?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5497.807,
    "end": 5500.089,
    "text": "Either way, it doesn't matter to me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5506.854,
    "end": 5510.257,
    "text": " So how detailed would you like me to go?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5510.277,
    "end": 5515.901,
    "text": "Would you like me to explain what the little square, what the D's and A's and B's and S's are and all that stuff?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5515.941,
    "end": 5519.203,
    "text": "Let's go for all the letters on the right side and maybe even some on the left.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5519.464,
    "end": 5521.965,
    "text": "All right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5522.366,
    "end": 5527.59,
    "text": "So this is a partially observable Markov decision process and it's a hierarchical one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5530.535,
    "end": 5535.558,
    "text": " So let's just focus on essentially, let's start at the bottom.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5536.819,
    "end": 5542.882,
    "text": "O's are observations and S's are hidden or latent states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5543.362,
    "end": 5548.045,
    "text": "And what the A matrix does is it provides a mapping between those two things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5548.305,
    "end": 5558.851,
    "text": "So the circles are random variables and the squares are essentially functions, in this case, probability distributions that map between those two things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5559.831,
    "end": 5575.117,
    "text": " The A and little arrow going down just says that that's essentially A with that little A superimposed on arrow is basically saying that's expressing a conditional probability distribution saying that O, observations, depends upon the hidden state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5576.557,
    "end": 5583.94,
    "text": "Now, as we start to evolve through time, we need transitions between discrete hidden latent states in the world.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5584.975,
    "end": 5596.198,
    "text": " And those are what's described by B. So this is something like, what is the probability that at time one, what's the probability of each hidden state at the next time step?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5597.638,
    "end": 5601.899,
    "text": "And it will describe kind of S at T conditioned on S at T minus one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5603.9,
    "end": 5611.222,
    "text": "Now, then what's special about the hierarchical models is that you have another layer on top of that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5613.271,
    "end": 5621.017,
    "text": " where hidden states at the first level are now being treated as observations by the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5622.506,
    "end": 5647.826,
    "text": " so the posterior probability at the first level is basically acts as an observation um for the second level a matrix um and then kind of at the second level there should be a d at the first level too but that's fine um basically what this prior what this second level hidden state does is it provides a prior over that first level",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5649.271,
    "end": 5658.714,
    "text": " And then at the first level, you can then have, basically, we just have one time step at the first level, but you can have any amount of time steps as you want.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5659.254,
    "end": 5667.497,
    "text": "So if you imagine the metaphor that's often used is like the minute versus the hour clock on the hand, they're evolving at different time scales.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5668.617,
    "end": 5676.1,
    "text": "So you could, in this diagram, we show that the second level evolves at two time steps for every one time step at the first level, at the second level, sorry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5678.616,
    "end": 5685.181,
    "text": " At the second level, there are again transitions between these latent states, and that's also where we have policy selections.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5685.281,
    "end": 5686.482,
    "text": "That's why we put it up there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5687.062,
    "end": 5696.029,
    "text": "So policy selection is essentially, if you imagine a whole series of hidden Markov models, this is my favorite way of describing policy selection.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5696.089,
    "end": 5702.093,
    "text": "So these hidden Markov models are basically just a partially observable Markov decision process without the decision aspect.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5703.234,
    "end": 5705.456,
    "text": "If you imagine a whole series of basically these graphs,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5706.79,
    "end": 5710.311,
    "text": " and you are deciding what graph kind of is gonna be my future.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5711.352,
    "end": 5714.693,
    "text": "You are trying to find the graph with the highest model evidence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5716.874,
    "end": 5720.155,
    "text": "That is what computing, doing policy selection does.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5720.895,
    "end": 5727.618,
    "text": "So you are choosing the transitions that will take you to basically the graphs with the highest model evidence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5730.819,
    "end": 5734.18,
    "text": "I know that, Ryan, you wanna kind of clean up some of that explanation?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5734.574,
    "end": 5735.494,
    "text": " We're at the shoulders.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5736.194,
    "end": 5739.395,
    "text": "Let's go to the last few variables.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5740.235,
    "end": 5740.735,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5740.816,
    "end": 5744.656,
    "text": "So, I mean, you didn't do G and C and E, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5744.856,
    "end": 5745.417,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5746.017,
    "end": 5746.457,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5746.617,
    "end": 5747.637,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5747.657,
    "end": 5752.718,
    "text": "So, pi, just like Chris said, right, is just your distribution over policies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5753.859,
    "end": 5756.959,
    "text": "G is the expected free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5757.88,
    "end": 5759.36,
    "text": "So, that's essentially the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5760.063,
    "end": 5764.845,
    "text": " the function that decides what the value is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5764.885,
    "end": 5766.985,
    "text": "You can think about it about each policy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5767.666,
    "end": 5780.29,
    "text": "And that is with respect to C, which is your preference distribution, which is essentially the thing that specifies which observations you want and which observations you don't.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5781.71,
    "end": 5788.833,
    "text": "Now, somehow I see that an E has been placed with an arrow down to G, and that's not correct.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5789.819,
    "end": 5794.163,
    "text": " Um, he should be, he should be going, you should be going straight to pie.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5794.183,
    "end": 5803.37,
    "text": "Um, um, if you're going to include E, um, I don't think we did anything with E in our model, so I don't think he needs to be there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5804.133,
    "end": 5813.016,
    "text": " Um, but, um, but E if it's used is just a kind of separate prior over policies that can encode something like habits.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5813.856,
    "end": 5822.88,
    "text": "Um, so it competes with the expected free energy G over policies, um, to infer what, uh, when you're inferring what the posterior over policies is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5823.82,
    "end": 5829.642,
    "text": "Um, so, uh, so yeah, I mean, otherwise I feel like Chris, uh, I feel like Chris described it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5830.642,
    "end": 5832.323,
    "text": "Well, I mean, you know, it'd be a little.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5832.671,
    "end": 5840.235,
    "text": " It's always a little easier if you have like a, you know, if you're in control of the pointers, you can actually point to the things that you're talking about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5841.676,
    "end": 5845.138,
    "text": "I think you also asked us to relate this to an experimental paradigm.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5845.238,
    "end": 5851.162,
    "text": "So if we maybe briefly click down to figure two, what you've labeled as figure two there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5851.522,
    "end": 5852.423,
    "text": "So we can just look at that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5852.483,
    "end": 5855.985,
    "text": "So the idea here is that there was a forwards mask.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5857.862,
    "end": 5862.586,
    "text": " Um, at the beginning of the paradigm, this was just a series of lines and there were these kind of stimuli on the outside.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5863.367,
    "end": 5875.056,
    "text": "At the second time step in the task that, or in our like simulated task, they, on some trials, the square kind of was self organized, some of the lines kind of self organized into a square.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5876.037,
    "end": 5879.8,
    "text": "So I either in our discrete state space model, a square was present or it wasn't.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5881.142,
    "end": 5883.904,
    "text": "And in the third time step, it was just replaced by more lines.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5884.659,
    "end": 5888.92,
    "text": " And then afterwards we ask the agent to construct a report of that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5889.74,
    "end": 5900.302,
    "text": "So basically at, you can think of the first level of the model as being all of the features of the stimulus and also the location of attention.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5900.902,
    "end": 5907.104,
    "text": "So this might be something like saliency maps in posterior parietal cortex, which are directing wherever attention's being pointed to.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5907.124,
    "end": 5913.525,
    "text": "And then you might have the features of the stimulus, which are represented in various places.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5914.761,
    "end": 5920.145,
    "text": " At the second level, we now have our, this is basically our frontoparietal cortices.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5921.306,
    "end": 5926.21,
    "text": "This is tracking the evolution of states at the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5926.29,
    "end": 5931.074,
    "text": "So it's tracking that at the first time step, there was lines presented.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5931.114,
    "end": 5934.457,
    "text": "At the second time step, there was a square presented.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5934.537,
    "end": 5936.539,
    "text": "Maybe it, maybe it wasn't, maybe it was presented, maybe it wasn't.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5936.939,
    "end": 5938.761,
    "text": "And at the third time step, there was more lines.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5939.061,
    "end": 5942.824,
    "text": "And you can imagine in like a real task, all of that unfolds in a space of about a second.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5945.509,
    "end": 5955.217,
    "text": " Yeah, so you can think about it, I mean, like, yeah, the second level is really the content in question that it's inferring is the sequence, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5955.257,
    "end": 5960.701,
    "text": "It's not whether it's square, it's whether it was lines, square lines, or just lines, lines, lines.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5962.603,
    "end": 5964.384,
    "text": "And so... Sorry, go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5966.062,
    "end": 5971.668,
    "text": " Oh, and so if you're thinking about where experience lives, obviously we don't experience a sequence, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5972.249,
    "end": 5976.213,
    "text": "I think, and I think Ryan and I have been chatting about this a lot lately because it relates to work we're currently doing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5976.713,
    "end": 5982.599,
    "text": "But I think what's going on is that what we experience are essentially like the updates to our second level beliefs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5983.547,
    "end": 5984.889,
    "text": " And that's really crucial.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5985.67,
    "end": 5995.18,
    "text": "So the reason why it's crucial is because we know empirically that kind of what could be, we might describe as brain processes that are at the first level of the model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5995.601,
    "end": 5996.842,
    "text": "These can be either conscious or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6001.723,
    "end": 6008.348,
    "text": " And contents that are conscious, when you are conscious of something, it has all these really important functional consequences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6008.748,
    "end": 6013.231,
    "text": "So here it might be kind of being able to see it for report, maintain it for report.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6013.411,
    "end": 6019.775,
    "text": "But also if I see something, I can then voluntarily maintain it in memory for as long as I want, as long as I don't get distracted.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6020.396,
    "end": 6022.497,
    "text": "Like there are limits on like human psychology.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6025.219,
    "end": 6029.302,
    "text": "But that's kind of a really important function that's enabled by being conscious of something.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6031.26,
    "end": 6035.003,
    "text": " And that allows us to do things like construct reports of our experience.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6035.484,
    "end": 6038.366,
    "text": "Or even, I think by report, I just mean something very general.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6038.786,
    "end": 6046.093,
    "text": "It could be in this model, we kind of have the toy thing of being able to put a sentence together, but it could also be more empirically real.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6046.613,
    "end": 6053.099,
    "text": "In terms of empirical paradigm, it'll just be like hitting a button or doing a confidence interval or something like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6056.786,
    "end": 6057.066,
    "text": " Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6057.587,
    "end": 6058.208,
    "text": "Thank you for that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6058.829,
    "end": 6059.529,
    "text": "Interesting answer.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6059.95,
    "end": 6069.482,
    "text": "We'll have Steven and then Adam and then anyone else who wants to raise their hand and also any last questions from the live chat as we kind of slowly land the plane.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6072.998,
    "end": 6088.396,
    "text": " Yeah, I was just going to ask, in relation to those lines and the way that the square appears, like you said, so this is actually like a graphic representation, but when someone looks at it, there's probably some special device that you've got that represents this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6088.477,
    "end": 6088.997,
    "text": "Is it like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6089.838,
    "end": 6119.148,
    "text": " that the lines rotate and at some point it just happens they rotate such that they line up and then they un-rotate or and just one other question is why didn't you use negative space like you like say they line up to make you know like a negative space square i just wondered whether that relates to the choice of how it pops in and out of perceptual con sorry phenomenological awareness phenomenological consciousness or access consciousness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6121.621,
    "end": 6134.751,
    "text": " So basically this is just a very, in our model, we have discrete hidden states, which are categorical distributions, which are lines or squares and external states, which are red.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6135.131,
    "end": 6141.096,
    "text": "And so this is kind of just a graphical representation of a way to think about that, but it's really nothing to do with how it works mathematically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6143.938,
    "end": 6146.34,
    "text": "Then in terms of actually the empirical task,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6147.113,
    "end": 6158.181,
    "text": " Like this is a task that we basically like borrowed from Michael Pitts, who's a really done a lot, he's a cognitive neuroscientist, done a lot of really important work in the area of visual consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6160.462,
    "end": 6167.387,
    "text": "And as to why they chose to kind of have these, I guess the, I think from memory, there are videos attached to this paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6167.708,
    "end": 6176.634,
    "text": "From memory, I think the lines is kind of, they jitter around and then occasionally a subset of them will all line up into a square and then go back to like jittering.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6179.407,
    "end": 6184.228,
    "text": " As to why they did that versus other methods, I don't know, really.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6184.749,
    "end": 6190.531,
    "text": "There definitely are subtle things you can do to a stimulus which have major impacts on whether you have conscious access to it or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6190.751,
    "end": 6194.553,
    "text": "But the phenomenon of inattentional blindness is super general.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6194.593,
    "end": 6197.254,
    "text": "You can have people... So the really famous example is...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6198.632,
    "end": 6205.755,
    "text": " that everyone gets shown in undergrad psych is you're tracking whether a group of people playing basketball.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6205.815,
    "end": 6210.396,
    "text": "And you ask, how many times does someone with a white shirt get past a ball or something like that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6211.117,
    "end": 6223.521,
    "text": "And your attention is distracted and so consumed with that that a bear or a gorilla can walk into the middle of the screen, be in the dead center of your phobia, wave at you, and then walk away.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6224.082,
    "end": 6226.943,
    "text": "And then about 50% of people don't see it at all.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6227.987,
    "end": 6233.092,
    "text": " And that's really well replicated across a bunch of, or they don't report seeing it, I think I should say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6233.192,
    "end": 6237.376,
    "text": "I think there's some debate about whether this is a memory phenomenon or any of that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6237.436,
    "end": 6238.417,
    "text": "There's lots of subtleties there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6239.999,
    "end": 6241.02,
    "text": "So hopefully that answers the question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6242.677,
    "end": 6255.463,
    "text": " Also one advantage and one rationale for these pure modeling papers that we're discussing today is the space of the possible human experiments or even any other kind of real world experiments is very limited.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6255.843,
    "end": 6259.885,
    "text": "It's very limited what you can actually have a real set of humans do.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6260.505,
    "end": 6269.21,
    "text": "And so it's great to have tools that help us explore some of the patterns that we're looking for and understand how variability and",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6269.71,
    "end": 6279.516,
    "text": " do statistical calculations like how many participants might we need of a given variability range if we want to capture such and such an effect without distorting it this way.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6280.037,
    "end": 6281.237,
    "text": "That's critical information.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6281.457,
    "end": 6288.522,
    "text": "And if you don't have the model, then the experimental design phase is totally blind and it's very shot in the dark.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6289.082,
    "end": 6295.987,
    "text": "And so this helps inform structures for even thinking about how to design human experiments, for example,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6296.787,
    "end": 6300.61,
    "text": " as we're talking about here with visual awareness, but it could be for other kinds of experiments.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6301.131,
    "end": 6304.333,
    "text": "So, Adam, and then anyone else who wants to make a comment.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6305.874,
    "end": 6306.535,
    "text": "See you later, Alex.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6306.635,
    "end": 6306.855,
    "text": "Bye.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6307.356,
    "end": 6307.556,
    "text": "Adam?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6309.277,
    "end": 6309.898,
    "text": "Hi.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6310.558,
    "end": 6318.605,
    "text": "I'd be curious in knowing more of your thoughts on the potential, I guess, richness or lack thereof of experience.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6318.645,
    "end": 6324.089,
    "text": "So, at one point, could consciousness be phenomenal or access",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6324.961,
    "end": 6354.231,
    "text": " more experienced as a series of snapshots that are like static sequential but we don't know it like a flip book or is it more like a continuous stream like if you're getting this discrete updating are these updates over like like the agent in like motion like if you take like a camera sometimes in your phone there's like a little brief like forward ahead like look ahead and back but like what would be the nature of these uh discrete updates i yeah i i",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6355.014,
    "end": 6365.041,
    "text": " I mean, I know the, like, I'm trying to remember, I know, and I remember reading Stan DeHaan's book a few years ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6365.742,
    "end": 6377.67,
    "text": "And there is, there is some work, I think, showing, you know, there are kind of, there's like a minimal time for like, essentially updates to the, to the content of consciousness that have some kind of discrete character to them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6377.71,
    "end": 6379.792,
    "text": "I don't, I don't remember what the-",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6382.054,
    "end": 6406.265,
    "text": " yeah do you know what that do you remember the actual like milliseconds i can't remember like 50 milliseconds or something like that yeah i don't i don't remember offhand but there is there is something you know like that that maybe might be you know like similar to like a refresh rate or something like that um but i yeah i don't remember too much about that offhand um but but i mean one thing you know one thing to say is that um you know because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6406.987,
    "end": 6412.449,
    "text": " there are these sorts of discrete updates in our model, but I mean, it's also good to remember that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6413.291,
    "end": 6419.275,
    "text": " the higher level representation is specifically about this sequence, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6419.535,
    "end": 6429.481,
    "text": "Which is integrated in a sense that the hypothesis is about a whole sequence that doesn't necessarily need to be thought about as having sort of discrete chunks to it, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6429.561,
    "end": 6435.585,
    "text": "It's just a single hypothesis about what the whole sequence was.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6436.125,
    "end": 6438.006,
    "text": "And so you might think about that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6438.106,
    "end": 6439.507,
    "text": "As having a more kind of continuous",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6440.117,
    "end": 6466.295,
    "text": " character to it despite the fact that it's it is updated in some ultimately discreet fashion you know and kind of just really fast bins um you can think about it that way um but uh but in terms of richness i mean to me i mean i just think of i i just tend to think of rich as meaning there are more precise features right there's more features and they're more precise",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6467.194,
    "end": 6488.574,
    "text": " um at the at the lower level right so instead of just you know a lines or a square right at our you know in our example um there could be a ton of different lower level representations about color and shape and size and you know all these sorts of things um but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6489.306,
    "end": 6493.647,
    "text": " are represented in some sort of joint way, right, and become accessible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6494.387,
    "end": 6504.969,
    "text": "And so, I mean, that's one way to think about richness is just what are all the things being represented that become accessible together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6506.989,
    "end": 6509.03,
    "text": "But I don't know, do you have something else to say?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6509.05,
    "end": 6512.05,
    "text": "Can I ask a question actually there about the continuous modeling?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6512.65,
    "end": 6516.391,
    "text": "Is it possible that active inference could have a continuous mode?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6517.413,
    "end": 6526.216,
    "text": " Um, I know that it would get rid of a lot of the discrete benefits and the sequential message passing or maybe other heuristics, but could there be a continuous format, continuous time or space?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6527.356,
    "end": 6527.536,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6527.556,
    "end": 6531.857,
    "text": "There are continuous state space models and there are also mixed models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6532.697,
    "end": 6537.319,
    "text": "Um, you know, mixed, mixed models are kind of especially nice and probably a lot more realistic here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6538.119,
    "end": 6544.681,
    "text": "Um, you know, because visual, visual input, a lot of the things that are represented by the visual system are continuous, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6545.121,
    "end": 6545.861,
    "text": "Like, uh,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6546.477,
    "end": 6567.976,
    "text": " motion for example is continuous brightness um you know all these all these sorts of things um and so those can be those can be um perceived and represented in a continuous scale at the lower level but still get passed up to discrete representations at the higher level um we didn't do that here for simplicity but you could",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6569.266,
    "end": 6575.761,
    "text": " So... Just to clarify, in Scaling Active Inference, we did talk about the continuous state space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6576.242,
    "end": 6578.688,
    "text": "I was just wondering if it's possible to have a continuous time",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6579.887,
    "end": 6604.581,
    "text": " active inference model rather than a discrete time model of t123 just just bringing it up okay but then christopher and then blue so yeah three things so just quickly to answer your question daniel um so hidden markov models are just like a super general thing it's basically just when you have a markov chain and but you have but each state of the markov chain links to some outcome those outcomes can then both",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6605.541,
    "end": 6609.583,
    "text": " the outcomes and the latent states can be continuous.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6610.283,
    "end": 6617.687,
    "text": "When you have a discrete latent state continuous outcome, you end up with basically what ends up being a mixture of Gaussians model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6619.728,
    "end": 6626.912,
    "text": "And if you have continuous states, you basically end up with a Kalman filter.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6628.212,
    "end": 6630.834,
    "text": "And you can stack those on top of each other and do all the same things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6632.341,
    "end": 6636.662,
    "text": " Yeah, for all the reasons you say, things get really complicated when you start to move to continuous time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6641.023,
    "end": 6642.464,
    "text": "But I completely agree with Ryan.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6642.604,
    "end": 6651.606,
    "text": "I actually, I think there are computational, there are functional reasons to think that decision-making is discrete.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6651.726,
    "end": 6657.008,
    "text": "And so at the level of decision-making, computationally speaking, we should use discrete state-based models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6657.648,
    "end": 6660.209,
    "text": "I also think that at a certain level,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6662.489,
    "end": 6664.03,
    "text": " We need continuous state spaces.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6664.191,
    "end": 6666.513,
    "text": "Obviously, we represent continuous quantities.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6666.893,
    "end": 6673.519,
    "text": "And I think Thomas Parr, we've chatted about this before in the model stream, but Thomas Parr has a really nice paper on kind of the discrete continuous interface.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6673.539,
    "end": 6675.24,
    "text": "And that's something I'm actually really interested in.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6675.32,
    "end": 6675.841,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6676.701,
    "end": 6684.989,
    "text": "I don't know to what extent we should take these things as idealizations or as general kind of neurophysiological predictions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6685.169,
    "end": 6687.611,
    "text": "I think that's a really, I'm super interested in that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6688.251,
    "end": 6690.212,
    "text": " In other words, but I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6690.292,
    "end": 6702.038,
    "text": "Another thing to say though, is, is that it's not as though only, um, only action, you know, only action selection has to do with, um, discreet spaces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6702.559,
    "end": 6708.382,
    "text": "There, there are plausibly a lot of higher level, um, representational things that are also discreet.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6708.402,
    "end": 6710.603,
    "text": "So for instance, like concepts, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6711.003,
    "end": 6716.006,
    "text": "Like I can, I can have a bunch of continuously represented lower level of visual features.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6716.51,
    "end": 6719.052,
    "text": " but I can use those to infer something discreet as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6719.132,
    "end": 6723.715,
    "text": "Like for instance, that those features forced onto my concept of a dog, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6723.815,
    "end": 6726.677,
    "text": "Or my concept of a banana, you know, whatever, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6726.697,
    "end": 6732.501,
    "text": "Cause we do have these discreet categories that we map on patterns of continuous features too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6734.403,
    "end": 6736.344,
    "text": "And I mean, that's a, that's a kind of whole nother discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6736.364,
    "end": 6737.905,
    "text": "I think we talked about it briefly last time, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6738.345,
    "end": 6743.549,
    "text": "Gaining conscious access to the visual features versus gaining conscious access to the fact that it is a dog.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6744.458,
    "end": 6757.828,
    "text": " So those are different levels of representation that can be attended to and may be able to independently or semi-independently be accessible separately.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6759.43,
    "end": 6769.938,
    "text": "So I just want to point out that not everything is going to be continuous in perception when sort of cast broadly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6770.748,
    "end": 6775.932,
    "text": " And that's where I was going to say that's where a lot of category theory discussion comes into play.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6776.032,
    "end": 6779.455,
    "text": "Let's do blue, then Christopher for final thoughts.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6781.644,
    "end": 6791.87,
    "text": " So I know like we operate under the assumption that the visual, like we perceive things continuously in visual space, but I mean, really the input is like 60 Hertz, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6791.93,
    "end": 6802.797,
    "text": "So, I mean, theoretically, like this thing, this object is consistently a dog, but if it's like flashing back and forth to a cat at sub-perceptible levels, like we wouldn't know, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6803.117,
    "end": 6810.061,
    "text": "So, I mean, I think anything can be modeled in discrete chunks if you break the chunks into small enough pieces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6811.874,
    "end": 6812.314,
    "text": " Yeah, yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6812.394,
    "end": 6827.961,
    "text": "I've sometimes seen people be a bit smarmy about this when someone says like, oh, discrete state space is unrealistic and the comeback is always like, mate, you can always discretize things up to some arbitrary level and then discrete state spaces work fine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6829.082,
    "end": 6830.382,
    "text": "I don't know.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6830.442,
    "end": 6837.205,
    "text": "I actually think that's a bit of a dodge, to be honest, because the way we're using these discrete state space models is in an ultra-discrete kind of way, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6837.665,
    "end": 6841.407,
    "text": "So I think that if we had a hidden Markov model",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6842.358,
    "end": 6848.043,
    "text": " where we had 60 hertz equivalent or something.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6848.083,
    "end": 6849.404,
    "text": "That would just be ridiculous.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6849.444,
    "end": 6851.806,
    "text": "You should just work in continuous state spaces at that point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6852.367,
    "end": 6858.192,
    "text": "The computational and conceptual advantages of working in a discrete state space are gone.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6860.514,
    "end": 6861.395,
    "text": "It would be so difficult.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6862.389,
    "end": 6863.991,
    "text": " It's a really nice question though.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6864.091,
    "end": 6871.019,
    "text": "And it's like, if you do make it a finer and finer granularity, you keep some of the really big benefits of splitting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6871.659,
    "end": 6874.523,
    "text": "And sometimes it's actually easier to even do like a protein folding.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6874.563,
    "end": 6883.272,
    "text": "They'll do a time step of the tiniest, tiniest amount and do millions of time steps are tiny because it's still easier to fit that ultra rich,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6884.013,
    "end": 6894.059,
    "text": " discrete time model with actual time steps that can be clustered on different computers, rather than rewrite the whole base to do continuous modeling.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6894.079,
    "end": 6897.161,
    "text": "So I agree, it's not like continuous is simply better.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6897.881,
    "end": 6902.203,
    "text": "And it really relates deeply to how we think about the continuum and the infinitesimal.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6902.384,
    "end": 6904.925,
    "text": "And so it's really interesting area for active.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6905.585,
    "end": 6908.267,
    "text": "So Steven, and then any other closing comments?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6910.779,
    "end": 6931.846,
    "text": " You know, I suppose if we also were to go back into the physics of it, you know, with active inference as a way of like if vision is feeling the surfaces out there rather than it being an input signal, even if we have these brainwaves, some of that might be an artifact of cognitive science, which has got like the input process output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6932.665,
    "end": 6956.542,
    "text": " at some level it's it's extracting like alex constant talks about extracting you know information from quantum noise noise you know random fluctuations and all this sort of stuff so you know there's it could be it could be that discrete state space is kind of you know sort of also because the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6957.708,
    "end": 6959.391,
    "text": " there is quite choppy what's coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6959.671,
    "end": 6965.34,
    "text": "And at some point, inferences have to be made that makes it more like a signal, if that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6965.78,
    "end": 6971.85,
    "text": "Now, I'm just putting that out there as another layer at the lower levels of the retina and stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6973.933,
    "end": 6974.533,
    "text": " Sounds good.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6974.774,
    "end": 6976.395,
    "text": "Any last comments?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6976.495,
    "end": 6978.276,
    "text": "Otherwise this was super interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6979.137,
    "end": 6990.644,
    "text": "I guess a closing question for the authors would just be when, when's the next episode in this paper saga or what's the next, what's the next thing you're excited about here?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6990.664,
    "end": 6998.75,
    "text": "We have another paper that's kind of, I don't know, maybe like three quarters done or something like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6998.77,
    "end": 7000.391,
    "text": "That's kind of the next step.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7000.411,
    "end": 7000.671,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7002.45,
    "end": 7002.79,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7002.81,
    "end": 7004.031,
    "text": "We've run all the simulations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7005.512,
    "end": 7006.733,
    "text": "Yeah, so they're done.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7006.873,
    "end": 7023.644,
    "text": "It's an expanded model that does a lot more with... So it allows for a no-report paradigm, and selective attention and working memory maintenance are explicit policies in the updated one, and there's a number of other advantages, but it's coming soon.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7024.825,
    "end": 7027.927,
    "text": "Yeah, I think it's a matter of me writing it, really.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7028.688,
    "end": 7028.788,
    "text": "So...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7030.874,
    "end": 7059.989,
    "text": " wow too real but thanks everyone for joining this is really fun for 18 overall and we look forward to probably seeing you again for 19 and beyond thanks to all the participants you can fill out the survey for feedback in your events calendar uh invitation otherwise we'll uh be talking through other channels so thanks everyone see you later thanks",
    "speaker": "SPEAKER_08"
  }
]