[
  {
    "start": 6.605,
    "end": 28.761,
    "text": " everyone this is active inference guest stream 70.1 it's february 9th 2024 we're here with jerry mccalskey and this should be a great presentation discussion conversation knowledge experience so jerry thank you very much for joining and please let us begin however you prefer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.655,
    "end": 31.295,
    "text": " Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.355,
    "end": 32.716,
    "text": "It's a delight to be here with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.096,
    "end": 40.921,
    "text": "And I feel like what you were reading a moment ago was like a stardate into a stardate entry and like we're cruising off to some interesting new horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.661,
    "end": 58.09,
    "text": "And what I want to do is build some conversational background here by showing what I've been doing for 26 years with a quirky mind mapping tool called the brain and then how that cuts into or crosses into or blossoms into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.863,
    "end": 63.106,
    "text": " topics of interest to both of us and hopefully to people who are watching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.907,
    "end": 69.61,
    "text": "But at first, I think I want to say, set a little background just for what this is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.831,
    "end": 72.792,
    "text": "I used to be a tech industry trends analyst.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.932,
    "end": 78.196,
    "text": "I spent 11 and a half years with a little company called New Science Associates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.271,
    "end": 82.653,
    "text": " which I have in my brain over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.793,
    "end": 85.337,
    "text": "And I'm just going to use the brain for a moment to show you what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.357,
    "end": 91.766,
    "text": "I was with New Science back in the day, and I started two of their seven research services.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.886,
    "end": 96.313,
    "text": "So in 1990, I started a research service called Intelligent Document Management.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.622,
    "end": 103.085,
    "text": " And then a couple of years later, I started a research service called Continuous Information Environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.685,
    "end": 111.989,
    "text": "And if you were to look at the intelligent document management scope diagram, which I drew back then in 1990, we used to refer to this as the bubble chart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 113.009,
    "end": 116.912,
    "text": " And at that time, our major competitor was Gartner Group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.932,
    "end": 121.655,
    "text": "There were a couple other endless houses like BISCAP and IDC and a few others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.436,
    "end": 126.378,
    "text": "But everybody's pitch documents to clients were bullet points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.698,
    "end": 128.279,
    "text": "Here's the list of the technologies we cover.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.66,
    "end": 130.101,
    "text": "And I drew this diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.021,
    "end": 135.104,
    "text": "The founders of New Science had asked me to create a service based on electronic imaging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.814,
    "end": 137.776,
    "text": " And I went to and looked at electronic imaging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 137.816,
    "end": 139.917,
    "text": "I was like, wow, this is really a dumb technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.318,
    "end": 142.359,
    "text": "We're going to scan checks and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.42,
    "end": 149.305,
    "text": "We're going to put them on optical storage and then try to bring them up and reprint them onto somebody's printed Amex invoice kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 149.345,
    "end": 152.107,
    "text": "That was the most famous imaging thing at the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.528,
    "end": 160.474,
    "text": "So I looked around databases and moving objects around networks, and I assembled a service that I called Intelligent Document Management.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.135,
    "end": 163.357,
    "text": "And this service cut across",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.615,
    "end": 178.048,
    "text": " a bunch of categories that Gartner didn't know how to cut across because if you were a Gartner client, you either had to call the mid-range or the PC or the mainframe service or the word processing service or workplace automation service.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.669,
    "end": 180.15,
    "text": "And so within a year or two,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.932,
    "end": 185.034,
    "text": " Gartner and everybody needed to have a conceptual map of their service.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.534,
    "end": 195.481,
    "text": "And also a lot of others needed to start reconfiguring their offers because our offer happened to be pitched to the problems clients had as opposed to the structure of the industry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.202,
    "end": 205.569,
    "text": " And then I will also add that if you look at here and squint a little bit, you'll see the beginnings of the World Wide Web, which I had no knowledge of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.609,
    "end": 208.472,
    "text": "I had no inkling that there was any research going on about the World Wide Web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.732,
    "end": 219.961,
    "text": "But I have document recognition and SGML and a couple other things in here, which later become really important components because the World Wide Web is HTML, which is a skinny down version of SGML.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.981,
    "end": 223.004,
    "text": "And we've got document architectures, complex documents, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.945,
    "end": 231.953,
    "text": " And then if you squint and look at the continuous information environments research service, you will sort of see smartphones on the horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.973,
    "end": 236.478,
    "text": "And I'm doing this, I'm not really good at self-promotion, but I'm doing this to say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.303,
    "end": 253.182,
    "text": " i'm pretty reasonably good at sniffing at what's coming i usually don't name it the right thing but i'm poking in the right directions and i've kind of done this a bunch of times in my career and i i have sort of trusted that that these things just show up over time and uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.542,
    "end": 260.304,
    "text": " And one of the things that helps me keep track of this and understand it is this weird little brain software that I've been showing you here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.344,
    "end": 274.108,
    "text": "So New Science Associates, this is a link to actually, I don't think there's a yes, I think I bought the domain newscienceassociates.com because it was available because the company is so old and got eaten by Gartner later that it had no website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.128,
    "end": 275.929,
    "text": "And I was like, you know, we should have a website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.117,
    "end": 282.525,
    "text": " But they were part of Gartner Group, which is a technology actually under industry analysts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 282.925,
    "end": 285.309,
    "text": "And here are a whole bunch of different industry analyst firms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.01,
    "end": 290.136,
    "text": "The brain is organized so that each node is called a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.928,
    "end": 296.415,
    "text": " You can only connect thoughts to each other through these three circles that every thought has up, down and left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.816,
    "end": 307.57,
    "text": "And there's no circle to the right for reasons that only become apparent once you start using this thing, which means as you're feeding stuff into the brain, you have to decide, is this above or below or beside other things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.17,
    "end": 318.038,
    "text": " The brain doesn't tell you where anything should go and it doesn't sort of care, meaning there's no consistency logic checking in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.378,
    "end": 319.659,
    "text": "There's no AI in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.679,
    "end": 322.741,
    "text": "It doesn't need or want a taxonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.841,
    "end": 329.066,
    "text": "You could design an ontology or a taxonomy in here, but it's not doing any structured checking on what you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.106,
    "end": 334.39,
    "text": "It's just like Photoshop for nodes, for ideas, nodes and links, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.93,
    "end": 340.654,
    "text": " But this one constraint of going up, down, or left was actually incredibly interesting and important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.794,
    "end": 347.418,
    "text": "And it was really good for me because back in that day, I was a tech industry trends analyst, and I needed to know who competes with whom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.238,
    "end": 358.284,
    "text": "And I will go to, I'll just give a really practical, I'll just give a really practical example of what I mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.324,
    "end": 363.307,
    "text": "I'll go to the venture capital firm Andreessen Horowitz, which I have under VC firms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 364.301,
    "end": 366.465,
    "text": " And these are sort of the major VC firms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.545,
    "end": 369.491,
    "text": "But one day I realized, oh, there's a whole mess of other VC firms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.412,
    "end": 372.376,
    "text": "This is the list of other VCs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 372.456,
    "end": 374.179,
    "text": "And you'll see that there's a scroll bar down here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.219,
    "end": 377.325,
    "text": "This is just A through C of venture capital firms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.57,
    "end": 385.675,
    "text": " And the way I aggregated these was not by exhaustively uploading or going through some database and sucking that in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.035,
    "end": 395.862,
    "text": "This was just the ones that appeared over time, backing different companies I was looking at, and then articles that would mention one or whatever else, all of those kinds of things happening slowly over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.202,
    "end": 401.806,
    "text": "So here's Chase Capital, which invested in GeoCities, Scout, Electromedia, and SquareTrade.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.466,
    "end": 404.007,
    "text": "What business was SquareTrade in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.107,
    "end": 405.789,
    "text": "Oh, they were doing trust services.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.809,
    "end": 407.53,
    "text": "I don't think I have a lot in trust services.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.471,
    "end": 413.033,
    "text": " So Project Tandus and Square Trade, which is under reputation and trust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.433,
    "end": 417.575,
    "text": "These W's you might recognize as Wikipedia fav icons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.115,
    "end": 424.018,
    "text": "And so I use, in fact, anywhere you see a fav icon attached to a thought and you see a lot of Wikipedia ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.458,
    "end": 435.303,
    "text": "But here, for example, is a fav icon for the World Economic Forum, because this website, the URL that I've attached to this thought will take us over to the World Economic Forum website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.924,
    "end": 441.208,
    "text": " So I've been curating this thing by hand for 26 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.469,
    "end": 445.132,
    "text": "I was on their first press tour, December of 97.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.312,
    "end": 450.878,
    "text": "In fact, I was recently digging through some boxes of old files of mine and I found the packet they mailed me",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.624,
    "end": 461.131,
    "text": " with paper documentation about the product, which I'd only ever just heard of then, and a cover letter that said, we are really looking forward to meeting you in your offices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 461.411,
    "end": 469.676,
    "text": "And I remember when the inventor opened his laptop and showed me the first version of this, which didn't look that much different from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.977,
    "end": 475.26,
    "text": "I will say that over 26 years, this thing has looked consistently similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.28,
    "end": 476.441,
    "text": "I helped",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.256,
    "end": 483.138,
    "text": " prevent it from changing dramatically somewhere 10 years ago, where the inventor was going to do something radically different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.159,
    "end": 488.941,
    "text": "And I was like, you know, you're going to lose all the secret magic of this thing that you've got this brain software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.743,
    "end": 498.248,
    "text": " And as I said, I was busy covering technology companies, and I needed to know who competes with whom, who invests with whom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.609,
    "end": 504.833,
    "text": "So here's Andreessen Horowitz basically invested in Canvas, which was an image board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.734,
    "end": 507.895,
    "text": "Oh, I know I've got a whole bunch more stuff on image boards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.475,
    "end": 510.277,
    "text": "But here's 4chan, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.198,
    "end": 514.161,
    "text": " which is an online community that allows for anonymous posting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.442,
    "end": 516.864,
    "text": "Here are other services that allow for anonymous posting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.926,
    "end": 523.873,
    "text": "I've got them under minimal censorship spaces online, but opposite cyberbullying, which is a major issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.665,
    "end": 529.608,
    "text": " And I'm just giving a random tour through kind of what's up and what catches my eye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.029,
    "end": 541.476,
    "text": "But because I'm the person who's put all these thoughts in and I've never done it automatically, I've never crawled the website and had all the links or the pages in the website put into the brain, which was an early feature that it did have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.556,
    "end": 546.119,
    "text": "I could have called my file system, my explorer or my finder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.139,
    "end": 550.562,
    "text": "I could have had every file represented here in some kind of pre-structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 550.963,
    "end": 554.325,
    "text": "I never wanted to do that because I knew that the namespace inside the brain,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.045,
    "end": 556.046,
    "text": " was really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.786,
    "end": 558.407,
    "text": "And I wanted to be able to find things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.447,
    "end": 563.229,
    "text": "And now all I need to do to jump someplace is I click somewhere in the blue background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.429,
    "end": 569.331,
    "text": "By the way, this blue gradient background is the background that the brain shipped with 26 years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 569.711,
    "end": 573.953,
    "text": "And I've never changed it because the readability is really good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.973,
    "end": 576.074,
    "text": "I have no reason to make it an image.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.114,
    "end": 577.254,
    "text": "You could if you wanted to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.294,
    "end": 578.435,
    "text": "It just makes it harder to read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.895,
    "end": 580.636,
    "text": "So I'm very old school in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.096,
    "end": 583.477,
    "text": "There are also a lot of really nifty features like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.798,
    "end": 589.542,
    "text": " I could add thought types and link types, and I could add tags and labels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.042,
    "end": 603.812,
    "text": "I don't use any of those things, not because I hate metadata, but because I believe that anything that makes it take longer for me to add things and to curate my brain is actually going to slow me down and maybe make me stop using this tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.832,
    "end": 607.415,
    "text": "I would love for something to go through and say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.402,
    "end": 610.683,
    "text": " This looks like an author and this looks like a book they wrote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.043,
    "end": 616.446,
    "text": "I'm happy to tag this up as a book, this person up as an author, the link up as written by and wrote this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.046,
    "end": 620.928,
    "text": "And off we go to the races with metadata because I think metadata is super important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.508,
    "end": 629.931,
    "text": "But this is the file I'm sharing with you is the file that I added stuff to this morning is the file that I started 26 years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.812,
    "end": 637.795,
    "text": "So I'm also unusual among brain users in that I have one big brain that I've curated for all that period of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.895,
    "end": 654.914,
    "text": " which is a little weird, but I think really pretty interesting because I have this very deep felt experience of the aggregation of information in a space that maps to how I think and what I think and what I care about, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.847,
    "end": 659.667,
    "text": " For example, I have a thought called big questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.747,
    "end": 661.948,
    "text": "Oh, I was just going to explain how I jumped to a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.308,
    "end": 665.429,
    "text": "So if I click anywhere in that blue background, that's how I got distracted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.829,
    "end": 667.329,
    "text": "It puts my cursor in the search bar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.349,
    "end": 669.57,
    "text": "I then type any unique string.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.59,
    "end": 675.911,
    "text": "And because I've added all these nodes, I kind of know what the words are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.051,
    "end": 682.333,
    "text": "And sometimes I put words that I know are unique because I can find things very quickly that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.693,
    "end": 685.134,
    "text": "So I knew I had a thing called big questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.674,
    "end": 686.194,
    "text": "And so here's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.194,
    "end": 695.442,
    "text": " One big question is rethinking and renegotiating the social contract, because I think that we are involuntarily renegotiating the social contract around the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.882,
    "end": 705.29,
    "text": "There's a whole bunch of protest movements that I'll point to here, the Gilets Jaunes, Extinction Rebellion, Occupy Wall Street, and Occupy Wall Street has a bunch of stuff under it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.33,
    "end": 707.432,
    "text": "So here's articles about Occupy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.273,
    "end": 710.675,
    "text": "Back in the day, I created this thought back in 2011, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.048,
    "end": 726.354,
    "text": " And so I'm having this unusual experience that most people don't get to have of seeing, revisiting, improving and updating all the things that seemed important back when, ever since 1997.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.534,
    "end": 729.216,
    "text": "Let's call it January 1998.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.176,
    "end": 734.098,
    "text": "And I think I've learned a lot how to take notes and how to add things to my brain since then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.158,
    "end": 736.82,
    "text": "So I think my curating gets better over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.9,
    "end": 737.02,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.065,
    "end": 752.247,
    "text": " I don't delete a lot of things in my brain because I think as Nassim Taleb, we never hear from the graveyard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.487,
    "end": 760.589,
    "text": "Basically, in The Black Swan, Nassim Taleb says, you know, it's good to know all the companies that tried and failed to do something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.669,
    "end": 764.83,
    "text": "If I go to buddy lists in my brain, here's buddy lists, boom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.25,
    "end": 766.41,
    "text": "See how quick it is to get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.49,
    "end": 768.931,
    "text": "I can't do this in any database program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.951,
    "end": 770.491,
    "text": "I can't do this in any other kind of app.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.101,
    "end": 788.09,
    "text": " so this is a list of the buddy lists that i saw go by so mirabilis did icq i added them in december of 97 so this is one of the first thoughts i ever added to my brain this is this is when i started using the brain so mirabilis is one of the first companies i put in they're under israeli startups",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 789.372,
    "end": 790.233,
    "text": " Here's a bunch of those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.654,
    "end": 796.342,
    "text": "If I go back to Mirabilis, Yossi Vardy's son Arik is one of the three founders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 796.763,
    "end": 801.99,
    "text": "But I met Yossi because he sent me an email after I wrote about them in the newsletter I used to write for Esther Dyson.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.431,
    "end": 805.456,
    "text": "And so I got to know Yossi and give him a little attention about all this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.789,
    "end": 812.672,
    "text": " But not knowing that all these companies tried and died to do this doesn't help us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.992,
    "end": 814.692,
    "text": "We then keep repeating the same errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.433,
    "end": 825.116,
    "text": "Thanks to the Internet Archive, which I don't think goes back to 1997, but thanks to the Internet Archive, you can see a lot of these URLs and what they had way back when, which is terrific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.216,
    "end": 831.739,
    "text": "In fact, there's a couple of URLs that I've tracked for long enough where if you go to the archive, you'll see three little bell curves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.259,
    "end": 859.071,
    "text": " which is originally when launched this thing was this company and it got some attention and then it died and maybe the URL got acquired or the company revamped itself and repitched itself and came out again and here is its second lifetime and then here you can see their third lifetime which may go to the present day which I find fascinating because it's as if there's an archaeological layers here like this is you know like a tell where as you dig down you can start to uncover different archaeological layers of what happened",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.972,
    "end": 863.456,
    "text": " Each thought in my brain, as I've just been showing you, has timestamps in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.317,
    "end": 868.583,
    "text": "But until recently, there wasn't really an API, so this was not programmatically accessible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.603,
    "end": 875.111,
    "text": "And so I've never done any kind of analysis to say, if you were to shave back to this layer, what would you see?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.292,
    "end": 877.735,
    "text": "Or to do a visual reconstruction of what I added.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.576,
    "end": 881.957,
    "text": " I also don't care what this looks like from a 30,000 foot level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.557,
    "end": 883.958,
    "text": "It would be a big ball of twine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.338,
    "end": 888.019,
    "text": "And there's a lot of visualizations out there that look like big balls of twine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.039,
    "end": 890.2,
    "text": "I don't find them especially interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.261,
    "end": 896.602,
    "text": "Let me bounce up to a different place just to talk about, to put the brain in context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 900.163,
    "end": 901.904,
    "text": "Oops, that didn't work very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.924,
    "end": 902.664,
    "text": "Let's try this again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.448,
    "end": 913.71,
    "text": " Mapping Tools for Thinking is a place where late last year or the year before I had a project with Betaworks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.25,
    "end": 923.873,
    "text": "They had a camp around tools for thinking, which is a nice name for the category of tools like the brain, like Roam Research, Obsidian, Kumu.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.713,
    "end": 929.635,
    "text": "There's all the different mapping tools, outliner tools, all those kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.055,
    "end": 930.715,
    "text": "And I realized",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.275,
    "end": 934.797,
    "text": " that I had all those subcategories, but they were just subcategories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.817,
    "end": 935.778,
    "text": "They weren't connected together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.818,
    "end": 938.82,
    "text": "So I created this thought in April of 22.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.48,
    "end": 946.344,
    "text": "And then I went around looking for all the different places where I had, you know, personal knowledge graphs, PKGs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.865,
    "end": 950.026,
    "text": "Well, somebody else did distributed knowledge graphs or DKGs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.066,
    "end": 951.767,
    "text": "There's also enterprise knowledge graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.748,
    "end": 955.59,
    "text": "There's just knowledge graphs in general, which all of those should be under.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.09,
    "end": 976.907,
    "text": " right and then uh gordon brander is creating the noosphere protocol as part of his startup called subconscious over here but if i go back to mapping tools for thinking these all uh are you know collaborative decision making tools really interesting and now we're seeing uh machine learning for decision making and i'll also add that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.303,
    "end": 981.805,
    "text": " When I first joined New Science Associates, I was their neural networks analyst.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.686,
    "end": 987.329,
    "text": "And so I've been watching as Gen-AI basically got birthed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.389,
    "end": 996.916,
    "text": "Now, the earliest neural network researchers back in the 40s and 50s, when people first had computers, one of the first things they tried to do was figure out how to make these computers emulate human thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.024,
    "end": 1002.148,
    "text": " And the ones who decided to follow the neurobiology created neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.468,
    "end": 1005.13,
    "text": "The ones who decided to follow the logic created expert systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.47,
    "end": 1009.854,
    "text": "There's a whole train of thinking there that I can map in my brain here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.414,
    "end": 1016.479,
    "text": "But you'll see that now I now have ML4, ML4, ML4, ML4 hacking and cybercrime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.519,
    "end": 1017.14,
    "text": "There's only one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.62,
    "end": 1024.546,
    "text": " Article here written by Bruce Schneier, who is an awesome writer, called Academic, The Coming AI Hackers in 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1025.486,
    "end": 1033.613,
    "text": "And then here is an article that cites that book written by Nathan Sanders in the New York Times, because here you see a New York Times URL.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.973,
    "end": 1039.618,
    "text": "And here you'll see sentences that I cut and pasted out of that article, because this is how I notetake now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.24,
    "end": 1043.86,
    "text": " So here's again back to mapping tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.88,
    "end": 1051.182,
    "text": "So thinking a cool thing is that I can actually send somebody a URL that will take them to a specific thought in my brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.162,
    "end": 1065.205,
    "text": "Another thing I'll say about this brain thing is that the brain's inventors and a few other power users have been trying to figure out how to lose this complicated interface for a really long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.245,
    "end": 1067.325,
    "text": "This is sort of daunting to a lot of people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1068.597,
    "end": 1078.585,
    "text": " I have no concept that everybody should be using something like the brain, but I do think more of us should be sharing what we think and what we know in some open way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.026,
    "end": 1084.31,
    "text": "And I'm really, one of my major projects right now is to figure out how to do that, what to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.452,
    "end": 1091.596,
    "text": "And just because, retype that with spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.398,
    "end": 1107.992,
    "text": " And because that is difficult to explain, if you ask me what Wikipedia is, I can tell you it is an encyclopedia written with a wiki funded by donations that lives on the web and is a completely open source project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.032,
    "end": 1109.613,
    "text": "You can run this software yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.653,
    "end": 1110.895,
    "text": "You can use the content yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.935,
    "end": 1112.616,
    "text": "You can participate in all the conversations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.197,
    "end": 1114.818,
    "text": "I can tell you what Wikipedia is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1115.339,
    "end": 1118.622,
    "text": "And Wikipedia is pretty popular partly because it's that simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.349,
    "end": 1126.111,
    "text": " And it does, in fact, rely on volunteers to come in and change, edit, update its entries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.312,
    "end": 1135.814,
    "text": "The space I'm looking at is philosophically above that and not just reference pages in an encyclopedia, but opinions, belief systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1136.094,
    "end": 1137.234,
    "text": "What does QAnon believe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.634,
    "end": 1138.634,
    "text": "What does MAGA believe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.054,
    "end": 1140.735,
    "text": "What do progressives believe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.895,
    "end": 1143.036,
    "text": "What's the difference between different kinds of anarchism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.812,
    "end": 1151.055,
    "text": " So if I go to anarchism, for example, here's Anarchism, which is a Chomsky book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.535,
    "end": 1152.876,
    "text": "Here's the topic of anarchism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.896,
    "end": 1154.477,
    "text": "I have types of anarchism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.177,
    "end": 1159.2,
    "text": "There are lots of different types of anarchism, and they all have Wikipedia pages, nicely enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.521,
    "end": 1169.006,
    "text": "And so anarcho-pacifism, I don't know that much about, but I know that Thoreau and Tolstoy were anarcho-pacifists, and I don't remember putting Barthes in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.882,
    "end": 1173.785,
    "text": " But I did that in 2012 and I didn't connect him to any of his works or anything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1173.825,
    "end": 1175.766,
    "text": "So I don't know really who he is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.806,
    "end": 1177.347,
    "text": "I'd have to go back and look him up again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.067,
    "end": 1180.028,
    "text": "But the idea of being able to go around and do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.369,
    "end": 1184.191,
    "text": "Now, how do I meld what I think and what I believe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1185.044,
    "end": 1186.346,
    "text": " with what you believe, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.906,
    "end": 1188.729,
    "text": "How does that work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.229,
    "end": 1200.983,
    "text": "I bought the domain thebigfungus.org in 2021 because I needed a tongue-in-cheek, metaphorically really rich way of explaining that I hope",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.696,
    "end": 1219.018,
    "text": " before I die, that the data in my brain is an inoculation into the big fungus that lives between us where we make mycelial connections to each other, exchange nutrients in fertile soil, and that the fruiting bodies of our efforts, the mushrooms that pop out of mycelial networks,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.558,
    "end": 1222.56,
    "text": " actually become the edible, tradable, shareable artifacts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.921,
    "end": 1232.408,
    "text": "So I have a project that meets on Mondays these days called neobooks, where we're trying to reinvent books, where the notion of using a book is just, in fact, I'll go to neobooks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.269,
    "end": 1240.454,
    "text": "The notion of the neobook, here are the calls, here is the project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.235,
    "end": 1246.619,
    "text": "A neobook is basically the fruiting body of the big fungus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.438,
    "end": 1253.62,
    "text": " The book version of the artifact is just something that people would recognize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.82,
    "end": 1255.421,
    "text": "Oh, this looks like a book, smells like a book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.561,
    "end": 1256.462,
    "text": "I understand this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.882,
    "end": 1263.505,
    "text": "But the interesting parts of the book, the Neo book is composed of nuggets that roll up into chapters that roll up into a book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.745,
    "end": 1265.666,
    "text": "You put some front matter and end matter around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.726,
    "end": 1268.907,
    "text": "You squeeze it out as an EPUB or as a Kindle file format book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.562,
    "end": 1298.818,
    "text": " and you have a book you can print on demand that that looks like a book but the book is just bait to get people to come play with the nuggets that are live documents on the web that are wiki style plus plus basically anybody who's had a good time in a wiki online and i've just described a very tiny set of humans on the planet knows that collaboratively editing a collection of pages that matter is a joyful task that leads to really useful uh fruits you know useful products",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.506,
    "end": 1324.194,
    "text": " and most people only ever experience that through wikipedia which works right wikipedia works pretty well despite having been through a lot of dark times and difficult issues if i were a 14 year old boy i would like nothing more than to go in and spam wikipedia and try to hurt it and wikipedians will gently take that and try to convert you into an editor and a contributor because they know that the best thing they might be able to do is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.75,
    "end": 1329.432,
    "text": " So one of my projects is this idea of the big fungus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.512,
    "end": 1337.519,
    "text": "And then I host four standing calls every week, all of which I record on YouTube and then post online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.819,
    "end": 1340.961,
    "text": "So the Neobooks calls are more recent than the rest of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.982,
    "end": 1346.666,
    "text": "But this is a batch of calls that you can go watch online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.046,
    "end": 1348.928,
    "text": "If you were to find this thought and you were to go to the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.068,
    "end": 1354.391,
    "text": " The call we had November 6th of 2023, here are the things we referenced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.832,
    "end": 1358.914,
    "text": "And then here are some notes I took during that call.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.415,
    "end": 1361.596,
    "text": "So we talked about neobooks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.056,
    "end": 1364.178,
    "text": "Of course, it was a neobook call, so we do that often.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.518,
    "end": 1365.719,
    "text": "But we talked about web bugs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1366.019,
    "end": 1374.905,
    "text": "I don't remember talking about web bugs, but they were beacons or pixels that were kind of a surveillance technology that would tell you when I had looked at a web page, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.345,
    "end": 1379.008,
    "text": "So now you can go back and see all the different calls that I've been part of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.869,
    "end": 1383.309,
    "text": " Let me just go to OGM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.67,
    "end": 1385.27,
    "text": "Zoom calls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.49,
    "end": 1390.472,
    "text": "Here's like the big bucket of calls I've hosted for the last three years since the pandemic started.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.492,
    "end": 1392.253,
    "text": "And there's a scroll bar down here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.993,
    "end": 1394.754,
    "text": "The main calls are on Thursday mornings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.274,
    "end": 1402.697,
    "text": "OGM is Open Global Mind, which is a community of practice I started as lockdown took us all into Zoom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.257,
    "end": 1407.419,
    "text": "And these calls are still going and we're busy chewing on the ideas of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.126,
    "end": 1421.334,
    "text": " The name Open Global Mind is always what I had in the back of my head as what would an open source, highly collaborative version of the brain look like that didn't require everybody to come in using the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.955,
    "end": 1425.697,
    "text": "It would let you do an outliner or something else and we could kind of talk in between.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.498,
    "end": 1429.58,
    "text": "And so I always thought of it and I bought the domain quite a while ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.86,
    "end": 1438.386,
    "text": "And then as we started having these conversations, I'm like, oh, let's call our community Open Global Mind because the community is about both being open-minded,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1439.361,
    "end": 1441.262,
    "text": " and about building a global mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.703,
    "end": 1447.906,
    "text": "And these things kind of go hand in hand because I can show you what I know and what I care about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.006,
    "end": 1455.61,
    "text": "And if you don't trust me and if we don't have some kind of connection or if you're not open minded in some way, you're never going to listen to me and we're just going to disagree forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1455.63,
    "end": 1467.136,
    "text": "And my hope is that by making more explicit our belief systems and putting them in the world and by the way, Jenny's emergence has made this both more complicated and more exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.156,
    "end": 1468.557,
    "text": "I'm happy to talk about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.369,
    "end": 1495.728,
    "text": " um but by doing by putting our ideas in the world we might actually reduce conflict and instead of being in mexican standoffs all around the world by the way um we could actually start to productively solve some of the problems that we're facing together because i do think that we're facing five crises six crises a poly crisis a meta crisis i you there's it's certainly got lots of different names right uh but and i and i've",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.058,
    "end": 1502.98,
    "text": " So if I type in five crises, I can go to, we are in the middle of five crises, the poly crisis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.681,
    "end": 1517.427,
    "text": "And for me, some of them are, was 2006 peak democracy at the time of the COVID pandemic, Black Lives Matter, the effects of climate change, inflation as Russia invades Ukraine was a temporary one, which seems to be going down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.167,
    "end": 1526.111,
    "text": "But this is kind of a place where I also have a nexus, a collection of what some of these crises are and what we're doing about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1527.579,
    "end": 1532.262,
    "text": " And then connected to that, I have communities trying to fix world problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.222,
    "end": 1538.925,
    "text": "And here's the Knowledge Society, the Global Solutions Initiative and Spiral Network out in New Zealand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.765,
    "end": 1550.331,
    "text": "Society 2045, Stronger Together X, Humanity 2050, the Gray Swan Guild, Doomer Optimism, Black Sheep, Game B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.232,
    "end": 1553.113,
    "text": " community mycelium, common future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.213,
    "end": 1565.617,
    "text": "These are all communities that are trying to do, so if I go to Game B, here's articles about Game B, here's Jim Rott, who I put in my brain in 2006, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.017,
    "end": 1573.66,
    "text": "Jim Rott's been here forever, connected to Santa Fe Institute, uses Rome, has a family foundation, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.86,
    "end": 1576.841,
    "text": "So this is just an intro to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.504,
    "end": 1586.612,
    "text": " The tool that changed my life 26 years ago, how I use it, how I'm thinking in it, this is a solitary task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1587.393,
    "end": 1598.424,
    "text": "I like to say that I feel like a lone ant at the fungus face, which requires a little explaining because leafcutter ants, and you've talked about strygmurgic communications here before, which I love.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.283,
    "end": 1605.706,
    "text": " If I can spell sigmergy properly, nope, it's I-G-M-E.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.146,
    "end": 1606.586,
    "text": "There we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.827,
    "end": 1609.888,
    "text": "So leafcutter ants can't actually digest leaves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.268,
    "end": 1612.149,
    "text": "Why are they bringing all these leaves into their hive?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.209,
    "end": 1626.418,
    "text": "Well, they hand them off to a subclass of that kind of ant, which mulches them up and feeds them to a fungus, basically inoculates the fungus, which metabolizes the leaf matter, and it oozes little drops of nectar and little bits, little globules called something or other, it's in my brain,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.385,
    "end": 1646.893,
    "text": " um which feed the hive so symbiotic relationship happy fungus happy hive and the days and there kind of hasn't been a day in the last 26 years unless i was traipsing across the steppe in mongolia and had no you know no computer with me there hasn't been a day that i haven't been an ant at this fungus face here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.842,
    "end": 1674.444,
    "text": " right which is why the big fungus showed up for me as such a nice funny term metaphorically for shared memory how do we tell each other what we know and then duke it out in a spirit of fair play to figure out how we make better decisions together over time that's really the core of what i care about now and trust matters a lot in that as i said if i don't trust you we can't duke anything out there will be no sense of fair play",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.362,
    "end": 1687.152,
    "text": " There are a bunch of people in the arena right now who are trying to undermine fair play and make sure we destroy fair play and people's faith in the web, in journalism, in science, in politics and elections and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.632,
    "end": 1690.715,
    "text": "And I think that those things are not good for humans in the long run.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.356,
    "end": 1693.958,
    "text": "And I'd like to find a way to fix those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.459,
    "end": 1699.783,
    "text": "And so active inference and the free energy principle are in here as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.784,
    "end": 1710.529,
    "text": " And I'm trying to figure out how to understand them better so that I can see whether and how these things all fit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.609,
    "end": 1713.891,
    "text": "And my undergrad was in economics, really econometrics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.531,
    "end": 1719.554,
    "text": "And econometrics is a whole bunch of matrix math, which is about minimizing least squares errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.234,
    "end": 1720.955,
    "text": "That's what it's about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.415,
    "end": 1722.515,
    "text": "And guess what that sounds like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.256,
    "end": 1725.937,
    "text": "That sounds like the math that's inside of neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.977,
    "end": 1728.759,
    "text": "And that sounds like the math that's behind active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.637,
    "end": 1735.783,
    "text": " And so there's something really interesting there going on that I would love to explore with you and anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1736.403,
    "end": 1740.067,
    "text": "So let me hit pause there and see where that all takes us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.162,
    "end": 1742.843,
    "text": " Thank you, Jerry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.643,
    "end": 1744.844,
    "text": "Awesome works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.785,
    "end": 1752.19,
    "text": "So one just specific follow-up before us, more general questions and read some live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.871,
    "end": 1755.173,
    "text": "You mentioned up, left, down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.753,
    "end": 1757.975,
    "text": "Can you just describe what those specifically mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.436,
    "end": 1759.156,
    "text": "Why does it matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.376,
    "end": 1760.958,
    "text": "And what is the spatial metaphor?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.038,
    "end": 1761.838,
    "text": "And what does that all do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.719,
    "end": 1762.879,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.059,
    "end": 1763.36,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.202,
    "end": 1766.083,
    "text": " So they can mean anything you want them to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.143,
    "end": 1768.724,
    "text": "The brain shows up and it doesn't tell you how to use up, left, down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.824,
    "end": 1771.006,
    "text": "It's just that those are the only ways you can create something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1771.146,
    "end": 1779.07,
    "text": "So I'm going to go left here and make a spurious link to neural networks, which I know I have, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.55,
    "end": 1784.413,
    "text": "And I've just created a new link going with this lateral link called a jump link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.493,
    "end": 1787.334,
    "text": "And I'm going to break it by doing two finger click and saying unlink.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.315,
    "end": 1792.857,
    "text": "The way I generally use this is that the super category",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.099,
    "end": 1823.133,
    "text": " or the the collective noun or whatever else goes up the the specifics go down the detail goes down and then the jump thought is for other things that are really similar like neighbors or really opposite like east west right so i will have often a thought which has opposite it critiques of the name of that thought because hey here's a bunch of evidence in favor of that thought but you know what there's a bunch of people that have some wise critiques so for example i'll go to capitalism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.255,
    "end": 1827.017,
    "text": " And then on the left, I've got a thought called critiques of capitalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.297,
    "end": 1836.824,
    "text": "But then under I've got articles about capitalism, which is a I've developed a couple of little tropes or I call them cliches that I do consistently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.065,
    "end": 1839.987,
    "text": "And if you do things consistently in the brain, then it's much easier to navigate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.067,
    "end": 1841.308,
    "text": "You can really kind of get around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.948,
    "end": 1848.353,
    "text": "And one of my one of the things I do is when things get crowded down below a thought, I create a thought called articles about capitalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.948,
    "end": 1852.431,
    "text": " And then I put all the books, YouTube videos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.531,
    "end": 1854.272,
    "text": "Here's a Harvard Business School article.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.572,
    "end": 1855.653,
    "text": "Here's a book on Amazon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.234,
    "end": 1858.375,
    "text": "Here's something from the New York Review of Books.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.096,
    "end": 1860.817,
    "text": "Here's something from Salon Magazine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.957,
    "end": 1862.639,
    "text": "You can tell just by the fav icons, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.18,
    "end": 1868.183,
    "text": "And note that a lot of these, I usually put authors in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1868.223,
    "end": 1871.866,
    "text": "So here's William Baumol, the economist who studied entrepreneurship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.906,
    "end": 1873.968,
    "text": "He also wrote The Cost Disease, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.228,
    "end": 1876.81,
    "text": "So I always, for example, put authors above their books.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1877.637,
    "end": 1880.879,
    "text": " I always put actors under their movies because they're acting in a movie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.259,
    "end": 1885.521,
    "text": "And if a movie is based on a novel, the novel will be above the movie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1886.022,
    "end": 1888.743,
    "text": "Or if a musical got turned into a film, the musical will be above.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.284,
    "end": 1892.946,
    "text": "Carousel, I'm not sure Carousel is a movie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.966,
    "end": 1893.726,
    "text": "It must have been a movie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1893.766,
    "end": 1894.487,
    "text": "Somebody made a movie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.607,
    "end": 1895.167,
    "text": "No, I guess not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1896.043,
    "end": 1898.885,
    "text": " So here's the Rodgers and Hammerstein musical, Carousel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.306,
    "end": 1904.209,
    "text": "And you'll notice this isn't just about tech companies and tech issues that were suddenly in musicals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.09,
    "end": 1909.593,
    "text": "And I've got musicals under types of theater, music in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.974,
    "end": 1917.038,
    "text": "And I have like types of music over here, which should be pretty capacious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.149,
    "end": 1920.77,
    "text": " So Narco Corridos, I grew up in South America.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.23,
    "end": 1926.711,
    "text": "So Narco Corridos are a subcategory of Norteño music that is about Mexican drug cartels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.791,
    "end": 1930.232,
    "text": "And here are some of the Narco Corrido, Chalino Sanchez, apparently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.252,
    "end": 1932.013,
    "text": "El Comander is another one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.053,
    "end": 1934.574,
    "text": "These are the most famous Narco Corridos writers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.854,
    "end": 1939.555,
    "text": "So one of the things I love about the brain is that there's always a sense of up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.056,
    "end": 1948.2,
    "text": " Because of this one little thing that Harlan the inventor invented back when, there's always a sense of north or up or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.26,
    "end": 1952.642,
    "text": "It's like when you're scuba diving, the way to get out of trouble is follow the bubbles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.862,
    "end": 1955.103,
    "text": "I've always got bubbles here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.243,
    "end": 1958.245,
    "text": "And they mean whatever I made them mean when I started building this space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.625,
    "end": 1962.627,
    "text": "I've met a couple of people who only do lateral links and their brain was senseless to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.647,
    "end": 1963.507,
    "text": "I couldn't follow it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.807,
    "end": 1967.229,
    "text": "But early on, they had decided that this should look like an outline going left, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.429,
    "end": 1968.85,
    "text": "And you could do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.594,
    "end": 1970.455,
    "text": " but it makes a mess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.935,
    "end": 1971.835,
    "text": "It doesn't turn out right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.416,
    "end": 1978.64,
    "text": "And also, by the way, if the link is solid, it means there's something off to the left, off that gate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.98,
    "end": 1981.262,
    "text": "If it's empty, it means there's nothing off that gate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.322,
    "end": 1982.743,
    "text": "So here's Mexican drug cartels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.103,
    "end": 1985.444,
    "text": "So I have the Mexican drug war opposite that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.744,
    "end": 1992.989,
    "text": "Not sure that was a good use of opposite, but that's under the war on drugs in general, which is under why does the US imprison so many people?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.089,
    "end": 1994.33,
    "text": "And there's a bunch of stuff there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.63,
    "end": 1995.551,
    "text": "Actually, I like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.611,
    "end": 1997.292,
    "text": "I've got it under stupid wars we're fighting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.245,
    "end": 2002.987,
    "text": " So that was a little bit too much explanation of up, down, left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.047,
    "end": 2006.869,
    "text": "But I think just by some examples, you can see how I'm using it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.19,
    "end": 2019.898,
    "text": "And again, anybody who comes in and decides to start using the brain at thebrain.com and just download and install the personal brain, try out the free version if you want to do something like this, can make up how they want to do these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2019.978,
    "end": 2027.843,
    "text": "And I think I was lucky in that the moment Harlan opened his laptop and downloaded for me, my wet brain was like, oh, oh, this is how I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2028.698,
    "end": 2033.64,
    "text": " And then as I started using it, I was realizing, oh, I need to groove a couple of habits here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.68,
    "end": 2038.202,
    "text": "And if I groove some habits and if I'm careful about the namespace, this will actually be useful later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.363,
    "end": 2048.126,
    "text": "There's a thought called lessons from 26 years of using my brain, which I don't need to talk about unless you're interested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.507,
    "end": 2055.93,
    "text": "But this is where I actually catalog insights I've had about using this particular tool to curate a memory for 26 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.548,
    "end": 2059.728,
    "text": " Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.128,
    "end": 2061.449,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.049,
    "end": 2063.329,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.69,
    "end": 2068.311,
    "text": "Some questions from live chat or is there anything you want to bring up or ask right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.411,
    "end": 2069.631,
    "text": "Or I'll go to a live chat question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.711,
    "end": 2071.272,
    "text": "Go to live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2071.292,
    "end": 2072.092,
    "text": "Let's see where that takes us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.772,
    "end": 2073.052,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.212,
    "end": 2075.633,
    "text": "Let's start from the social end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.653,
    "end": 2079.034,
    "text": "Do you have any thoughts on Doug Engelbart?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.854,
    "end": 2082.335,
    "text": "Anything you'd want to add or let's look it up and go from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.075,
    "end": 2083.355,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.375,
    "end": 2084.095,
    "text": "So here's Doug.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2085.136,
    "end": 2087.636,
    "text": "I got to meet Doug a couple times while he was still alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.796,
    "end": 2089.257,
    "text": "Once when he was still pretty lucid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.297,
    "end": 2093.179,
    "text": " And once when he was suffering from Alzheimer's toward the end of his life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2094.639,
    "end": 2103.163,
    "text": "Doug is one of those people who gifted us these brilliant ideas that are visible in the mother of all demos, which is the famous 1968 demo that he did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.183,
    "end": 2106.345,
    "text": "Where did I put it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.178,
    "end": 2112.798,
    "text": " I can't see where I put it up around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2112.838,
    "end": 2114.699,
    "text": "So here's Engelbart 68 demo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2114.739,
    "end": 2117.44,
    "text": "So I've got it right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.5,
    "end": 2119.86,
    "text": "These are all alphabetic down here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.941,
    "end": 2122.141,
    "text": "That's how I have child thoughts organized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.741,
    "end": 2128.363,
    "text": "But here's the mother of all demos, which gives us a whole bunch of things like the mouse and all those kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.963,
    "end": 2131.944,
    "text": "And he also then for the rest of his career,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.862,
    "end": 2140.626,
    "text": " had trouble getting funding, didn't get more ideas out and was a very difficult person to actually sponsor and help keep inventing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.826,
    "end": 2152.291,
    "text": "So like Ted Nelson, I would sort of bundle them together a bunch of really interesting ideas and then thorny, thorny, thorny, like to try to develop their ideas later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.371,
    "end": 2153.352,
    "text": "And they held on to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.867,
    "end": 2179.495,
    "text": " too many of their early early ideas as if that were the only way to do things both of them so that that's some perspective i i just attended uh just a couple weeks ago maybe less uh here's articles about engelbart we just had a uh an open house online uh hosted by my friend carl heavenstrike uh about doug engelbart's 99th birthday and a bunch of people who knew a lot about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.255,
    "end": 2208.966,
    "text": " um Doug and who had met him and worked with him showed up for this zoom call and we had a lovely lovely time awesome thank you thank you love of all for the question okay another set of topics please address the openness and closeness of open Global Mind and just more generally like what about it is open source what is transferable in and out um what what aspects of the communications around the project and the development um how has that changed through time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.677,
    "end": 2210.997,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.157,
    "end": 2213.718,
    "text": "Thanks for asking about Open Global Mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2214.618,
    "end": 2226.702,
    "text": "What we do is pretty much always under CC0 or just Attributus or CC0 or something like that, we're trying to put open things in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.282,
    "end": 2229.483,
    "text": " We haven't created a lot of open source software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.523,
    "end": 2232.404,
    "text": "We've done some messing around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.424,
    "end": 2239.406,
    "text": "We have a call on Mondays called Free Jerry's Brain, where we wrote some code and then put it over on GitHub.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.066,
    "end": 2245.548,
    "text": "I don't know that anybody knows it necessarily exists, but we use things like GitHub in order to put things out in the commons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2246.988,
    "end": 2248.429,
    "text": " Our conversations are open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2248.469,
    "end": 2249.369,
    "text": "Anybody can join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.509,
    "end": 2256.832,
    "text": "Ping me or I think if you go to Open Global Mind, it says click here to join the community and that'll put you on our Google group mailing list.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.333,
    "end": 2264.676,
    "text": "We try to use open source software where we can, but the brain is not open source and Google groups is not really open source.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.716,
    "end": 2267.037,
    "text": "So we have sort of limitations in that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.057,
    "end": 2269.398,
    "text": "A bunch of the conversations we have are about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.998,
    "end": 2294.457,
    "text": " how do we ideally go into fully open infrastructure the way wikipedia runs on wikimedia and the wikimedia engine and is fully open source so we've not written about as i said we've not written a bunch of code but all the contents uh when i when i showed you the ogm zoom calls um all of this content is uploaded to youtube for everybody to use and see and comment and reuse in any way you want",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.417,
    "end": 2314.294,
    "text": " uh we do that intentionally these are kind of slow conversations about uh the process and uh you can you're welcome to join these conversations any way you want awesome thank you love evolve another question how does this support making better decisions together so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.83,
    "end": 2324.192,
    "text": " Let me just go to decisions for a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2324.893,
    "end": 2326.375,
    "text": "Actual decisions, market research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.395,
    "end": 2327.196,
    "text": "No, I didn't want that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.383,
    "end": 2333.164,
    "text": "Better data for better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.184,
    "end": 2333.664,
    "text": "There we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.724,
    "end": 2339.051,
    "text": "Making better decisions together, which I had under Open Plural Aligned and under decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2342.015,
    "end": 2359.916,
    "text": " one of the pieces of tools for thinking one of the subcategories is things like argumentation maps and decision matrices and decision tools and all those kinds of things so under decision making there should be power tools for decision making for example uh there's there are a bunch of tools",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.209,
    "end": 2387.384,
    "text": " most of which nobody's ever heard of very few of which people have used a lot but some of which are really really helpful and when we do for example public discourse for decision making in communities or large-scale elections or things like that we're drowning in information and advertisements for the candidates and all that and we don't really have a lot of collective data we might use together and i think a big piece of what we'd like to do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.274,
    "end": 2408.426,
    "text": " and i don't think ogm open global mind is going to achieve this on its own at all but there are a lot of communities that are neighbors of ours or friends of ours uh jamie joyce with the society library for example is doing really really great work and is just coming out with some interesting things right now um here's jamie and here's the society library tsl",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.786,
    "end": 2435.451,
    "text": " uh she's also connected to canonical debate lab there's something called the great american debate uh which she's also connected with there are a bunch of efforts to figure this out which i'm trying to figure out how do we point to them how do we help improve them how do we help link them to one another and uh and then how do we popularize them and make them more accessible to everybody else which i think is key that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.565,
    "end": 2444.187,
    "text": " If we don't wind up using some power tools, we're going to end up drowning in the information torrent all the time anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.987,
    "end": 2448.607,
    "text": "So the general category I put this under, I guess, is sensemaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.767,
    "end": 2450.828,
    "text": "And I know you've done a bunch of work in sensemaking as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.848,
    "end": 2452.708,
    "text": "I think that's one of the ties that binds us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2454.929,
    "end": 2461.47,
    "text": "I think collective or collaborative sensemaking is a huge and important horizon that we are neglecting at our peril.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.173,
    "end": 2486.487,
    "text": " Instead what's happening is, one of my tropes, one of the things that came up in my head because of my use of the brain was, and also my knowing too much about how intellectual property is overprotected, is the idea that we are drowning in the information flood because everybody invents all flow tools and no stock tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.547,
    "end": 2487.367,
    "text": "And here I'm borrowing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.677,
    "end": 2506.537,
    "text": " stocks and the notion of stocks and flows from system dynamics and a lake is a stock of water a river is a flow of water and if you kind of look around at the information environment you'll find out that everything is flow and very very few things are stock so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2507.336,
    "end": 2516.4,
    "text": " Instagram, Snapchat, Twitter, blogging, the news feeds, email, SMS, texts, WhatsApp, all those things are all flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.5,
    "end": 2517.2,
    "text": "They're all flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.7,
    "end": 2527.684,
    "text": "And one thing I ask people when I have any kind of audience is, hey, when something good goes by in the flow, do you have a place to put it where you know you'll find it again?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.264,
    "end": 2530.125,
    "text": "And maybe it's even improved somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.645,
    "end": 2531.526,
    "text": "And so as I'm saying, 26 years ago,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.098,
    "end": 2542.88,
    "text": " I happened across this tool that mapped, they pitched me this tool that mapped really nicely to how my brain happens to work, which might be how 10% of the population's brains work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.9,
    "end": 2543.42,
    "text": "Maybe it's 6%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.04,
    "end": 2544.82,
    "text": "I have no idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.84,
    "end": 2554.342,
    "text": "I'd be really interested in a study that says, here are the major subgroupings of how people think, and here are the tools that best fit, how you represent things, how your workflow works, all of that, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2555.882,
    "end": 2557.582,
    "text": "And so there's so few things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2557.842,
    "end": 2560.703,
    "text": "One of the cool things about Wikipedia is that it's a stock of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.783,
    "end": 2561.643,
    "text": "Wikis are stock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.799,
    "end": 2564.02,
    "text": " but everything else is flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2565.1,
    "end": 2576.648,
    "text": "And so I think that sense-making requires us to slow down and feed the stock of information thoughtfully, to curate with care, and then to compare notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.968,
    "end": 2586.214,
    "text": "And I'm really interested in what Steve Bannon, who I'm not a big fan of, but I've got Steve Bannon in my brain, and I went and I listened to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.673,
    "end": 2591.194,
    "text": " Where's the interview I'm looking for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.274,
    "end": 2593.036,
    "text": "Oh, it's under articles about Bannon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.517,
    "end": 2599.981,
    "text": "Hold on, let me just go to Bannon assertions because I know I've got that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.861,
    "end": 2603.343,
    "text": "So Steve Bannon interviewed by Zannie Minton-Beddoes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.563,
    "end": 2605.685,
    "text": "Oh, this is Bannon after Trump's administration role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.745,
    "end": 2607.727,
    "text": "I should connect this up to Steve Bannon directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.027,
    "end": 2608.207,
    "text": "Done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.728,
    "end": 2616.454,
    "text": " So I listened to this interview by the editor in chief of The Economist, and here's what I heard Bannon say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2616.474,
    "end": 2625.001,
    "text": "Now, I've never met the man, I haven't talked with him, but I'm really interested in comparing notes actively in some space like this so that we might make better decisions together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.021,
    "end": 2633.448,
    "text": "And Bannon wants to, as far as I can tell, he wants to accelerate the destruction of today's institutions so that he can be the guy to rebuild the new ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.949,
    "end": 2637.752,
    "text": "And he's trying to work with far right people around the world to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.735,
    "end": 2640.136,
    "text": " And knowing that's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.176,
    "end": 2640.796,
    "text": "I have a thought here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.976,
    "end": 2643.297,
    "text": "Bannon is a brilliant evil strategist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2643.957,
    "end": 2646.498,
    "text": "Purple, by the way, usually means editorial on my part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.099,
    "end": 2649.88,
    "text": "And yellow usually means, hey, there's a bunch of stuff here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.06,
    "end": 2651.681,
    "text": "Yellow is collections.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.221,
    "end": 2654.262,
    "text": "White is the default color for all thoughts anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.082,
    "end": 2657.303,
    "text": "So I hope that answers a piece of the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2660.56,
    "end": 2661.661,
    "text": " There's a lot to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.901,
    "end": 2663.722,
    "text": "Okay, let's continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.822,
    "end": 2667.805,
    "text": "This is what happens when you've been doing something semi-obsessively for 26 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2668.886,
    "end": 2675.03,
    "text": "But I could be making dioramas of San Francisco's Bay Area waterfront out of used toothpicks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.49,
    "end": 2677.452,
    "text": "And there is an artist who did that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2678.753,
    "end": 2680.534,
    "text": "But it wouldn't be as useful as this, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.421,
    "end": 2705.697,
    "text": " let's get to this question of use in the chat still in all of this i'm not hearing how jerry's brain helps people so where's the toothpick where's the toothpick gold gate hyatt bridge guy uh stephen bachman sorry that's beautiful um so how is this how do people use it where have you seen it be useful um in the past 26 years and and what are you excited about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.337,
    "end": 2709.482,
    "text": " for its embodied pragmatic use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.083,
    "end": 2710.404,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.965,
    "end": 2712.908,
    "text": "So I own jerrysbrain.com.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.789,
    "end": 2716.213,
    "text": "Thebrain.com will take you to the company that made the software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.333,
    "end": 2718.316,
    "text": "I have nothing to do with making the software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.085,
    "end": 2720.566,
    "text": " As I said, I was on their first press tour.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.728,
    "end": 2726.312,
    "text": "I do own jerrysbrain.com where you can go and you can launch my brain and you can go browse around it all you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.273,
    "end": 2734.52,
    "text": "The URL bra.in slash jerry, all lowercase, will also take you directly to my brain on the web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.56,
    "end": 2736.642,
    "text": "So you can write that down or remember it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.302,
    "end": 2741.465,
    "text": " And I get emails from people because the brain is not a great collaboration tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.506,
    "end": 2743.587,
    "text": "So somebody has to find me and send me an email.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.048,
    "end": 2748.671,
    "text": "But I get a bunch of emails from people that say, hey, thank you for publishing your brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.091,
    "end": 2750.032,
    "text": "I've learned how to use it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.272,
    "end": 2751.794,
    "text": "And I noticed that you don't have this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.094,
    "end": 2753.655,
    "text": "Have you thought of adding it or whatever?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.075,
    "end": 2755.677,
    "text": "And if I don't have it, I'll add it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.877,
    "end": 2759.4,
    "text": "If I do have it, but it's just named something different, I'll write them back and I'll say whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2760.828,
    "end": 2769.274,
    "text": " I'm basically way more obscure than I would like to be because the tool is so quirky and sometimes frightening to people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.874,
    "end": 2771.836,
    "text": "And as I said, if you kind of get used to it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.709,
    "end": 2777.731,
    "text": " I did kind of a survey, just a small survey of people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.832,
    "end": 2786.034,
    "text": "Out on the long tail, there's a bunch of people who are very happy going to my brain without me and have figured out how to use it and get around and learn stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2786.074,
    "end": 2795.158,
    "text": "And one of my friends more than a decade ago said, Jerry, I've learned that when I hit a new topic that I don't know very much about, one of the first things I do is I go to your brain and see what you found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.295,
    "end": 2804.063,
    "text": " Because often the things that I found don't have any current Google juice, so they won't show up in a Google search, but they're still really useful documents, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.563,
    "end": 2805.484,
    "text": "Or videos or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.665,
    "end": 2813.191,
    "text": "And then there's another piece of the tale, which is people who find the brain really useful, but only when I'm giving a tour or there to answer questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.471,
    "end": 2814.953,
    "text": "And I totally understand that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.333,
    "end": 2817.115,
    "text": "It's just not very good leverage of my time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.435,
    "end": 2818.296,
    "text": "But I love doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.886,
    "end": 2822.59,
    "text": " So I tried years ago, I tried as a piece of my business model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2822.61,
    "end": 2828.495,
    "text": "I put up the website picjerrysbrain.com and I put a pricing schedule up, but I really didn't publicize it very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.296,
    "end": 2837.183,
    "text": "But I thought, hey, I would love to make a living using both brains to help people sort through problems because I love troubleshooting things on the fly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.264,
    "end": 2841.808,
    "text": "And as you can see, I can use this thing on the fly pretty easily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.369,
    "end": 2851.113,
    "text": " And as I said earlier, but I didn't explain it very well, I really want what I've built here to be an inoculation into the big fungus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.694,
    "end": 2858.497,
    "text": "And I think the big fungus or whatever it winds up being called, because my history is I'm pointing in the right direction, but I don't name the thing properly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.817,
    "end": 2862.819,
    "text": "I wrote an issue of Esther's newsletter in 1995, 1996, titled What's a Zine?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.839,
    "end": 2863.92,
    "text": "Then it turns out weblogs show up in 97.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.618,
    "end": 2874.7,
    "text": " But I described weblogs in 1995.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2875.361,
    "end": 2878.302,
    "text": "In June of 1995, I described weblogs, but I called them zines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.702,
    "end": 2882.765,
    "text": "So I'm trying to say that this big fungus, I think, thing is going to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.085,
    "end": 2894.691,
    "text": "And I'll bookmark a question that we should probably address, which hasn't been asked in your live chat yet, which is, hey, doesn't Gen AI just obsolete all this heavy lifting manual curation work thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.412,
    "end": 2896.292,
    "text": "And I don't think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.293,
    "end": 2898.113,
    "text": "So I have a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.177,
    "end": 2908.331,
    "text": " I have the thought, does ChatGPT obsolete note taking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.3,
    "end": 2912.061,
    "text": " which has come up in a couple of our recent calls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.101,
    "end": 2913.322,
    "text": "That's how I make the links here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.842,
    "end": 2923.771,
    "text": "And I don't think, I think ChatGPT superchargers note-taking, and I also think that things going through our heads are really important, that us memorializing things in some explicit way is also important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.191,
    "end": 2933.919,
    "text": "I'm incredibly interested in the complementary intertwingling of my brain and the new cyber brains in Gen AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.939,
    "end": 2936.821,
    "text": "I think that's a really, really wonderful frontier to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2937.062,
    "end": 2938.523,
    "text": "But I don't think that we should just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.105,
    "end": 2944.794,
    "text": " turn into the people on the couches in Wall-E and just rely on the big new AIs to do all the work for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.834,
    "end": 2945.736,
    "text": "I don't think that ends well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.895,
    "end": 2952.836,
    "text": " So many fun directions and questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.956,
    "end": 2957.757,
    "text": "Let's go back to free energy principle and just kind of situate ourselves there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.037,
    "end": 2974.58,
    "text": "Of course, there's many research or theoretical things like we could talk about how this is digital stigmergy and about how we're in now a feedback with our pheromone distribution and moving the pebbles around and just the level of tangibility it brings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.82,
    "end": 2994.39,
    "text": " and um about the experience and the craft of the learning and the work and the attention and about situating yourself some people might have a more visual or they do a memory palace other people might really be on the fly and super nimble with their notes app and it's kind of like whatever works",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.871,
    "end": 2997.972,
    "text": " and all the learning that goes into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.112,
    "end": 3001.433,
    "text": "And then this is one trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.533,
    "end": 3018.02,
    "text": "This is like the Grand Canyon of tools, probably with a lot of lock-in on up, left, down, lock-in on software, in and out, or limitations and all these different things, as any canyon would be expected to be after being worn down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.72,
    "end": 3022.762,
    "text": "And that's what transports the water and the flow and is the stock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.782,
    "end": 3024.303,
    "text": "So it's not exactly just like a river,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.963,
    "end": 3039.275,
    "text": " But it's amazing to see that, yeah, this is one incremented trajectory with no claims to be anything other than one filament in the broader mycelial network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.175,
    "end": 3042.137,
    "text": "And who else is in that network?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.197,
    "end": 3042.998,
    "text": "And how do we know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.038,
    "end": 3043.998,
    "text": "And how do we share?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.118,
    "end": 3044.859,
    "text": "How do we trust?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.44,
    "end": 3049.343,
    "text": "All these big questions about our attention and our information environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.763,
    "end": 3054.387,
    "text": "So it's just awesome to see how far this has come and then what it elicits",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.307,
    "end": 3058.749,
    "text": " I love that, and you're right on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.091,
    "end": 3063.456,
    "text": "What you're saying makes complete sense to me and is a lot of why I'm doing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.677,
    "end": 3065.078,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3069.235,
    "end": 3076.437,
    "text": " Okay, one angle could be about knowledge systems of and for cognitive modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.437,
    "end": 3083.919,
    "text": "Another possible direction would be the collaborative sense-making and decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.219,
    "end": 3088.64,
    "text": "And where do you see this going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.68,
    "end": 3090.181,
    "text": "You mentioned generative AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.201,
    "end": 3095.142,
    "text": "Where do you see some adjacencies or ways that are exciting right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.854,
    "end": 3104.778,
    "text": " Yeah, I think that the low-hanging fruit may be the collaborative decision-making and just figuring out issue mapping or whatever else you want to call it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.099,
    "end": 3107.88,
    "text": "As you've seen here, it goes by lots and lots of different names.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3109.601,
    "end": 3111.121,
    "text": "And it's complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.622,
    "end": 3116.864,
    "text": "It's really complicated because sometimes we don't even mean the same thing by the same word, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.445,
    "end": 3120.146,
    "text": "If I ask you, what is democracy or what is capitalism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.129,
    "end": 3128.915,
    "text": " We're going to have a really good long time even getting to a consensus description, never mind if four other people join our conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.596,
    "end": 3136.423,
    "text": "This is hard and it takes time, but it turns out that other people have wrestled with a lot of these issues and made really good sense of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.983,
    "end": 3140.466,
    "text": "If we find them and click their answers into the puzzle, there's shortcuts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.558,
    "end": 3157.126,
    "text": " And instead of philosophers and philosophies being these far-off silos of thinking, like, ooh, somebody's a Heidegger scholar, why don't we sort of glue these things together to figure out what are the piece parts that make a lot of sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.965,
    "end": 3161.847,
    "text": " The huge question is, how do we present what makes sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.907,
    "end": 3163.088,
    "text": "How do we make our way through it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.228,
    "end": 3164.689,
    "text": "How do we pick our way through the forest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.51,
    "end": 3169.613,
    "text": "And there, I just have to say, we have to try a lot of different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.713,
    "end": 3171.835,
    "text": "We have to try a lot of different presentation methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.757,
    "end": 3184.725,
    "text": " There's a whole bunch of different ways in which people absorb what's happening in the world and make their own sense of it, and then make an attempt to explain their perspective on it to someone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.086,
    "end": 3188.428,
    "text": "I wish we were doing a whole lot more of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.169,
    "end": 3192.031,
    "text": "It's funny, I did a podcast with Tiago Forte.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3192.051,
    "end": 3204.001,
    "text": "I did a podcast with Tiago and someone else where we were talking about his use of, he's the build a second brain guy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.824,
    "end": 3211.706,
    "text": " And I learned in this podcast that his second brain, which he's famous for, is his private external brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.126,
    "end": 3215.426,
    "text": "And his third brain is actually when he publishes anything outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.446,
    "end": 3216.367,
    "text": "That's how he thinks about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.827,
    "end": 3222.988,
    "text": "And I sort of did a facepalm because I realized that everything I put in my brain is by default public.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.208,
    "end": 3227.789,
    "text": "I have to open a thought and click this little lock symbol to make anything private.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.105,
    "end": 3232.527,
    "text": " And when I click this little lock symbol, then a little lock shows up under the icon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.547,
    "end": 3234.268,
    "text": "And you don't see a lot of locks here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.508,
    "end": 3235.429,
    "text": "There's one over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.649,
    "end": 3248.256,
    "text": "So I'm actually outboard most of the time and working as openly as I can in an obscure little corner of the world because of the obscurity of the tool and the scariness of the tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.836,
    "end": 3252.158,
    "text": "But I'm particularly interested in how do we make",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.388,
    "end": 3278.025,
    "text": " the tools less scary how do we encourage people to share a lot more about what they think and see um and i had a wishware idea some time ago maybe before even elon musk ate twitter and renamed it x of what if twitter had a service where it would show you from its own analysis how many of your retweets were basically known uh known misinformation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.306,
    "end": 3280.907,
    "text": " That'd be a really interesting service.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.987,
    "end": 3282.607,
    "text": "Maybe a third party could do this as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.187,
    "end": 3290.69,
    "text": "But just to see that, oops, dang, you know, 10% of what I retweeted or 80% of what I've been retweeting is known misinformation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.73,
    "end": 3292.39,
    "text": "And it could sort of show you why and where.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3292.41,
    "end": 3295.531,
    "text": "That would be really interesting for decision making as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.352,
    "end": 3304.194,
    "text": "And then I have a thought called emotion and membership.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.174,
    "end": 3306.475,
    "text": "Trump reason most of the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.347,
    "end": 3315.952,
    "text": " So everything I've been talking about so far in this call is really about reason and logic and evidence and sense making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.832,
    "end": 3328.859,
    "text": "But I will be among the first to say that, well, hell, most of what we make decisions on is do I like this person or does this fit my narrative or any of those things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3329.499,
    "end": 3333.201,
    "text": "And will agreeing with this get me kicked out of my tribe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.441,
    "end": 3334.022,
    "text": "That's huge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.442,
    "end": 3336.143,
    "text": "That's just absolutely huge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3337.202,
    "end": 3340.705,
    "text": " And so I'm interested in that side of it as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.825,
    "end": 3356.675,
    "text": "I think that if we don't address emotional resonance and all of the very subtle things, I was reading a book about intergenerational trauma on my flight home this morning, and apparently trauma has epigenetic effects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.996,
    "end": 3364.08,
    "text": "Trauma affects gene expression, and you are not born with a clean slate of whatever the hell DNA your parents had.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.621,
    "end": 3365.942,
    "text": "You are born with some pre-",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.969,
    "end": 3374.78,
    "text": " conditions that have to do with things that happened maybe even several generations back in your family, especially if they weren't dealt with in different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.22,
    "end": 3376.322,
    "text": "And I'm like, oh, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3376.482,
    "end": 3379.065,
    "text": "I know exactly where to look in my family history for those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.386,
    "end": 3380.988,
    "text": "And I'm about to embark on that journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.229,
    "end": 3384.81,
    "text": " And so this is I guess I'm a scattershot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3384.97,
    "end": 3388.712,
    "text": "I'm an everywhere all at once a little bit kind of effort guy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.212,
    "end": 3393.634,
    "text": "And that doesn't turn out a lot of things that look monolithic and knowable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.174,
    "end": 3394.395,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.775,
    "end": 3406.62,
    "text": "Although in my new books group, I'm I'm busy writing in Markdown as Nuggets, a book about design from trust, which is one of the ideas that showed up in my quest over the last couple of decades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.82,
    "end": 3426.521,
    "text": " thank you for these awesome points like as we're turning over I'm getting the sense of like the uh the nestmate ants walking on a ping pong ball and sort of on a treadmill moving left moving up and down forward and backwards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.262,
    "end": 3453.167,
    "text": " and modifying but mainly just scavenging over and like another aspect of the hope that automated or synthetic intelligence systems will step in and do this work it's like there's this amazing openness like wow what else could you have done with that time and then there's like who you really are what you really showed with skin in the game and attention in the game and like there was like the journey too so if the journey is important and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3453.687,
    "end": 3471.601,
    "text": " seems like it is then there's this element of like revisiting it yeah if you just wanted to have all the wiki links you could just download a snapshot of wikipedia and never look at it um and that's as good as not happening intentionally or if you traverse just three wikipedia pages",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.933,
    "end": 3492.63,
    "text": " then you add another connection you're spinning the web and making a colony can be daunting to start but also very exciting and clean slate to start and then the challenge is as these um peculiarities or just customs of different knowledge systems interact",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.894,
    "end": 3516.186,
    "text": " a lot like different peoples interacting on the earth and now in the informational space we have new ways of these like knowledge systems and the semantics and the syntax all interacting too and so you're you're looking ahead to to this challenge that's not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.358,
    "end": 3539.208,
    "text": " ahead of us so much as it's already happened and is ongoing and uh it's really interesting also what you said about it being not monolithic and about how many custom works and what looks monolithic versus what is this more rhizomatic or dispersive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.672,
    "end": 3559.749,
    "text": " knowledge way that seems to also co-occur and understand like the affective and the personal and the community components of knowledge and the people which are a fundamental component in your work as much as um the time and the the place in the publication all that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.29,
    "end": 3563.03,
    "text": " I totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.19,
    "end": 3564.45,
    "text": "And you reminded me of a couple of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.331,
    "end": 3574.712,
    "text": "I just went to Rhizomes and Deleuze and Guattari's book, A Thousand Plateaus, ,, and then here's visions that have inspired builders of global brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.812,
    "end": 3581.814,
    "text": "So Teilhard de Chardin's Noosphere, the Memex from Vannevar Bush.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.974,
    "end": 3583.654,
    "text": "I'm not sure exactly how to pronounce his name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.974,
    "end": 3586.915,
    "text": "Indra's Net, which comes out of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3591.022,
    "end": 3594.784,
    "text": " basically Buddhism in lots of different places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3595.104,
    "end": 3602.547,
    "text": "These are all visions of how knowledge or wisdom or insights get shared and built.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.727,
    "end": 3606.608,
    "text": "They've been a bunch of them and they're really exciting and nobody's really gone there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.648,
    "end": 3614.252,
    "text": "In fact, the Encyclopedia Galactica from Asimov's Foundation Series is a version of this, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.512,
    "end": 3617.553,
    "text": "So if you've been watching the Foundation Series on Apple Plus,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.391,
    "end": 3637.196,
    "text": " that's what he's that's what uh harry sullivan's trying to build and then another piece that you reminded me of is if we externalize more of what we believe it's a kind of vulnerability it's it's a kind of putting yourself out there in a way that like well this is what i think and and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.351,
    "end": 3652.364,
    "text": " I will add that these days that feels really more dangerous than it used to because we see the kinds of doxing and, well, I'm not doing this anonymously, but we see that the kinds of backlash that there can be, in particular for very effective ideas sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3652.424,
    "end": 3659.251,
    "text": "If there's a very effective critic, Michael E. Mann just won a million dollars in punitive damage for defamation yesterday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3663.444,
    "end": 3671.39,
    "text": " for basically idiots who were trying to take him down as a very effective climate change evangelist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3672.131,
    "end": 3677.335,
    "text": "And so here's this I added yesterday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3677.535,
    "end": 3677.895,
    "text": "There it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3679.496,
    "end": 3680.878,
    "text": "And that's really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.038,
    "end": 3685.341,
    "text": "And so it's dangerous to put what you believe out there, especially if it gets popular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.481,
    "end": 3688.964,
    "text": "And I got to say, that's a little fear in the back of my head, but I'm so obscure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3689.73,
    "end": 3691.891,
    "text": " that I'm not especially concerned about it right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.351,
    "end": 3708.097,
    "text": "And then the other thing is that if we can externalize what we believe into a place where other people can find it on their own time, it's a little way of doing one of the most useful things you can do when you've hit somebody who has a really different opinion from yours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.397,
    "end": 3711.798,
    "text": "Instead of trying to convince them of anything, you can just ask, tell me more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3713.439,
    "end": 3714.379,
    "text": "And why do you believe that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.419,
    "end": 3717.461,
    "text": " Or what made you come to that conclusion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.041,
    "end": 3718.721,
    "text": "Something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.222,
    "end": 3731.07,
    "text": "And asking someone to put what they think or even just to like what they think out there in the world is a form of doing that inquiry on your own time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.931,
    "end": 3741.458,
    "text": "And I think the more we can find our way to each other, listening with care, there's a whole bunch of people who feel like nobody's listening to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3742.518,
    "end": 3742.879,
    "text": "Nobody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.054,
    "end": 3753.521,
    "text": " And they've got a lot to say, they've thought about things long and hard and they haven't found an outlet or a community or we're sort of in an epidemic of not listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.364,
    "end": 3758.685,
    "text": "Which is a thought I've got in my brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.119,
    "end": 3774.934,
    "text": " And so in a sense, what I'm trying to do here is weave all these things together into a narrative that might make sense for how we deal with the important issues that we're all facing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3778.823,
    "end": 3793.513,
    "text": " oh there's a ton there yes in active inference where we're especially interested in this setting of like two nest mates having a conversation through interactions or through pheromone so two quantum conversants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.494,
    "end": 3814.346,
    "text": " talking through the holographic boundary through the information environment are the real living quantum agents and their communication through through the interface and people are using interfaces for all of what they read and who they know unfortunately that data has been enclosed by surveillance capitalism and such",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.086,
    "end": 3834.326,
    "text": " and so it's already happening now this is a different pheromone profile this is like a colony with a interior decoration and architecture that's culturally different but clearly authentic and natural to the inhabitants and uh it just opens up that question of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.149,
    "end": 3853.284,
    "text": " where the information niche and the action niche and the attention niche are that will respect and allow for flourishing of all of the variation in our situations and all the cognitive diversity agreed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.198,
    "end": 3855.239,
    "text": " Who else is doing this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3855.599,
    "end": 3858.661,
    "text": "I've got my little collection of communities trying to fix world problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.782,
    "end": 3864.886,
    "text": "I know people like Gordon Brander, who's doing the Noosphere protocol, and a bunch of other people nibbling on pieces of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.246,
    "end": 3874.353,
    "text": "I've talked with Danny Hillis, who built the company that Google bought that is Google's knowledge web, and who now has another startup where he's trying to figure out some piece of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.975,
    "end": 3876.735,
    "text": "Who, where, what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3876.795,
    "end": 3877.736,
    "text": "Whose door should I knock on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3883.968,
    "end": 3885.291,
    "text": " There's so many ways to respond to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.331,
    "end": 3886.553,
    "text": "It's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.593,
    "end": 3888.497,
    "text": "It's an eternal question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.244,
    "end": 3895.631,
    "text": "And the traces, some of them could be recorded",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.18,
    "end": 3921.207,
    "text": " and yet it reflects like this living weaving tapestry so even when i see all these companies but but many of them of course are no longer and so being able to share um index cards you could have a different biology um definition you can have a different biography for carl friston but let's agree that the carl friston index card is what it is first art um and then like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.308,
    "end": 3943.548,
    "text": " from there how do we coordinate on the semantics and yes there is this um scene within a scene of the second level knowledge management um which actually connects back to douglas engelbart and the abc concept and the improving improvement and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.784,
    "end": 3950.244,
    "text": " It's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.284,
    "end": 3960.552,
    "text": "I didn't find that much good stuff about ABC and such, but I put ABC under triple loop learning, which is learning to learn and kind of improving the system itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3960.932,
    "end": 3962.693,
    "text": "But here's ABC under Doug.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.794,
    "end": 3964.935,
    "text": "Here's a couple of articles about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.035,
    "end": 3973.26,
    "text": "And he also believed in network improvement communities, which came up, by the way, in the 99th birthday conversation I just pointed to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.28,
    "end": 3975.062,
    "text": "And this is a really lovely idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3975.102,
    "end": 3978.104,
    "text": "And I think of OGM maybe as one of those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3979.372,
    "end": 3980.893,
    "text": " So maybe I'm going to do this just for fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.875,
    "end": 3983.835,
    "text": "And I'll just read a comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.055,
    "end": 3984.536,
    "text": "Love of all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.716,
    "end": 3990.64,
    "text": "I think Jerry's familiarity with the terrain and particularly his narrative of the trajectories is critically valuable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.341,
    "end": 3995.424,
    "text": "And again, this is just the limited traces, even all the typing you could do in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.516,
    "end": 3997.997,
    "text": " Wow, great video effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.778,
    "end": 4013.19,
    "text": "You know more that this just evokes, and that's what I find very interesting in also considering like knowledge work as a craft is like the difference between know how and know that and implicit knowledge and knowing where to look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.73,
    "end": 4015.412,
    "text": "And I know where I put that pebble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.872,
    "end": 4017.634,
    "text": "I know which document to look in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4017.654,
    "end": 4023.619,
    "text": "I know when to just really quickly do control F, really quickly when to do right click, like exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.019,
    "end": 4042.666,
    "text": " Knowing how to work within a knowledge environment, which is something that takes months to years to really build, just like anything, knowing how in the environment and co-creating the environment can go above and beyond knowing that anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.126,
    "end": 4048.108,
    "text": "Because knowing that is what these foundation models are so excellent with right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4049.949,
    "end": 4050.47,
    "text": " Totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4050.91,
    "end": 4055.854,
    "text": "One of my other leading edges right now is I believe that our future is increasingly cyborg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4056.795,
    "end": 4058.357,
    "text": "And cyborg is the word I landed on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.377,
    "end": 4060.018,
    "text": "I had to try out a bunch of other words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.078,
    "end": 4061.259,
    "text": "I still really like cyborg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.579,
    "end": 4064.562,
    "text": "But increasingly, we're going to meld with technology in different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4065.023,
    "end": 4067.345,
    "text": "The runner-up word was centaur, but I don't like it as much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4068.498,
    "end": 4073.759,
    "text": " But how might we be good cyborgs is actually a question that pops out of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.099,
    "end": 4077.12,
    "text": "And there's two very different opposite ways to interpret that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.22,
    "end": 4083.662,
    "text": "One is good cyborg, good cyborg, like I've been domesticated and I'm part of the Borg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4084.322,
    "end": 4093.144,
    "text": "The other way of thinking about that is how can we be ethical participants in this increasingly synthetic blended hybrid stigmatic medium",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.685,
    "end": 4107.855,
    "text": " to make sense of and fix the problems that are around us, some of which are just alienation, loneliness, and not listening, others of which are scientific in nature or economic in nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.909,
    "end": 4133.67,
    "text": " yeah like a common term or attractor and active inference for describing the is there like the scientific side is the ecosystems of shared intelligence and talking about these ecosystems of arising cognitive functionality with all different kinds of things that range from very simple to sophisticated to unknown and how active helps us model those things however",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4134.711,
    "end": 4146.114,
    "text": " even a total snapshot of the location of every molecule, awesome, isn't gonna help us pick a direction to trim tab when it comes to addressing these issues that you raised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.814,
    "end": 4162.758,
    "text": "And so that is where we need something that goes beyond the descriptive, okay, well, here's a carbon copy of the whole ecosystem of shared intelligence, and yet it has so many adjacent possibles that go through the bottleneck of our attention and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.758,
    "end": 4177.526,
    "text": " that we need a community context and we need each other and development and all these other features that are not just the cut and dry that the formal system can be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4177.546,
    "end": 4179.668,
    "text": "Totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4180.568,
    "end": 4185.371,
    "text": "You just brought two things to mind, one of which is I don't think there's one answer to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.391,
    "end": 4193.256,
    "text": "I think that the solutions need to be adapted locally and will be a method of development I really like is just storytelling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.976,
    "end": 4197.539,
    "text": " Hey, here's a bunch of stories about what people in similar situations to yours did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4199.2,
    "end": 4200.621,
    "text": "Does any of these smell good to you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4200.902,
    "end": 4201.882,
    "text": "Do you want to try any of them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.923,
    "end": 4208.388,
    "text": "So I have a thought called I have a thought called revitalizing cities, for example, which I really like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4208.548,
    "end": 4211.73,
    "text": "And under here, I put a whole bunch of here's community led development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.312,
    "end": 4220.237,
    "text": "Here's indigenous people taking back control of their towns, local living economies, the living machine, motor city mapping, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4220.578,
    "end": 4220.698,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4221.497,
    "end": 4233.107,
    "text": " most people don't know a lot of these stories and if i heard some of these stories and then said oh oh the edible landscapes in todd morgan england sound really cool maybe we could do something like that with our community then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4234.011,
    "end": 4260.605,
    "text": " okay great here's a little bit of a template or a boilerplate or a project plan for what they did go customize it make it your own take out all of this do all of that do whatever and only when that happens i think when the people in whatever the community is make the choices appropriate the tools but they need to hear a that there's stories of hope anyway out in the world because a lot of people lack hope but b that this is very doable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4261.225,
    "end": 4264.187,
    "text": " That the barriers to trying some of these things are really actually quite low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.467,
    "end": 4266.068,
    "text": "They just take initiative in doing things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.108,
    "end": 4274.133,
    "text": "So there's a piece of the approach I'm trying to take, which is very fractal and distributed and bottom up from wherever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.153,
    "end": 4279.676,
    "text": "I don't think there's like one, there's not one vision we all have to agree to for this thing to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4280.137,
    "end": 4283.819,
    "text": "And then the second thing I wanted to say is, and this is a different thought altogether, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4284.665,
    "end": 4291.211,
    "text": " One of the things I want to do with these nuggets of wisdom is instrument them as many as possible so that they're more useful in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.291,
    "end": 4292.752,
    "text": "And I'll give you one example for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4296.144,
    "end": 4299.885,
    "text": " There's a pattern language called liberating structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4300.626,
    "end": 4302.907,
    "text": "And it's a pattern language about facilitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.387,
    "end": 4308.409,
    "text": "And one of the best known patterns in it is called one, two, four, all, or also think, pair, share.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4308.749,
    "end": 4314.711,
    "text": "And all it says is, hey, as a facilitator, if you have a big group with a complex issue, you might want to give them all time by themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4315.732,
    "end": 4319.413,
    "text": "One, pair them up, put them in fours, and come back to plenary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4319.733,
    "end": 4320.613,
    "text": "One, two, four, all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4321.134,
    "end": 4321.774,
    "text": "Super simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.234,
    "end": 4323.815,
    "text": "Most people don't know that this exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.855,
    "end": 4324.595,
    "text": "It's really powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.214,
    "end": 4327.36,
    "text": " What if right now you and I are in Zoom?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4327.7,
    "end": 4334.558,
    "text": "What if there was a little Zoom bot that was helping you facilitate or me if I was facilitating that said, hey, Daniel,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4335.146,
    "end": 4337.066,
    "text": " Might you want to use one, two, four, all right now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.266,
    "end": 4338.207,
    "text": "You'd be like, what's that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4338.267,
    "end": 4338.847,
    "text": "Here's what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.007,
    "end": 4339.447,
    "text": "Okay, good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.827,
    "end": 4340.927,
    "text": "Can I help you run it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.087,
    "end": 4344.168,
    "text": "And this is what I mean by instrument, which is again the wrong word probably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4344.648,
    "end": 4356.85,
    "text": "But a piece of code could then set up breakout rooms, name them, put cues in the chat, usher people in and out of breakout rooms, basically do the choreography that a facilitator has to do online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.111,
    "end": 4358.871,
    "text": "And obviously there's an analog in person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4359.991,
    "end": 4364.052,
    "text": "But how do we take more and more nuggets of wisdom and do that with them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4365.627,
    "end": 4372.79,
    "text": " So that and make it open source code, make the knowledge open source, make it available, get the word out, all that kind of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4372.97,
    "end": 4376.431,
    "text": "But then all our facilitators game goes up, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4376.851,
    "end": 4378.212,
    "text": "If the nuggets are any good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.153,
    "end": 4380.493,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.673,
    "end": 4381.473,
    "text": "Two points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.513,
    "end": 4388.316,
    "text": "So first, that's an example of the synchronous facilitation augmentation and also the async augmentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4389.306,
    "end": 4390.307,
    "text": " augmented facilitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.327,
    "end": 4400.692,
    "text": "Like what if one year after every single edit to a document or to a brain or a shared whatever, it checks back in and asks you to revisit just for fun or for some fraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.752,
    "end": 4405.735,
    "text": "It asks for review from other people and just connects the dots more async, not just the synchronous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4406.235,
    "end": 4408.116,
    "text": "And then to make an active inference point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.236,
    "end": 4415.921,
    "text": "So you talked about like kind of showing these inspiring or high agency or sustainable or whatever positive attribute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.861,
    "end": 4446.161,
    "text": " as an exemplar and what that means and so very interestingly in active inference actions are selected based upon being the likeliest thing to happen the path of least action not like the most rewarding in a kind of reward or reinforcement learning setting alone and so there's a lot of world states or community states that seem like well yeah it would be rewarding if everyone in a 200 mile radius had stable housing around me that sounds great i would feel better",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.121,
    "end": 4452.105,
    "text": " And yet everyone can agree up and down and left and right on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.345,
    "end": 4459.089,
    "text": "And yet it can be understood as unlikely and therefore is never a future that comes to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.09,
    "end": 4464.573,
    "text": "And of course, delusions don't lead to success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.673,
    "end": 4469.256,
    "text": "Believing that something is a certain way and hitting the wall is not going to lead to survival or persistence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.736,
    "end": 4473.359,
    "text": "But that's this kind of tension with the expectations and preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.519,
    "end": 4475.52,
    "text": "And then hearing that something is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.001,
    "end": 4476.201,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.801,
    "end": 4480.523,
    "text": " So then, you know, a coin lands on the third side one in a million times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.864,
    "end": 4486.947,
    "text": "But for the five times before or after it did, it was actually like one in ten.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.327,
    "end": 4489.368,
    "text": "And on the time it did, it was one out of one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.849,
    "end": 4498.854,
    "text": "So maybe it could be likely that this is going to happen this way for our community, even though it seems super tough and totally like it's over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4499.474,
    "end": 4502.176,
    "text": "But then it was also over for them and then they were back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.217,
    "end": 4505.578,
    "text": "I'd love to explore that a little bit with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4506.588,
    "end": 4534.345,
    "text": " sometimes what we think is possible or what the model thinks is possible can change dramatically if you shift the frame and and so sometimes i think we make faulty assumptions about what the what the realm of possibility actually is we think that nothing could could really change but it turns out that a lot could change very quickly we just haven't heard that story don't know that idea don't know what the useful frame is one of my heroes is a guy named milton erickson",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.092,
    "end": 4545.836,
    "text": " who was a hypnotherapist back in the Great Depression who had polio a couple times in his life, suffered chronic pain, and learned how to use hypnosis to do therapy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.636,
    "end": 4553.659,
    "text": "And he was known for his handshake induction, which means when we do a handshake with somebody, we kind of go into a little limbic loop where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4554.744,
    "end": 4562.328,
    "text": " kind of out of our control, and he would linger in the handshake to the point where when he let go of your hand, you were in trance, and then he would address your unconscious and give you new options.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.689,
    "end": 4576.977,
    "text": "And he was known for having very short therapy sessions that made massive changes in the client's life, partly because he was reframing what they thought was possible, what their unconscious understood was the repertory of behavior, whatever else that might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4577.217,
    "end": 4579.939,
    "text": "And that's kind of a weird example maybe to use here, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.753,
    "end": 4599.6,
    "text": " I'm a believer that if we can affect how people see the world and one another in some simple but profound ways, that that whole realm of spectra of possibilities can shift dramatically to where things that seem impossible suddenly are like, well, duh, of course, why don't we do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4602.501,
    "end": 4604.942,
    "text": "And then a much simpler example is ride-sharing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4606.92,
    "end": 4616.95,
    "text": " And this goes to my design firm trust thesis, which is before somebody actually had like an app and was able to step into a stranger's car and go someplace and get dropped off and make the payment and feel relatively safe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.651,
    "end": 4620.713,
    "text": "Most people would have said, that's crazy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4621.414,
    "end": 4622.175,
    "text": "Why would that work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.041,
    "end": 4623.742,
    "text": " Who's going to do it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.782,
    "end": 4624.923,
    "text": "Who would climb into a car?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4625.203,
    "end": 4626.064,
    "text": "No way that's going to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.124,
    "end": 4627.425,
    "text": "And then it did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4628.025,
    "end": 4633.169,
    "text": "One of the symptoms of a system designed from trust is that your sphincter tightens a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.57,
    "end": 4636.212,
    "text": "You have this feeling like, whoa, that's certainly impossible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.012,
    "end": 4638.834,
    "text": "Wikipedia is designed from trust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4639.615,
    "end": 4644.198,
    "text": "And I ask people, do you remember the first time you learned how Wikipedia works?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4644.839,
    "end": 4648.562,
    "text": "Was your reaction something like, God, what idiot invented that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4648.722,
    "end": 4649.723,
    "text": "Of course that can't work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.207,
    "end": 4656.191,
    "text": " And then you went in and explored a couple of things you knew something about, and you're like, well, hell, it seems to be working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4657.992,
    "end": 4659.573,
    "text": "And how do I get more of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4660.494,
    "end": 4678.848,
    "text": "So what you just said about what's possible, what the next most likely thing is, the Wu Wei, the action through least action, which is a principle I love, I think is shapeable a lot by how we talk about, describe, perceive, understand, and share things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.6,
    "end": 4705.462,
    "text": " the context and the frame of possibilities for our situation and I'm not sure that the machines will understand that thank you all great points in active inference people talk about the affordances it comes up in digital design too but those are the capacities for action and there was a lot there so um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.125,
    "end": 4731.959,
    "text": " anyone who's watching let's see any remaining questions and then otherwise as we kind of come close to this chapter's end um like what can a young person do what can an elder do how can we all participate and feel around for what we want awesome questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4733.787,
    "end": 4742.898,
    "text": " I think overgeneralizing about generations is a little fraught, but I don't mind the generations kind of stuff until it gets overdone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.918,
    "end": 4749.266,
    "text": "I look at the youngest generations right now, and I think that there's sort of a dumbbell distribution in my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4750.087,
    "end": 4754.231,
    "text": " Over on one side are a bunch of young people who are just on the hedonic treadmill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.271,
    "end": 4755.913,
    "text": "They're like, the world is screwed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4756.514,
    "end": 4763.941,
    "text": "Our elders are handing us a pile of dung, and we might as well just get what we can and enjoy all this clicking and scrolling and whatever else and go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4765.197,
    "end": 4779.321,
    "text": " Out at the other end of the dumbbell are some kids who are way smarter than me, who grew up with the power tools at their fingertips and understand how they work, who understand social dynamics and people, and who are really trying hard to change the world in ways that I find hugely admirable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.821,
    "end": 4783.362,
    "text": "And in the middle are a bunch of other kinds of sorts of people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.322,
    "end": 4788.003,
    "text": "But I don't have some kind of gloomy, doomy feeling about young people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4788.143,
    "end": 4790.364,
    "text": "Like we've always said, oh, the young folk these days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4790.424,
    "end": 4794.265,
    "text": "I think the young folk these days are in large measure phenomenal and fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4794.901,
    "end": 4797.803,
    "text": " And I would love to be helpful to them if there's any way I can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4798.584,
    "end": 4801.045,
    "text": "Please share my email in with the podcast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.105,
    "end": 4804.988,
    "text": "It's associate at gmail, s-o-c-i-a-t-e at gmail.com.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4805.389,
    "end": 4806.609,
    "text": "I'm happy to connect you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4806.669,
    "end": 4811.413,
    "text": "Please join my communities so that we can talk about this and be of help to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.473,
    "end": 4818.858,
    "text": "There's too many older white guys like me in my communities, and I want to be helpful to young people and people who don't look like my demographic whatsoever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4821.4,
    "end": 4832.642,
    "text": " And I think a part of the problem, and I see my mom died a couple of Decembers ago, and she was the last of my and my wife's sort of elders to pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4832.682,
    "end": 4834.122,
    "text": "So we have no parents left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4835.103,
    "end": 4838.863,
    "text": "But I had a lot of trouble with her for the last five years of her life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4838.923,
    "end": 4842.484,
    "text": "And I care a lot about what elders do and how to deal with elders and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4842.984,
    "end": 4847.405,
    "text": "And I think that elders carry a lot of the wisdom that we've been talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4849.053,
    "end": 4865.667,
    "text": " that the many different kinds of things that matter, that solutions found to thorny issues, simple clever hacks to social situations or facilitation or whatever else, elders carry that and they die with it and it goes away once they die mostly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.068,
    "end": 4873.114,
    "text": "So can we encourage them to tell their stories to their families, to share their wisdom with us in some very simple way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.732,
    "end": 4887.868,
    "text": " And now that we have really good speech-to-text transcription and some chat, some LLMs and gen AI out there, can we feed that into the mall and make it more visible, more useful, et cetera, et cetera?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4888.068,
    "end": 4895.056,
    "text": "So I think there's plenty of things to do that aren't easy to get into quite yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.014,
    "end": 4898.895,
    "text": " You've got to scratch and work to figure out how and where.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.295,
    "end": 4903.816,
    "text": "But if more people ask for it and more people work on it, we might actually make some progress there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4904.216,
    "end": 4906.177,
    "text": "And there's an epidemic of not listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.197,
    "end": 4908.278,
    "text": "I said earlier, there's also an epidemic of loneliness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4909.638,
    "end": 4922.322,
    "text": "Consumerism, individualism, modern society that cuts generations apart has sliced and diced up the extended family to the point where it's really easy to feel isolated and alone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4922.622,
    "end": 4923.762,
    "text": "The pandemic didn't help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4925.137,
    "end": 4946.361,
    "text": " and we've got a lot of work to do yeah wow awesome all right let's ask some quick questions from the live chat so susan asks explain what open global mind is and its affordances please you can just briefly summarize what is open global mind what does it enable one to interact with it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.108,
    "end": 4947.288,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4947.468,
    "end": 4951.371,
    "text": "OGM is a community of practice of people who show up normally on Zoom calls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4951.412,
    "end": 4952.913,
    "text": "We've never had a face-to-face meeting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4953.353,
    "end": 4958.097,
    "text": "We're working on the problems around collaborative sensemaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.718,
    "end": 4960.299,
    "text": "Mostly that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4960.579,
    "end": 4963.161,
    "text": "Collaborative sensemaking, very broadly spoken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4964.022,
    "end": 4970.807,
    "text": "And we have a bunch of standing, our affordances are basically four plus standing calls every week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4971.883,
    "end": 4973.564,
    "text": " all of which are visible online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4973.584,
    "end": 4977.126,
    "text": "You can kind of go in my brain or on the web and find all these different artifacts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4977.506,
    "end": 4983.79,
    "text": "And then now and then we'll drop a nugget of something interesting out, but we don't have a lot of outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4984.67,
    "end": 4992.575,
    "text": "In principle, the neobooks project should be turning out some neobooks, which is what we're working on right now, but there's not a lot of other artifacts that we've created.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4993.444,
    "end": 4993.804,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4994.484,
    "end": 4999.467,
    "text": "Could you analogously summarize and give any updates on Free Jerry's Brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.867,
    "end": 5000.667,
    "text": "What is the project?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.747,
    "end": 5001.648,
    "text": "What is its current status?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5002.628,
    "end": 5006.99,
    "text": "So the brain software that I've been showing you that we're still looking at is proprietary software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5007.81,
    "end": 5015.654,
    "text": "And the company is somehow miraculously still alive 26 years after its launch, which doesn't happen to a lot of little software companies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5016.214,
    "end": 5022.677,
    "text": "But I've always wanted to be part of a broader network in an open, collaborative environment where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5023.357,
    "end": 5031.402,
    "text": " the brain was one of many different ways of interacting with the data, but the data was highly connected and woven in this mycelial fashion we've been talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5031.762,
    "end": 5033.823,
    "text": "So pre-juris brain is an attempt to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5034.224,
    "end": 5048.772,
    "text": "We have not succeeded, so I'm still using the brain, as you can see, and the calls wind up being the geekiest of the calls that I've been talking about, of these standing calls, and we occasionally take a bite out of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5050.174,
    "end": 5063.364,
    "text": " I will also add that the version of the brain I just upgraded to the Brain14, and there's a little icon up here that says AI, this version actually has a connection to GPT, but it's done in ways that I haven't really used very much yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5063.384,
    "end": 5073.031,
    "text": "So I'm just beginning to explore how to connect my brain to GPT, but that's part of what we've been doing in FreeJerry's brain is, hey, the brain now has an API, so does GPT.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.952,
    "end": 5075.013,
    "text": "How do we bridge this gap?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.851,
    "end": 5080.274,
    "text": " And some of you will have noticed that I don't have a lot of prose descriptions in my brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5080.294,
    "end": 5082.036,
    "text": "I have a lot of links and nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5082.616,
    "end": 5088.62,
    "text": "And therefore, any kind of gen AI is going to have to infer a lot as it wanders through my brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5089.361,
    "end": 5092.143,
    "text": "And that's the bump we're on right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.203,
    "end": 5094.325,
    "text": "It's like, okay, how do we access that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5094.345,
    "end": 5095.826,
    "text": "And how do we get past the inference hurdle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5097.127,
    "end": 5097.427,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5098.067,
    "end": 5100.309,
    "text": "Another comment and question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.091,
    "end": 5129.524,
    "text": " mojo writes i think the inactivist epistemic community defines the concepts we embody does jerry have a perspective on the redefining of our epistemic community by meta recognizing the abstract nature of intelligence and how different we could shape ourselves from how we've been shaped through generational trauma slash existing perspectival flows that question is several pay grades above me",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5130.619,
    "end": 5132.159,
    "text": " because I barely understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5132.239,
    "end": 5134.58,
    "text": "As you can see, I don't have much under epistemic communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5134.62,
    "end": 5142.442,
    "text": "I've got Peter Haas and epistemology, but I don't have much about Peter and his father Ernst or his wife Mimi, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5144.082,
    "end": 5150.904,
    "text": "But I would love to just actually sit and talk with, was it Mojo who asked the question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5151.964,
    "end": 5155.345,
    "text": "I'd love to sit and talk for a while because I need to learn more about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5155.565,
    "end": 5157.225,
    "text": "And the book I'm reading right now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5158.081,
    "end": 5181.176,
    "text": " um is showing me that so much of what we don't speak about and don't fix is just floating around with us and really urgently needs to be dealt with my wife and i attended a workshop a couple weekends ago just fresh in our minds where we did one of the things the group did was a family constellation which is a way to deal with intergenerational trauma super powerful method",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.835,
    "end": 5184.537,
    "text": " Didn't understand why it worked, but it worked really powerfully.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5185.317,
    "end": 5189.48,
    "text": "And in fact, the woman facilitating said, this always works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.82,
    "end": 5190.54,
    "text": "We don't know why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5194.963,
    "end": 5196.504,
    "text": "So here's Family Constellation's work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5196.864,
    "end": 5198.225,
    "text": "The inventor is Bert Hellinger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5198.345,
    "end": 5199.366,
    "text": "He's the guy who did this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5199.926,
    "end": 5206.47,
    "text": "And that's one path to accessing the kinds of trauma and other sorts of things we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5207.99,
    "end": 5216.793,
    "text": " The book I'm reading right now is by Mark Wolin, and it's titled It Didn't Start With You, How Inherited Family Trauma Shapes Who We Are and How to End the Cycle, published in 2016.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5216.893,
    "end": 5217.093,
    "text": "Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.633,
    "end": 5223.214,
    "text": "Awesome stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5223.714,
    "end": 5224.575,
    "text": "It's all important work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5225.075,
    "end": 5226.715,
    "text": "And it's stuff we can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5226.735,
    "end": 5228.876,
    "text": "It's just we don't know it all, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5231.854,
    "end": 5245.818,
    "text": " very true so in closing where do you want to go where can people join you've mentioned many but how would you like to kind of close this piece thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.515,
    "end": 5252.098,
    "text": " I'm trying to figure out how to do what I'm doing and also make a living over the next decade or two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.118,
    "end": 5255.24,
    "text": "So I'm kind of narrowing down on the different pieces of what I do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5256.26,
    "end": 5259.282,
    "text": "Anyone with good advice, please feel free to reach out and tell me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5259.722,
    "end": 5269.568,
    "text": "If you want to join these activities, as I said, there's the Google group for OGM, which you can find easily by going to the OGM website and a couple other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5272.566,
    "end": 5279.508,
    "text": " I'm especially interested in how to tip more people into wanting to share what they know in fruitful ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5281.489,
    "end": 5289.372,
    "text": "So if you have hypotheses, hunches, if you have your own activities on that front that you'd like to share in, LMK, as we say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5289.392,
    "end": 5301.856,
    "text": "I think that might be a good place to end because I want to, in whatever time I have left, I want to go further into this to see if we can make it actually help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.48,
    "end": 5304.841,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.322,
    "end": 5305.743,
    "text": "GG.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5306.344,
    "end": 5306.865,
    "text": "BRB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5306.885,
    "end": 5308.108,
    "text": "AFK soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5308.208,
    "end": 5308.469,
    "text": "AFK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5308.89,
    "end": 5309.751,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5310.573,
    "end": 5310.713,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]