[
  {
    "start": 6.82,
    "end": 7.52,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.481,
    "end": 11.662,
    "text": "This is Active Inference Guest Stream 68.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.282,
    "end": 13.783,
    "text": "It's January 23rd, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.643,
    "end": 19.245,
    "text": "And we're live with Darius Parvizi-Wayne.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.805,
    "end": 20.926,
    "text": "It's not a podcast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 21.406,
    "end": 23.827,
    "text": "I am confused, but it will be fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 25.048,
    "end": 27.349,
    "text": "Thank you, Darius, for coming on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.529,
    "end": 30.89,
    "text": "Feel free to introduce yourself and the work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.07,
    "end": 33.111,
    "text": "Looking forward to the presentation and discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.568,
    "end": 35.309,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.389,
    "end": 45.458,
    "text": "Yeah, it's a bit odd of an experience to be on this side of the camera and also for it to be live because I'm used to having the benefits of post-hoc editing, although I don't do very much of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.639,
    "end": 47.7,
    "text": "So I'm Darius Parvizi-Wayne.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.74,
    "end": 50.803,
    "text": "I finished my master's at UCL last September.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.884,
    "end": 55.187,
    "text": "I'm currently working at Royal Holloway in a cognitive neuroscience lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.936,
    "end": 58.758,
    "text": " In my own private work, I work in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.798,
    "end": 62.4,
    "text": "You may have seen me on the Active Inference Insights podcast that I do with the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.18,
    "end": 72.145,
    "text": "And I've recently written this paper called Disdrusting the Policy, How Inference Over Action Shapes Our Experience of Temporality and Flow States in Life More Broadly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.165,
    "end": 80.09,
    "text": "This is kind of a follow up from a paper that was submitted earlier last year with Lars Sandberg-Smith, Riddhi Pitliya,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.916,
    "end": 83.438,
    "text": " Jakub Lewinowski, Miles Tuft and Carl Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.178,
    "end": 86.46,
    "text": "And this is a follow up piece to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.141,
    "end": 105.474,
    "text": "Before I start, I'm aware that it's a punchy title and I just want to clarify that I am not proposing to explain temporality or the experience of time entirely because it's an extremely rich area of study in which physics and philosophy and cognitive science converge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.349,
    "end": 125.724,
    "text": " and i do not have the time the effort or the energy to really tackle all of those problems so it's going to be rather specific but i'll make clear where i'm purposefully missing stuff out okay excellent so there's kind of a central question before we even get going which is what is time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.721,
    "end": 132.665,
    "text": " And I want to clarify that I'm not talking really about so-called objective time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.705,
    "end": 138.389,
    "text": "Now, I know that's itself a tendentious and tricky claim to make because of relativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.028,
    "end": 148.895,
    "text": " But we can have a kind of simple definition given to us actually by some wonderful researchers, Bogota and Jabara, who have also worked on active inference accounts of subjective temporality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.456,
    "end": 155.12,
    "text": "They define objective time as the temporally sequential development of worldly processes bound relatively to space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.42,
    "end": 159.143,
    "text": "And so that will incorporate space time as a concept in physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.743,
    "end": 163.446,
    "text": "So it's spatial in the sense that it follows spatial laws and it's indivisible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.267,
    "end": 165.668,
    "text": "And then it's directional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.688,
    "end": 167.229,
    "text": "Now, this is a little bit more controversial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.096,
    "end": 175.702,
    "text": " But this ties time to thermodynamic entropy, which goes up in closest or stays the same or goes up in closed systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.062,
    "end": 177.223,
    "text": "Second law of thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.703,
    "end": 179.544,
    "text": "And this is the so-called thermal time hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.945,
    "end": 184.228,
    "text": "Those are the sort of researchers to go to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.168,
    "end": 191.433,
    "text": "As I said at the beginning, there are obviously diverse accounts of time, especially in philosophy of time and the physics of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.216,
    "end": 207.509,
    "text": " So three main contenders are presentism, which states that only the present exists, the growing block universe, which states that the past and the present exist, and the future is yet to exist, and eternalism, which says that basically they're all happening now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.969,
    "end": 211.752,
    "text": "So I believe that there are dinosaurs is still true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.253,
    "end": 214.835,
    "text": "I don't really want to delve into those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.195,
    "end": 219.979,
    "text": "If people do, I would start with the work of someone like John McTaggart,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.618,
    "end": 224.321,
    "text": " who was very instrumental in developing the philosophy of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.901,
    "end": 230.506,
    "text": "And of course, there's a lot of work being done by Carlo Rovelli, among others, on the physics of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.946,
    "end": 233.508,
    "text": "But what I'm more interested in today is subjective time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.648,
    "end": 235.009,
    "text": "Time is experienced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.69,
    "end": 239.253,
    "text": "Time is a phenomenon in the sense of being phenomenological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.253,
    "end": 248.46,
    "text": "Now, it seems to me when I started writing this paper, everyone had made the assumption that it flows, that there's what's called a passage phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.756,
    "end": 253.101,
    "text": " And my account is predicated on the idea that time flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.621,
    "end": 263.276,
    "text": "That said, there is a question mark after that, because it turns out there's a fair dose of skepticism about this notion that time flows even within phenomenal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.002,
    "end": 270.627,
    "text": " So this could be construed as scepticism over passage phenomenology rather than objective passage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.227,
    "end": 273.449,
    "text": "And these are people like Callender, Deng and Miller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.53,
    "end": 278.893,
    "text": "So, for example, Miller thinks actually it's our linguistic structures which give us that impression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.293,
    "end": 285.318,
    "text": "Deng thinks it is just successive temporal events without this notion of flow or passage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.158,
    "end": 310.221,
    "text": " um this paper and this talk i guess can act as a riposte to that again i'm not going to delve too much into their arguments uh i would just like to take at least for this talk they need to be treated as some sort of axiom that's flowing and then the other thing is that it's thick and that's a slightly strange adjective um for me to use here especially for people who aren't familiar with the cognitive science of time what does it mean for temporality to be thick well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.999,
    "end": 313.581,
    "text": " That leads us very nicely onto this man.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.021,
    "end": 319.345,
    "text": "This is Edmund Hussle, who was the godfather, the progenitor of phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.646,
    "end": 320.686,
    "text": "He taught Heidegger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.067,
    "end": 322.668,
    "text": "And so the lineage really starts with him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.468,
    "end": 326.551,
    "text": "And I also have to mention William James because he's very important in this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.111,
    "end": 332.295,
    "text": "And William James, actually, he came up with the notion of what's called a specious presence and what we could call a thick presence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.027,
    "end": 342.83,
    "text": " And this is the notion that, well, when we divorce objective time and subjective time, we can cast objective time as following this kind of linear sequential order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.311,
    "end": 361.557,
    "text": "So going back to the Bogota and Jabara definition, we have A, then B, then C. Now, Husserl, in his examinations of subjective experience and phenomenality, realised or recognised or postulated that the present moment is not just this...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.138,
    "end": 369.4,
    "text": " in this divisible unit of time that can be separated from the past and the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.86,
    "end": 386.325,
    "text": "Rather, what makes up the present moment is itself a constitution of what he called the primal impression, which we can argue is this, or we're going to talk about that in a sec, this very narrow slice of nowness, but also what has just passed and what it's about to become.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.845,
    "end": 392.587,
    "text": "So, for example, this is a diagram, it's an adaptation from one of Herschel's diagrams, because Herschel's also a mathematician,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.231,
    "end": 403.999,
    "text": " But as we can see here, let's take this time point B. So this is objective time point B. What we're saying here is that B is also constituted by what's called a retention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.379,
    "end": 404.599,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.98,
    "end": 406.2,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.3,
    "end": 407.721,
    "text": "A retention of what's just happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.861,
    "end": 408.862,
    "text": "So we're looking at this line here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.463,
    "end": 410.523,
    "text": "So retention of what just happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.543,
    "end": 413.165,
    "text": "This is a. So retention of what's happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.185,
    "end": 415.447,
    "text": "A. But see how here it's in brackets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.807,
    "end": 416.628,
    "text": "It's a part of B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.971,
    "end": 425.058,
    "text": " And a sort of what equals a protention, what we could say an active influence is a prediction of what's about to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.278,
    "end": 429.682,
    "text": "And so this would be C. Now, C in terms of objective time hasn't actually happened yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.302,
    "end": 436.628,
    "text": "But the sort of expectations which are to be fulfilled or not fulfilled constitute the experience of B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.418,
    "end": 454.311,
    "text": " And so do the residual memory in some sense of A. Now, Husserl makes it very clear that this account of temporality is very different from explicit recollection or expectation or imagining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.912,
    "end": 461.197,
    "text": "Rather, this structure is the very structure that defines time consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.077,
    "end": 487.201,
    "text": " and so we can kind of see in some sense how flow already comes out of this insofar as protentions are fulfilled or unfulfilled and therefore become retentions which are which recede back in time but also have this predictive element i.e they remit i.e they are pro tensing what's going to happen and i think to get a little bit more clarity on this picture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.998,
    "end": 490.26,
    "text": " It's worth just discussing this notion of a primal impression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.68,
    "end": 497.326,
    "text": "So I think the primal impression is for my reading, and I highly recommend this Gallagher and Zahavi paper because I think it's incredibly illuminating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.107,
    "end": 509.297,
    "text": "The primal impression most people take as real and as constituting what Gallagher and Zahavi call the component of consciousness that is narrowly directed towards the now phase of the object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.377,
    "end": 511.919,
    "text": "OK, so it's a little bit vague what that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.268,
    "end": 517.749,
    "text": " And actually, I think it's more parsimonious and slightly more elegant to say that it's an abstraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.629,
    "end": 536.913,
    "text": "And this is actually kind of in line with Derrida's reading of Hercule, where he distinguished the theoretical construct of the primary impression, which is useful for us in modelling and in an instrumental way, from the actual thing that appears in the phenomenological presence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.393,
    "end": 538.853,
    "text": "That word is always horrible to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.637,
    "end": 546.323,
    "text": " And so my argument here in some way is that the nowness, what now is, is in a sense already anticipated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.003,
    "end": 550.486,
    "text": "It's already anticipated because it's been protended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.506,
    "end": 557.152,
    "text": "And that protention is, in a sense, a retention already because it's projecting into the next step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.572,
    "end": 559.974,
    "text": "And it's already predictive of what's going to come at T plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.848,
    "end": 573.356,
    "text": " So we can treat the present moment itself as the result of prediction and then the fact that a prediction about the next step and then the fact that that prediction is going to be fulfilled or unfulfilled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.816,
    "end": 581.361,
    "text": "Now, this before I get onto the flow of time, I recognize that this is complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.04,
    "end": 586.642,
    "text": " And it requires some non-linear ways of thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.222,
    "end": 601.727,
    "text": "I highly recommend Bogota and Jabari's 2023 paper, where they actually give a very nice Bayes graph, an active inference account of this exact way of combining objective time and subjective time in a Herculean way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.747,
    "end": 605.628,
    "text": "And I think that should clarify exactly what I mean here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.428,
    "end": 615.155,
    "text": " Again, I'm not actually too interested in deriving a perfect structure in an active inference sense, a perfect model of Herzl's time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.215,
    "end": 619.919,
    "text": "I think that's been done very well by Bogota and Jabara and also people like Malal Barassin and her team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.579,
    "end": 623.302,
    "text": "What I'm more interested in is in the flow of time per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.382,
    "end": 625.043,
    "text": "What's the difference there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.063,
    "end": 627.705,
    "text": "Well, this is the structure of the present structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.28,
    "end": 640.268,
    "text": " as is, as time consciousness as is, I'm more interested in the fact that time seems to flow, that the present seems to flow into the past and the future seems to flow into the present, and that itself is a bit more of a diachronic process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.209,
    "end": 645.031,
    "text": "So that takes me to the accounts of time's flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.591,
    "end": 656.859,
    "text": "Now, whereas the structure of time consciousness, as I said, has been explored quite comprehensively within the active inference community and beyond, the notion of time's flow, perhaps because some are skeptical that time does flow,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.58,
    "end": 660.482,
    "text": " has itself maybe been touched upon a little bit less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.042,
    "end": 669.987,
    "text": "The most famous or the most, yeah, I guess the most concrete proposal comes from Yackel Howey and his colleagues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.207,
    "end": 679.332,
    "text": "And they argue that the flow of time arises as a system gives up one hypothesis and settles on a new one due to its propensity for distrusting the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.812,
    "end": 683.614,
    "text": "So this is a rather famous 2015 paper called Distrusting the Present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.234,
    "end": 685.255,
    "text": "And the notion here is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.959,
    "end": 697.006,
    "text": " Every hypothesis, every state hypothesis I have about my observation is going to be really good for that observation, but immediately it's going to become less and less good because the world changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.787,
    "end": 702.63,
    "text": "And so because I have a higher order expectation that the world is going to change, it's actually adaptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.67,
    "end": 712.957,
    "text": "It's in my best interest as a free energy minimizing system to start to distrust this hypothesis because it's not going to be capable of explaining the sensations, the observations at T plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.664,
    "end": 734.862,
    "text": " so this is put very nicely by them as the hierarchical system settles on this hypothesis which for them is best at minimizing prediction error this is continuous state space stuff so that's totally fine it needs to begin looking for a new and better hypothesis and again that's contingent on this higher order expectation that the world will change crucially",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.111,
    "end": 738.232,
    "text": " And I will explain this in more depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.292,
    "end": 744.193,
    "text": "The mechanism that I think Jacob is proposing here is perceptual and attentional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.853,
    "end": 749.714,
    "text": "And we would cast that as the A matrix within POMDP schemes in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.294,
    "end": 756.416,
    "text": "And that really casts or encodes the probability distribution of the likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.006,
    "end": 762.877,
    "text": " So that is, what is the likelihood of this state given my observations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.441,
    "end": 767.785,
    "text": "What is the likelihood of this observation given my state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.286,
    "end": 769.689,
    "text": "The posterior is X given Y.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.613,
    "end": 783.019,
    "text": " And the idea here is that the observation at time t is yielding precise likelihoods that are going to govern a hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.299,
    "end": 790.082,
    "text": "But because the potential spotlight is always moving around and the world is changing, that observation itself is going to lose precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.602,
    "end": 796.065,
    "text": "And so the new observations which yield different hypotheses are going to gain precision, and therefore the system needs to update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.405,
    "end": 798.966,
    "text": "But I think most crucially is this notion that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.816,
    "end": 826.449,
    "text": " it's perceptual and it's about state or hypo as he calls it a hypothesis updating a state hypothesis updating and potentially for us he also jacob and his colleagues mention also the flow the speed of the flow of time so we're now adding another dimension to this phenomenology um and i won't read out the whole thing because that's a bit dull but basically he's saying that the faster",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.216,
    "end": 834.119,
    "text": " or the more frequently one updates one's hypothesis about the world, the faster time seems to flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.7,
    "end": 837.681,
    "text": "So, for example, he gives the example of a war zone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.841,
    "end": 846.105,
    "text": "Well, in a war zone, and I think this is totally reasonable, the perceptual hypothesizing has to keep updating because it's volatile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.585,
    "end": 854.849,
    "text": "So at one moment I might be perceiving X and the next moment I might be perceiving Y, but the frequency of that is happening a lot faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.565,
    "end": 865.671,
    "text": " In a different scenario, such as waiting in a dull airport, the idea would be that I don't expect the world to be that volatile because maybe I'm just staring at a wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.131,
    "end": 872.915,
    "text": "And so I don't have to do this perceptual updating or this hypothesis updating, as Jacob describes it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.636,
    "end": 875.617,
    "text": "Now, what's the problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.998,
    "end": 880.36,
    "text": "This is nine years old, and I haven't really seen anyone say that there's a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.701,
    "end": 883.862,
    "text": "But I thought there might be a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.497,
    "end": 888.34,
    "text": " And my problem, in a sense, is the fact that this account is fundamentally perceptual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.98,
    "end": 896.526,
    "text": "And so there are three situations I want to bring up here, and then I'll talk about how they pertain to the question at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.086,
    "end": 899.508,
    "text": "One is what I call static predictability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.968,
    "end": 902.61,
    "text": "So this would be something like staring at a wall for a prolonged period of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.65,
    "end": 903.731,
    "text": "So that's our middle picture here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.071,
    "end": 907.354,
    "text": "I agree that time would pass rather slowly there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.095,
    "end": 910.837,
    "text": " Now, the second one is so-called dynamic predictability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.857,
    "end": 911.638,
    "text": "Now, these are my terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.698,
    "end": 915.5,
    "text": "I'm very happy to be able to critique them, but I'm calling this dynamic predictability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.021,
    "end": 917.602,
    "text": "Now, this would be the chaps on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.082,
    "end": 928.79,
    "text": "These are those people who may have played the video game level and enjoyed it the first time, but for some reason, some torturous devil is making them play that video game level over and over and over again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.449,
    "end": 930.71,
    "text": " Okay, so that's dynamic predictability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.73,
    "end": 933.092,
    "text": "I'm not going to talk about how it pertains right now to the flow of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.592,
    "end": 935.734,
    "text": "And then the other one is flow, flow states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.254,
    "end": 942.459,
    "text": "And again, I would point people in the direction of the paper that I wrote with my great colleagues last year on flow states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.027,
    "end": 962.846,
    "text": " But this is slightly different in the sense that the world, the volatility of the world is inferred as believed to be a sufficient level of volatility such that I have these narrow action policies, these temporally short action policies and this adaptive, these fast flows of motor responses to the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.775,
    "end": 971.737,
    "text": " So it's so that's flow state and you'll get that canonically in contexts such as surfing, rock climbing and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.897,
    "end": 975.778,
    "text": "So this is the work of Success Mahali and others, John Vivecki.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.978,
    "end": 978.218,
    "text": "And hopefully, you know, we contributed something as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.459,
    "end": 978.639,
    "text": "Now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.359,
    "end": 983.7,
    "text": "Let's just very quickly touch on the speed of time and flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.063,
    "end": 995.048,
    "text": " This is a nice study by Rutrecht and colleagues in 2021, and they found that the more flow participants experienced, the faster time passed subjectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.908,
    "end": 997.969,
    "text": "However, flow did not correlate with duration estimates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.009,
    "end": 1000.17,
    "text": "Now, that might seem like kind of the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.23,
    "end": 1001.451,
    "text": "So how are they dissociable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.011,
    "end": 1006.453,
    "text": "Well, I think the easiest way to think about this is what questions would you ask to discover these facts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.933,
    "end": 1007.934,
    "text": "You would ask for the first one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.607,
    "end": 1012.429,
    "text": " did time, how quickly did time pass subjectively for you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.929,
    "end": 1015.83,
    "text": "And then the second question would be, how long do you think that took?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.75,
    "end": 1025.474,
    "text": "And interestingly, in flow, we get this sense that time is speeding up, but we actually have quite accurate estimations of duration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.894,
    "end": 1035.418,
    "text": "So for me, this shows that these phenomena are dissociable and motivates my focus on the subjective speed of time in flow because there's something going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.75,
    "end": 1044.252,
    "text": " This is not particularly incontrovertible, I don't think, because Sixth Sense of Mahali, it goes right back to its qualitative work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.892,
    "end": 1058.216,
    "text": "The notion of time dilation has been present in the literature for a while, but this is actually one of the first concrete pieces of experimental work that has validated that and showed that in flow, time seems to pass faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.677,
    "end": 1059.797,
    "text": "Now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.132,
    "end": 1066.783,
    "text": " I want to go back to this woman in static predictability staring at the wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.444,
    "end": 1073.094,
    "text": "There are some nice studies here which basically show that time does seem to slow down in these contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.733,
    "end": 1074.993,
    "text": " Fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.393,
    "end": 1076.193,
    "text": "We both agree on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.713,
    "end": 1077.493,
    "text": "Now, what's the problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.914,
    "end": 1083.014,
    "text": "Well, remember the model of distrusting the present is fundamentally perceptual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.795,
    "end": 1096.457,
    "text": "And so you can see here Jacob and his colleagues account of distrusting the present in terms of perceptual attention and this notion of attentional spotlighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.057,
    "end": 1100.277,
    "text": "Again, it'll be much easier for you to read it than for me to explain it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.077,
    "end": 1103.938,
    "text": "But I think the critical point here is to take it back to here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.924,
    "end": 1121.958,
    "text": " According to Yakov, these video game boys, they're going to be in context where they're getting still volatile perceptual information in the sense that I might be playing a video game where things are changing the whole time, but I've still played it a hundred times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.978,
    "end": 1122.618,
    "text": "So I'm bored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.319,
    "end": 1126.281,
    "text": "And I would postulate that I think time is going to move pretty slowly there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.162,
    "end": 1129.544,
    "text": "And in flow states, we've seen that time seems to move rather quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.188,
    "end": 1137.795,
    "text": " But according to this purely perceptual account, there should be no strong difference between the sense of time and flow and these dynamically predictable situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.275,
    "end": 1146.603,
    "text": "Because in both of them, you could find a situation where there's the same or even more state updating to do in dynamically predictable situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.307,
    "end": 1150.609,
    "text": " I think an even stronger example of this I actually put in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.629,
    "end": 1156.031,
    "text": "So there is a paper on this where my thoughts are going to be a little bit more lucid because obviously it's not scripted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.552,
    "end": 1164.155,
    "text": "And the example I give there is of the poor person who has to stare at a screen with a dot that constantly changing color.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.555,
    "end": 1166.996,
    "text": "Now, there's a lot of perceptual state updating there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.016,
    "end": 1169.377,
    "text": "And let's say it's randomly changing color.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.397,
    "end": 1172.499,
    "text": "So we can't have an action policy that can pick out the patterns and say, oh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.476,
    "end": 1178.92,
    "text": " You know, you can have these extended action policies that say, OK, it's going to go red, green, yellow, red, green, yellow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.26,
    "end": 1180.341,
    "text": "So it's constantly changing color.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.002,
    "end": 1182.844,
    "text": "Now, I was hard pressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.964,
    "end": 1186.787,
    "text": "There was no empirical work that contrasted flow and dynamically predictable situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.668,
    "end": 1190.55,
    "text": "And so this is empirical work that I would like to do and I'll get onto that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.051,
    "end": 1197.816,
    "text": "But I would still propose just heuristically and intuitively that time would seem to flow rather slowly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.836,
    "end": 1199.618,
    "text": "I think another issue of this is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.464,
    "end": 1210.775,
    "text": " Howie, if we go back to his original example of the war zone and the dull airport, even in the context of static predictability, there's always low-level state updating that's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.255,
    "end": 1212.396,
    "text": "The world is never static.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.897,
    "end": 1219.784,
    "text": "So even if it's the fact that the paint on the wall is very slowly cracking or there's a fly that passes in front of you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.485,
    "end": 1247.508,
    "text": " the the actual uh the world itself never changes and how he doesn't really give an account of exactly why or how that can be incorporated into his model so this made me think well i don't think the perceptual hypothesis is necessarily the most elegant or fits the phenomenology perfectly and i think it's incredible i'm not i love jacob um i think it's an incredible piece of work but i just think there's a little bit more that could be added",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.843,
    "end": 1252.61,
    "text": " So this is where I came in with this notion of distrusting the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.63,
    "end": 1255.716,
    "text": "OK, so this is a Bayes graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.438,
    "end": 1258.562,
    "text": "This is actually from Lars Sanford Smith's 2021 work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.268,
    "end": 1265.051,
    "text": " I won't go too into it, although it's actually not too difficult.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.151,
    "end": 1271.496,
    "text": "But basically what what what is shown here is the fact that in active inference and the references are there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.036,
    "end": 1274.178,
    "text": "We talk about action policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.238,
    "end": 1275.979,
    "text": "So policies are these sequences of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.279,
    "end": 1277.941,
    "text": "We talk about these in terms of tree searches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.341,
    "end": 1281.123,
    "text": "So I might have multiple potential policies I could pursue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.903,
    "end": 1289.706,
    "text": " And I basically calculate expected free energy, which we can have as epistemic gain and pragmatic gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.046,
    "end": 1295.228,
    "text": "If you want, I can talk a little bit more about that, but I don't think we need to get into the theory too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.108,
    "end": 1304.371,
    "text": "I talk about we have these tree searches where the agent evaluates the possible consequences of these different policies in terms of expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.114,
    "end": 1306.998,
    "text": " Now, they're not just doing this on a whim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.339,
    "end": 1312.59,
    "text": "As you can see here at the top of the graph that Lars gives us, Lars and his colleagues, because it was a collaborative paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.358,
    "end": 1323.666,
    "text": " The expected free energy is constituted in part by or decided upon in part calculated by the so-called C matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.986,
    "end": 1326.788,
    "text": "The C matrix are the preferences about the sensory outcomes that you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.349,
    "end": 1335.556,
    "text": "So if I have very highly precise sensory expectations about how my action is going with the sensory outcomes of my action,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.196,
    "end": 1343.421,
    "text": " that's going to drive, and it's in favour with my generative model, that's going to drive that pragmatic action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.422,
    "end": 1356.129,
    "text": "Indeed, the pragmatic aspect of the expected free energy formula is the probability of Y, the observation, given C. There is also this E matrix, which is habits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.89,
    "end": 1361.473,
    "text": "We can take as habits, priors over policies, and we'll see actually that that comes in a little bit more in flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.773,
    "end": 1363.014,
    "text": "But I think the main idea here is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.755,
    "end": 1364.476,
    "text": " Well, there's a couple of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.996,
    "end": 1372.643,
    "text": "One is that an action policy need not just yield, need not just be isomorphic or map onto just one observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.183,
    "end": 1381.39,
    "text": "As you can see here, we can have action policies that stretch deep into the future as long as we as long as we presume that the future is predictable such that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.643,
    "end": 1402.559,
    "text": " um we have we have an n plus one of the so-called b matrix the b matrix are state transitions so i might have an action policy where i go okay i'm going to be in this state then this state then this day and obviously this is informed in real time by the observations i make uh through the a matrix through the likelihood matrix but the point here is is that um the tree search can like a tree",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.177,
    "end": 1405.259,
    "text": " be extended or narrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.74,
    "end": 1406.861,
    "text": "OK, so that's one thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.382,
    "end": 1416.152,
    "text": "The other thing to notice here is that every time I make an action policy or every time I decide upon an action policy, these things like the E matrix and the C matrix are implicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.833,
    "end": 1419.536,
    "text": "So we do not just blindly select an action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.956,
    "end": 1421.959,
    "text": "This goes right back to the work of Chris Frith.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.923,
    "end": 1446.794,
    "text": " uh and his colleagues at ucl in the late 90s on uh actually how action happens and forward modeling but the idea is that beliefs about the consequence of action are fundamental to even doing action in the first place okay so that's that's the idea here in terms of the actual theoretical side of it now what does that mean in terms of the flow of time so coming back to the flow of time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.944,
    "end": 1452.886,
    "text": " So recall that inflow, I mentioned it rather briefly, but the idea is that the world is volatile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.706,
    "end": 1463.23,
    "text": "And although we have a good grasp of it, although we are occupying or embodying what Kivistin and others and Brunerberg and Reitweiler called a optimal grip,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.102,
    "end": 1466.784,
    "text": " We still need to be aware that the world can change very quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.825,
    "end": 1473.691,
    "text": "So I might slightly have my bow angle wrong if I'm playing the violin or the wave might not turn exactly how I expect it to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.051,
    "end": 1478.995,
    "text": "And what that means is a deep temporal planning with these deep trees is precluded in flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.015,
    "end": 1487.343,
    "text": "Now, what that means is if we take five minutes of flow and we can we can assume that flow does last that long and there are some nice empirical studies on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.337,
    "end": 1505.822,
    "text": " Per objective time unit, I'm going to have to be doing more bouts of planning than I would, let's say, in so-called static predictable contexts and deeply predictable and dynamically predictable contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.91,
    "end": 1524.799,
    "text": " In that case, what we end up reworking is that the flow of time is not about distrusting the present hypothesis about the sensory data per se, because in dynamically predictable context and in flow states, that might be the same, but rather the iterative speed of belief updating about the current action policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.279,
    "end": 1537.485,
    "text": "Now, a question that kind of came to my mind, okay, that sounds okay, but we've been talking about perception the whole time, and arguably, if we're going to stick to the retention, primal impression, and pretension scheme,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.522,
    "end": 1540.063,
    "text": " We're going to have to talk about perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.523,
    "end": 1549.488,
    "text": "And indeed, you can see Gallagher and Harvey's sort of pointer that actually Husserl's analysis is very much characterizing perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.848,
    "end": 1553.01,
    "text": "And obviously, the perception of time itself is a perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.13,
    "end": 1556.652,
    "text": "We're talking about the phenomenology of time, the phenomenology of passage time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.112,
    "end": 1558.493,
    "text": "That's a perceptual act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.533,
    "end": 1562.755,
    "text": "So how are we going to ground planning and policy selection?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.775,
    "end": 1565.256,
    "text": "How are we going to fold that into this picture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.017,
    "end": 1566.177,
    "text": "Well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.006,
    "end": 1568.387,
    "text": " It comes right back to what I said before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.328,
    "end": 1584.577,
    "text": "And it's the fact that policy selection includes the deployment or the precision of certain beliefs in a generative model, including predictions over preferred sensations, which is encoded in the C matrix and state transitions, which are encoded in the B matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.037,
    "end": 1592.382,
    "text": "So if you look on the right side of the page here, this is actually a base graph from my paper, something I did with Lars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.232,
    "end": 1606.586,
    "text": " and you'll see here that if um so it's rather complicated but actually i'll go through the text first and then we'll come back to the base graph um again the idea is actually at least in flow so maybe it's actually worth looking at it um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.381,
    "end": 1611.063,
    "text": " What flow really entails is a contextual cue for mental action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.604,
    "end": 1615.166,
    "text": "So what you see here, it's in the mental state inference box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.246,
    "end": 1617.287,
    "text": "It's you with the two at the top and the one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.307,
    "end": 1618.188,
    "text": "That's an action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.648,
    "end": 1622.37,
    "text": "That's triggered by E2 at the top with the superscript.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.79,
    "end": 1623.551,
    "text": "And that's a habit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.871,
    "end": 1627.733,
    "text": "But that's a habit of driving action, but not a physical action per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.134,
    "end": 1633.617,
    "text": "What that mental action is doing is driving the distribution, the A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.698,
    "end": 1635.018,
    "text": "And so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.036,
    "end": 1647.897,
    "text": " Again, what that means really for this for this example or for the broader paper is that mental action is not limited just to the selection policies, but also these precision weighted beliefs about sensory outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.71,
    "end": 1649.631,
    "text": " So what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1649.651,
    "end": 1663.566,
    "text": "Well, it means that if I do iterative policy updating, if I do more iterative policy updating per objective unit of time, then what I'm also doing is I'm doing more updating about my preferred sensory expectations, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.047,
    "end": 1666.329,
    "text": "my C matrix is getting updated more frequently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.15,
    "end": 1668.752,
    "text": "And that's really the critical point here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.33,
    "end": 1698.807,
    "text": " so for example in flow what you're getting is you're getting this constant uh you can see here that the the e matrix and the c matrix fold into the action policy because this uh planning would be taken as to be rather shallow you're going to have this process iterate more frequently over a given period of time now just to clarify for people uh who might not have any idea what's going on in this base graph as i said the idea here is that um the mental action is deploying um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.668,
    "end": 1703.769,
    "text": " It's about deploying precision over these precision beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1703.789,
    "end": 1709.751,
    "text": "So you have the likelihood mapping, the precision of the transition mapping, and the precision of preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.592,
    "end": 1716.093,
    "text": "Note that basically you can't, the idea here is that you can't necessarily perceive precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.573,
    "end": 1723.956,
    "text": "So the way that that's getting fed back up to the higher level is through the observations made at O subscript to superscript one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.736,
    "end": 1727.317,
    "text": "So that's actually stated in the italics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.997,
    "end": 1736.539,
    "text": " Um, but I think, yeah, the, the point that I'm very happy to go into this, this is sort of deep parametric modeling, which is, um, been going on with Lars's work and Casper's work, uh, Casper Hess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.74,
    "end": 1737.5,
    "text": "And I think it's wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.52,
    "end": 1739.86,
    "text": "And I'd love to talk more about it in terms of this though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.88,
    "end": 1752.204,
    "text": "I think it's a very simple point that these C matrices, whether it's C with the two as a superscript or C with one as the superscript, which is really going to be the kind of critical C and flow is the one with the one superscript.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.644,
    "end": 1756.165,
    "text": "Cause that's the one which basically drives the, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.745,
    "end": 1760.947,
    "text": " Sorry, no, I'm talking about the precise beliefs of the sensory expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.268,
    "end": 1765.351,
    "text": "That's the one that's going to drive the action policy, the you, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.692,
    "end": 1774.157,
    "text": "That's just going to get updated more frequently in flow states because of the shallow action policies that flow states engender.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.318,
    "end": 1778.56,
    "text": "So therefore, what's the kind of ultimate conclusion here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.241,
    "end": 1782.143,
    "text": "Well, my conclusion was that underlying the speed of temporal flows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.085,
    "end": 1789.048,
    "text": " Since beliefs encoded in the C matrix, now this is kind of a critical point, are fundamentally predictive, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.108,
    "end": 1796.113,
    "text": "they pretend, and they are also retained over a period of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.633,
    "end": 1797.274,
    "text": "Why is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1797.734,
    "end": 1811.043,
    "text": "It's because my sensory expectations are going to govern what I perceive, as we know from active inference, because the posterior really is just this negotiation of a prior expectation and the likelihood distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.663,
    "end": 1814.684,
    "text": " And yet they are also informed by just past experiences, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.704,
    "end": 1826.727,
    "text": "they involve a form of retention, because as you saw with the flow, that C matrix, the sensory expectation about the consequences of my action, are fundamentally downstream on this contextual queue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.947,
    "end": 1835.289,
    "text": "So I think there's a nice way here in which we can wrap sensory expectations encoding the C matrix in the Husserlian phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.135,
    "end": 1843.678,
    "text": " Again, the really critical point here is that this can be independent of the pure perceptual inferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.078,
    "end": 1854.302,
    "text": "And pure perceptual inferences here are kind of the combining about prior beliefs about states before any observations, the so-called D matrix, and a precision weighted likelihood distribution, the A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.322,
    "end": 1857.843,
    "text": "So that's happening at the very top here of the contextual state inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.404,
    "end": 1862.985,
    "text": "In these dynamically predictable situations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.08,
    "end": 1869.844,
    "text": " And in flow states, we might have the same number of pure perceptual inferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.384,
    "end": 1875.807,
    "text": "But I would posit that in flow, time seems to move faster than predictably dynamic situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.288,
    "end": 1888.695,
    "text": "And the reason I think that is, is because we should be talking about perceptual inference updating about sensory expectations with respect to the C matrix and not perceptual inference about the combining of the D matrix and the A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.716,
    "end": 1891.117,
    "text": "And again, this is because that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1892.137,
    "end": 1908.881,
    "text": " the frequency with which we update those beliefs encoded in the c matrix is contingent on the frequency of policy planning so just to conclude um in terms of going forward uh this is again so just to make it very clear that it's a pre-print right now this paper i i'm not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.528,
    "end": 1926.173,
    "text": " claiming that this is the comprehensive account of uh temporality or the speed of the flow of time but it's a suggestion so um i'd love to get feedback from people but in terms of going forward i think this would be an interesting thing to test whether we could set up a situation where um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.813,
    "end": 1935.818,
    "text": " We have one group, you know, your free groups, you have a control group who aren't doing much, a second group who are playing a video game for the hundredth time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.858,
    "end": 1938.219,
    "text": "It's predictably dynamically predictable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.739,
    "end": 1943.121,
    "text": "And then flow states, which can also be done through something like a video game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.441,
    "end": 1946.303,
    "text": "And what I would expect to see just at a very basic level is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.674,
    "end": 1975.927,
    "text": " in flow you could replicate that finding of time moving faster subjectively and confirm what i think is a reasonable intuition that in these dynamically predictable states time seems to move slowly or at least slower relative to flow states okay that's me daniel feel free to fire away excellent all right great times",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.296,
    "end": 1978.057,
    "text": " It flew by.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.018,
    "end": 1980.199,
    "text": "I was paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.059,
    "end": 1981.239,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.319,
    "end": 1985.143,
    "text": "Well, well, it's very, well, another part of this, I mean, I missed file out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.163,
    "end": 1986.204,
    "text": "That's part of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.224,
    "end": 1987.264,
    "text": "The paper is relatively large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.825,
    "end": 1989.726,
    "text": "Is that attention itself is an action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.746,
    "end": 1994.03,
    "text": "Uh, and this is often forgotten by people, but attention is a, is an action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.09,
    "end": 1994.971,
    "text": "It's a mental action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.411,
    "end": 1999.234,
    "text": "And that itself will have it's associated C matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.695,
    "end": 2003.378,
    "text": "So even paying attention itself would constitute a mental action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.797,
    "end": 2009.372,
    "text": " one one note on that and then um anyone who has a question live chat i'll read um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.555,
    "end": 2020.778,
    "text": " Policy selection under expected free energy is shaped by pragmatic value, aligning future observations with your preferences and epistemic value information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.338,
    "end": 2033.182,
    "text": "So that's very interesting that attention as internal action or covert action could be driven also by pragmatic attentive considerations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.442,
    "end": 2036.603,
    "text": "Here's the kind of regime of attention I expect to be in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.543,
    "end": 2053.796,
    "text": " And also there could be epistemic or exploratory regimes of attention that maybe reflect us getting distracted just to gain information, even when it seems to disalign us from what we expect ourselves to be doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.017,
    "end": 2056.758,
    "text": "Yeah, there are several things that come to mind there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.858,
    "end": 2058.659,
    "text": "One is that we do have these nice...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.149,
    "end": 2066.717,
    "text": " meta-attentional models given by people like Lars and his 2021 paper, which includes this deep parametric modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.737,
    "end": 2070.381,
    "text": "So there is this kind of, what am I paying attention to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.681,
    "end": 2071.922,
    "text": "How well am I paying attention?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2071.942,
    "end": 2076.828,
    "text": "And you can have these deep generative hierarchies where you have attention over attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.839,
    "end": 2083.885,
    "text": " The other thing is, this is a slightly separate venture, but I've been thinking about the pragmatic value of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.465,
    "end": 2093.713,
    "text": "And I think in some sense, there's a really nice paper by Mirza and colleagues, 2019, where they talk about context-dependent value driving attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.354,
    "end": 2098.978,
    "text": "So if I'm looking, let's say for, I mean, I was talking about this yesterday with Julian Kimmerstein on the podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.459,
    "end": 2104.203,
    "text": "If I'm in a crowd and I'm looking for my friend and he's ginger, I'm going to up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.893,
    "end": 2131.304,
    "text": " uh up the precision weighting of like a template of gingerness which means that anything that's kind of ginger whether it's a cat or my friend is going to go up and everything else is going to go relatively down and this comes back to original theories of attention buyers competition theory there's more than duncan but the idea is that even my very attentional schema there is being governed by a higher order pragmatic um the pragmatic gain of finding my friend",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.91,
    "end": 2162.248,
    "text": " and that can be there could be a lower order element of that which is that there is value in paying attention to these things because it subserves that higher order uh inference cool all right i'll go to some questions in the chat but anyone's welcome to add more okay stephen select asks my question is would you agree that self-reflective self-awareness is necessary for time perception therefore time requires the self",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.474,
    "end": 2167.995,
    "text": " Okay, so this is an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.035,
    "end": 2172.296,
    "text": "I think in part it can be answered somewhat by the flow paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.657,
    "end": 2176.878,
    "text": "So in the flow paper, it really does focus on self-modelling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.998,
    "end": 2180.519,
    "text": "And the idea here is that deep temporal planning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.598,
    "end": 2192.623,
    "text": " involves the levels of the generative hierarchy which are propositional and conceptual and those are the very levels are associated with a rich epistemic agent model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.103,
    "end": 2203.989,
    "text": "So this self-conception of an agent that can use its knowledge from the past to inform future outcomes and its future action policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.269,
    "end": 2207.911,
    "text": "Now in flow because you have these shallow decision trees",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2209.821,
    "end": 2217.926,
    "text": " you actually attenuate that part of the hierarchy now that means that when you're in flow people talk about the kind of self-action merger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.641,
    "end": 2232.644,
    "text": " We're not saying that the self is completely dissolved in flow states because, for example, the minimal phenomenal self, researchers such as Anil Seth or Felix Blankenberg or Jakob Limanowski have grounded that in interoceptivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.944,
    "end": 2235.385,
    "text": "Now, I think it's an open question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.985,
    "end": 2241.366,
    "text": "There are some people who think that all experience involves a fundamental sense of mindness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.947,
    "end": 2245.407,
    "text": "So someone like Julian Kibberstein has written a paper on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.027,
    "end": 2247.668,
    "text": "There are others who will say that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.77,
    "end": 2267.718,
    "text": " um interoceptive inference is really at the heart of the minimal phenomenal self and if that dissolves then the self model itself might dissolve now whether you get time out of that is an interesting question i would point people in the direction of a conversation i had with carl where basically we had this i there's this idea that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.768,
    "end": 2274.532,
    "text": " These different temporal hierarchies are predicated on the actual dimensions of the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.552,
    "end": 2284.639,
    "text": "So how nested the Markov blanket of an organism is, because if you're very far away from your actuators, you have to start making inferences about what your action is versus what the world's action is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.239,
    "end": 2293.624,
    "text": "So I think there's a nice link there between dimensionality, maybe not just physical size, but dimensions in terms of embedding Markov blankets and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.385,
    "end": 2296.726,
    "text": "I don't feel like I'm necessarily qualified to say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.732,
    "end": 2313.392,
    "text": " how these two are necessary like fundamentally connected because i think there's still an open philosophical uh and physics related question about the reality of time itself awesome cool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.533,
    "end": 2318.394,
    "text": " A little more about trust and distrust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.615,
    "end": 2335.06,
    "text": "It's very spicy to call the paper distrusting the policy because it feels like the interior dynamics of our thought should be like what we can trust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.741,
    "end": 2338.762,
    "text": "So it's kind of a little bit of a stick in the wheel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.923,
    "end": 2340.764,
    "text": " But that's kind of fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.784,
    "end": 2347.77,
    "text": "So where is their trust and where is their distrust in that kind of a cognitive model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.071,
    "end": 2349.291,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.491,
    "end": 2355.596,
    "text": "I mean, this is rift off of Jacob's distrusting the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.636,
    "end": 2356.597,
    "text": "So I want to clarify that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.777,
    "end": 2359.82,
    "text": "As a master's student, you've got to try and make some waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.02,
    "end": 2363.183,
    "text": "So it was just trying to get people's heads poking up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2363.203,
    "end": 2365.745,
    "text": "But there is also the idea of distrust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.785,
    "end": 2367.126,
    "text": "And I think you can cast that as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.97,
    "end": 2369.511,
    "text": " in the form of precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.332,
    "end": 2379.898,
    "text": "To go back to what Yackel was talking about in terms of trust as understood by philosophers, we're talking about sub-personal Bayesian beliefs, which include precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.378,
    "end": 2389.524,
    "text": "And it's just that your precision weighting over your state hypothesis is going to be downweighted over time because there's a higher order belief that the world is volatile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.564,
    "end": 2394.728,
    "text": "And I think that higher order belief is really useful to think about when we're talking about what trust is in this respect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.388,
    "end": 2410.993,
    "text": " If you thought that the world wasn't going to be volatile, such that, for example, you're staring at a blank wall, then you could very happily trust that your hypothesis about that blank wall is going to be fine in one second, two seconds, three seconds, four seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.553,
    "end": 2424.657,
    "text": "The idea is that the trust comes from this kind of perhaps habitual inference that in this context, I am permitted longer spans of deeper trees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.387,
    "end": 2450.269,
    "text": " in this context however are those deeper trees are precluded now in some cases that might be full active inference so there might be a higher order in a deep parametric sense a higher order um action policy to deploy shallow action policies or uh temporally broad action policies in the state of flow we argued that this was habitual but i think the idea here is that for trust",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.552,
    "end": 2455.937,
    "text": " To trust or not trust an action policy is not that, we're not saying don't trust action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.778,
    "end": 2459.161,
    "text": "Action is the fundamental currency in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.682,
    "end": 2471.836,
    "text": "We're saying you might want to, agents have to be aware of the degree to which their action is going to yield them the outcomes they want, not just here and now, but also for expected free energy, also for the subsequent steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.248,
    "end": 2496.017,
    "text": " awesome yes that clears it up it's not like policy selection isn't trustworthy it's that there's a variable speed at which policies like go stale that that totally makes sense one one really um interesting and open topic is which phenomena",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.157,
    "end": 2520.876,
    "text": " either objective, behavioral, computational type phenomena or experiential phenomena, do we associate just coarsely more with the A matrix and load more onto the sense-making component or more onto the B matrix, more into the world transition model or the consequences of action in the world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.396,
    "end": 2521.736,
    "text": "So like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.617,
    "end": 2538.101,
    "text": " Were there any phenomena that you saw different authors approach it like sometimes discussing that phenomena in the context of a matrix and sense making other times more like in this action oriented B matrix way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2539.301,
    "end": 2540.181,
    "text": "Honestly, I haven't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.962,
    "end": 2551.984,
    "text": "I think because deep parametric, I might be missing something, but I think because deep parametric modeling is a relatively new aspect of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.397,
    "end": 2562.16,
    "text": " a lot of the literature on this stuff, especially in accounting for phenomenology, adopt quite a strict or pure predictive coding language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.361,
    "end": 2578.507,
    "text": "So if you read this distrusting the present, this Jacob and colleagues paper from 2015, there's no mention of the difference between the D matrix and the B matrix, the state, the inferred state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.407,
    "end": 2584.688,
    "text": " prior to observation and the state transitions based on observations, which are contingent on action policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.108,
    "end": 2590.469,
    "text": "Rather, it's just that the prior is informed by observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.529,
    "end": 2594.37,
    "text": "And they talk about precisions of observations where I would talk about precisions of likelihood distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.01,
    "end": 2606.232,
    "text": "So I would also, they don't touch upon this, but I think it's definitely worthwhile me pointing people in the direction of this Bogota and Jabara paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.213,
    "end": 2609.513,
    "text": "It can be a touch confusing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.16,
    "end": 2619.597,
    "text": " Because I think one difficulty that I was having is it's hard to hold both objective time and subjective time in your head at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.617,
    "end": 2621.1,
    "text": "I'm okay with one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.105,
    "end": 2624.147,
    "text": " and then go to the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.248,
    "end": 2628.431,
    "text": "But combining the two is a kind of amazing feat and they've done a great job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.991,
    "end": 2642.123,
    "text": "So I would say just answering your question in terms of where did I see people providing different emphasis, I would say it's difficult because I haven't seen that many deep parametric models of time per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.984,
    "end": 2646.407,
    "text": "And so that's one paper that I would point people to, but I think it's definitely a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.668,
    "end": 2654.473,
    "text": " It's definitely a really interesting area of work about where we really put all the weight, whether it's perceptual or action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.993,
    "end": 2661.278,
    "text": "But I just didn't think that pure perceptual was going to do it for the flow of time, at least not posited by Jakob and his team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.239,
    "end": 2663.62,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.92,
    "end": 2664.1,
    "text": "Well...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.215,
    "end": 2669.596,
    "text": " A few things strike me from this kind of presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.096,
    "end": 2678.537,
    "text": "First, how open and how many ways there are to address time phenomena in Act-Inf.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.438,
    "end": 2689.06,
    "text": "It feels more like a toolbox or a mechanic shop for temporal or dynamical systems rather than giving us a singular answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.14,
    "end": 2690.7,
    "text": "Like, right off the bat,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.537,
    "end": 2720.397,
    "text": " have discrete and continuous time now yeah people have made arguments for continuous time also people have made arguments for discrete time and suffice to say that we are using a formalism that straddles both or can flip between both so there's many ways to describe it and another example of like how temporal phenomena can be brought into play differently is let's just say we were looking at a 1000 step time series we can model that as a thousand steps of one or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.258,
    "end": 2732.142,
    "text": " steps of 10, or we could do a nested model so that even though it's a one time step model, maybe the slowest level is the whole thousand time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.562,
    "end": 2737.044,
    "text": "So it kind of coarse grains the long time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.064,
    "end": 2755.48,
    "text": " into kind of compressing it into a perceptual moment even if it abstracted perception like is it possible to perceive the 2000s or is it possible to perceive a decade I thought what was a really important part of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.207,
    "end": 2763.709,
    "text": " this was the fact that we need some kind of objective order on which we can like rest our arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.049,
    "end": 2780.112,
    "text": "So you see in the paper and in the talk I really emphasize the fact that I'm talking per objective time unit and I know again that's controversial right but like we just take as a kind of miracle of our theory that we have seconds and minutes and hours",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.891,
    "end": 2792.498,
    "text": " If we can rest what we're talking about in terms of flows on that kind of standard that we can then apply to different theories, then things become at least explicable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.538,
    "end": 2794.479,
    "text": "Because without that, you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.079,
    "end": 2801.863,
    "text": "It just depends on the level of the hierarchy or how deep you've gone into these time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.644,
    "end": 2806.546,
    "text": "But if you can frame them within something that we can all agree on,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.452,
    "end": 2811.705,
    "text": " then it becomes relative to that and i think it becomes uh the science becomes a lot simpler",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.053,
    "end": 2814.413,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.573,
    "end": 2825.238,
    "text": "And also, while it certainly is nice and simplifying to take the chronology or the timeline as an external given, there's also agentically constructed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.759,
    "end": 2838.365,
    "text": "And then we might be looking for something like a gamma oscillation, like we're able to distinguish intervals of time, seemingly, on the order of hundreds of milliseconds, but not fractions of milliseconds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2839.085,
    "end": 2847.311,
    "text": " And there seemed to be some physical reasons like why we couldn't differentiate two things that happen within one millisecond, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.351,
    "end": 2858.798,
    "text": "So it's kind of like that gives us a bottom up granularity or at least atomicity for the time process that a given agent undergoes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.878,
    "end": 2864.042,
    "text": "And for a tree that might be slower, like its duty cycle might be slower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.642,
    "end": 2868.945,
    "text": "And yet we could still use the same scale independent formalism to describe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.165,
    "end": 2883.31,
    "text": " Yeah, I mean, I wanted to make very clear in this that I am not capable of touching upon every element because this is one of the richest areas of philosophy and physics, and I'm not a physicist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.93,
    "end": 2887.871,
    "text": "And to be honest, I'm not particularly well-versed necessarily in the philosophy of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.972,
    "end": 2892.173,
    "text": "What I wanted to do in this was stay really faithful to the phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.373,
    "end": 2897.355,
    "text": "So this is informed really primarily by Edmund Herschel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.457,
    "end": 2900.939,
    "text": " But I think you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.139,
    "end": 2911.71,
    "text": "I think an ultimate theory of time, if there ever could be such a thing, is going to have to integrate or find a bridge between the so-called objective and the so-called subjective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.29,
    "end": 2915.894,
    "text": "And I think that's up for grabs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.094,
    "end": 2917.395,
    "text": "I mean, you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.435,
    "end": 2922.621,
    "text": "You can have a model where it's all emergent from the actual agentic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.448,
    "end": 2950.548,
    "text": " uh being so it makes me think of sort of the donald hoffman i mean donald hoffman would just say that this is a screen you know this is a this is an interface that's really useful in biological agents but the underlying reality has no time um and of course you have physicists you know this notion of block time or eternalism that everything is everything is now every the past present and future is all real um again i i this is this is why i think it's important at least for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.431,
    "end": 2956.752,
    "text": " me and other researchers when tackling these huge questions is demarcating exactly what you're going to be talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2957.792,
    "end": 2968.234,
    "text": "And I don't have the skill or the acumen or the time, if you pardon the pun, to do the Einstein and the Carlo Rovelli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.294,
    "end": 2968.834,
    "text": "Sorry, chaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.855,
    "end": 2974.355,
    "text": "I would have written a shorter letter if I had different time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.216,
    "end": 2976.416,
    "text": "Quite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.536,
    "end": 2977.496,
    "text": "It's all counterfactual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.531,
    "end": 2980.611,
    "text": " I'll ask a question from live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.092,
    "end": 2981.352,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.392,
    "end": 2984.193,
    "text": "I'll give a first thought on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.213,
    "end": 2984.453,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2997.552,
    "end": 3026.352,
    "text": " with what chris field shared in the physics as information processing we talked a lot about the measurement and the preparation cycle and so in active inference at each time step sometimes we're just talking about like a vertical slice and there's an observation coming in and a hidden state inference it's all described kind of synchronously yeah yeah yeah whereas in the quantum framework there's a bit more of a two-stroke",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.335,
    "end": 3031.743,
    "text": " phase to the measurements, which is that it's prepared and then measured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3032.544,
    "end": 3036.051,
    "text": "And so if the external oscillator",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.13,
    "end": 3040.072,
    "text": " let's just say again, give us seconds for now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.512,
    "end": 3050.579,
    "text": "If it's going at one second and an agent we're preparing and measuring 10 times a second, well then nine of those 10 would kind of come back empty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.179,
    "end": 3058.484,
    "text": "Like the nine sequential measurements and preparations and measurements that didn't have any change",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.204,
    "end": 3063.048,
    "text": " would be kind of like in a timeless or same time moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.369,
    "end": 3067.313,
    "text": "They all would have like pinged the clock and gotten the same state back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.815,
    "end": 3078.525,
    "text": "And then conversely, an agent could use the rates and the type of change or interaction with the environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.626,
    "end": 3108.331,
    "text": " as a proxy of change and the example i think of there is like honeybees using the optic flow as part of their distance calculations and people have shown like if you have the honeybee move through a tunnel with very rapid black and white alternation it overestimates the distance it flows right and then if you have it in large contiguous color blocks it underestimates the distance it flows so it's using the rates of optic flow change frame differencing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.871,
    "end": 3119.176,
    "text": " which is also the origins of predictive processing, using those kinds of external oscillations or changes as part of its embodied time perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.237,
    "end": 3120.437,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.138,
    "end": 3136.805,
    "text": "The way I would approach this is exactly what you said, which is when we build a Bayes graph, something that became very clear to me is that we are slicing time, which is a detriment because I'm trying to talk about diachronic time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.481,
    "end": 3144.206,
    "text": " whilst slicing my model and I think this really does just exhibit sometimes the discord that we have between our modeling and the actual reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.887,
    "end": 3150.23,
    "text": "So it's an inherent weakness or an inherent limitation of our instruments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.851,
    "end": 3163.06,
    "text": "What I will say is I think it's interesting to talk about parallel processing rather than serial processing here because as I keep trying to make clear this generative hierarchy is rather deep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.105,
    "end": 3174.214,
    "text": " And so I think, for example, I mentioned when one stares at a wall, there's always some state updating, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.254,
    "end": 3176.416,
    "text": "The game is never paused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.257,
    "end": 3188.748,
    "text": "And so I think there's actually an interesting follow up question here, which is if we stack all of these regimes of attention up and we have rapid flows in all of them, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.043,
    "end": 3195.485,
    "text": " does that lead to an even more pronounced sense that time is flowing faster?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.146,
    "end": 3213.432,
    "text": "In the way that maybe now we can have this nice hierarchy of what I call stable, stably predictive situations, dynamically predictive situations and flow, where the difference really is the actual number of attentional regimes in which you're seeing updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.452,
    "end": 3214.513,
    "text": "Because I don't, there is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.14,
    "end": 3219.162,
    "text": " Bear in mind that to update the C matrix, you have to know where you are in the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.182,
    "end": 3221.964,
    "text": "You have to be able to do the state updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.524,
    "end": 3226.127,
    "text": "It's just that for me, that was insufficient to explain the phenomena at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.947,
    "end": 3231.47,
    "text": "But if you can now start taking that kind of base graph that I showed, where is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.431,
    "end": 3240.275,
    "text": "You know, if we can take this base graph and in principle apply it up and down the generative hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.209,
    "end": 3255.223,
    "text": " Well, if these narrow flows are happening all the way up and down, maybe there's an interesting thing that this is really the top end of passage phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.243,
    "end": 3264.692,
    "text": "And if these are really protracted at every level, right down to the very lowest Markov blanket of our system and right up to the move rather slowly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.289,
    "end": 3290.241,
    "text": " i think there's some interesting ideas there um and i think it it feeds into this notion that we we occupy or embody embedded markup blankets that go beyond us and in many ways go kind of beneath us i mean it depends on where you cast your identity but yeah i think the parallel thing here is is really interesting but for instrumental scientific reasons it was just a lot easier for me to like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.48,
    "end": 3295.304,
    "text": " and philosophical reasons just to take one slice at one level of the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.365,
    "end": 3298.628,
    "text": "Although this does have some parametrization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.37,
    "end": 3300.63,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3300.791,
    "end": 3301.071,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.091,
    "end": 3304.555,
    "text": "So looking at the figure from your paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.436,
    "end": 3305.596,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.177,
    "end": 3309.38,
    "text": "So this one, by the way, this one's from the first flow paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3310.742,
    "end": 3310.942,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3310.982,
    "end": 3311.603,
    "text": "I think this one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.262,
    "end": 3313.723,
    "text": " Yeah, so this one's from the first flow paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.263,
    "end": 3315.503,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3315.603,
    "end": 3316.143,
    "text": "I need to check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.163,
    "end": 3320.405,
    "text": "I'm not sure it makes an appearance in the second one, but that's where it comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.945,
    "end": 3325.987,
    "text": "Okay, so for any parameter that you know or love on this diagram,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3326.854,
    "end": 3327.894,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3328.074,
    "end": 3338.698,
    "text": "What would you say is like a prompt or a cue that might help us understand or come even to an intuitive felt sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.698,
    "end": 3349.701,
    "text": "Pick anyone because I think that's like super interesting and it's all awesome to look at this as like the compilation instructions for a base graph, which is in one sense what it is technically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.521,
    "end": 3368.088,
    "text": " however also as we're talking about our own minds and experiences here it's like super fun and definitely of interest to tap into whichever letter and then let's see if we can kind of go from there yeah so as a sort of just forewarning um this was like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3368.832,
    "end": 3371.714,
    "text": " Yeah, as I said, constructed with Lars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.754,
    "end": 3373.435,
    "text": "I mean, Lars really led on this project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.495,
    "end": 3374.536,
    "text": "I should give him a lot of credit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3375.456,
    "end": 3382.161,
    "text": "And so I also don't want to butcher his work because I know he's really into this sort of deep parametric modeling that he learned from Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.901,
    "end": 3386.424,
    "text": "But it's my paper, so I have a good idea of what's going on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.664,
    "end": 3392.448,
    "text": "I think I could do an OK job of actually explaining what's going on more generally, which is the idea is that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.609,
    "end": 3394.809,
    "text": "Let's just start right at the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.45,
    "end": 3398.532,
    "text": "At the top is not particularly it shouldn't be too confusing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.105,
    "end": 3403.13,
    "text": " which is that basically you're just inferring the state that you're in, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3403.611,
    "end": 3405.173,
    "text": "So what do you mean by state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.314,
    "end": 3407.656,
    "text": "So the hidden state, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.696,
    "end": 3410.34,
    "text": "So I'm inferring, um, so this, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.098,
    "end": 3422.483,
    "text": " Given this observation of whatever has hit your receptors, I believe with some high precision that I am in a, you know, I'm about to start a violin concerto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3422.503,
    "end": 3425.964,
    "text": "Okay, let's go with the violin concerto situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.865,
    "end": 3428.606,
    "text": "So I'm about to start playing my violin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.026,
    "end": 3430.286,
    "text": "Now, what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.346,
    "end": 3436.629,
    "text": "Well, that feeds into this E matrix, this E with the two as the superscript.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.196,
    "end": 3449.558,
    "text": " And so what we're saying here is that that very state inference acts as a contextual queue for the deployment of this action, U with the superscript 2 and subscript 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.098,
    "end": 3454.979,
    "text": "So really, this is all basically driven by this E matrix, E with the 2 superscript.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.739,
    "end": 3457.619,
    "text": "Now, what does that look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.739,
    "end": 3463.08,
    "text": "Well, what's really important here is this S with the superscript 2 and subscript 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.461,
    "end": 3466.441,
    "text": "Because what we're saying here is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.213,
    "end": 3470.235,
    "text": " is that we're posing a mental action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.996,
    "end": 3477.66,
    "text": "And the mental action is to increase precision over the likelihood mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3477.68,
    "end": 3486.065,
    "text": "So the likelihood mapping is here, the transition mapping, and the precision of preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.085,
    "end": 3494.731,
    "text": "So what we're saying here is that this action is basically, in some sense, this is its preferred state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.701,
    "end": 3501.004,
    "text": " Now, the only issue, as I said, is we can't observe precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.865,
    "end": 3503.826,
    "text": "What we can observe are the outcomes of our action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.827,
    "end": 3521.859,
    "text": "So what we're now saying here is that basically this observation here, through this likelihood matrix, will feed back up the hierarchy and inform the mental state inference here, oh, yes, you've succeeded in increasing precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.337,
    "end": 3533.744,
    "text": " And the reason for that is, as you know, if we get increased precision over the C matrix and the B matrix, we are driven by pragmatic action, at least according to the expected free energy formula.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.605,
    "end": 3536.206,
    "text": "So that's kind of what's going on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.147,
    "end": 3542.99,
    "text": "Note two, is there anything else that's kind of relevant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.972,
    "end": 3551.376,
    "text": "Yeah, I mean, so you've got to bear in mind that, like, so again, this is mental action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.253,
    "end": 3554.535,
    "text": " But these are the these are the physical actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.716,
    "end": 3558.859,
    "text": "So these are the actual playing of the violin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.341,
    "end": 3560.541,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.081,
    "end": 3564.184,
    "text": "And they're going to contribute to this observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.224,
    "end": 3576.336,
    "text": "But this observation is really in terms of mental state inference, doing the job of saying you've done a good job at increasing precision over your sensory expectations, the likelihood matrix and transition mappings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.421,
    "end": 3582.043,
    "text": " Let me try to echo this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.304,
    "end": 3584.444,
    "text": "We're in the violin setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.484,
    "end": 3587.806,
    "text": "So at the purple top layer, there's two contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.126,
    "end": 3591.148,
    "text": "There's the presentation in the auditorium",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.13,
    "end": 3592.991,
    "text": " That's the real thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.071,
    "end": 3594.452,
    "text": "And then there's the practice at home.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3594.472,
    "end": 3598.274,
    "text": "So there's two contextual states and, and 90% of the time you're at home.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.314,
    "end": 3601.737,
    "text": "So that's your prior, but then sensory evidence suggests that you're in the auditorium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.757,
    "end": 3602.838,
    "text": "So that's the context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3603.098,
    "end": 3603.598,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3604.158,
    "end": 3612.745,
    "text": "The blue layer is the action policies, like the angle and the motor activity of the arm and the hand of the violinist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.785,
    "end": 3613.785,
    "text": "This is, this is, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.805,
    "end": 3615.226,
    "text": "So this is the physical actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.506,
    "end": 3615.687,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.967,
    "end": 3620.21,
    "text": "And the orange is the regime of attention of the musician.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.89,
    "end": 3621.391,
    "text": "Now, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3622.327,
    "end": 3635.319,
    "text": " what they expect in terms of this recital from sheet music yeah is that pragmatic value is playing like the most amazing and transcendent version of the sheet music as written",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.502,
    "end": 3638.482,
    "text": " So of course, the map is not the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.763,
    "end": 3644.024,
    "text": "However, pragmatic value is defined as hitting those notes at the right order in the right time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.544,
    "end": 3648.165,
    "text": "So it's not like an epistemic exploratory place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3648.685,
    "end": 3657.227,
    "text": "So now, how do we think about how those motor movements are skillfully done?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3658.171,
    "end": 3662.874,
    "text": " which can include not just deftness, but also planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3663.435,
    "end": 3670.88,
    "text": "Like a wind player has to plan their breathing and there's other things and planning the motions, all kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.461,
    "end": 3679.827,
    "text": "And so your kind of contention with the flow state is that in a skilled person,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3682.167,
    "end": 3688.152,
    "text": " Cezanne Mahaly setting where there's precision, like, yeah, I am good at skiing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3688.212,
    "end": 3689.173,
    "text": "I am good at violin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3689.614,
    "end": 3690.955,
    "text": "Personally, I'm not, but I'm just saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.496,
    "end": 3695.038,
    "text": "When confirmatory evidence is coming in,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3696.374,
    "end": 3703.901,
    "text": " then that enables a shorter time horizon of planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.722,
    "end": 3718.574,
    "text": "So a vastly reduced cognitive overhead, but relying on tacit and implicit heuristics that enable professional outcomes to arise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.992,
    "end": 3748.713,
    "text": " in that flow state even if somebody looking from the outside thought oh wow they must have really planned that yes however it wasn't really planned and then we kind of have the orange level the regime of attention meeting in the middle and mediating this like cultural contextual understanding top down with the body bottom up um sensory component yeah so that's that's that's basically it um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.902,
    "end": 3751.363,
    "text": " There's plenty of things to point out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.544,
    "end": 3761.571,
    "text": "One is I had this idea that these observations that you're making sort of in real time actually basically loop round into this contextual state inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.432,
    "end": 3766.915,
    "text": "So at time n plus one, it actually kind of feeds into our conversation about time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.836,
    "end": 3774.421,
    "text": "What I've actually just observed, so the very sound that has come out of my violin itself is feeding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.288,
    "end": 3785.512,
    "text": " the contextual state inference, which itself feeds another habitual action to cast precision over sensory expectations about the next thing that I'm going to play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.552,
    "end": 3786.653,
    "text": "And then that cycles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.053,
    "end": 3801.479,
    "text": "So we're basically saying that although the actual selection of the actual policy here at C1 is pure active inference, the mental action that drives high precision over it is habitual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.519,
    "end": 3803.48,
    "text": "And that itself is driven in this recursive way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.184,
    "end": 3804.784,
    "text": " So that's one thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.324,
    "end": 3807.945,
    "text": "Yeah, the other thing is about this kind of shallow temporal planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.965,
    "end": 3808.826,
    "text": "That's exactly right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.846,
    "end": 3810.026,
    "text": "That's exactly what we propose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.506,
    "end": 3818.109,
    "text": "The reason for this, and this was actually raised by Jakob Howey, so I'm very grateful for his observation here, and this is actually mentioned in his 2022 self-evidencing paper, is that the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.326,
    "end": 3848.659,
    "text": " like it's not the case that when i play my violin skillfully i can say okay i know i have it's not the case i believe that everything i do is going to be highly predictable for three or four minutes because that was the four deep temporal planning rather as i said there are these volatilities in the environment that i always need to be adjusting myself to right i need to be conforming myself to i need to be able to exploit those affordances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.241,
    "end": 3855.319,
    "text": " So flow states are not just one extended action policy, which is super rigid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.07,
    "end": 3865.692,
    "text": " Rather, it's kind of because each state inference itself acts as a contextual cue over certain sensory expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.992,
    "end": 3872.793,
    "text": "We have this kind of fractal nature where you might have like the first state, well, it might not be fractal, but it's like a tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.153,
    "end": 3885.636,
    "text": "You have the first state inference and then you have these bifurcations such that, sure, everything is constrained within the piece that you're actually playing, but it's not going to be the same piece every single time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.562,
    "end": 3895.366,
    "text": " Now, what we do say is, is that if I have an observation, for example, if my string suddenly breaks, what happens with this Bayes graph is it basically collapses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.406,
    "end": 3907.07,
    "text": "And the reason for that is that that lower level perceptual state inference, which feeds into the context I'm in, is no longer a sufficient context to trigger the habitual mental action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.991,
    "end": 3911.472,
    "text": "So it's not just the case that you can be in flow in any context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3912.33,
    "end": 3913.271,
    "text": " That's really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.152,
    "end": 3919.338,
    "text": "There's a set of contexts which are going to license this mental action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.699,
    "end": 3925.065,
    "text": "And that's very nice to explain within active inference as just hashing action policies as habits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.405,
    "end": 3931.933,
    "text": "So the more you do them, the more they just get cashed and the more precise that is as an E-matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3932.919,
    "end": 3943.706,
    "text": " So that also allows us to talk about cognitive effort in line with Thomas Parr's 2023 paper about sort of it being diverge, you know, effort being divergence from priors over policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.687,
    "end": 3953.593,
    "text": "But yeah, I mean, the fundamental point here is that flow is a weird one because everything is like very predictable within its rate, within its action policy regime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.233,
    "end": 3955.594,
    "text": "But that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.156,
    "end": 3984.025,
    "text": " the skill really is being able to have like a diverse or fractal uh structure where you can go to different nodes and they all link together through habits basically awesome okay few fun questions in the chat about precision get your precision goggles on i hope you're confident yeah yeah okay dave writes yeah quote we can't observe our precision",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.014,
    "end": 3989.437,
    "text": " He says, this assertion seems to need clarification or qualification eventually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3990.158,
    "end": 3993.5,
    "text": "Our precisions have profound effects on our actions and anxieties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.9,
    "end": 3995.301,
    "text": "They must need attention somehow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.722,
    "end": 3999.424,
    "text": "And in fact, affective active inference...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4000.413,
    "end": 4009.677,
    "text": " have posited that there's something like the observation of a variance parameter and that that's associated with anxiety and valence by Hesp at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4010.178,
    "end": 4017.181,
    "text": "So which variances do we imagine are introspective and why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4018.782,
    "end": 4021.363,
    "text": "So that's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.604,
    "end": 4027.026,
    "text": "At least in the way that this... I don't think, to be honest, it makes a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.941,
    "end": 4037.406,
    "text": " dramatic difference whether you have another level within this Bayes graph which has the observation of precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4039.047,
    "end": 4048.672,
    "text": "Our idea here is that just because things are happening very quickly it might just be more parsimonious to invoke that the evidence for that precision weighting comes from the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4049.512,
    "end": 4055.295,
    "text": "So that's that kind of O with a two as a subscript and one as a superscript.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.099,
    "end": 4063.642,
    "text": " But no, I mean, I'm not going to die on this hill because also I don't think it makes a massive difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4065.723,
    "end": 4075.748,
    "text": "I would be personally inclined if he was here to pass this one off to Lars because that was the way he explained it to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4075.788,
    "end": 4083.152,
    "text": "And I'm not trying to exculpate myself, but recall that this paper is a six or five author collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.192,
    "end": 4083.812,
    "text": "So it's not all me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.629,
    "end": 4085.55,
    "text": " But that's the way that I would say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4085.77,
    "end": 4091.255,
    "text": "I would say that there's no harm in saying that you can observe your preferences, sorry, your precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.995,
    "end": 4095.238,
    "text": "But in some sense, we're treating this extra-receptively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.82,
    "end": 4106.848,
    "text": "And so, yeah, this seems to work in a way that doesn't need to invoke another layer to the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4109.31,
    "end": 4109.57,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.091,
    "end": 4111.332,
    "text": "That's not a hill to die on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.532,
    "end": 4112.573,
    "text": "That's our research field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.028,
    "end": 4137.095,
    "text": " yeah exactly but seriously it it it's a great question by dave and those are the questions that we could imagine real studies to ask or address yeah so it's it's those are the great questions okay yeah i mean the other thing i would say here is it's something that's become quite obvious to me again i mean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4137.961,
    "end": 4162.988,
    "text": " i'm not the expert on this you might want to ask thomas paul but something that's become very obvious to me is that there's a difference we've got to make a difference between attention precision and precision waiting um and i think there's oftentimes in the community a conflation of those three and so when we're saying okay we need to pay attention to these certain things well i take in the a matrix um which is a certain type of precision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.703,
    "end": 4173.846,
    "text": " But we have other precisions in mental inference, including these C matrices, B matrices, E matrices, and D matrices, and they do not all map onto attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.887,
    "end": 4183.85,
    "text": "So this idea that precision weighting is attention, which is kind of an okay heuristic, it's not really what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4186.164,
    "end": 4201.775,
    "text": " Yes, the terms, not to make too general of a statement here, but the terms that refer more generally to statistic, like state, belief, variance, attention, precision, confidence, usually without more qualification, they're too vague.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4202.515,
    "end": 4207.598,
    "text": " Like just saying something as a prior, are we talking about D in the purple, D2, D1?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.778,
    "end": 4211.76,
    "text": "Are we talking about B playing the role as the prior for a future time step?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.78,
    "end": 4223.506,
    "text": "So like they are coarse grainings, their fingers pointing at moons, and then there's the movement of the solar system and there's a lot of pointing and gesturing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4224.666,
    "end": 4240.02,
    "text": " And also, thankfully, rapid accelerations of our understanding and our tool environment to help move this model, for example, into an executable format or to use verbal descriptions of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4240.04,
    "end": 4246.506,
    "text": "And there's some really exciting and fun things like even just pasting this image or uploading the paper into a language model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4247.327,
    "end": 4249.028,
    "text": " can give some fun and different insights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.488,
    "end": 4254.851,
    "text": "Now, it may take an expert to then evaluate whether what it says is accurate or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.432,
    "end": 4264.097,
    "text": "However, that's a super promising avenue for like developing context and metaphors or examples for looking at this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4265.417,
    "end": 4275.323,
    "text": "Yeah, I mean, I need to add that like, I have, I really do not, I'm not treating this as like a way to have a go at philosophers, because my background is in philosophy and cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4276.042,
    "end": 4301.379,
    "text": " so this emphasis on the computational model in many ways actually owes a lot to carl because when i presented this flow paper for the first time in his group he was like well it sounds sort of philosophically narrationally good but kind of the emphasis now is on like can you put this into matlab can you build something from it um that said i mean as i said this is informed fundamentally this paper at least was informed fundamentally by lived experience and phenomenology so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.03,
    "end": 4314.678,
    "text": " I guess what I'm trying to become a part of is the so-called generative passage, which is finding a way to get from phenomenology to Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.378,
    "end": 4330.688,
    "text": "And hopefully this is one way, but I don't propose that I'm reducing the rich phenomenology of lived experience to these Bayesian mechanics, because I think that would be slightly hubristic, because no one knows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.226,
    "end": 4351.622,
    "text": " yeah it's not even just approaching it from both sides i don't think there's only two sides to this yeah there is though this just like you said grounding in the felt experience and the phenomenology the ontology and the practices of philosophy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4352.794,
    "end": 4360.938,
    "text": " and also formalism and wanting to touch grass, but touch MATLAB as it were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.898,
    "end": 4369.102,
    "text": "And then that kind of strange looping when our felt experience",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.764,
    "end": 4376.027,
    "text": " has a reference of a cognitive map and model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4376.047,
    "end": 4376.907,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4377.448,
    "end": 4379.149,
    "text": "And that kind of special.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.509,
    "end": 4379.669,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.909,
    "end": 4380.089,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.149,
    "end": 4387.874,
    "text": "There's a tripartite structure here, which is one, the Bayesian mechanics to the, uh, the model and free the phenomenon, the target phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4389.075,
    "end": 4396.88,
    "text": "And I think, again, this is actually really, uh, become apparent to me after speaking to Julian yesterday, Julian Kibberstein, that, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.118,
    "end": 4404.08,
    "text": " One has to be careful to not fall into the tendency to conflate them or reduce one to the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.82,
    "end": 4408.041,
    "text": "As you say, the map is not the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.061,
    "end": 4411.921,
    "text": "It's a really crucial component of all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.941,
    "end": 4414.842,
    "text": "I mean, I can provide a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.882,
    "end": 4416.463,
    "text": "I can speak about C matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.483,
    "end": 4426.085,
    "text": "I really want to clarify, I do not mean that in a reductive sense, that the flow of time is the updating of the C matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.824,
    "end": 4430.666,
    "text": " What the actual binding, the relation is there, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4433.166,
    "end": 4441.71,
    "text": "Whether it's emergent, strongly emergent, weakly emergent, epiphenomenal, is ontologically reductive is a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.371,
    "end": 4445.991,
    "text": "But it's an open question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.031,
    "end": 4450.093,
    "text": "I don't think we should just take for granted that they are one and the same thing, that we're making an identity claim here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.573,
    "end": 4471.468,
    "text": " yeah of course many interpretations and we welcome them i see this as like a boundary artifact or a design artifact that brings us to the point of juxtaposition of all of those schools of thought that you just mentioned and more and then it's like through the bottleneck together",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.805,
    "end": 4477.488,
    "text": " Maybe the distribution of beliefs on the other side is the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4477.769,
    "end": 4478.569,
    "text": "Maybe it's different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4479.37,
    "end": 4489.277,
    "text": "But we came together, we synchronized our generative models, and then we get to continue the discussion from a point of contact or alignment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.877,
    "end": 4490.377,
    "text": "Otherwise...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4491.414,
    "end": 4512.447,
    "text": " different assertions might be made that don't even have the same underlying axiomatic set or referent or inclusion criterion at which point you might as well have one person saying well i designed a pickup truck and someone else is arguing about whether my red is your red someone else talking about ecology it's like it would be like blending up pages of a library and not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4513.115,
    "end": 4521.16,
    "text": " Yeah, it's very important to keep a philosophical eye on the theories that are emerging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.42,
    "end": 4523.581,
    "text": "And to be honest, Daniel, I mean, it's credit to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.641,
    "end": 4536.449,
    "text": "I think as a younger person entering into active inference, you guys have all done a very good job at not making us subscribe to one philosophical position, one ontological, epistemological position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.469,
    "end": 4537.49,
    "text": "I mean, people will have their own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.397,
    "end": 4541.118,
    "text": " I, for one, am personally happy to leave it open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.158,
    "end": 4542.999,
    "text": "I mean, I say that before doing my PhD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4543.019,
    "end": 4547.14,
    "text": "I'm sure after my PhD, I'll be an acolyte of some of some way of thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.801,
    "end": 4549.701,
    "text": "But I think this is the exciting thing about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.722,
    "end": 4554.904,
    "text": "And hopefully that enthusiasm comes across in the podcast, which is like it kind of works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.224,
    "end": 4560.946,
    "text": "Whether you're a reductionist and an epiphenomenalist, like it's just maths and statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.69,
    "end": 4590.636,
    "text": " and it it's informative for philosophical conversations and so philosophical conversations are informative to the mass and statistics and framing it but it doesn't it doesn't constrain you like um maybe having a super radical and activist cognition account might constrain you or being a pure computation list might constrain you so uh credit to everyone credit to credit to carl credit to you no it's it's good thank you that thank you it's awesome and it makes me wonder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4591.536,
    "end": 4593.258,
    "text": " There's so many ways to go from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.358,
    "end": 4599.063,
    "text": "But how much of this is active inference itself, if anything, could even be itself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4599.584,
    "end": 4613.557,
    "text": "And how much is merely optimal grasp of formalism and just seeing that whatever you write on the floor or the table or the page, any equation, category theory, dynamical systems, statistics, like anything...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4614.807,
    "end": 4620.131,
    "text": " is the diving board that you have to jump into the pool with for phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4620.272,
    "end": 4625.596,
    "text": "And so what's the point of comparing diving boards only if it's about dive?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.316,
    "end": 4628.178,
    "text": "You'll notice I didn't even mention active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4629.039,
    "end": 4636.385,
    "text": "I mean, like, I mean, one, because we're here with the Institute, it would be a bit silly to waste time explaining what the free energy principle is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.326,
    "end": 4641.549,
    "text": "I mean, from my perspective, the way that I talk about it is, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.276,
    "end": 4648.14,
    "text": " I'll take the free energy principle is just unfalsifiably true as a principle of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4649.0,
    "end": 4652.122,
    "text": "It's like it doesn't really get more fundamental than the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.623,
    "end": 4663.29,
    "text": "Where it really gets interesting is the fact that if I am to be considered the same agent or same organism from time one to time two, then I need to be abiding by the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.37,
    "end": 4665.191,
    "text": "Now, the real question is, how am I doing that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.312,
    "end": 4669.734,
    "text": "And predictive processing or Pondy P seems to give a really nice way in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.56,
    "end": 4675.962,
    "text": " But I kind of just take it that I'm doing some form of active inference all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4677.043,
    "end": 4684.706,
    "text": "And from that, I let it take me where it takes me, whether I stick purely to a philosophical account or whether I stick to a more computational account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4685.286,
    "end": 4695.15,
    "text": "None of my commitments there are negating my ultimate commitment to the ever-present reduction of variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4696.351,
    "end": 4696.591,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.569,
    "end": 4703.512,
    "text": " It's a nice building block, but as you say, I think the lovely thing about it is it can lead you in different directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.632,
    "end": 4707.615,
    "text": "Sure, it might be... I don't want to say that it's just an open season.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.935,
    "end": 4709.055,
    "text": "People have their commitments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.095,
    "end": 4711.117,
    "text": "So if you're a predictive coding guy, you have your commitments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.197,
    "end": 4713.658,
    "text": "If you're a variational message passing guy, you have your commitments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.178,
    "end": 4720.802,
    "text": "For me, I'm not... I really don't have any skin in the game at that level because I've been in this game for a year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4721.122,
    "end": 4726.145,
    "text": "So I'm happy to see where things go and just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.349,
    "end": 4730.87,
    "text": " For me, it's really important that it maps on in some way to the phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.951,
    "end": 4740.014,
    "text": "If you're talking about something that clearly, just from pure analysis of my own experience, is not the case, well, then that's problematic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4741.714,
    "end": 4742.375,
    "text": "Interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.875,
    "end": 4753.779,
    "text": "Again, I love this topic and there's many things we can continue on and it makes me think about how coming from an animal behavior and genetics background where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.758,
    "end": 4759.222,
    "text": " first person experience was either implicitly or explicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.243,
    "end": 4768.71,
    "text": "All of the phenomenology feels special to bring in, kind of like the leavening of the bread a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4769.69,
    "end": 4773.432,
    "text": " Because the animal behavior perspective is like everything but this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4774.592,
    "end": 4784.217,
    "text": "Even the orange layer here would be kind of like a proposal for a cognitive analysis, but only to get a better handle on the blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.399,
    "end": 4809.95,
    "text": " never because there was something intrinsically like meaningful or experiential it would be just too speculative and a field so it's just interesting to come from the orange layer and descend into the blue and get into the nitty-gritty with the motor reflexes and the isocades and the way the philosophers get into these embodied phenomena and then also from the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.53,
    "end": 4817.972,
    "text": " embodied in the behavioral scientist side to come up and to be like, yeah, actually, we can't sidestep some of these philosophical questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4818.052,
    "end": 4822.314,
    "text": "It does matter how these different systems perceive and engage with time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.454,
    "end": 4828.236,
    "text": "Yeah, I mean, I think it's important to bear in mind that the behaviorists, for example, they never...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.522,
    "end": 4835.105,
    "text": " They never actually excluded in terms of ontology, in their case, representational states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4835.525,
    "end": 4839.247,
    "text": "They just said that like they're uninteresting to science because they're unobservable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.387,
    "end": 4844.509,
    "text": "So like an animal, someone studying ants as you do or bees, they're behaviorists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.089,
    "end": 4852.012,
    "text": "But that actually doesn't that doesn't that doesn't commit them to saying anything about the representational capacities of a bee or an ant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.938,
    "end": 4859.321,
    "text": " But yes, I mean, these philosophical questions are interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.421,
    "end": 4873.049,
    "text": "I'm personally happy to start at the insights that people like Merleau-Ponty or Hussle or someone like Julian have derived from these very precise... I mean, phenomenology is not just like a random science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.109,
    "end": 4873.969,
    "text": "It's not woohoo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.389,
    "end": 4876.871,
    "text": "It's codified and categorical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.991,
    "end": 4879.812,
    "text": "And I'm happy to start with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.973,
    "end": 4883.975,
    "text": "And then when I find something that clearly...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.117,
    "end": 4904.683,
    "text": " violates what at least seems to be pretty obvious in my experience now to go to your experience would require some philosophically slightly uh troublesome inferences because you know you could be a philosophical zombie and i'm not going to talk about zombies um but at least for my experience you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.498,
    "end": 4932.698,
    "text": " when people you know people get very angry about uh illusionists about consciousness not realizing that they're not actually illusionists about consciousness they're illusion illusionists about phenomenal states or phenomenal qualities but if you are for example you are an illusionist about consciousness wholesale well i just i i can't start there with you because you're saying something that is just so clearly wrong so again i'm not going for daniel dennett or keith frankish because i know they actually don't say that but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.809,
    "end": 4940.594,
    "text": " For me, it's a decent starting point to say, well, I have very intimate knowledge of that which is happening subjectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4940.614,
    "end": 4948.3,
    "text": "And let me see how close I can get there with computational schema whilst not losing the phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4948.32,
    "end": 4949.761,
    "text": "I think that's the important thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.421,
    "end": 4954.764,
    "text": "And then I think where you end up emphasizing is just like what your interests are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.065,
    "end": 4955.365,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.385,
    "end": 4955.545,
    "text": "Like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.323,
    "end": 4984.04,
    "text": " i'm fundamentally a philosophy guy i'm not a computationist by training as you can see probably from my explanation of this graph um so i've been really lucky i've been really lucky to work with people like lars and carl who have kind of helped me and i think it's really really useful but again i'm not going to lose sight of lived experience um and i don't think anyone personally i don't think anyone should but it's difficult as you say when you're studying animal behavior because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.385,
    "end": 4996.79,
    "text": " Well, that seems like a stronger inference to make because maybe they don't have public language to say what it's like to be an ant or a beast, to paraphrase Thomas Nagel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.831,
    "end": 5001.932,
    "text": "Well, very fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.113,
    "end": 5006.574,
    "text": "What are your next steps or directions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5008.035,
    "end": 5009.916,
    "text": "So, yeah, so this is up on the preprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5009.996,
    "end": 5011.856,
    "text": "As I said, I want feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.936,
    "end": 5012.737,
    "text": "I want people to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5013.63,
    "end": 5018.753,
    "text": " get angry and attack me, albeit in the spirit of scientific consilience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5020.334,
    "end": 5023.116,
    "text": "So I very much encourage feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5024.297,
    "end": 5031.261,
    "text": "I think I'm hoping to get some more formal reviews from some people and then we'll try and get this out there somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5031.301,
    "end": 5032.441,
    "text": "I don't know quite where.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5032.822,
    "end": 5035.844,
    "text": "I'm working on some other things, which I'm sure I can speak about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5035.864,
    "end": 5043.108,
    "text": "I'm working on a paper about self-modelling in Tourette's with Libby Severs, which is super exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.123,
    "end": 5045.324,
    "text": " So that's coming together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5045.344,
    "end": 5047.385,
    "text": "I'm working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.665,
    "end": 5052.528,
    "text": "I'm at the very early stages of working on something about extended mind with Mao and others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5053.128,
    "end": 5055.189,
    "text": "So that should be really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.489,
    "end": 5057.731,
    "text": "And the podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.171,
    "end": 5060.272,
    "text": "We've been putting in loads of work on the podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5061.05,
    "end": 5066.314,
    "text": " So we have Chris Frith, which is super exciting, just a sort of pioneer in psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.095,
    "end": 5068.896,
    "text": "Julian Kiverstein, as I mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5069.096,
    "end": 5073.479,
    "text": "Alex Orobio in a wonderful conversation about biometrics and cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.499,
    "end": 5074.3,
    "text": "And I learned loads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5075.161,
    "end": 5076.421,
    "text": "And Lance DaCosta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.823,
    "end": 5082.726,
    "text": "And that was the one where I was telling you before we went on live, there was a lot of maths learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5083.467,
    "end": 5084.788,
    "text": "So to be honest, Daniel, I'm just learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5085.929,
    "end": 5087.65,
    "text": "And I'm applying for PhDs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.522,
    "end": 5092.766,
    "text": " And hopefully that will kick off either later this year or the new year, but I'm not going anywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5093.466,
    "end": 5094.007,
    "text": "I'll put it that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5096.829,
    "end": 5097.149,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5097.75,
    "end": 5098.25,
    "text": "Very fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.431,
    "end": 5098.611,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.851,
    "end": 5100.052,
    "text": "Very epistemic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.332,
    "end": 5100.993,
    "text": "Very chill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5101.713,
    "end": 5102.554,
    "text": "So very chill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5102.774,
    "end": 5103.015,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.035,
    "end": 5105.477,
    "text": "A lot of good comments in the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.497,
    "end": 5106.057,
    "text": "You can review.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5106.097,
    "end": 5108.439,
    "text": "So thank you everyone in the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5108.499,
    "end": 5109.26,
    "text": "Thank you, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.28,
    "end": 5109.96,
    "text": "Thank you everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5110.541,
    "end": 5110.841,
    "text": "See y'all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5112.122,
    "end": 5112.443,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.723,
    "end": 5112.823,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.843,
    "end": 5112.923,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]