[
  {
    "start": 2.647,
    "end": 4.931,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5.452,
    "end": 16.453,
    "text": "My name is Navid Hakimi, and I'm very glad to be joined here by Professor Chatter and Dr. McKay from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.598,
    "end": 23.488,
    "text": " Warwick Institute and Mathematics Institute in the UK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.508,
    "end": 31.421,
    "text": "And they're going to talk about thermal macroeconomics, a thermodynamic approach to economics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.064,
    "end": 38.914,
    "text": "So the first part of the talk would be them going through the presentation and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.894,
    "end": 68.749,
    "text": " hopefully we're going to have time to ask some questions and ask their opinion about the mapping between their concepts and active inference and also more maybe general questions about macroeconomics so very glad and very excited for the talk and i give the mic to dr mckay right so in fact nick here's i'm going to start off",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.387,
    "end": 90.687,
    "text": " a brief sort of conceptual outline um and then um robert is going to give a a little more detailed technical summary and i should say that um i wish i was at the mathematical mathematics institute at work because it's a very grand place to be um but i'm not that mathematical so i'm i'm in the behavioral science group at or at business school and a behavioral scientist by background",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 90.667,
    "end": 105.688,
    "text": " And in fact, it's probably a good place to start actually, because an interesting question for people interested in economics from a behavioural point of view is how do we make sense of economic theory as it's currently practised",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 105.668,
    "end": 111.837,
    "text": " which assumes, for theoretical reasons, extremely rational and sophisticated agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 111.857,
    "end": 120.33,
    "text": "They often have perfect knowledge and perfect calculating abilities, and they do perfect Bayesian inference, and they maximize some utility, each one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 120.43,
    "end": 128.462,
    "text": "And then we put those agents together and explain aggregate phenomena as a kind of complicated outcome of all those extremely rational agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 128.903,
    "end": 133.65,
    "text": "And the behavioral spin on that is always, well, yes, but people aren't really like that, are they?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 133.63,
    "end": 139.962,
    "text": " and you get all kinds of irrationalities at the individual level, and perhaps some of those lead to a group level of rationalities as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 140.342,
    "end": 142.787,
    "text": "So, for example, booms and busts through herding and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 143.168,
    "end": 148.838,
    "text": "But the basic problem for trying to found an economic theory",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 148.818,
    "end": 165.948,
    "text": " is that if it turns out that the agents that we're working with are much, much more heterogeneous and complicated and not as rational as in standard theory, does that invalidate or at least throw into question standard economic theory?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 166.408,
    "end": 167.991,
    "text": "So an interesting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 167.971,
    "end": 192.564,
    "text": " strategy to assuage that worry, which is roughly where Robert and I have been going, although there are a variety of motivations you might use for this approach, but this is one of them, is to say, well, hang on, at the aggregate level, maybe economies can work in quite a predictable way, even if the individual elements within them are extremely complicated and heterogeneous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 193.004,
    "end": 196.729,
    "text": "And in fact, we sort of have to believe that because real economists don't really think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 196.709,
    "end": 206.09,
    "text": " that players in markets are perfectly informed about all possible outside options and have a perfect understanding of the implications of all their choices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 206.551,
    "end": 207.914,
    "text": "It's just clearly not the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.836,
    "end": 216.253,
    "text": "And yes, at least on the face of it, basic economic principles seem to be reasonably applicable to the real world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 216.233,
    "end": 230.35,
    "text": " So it seems like you have to really have some belief that there's a way of understanding the aggregate phenomena without understanding micro-foundations in any great deal, because they're just too complicated to understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 230.93,
    "end": 245.127,
    "text": "And then a natural parallel that comes to mind, it's not come to mind to us uniquely, because this has been something that people thought about forever, sort of at least a century, probably more, is the thought that, well, in physics,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 245.107,
    "end": 255.958,
    "text": " you can say all kinds of aggregate things about, for example, the temperatures and pressures and so on, without really understanding the micro foundations terribly well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 256.038,
    "end": 267.33,
    "text": "Indeed, of course, classical thermodynamics arose before people had any real idea about micro foundations and I think weren't too sure about whether the atomic theory was correct and really basic things like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 267.851,
    "end": 274.978,
    "text": "So it turns out to be possible, at least in the physical context, to have an aggregate theory without really understanding the micro foundations you're working with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 274.958,
    "end": 294.773,
    "text": " and of course then it turned out later of course that at least for certain systems like very simple gases you can figure out micro foundations and miraculously everything sort of fits together the micro foundations and macro story can be beautifully aligned which is an extraordinary scientific discovery.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 294.753,
    "end": 305.567,
    "text": " But of course, the concepts of classical thermodynamics still apply to all kinds of complicated things like human bodies and so on, which are where the micro-foundations are extremely difficult.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 305.587,
    "end": 315.099,
    "text": "So if you're trying to apply thermodynamics to biological systems, you're going to struggle with micro-foundations, but still, my body has a well-defined temperature and so on, to some extent anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 315.64,
    "end": 323.19,
    "text": "So the thought is, can we, and this is, as I say, not a unique thought to us, can we understand the aggregate properties of economies",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 323.17,
    "end": 327.735,
    "text": " with that understanding of micro-foundations, just as is possible in the physical case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 327.755,
    "end": 334.243,
    "text": "And of course, the dream scenario would be there's some direct mapping, some sort of natural mapping from one case to the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 334.864,
    "end": 344.115,
    "text": "And this is, again, something that people have thought about for at least a century, because they've seen so many intuitive connections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 344.095,
    "end": 351.482,
    "text": " So it feels like something where there ought to be a possible connection and people have struggled to make that connection rigorous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 352.063,
    "end": 355.667,
    "text": "And what we've tried to do is to see if we can make that connection rigorous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.167,
    "end": 371.082,
    "text": "And the only other thing I want to say is that one reason that we took the approach we did is that we were inspired by a very interesting work on the axiomatic foundations of thermodynamics by Lieb and Ingverson.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 371.348,
    "end": 384.443,
    "text": " And the great thing about their approach is that they have a very clear mathematical, they sort of lay out the mathematical principles which underlie classical thermodynamics in a way that doesn't require any reference to any physical notions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 384.583,
    "end": 387.967,
    "text": "You don't have to worry about heat or temperature or work or anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 388.247,
    "end": 390.069,
    "text": "You just have this mathematical structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 390.389,
    "end": 398.098,
    "text": "And indeed, they say in their papers that this structure of principle could apply to other things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 398.078,
    "end": 411.999,
    "text": " what struck us many years ago now is that, well, if there is a mapping to be created between these two domains, economics and thermodynamics, then that abstract mathematical structure that they've created ought to be transferable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 412.64,
    "end": 417.187,
    "text": "And that's the starting point for the approach is to try to make that leap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 418.468,
    "end": 419.53,
    "text": "And I think if we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 419.51,
    "end": 426.177,
    "text": " It's taken us a long time to get there, but we, I think, do have a fairly firm understanding, at least the simple cases of how that works now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 427.058,
    "end": 435.027,
    "text": "So I'll hand over to Robert for a more technical talk, but at least I'll hopefully give listeners some sense of why we're trying to do this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 435.147,
    "end": 442.395,
    "text": "Of course, I should also say just very briefly that the hope is both to reconstruct some aspects of existing economic theory,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 442.375,
    "end": 459.331,
    "text": " The dream scenario would be able to go beyond that, to use this method to explain systems that can't really be explained in conventional terms, so that one actually has a richer theory, or at least a complementary theory to existing approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 459.771,
    "end": 462.898,
    "text": "But with that, I will stop and hand over to Robert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 464.33,
    "end": 466.153,
    "text": " Thanks, Nick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.173,
    "end": 476.388,
    "text": "So yeah, I'll present some of our theory, but also some tests by simulations that have been done by our student Yihang Luo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 479.593,
    "end": 482.577,
    "text": "So we deal with what are called exchange economies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 482.698,
    "end": 486.603,
    "text": "These are a very standard concept in at least economic theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.864,
    "end": 488.987,
    "text": "You'll find this in any textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 490.317,
    "end": 491.318,
    "text": " in economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 492.199,
    "end": 502.432,
    "text": "So the idea is that we have a large, finite, fixed number of agents and we have a finite number of types of durable, infinitely divisible good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.333,
    "end": 504.935,
    "text": "One of them we call money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 506.957,
    "end": 510.942,
    "text": "And agents repeatedly exchange goods in encounters",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.411,
    "end": 531.304,
    "text": " According to some physicists, we'd say rules, but just some behavioral characteristics, say, the key assumption we make is that this dynamics is assumed to lead to convergence of probabilities, at least for the allocation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.065,
    "end": 533.267,
    "text": "So we're not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 533.534,
    "end": 545.23,
    "text": " We're not asking for the process to terminate with some, in quotes, optimal allocation, but we are asking for process to converge to some probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.37,
    "end": 553.821,
    "text": "So individual allocation will keep hopping around, but the probability distribution will be a fixed one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.045,
    "end": 572.207,
    "text": " We start with what we call basic economies, so ones with no barriers, so that a part of good could, in principle, transfer from any of the agents to any of the other agents via perhaps a long route.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 574.13,
    "end": 577.835,
    "text": "And for these, we assume convergence to a unique equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 578.255,
    "end": 582.221,
    "text": "So equilibrium, again, means a probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 582.281,
    "end": 584.584,
    "text": "It's not a fixed allocation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.172,
    "end": 588.338,
    "text": " Unique given the total amounts of each type of good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.3,
    "end": 593.127,
    "text": "So obviously the types of good we're supposing are conserved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 593.948,
    "end": 599.198,
    "text": "So we get different equilibria as you change the amounts of good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 600.308,
    "end": 610.25,
    "text": " But we're really interested in multi-part economies, so where goods of some types are constrained to some subsets of agents, which we call components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 610.551,
    "end": 620.292,
    "text": "Just think of an economy that lives on two islands, and maybe some goods can't be transferred from one of the islands to the other, but other goods can, and maybe money can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 622.162,
    "end": 634.217,
    "text": " So again, we'll assume conversions to unique equilibrium, but now specifying the total amount of each type of good isn't enough because the amount of good on one island can't change either.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 634.497,
    "end": 636.339,
    "text": "So we need to specify a bit more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 638.782,
    "end": 647.213,
    "text": "Then the question is what happens if one removes some barriers or puts two or more economies in some form of contact, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 647.353,
    "end": 650.717,
    "text": "So suppose it becomes possible to move the good from one island to the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.604,
    "end": 656.368,
    "text": " And this one can regard as a basic question in economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 659.832,
    "end": 663.316,
    "text": "So we have an answer, which is very different from standard economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 664.738,
    "end": 671.485,
    "text": "Our answer is that under some axioms, and one significant one that I highlight is extensivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 671.565,
    "end": 676.671,
    "text": "So we assume that there's some scaling symmetry of economic systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 677.883,
    "end": 703.502,
    "text": " then each economy has a concave, twice-differentiable entropy function, we call it S, of its state, so the state is given by the amounts of money and goods in the various components that I talked about, such that when you put economies in contact, the total entropy cannot decrease, and any outcome that increases the total entropy is possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 704.461,
    "end": 710.15,
    "text": " until you reach a final outcome that maximizes the total entropy, then there's nowhere else to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 713.476,
    "end": 719.846,
    "text": "Contrast this with standard economics, where no economy would want to reduce its utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 719.906,
    "end": 723.111,
    "text": "So if we think of this entropy as maybe like a utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 725.369,
    "end": 734.764,
    "text": " And the final outcome would be a Pareto optimal allocation accessible from the initial endowment, which wouldn't necessarily maximize the total utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 738.671,
    "end": 751.512,
    "text": "So this is the basic answer, but I'm going to go through a list of further consequences and illustrate them by Yang's simulations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 754.023,
    "end": 758.668,
    "text": " So the first consequence is that each economy has a financial temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.629,
    "end": 768.357,
    "text": "And this is actually given by the reciprocal of the partial derivative of the entropy with respect to the amount of money in the economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.479,
    "end": 774.563,
    "text": "And on financial contact, money flows from hotter to cooler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 775.304,
    "end": 781.33,
    "text": "So this is part of why we call our approach thermal economics, because we do have a concept of temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.824,
    "end": 792.613,
    "text": " Each good, say, type I in an economy, has a marginal value, mu I, which is just given by this partial derivative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.955,
    "end": 808.87,
    "text": "And the economy buys from or sells to an external trader according as the trader's price is below or above what we call market price, mu I, for the good, which is the temperature times this value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.448,
    "end": 822.419,
    "text": " So we predict which way goods would flow if some external trader says, OK, I'm willing to buy or sell at such and such a price.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.702,
    "end": 829.846,
    "text": "Next consequence is we can make money out of temperature differences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 830.346,
    "end": 834.591,
    "text": "And this is basically by making what's in physics called Carnot cycles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.171,
    "end": 838.114,
    "text": "And funnily enough, I'm in Dijon at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.191,
    "end": 849.403,
    "text": " I'm in the Mathematics Institute, but right next door is the Institut Carnot de Bourgogne in physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 853.107,
    "end": 867.443,
    "text": "Maxwell, yeah, another consequence is we get relations between partial derivatives, like, for example, that the partial derivative of the value of the i-th type of good with respect to the amount of the j-th is symmetric.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 867.608,
    "end": 872.156,
    "text": " respect to interchanging i and j. In physics, these would be called Maxwell relations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.517,
    "end": 878.708,
    "text": "In economics, at the level of individual agents, such relations are called Hotelling relations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 879.79,
    "end": 882.255,
    "text": "So it's the same mathematics, if you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 882.936,
    "end": 889.448,
    "text": "And it's due to the fact that the entropy is twice differentiable, and you get a symmetry of second derivatives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.132,
    "end": 903.004,
    "text": " We also deduce, because of the law of non-decrease of entropy, non-negativity of various partial derivatives and matrices of partial derivatives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.525,
    "end": 919.08,
    "text": "And furthermore, we get inequalities between derivatives subject to... We can do derivatives with respect to constant amounts, as I've talked about here, or with respect to constant prices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.917,
    "end": 925.102,
    "text": " Okay, so that's maybe a lot to take hold of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 925.182,
    "end": 926.744,
    "text": "But to make it a bit more concrete.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.507,
    "end": 933.934,
    "text": "We tested the ideas on some simulated economies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.614,
    "end": 939.441,
    "text": "So the simplest type that we used what we call Cobb Douglas economies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 940.662,
    "end": 946.43,
    "text": "Each agent has what we'll call a utility function that is used differently from standard economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 947.391,
    "end": 950.755,
    "text": "Cobb Douglas utility is this product of powers, the amount of money",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 951.038,
    "end": 955.267,
    "text": " to a power e to minus one times the amount of goods to a power alpha minus one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 956.99,
    "end": 969.756,
    "text": "And on parallelized encounters, they pool their belongings and they redistribute between themselves with a probability density that's proportional to the product of their utility functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.221,
    "end": 981.531,
    "text": " So the idea is that this process will bias the outcome towards increasing utility for the two agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 982.992,
    "end": 988.278,
    "text": "But there's the probability of one or other moving the wrong way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 992.622,
    "end": 999.068,
    "text": "And for this type of economy, we can prove convergence to equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.005,
    "end": 1011.897,
    "text": " So there is a probability distribution for the allocation over the n agents that is stationary with respect to this process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1012.638,
    "end": 1018.304,
    "text": "And whatever probability distribution you start with will converge to it as time goes to infinity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.245,
    "end": 1025.292,
    "text": "Furthermore, we can prove using basically the construction of the theorem of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1025.407,
    "end": 1029.653,
    "text": " for this case that the entropy has this formula.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1029.814,
    "end": 1037.665,
    "text": "So it's number of agents times log of the mean money per agent to the power eta times the mean goods per agent to the power alpha.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1039.208,
    "end": 1042.132,
    "text": "And from this, we can deduce what the temperature is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.192,
    "end": 1047.921,
    "text": "So just by differentiating definition of temperature, it should be m over n times eta.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1048.582,
    "end": 1052.848,
    "text": "And the price of the good, here I'm just supposing one type of good,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1052.963,
    "end": 1068.565,
    "text": " as well as money, will be alpha m over e to g. So Yihang put two of these Cobb-Douglas economies in financial contact, one with an initial temperature of 50 and the other 100.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1069.006,
    "end": 1075.194,
    "text": "And he let them equilibrate, settle down a bit, and then put them in contact at this time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1075.815,
    "end": 1079.14,
    "text": "And you see that indeed the temperatures move together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1079.474,
    "end": 1105.279,
    "text": " and we could have plotted how the money flows but the point is the money flows from the hotter to the cooler of course there are fluctuations here because the simulations are just for finite size whereas the theory is really for the thermodynamic limit of infinite size another simulation test we did was to put",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1105.782,
    "end": 1112.13,
    "text": " a Cobb Douglas economy in contact with a trader offering to buy or sell the good at a given price.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1113.172,
    "end": 1122.384,
    "text": "So we chose the amount of goods in the economy to be 500,000 and at this time put it in contact with the trader.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1122.764,
    "end": 1125.708,
    "text": "So the blue curve is when the trader is offering a price of 0.9.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1126.609,
    "end": 1129.232,
    "text": "The market price initially is 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1130.294,
    "end": 1133.578,
    "text": "So if the trader offers a price of 0.9,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.47,
    "end": 1138.136,
    "text": " Well, then the economy is going to say, oh, that's a good idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1138.216,
    "end": 1139.097,
    "text": "Let's buy lots of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1139.558,
    "end": 1143.063,
    "text": "The amount of goods in the economy is going to go up as we see this blue curve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1144.165,
    "end": 1149.113,
    "text": "But then, of course, the situation in the economy has changed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1149.674,
    "end": 1155.803,
    "text": "The market price will have decreased and it decreases to around 0.9 and then fluctuates around there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1157.909,
    "end": 1163.054,
    "text": " If the trader offers a price of one, well, then there's no significant initial movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1163.474,
    "end": 1167.658,
    "text": "The amount of goods fluctuates around here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1168.339,
    "end": 1177.148,
    "text": "And similarly, if the trader offered a price of 1.1, then the economy is going to say, oh, good, let's sell to the trader.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1178.749,
    "end": 1183.714,
    "text": "OK, so there are two illustrations of the theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1185.938,
    "end": 1194.31,
    "text": " Another illustration is we can put two of these Cobb-Douglas economies in full contact, meaning we allow money and goods to flow between them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.151,
    "end": 1202.301,
    "text": "So here we've plotted horizontally as the amount of goods in the first economy and vertically the amount of money in the first economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1203.223,
    "end": 1209.752,
    "text": "And the total amount is given by the opposite side of the square, if you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1210.846,
    "end": 1218.194,
    "text": " So our initial allocation, the first economy doesn't have many goods, but it has more money than the other one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.594,
    "end": 1219.315,
    "text": "So we start here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1220.556,
    "end": 1222.538,
    "text": "And we let them exchange.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1223.78,
    "end": 1229.486,
    "text": "The economies actually have different exponents in their Cobb-Douglas laws.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1230.967,
    "end": 1232.529,
    "text": "Just to show that doesn't matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1233.65,
    "end": 1238.355,
    "text": "And the simulations trajectories look like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1238.555,
    "end": 1246.783,
    "text": " there is flow of money and goods from one to the other, and then it settles down around some point here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1247.664,
    "end": 1254.771,
    "text": "And the contours in this picture are the contours of total entropy, the entropy of the two economies added together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1255.872,
    "end": 1261.137,
    "text": "So you see that the entropy increases to this maximum point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1264.0,
    "end": 1267.684,
    "text": "Over here, we chose a different initial endowment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1268.322,
    "end": 1269.524,
    "text": " And we get the same behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1270.465,
    "end": 1291.133,
    "text": "But the interesting thing in this is, again, to contrast with standard economics, what I've done here is to plot in orange the indifference curve for economy two and in blue indifference curve for economy one, meaning constant entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1291.153,
    "end": 1293.216,
    "text": "So if we interpret entropy as a utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1294.917,
    "end": 1308.799,
    "text": " So the standard analysis, which is called Edgeworth Box, would say that depending on the negotiating skills of the two economies, we'd end up somewhere on this Pareto frontier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1309.3,
    "end": 1316.571,
    "text": "That's where there's no way that one can benefit without the other losing something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1317.867,
    "end": 1323.395,
    "text": " And indeed, the maximum entry point in this picture is in this interval of the Pareto frontier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1323.635,
    "end": 1324.556,
    "text": "But over here, it isn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1325.197,
    "end": 1328.141,
    "text": "Edgeworth-Box would say that you go to some point up here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1328.842,
    "end": 1330.745,
    "text": "But when we put them in contact, they go here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1334.27,
    "end": 1334.59,
    "text": "OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.231,
    "end": 1338.535,
    "text": "I mentioned that you can make money out of temperature differences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1338.636,
    "end": 1347.688,
    "text": "So just to briefly describe that, let's suppose we have two economies, which I'll call hot and cold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1348.445,
    "end": 1351.928,
    "text": " And we have a ship economy that can shuttle between them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1352.489,
    "end": 1355.892,
    "text": "And the trader can trade just with the ship economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1356.733,
    "end": 1362.378,
    "text": "And the trader can put the ship economy into financial contact with the hot or the cold mainland.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1364.881,
    "end": 1367.963,
    "text": "If we start here, total goods is horizontal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1368.064,
    "end": 1373.629,
    "text": "So we start with 4,000 goods on the ship and a temperature on the ship of 20.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1376.131,
    "end": 1378.013,
    "text": "Then what the trader does,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1378.55,
    "end": 1384.498,
    "text": " is to buy goods from the ship, which makes the amount of goods decrease.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.738,
    "end": 1385.839,
    "text": "We go up this blue curve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1386.16,
    "end": 1387.041,
    "text": "Temperature goes up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1387.141,
    "end": 1390.525,
    "text": "That's because actually the amount of money on the ship is going up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.786,
    "end": 1396.673,
    "text": "And because it's a Cobb Douglas economy, its temperature goes up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1396.693,
    "end": 1402.3,
    "text": "And it goes up until the temperature reaches 26, which is the temperature of the hot economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1402.681,
    "end": 1408.388,
    "text": "Then the trader connects the ship economy to the hot economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1409.853,
    "end": 1415.782,
    "text": " financially and decides to buy goods from the ship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1416.343,
    "end": 1437.514,
    "text": "So it buys goods from the ship and temperature on the ship fluctuates because there's a random process but basically around 26 there's some money flow also from the hot economy in order to maintain this temperature until a certain time when the trader decides to disconnect from the hot economy and carry on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1438.743,
    "end": 1440.786,
    "text": " selling goods to the ship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1441.286,
    "end": 1454.084,
    "text": "We go down this red curve until the ship reaches the temperature of the cold, then we put in contact with the cold and buy goods from the ship until we get back to the beginning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1456.287,
    "end": 1466.1,
    "text": "And in this process, the trader makes a net amount of money and in some sense is given by the area of this suitably interpreted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.705,
    "end": 1467.747,
    "text": " So we verified that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.448,
    "end": 1469.99,
    "text": "Okay, maybe that was a bit long.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.451,
    "end": 1476.74,
    "text": "In this one, we take into account reality that the hot and cold mainlands aren't infinitely large.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.78,
    "end": 1480.626,
    "text": "So actually, as money flows out of the hot one, its temperature is going to decrease a bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1481.587,
    "end": 1484.752,
    "text": "And similarly, as money flows into the cold one, its temperature will go up a bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.253,
    "end": 1487.616,
    "text": "So here we get a spiral instead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1490.431,
    "end": 1503.831,
    "text": " Maybe I should just skip these things if they're too technical, but this was a simulation to illustrate the symmetry and negative definiteness of these partial derivatives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1505.053,
    "end": 1515.529,
    "text": "So we took what we call a substitutes economy, where there are two types of good, but the Asians only care about the total amount of the two types of good they have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1515.909,
    "end": 1517.772,
    "text": "So that's why we call it a substitutes economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1518.781,
    "end": 1521.286,
    "text": " And we also studied case of a compliments economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1521.867,
    "end": 1523.109,
    "text": "Again, two types of good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.772,
    "end": 1530.001,
    "text": "The utility for an agent is given by the minimum of the amounts of good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1530.182,
    "end": 1533.668,
    "text": "So one good is useless without a corresponding amount of the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1535.808,
    "end": 1537.51,
    "text": " And you can compute the entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1538.511,
    "end": 1544.838,
    "text": "Again, it's feasible to do this, but what we do is we use Cobb-Douglas economies as meters in the simulations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1545.699,
    "end": 1552.767,
    "text": "And so we look at these partial derivatives and we see that indeed they're negative definite and pretty close to symmetry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.531,
    "end": 1565.562,
    "text": "Another thing we do is putting economies in contact and look at the flow between them as a function of the value difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1566.149,
    "end": 1572.858,
    "text": " So actually, we do it the other way around because it's slightly easier to simulate and measure the value difference for given flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1573.538,
    "end": 1577.584,
    "text": "And again, we get some matrices representing this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1578.284,
    "end": 1580.647,
    "text": "And the theory says they should be positive definite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.687,
    "end": 1582.33,
    "text": "And indeed, that seems to be the case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1584.933,
    "end": 1595.346,
    "text": "As Nick started out by saying, a big motivation was to make a theory of macroeconomics that allows for real",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1596.457,
    "end": 1601.603,
    "text": " behavioral agents rather than the economist's ideal rational maximizers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.526,
    "end": 1604.707,
    "text": "So we simulated one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.168,
    "end": 1610.054,
    "text": "So this is an example that we call Bouchot economy after Bouchot who inspired it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1610.975,
    "end": 1620.447,
    "text": "We suppose that the utility for agent I depends not just on their own money, MI, but also on the mean money that everyone else has.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.509,
    "end": 1625.653,
    "text": "So of course, if we just have one economy, the mean money is not going to change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1626.578,
    "end": 1630.083,
    "text": " But if we put two of these in contact, then the mean can change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1631.244,
    "end": 1632.526,
    "text": "And so that's what we did here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.207,
    "end": 1645.985,
    "text": "We just again confirmed that if we take two Bouchot economies here and here, the yellow and blue with different initial temperatures and then put them in contact at time two, then their temperatures will converge together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1650.591,
    "end": 1655.758,
    "text": "More recently, one thing we've been doing is for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.953,
    "end": 1660.137,
    "text": " what we call calorimetry by an analogy of physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.478,
    "end": 1668.367,
    "text": "So you might say, okay, this theory is great, but for a complicated system, how on earth could I hope to know what the entropy function is?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1669.868,
    "end": 1671.43,
    "text": "But it's exactly like in physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1672.271,
    "end": 1682.083,
    "text": "Even something like steam is too complicated to do theoretical calculations for the entropy as a function of, say, pressure and temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1682.907,
    "end": 1688.112,
    "text": " So what do the engineers do who run steam turbines, as my grandfather was?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1690.234,
    "end": 1701.645,
    "text": "They have steam tables, so they do lots of experiments, and they manage to deduce what the entropy function is by looking at how much heat is absorbed or given out in various changes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.605,
    "end": 1705.588,
    "text": "So we do the same in economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1706.629,
    "end": 1711.834,
    "text": "For a real economic system, this may be rather difficult because you have to be allowed to mess with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.692,
    "end": 1714.898,
    "text": " But for our simulated ones, it's easy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.844,
    "end": 1725.148,
    "text": "So we measure the entropy by integrating this relation for the entropy with respect to money and goods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1725.517,
    "end": 1729.861,
    "text": " And the point is this integral is supposed to be path independent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.881,
    "end": 1730.882,
    "text": "So the theory says.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1731.423,
    "end": 1734.586,
    "text": "And indeed, we check that and find it's nearly independent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1735.106,
    "end": 1736.327,
    "text": "And we get a picture here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1737.128,
    "end": 1754.224,
    "text": "So there is a class of models, and this is something Navid was interested in, for which one can prove that the entropy is actually logarithm of some what's called partition function in statistical mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.672,
    "end": 1762.779,
    "text": " And so this connects the macro theory with micro.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1762.799,
    "end": 1765.723,
    "text": "But that's not fundamental to our analysis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1768.846,
    "end": 1778.696,
    "text": "OK, so in principle, this would be a good test if one, I guess some people are big enough to be able to play with an economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1779.837,
    "end": 1781.359,
    "text": "We've seen notable examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1781.997,
    "end": 1787.303,
    "text": " And if you're allowed to play, well, then you could try to measure the entropy function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1791.968,
    "end": 1801.439,
    "text": "So a conclusion of this presentation, we've presented a thermodynamic theory of macroeconomics, at least in the context of extensive exchange economies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1802.84,
    "end": 1808.967,
    "text": "And the main things we show that they have an entropy function and no interaction can decrease the total entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1809.942,
    "end": 1820.694,
    "text": " So a question that maybe you want to ask us, but I'm going to start by asking you is, how does this entropy relate to the free energy principle and active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1822.736,
    "end": 1832.227,
    "text": "So maybe I'll just finish this slide and then let you answer that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1833.268,
    "end": 1838.093,
    "text": "So the publications, we have three that are out, at least in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.596,
    "end": 1840.338,
    "text": " to an archive, one in a journal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1841.9,
    "end": 1848.328,
    "text": "And the s is log z is something that's nearly finished.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.668,
    "end": 1852.653,
    "text": "Calorimetry, we have results but haven't written up yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.255,
    "end": 1866.19,
    "text": "And we've been thinking and hopefully got some ideas about extending to include things like manufacturing, production, consumption, migration, multiple currencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.777,
    "end": 1881.354,
    "text": " And a big hope is that we could generalize to non extensive economies, because probably unlike in physics, most economies are not going to satisfy this scaling symmetry property.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.614,
    "end": 1888.021,
    "text": "I mean, it's already a problem in physics, you know, if you want to do statistical mechanics of stars, then you can't apply the usual thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1890.504,
    "end": 1894.168,
    "text": "Okay, so that's a quick outline.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1896.781,
    "end": 1898.183,
    "text": " Well, thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.483,
    "end": 1899.425,
    "text": "That was incredible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.885,
    "end": 1915.407,
    "text": "And I was really surprised by, when I first saw the paper, I was really surprised by all the connections and all the fantastic insight that it provides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.487,
    "end": 1922.316,
    "text": "It really settles down some of these ancient questions about trade and tariffs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.667,
    "end": 1931.438,
    "text": " I'm not sure if it settles down, but it actually gives a really interesting perspective about these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.139,
    "end": 1938.587,
    "text": "Instead of people just arguing with words, it actually puts an equation there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.468,
    "end": 1941.571,
    "text": "So very incredible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.733,
    "end": 1948.54,
    "text": "But at the same time, I had the feeling that macroeconomics and thermodynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.874,
    "end": 1957.311,
    "text": " There are so much similarity between them because they're kind of coarse graining of millions or billions of interactions and you know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.372,
    "end": 1970.258,
    "text": "Why this is like my question is why this is this isn't the standard approach, or is it like in macroeconomics why why don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.537,
    "end": 1980.97,
    "text": " Usually people use this kind of language and this kind of approach to model complex phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.751,
    "end": 1982.892,
    "text": "Yeah, that's a good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.053,
    "end": 1988.781,
    "text": "I mean, maybe we'll take turns, or we'll both offer answers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1990.283,
    "end": 1994.288,
    "text": "But, you know, from early days of economics,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1994.47,
    "end": 2000.558,
    "text": " people have thought and talked about making the connections with physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2001.259,
    "end": 2009.351,
    "text": "So, you know, well, a major player in this is Paul Samuelson.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.873,
    "end": 2018.924,
    "text": "So he, in fact, transferred ideas or in some context, he reckoned the economists that had them first, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2019.084,
    "end": 2023.971,
    "text": "But anyway, he made connections with thermodynamic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.592,
    "end": 2049.283,
    "text": " thoughts but he didn't manage to make an entropy and in the end he despaired and decided maybe there wasn't any reason there should be an entropy function so part of what we're doing is saying well actually he shouldn't have given up we think that there really is an entropy function at least for this class of systems and we'd like to extend it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2051.542,
    "end": 2053.986,
    "text": " And I think, yes, Samuelson is a very interesting figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2054.026,
    "end": 2061.937,
    "text": "I think it's right that he... Did he attend and was very inspired by lectures possibly given by a student of Gibbs, not actually Gibbs himself?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2061.957,
    "end": 2063.079,
    "text": "Yes, that's right, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2063.74,
    "end": 2079.844,
    "text": "But he explicitly, in his Nobel Prize lecture, because he was really the most important mathematical economist of the 20th century, in his Nobel Prize lecture, he talks a lot, really a lot about thermodynamics, oddly enough, and the degree to which his ideas were inspired by them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2079.824,
    "end": 2083.912,
    "text": " But the direction he ended up going in was to focus purely on individuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2084.534,
    "end": 2095.656,
    "text": "So I think, as Robert says, I'm sure he struggled to find a mapping which would give an entropy function at the aggregate level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2095.636,
    "end": 2102.828,
    "text": " And he didn't have Liebman-Ingresson's helpful action metric approach, which is hiding in the background of our account.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2104.231,
    "end": 2110.121,
    "text": "But what he did do is focus on individual perfectly rational agents interacting in a market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.782,
    "end": 2119.838,
    "text": "And that idea that we had found macroeconomics on assumptions about individuals became the standard way to do things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2119.818,
    "end": 2124.309,
    "text": " And although, of course, everybody continually says, well, of course, we don't really believe these assumptions about individuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2124.791,
    "end": 2125.472,
    "text": "They're not really true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2125.513,
    "end": 2129.763,
    "text": "They don't really have perfect knowledge and perfect calculating ability, et cetera, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2130.064,
    "end": 2133.192,
    "text": "Nonetheless, the theory assumes that they do, and off it goes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2133.934,
    "end": 2135.498,
    "text": "So there's been this enormous...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2135.478,
    "end": 2145.453,
    "text": " sort of stream of mathematical economics, which undergirds really current economic theory, which has taken this very micro foundational approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2145.713,
    "end": 2149.239,
    "text": "But the micro foundations are very specific because they require this perfect rationality assumptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.9,
    "end": 2151.923,
    "text": "So in some ways, I mean, things could have gone very differently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2151.943,
    "end": 2160.416,
    "text": "I mean, from a very early stage, it could have been that people made a more solid connection with a classical thermodynamic approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2160.476,
    "end": 2162.599,
    "text": "And then there would have been a parallel stream of work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2162.579,
    "end": 2168.447,
    "text": " which was just focusing purely on the macro, perhaps not really worrying about the micro foundations at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2169.388,
    "end": 2170.61,
    "text": "But that hasn't happened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2170.91,
    "end": 2173.093,
    "text": "And now I think there's quite a lot of resistance to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2173.454,
    "end": 2182.005,
    "text": "So if we, when we talk to economists, which we do quite a lot, a very, very common point as well, this is all very well, but where are your micro foundations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2181.985,
    "end": 2187.512,
    "text": " I mean, of course we have some, if we take the Cobb-Douglas economy simulations, we can say, well, okay, that's our micro foundation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2188.273,
    "end": 2199.648,
    "text": "But we don't really think that's right because those are useful for saying that the theory makes correct predictions with a particular simulated instantiation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2199.968,
    "end": 2207.638,
    "text": "But the whole point is we don't want to make assumptions that human beings are really Cobb-Douglas agents or perfectly rational agents or any other specific kind of agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2207.618,
    "end": 2221.835,
    "text": " That would be to rely on the micro foundational story where we don't imagine such a story could really be spelled out since humans and firms and government regulations, et cetera, et cetera, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2221.895,
    "end": 2224.298,
    "text": "So inordinately complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2224.338,
    "end": 2228.884,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.214,
    "end": 2242.575,
    "text": " I think this is a fantastic, honestly very interesting direction and I'm really happy that at least you guys are working and we can enjoy reading these papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.497,
    "end": 2254.095,
    "text": "So you asked about the entropy definition in free energy principle and maybe Daniel can jump in here, but usually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.447,
    "end": 2265.114,
    "text": " In my experience, people have maybe shared the same mathematical formula, but everyone has their own internal model of what entropy really means and what it really does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.174,
    "end": 2270.447,
    "text": "So I can give you, for example, for me, it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2271.085,
    "end": 2281.566,
    "text": " it's really something that agents consider when there is degrees of freedom in different explanations for their hypothesis or for their model of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.868,
    "end": 2287.457,
    "text": "This creates a tension and free energy that is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.758,
    "end": 2308.821,
    "text": " dissipated when you come up to the maximum entropy solution, which is like basically kind of hypothesis testing, kind of comparing different hypotheses that they have the same accuracy, which one is less complex, which one has the least amount of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.775,
    "end": 2337.441,
    "text": " uh biases or prerequisites and stuff like that but yeah there are multiple other ways to describe this uh i don't know daniel if you want to add here to this explanation uh yeah well thank you for the presentation and i think navid your your comment right there at the beginning about how the core screening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.602,
    "end": 2347.935,
    "text": " between micro and macroeconomics is similar to that coarse graining between the agent level behavior and the aggregate collective phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.097,
    "end": 2367.883,
    "text": "So I guess my question was, when entropy is used in this physical sense of particles like the steam engine and the coarse graining of physical states, the decisions that they participate in are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.534,
    "end": 2398.495,
    "text": " not necessarily active they're following in a very straightforward sense uh energy gradients so what kinds of challenges arise in core screening when those economies that you're modeling could deal with memory full anticipatory contrarian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.475,
    "end": 2407.333,
    "text": " mimetic agents that undergo dynamics that aren't simply like the bulk flow of temperature or pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.537,
    "end": 2418.255,
    "text": "Because when entropy is discussed in agent-based modeling and so on, it's often the entropy of a belief distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.809,
    "end": 2435.721,
    "text": " in terms of the Bayesian updates of cognitive beliefs that an agent holds, which has some analogous formalisms to that of the gas engine and the temperature exchange, but in a way it's kind of transposed into a different register.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.671,
    "end": 2445.697,
    "text": " I can say a couple of things that Robert may have better things to say than I do, but a couple of thoughts in terms of bringing these approaches together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2446.278,
    "end": 2455.286,
    "text": "One, of course, is that in our world, we're just dealing with people trading goods, but they could also be trading stocks or securities of some kind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2455.686,
    "end": 2466.956,
    "text": "And the classic way that in economics, people try and relate those to beliefs is that they talk about this concept of the arrow debris of security, which pays you a dollar if some specific thing happens on a specific day, as it were.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2467.317,
    "end": 2468.678,
    "text": "So it's basically a bet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2468.658,
    "end": 2468.827,
    "text": " Thank you.",
    "chars": null
  },
  {
    "start": 2469.063,
    "end": 2481.456,
    "text": " So you could have a world in which people are trading bets with each other, saying, well, I've got this security, which will give me a dollar if this horse wins a race, and I don't really believe the horse is gonna win a race, so I don't think it's worth very much, but maybe you think it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2482.317,
    "end": 2498.935,
    "text": "So you could have a story, which we haven't developed, but you could have a story where people are actually aggregating their beliefs by trade, and our framework potentially might apply to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2498.915,
    "end": 2518.273,
    "text": " um but we don't and then of course you you might well have interesting um questions about um you know what what that what what what what the um the the aggregation of a a large number of people's beliefs and how that should should work and also um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.253,
    "end": 2526.307,
    "text": " to what extent that aggregate itself behaves in some, can be viewed in some sort of meta-level as kind of rational, irrational as the market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2526.747,
    "end": 2538.287,
    "text": "It's not really clear to the extent that we have a story which would generate an idea about the market itself as being a kind of information processing system, but it'd be an attractive idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2538.267,
    "end": 2546.561,
    "text": " Because what we're trying to do is to think of the macro system as the thing we're focusing on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2546.621,
    "end": 2552.791,
    "text": "So it could be we can think of the macro system as a kind of belief updating machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2553.312,
    "end": 2565.051,
    "text": "And so where specific bits of information get fed into different bits of it, because different people learn, as they do in a real economy, to have different bits of private snippets of information, different bits of expertise, and yet the whole market as a whole.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2565.031,
    "end": 2585.79,
    "text": " it's going to produce some kind of aggregate outcome so you're trying to you're trying to see that because we'd be interested in seeing that process seeing the whole system as as an information processor is is closer to our approach than focusing on an individual personal brain so of course that's still super important how um individual brains work but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2585.77,
    "end": 2598.041,
    "text": " here we're thinking, well, is there some information, it's interesting to speculate, is there some interesting information processing story about whole systems of people when they can interact in a market-like way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2598.321,
    "end": 2606.007,
    "text": "And of course, they might not just interact in a market-like way, because as you suggest, Daniel, there are lots more complex interactions they might engage in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.047,
    "end": 2611.332,
    "text": "For example, they might talk to each other or observe each other or think each other's reasoning is flawed and so on and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2611.352,
    "end": 2614.815,
    "text": "So there may be many more complicated things going on there, which we don't have a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2614.795,
    "end": 2640.28,
    "text": " a story about but the hope would be that the macro story might be somewhat at least in some in some cases might be somewhat independent of those details yeah that that was sort of my follow-up question is what sorts of software or theoretical or empirical developments do you feel like this line of research is taking you towards is there some kind of retrospective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.26,
    "end": 2668.984,
    "text": " analysis that you feel could look at indicators in economies that would differentiate these formalisms and demonstrate their ability to provide explanations and predictions or do you feel like there's some kind of manipulation sequence for a small controlled or for an open economy that again would uniquely show where there's an explanation or a prediction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.9,
    "end": 2684.963,
    "text": " Yeah, for me, the dream would be that we can advise, for example, on what trade agreements to come to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2685.524,
    "end": 2688.45,
    "text": "So while we were going through Brexit, this was a lot in my mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.49,
    "end": 2691.495,
    "text": "And I thought, well, if we developed our theory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.049,
    "end": 2702.48,
    "text": " sufficiently, then we could advise on what trade agreements to come to, because the idea is you'll see which trades would happen under certain circumstances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.241,
    "end": 2717.196,
    "text": "And so that's a long way, partly because at the moment, our theory is only for these exchange economies, though, as Nick has said, that includes a lot of things that do approach reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2718.627,
    "end": 2729.883,
    "text": " But for example, we don't, well, we haven't yet written about manufacturing and production and consumption, migration and things like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2730.564,
    "end": 2744.924,
    "text": "So in order to really make some genuine contact with real economics, we have to extend the domain first because, you know, it's the question economists usually ask me is what predictions can you make about economies?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2745.765,
    "end": 2746.947,
    "text": "So for the moment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2748.023,
    "end": 2754.99,
    "text": " We can predict for exchange economies, but then you need an example that really is an exchange economy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2756.532,
    "end": 2764.941,
    "text": "So the dream is that this will really shake up the whole way that macroeconomics in practice is done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.782,
    "end": 2776.073,
    "text": "So every government is going to have people who will be busy trying to estimate entropies and derivatives of entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2777.234,
    "end": 2781.581,
    "text": " work out how to maximize entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.165,
    "end": 2794.261,
    "text": "So in the previous direction, you're asking how one can hope to incorporate complicated agent behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.301,
    "end": 2800.35,
    "text": "But I think, as we've said, that's really not an issue as long as our axioms are satisfied.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2800.811,
    "end": 2805.418,
    "text": "So basically, we need this convergence to equilibrium, and then we need various other things that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2805.567,
    "end": 2811.114,
    "text": " A lot of them are really rather trivial, but some have some substance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2814.799,
    "end": 2818.204,
    "text": "Go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.224,
    "end": 2828.478,
    "text": "I wanted to ask a very similar, but maybe related question, at least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.499,
    "end": 2834.005,
    "text": "When you talked about the trade and when you talked about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.318,
    "end": 2839.428,
    "text": " the end goal of this kind of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2839.448,
    "end": 2853.681,
    "text": "And I was reading recently, like, an economic book, Free to Choose, and there are a lot of quotes from, you know, Adam Smith in it and, you know, the market invisible hand that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.083,
    "end": 2856.166,
    "text": " organizes this whole operation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.947,
    "end": 2864.358,
    "text": "And then again, for me, it was like a moment of epiphany or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.859,
    "end": 2874.252,
    "text": "Because in free energy principle, we talk about these invisible hands in the sense of self-organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.232,
    "end": 2889.861,
    "text": " and how free energy gradients cause a mark of boundaries to form or cause agents to behave in a way or collection of agents to behave in a way to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.841,
    "end": 2895.269,
    "text": " get rid of these free energies, you know, act against these gradients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.289,
    "end": 2918.042,
    "text": "And that's how the structures form, you know, in a hierarchical event, you know, like in a in a biological system or any kind of self-organization that we talk about is kind of there is a gradient of free energy and then self-organization happens because of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.393,
    "end": 2924.927,
    "text": " And now in macroeconomics, again, we have a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.11,
    "end": 2929.434,
    "text": " This phenomena, it seems that especially in a free market kind of condition that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.715,
    "end": 2942.246,
    "text": "You know, you have these B2C businesses and then B2B businesses, and then, you know, governments that organize or maybe sometimes interfere with this kind of phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.128,
    "end": 2951.455,
    "text": "But the main main question, if you think about it this way, is that so where is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.654,
    "end": 2959.754,
    "text": " This whole economic machinery, what kind of gradient is it trying to eliminate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2960.035,
    "end": 2962.862,
    "text": "Where is the gradient?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.821,
    "end": 2967.107,
    "text": " Is it trying to satisfy human needs at the end?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.127,
    "end": 2969.891,
    "text": "Like is this utility thing is a little bit complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.573,
    "end": 2982.032,
    "text": "And then what is the source of all of these low entropy or available free energy that feeds into this whole cycle and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.012,
    "end": 2986.998,
    "text": " Yeah, well, these are deep, deep issues, I think, Nareed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2987.058,
    "end": 2996.89,
    "text": "But I think we have some sort of nebulous and not perfectly formed yet thoughts on some of these questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.91,
    "end": 2998.872,
    "text": "So it's only the notion of utility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3000.374,
    "end": 3005.68,
    "text": "We're talking about entropy as utility, but that's not utility for specific individuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3006.201,
    "end": 3008.644,
    "text": "And so it's a very interesting question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3008.624,
    "end": 3036.319,
    "text": " is there is is the notion of utility um as we're using it which is essentially this aggregate property of the whole system does that in any way guarantee or tend towards an increase in actual utility or well-being or happiness of individual people and i think that's by no means under there's not it's not in general going to be true there might be some conditions under which it is um but so that's you know that's a crucial question for welfare economics of course um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3036.299,
    "end": 3040.852,
    "text": " Another thing that's worth highlighting is this question of self-organisation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3041.594,
    "end": 3051.321,
    "text": "We don't have a deep theory developed on this at all, but one of the things we're really rather interested in is under what conditions do certain kinds of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3051.301,
    "end": 3054.245,
    "text": " organizations spontaneously arise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3054.265,
    "end": 3056.649,
    "text": "So why is it that we have firms?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3056.669,
    "end": 3059.874,
    "text": "Why do we have people suddenly constructing laws, creating states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3060.074,
    "end": 3063.539,
    "text": "I mean, obviously all these questions arise in the same way they do in biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3063.899,
    "end": 3069.748,
    "text": "And it would be very appealing if it turns out that whatever insights we have in a biological case,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3069.728,
    "end": 3073.873,
    "text": " there's a sort of parallel between those and the economic case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3073.913,
    "end": 3091.813,
    "text": "So it would be attractive if one could say, if one thinks that there's some maximum entropy production story or possibly minimum entropy production story or whatever story you like that applies in a sort of physics, the interface between physics and biology, maybe that's also applicable in the economic context too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.833,
    "end": 3094.255,
    "text": "And that would certainly be something interesting to think about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3094.696,
    "end": 3096.698,
    "text": "And just to find a small thing is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3096.678,
    "end": 3103.868,
    "text": " The invisible hand is very much at the front of our minds here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.269,
    "end": 3112.621,
    "text": "This kind of story is telling you where the invisible hand is going to guide you to maximum entropy given the constraints you've got.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3113.663,
    "end": 3119.952,
    "text": "That's not necessarily going to be for the benefit of all human welfare, but at the aggregate level, that's what the system is going to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3119.972,
    "end": 3124.238,
    "text": "That's where Adam Smith's invisible hand is guiding us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3124.842,
    "end": 3134.213,
    "text": " So one addition to the answer is the important thing, I think, is production and consumption.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3134.773,
    "end": 3137.116,
    "text": "That's what's driving the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3138.958,
    "end": 3143.343,
    "text": "And this is where the intricate structure can come from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3144.684,
    "end": 3150.11,
    "text": "It's just like in physics, if you don't drive the system, it'll settle down to some pretty homogeneous uniform state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3150.911,
    "end": 3154.275,
    "text": "But if you're driving it, then you can get convection rolls and all sorts of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3155.521,
    "end": 3156.923,
    "text": " And that's what we haven't yet done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3157.143,
    "end": 3167.516,
    "text": "But to my mind, that's where really economics is going to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3167.536,
    "end": 3168.037,
    "text": "For sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3168.757,
    "end": 3185.258,
    "text": "And the reason I'm asking this about the utility function is that the consumption part is a little bit confusing for me because I can think about different scenarios, like you can just put",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.677,
    "end": 3191.675,
    "text": " put like an oil well on fire, you know, just consume all the energy, you know, just waste it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.361,
    "end": 3196.51,
    "text": "And that wouldn't be an economic thing to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.232,
    "end": 3199.72,
    "text": "It's not a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.902,
    "end": 3211.06,
    "text": " So it's not obvious that this utility needs to satisfy some end goal that I don't fully understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.881,
    "end": 3219.193,
    "text": "I know we're nearly out of time, but a very quick thing on that, at least in our world of exchange economies, which, as Robert says, don't yet have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.173,
    "end": 3222.28,
    "text": " the driving forces of reduction in consumption.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3222.621,
    "end": 3229.276,
    "text": "But in our exchange economies, the agents do have a tendency to essentially try and increase their own utility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3229.778,
    "end": 3237.756,
    "text": "So each agent is making exchanges on the whole, if they think they're going to benefit from them with a bit of noise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3237.736,
    "end": 3241.062,
    "text": " And so that would be applicable, I think, in other cases, too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3241.122,
    "end": 3251.162,
    "text": "So if there was one use of the oil, which is to drive people around, and they want to be driven around, and the other was just to burn it pointlessly, then the price mechanism would kick in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3251.482,
    "end": 3258.215,
    "text": "There should be a, you know, the people who want to use the oil to drive around will pay a higher price than the people who just want to watch the flames burn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3258.275,
    "end": 3260.74,
    "text": "And that will be, you know, that will work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3260.72,
    "end": 3265.409,
    "text": " mean that we don't have a totally undirected chaotic end of use of resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3265.89,
    "end": 3282.002,
    "text": "So it really ought to be the case that once you have a proper theory of production and consumption, which we don't think we're that far away from, I don't think, but we don't have that written down, then the whole point is that that should create the kind of complex price mechanism that people like Milton Friedman and Hayek and so on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3281.982,
    "end": 3287.929,
    "text": " just conventional economics really talks about, which should lead resources to be distributed and used in the most effective way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3288.79,
    "end": 3293.917,
    "text": "But most effective is, in this story, from the point of view of maximising the entropy of the entire system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3293.997,
    "end": 3301.446,
    "text": "That does, again, not necessarily solve the question of whether the utility of individuals in that world are actually being maximised in Africa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3301.546,
    "end": 3303.348,
    "text": "It doesn't solve the utilitarian problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3304.389,
    "end": 3308.514,
    "text": "Yeah, well, you know, our theory doesn't require agents to have a utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3308.835,
    "end": 3310.757,
    "text": "It's only these examples we made.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3311.395,
    "end": 3315.36,
    "text": " where there's something we're calling utility, just make a connection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3318.043,
    "end": 3322.589,
    "text": "Thank you, Nick and Robert, for the presentation and for the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.989,
    "end": 3326.914,
    "text": "I hope it spurs many people's creativity and curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.015,
    "end": 3330.639,
    "text": "And Daveed, thank you for coordinating and for catalyzing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.12,
    "end": 3332.782,
    "text": "And we'll stay posted on the research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.042,
    "end": 3334.163,
    "text": "Good luck with the next steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.325,
    "end": 3337.107,
    "text": "Thank you so much for having us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3337.127,
    "end": 3337.808,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.172,
    "end": 3339.657,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.677,
    "end": 3339.96,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.335,
    "end": 3341.638,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_00"
  }
]