[
  {
    "start": 7.093,
    "end": 8.113,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.774,
    "end": 11.574,
    "text": "It's March 29th, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.295,
    "end": 17.396,
    "text": "We're here in Active Guest Stream number 40.1 with Vanya Visa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.996,
    "end": 23.098,
    "text": "We're going to be hearing a presentation in the first section and then having a discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.698,
    "end": 26.239,
    "text": "So thank you, Vanya, for joining again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 26.459,
    "end": 28.499,
    "text": "Really looking forward to your presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.1,
    "end": 31.84,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.681,
    "end": 33.961,
    "text": "So this presentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.913,
    "end": 63.352,
    "text": " is based on a preprint that can be found at phil archive and this is a work in progress and i probably or hopefully upload a revised version of this preprint in a few weeks so if you're watching this or if you're reading the preprint and have any comments or questions feedback is very much welcome and i'm also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.324,
    "end": 77.214,
    "text": " Again, grateful for having the opportunity to present here because I'm really looking forward to the discussion and any comments that people may have while watching this video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.754,
    "end": 80.916,
    "text": "So do contact me if you have questions or comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.879,
    "end": 88.242,
    "text": "Now, I want to start this presentation with an idea from this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.903,
    "end": 94.287,
    "text": " wonderful novella by Ted Chiang, The Life Cycle of Software Objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.608,
    "end": 98.571,
    "text": "And if you're not familiar with the novella, it doesn't matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.091,
    "end": 111.821,
    "text": "So there are some digital entities or digians, as they're called in the novella, who at first live in a purely virtual environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.841,
    "end": 116.685,
    "text": "So these are virtual entities like virtual pets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.746,
    "end": 117.866,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.536,
    "end": 123.158,
    "text": " human users can interact with them in a virtual environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.159,
    "end": 145.469,
    "text": "Then in some passages of the novella, there are scenes in which some digians are, as it were, downloaded from this purely virtual environment and are implemented in a physically embodied robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.07,
    "end": 146.43,
    "text": "So the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.406,
    "end": 176.091,
    "text": " program that is running within this computer simulation and is controlling the purely virtual body is then downloaded into a physically embodied computer and is controlling a physical robot which can interact with its physical environment, non-virtual environment, in the same way in which the virtual agent, the virtual digient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.153,
    "end": 206.125,
    "text": " interacts with the virtual environment and i find this idea really fascinating and powerful so the novella suggests that these virtual entities are conscious and that they can switch back and forth as it were between this purely virtual environment and the physical non-virtual environment and the idea is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.454,
    "end": 215.157,
    "text": " these entities remain conscious when they're in the robot, but also when they return to the virtual environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.757,
    "end": 234.505,
    "text": "And to some people, it may be unintuitive or counterintuitive that a purely virtual entity in a simulated environment can be conscious, but maybe some of these people will find it less counterintuitive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.629,
    "end": 238.571,
    "text": " to imagine a conscious robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.452,
    "end": 262.047,
    "text": "And so the idea is fascinating to me because it suggests that if you can switch back and forth from the virtual environment to the physical environment and the other direction, it really doesn't matter where the software is implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.127,
    "end": 263.648,
    "text": "The system remains conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.477,
    "end": 277.579,
    "text": " And I will come back to this idea at the end of my presentation, and we will see what the account that I'm presenting here suggests with respect to this scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.9,
    "end": 286.121,
    "text": "So this is the overview of my presentation, which is based on the preprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.781,
    "end": 288.661,
    "text": "I'm just omitting a lot of details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.761,
    "end": 293.762,
    "text": "So I'll start by saying just a few things about the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.574,
    "end": 303.936,
    "text": " Then I will ask, what is the difference between an unconscious simulation of a conscious system and a conscious computational system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.956,
    "end": 310.578,
    "text": "Or in other words, what's the difference between what is called weak and strong artificial consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.358,
    "end": 323.261,
    "text": "So strong artificial consciousness is an actually conscious artificial system and weak artificial consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.036,
    "end": 350.519,
    "text": " is constituted by a an artificial system that maybe behaves as if it were conscious or that simulates a conscious being but is not actually conscious and i'm interested in the question what's the difference and a particular version of this question is whether a computer simulation in a computer with a von neumann architecture can be conscious",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.665,
    "end": 361.487,
    "text": " So I start with the free energy principle and I don't want to go into the details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.567,
    "end": 368.129,
    "text": "So we start with a description of a physical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.189,
    "end": 378.192,
    "text": "So the X is the physical system and the fundamental assumption is the dynamics, the physical dynamics of this system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.999,
    "end": 383.101,
    "text": " can be decomposed into two components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.161,
    "end": 392.465,
    "text": "So we on one hand have a deterministic flow term F and then some noise term, stochastic noise term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.505,
    "end": 401.249,
    "text": "So we end up with a stochastic differential equation which describes how the physical system evolves over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.269,
    "end": 407.792,
    "text": "A further assumption is that we can decompose the states of the system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.712,
    "end": 437.408,
    "text": " into internal states mu, external states eta, sensory states S, and active states A, which together, so sensory and active states together, constitute the blanket states B. And this then is a particular system that can be partitioned into internal and external states separated by blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.86,
    "end": 455.97,
    "text": " And a further assumption is that the dynamics of the system can also be partitioned in the following sense that we can decompose this flow term into individual flow terms for the different states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.53,
    "end": 468.497,
    "text": "So we have a flow term for internal states, mu, and can also describe the dynamics of internal states in terms of such a differential equation here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.864,
    "end": 487.579,
    "text": " Okay, so these are just technical fundamental assumptions made by the free energy principle, but then an interesting thing starts here when we look at how else we can describe internal states and the dynamics of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.619,
    "end": 497.607,
    "text": "So the idea is that we can map internal states mu to probability distributions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.456,
    "end": 502.759,
    "text": " So this is your formulation in terms of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 503.6,
    "end": 511.906,
    "text": "And then the idea is that at every point in time, the system will be in certain states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.946,
    "end": 515.028,
    "text": "So there will be internal states relative to each time point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.068,
    "end": 526.657,
    "text": "And we can map each of these states to some probability distribution Q of external states given blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.084,
    "end": 533.987,
    "text": " Okay, so we can do that, but then the question is, why should we do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.107,
    "end": 544.711,
    "text": "And the idea is that maybe we can re-describe the flow term, which is essential for characterizing the dynamics of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.691,
    "end": 554.075,
    "text": "Can we re-describe this flow terms in terms of the probability distribution encoded by internal states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.441,
    "end": 575.572,
    "text": " And the free energy principle answers, yes, we can rewrite this term in terms of a variational free energy functional, which specifies how the probability distribution Q, which is parametrized by mu, and then also how mu changes over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.632,
    "end": 583.476,
    "text": "So we can reformulate the physical dynamics of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.536,
    "end": 584.857,
    "text": "We can rewrite the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.532,
    "end": 599.183,
    "text": " flow term in terms of variational free energy, or in terms of minimizing variational free energy with respect to a probability distribution encoded by internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.924,
    "end": 609.111,
    "text": "And this is then called Bayesian mechanics, and it's called Bayesian mechanics because minimizing variation of the energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.855,
    "end": 631.358,
    "text": " involves minimizing a divergence term between the internally encoded probability distribution q and a posterior over external states given blanket states okay um so to to sum this up i will uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.003,
    "end": 633.844,
    "text": " give these ideas some labels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.044,
    "end": 646.293,
    "text": "So I've already talked about the physical dynamics and these are the dynamics of a particular system described by a stochastic differential equation involving a flow term and a noise term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.274,
    "end": 654.879,
    "text": "And we call that a particular system is a system that can be partitioned into internal, external and blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.4,
    "end": 660.223,
    "text": "And then according to the free energy principle,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.07,
    "end": 666.133,
    "text": " we can re-describe these physical dynamics in terms of as computational dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.334,
    "end": 683.424,
    "text": "We can reformulate them in terms of a description of the system's internal states mu as performing approximative Bayesian inference by minimizing variation free energy with respect to probability density encoded by mu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.285,
    "end": 688.848,
    "text": "So in short, we can reformulate the physical dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.557,
    "end": 693.938,
    "text": " as a computational process that involves a form of Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.819,
    "end": 711.243,
    "text": "Now, a further assumption that I want to make here is that we can capture the computational correlates of consciousness in terms of the computational dynamics as described by the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.384,
    "end": 717.325,
    "text": "So here the computational correlates of consciousness or CCCs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.047,
    "end": 727.651,
    "text": " are defined as the computational dynamics of a physical system, of a conscious physical system, as specified by the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.811,
    "end": 730.932,
    "text": "So this is not just any physical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.952,
    "end": 733.253,
    "text": "It's a conscious physical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.273,
    "end": 735.674,
    "text": "I forgot to add this on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.675,
    "end": 736.955,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.975,
    "end": 746.819,
    "text": "So given these initial assumptions and definitions, can we say something about the difference between weak and strong artificial consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.774,
    "end": 749.035,
    "text": " And I think we can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.857,
    "end": 756.822,
    "text": "So let's start with the idea of a computational correlate of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.564,
    "end": 761.046,
    "text": "Computations are medium independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.766,
    "end": 768.112,
    "text": "So it's plausible that a digital computer can implement computational correlates of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.293,
    "end": 774.638,
    "text": "But then the question, if we want to distinguish weak from strong artificial consciousness is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.768,
    "end": 786.174,
    "text": " Is every system that implements CCCs conscious or do systems have to implement these computations in the right way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.374,
    "end": 787.314,
    "text": "And what would that be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.334,
    "end": 800.842,
    "text": "So to better understand this question, I find it useful to look at this diagram and see where we started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.862,
    "end": 801.362,
    "text": "So we have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.992,
    "end": 828.325,
    "text": " description of a conscious system's physical dynamics in the bottom left and then according to the free energy principle we can reformulate this, re-describe this as some computational dynamics and by assumption these include the computational correlates of consciousness and they must be implemented by the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.608,
    "end": 831.97,
    "text": " physical dynamics of the conscious system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.931,
    "end": 842.281,
    "text": "Now, given that these are medium independent properties, they can also be instantiated by other systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.202,
    "end": 850.389,
    "text": "And here I'm assuming that these computations can also be implemented by a digital computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 852.333,
    "end": 856.475,
    "text": " And the digital computer as a physical system has some physical dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.855,
    "end": 864.139,
    "text": "And if we can apply the free energy principle to it, we can reformulate these physical dynamics as computational dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.06,
    "end": 876.005,
    "text": "And so then the question becomes, do these computational dynamics, do they include the computational correlates of consciousness, whatever they are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.806,
    "end": 880.608,
    "text": "So this is a crucial question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.454,
    "end": 888.858,
    "text": " that we have to answer if we want to know what the difference between weak and strong artificial consciousness is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.379,
    "end": 890.759,
    "text": "And maybe there is no difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.081,
    "end": 908.81,
    "text": "So before I present an argument to the effect that, in general, the computational dynamics of a digital computer will not entail the computational correlates of consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.506,
    "end": 916.627,
    "text": " Before I present this argument, I will present some observations on the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.288,
    "end": 928.51,
    "text": "So note that systems that conform to the free energy principle sustain their existence by minimizing variation of free energy, but the reverse does not hold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.05,
    "end": 939.353,
    "text": "So you can run simulations of agents that minimize variation of free energy, and you can do that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.401,
    "end": 945.744,
    "text": " on a computer which does not thereby sustain its existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.764,
    "end": 951.547,
    "text": "So it would continue to exist regardless of whether it runs these simulations or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.567,
    "end": 960.873,
    "text": "OK, just to illustrate this with a quotation which may be familiar to many.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.934,
    "end": 963.995,
    "text": "So this is by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.636,
    "end": 972.237,
    "text": " Prismat out, many theories in the biological sciences are answers to the question, what must things do in order to exist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.978,
    "end": 979.019,
    "text": "The free energy principle turns this question on its head and asks, if things exist, what must they do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.859,
    "end": 989.061,
    "text": "More formally, if we can define what it means to be something, can we identify the physics or dynamics that a thing must possess?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.341,
    "end": 991.601,
    "text": "And Jakob Howie",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.742,
    "end": 994.703,
    "text": " puts a similar point as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.343,
    "end": 1001.985,
    "text": "The free energy principle analyzes the concept of existence of particular self-organizing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.385,
    "end": 1012.729,
    "text": "So the idea is that continuing to exist, sustaining one's existence means minimizing variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.929,
    "end": 1022.052,
    "text": "And so any processes that contribute to minimizing variational free energy thereby contribute to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.571,
    "end": 1025.653,
    "text": " the sustained existence of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.355,
    "end": 1038.021,
    "text": "But such processes can also be implemented in other ways by different systems which do not thereby sustain their existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.601,
    "end": 1049.689,
    "text": "And this, I want to suggest, is the crucial difference between systems that merely simulate conscious systems and systems that actually are conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.136,
    "end": 1060.938,
    "text": " I will hopefully clarify this idea in a moment by presenting an argument, but before that I need a definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.358,
    "end": 1069.099,
    "text": "I want to introduce a notion of intrinsic computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.419,
    "end": 1075.2,
    "text": "These are just computations that contribute to the sustained existence of the systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.26,
    "end": 1079.621,
    "text": "These are the computations that figure in the computational reformulation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.703,
    "end": 1084.626,
    "text": " of the system's physical dynamics, according to the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.607,
    "end": 1090.591,
    "text": "And intrinsic here means that these computations are observer independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.611,
    "end": 1104.461,
    "text": "So it's not the case that we as observers say, okay, we can interpret the system as performing these computations, or it's useful for us to use them as computational devices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.922,
    "end": 1110.506,
    "text": "The idea is that these computations are processes that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.994,
    "end": 1132.305,
    "text": " are intrinsic to the system that only depend on properties of the system itself and not on relations that the system has to observers or to other beings okay um so here's the argument which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.041,
    "end": 1145.989,
    "text": " in a way is already contained in the preprint, but I did not formulate the argument in this explicit way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.709,
    "end": 1155.215,
    "text": "So I'm grateful to Tome Korbach, who provided some comments on my preprint and who also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.392,
    "end": 1163.076,
    "text": " suggested a reconstruction of the argument that I'm presenting in the preprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.737,
    "end": 1170.16,
    "text": "And this formulation here is based on Tomek's suggestions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.041,
    "end": 1178.065,
    "text": "And I hope this clarifies the argument that I'm putting forward, developing in the preprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.086,
    "end": 1182.548,
    "text": "Okay, so the first assumption in the argument is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.218,
    "end": 1187.04,
    "text": " a version of computationalism about consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.72,
    "end": 1196.046,
    "text": "So the idea is that causal roles that characterize phenomenal consciousness are medium independent and can be captured in terms of computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.847,
    "end": 1199.509,
    "text": "These are computational correlates of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.649,
    "end": 1208.315,
    "text": "So the idea is that consciousness does not require a particular type of substrate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.076,
    "end": 1236.527,
    "text": " it can be in principle can be realized by different types of system as long as these systems implement the right computations so this assumption as i intend it does not entail that implementing the right computations is sufficient for being conscious it's here just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.321,
    "end": 1239.043,
    "text": " meant as a necessary condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.544,
    "end": 1246.269,
    "text": "And the idea is that there are informative, interesting computational correlates of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.39,
    "end": 1252.735,
    "text": "And they can, in principle, be performed, implemented by different types of system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.817,
    "end": 1262.584,
    "text": "Then comes the second assumption, according to which every conscious system and its computational correlates can be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.346,
    "end": 1269.348,
    "text": " described by a mechanical theory that conforms to the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.988,
    "end": 1273.929,
    "text": "So this is an assumption about the scope of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.01,
    "end": 1287.293,
    "text": "And it's at least clear that the free energy principle is intended to have a very wide scope that's not meant just to apply to the human brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.313,
    "end": 1292.595,
    "text": "It's not just meant to apply to living systems, but it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.74,
    "end": 1299.701,
    "text": " meant to apply to a very wide class of self-organizing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.242,
    "end": 1322.647,
    "text": "And this idea or this intention that the free energy principle has a very wide scope is also evidenced by the fact that recent formulations and recent developments in research on the free energy principle seek to relax certain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.419,
    "end": 1347.288,
    "text": " assumptions that were made in previous version so as to make the free energy principle applicable to a very wide class of systems and not for instance just two systems in a non-equilibrium steady state for instance just as as one example all right um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.409,
    "end": 1365.865,
    "text": " So the idea is that we can apply the free energy principle to conscious systems, and that means we can move from a description of physical dynamics to a description of computational dynamics, and these will include computational correlates of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.726,
    "end": 1372.371,
    "text": "The third assumption makes a connection between intrinsic computation and consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.911,
    "end": 1374.353,
    "text": "A system is conscious only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.077,
    "end": 1380.8,
    "text": " if it sustains its existence by virtue of the computational correlates it realizes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.801,
    "end": 1391.446,
    "text": "Such computational correlates of consciousness are intrinsic computations, computations that contribute to the sustained existence of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.307,
    "end": 1401.012,
    "text": "So if a system follows certain or implements certain physical dynamics, which under the FEP",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.907,
    "end": 1410.733,
    "text": " can be described as computational dynamics that entail computational correlates of consciousness, whatever they are, then the system is conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.015,
    "end": 1416.058,
    "text": "But it's only conscious if it's in this direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.598,
    "end": 1423.924,
    "text": "So in principle, it's possible to implement the same computational processes without being conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.885,
    "end": 1430.289,
    "text": "And this becomes clear in a conclusion or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.945,
    "end": 1434.046,
    "text": " described by conclusion one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.766,
    "end": 1450.792,
    "text": "It's possible to instantiate computational correlates of consciousness in a physical system without instantiating consciousness, namely if realizing the computational correlates of consciousness does not contribute to the sustained existence of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.392,
    "end": 1459.535,
    "text": "So assuming that a digital computer can perform the computations that characterize consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.683,
    "end": 1475.793,
    "text": " in conscious systems, it's likely, according to this proposal, it's likely that the computer will not thereby be conscious because it could implement different computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.913,
    "end": 1479.075,
    "text": "It really doesn't matter what computations it performs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.695,
    "end": 1487.82,
    "text": "It will continue to exist as a physical system, regardless of the computational processes that it implements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.141,
    "end": 1490.022,
    "text": "So it does not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.522,
    "end": 1495.726,
    "text": " sustain its existence by virtue of the computations it performs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.009,
    "end": 1499.389,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.87,
    "end": 1516.284,
    "text": "And a condition that is entailed by this is that from the point of view of the free energy principle, computation of the physical system is intrinsic if it matches the physical, the system's physical dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.508,
    "end": 1530.096,
    "text": " And this will be important also for the question about consciousness in computer simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.976,
    "end": 1544.686,
    "text": "So the second conclusion that I want to draw here is that computers with a von Neumann architecture cannot implement intrinsic computations because their physical dynamics induces a causal flow that is different from the causal flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.373,
    "end": 1567.428,
    "text": " entailed by the computational dynamics so there's no match between the physical and the computational dynamics or between the physical dynamics and the computations that are performed within the computer simulation i will unpack this in the third part of my presentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.2,
    "end": 1576.462,
    "text": " So could there be consciousness in a computer simulation and a computer with a classical architecture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.482,
    "end": 1583.744,
    "text": "So this is an idea that I already presented in previous works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.424,
    "end": 1596.407,
    "text": "So in a system that conforms to the free energy principle, there's a basic flow from internal states via active states to external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.062,
    "end": 1601.123,
    "text": " and from external states via sensory states to internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.123,
    "end": 1604.224,
    "text": "So we have these circular dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.084,
    "end": 1612.326,
    "text": "And in a computer with a von Neumann architecture, the basic causal flow is a bit different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.346,
    "end": 1624.049,
    "text": "So we have memory and we have a central processing unit and units that store the values of the different variables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.798,
    "end": 1630.319,
    "text": " of internal that stand for internal, external, and blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.179,
    "end": 1641.881,
    "text": "They are in the memory unit, and there's no direct causal interaction between these units, but it's always mediated by the CPU.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.241,
    "end": 1654.143,
    "text": "So that's the basic idea, and therefore, there's a difference in a causal flow, and this means that the physical dynamics of the computer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1656.465,
    "end": 1682.931,
    "text": " does not have a, or the, if we want to reformulate the physical dynamics of the computer in terms of minimizing variation of free energy, we end up with something that cannot match the, that we end up with computational processes that cannot be identical to the computations that are simulated by the computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.31,
    "end": 1700.815,
    "text": " because then there would have to be a match between the states that represent the probability distributions encoded by internal states and the internal states themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.876,
    "end": 1709.318,
    "text": "Okay, so from this, I suggest we can derive two necessary conditions for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.918,
    "end": 1713.679,
    "text": "One is the flow condition, the causal flow of a physical system's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.352,
    "end": 1727.619,
    "text": " computational dynamics, which realize which may realize computational correlates of consciousness must match the causal flow of the system's physical dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.92,
    "end": 1733.642,
    "text": "And then there's a second condition, which I call the existential condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.003,
    "end": 1740.346,
    "text": "A physical system sustains its existence by virtue of the by virtue of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.758,
    "end": 1745.482,
    "text": " realizing computational correlates of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.083,
    "end": 1750.046,
    "text": "So if it's a conscious physical system, then this is the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.127,
    "end": 1751.447,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.488,
    "end": 1755.051,
    "text": "Just a few observations or notes about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.071,
    "end": 1760.976,
    "text": "So a system can satisfy the first, the flow condition, without thereby satisfying the existential condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.996,
    "end": 1765.721,
    "text": "So the existential condition is stronger than the flow condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.133,
    "end": 1773.137,
    "text": " But if a system satisfies the existential conditions, then it also satisfies the flow conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.759,
    "end": 1780.222,
    "text": "And not all systems that satisfy both of these conditions are conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.642,
    "end": 1785.686,
    "text": "In other words, neither of them are sufficient for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.966,
    "end": 1790.269,
    "text": "These are really just strictly necessary conditions for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.27,
    "end": 1795.272,
    "text": "All right, let me return to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.663,
    "end": 1801.705,
    "text": " the idea that I presented in the beginning from Ted Chiang's novella.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.885,
    "end": 1820.351,
    "text": "So from the point of view of the account that I presented here, is it possible to download a virtual entity to a robot and will it be conscious or can it be conscious in the simulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.752,
    "end": 1824.953,
    "text": "So I should just assume here that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.871,
    "end": 1849.729,
    "text": " These systems satisfy the flow condition, the first condition, so assuming that this is a very special computer simulation in which the physical states that represent internal, external, and blanket states, that these physical states also directly, causally interact with each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.123,
    "end": 1876.637,
    "text": " and according to the account proposed here the computer simulation that there would still not be consciousness in the computer simulation because the computer does not sustain its existence by virtue of performing these computations it could also run different simulations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.714,
    "end": 1882.859,
    "text": " which do not involve these digital entities, and it would continue to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.959,
    "end": 1889.846,
    "text": "So according to this, the account presented here, there would not be consciousness in this system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.169,
    "end": 1901.757,
    "text": "And if we download the part of the program that controls the virtual agent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.535,
    "end": 1907.578,
    "text": " and download it to a physically embodied robot, could that robot be conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.638,
    "end": 1920.106,
    "text": "Well, in principle, it could if the robot sustains its existence by virtue of performing the computations that are also performed by the computer simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.968,
    "end": 1930.013,
    "text": "And now this result might be a bit strange because contrary to what the novella suggests,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.215,
    "end": 1942.241,
    "text": " it would suggest that the system cannot switch back and forth between the virtual and the physical non-virtual environment without losing consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.882,
    "end": 1956.309,
    "text": "And I admit that this is a very, that is a kind of counterintuitive implication, but maybe it only seems counterintuitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.509,
    "end": 1958.21,
    "text": "Maybe it's not technically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.085,
    "end": 1982.464,
    "text": " possible to download a virtual entity which was trained in a purely virtual environment and download it to implement it in a physical robot and thereby allowing the physical robot to interact with its environment in the same way as a virtual entity can interact with a virtual environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.165,
    "end": 1983.846,
    "text": "So I know that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.964,
    "end": 2008.397,
    "text": " In robotics, there's a certain strategy to train robots or to develop the controller of the physical robot, meaning that you first train it in a virtual and a simulated environment, and then you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.217,
    "end": 2036.494,
    "text": " use that to control the robot maybe this only works for robots that have kind of have certain limitations in their sensory motor abilities maybe it doesn't work for highly sophisticated robots that are more like conscious organisms which can react adaptively and very flexible in a flexible way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.894,
    "end": 2048.157,
    "text": " and interact flexibly with the environment on the basis maybe of effectively guided, effectively shaped representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.917,
    "end": 2068.164,
    "text": "So this would be maybe an empirical hypothesis derived from my account that this strategy, this sim to real strategy of simulating an entity in a virtual environment and then applying that to a physical entity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.066,
    "end": 2076.293,
    "text": " the prediction would be that this has at some point reached limits and will not be successful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.853,
    "end": 2090.446,
    "text": "If on the other hand, this hypothesis or this prediction will turn out to be false, I think we should reconsider the account that I'm presenting here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.247,
    "end": 2093.248,
    "text": "OK, let me conclude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.901,
    "end": 2099.602,
    "text": " I've asked, what is the difference between weak and strong artificial consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.922,
    "end": 2104.783,
    "text": "And the suggestion is that it's about intrinsic computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.843,
    "end": 2105.643,
    "text": "That's the difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2107.123,
    "end": 2113.425,
    "text": "Actually, conscious systems sustain their existence, at least in part by virtue of performing certain computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.305,
    "end": 2120.526,
    "text": "And a mere simulation of a conscious system does not thereby sustain its existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.886,
    "end": 2124.667,
    "text": "It could also perform different computations and still continue to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.812,
    "end": 2131.836,
    "text": " This condition entails the flow condition, which is important for the second question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.936,
    "end": 2135.499,
    "text": "Could a computer simulation in a computer with a von Neumann architect should be conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.559,
    "end": 2138.821,
    "text": "No, because it violates the flow condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.682,
    "end": 2150.229,
    "text": "Okay, here's an ad for the Journal of Philosophy and the Mind Sciences, which I'm running together with Sasha Fing, Jennifer Wind, and Regina Fabri.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.29,
    "end": 2152.911,
    "text": "And I thank you for your attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.086,
    "end": 2194.649,
    "text": " awesome thank you i'm just getting my video back in the game um while i'm getting everything back on the uh stream first just thank you for the presentation and uh wanted to pick up with that robotics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.003,
    "end": 2198.525,
    "text": " intro and conclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.186,
    "end": 2219.825,
    "text": "To what extent does the embodiment in the robot matter beyond the ability of the virtual simulation to do things like eject the CD drive or ultimately do physical things, just not the kinds of physical things that we see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.328,
    "end": 2223.489,
    "text": " human children do, like play with toys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.67,
    "end": 2233.515,
    "text": "When you were thinking about the virtualized simulation, were you thinking about one that had no access to sensors and actuators?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.436,
    "end": 2246.143,
    "text": "Or what happens when the digital simulation also has access in some limited way to the ability to sense and act on the outside world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.292,
    "end": 2275.657,
    "text": " you have any thoughts um sorry about that on the stream it was audible but not to you so i think but now i've resolved the zoom so we can from your consciousness perspective consider it a new question so i just wanted to to pick up with that robotics example um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.743,
    "end": 2290.511,
    "text": " A digital simulation may still have sensors engaging with the world and may still be able to undertake actuation if only something like flipping a switch on a processor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.172,
    "end": 2306.803,
    "text": "So what exactly about the embodiment do you think matters for it to have that kind of adaptivity and maybe even open-endedness and learning that you pointed to as an important property?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.161,
    "end": 2311.424,
    "text": " Yeah, good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.465,
    "end": 2319.293,
    "text": "So I think there are many different aspects that you're touching upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.773,
    "end": 2321.535,
    "text": "Let me start with this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.006,
    "end": 2352.954,
    "text": " mentioned my correspondence with Tomei Korbeck and one thing that he suggested was that couldn't we regard a language model as a system that has certain sensory motor abilities so it can interact with a physical environment via a linguistic interface so it receives text as input and it outputs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.663,
    "end": 2373.742,
    "text": " text as yeah it outputs text and um can't we regard this as sense as um sensing and acting and um so this this i i think is um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.043,
    "end": 2379.085,
    "text": " similar to one of the aspects that your question touches upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.885,
    "end": 2382.847,
    "text": "So what is it about the embodiment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.127,
    "end": 2391.691,
    "text": "And can there be different forms of embodiment that might still lead to consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.531,
    "end": 2399.294,
    "text": "And I don't have a full reply to this, just two things that I would mention here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.354,
    "end": 2400.275,
    "text": "The first is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.947,
    "end": 2417.67,
    "text": " There are certainly some analogies between what a language model does when it interacts with a user and a system that maybe an organism that interacts with its environment via perception and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.111,
    "end": 2421.011,
    "text": "But there are also some disanalogies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.891,
    "end": 2425.872,
    "text": "So when it comes to interacting with the environment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.864,
    "end": 2434.248,
    "text": " when an organism interacts with its environment, there are temporal constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.429,
    "end": 2445.317,
    "text": "It's really important that it does the right thing at the right time and reacts fast enough and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.917,
    "end": 2449.14,
    "text": "And for a language model, that does not play a big role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.16,
    "end": 2452.923,
    "text": "So there's one difference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.218,
    "end": 2457.799,
    "text": " And then there's also a difference in the format of the representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.699,
    "end": 2462.3,
    "text": "And in principle, you could say, okay, why does this matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.2,
    "end": 2477.963,
    "text": "And maybe in the end it doesn't, but I just want to mention that there's some crucial disanalogies that I think would be important to take into consideration and evaluate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.064,
    "end": 2480.824,
    "text": "Then there's the question, okay,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.498,
    "end": 2492.744,
    "text": " Is there something about these more low-level sensory motor skills that is crucial when it comes to consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.924,
    "end": 2509.573,
    "text": "Now, on the one hand, we know that an organism can be conscious without having any language skills, without being able to speak or understand language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.977,
    "end": 2531.122,
    "text": " This is why when it comes to functions of consciousness, for instance, people don't look for, or usually don't look for linguistic abilities, but more for sensory motor abilities or forms of learning that enable or improve interaction with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.563,
    "end": 2537.064,
    "text": "And so this is one thing, but of course, in principle,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.248,
    "end": 2545.697,
    "text": " It could still be that a system that lacks these low-level skills is conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.898,
    "end": 2557.271,
    "text": "But then I would say, if it's possible to be conscious without having these sensory motor skills, then it's not really about any ability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.376,
    "end": 2563.24,
    "text": " for interaction with an environment that a system is conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.32,
    "end": 2568.924,
    "text": "But then it's merely because of some internal computations that the system performs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.545,
    "end": 2583.496,
    "text": "So if you're thinking about systems that might be islands of awareness, systems that don't receive any sensory input and don't produce any motor output, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.023,
    "end": 2597.211,
    "text": " I wouldn't want to rule out that such systems are conscious and such systems don't have any ways of interacting with their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.772,
    "end": 2609.34,
    "text": "So I'm happy to accept that interaction with the environment is not required for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.2,
    "end": 2614.183,
    "text": "But coming back to language models, this would mean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.867,
    "end": 2635.573,
    "text": " that being able to interact with users using language is similarly not required for consciousness so i would say if such a system is conscious then it's not because of its ability to interact with the environment because of but because of the internal processes and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.237,
    "end": 2662.437,
    "text": " the what may be crucial is not the actual interaction with the environment but just the potential for interaction with the physical environment and then it might and in principle it might might very well be that a language model can facilitate interaction with the physical environment for instance if it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.416,
    "end": 2666.798,
    "text": " connected to a physically embodied robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.898,
    "end": 2672.362,
    "text": "And I mean, there's research going on on such things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.543,
    "end": 2690.515,
    "text": "Researchers who try to improve the abilities of their robots by connecting them or interfacing them with a language model, which can then help translate commands into motor sequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.123,
    "end": 2717.411,
    "text": " And so what this suggests is that, yeah, maybe there are some crucial types of representation or computational processes that are actually already implemented in language models or in other systems that don't really not directly interact with the physical environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2717.571,
    "end": 2719.652,
    "text": "And I'm happy to accept that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.714,
    "end": 2730.057,
    "text": " But I would add that according to the, at least according to the proposal that I've presented here, you need something more for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.297,
    "end": 2748.822,
    "text": "And you need really the, so it's not sufficient to just implement these computations, but they must have a meaning for the system itself in the sense that the system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.46,
    "end": 2768.435,
    "text": " will sustain its existence by virtue of these processes if it is connected to the real physical environment now um and maybe that i've not addressed every aspect of your question so feel free to um restate your question or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.286,
    "end": 2770.747,
    "text": " Oh, it's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.127,
    "end": 2777.51,
    "text": "It got to a great place because I wanted to follow up with this intrinsic computation concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.151,
    "end": 2792.657,
    "text": "So you mentioned that they're observer independent to the extent that anything or any process can be, and that these are the kinds of processes that actually enable the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2795.679,
    "end": 2799.513,
    "text": " persistence of that thing, according to the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.396,
    "end": 2800.737,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2802.847,
    "end": 2819.192,
    "text": " I was thinking about this first in a bottom up way, like this is the firmware, this is the Linux kernel, this is the kind of enabling software that is supporting potentially extraneous higher order functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.853,
    "end": 2829.336,
    "text": "And that is allowing some kind of separation or delineation between what we can say are like the vital and intrinsic, like almost the homeostatic functions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.476,
    "end": 2833.837,
    "text": " and then second order functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.657,
    "end": 2840.959,
    "text": "But then I thought about the ecology that the computation is deployed in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.519,
    "end": 2852.142,
    "text": "And so let's just say that the software simulation is being used in a scientific context or to run Photoshop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.462,
    "end": 2858.444,
    "text": "And another cognitive agent keeps that simulation alive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.571,
    "end": 2862.092,
    "text": " because it's performing some function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2863.113,
    "end": 2869.057,
    "text": "And so from that bottom-up sense, the Photoshop program is not the Linux kernel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.757,
    "end": 2878.842,
    "text": "So it's not like the Photoshop in principle is not sustaining the persistence of the entity in a bottom-up fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.503,
    "end": 2888.388,
    "text": "However, in deployment, it actually becomes a necessary condition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.835,
    "end": 2917.766,
    "text": " imposed externally so and that would also be extremely observer dependent or subjective so how do we think about um in standard modern computers or in wetware what are these intrinsic computations thank you that's um that's a great question and um so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2919.605,
    "end": 2941.907,
    "text": " can say more about intrinsic computation in a moment but just one comment before that so i think you're touching on a very important issue and that's the question by what is a system in the first place so if we want to consider the question what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.129,
    "end": 2953.058,
    "text": " kinds of entities can be conscious and we have to first say, okay, what are the entities that we're looking at in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.339,
    "end": 2955.6,
    "text": "What are these things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.8,
    "end": 2964.868,
    "text": "And why can't we look at a piece of software or some process that is running",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.289,
    "end": 2968.27,
    "text": " an app that a user is using?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.771,
    "end": 2975.054,
    "text": "What was the example that you gave, Photoshop or something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.094,
    "end": 2990.021,
    "text": "So why can't we regard Photoshop and a particular instance of this software as a system which exists for some time and it will continue to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.78,
    "end": 3002.362,
    "text": " exist if it's useful for a human being, and it's useful by virtue of the computations that are realized by it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.342,
    "end": 3012.184,
    "text": "And so can't we say that the system sustains its existence by virtue of the computations that it performs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.124,
    "end": 3016.085,
    "text": "And so that's, I think, a very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.193,
    "end": 3019.934,
    "text": " crucial question because it's so fundamental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.354,
    "end": 3021.735,
    "text": "What is a system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.156,
    "end": 3036.742,
    "text": "Currently, I think that the free energy principle is sufficient to answer this question, but it may be that it's still too general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.822,
    "end": 3044.786,
    "text": "The free energy principle gives us an answer to the question, if something exists, what must it do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.106,
    "end": 3045.186,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.013,
    "end": 3054.501,
    "text": " So it analyzes this notion of the continued existence of self-organizing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.521,
    "end": 3068.833,
    "text": "And maybe it does apply to the processes that implement Photoshop in the computer of a human being who uses this software.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.615,
    "end": 3070.755,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.494,
    "end": 3100.804,
    "text": " If that's the case, then I think we have to add some further constraints to, or it may be necessary to add some further constraints on the kinds of systems that we want to regard as potentially conscious or that we want to consider when it comes to the question, what kinds of systems can be conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.697,
    "end": 3123.772,
    "text": " And just one suggestion or idea that I think would be worthwhile to explore here is to investigate to what extent something like the integrated information theory may complement the free energy principle in this regard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.612,
    "end": 3130.977,
    "text": "Because integrated information theory has a very strong",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.798,
    "end": 3159.211,
    "text": " emphasis on the notion of existence of what it means to exist what it means to be what it means to intrinsically exist as it were and not just in the eye of a beholder and maybe we we need to add constraints from something like integrated information theory which would then tell us what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.236,
    "end": 3182.9,
    "text": " types of systems really exist and then maybe it would say okay the processes that are implementing photoshop in this computer don't really exist in an intrinsic sense um yeah so this would be that would then be my suggestion to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.815,
    "end": 3189.78,
    "text": " add some constraints, but of course you could say, well, no, such constraints are completely unnecessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.84,
    "end": 3207.915,
    "text": "We don't need to exclude certain systems and we can regard the processes that implement Photoshop as real, a real system that sustains its existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.955,
    "end": 3212.959,
    "text": "But my intuition would be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.491,
    "end": 3234.26,
    "text": " at least currently, that such processes would, at least in a classical system with a classical hardware, would be too scattered and there would be so many physical processes interfering, as it were, that it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.036,
    "end": 3264.609,
    "text": " it you can regard this as a separate thing which is distinct from other things that are happening in the computer but i would say this is more an observer dependent property that those processes that so entangled with other processes in the physical system that they are not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.696,
    "end": 3269.602,
    "text": " particular systems in the sense of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.484,
    "end": 3271.824,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.145,
    "end": 3277.892,
    "text": "And again, kind of journeys us to another question about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.134,
    "end": 3306.148,
    "text": " topological or geometric concordances between physical and computational dynamics and it made me think of a few different kinds of systems the von neumann architecture described with the cpu and the ram regular desktop computer situation of course we have unconventional computing paradigms quantum and analog computers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.088,
    "end": 3322.536,
    "text": " We have the brain and the SPM package in which statistical inferences help us model how brain regions that aren't connected through, for example, axons, can still have an edge in a Bayesian graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.576,
    "end": 3330.641,
    "text": "They could still have a causal, effective, or functional connectivity without being structurally connected and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3331.541,
    "end": 3340.663,
    "text": " And then to kind of bring it back to the computer and what you brought up about whether or not those processes would be too scattered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.943,
    "end": 3355.406,
    "text": "What about a computer, either a distributed computing cluster or a strict virtualization scheme on the computer such that certain variables were isolated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.987,
    "end": 3357.867,
    "text": "Would it be enough?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.936,
    "end": 3374.654,
    "text": " for the system to have some kind of constraint, again, through a physical networked layout or through a virtualized system so that the computational flow and the causal flow",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3376.243,
    "end": 3378.705,
    "text": " could be played with in a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.825,
    "end": 3380.046,
    "text": "And then how would we know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3380.146,
    "end": 3381.527,
    "text": "What would we be looking for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.188,
    "end": 3388.894,
    "text": "Surely not simply test, retest accuracy or efficiency in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.974,
    "end": 3390.655,
    "text": "That's not what consciousness is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.735,
    "end": 3395.659,
    "text": "So, I mean, it really comes down to what are we looking for or talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.61,
    "end": 3406.922,
    "text": " if we did have the ability to design different systems that did have different overlap with their computational and structural aspects?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.765,
    "end": 3410.986,
    "text": "Yeah, great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3414.696,
    "end": 3422.898,
    "text": " I think it's very important to look at different types of computer architecture, different types of hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3424.798,
    "end": 3434.521,
    "text": "And you mentioned some, so there's actually something that was pointed out to me by Johannes Kleiner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.561,
    "end": 3443.543,
    "text": "So he pointed me to the notion of computation and memory or something similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.369,
    "end": 3457.338,
    "text": " And if I understand that correctly, it is a slight departure from the normal architecture because you actually do computations within the memory unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.358,
    "end": 3472.869,
    "text": "So it's not that you have additional memory units within the CPU, but you perform computations in the memory unit itself, which would be a way of satisfying the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.407,
    "end": 3477.21,
    "text": " flow constraint, the flow condition that I mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.03,
    "end": 3493.5,
    "text": "And similarly, there may be other architecture, maybe neuromorphic hardware that also could implement simulations in a way that satisfies the flow condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.162,
    "end": 3497.143,
    "text": "And as I pointed out in the presentation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.456,
    "end": 3506.76,
    "text": " the flow condition is just one necessary condition, which is weaker than the existential condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.44,
    "end": 3516.243,
    "text": "So all of these systems, even if they satisfy the flow condition, would not thereby also satisfy the stronger existential condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3518.164,
    "end": 3526.768,
    "text": "But as may have become clear, I am not completely certain about this existential",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.711,
    "end": 3551.186,
    "text": " condition or rather there may be some ways in which one can describe what's going on in such systems that you can actually say, okay, the processes that implement these computations, they are systems, particular systems to which the free energy principle can be applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.747,
    "end": 3556.77,
    "text": "Even if maybe the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.295,
    "end": 3566.821,
    "text": " material on which these processes run is not directly affected by these computational processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.941,
    "end": 3579.489,
    "text": "So maybe if we think about neuromorphic computer chips, maybe the chips themselves, they will continue to exist no matter what computations they perform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3580.609,
    "end": 3582.811,
    "text": "But if what's going on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.591,
    "end": 3604.095,
    "text": " if the activity that implements the computations within such a chip is sophisticated enough or has certain properties, maybe this activity can be regarded as an instance of a particular system to which the free energy principle can be applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.175,
    "end": 3606.655,
    "text": "So I'm not completely certain about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3607.455,
    "end": 3611.916,
    "text": "And I think this is something that has to be clarified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.795,
    "end": 3624.672,
    "text": " Yeah, maybe it will be useful also to see what people actually working on the free energy principle would say about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.692,
    "end": 3627.917,
    "text": "That's a really important point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.962,
    "end": 3630.723,
    "text": " Yeah, a few things that makes me think of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.804,
    "end": 3637.769,
    "text": "First is kind of like the hard problem of virtualization or something in that, some modification of a hard or an easy question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.17,
    "end": 3649.558,
    "text": "And then also about the difference between a case where the material substrate of computation is its own self-referent sustainer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.599,
    "end": 3655.123,
    "text": "And another case in which the material basis of a computation is projecting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3656.434,
    "end": 3666.198,
    "text": " let's just say a non-equilibrium steady state like a holograph, or it's creating robots, it's spinning out robots, or it's doing 3D printing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3667.358,
    "end": 3672.74,
    "text": "So in that situation, depending on how the system boundaries are modeled,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.172,
    "end": 3692.634,
    "text": " the viability of one part maybe even like it's kind of semantic germline is required for the continued propagation of some other part of this persistent system but that part is actually disposable even though it's the embodiments",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3695.486,
    "end": 3698.129,
    "text": " I'll go to a question in the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3698.189,
    "end": 3703.935,
    "text": "And also, I think it was memcomputing was the memory-based computing architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.095,
    "end": 3704.896,
    "text": "Yeah, I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.936,
    "end": 3707.839,
    "text": "There's a lot of interesting threads there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.379,
    "end": 3711.202,
    "text": "So Ali asks a question in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.642,
    "end": 3711.883,
    "text": "He wrote...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3713.109,
    "end": 3714.43,
    "text": " What about understanding?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3714.81,
    "end": 3727.259,
    "text": "If we define understanding as a kind of correlation or mapping between spaces of semantic possibilities, can we say that large language models do indeed understand their prompts and outputs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.999,
    "end": 3732.923,
    "text": "And does understanding in this sense require or entail consciousness or vice versa?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.763,
    "end": 3743.268,
    "text": " So with understanding as a map amongst semantic spaces, what can we say about LLMs in understanding and what is the relationship between understanding and consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.889,
    "end": 3745.369,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.389,
    "end": 3748.991,
    "text": "That's a very good or these are very good questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.151,
    "end": 3755.874,
    "text": "And of course, it depends on the notion of understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.914,
    "end": 3759.936,
    "text": "And if we conceive of understanding as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.14,
    "end": 3772.306,
    "text": " as a way of grasping inferential relations or associative relations between different notions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3773.787,
    "end": 3781.552,
    "text": "And so there certainly is some form of understanding that large language models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.349,
    "end": 3782.669,
    "text": " have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.749,
    "end": 3806.962,
    "text": "They can relate concepts to one another and their representations of concepts in a vector space preserves some important parts of the structure of conceptual spaces of our language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.042,
    "end": 3811.424,
    "text": "So in this sense, they do understand some things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.498,
    "end": 3827.71,
    "text": " And then there are other forms of understanding and about which I will say something in a moment, but because that's a bit more complicated and I cannot say as much about it, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.45,
    "end": 3841.08,
    "text": "But the question whether understanding entails consciousness or understanding in the sense you mentioned, I would say does not entail, does not require consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.219,
    "end": 3844.88,
    "text": " So you can have that without consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3846.02,
    "end": 3855.123,
    "text": "And another question is, well, does consciousness require some other form of understanding maybe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.263,
    "end": 3866.706,
    "text": "And I, or at least my proposal here would suggest that yes, there is some form of understanding that is required by consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.746,
    "end": 3871.207,
    "text": "And this is an understanding which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.418,
    "end": 3881.84,
    "text": " is related to knowing what things in the world some words or representations refer to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3881.96,
    "end": 3889.922,
    "text": "So this requires that you actually have a concept of there being a world of which you are a part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.643,
    "end": 3896.004,
    "text": "And I don't think that large language models understand that they are things in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.804,
    "end": 3899.885,
    "text": "They don't know that there is something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3900.413,
    "end": 3902.495,
    "text": " out there of which they are a part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.856,
    "end": 3912.043,
    "text": "And I think that's crucial for a certain form of understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.065,
    "end": 3923.554,
    "text": "And in order for certain things to be meaningful for you, you must somehow have a concept of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.535,
    "end": 3935.762,
    "text": " of the world and a sense of that you are part of this world and how you relate to things in the world and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3937.543,
    "end": 3944.027,
    "text": "Now, this, I think, is required for some form of understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3945.729,
    "end": 3953.334,
    "text": "And I think it's also required for consciousness, at least according to the proposal that I presented here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.114,
    "end": 3955.215,
    "text": "And the idea is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.982,
    "end": 3974.418,
    "text": " if a system not only has some internal representations that it manipulates, but if by virtue of doing so, it sustains its existence, then this puts some very strong constraints on what the system will do with these representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.419,
    "end": 3982.705,
    "text": "So, if you think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.196,
    "end": 4009.234,
    "text": " a self-driving car and in principle it may compute all sorts of things and it will not have a meaning for the system for the car itself but if these processes are realized in a way that the system systems continued existence depends on these computations and this puts some more constraints on what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4010.117,
    "end": 4033.284,
    "text": " it can do with these internal representations and which will give such a system maybe some form of common sense and allowing it to draw certain inferences and avoiding other inferences and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.985,
    "end": 4036.405,
    "text": "So that would be my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4039.528,
    "end": 4058.11,
    "text": " hypothesis that there's a certain form of understanding that requires these but that also requires the conditions that i think are necessary for consciousness in that i hear a shift from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4059.136,
    "end": 4074.387,
    "text": " semantics and semantic embeddings to true semiosis and the abductive process of generation of embedded meaning so that's very um interesting okay a few more questions one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4075.632,
    "end": 4095.119,
    "text": " you've been writing excellent and diverse papers on different mathematical formalisms of consciousness for some years now so how have you seen the empirical side and the theoretical side of scientific study of consciousness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.26,
    "end": 4125.019,
    "text": " developing in the last several years and how do you believe that the current inflection points in artificial intelligence are like recontextualizing or modifying your agenda or bringing different relevance to your work um yeah that's a good question and in general i would say that i mean that there's there's been since the 90s there's been an explosion of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.635,
    "end": 4140.762,
    "text": " empirical work on consciousness, partly also due to certain methods and paradigms that were developed and imaging technology that improved and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4140.782,
    "end": 4145.225,
    "text": "So we have better ways of empirically studying consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.905,
    "end": 4153.909,
    "text": "And so in the past years or decades, a lot of empirical data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.902,
    "end": 4178.37,
    "text": " consciousness has been gathered and many things have been found out and i think there are two reasons for which many people are now driven to theoretical approaches again or looking more closely at theoretical approaches the first is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4179.042,
    "end": 4187.166,
    "text": " Data alone doesn't give you understanding, so you need ways of interpreting data and constraining experiments and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.166,
    "end": 4206.054,
    "text": "And I think some evidence for this are these recent adversarial collaborations in which proponents of different theories of consciousness team up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.292,
    "end": 4218.781,
    "text": " design experiments that would lead to or could lead to evidence which more strongly favors one but not the other theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.122,
    "end": 4234.032,
    "text": "And part of why such adversarial collaborations are needed or are perceived as necessary by some is that in previous years,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.014,
    "end": 4263.221,
    "text": " people working with certain theoretical assumptions in mind or with some, with their pet theory, maybe global workspace theory, they've been, or other theories, of course, they've then been looking for evidence that would confirm their theoretical assumptions and maybe designing experiments in a way that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4264.116,
    "end": 4272.759,
    "text": " is more likely to yield certain kinds of evidence or confirming evidence, supporting evidence for their own theoretical assumptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.839,
    "end": 4291.906,
    "text": "So realizing that in order to make progress and constrain also the class of theories that you have, realizing that it's important to do more rigorous experiments and explore ways in which you can actually also find",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.596,
    "end": 4296.938,
    "text": " evidence that disconfirms certain theoretical assumptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4298.918,
    "end": 4312.344,
    "text": "That, I think, is one of the motivations behind these adversarial collaborations and also makes people a bit more self-conscious of the theoretical assumptions that they're making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.126,
    "end": 4320.648,
    "text": "Another big issue is, of course, that the scope of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4321.556,
    "end": 4326.04,
    "text": " empirical and theoretical approaches has to be expanded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.06,
    "end": 4334.847,
    "text": "We now have good evidence that many animals that were previously thought to be unconscious actually are conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.868,
    "end": 4349.098,
    "text": "Animals such as octopuses, and there's at least reason to take the hypothesis seriously that some insects may also be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4350.051,
    "end": 4351.812,
    "text": " Maybe bees are conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.853,
    "end": 4360.537,
    "text": "And in order to make progress here, theoretical approaches are needed to help",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4361.929,
    "end": 4390.408,
    "text": " structure debates and determine what kind of evidence would be supportive for certain hypotheses or which type of kinds of evidence would be relevant to answer the distribution question which entities which animals are conscious so that's one thing and then of course you you mentioned uh progress in ai and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.263,
    "end": 4402.906,
    "text": " people are now seriously considering what artificial systems might be conscious and whether some existing systems might actually already be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.946,
    "end": 4416.009,
    "text": "And we need theories to, to make progress on this, or maybe not, not necessarily theories, but theoretical work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.269,
    "end": 4419.99,
    "text": "And what I,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.966,
    "end": 4436.553,
    "text": " And also that's a very difficult problem here that artificial systems are in many ways, not only unlike human beings, but also unlike other animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.334,
    "end": 4450.5,
    "text": "So whereas in research on animal consciousness, you can try and draw some analogies between human beings and other animals, it's less straightforward when it comes to artificial systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.34,
    "end": 4457.624,
    "text": " And this means that empirical research alone will be less helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.804,
    "end": 4465.949,
    "text": "We also need very sophisticated theoretical approaches to deal with these issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.529,
    "end": 4480.798,
    "text": "And there will always remain some uncertainty just because artificial systems can be physically or physiologically so different from conscious organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.895,
    "end": 4511.125,
    "text": " and it's not clear how best to deal with these uncertainties we need theoretical approaches to make sense of all this and i would say um we have to we might face the reality at some point so it may be maybe it will turn out that we won't ever know whether",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4511.934,
    "end": 4513.775,
    "text": " certain systems are conscious or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.616,
    "end": 4524.363,
    "text": "I'm very skeptical that we'll someday find a theory of consciousness that will tell us exactly which entities are conscious and which are not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.383,
    "end": 4529.427,
    "text": "I mean, integrated information theory is a proposal for such a theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.447,
    "end": 4537.653,
    "text": "And it's for this reason, very important that theories like IIT are being developed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.959,
    "end": 4547.367,
    "text": " On the other hand, it makes very strong predictions about what kinds of systems can be conscious and which can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.328,
    "end": 4562.601,
    "text": "So it would agree with the proposal I presented here that a computer simulation in a classical hardware will not be conscious",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.727,
    "end": 4580.851,
    "text": " And many artificial systems will not be conscious, even if they have all the abilities that are associated with consciousness, even if they can interact with the environment, have sophisticated cognitive abilities, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.191,
    "end": 4591.513,
    "text": "So it's very important that such theories are developed, but I think it's also very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.742,
    "end": 4614.189,
    "text": " hard to gain certainty and maybe, so this is what, what I'm some, some of the, what one, one strategy that I'm pursuing is to try and find necessary conditions for consciousness, which would allow us to rule out that certain systems are conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.149,
    "end": 4621.191,
    "text": "So maybe we will never have a theory of consciousness that says with certainty,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4622.014,
    "end": 4629.136,
    "text": " if a system, an artificial system, has X or XYZ and so on, then it is conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.016,
    "end": 4642.259,
    "text": "But maybe we will have some theoretical approaches that are empirically informed and which strongly suggest that if a system does not have X, then it is not conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.959,
    "end": 4651.321,
    "text": "So maybe this will be all that we can hope to achieve when it comes to understanding artificial consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.745,
    "end": 4680.807,
    "text": " and i see the the account that i'm presenting here as contributing to this project by proposing some necessary conditions for consciousness and as i already indicated i'm not completely certain about either of these conditions but maybe something like the the weaker condition the flow condition maybe that would something like that could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.641,
    "end": 4699.107,
    "text": " a useful necessary condition for consciousness, which would rule out consciousness in a wide class of systems, but which would, for example, not rule out the possibility of consciousness in a computer simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4700.767,
    "end": 4702.408,
    "text": "Not in all computer simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4705.723,
    "end": 4706.043,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4706.444,
    "end": 4711.247,
    "text": "The via negativa of consciousness studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4712.067,
    "end": 4716.53,
    "text": "So one question on measurement and then a closing question on ethics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4716.59,
    "end": 4719.672,
    "text": "So you mentioned the distribution question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4720.492,
    "end": 4725.375,
    "text": "What is the distribution of consciousness in our scenario?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4726.636,
    "end": 4743.713,
    "text": " what kind of distribution is that is it a z-axis there's a scalar quantity that is going to summarize the density of some distribution in space like we were doing some kind of topographical map or is that distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.04,
    "end": 4773.389,
    "text": " multi-dimensional are there different dimensions to consciousness so to what extent do we even aim for a uni-dimensional scalar representation potentially using iit or other measures or to what extent will we have a plurality of consciousness measures without necessarily like a higher or lower",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4776.004,
    "end": 4776.244,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.644,
    "end": 4781.146,
    "text": "Yeah, that's a very tough question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.886,
    "end": 4798.372,
    "text": "So as you already alluded to, according to some theories, such as IIT, consciousness does come in degrees, but it varies along a single scale, the degree of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.369,
    "end": 4806.835,
    "text": " And classically, there's also this distinction between the level of consciousness and the contents of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4806.855,
    "end": 4820.326,
    "text": "So the level would be defined in terms of wakefulness or vigilance and the contents in terms of that which is experienced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4821.527,
    "end": 4827.112,
    "text": "And the idea would be that you can distinguish between levels of consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.562,
    "end": 4855.861,
    "text": " in a unidimensional way but then the more recent proposals according to which consciousness is multi-dimensional and as you already mentioned and there which means that it may be impossible to define a unidimensional degree of consciousness um maybe you can all only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.744,
    "end": 4877.3,
    "text": " order conscious experiences along these different dimensions individually but not have a total order on conscious states um yeah so i i think these are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.39,
    "end": 4882.771,
    "text": " to a large extent, unresolved questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.831,
    "end": 4907.058,
    "text": "And I don't have a strong opinion on this, but I do think that consciousness, at least some crucial dimensions of consciousness that come in degrees, and I'm open to the idea that there will be borderline cases between systems that are clearly conscious and systems that are clearly unconscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.992,
    "end": 4920.402,
    "text": " So I'm open to the idea, to the possibility that there will be some systems for which it's indeterminate whether they're conscious or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4921.242,
    "end": 4931.01,
    "text": "And apart from, I mean, IIT would not imply this, of course, but there are some computational approaches to consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4932.911,
    "end": 4935.592,
    "text": " would specify some properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4935.612,
    "end": 4954.918,
    "text": "I mean, if you think about the counterfactual depth of internal representations, for instance, that's something that comes in degrees and it's not clear at what point a system will be conscious and cease to be unconscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4954.958,
    "end": 4959.34,
    "text": "What degree of counterfactual depth is necessary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.097,
    "end": 4961.017,
    "text": " for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.198,
    "end": 4971.282,
    "text": "And yeah, so I'm open to the possibility of borderline cases of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.343,
    "end": 4986.87,
    "text": "And similarly, it's even if we so if we try to apply theories of consciousness to other animals, then there may be cases in which it's not clear whether",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4987.682,
    "end": 4990.083,
    "text": " what a theory of consciousness would say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4990.163,
    "end": 5003.387,
    "text": "So Jonathan Birch has a wonderful paper about the problem of trying to determine, of finding out which non-human animals are consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.607,
    "end": 5011.629,
    "text": "And the idea is that if you try to use a theory of consciousness that was developed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5012.668,
    "end": 5016.55,
    "text": " on the basis of what we know about consciousness and human beings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5017.23,
    "end": 5025.994,
    "text": "And there may be many cases in which it's not clear whether the theory applies or not, or whether the conditions for consciousness are fulfilled or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.034,
    "end": 5031.576,
    "text": "So if you think about global workspace theory, what is a global workspace?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5032.157,
    "end": 5039.84,
    "text": "I mean, we can, for human beings, distinguish between different consuming systems, local processes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5040.626,
    "end": 5054.054,
    "text": " that have access to the global workspace and which receive the contents that are represented in the workspace and which are thereby consciously processed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.975,
    "end": 5056.916,
    "text": "But there are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5057.406,
    "end": 5072.846,
    "text": " animals that may that don't have as many cognitive sub processes that don't have such sophisticated cognitive abilities that may maybe have something like a global workspace, but with fewer consuming systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.447,
    "end": 5079.991,
    "text": " So when does it cease to be a global workspace in the sense that will be required for consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.972,
    "end": 5095.381,
    "text": "And because of such indeterminacy, it may be more useful to look for other markers of consciousness, evidence for consciousness, such as learning abilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5095.442,
    "end": 5098.403,
    "text": "That's what Birch proposes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5099.79,
    "end": 5118.978,
    "text": " and in part, I think, inspired by work by Eva Jablonka and Simona Ginsberg, who suggests that certain forms of learning are transition markers for consciousness, which provide strong evidence for the presence of consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5119.984,
    "end": 5122.406,
    "text": " And, um, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5122.546,
    "end": 5125.267,
    "text": "What, what about the distribution question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.307,
    "end": 5136.694,
    "text": "So this is more about evidence for consciousness and different types of systems and what will the distribution look like in the end?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5136.874,
    "end": 5137.654,
    "text": "I, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.774,
    "end": 5147.4,
    "text": "So, um, but what I'm mainly interested is in trying to find out how we can determine whether a system is conscious or how we can rule out that a system is conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5148.092,
    "end": 5155.669,
    "text": " And what, in the end, this will tell us about the distribution of consciousness, I think, is a great open question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5158.792,
    "end": 5159.132,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.533,
    "end": 5163.816,
    "text": "Well, as we say in the ant colony, the whole nest is our workspace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5164.576,
    "end": 5166.298,
    "text": "So different systems will do it differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.798,
    "end": 5185.932,
    "text": "And in closing, I know that you're teaching a course on this, so to compress it will be a challenge, but could you conclude with a statement or actually a pair of statements on AI ethics, one addressed to natural humans, one addressed to the machines?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.622,
    "end": 5209.302,
    "text": " um yeah so ai ethics so i don't want to say anything about ai ethics in general but just about consciousness so when it comes to human beings um what i find interesting is the question what makes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5211.502,
    "end": 5215.583,
    "text": " what is required for being a moral agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.443,
    "end": 5233.706,
    "text": "So, um, most people would agree that consciousness gives people or gives entities, gives organisms at least some moral status, even if it's maybe not required for having a moral standing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.946,
    "end": 5239.607,
    "text": "Um, but it's at least sufficient for some form of moral status and then maybe some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.385,
    "end": 5257.264,
    "text": " organisms matter more than other organisms, even if they are similarly conscious, but maybe some animals matter more than other animals because of their cognitive abilities and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5258.125,
    "end": 5259.647,
    "text": "And then the question is what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5263.797,
    "end": 5285.27,
    "text": " do we have to add in order to turn a moral patient as it were into a moral agent a being that can act in ways that are not just in accordance with certain moral principles or not in accordance with them but they can act because of certain morals",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5285.939,
    "end": 5294.582,
    "text": " considerations and is it necessary to be conscious in order to be a moral agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.642,
    "end": 5312.167,
    "text": "And what I find interesting here is to explore to what extent accounts that look for necessary conditions for consciousness may also yield some necessary conditions for being a moral agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5313.067,
    "end": 5313.247,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5313.985,
    "end": 5326.128,
    "text": " even if consciousness may not be required for being a moral agent, maybe there are certain necessary conditions for consciousness that are also necessary for moral agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5327.289,
    "end": 5332.63,
    "text": "And this can then also be applied to artificial systems and principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5334.171,
    "end": 5341.793,
    "text": "But of course, when it comes to artificial systems, the interesting question is, should we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5343.374,
    "end": 5348.058,
    "text": " even create artificial systems that might be conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5349.459,
    "end": 5354.502,
    "text": "Or do we have a duty to create conscious artificial systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5355.583,
    "end": 5365.431,
    "text": "And my own position would be that in the case of animals, it's already happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5366.331,
    "end": 5366.952,
    "text": "We may not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5367.802,
    "end": 5371.905,
    "text": " know with certainty which animals are conscious and which are not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.085,
    "end": 5386.336,
    "text": "But regardless of our epistemic situation, regardless of what we know about these animals, they are conscious or are not conscious, they feel pain or don't feel pain, they suffer or they do not suffer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.036,
    "end": 5391.96,
    "text": "So the most we can do is to try and minimize the suffering in existing animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5392.5,
    "end": 5394.342,
    "text": "But when it comes to artificial systems,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.939,
    "end": 5404.722,
    "text": " we can at least at the moment say that most artificial systems are very unlikely to be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.743,
    "end": 5416.866,
    "text": "And we have the unique opportunity now to really think hard about whether we want to risk creating conscious artificial systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5418.147,
    "end": 5424.009,
    "text": "And I think we learned at least two things, two interesting things in the past",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5424.83,
    "end": 5431.312,
    "text": " weeks or months about artificial systems, artificial intelligence and consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5432.112,
    "end": 5437.514,
    "text": "And one is that AGI may not require consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.415,
    "end": 5452.479,
    "text": "I think most people believe that anyway, but there was some, there was a listed possibility that AGI, artificial general intelligence, might require consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5453.533,
    "end": 5465.019,
    "text": " And what we've seen with the latest generations of language models is that they at least come very close to some form of artificial general intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.199,
    "end": 5467.04,
    "text": "It's very unlikely that they're conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5467.34,
    "end": 5481.427,
    "text": "And so this gives me at least some confidence that future more sophisticated systems that will have a general form of intelligence will also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.271,
    "end": 5485.272,
    "text": " not be conscious or unlikely to be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5486.313,
    "end": 5503.36,
    "text": "I think that's good because there will be no further incentive to create artificial conscious systems in order to achieve AGI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5505.399,
    "end": 5508.661,
    "text": " because it seems that you can achieve that without creating conscious systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5509.561,
    "end": 5518.686,
    "text": "Another thing which is a bit more concerning maybe is that we've also seen that it's very difficult to regulate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.185,
    "end": 5533.512,
    "text": " developments in AI and big companies can just decide to put systems on the market and make them available for everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5534.412,
    "end": 5540.835,
    "text": "And they will use them for whatever purposes without any regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5541.736,
    "end": 5541.956,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5545.396,
    "end": 5568.833,
    "text": " If it will, in the maybe not too far future, be feasible to create conscious systems, if we do gain a better understanding of what it would mean for an artificial system to be conscious or maybe how to create one, people will do it and it will be very difficult to regulate this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5569.907,
    "end": 5595.56,
    "text": " so this um may be a problem for the not too far future a problem for guest stream number 40.2 yes thank you vanya very insightful best of luck with your works and hope to talk to you later thank you daniel it's been a pleasure farewell",
    "speaker": "SPEAKER_01"
  }
]