[
  {
    "start": 21.756,
    "end": 42.652,
    "text": " was just blues entry music hello and welcome everyone to actin flap live stream number 0 36.1 it's january 19th 2022. welcome to the actin flap we are a participatory online lab that is communicating learning and practicing applied active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.592,
    "end": 45.634,
    "text": " You can find us at the links here on this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 46.475,
    "end": 51.659,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.8,
    "end": 58.185,
    "text": "All backgrounds and perspectives are welcome, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 59.451,
    "end": 68.042,
    "text": " You can check out ActiveInference.org to learn about how to participate in any ACT-INF Lab events, which go beyond but also support the live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.843,
    "end": 75.571,
    "text": "And also the CODA site at the bottom will give you access to the table with metadata on the past and upcoming live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 77.076,
    "end": 94.787,
    "text": " All right, today in Act Imp Stream number 36.1, we're going to be discussing and learning and seeing who joins for the paper, Modeling Ourselves, What the Free Energy Principle Reveals About Our Implicit Notions of Representation by Sims and Pizzulo, 2021.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.062,
    "end": 119.062,
    "text": " We went over some of the background in 36.0, and today we're just going to introduce ourselves, say hello, what we were excited about in the paper, and then we wrote down some things to discuss, but I'm sure both of you have other random things you wrote down and anything that people write in a live chat we can also look at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.683,
    "end": 121.143,
    "text": " I'm Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 121.504,
    "end": 133.732,
    "text": "I'm a researcher in California, and I think I'm excited to just hear Dean's marginal comments and just see where it goes, because there's just a lot in this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 134.273,
    "end": 139.036,
    "text": "And so it'll be a thick dot one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 142.199,
    "end": 142.399,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.883,
    "end": 144.904,
    "text": " Well, I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.924,
    "end": 145.984,
    "text": "I'm here in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.264,
    "end": 151.287,
    "text": "And I really didn't know if I even had time to even look at this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.387,
    "end": 160.232,
    "text": "And then I listened in on Daniel and Blue's conversation in The Zero, and it piqued my interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.392,
    "end": 168.277,
    "text": "And so I read the paper, and I was really happy to read this paper because where Daniel and Blue –",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.124,
    "end": 175.087,
    "text": " kind of took a path to introducing the material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.947,
    "end": 185.074,
    "text": "This is kind of familiar ground, familiar territory for me, which is very unusual because most of the stuff that we look at, I'm looking at it for the first time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.414,
    "end": 191.078,
    "text": "And so I'm really excited and I don't want to detour anything that you guys want to sort of look at at the point one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.045,
    "end": 199.692,
    "text": " maybe at the point two point of this process, we can look at what the section five of this paper, what can we learn from this debate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.712,
    "end": 206.418,
    "text": "Because I think that section five of this is super interesting and not just trippy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.698,
    "end": 210.022,
    "text": "You guys use the word trippy, which I thought was fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.442,
    "end": 214.045,
    "text": "Quite a good description, but I think we can pull",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.046,
    "end": 224.395,
    "text": " parts of this out and look at them and reassert them and reattach them in our own way and actually come up with something pretty amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 225.456,
    "end": 226.257,
    "text": "I'll pass it down to Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.287,
    "end": 230.867,
    "text": " Hi, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.027,
    "end": 231.507,
    "text": "I'm Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.647,
    "end": 233.548,
    "text": "I'm a researcher in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.248,
    "end": 236.668,
    "text": "And this paper, it was great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.728,
    "end": 242.229,
    "text": "Like Dean was saying, it was familiar to me, but not because of my background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.25,
    "end": 255.112,
    "text": "I thought it really explained and summarized a lot of different points in the FEP and active inference and how we use it to model ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.352,
    "end": 258.233,
    "text": "And it pulled out a lot of really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.433,
    "end": 268.677,
    "text": " important questions I think that I'm looking forward to discussing with you guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.057,
    "end": 276.26,
    "text": "So we wrote down some things to discuss, but maybe let's start with just a blank slate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 276.84,
    "end": 281.802,
    "text": "Dean, what do you think would be some approaches that we can take or some starting points?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 282.903,
    "end": 285.784,
    "text": "Because we already have other cards up our sleeve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 287.633,
    "end": 292.981,
    "text": " I don't want to be a guy holding up a flag and detouring your conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.422,
    "end": 301.074,
    "text": "One of the things we might get to near closer to the end, hopefully, is the authors speak to the possibility of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.165,
    "end": 316.534,
    "text": " You know when you set up your table, Daniel, one of the things that they potentially talked about in the section five of the paper is the idea that the lines are a little bit fuzzy here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.714,
    "end": 317.634,
    "text": "Maybe they're broken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.575,
    "end": 325.941,
    "text": "And the idea of, in some cases, our ability to move from the non-representational into the representational",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 326.701,
    "end": 332.985,
    "text": " it's kind of a big deal because you can have the debate that says, here's the parts that would align with a non-representational view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 333.405,
    "end": 336.807,
    "text": "And here's the lines that would, or parts that would align with a representational view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.307,
    "end": 347.473,
    "text": "But then they insert this part that says, but maybe we slip into and out of these representations, kind of like we slip into and out of the Q density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 347.893,
    "end": 351.595,
    "text": "And so maybe at near closer to the end today, we can tap into that a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 357.645,
    "end": 380.476,
    "text": " let's start with that grid yeah because this is the structure of the paper and the uh elucidating contribution and also i think dave left a youtube comment or something like there's other dimensions so this is kind of pointing away towards an interesting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.239,
    "end": 406.239,
    "text": " approach to uh making sense of some philosophical debates kind of laying them out in tables like this so how should we approach it there's the representational and the non-representational perspectives or stances or modes or archetypes that is definitely very blurry because of course it depends on what do you mean by representation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 407.037,
    "end": 410.659,
    "text": " and that can have some fundamental ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.739,
    "end": 423.284,
    "text": "And then that representational versus not continuum or dialectic is then separated into a few domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 425.485,
    "end": 434.689,
    "text": "I think we could talk about what are the similarities and differences, because some of it was a little nuanced and I wondered if there was other categories or,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.604,
    "end": 439.867,
    "text": " They were organizational, structural, content related, and functional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 440.307,
    "end": 452.198,
    "text": "So then this is your game board of eight lower dimensional projections that the thought can be in, or it's something like one of these eight octants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 453.679,
    "end": 461.907,
    "text": "And then a lot of the papers going through some of the literature and rhetoric for and against each of these.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 464.219,
    "end": 467.981,
    "text": " using the FEP as kind of the interpretant?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.701,
    "end": 472.762,
    "text": "What is being interpreted to speak for one of those eight cells?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.563,
    "end": 476.704,
    "text": "What do either of you want to continue with there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 478.184,
    "end": 487.208,
    "text": "Well, on the action domain, so on that sensory motor stuff, and Yelly Broomberg talks a good argument around the idea that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.561,
    "end": 494.424,
    "text": " For example, I could be in a flow state and there is no model or plan that I'm necessarily following.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 494.484,
    "end": 495.124,
    "text": "And that's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.604,
    "end": 510.732,
    "text": "If we're talking about extension and embedded as two of those four E's, you don't necessarily have to move to that place that requires something to work off of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.792,
    "end": 514.374,
    "text": "You could just be flowing and working in something, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 515.368,
    "end": 520.411,
    "text": " that rate of change is you extended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.351,
    "end": 527.554,
    "text": "So there are times when you literally don't have to be working off of a plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.974,
    "end": 536.338,
    "text": "You could also be moving from a blueprint to some kind of outcome that you want to achieve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.179,
    "end": 542.782,
    "text": "And then it's pretty obvious then that the representational piece has to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.495,
    "end": 557.883,
    "text": " So, maybe the argument isn't that both aren't at work, it's how we transition from a density out of a density and then back into a density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.724,
    "end": 562.166,
    "text": "Something to at least have a conversation about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.565,
    "end": 567.226,
    "text": " Because I think Blue was touching on this last time too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.246,
    "end": 575.31,
    "text": "She said, I just want somebody to be able to show me how these lines in this sort of structured relationship exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.491,
    "end": 584.155,
    "text": "And when I heard her say that, I was kind of like, no, I think that's a fair question because those lines seem to be blurred.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.542,
    "end": 595.607,
    "text": " So something that came up yesterday, um, is the idea of free will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.408,
    "end": 604.274,
    "text": "And, um, I just wonder how that might play into these different grid boxes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.354,
    "end": 612.881,
    "text": "Like, like is there free will in all of these or in none of them, or is that even related?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.901,
    "end": 617.585,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 620.123,
    "end": 620.804,
    "text": " Let's write it down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.248,
    "end": 635.877,
    "text": "One interesting thing about this is it has a little bit of that visual illusion with the black grid and the white dots at the junctions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 637.358,
    "end": 640.421,
    "text": "So it's kind of a perceptive artifact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 641.241,
    "end": 642.723,
    "text": "It's just sort of messing with our",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.15,
    "end": 668.233,
    "text": " visual representation and visual representations are are uh you know when you see it you believe it that kind of focused system in a lot of the active literature and vision uh okay so let's let's save free will and the the blurriness for later and then come to some of the things we wrote down for the previous list",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.587,
    "end": 697.375,
    "text": " okay so in what sense can or are computational models or any other kind of models be fully observable can i can i give maybe a possible real life example that maybe speak starts to speak to that sure okay so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 699.022,
    "end": 710.265,
    "text": " In the paper, the authors say, however, these differences matter if one considers structural aspects and the degree of resemblance between hidden variables and environmental dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.845,
    "end": 715.206,
    "text": "So I was thinking about your question, and so I wrote this down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.626,
    "end": 719.187,
    "text": "If dynamics, then the material, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.227,
    "end": 723.768,
    "text": "the content, the structure, and the organization is going to have a different change rate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.568,
    "end": 725.389,
    "text": " than the function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.449,
    "end": 731.113,
    "text": "So the first three columns are going to behave differently than the fourth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.874,
    "end": 742.642,
    "text": "For example, the screwdriver as tool remains very stable, hopefully, relative to the spiral effect or function that it can generate on the screw.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.863,
    "end": 746.905,
    "text": "To the one driving the screw, there are now two rates to juggle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.336,
    "end": 761.823,
    "text": " The assumption that the tool applying the function as a rule is stable and consistent and the effect sought will be a form change, meaning action orientation where a new representation outcome happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.683,
    "end": 769.647,
    "text": "You quite literally start and end with a dance between the stabilities and the dynamics leveraging off of each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 770.567,
    "end": 771.488,
    "text": "So back and forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.458,
    "end": 784.302,
    "text": " So we need to keep open the possibility that the stable or the representational and the dynamic, which as Yelly points out, can be non-representational as well, are both in play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.083,
    "end": 788.384,
    "text": "And then I wrote here, because I've used the expression, when in doubt, zoom in, zoom out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.804,
    "end": 791.785,
    "text": "When Markov blanket, zoom in, zoom out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.454,
    "end": 816.282,
    "text": " So in terms of the computation, there's actually two computations, one around what we think should remain relatively consistent and one which we then apply that consistency to something that we actually want to see a rate change expedited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.783,
    "end": 823.125,
    "text": "So there's actually, I think there's two calculations here to the person that's trying to figure out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.233,
    "end": 830.197,
    "text": " how they're going to see what's on the other side of the blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.441,
    "end": 838.102,
    "text": "Very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.643,
    "end": 839.743,
    "text": "Lorenzen Laplace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.489,
    "end": 852.172,
    "text": "So I like this idea of zooming in and out with a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.033,
    "end": 853.874,
    "text": "And I think it speaks to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.985,
    "end": 869.631,
    "text": " the way that agents are nested or anything is nested, I don't want to necessarily ascribe agency or free will to different levels of organization, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.072,
    "end": 875.975,
    "text": " I think when Markov Blanket zoom in, different Markov Blanket zoom out, different Markov Blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.495,
    "end": 889.143,
    "text": "So for me, like it speaks to multi-scale systems and how applying Markov Blankets is kind of scale friendly or like imputed onto the system in question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.8,
    "end": 917.095,
    "text": " one extension or maybe example of that we've probably talked before like the table it's in the process ontology it's material that's tabling but then that material is also process space so sort of this multi-scale process ontology and the identification of a given system of interest at stationarity like an object that can be tracked",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 918.793,
    "end": 924.799,
    "text": " But there's objects that are too fast to be tracked, and there's objects that are too slow to be tracked below the just noticeable difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 925.22,
    "end": 936.911,
    "text": "And so within a given measurement or active inference regime, a given entity can have attention on a given system of interest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.452,
    "end": 941.416,
    "text": "It can't have attention on things that are slower or faster, like out of its frequency band.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 943.843,
    "end": 966.114,
    "text": " that's discarding 99 of the system to not consider outside of the frequency band it's like the observables are just one they're they're very bounded and so that the slower things are the larger things and the faster things are the smaller things so that's kind of a nice",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 969.094,
    "end": 971.897,
    "text": " And let me just piggyback on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.817,
    "end": 987.73,
    "text": "And if we're talking about specificity or scale-friendly versus cosmic and scale-free, that's also part of that zoom in, zoom out exercise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.891,
    "end": 992.635,
    "text": "Because there are quite literally elements of this that are still scale-free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.936,
    "end": 1014.452,
    "text": " That if, again, as they said, modeling ourselves, we can start from that position of scale free and then find the specifics or we can find the specifics and ask ourselves how far out can we extend our confidence that the stability will hold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.293,
    "end": 1018.576,
    "text": "So that's again, piggyback on what you just said, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1019.465,
    "end": 1023.457,
    "text": " There's all kinds of ways of interpreting zoom in and zoom out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.32,
    "end": 1027.068,
    "text": "And I think maybe that's one of the insights",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.158,
    "end": 1050.961,
    "text": " that we get when we don't get ourselves hung up on being a really radical and activist, even though I'm of the camp that says we start out in the non-representational and activist leaning side and then the plans and the representations and the effects of that are representational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.305,
    "end": 1057.608,
    "text": " All right, I'll think of an example, a wet lab example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.108,
    "end": 1067.435,
    "text": "So I'm thinking of doing PCR or a wet lab technique where you're not observing perhaps the outcomes of what's happening for multiple steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1067.495,
    "end": 1071.337,
    "text": "And even then it might be a color change or a number on a screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1071.978,
    "end": 1074.88,
    "text": "And so then you get limited observables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1075.6,
    "end": 1097.663,
    "text": " those are sometimes your degrees of manipulation like in a thermocycler that's changing the temperature the only thing you're measuring during the reaction is the temperature sometimes you might also look at like the optical property but usually just changing the temperature and then it's very representation like to have a mental or a cognitive representation which can include extended",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.595,
    "end": 1118.751,
    "text": " phenotype like the notebook and the computer but that's pretty representational to have counterfactuals about what molecules would do that have never been visually observed um and so science becomes representational and i think um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.696,
    "end": 1122.938,
    "text": " how far does that reach back?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1123.118,
    "end": 1127.262,
    "text": "And it kind of blurs off into increasingly non-representational forms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.902,
    "end": 1132.746,
    "text": "Not saying that science is the most representational thing, but what are the most representational things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.087,
    "end": 1140.192,
    "text": "And how do we move back and forth on that is what I'm seeing with the two feet in, two feet out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.349,
    "end": 1145.83,
    "text": " But you just hit on a really important point because you said science becomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.31,
    "end": 1148.551,
    "text": "So what makes up the becomes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.331,
    "end": 1159.114,
    "text": "Like what exists in that space prior to it, us all agreeing that it's now science?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1159.754,
    "end": 1169.197,
    "text": "And I think that's what this, I think that's what this modeling as opposed to us as model asks us to consider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.37,
    "end": 1174.693,
    "text": " That's a really, you touched on the big deal here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.253,
    "end": 1185.721,
    "text": "Abductively, so what makes up that, what has to be present for us to be able to say, okay, now you've crossed a threshold and now we're talking science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.422,
    "end": 1187.602,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1189.013,
    "end": 1194.896,
    "text": " It reminds me of the paper of Brunberg, Anticipating Brain is Not a Scientist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.736,
    "end": 1204.74,
    "text": "And we can just take the always prescient titles and content of these papers to be targeting attention point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1206.292,
    "end": 1209.653,
    "text": " Is the Markov blanket a valid or useful construct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1209.914,
    "end": 1232.563,
    "text": "More recently, but back several years ago, identifying some similarities or at least a area of interaction with the anticipatory and cybernetics of systems, which is pretty system agnostic, can apply to very abstract systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1233.223,
    "end": 1249.682,
    "text": " representations as well as perhaps real systems and then the physical brain hypotheses and the inactivist and ecological perspectives on cognition with this activity called science and the role of a scientist and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1251.613,
    "end": 1253.474,
    "text": " A few ways to parse science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1255.055,
    "end": 1261.278,
    "text": "One is as we heard from Majeed Benny recently with model-based science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1262.179,
    "end": 1277.587,
    "text": "So that's one like relevant way that we learned about it and talked about this recently, like science being the application of models, but then other systems are perhaps doing something different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1277.607,
    "end": 1278.848,
    "text": "Well, what is science?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1279.713,
    "end": 1282.559,
    "text": " Anyone in the live chat should definitely respond, what is science?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1282.92,
    "end": 1288.451,
    "text": "And also, I would like to hear what both of you think and how that relates to anything we're talking about here or ever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1290.471,
    "end": 1296.072,
    "text": " So I always think about science as the application of the scientific method to anything, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.092,
    "end": 1299.373,
    "text": "So observations, hypothesis, experiment, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.073,
    "end": 1310.014,
    "text": "And because I think of science like this, science itself is just a model also, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.194,
    "end": 1311.335,
    "text": "So we use science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.355,
    "end": 1318.096,
    "text": "We build a model of whatever phenomenon it is that we're trying to replicate or observe or test or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.777,
    "end": 1323.159,
    "text": " And we do, we experiment with our model, like essentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.2,
    "end": 1328.224,
    "text": "So, so the scientific method itself is a model for doing science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.264,
    "end": 1332.827,
    "text": "And then the process of doing it is creating a model of, of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.847,
    "end": 1337.471,
    "text": "So it's like nested models all the way down in science, in my world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.273,
    "end": 1340.774,
    "text": "So Blue, can I ask you a quick question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.234,
    "end": 1343.156,
    "text": "What do you think precedes science?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1344.969,
    "end": 1347.911,
    "text": " the engagement with what you're describing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.532,
    "end": 1353.776,
    "text": "Because the authors always say assumptions matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.917,
    "end": 1360.562,
    "text": "What assumptions do you think goes into a person saying, okay, well, now I'm going to use scientific method?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.203,
    "end": 1373.673,
    "text": "Are there things that priors that we should sort of pull out and examine that are consistent when a person gets to a place where they say, okay, well, I'm going to do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.74,
    "end": 1388.931,
    "text": " Yeah, I mean, so there's a lot of stuff that's in the scientific, when I say the scientific method, it's like, I mean, it encompasses things like scientific bias and positive control and a negative control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.311,
    "end": 1400.82,
    "text": "And so all of these things are kind of this, in this like umbrella category, when I say scientific method and experimental design, like it's not always simple, but definitely like what,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.681,
    "end": 1406.345,
    "text": " precedes any science happening is simply observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.365,
    "end": 1409.047,
    "text": "So you have to be observant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.167,
    "end": 1422.436,
    "text": "And to have observation, you have to have some instrument with which to measure or gauge the phenomena which you're trying to examine, even if it's just your brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.326,
    "end": 1435.274,
    "text": " which is probably the most powerful instrument of all of the instruments because it's fundamental to any testable instrument that tests anything in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.334,
    "end": 1437.695,
    "text": "So I think, yeah, like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.896,
    "end": 1439.357,
    "text": "So that's a lot of priors, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.778,
    "end": 1450.625,
    "text": "So is it fair to say then that to get to a place of adopting a scientific method, one might...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.125,
    "end": 1462.773,
    "text": " first possess, before they can actually get into the formalities of that, a field-seeking curiosity and a way-finding bias?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.615,
    "end": 1466.016,
    "text": "And those are two different things, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.536,
    "end": 1468.277,
    "text": "One is I can be a spectator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.318,
    "end": 1471.24,
    "text": "The other one is I've got to get in the boat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.26,
    "end": 1472.761,
    "text": "I've got to get my skin in the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.041,
    "end": 1479.086,
    "text": "Do you think that those two things are necessary to adopt...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.115,
    "end": 1483.777,
    "text": " scientific method or to commit to scientific method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.64,
    "end": 1490.303,
    "text": "So I'd like for you to unpack those a little bit more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.323,
    "end": 1497.409,
    "text": "So yeah, can you just describe what you mean about those two, the wayfinding and the curiosity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.97,
    "end": 1499.271,
    "text": "Yeah, the field-seeking curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1499.291,
    "end": 1502.373,
    "text": "Well, curiosity, I mean, it's kind of got four parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.694,
    "end": 1505.496,
    "text": "There's an epistemic piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.277,
    "end": 1508.198,
    "text": "There's a sensing piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.058,
    "end": 1513.563,
    "text": " I can't remember what the other two are right off the top of my head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.024,
    "end": 1518.19,
    "text": "But bottom line is that curiosity doesn't just... It's not sort of a monolith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.353,
    "end": 1522.957,
    "text": "And part of that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.912,
    "end": 1549.289,
    "text": " determination because you don't know but you you still you're you're you're prepared to put in some time and effort uh to get past not knowing means that you can take one of two essential paths you can find out right you can go to a source that already knows or you can figure out um based on sort of collecting and and curating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.939,
    "end": 1555.102,
    "text": " So that's the field-seeking piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.582,
    "end": 1557.504,
    "text": "Wait, wait, wait.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.624,
    "end": 1559.806,
    "text": "What's the difference between finding out and figuring out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.046,
    "end": 1560.947,
    "text": "To me, those are the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.047,
    "end": 1565.911,
    "text": "So whether you're collecting evidence from Google or from... That's epistemic, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.971,
    "end": 1573.537,
    "text": "But to figure out is to not have a source already identified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.945,
    "end": 1575.426,
    "text": " not a single source of truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1576.207,
    "end": 1577.548,
    "text": "That would be the difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.008,
    "end": 1583.373,
    "text": "So one, you can find a truth source and then either believe it or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1584.214,
    "end": 1597.785,
    "text": "And the other is you have to develop your own truth through, it takes a lot more time because you have to go around and gather a whole bunch of other bits of information that aren't necessarily prepackaged for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.025,
    "end": 1599.066,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.626,
    "end": 1603.687,
    "text": " Yeah, and also like what is truth, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.727,
    "end": 1604.788,
    "text": "Well, right, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.808,
    "end": 1607.649,
    "text": "I mean, you ultimately have to be the one that decides that, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.709,
    "end": 1610.47,
    "text": "Whether to trust and have confidence in something or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.232,
    "end": 1614.432,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.712,
    "end": 1616.993,
    "text": "A lot to say there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.553,
    "end": 1617.973,
    "text": "Go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1618.573,
    "end": 1620.714,
    "text": "No, go ahead, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.114,
    "end": 1629.438,
    "text": "So let's pull one level back from, or two, from one and a half fractal dimensions from the curiosity fourfold distinction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1629.458,
    "end": 1629.678,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1631.01,
    "end": 1632.612,
    "text": " There was like the personal factors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.092,
    "end": 1636.736,
    "text": "So the question was, what precedes the type of engagement that might be called scientific?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1636.756,
    "end": 1637.496,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.516,
    "end": 1639.618,
    "text": "And there's some personal factors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1639.658,
    "end": 1645.424,
    "text": "They're basically psychodynamic or like situational behavioral archetypes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1645.904,
    "end": 1647.926,
    "text": "But they're things about individual behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1648.735,
    "end": 1649.636,
    "text": " people, humans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1650.317,
    "end": 1659.448,
    "text": "What other kind of factors, even if the individual is the nexus of agency, what other factors come into play and what precedes the kind of engagement that might be called scientific?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1659.928,
    "end": 1663.893,
    "text": "If the person is our system of interest, how do we zoom in and out from there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.06,
    "end": 1668.982,
    "text": " Well, that's my question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.022,
    "end": 1691.801,
    "text": "My question isn't, I don't have an answer necessarily, but what I have is, so, you know, before the Big Bang kind of thinking, we don't know, but is it possible that there actually is something that we can put our finger on that leads someone to have confidence in a scientific method and not just sort of remain in a kind of in a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.892,
    "end": 1696.173,
    "text": " place of stasis and not be curious, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.193,
    "end": 1704.175,
    "text": "Because there's lots and lots of people who are kind of quite comfortable just going along with whatever is happening around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.215,
    "end": 1711.237,
    "text": "But then there's others that appear to have a potential for a deeper commitment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.277,
    "end": 1722.24,
    "text": "So for example, when we were talking prior to Majid coming on with us, Blue raised the specter that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.792,
    "end": 1738.682,
    "text": " Genes don't necessarily have to have time in order to be considered prediction matter expertise because it has both the cause and the effect included in the structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.323,
    "end": 1740.804,
    "text": "So that got me curious, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.985,
    "end": 1746.247,
    "text": "For some people, just making that statement or asking that question,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.376,
    "end": 1748.177,
    "text": " blow right by them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.217,
    "end": 1750.539,
    "text": "They wouldn't even give it a second thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.919,
    "end": 1759.225,
    "text": "But then for some people, just making that claim arrests them, slows them down, and gets them asking questions on their own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.786,
    "end": 1772.756,
    "text": "Now, so that's why I'm asking this in the context of, so why would somebody now go from, I don't care, I don't give a rat's backside about science to, I'm very passionate about science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1772.796,
    "end": 1775.418,
    "text": "I'm very interested in learning this method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.797,
    "end": 1785.881,
    "text": " So I think science really is seen by many as a kind of truth finding endeavor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.862,
    "end": 1803.692,
    "text": "Because whether it's through mining previous knowledge or generating new information, maybe knowledge, either one of those is definitely like a thinking of the truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.073,
    "end": 1807.054,
    "text": "And in that way, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1807.972,
    "end": 1813.98,
    "text": " aren't we all just looking to minimize our uncertainty, reduce our uncertainty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.001,
    "end": 1819.907,
    "text": "So I look at science like it is an uncertainty reduction task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.967,
    "end": 1822.631,
    "text": "I mean, that's the point of it, perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.392,
    "end": 1825.114,
    "text": "So I don't know what factors...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.179,
    "end": 1840.107,
    "text": " you know, other than the fact that like maybe we're in a simulation, like we could go there because that would like precede the scientific endeavors that we undertake in our truth-finding efforts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.868,
    "end": 1848.893,
    "text": "But really like the knowledge of science as a way to determine truth, I think might be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.616,
    "end": 1852.479,
    "text": " Part of it, I mean, and maybe not everyone is taught that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.42,
    "end": 1861.328,
    "text": "I think about like, you know, in Western culture, we're all like indoctrinated with the scientific method from, I don't know, fourth grade on or something like that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.709,
    "end": 1862.43,
    "text": "Indoctrinated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.311,
    "end": 1869.333,
    "text": " And then they give you the PhD at the end when you're fully indoctrinated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1869.893,
    "end": 1874.937,
    "text": "But here's the thing, Blue, and this is a, but you bring up a really cool point and, you know, fourth grade indoctrinated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.077,
    "end": 1883.042,
    "text": "And I think one of the things you and I have kind of gone, we volleyed back and forth is so yes, science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.422,
    "end": 1893.489,
    "text": "And so somebody has, has said, this is a, this has got some practical things and some truth finding things, but I've always come back with great science and,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.36,
    "end": 1895.401,
    "text": " Plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.521,
    "end": 1896.963,
    "text": "These are material things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.543,
    "end": 1899.465,
    "text": "My question has always been when?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.026,
    "end": 1915.942,
    "text": "And you bring up the, well, we've decided when it's grade four, but I'm not sure that someone who's grade four, let me see, that'd be about nine, 10 years of age is the same science as for somebody who's 29, 30 or 39, 40, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.678,
    "end": 1939.888,
    "text": " So we can say plan now, but what I'm suggesting is that before the plan or the science, there's something before that, some really important things that we're just assuming or willfully ignoring because now we're onto the plan, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.968,
    "end": 1947.211,
    "text": "Because that's what has been reified and given the holy blessing sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.31,
    "end": 1953.273,
    "text": " So I think you're hitting something that's critical and it's why I'm disagreeing with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.313,
    "end": 1958.096,
    "text": "So I don't think that the science that you're doing when you're nine is that different from the science that you're doing when you're 39.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.496,
    "end": 1964.119,
    "text": "And the perfect example of that is Feynman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.159,
    "end": 1969.822,
    "text": "Like I was reading, I don't remember, maybe it's in the meaning of it all, like maybe it's in that book, but he talks about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.283,
    "end": 1973.984,
    "text": " how like for him, he just plays, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.064,
    "end": 1979.147,
    "text": "And so for a lot of his science is like, oh, I get to like make this toy and play with it and try to look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.227,
    "end": 1981.388,
    "text": "And I keep playing with it and I keep playing with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.448,
    "end": 1988.311,
    "text": "And so this is something I think that's like innate in us, like to just the figuring out part, like the truth finding part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.812,
    "end": 1992.754,
    "text": "So even as a baby, like from the time you can sit up, like what is this block?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.794,
    "end": 1993.594,
    "text": "Like what is this shape?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.634,
    "end": 1994.654,
    "text": "What is this slinky, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.695,
    "end": 1997.036,
    "text": "Like it's finding out and figuring out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.956,
    "end": 2016.796,
    "text": " like what are the affordances of the objects right right and um some of them are imposed by the outside like don't stand on the chair um because kids will use chairs as tents and step stools and you know like so it's some of it like that we impose some structure on you can't use this toy in that way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.777,
    "end": 2019.538,
    "text": " But really, kids, they don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.558,
    "end": 2021.419,
    "text": "They'll use anything anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.619,
    "end": 2023.92,
    "text": "They do all kinds of crazy things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.14,
    "end": 2030.743,
    "text": "They'll slide down a mountain on a trash bag or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.323,
    "end": 2035.185,
    "text": "So they don't know what the limits are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.205,
    "end": 2038.406,
    "text": "And so they'll explore new limits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.446,
    "end": 2044.609,
    "text": "And I think that scientists, at least the ones that really love to do science, play a lot also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.399,
    "end": 2051.169,
    "text": " So again, the trial and error piece can be like the triangles piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.209,
    "end": 2054.796,
    "text": "It can be scale-free, and I would never push back on that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.052,
    "end": 2056.312,
    "text": " piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.912,
    "end": 2060.514,
    "text": "The epistemic and the specific is what you just described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.054,
    "end": 2064.656,
    "text": "The other two parts of curiosity are the distributed and the sensing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.196,
    "end": 2072.199,
    "text": "And that's kind of the sort of the more active part where you have to kind of go out and do the skin in the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.219,
    "end": 2075.22,
    "text": "You have to get in the boat and cross the South Pacific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.0,
    "end": 2081.483,
    "text": "You can be doing the epistemic and the specific as well because you can be taking samples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.683,
    "end": 2081.803,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.204,
    "end": 2087.327,
    "text": " you can kind of see that there's another side to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.387,
    "end": 2096.575,
    "text": "So my question around the when isn't around the ability to see the scale-free part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.055,
    "end": 2109.025,
    "text": "My question is, if I'm a 10-year-old and there's something before the plan, how sophisticated is that something relative to the something before the plan as a 40-year-old?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.225,
    "end": 2118.13,
    "text": " I just don't think that the experiences that a 10 year old has and the resources that they necessarily draw upon are the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.69,
    "end": 2123.113,
    "text": "So I do think there's also a specific and a scale friendly part to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.913,
    "end": 2126.535,
    "text": "Would you push back on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.051,
    "end": 2141.275,
    "text": " I mean, I think that we all kind of just operate on whatever level that, like, I do agree, like, that the knowledge of a 10-year-old isn't the same as the knowledge of a 40-year-old.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.695,
    "end": 2146.777,
    "text": "But I think, you know, we just operate at whatever level that we're at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.817,
    "end": 2150.919,
    "text": "Similarly, like a baby, you know, like, they're just doing their own kind of truth-finding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.179,
    "end": 2152.5,
    "text": "So the process is the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.94,
    "end": 2157.322,
    "text": "Like, even though the priors may differ, I think the process is similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.976,
    "end": 2168.824,
    "text": " This reminds me of in the linguistics guest stream with Elliot Murphy, how there's the view of language as the construct, like subject, verb, object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.325,
    "end": 2172.247,
    "text": "And then there's the language as learned by each learner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.487,
    "end": 2174.889,
    "text": "And so I'm almost hearing like language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2174.949,
    "end": 2177.11,
    "text": " Blue saying it's the same process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.17,
    "end": 2191.52,
    "text": "Everyone's on the same trip, but of course recognizes that each learner is going to have individuated factors, including like what they specifically know, maybe has some correlations or whatever with age or with other features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2192.26,
    "end": 2193.001,
    "text": "And then that's,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2194.252,
    "end": 2199.099,
    "text": " I feel like maybe partially reflected with a specific of the curiosity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2200.742,
    "end": 2206.149,
    "text": "Like if, yeah, is the nine-year-old and the four-year-old learning the same science?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2208.283,
    "end": 2212.866,
    "text": " It's either pan-scientism or uni-solipsism-scientism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.986,
    "end": 2215.107,
    "text": "Everybody's in their own scientific niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2215.488,
    "end": 2217.129,
    "text": "And so it's just a million different granules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2217.429,
    "end": 2227.135,
    "text": "And then the other hand, the other end of that extreme debate would be it's all one integrated extended cognitive process, which I wrote some notes on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.395,
    "end": 2228.396,
    "text": "So Dean, go for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.456,
    "end": 2231.618,
    "text": "And then we'll think about it as more of an extended continuous process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.478,
    "end": 2232.698,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.998,
    "end": 2235.02,
    "text": "And again, I'm not trying to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.007,
    "end": 2238.55,
    "text": " I don't want to sort of shoehorn something in here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.792,
    "end": 2249.981,
    "text": "So I would always hear from people in my history the expression, well, I know that's a problem there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.001,
    "end": 2251.663,
    "text": "I guess you're just going to have to get creative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2251.683,
    "end": 2253.345,
    "text": "You're going to have to think outside the box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.946,
    "end": 2257.049,
    "text": "And being the insurgent and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2258.854,
    "end": 2265.758,
    "text": " non-compliant person that I am, I would come back with, and I was reporting to people, I would come back with, so tell me about this box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.959,
    "end": 2268.38,
    "text": "What makes up the box?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.54,
    "end": 2270.06,
    "text": "What makes up the process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2271.982,
    "end": 2282.187,
    "text": "And of course, that didn't make me very popular because nobody could get specific about what's inside or what makes up that three-dimensional space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.929,
    "end": 2287.951,
    "text": "And I think it's the same thing with we can say, well, there's a process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.746,
    "end": 2297.371,
    "text": " Well, tell me then why a 10-year-old thinks in the same way as a 40-year-old does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.911,
    "end": 2298.532,
    "text": "What evidence?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.992,
    "end": 2303.074,
    "text": "What are you hooking that assumption on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.115,
    "end": 2306.176,
    "text": "And again, I'm not trying to be a pill here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.816,
    "end": 2308.217,
    "text": "I'm really curious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2308.337,
    "end": 2316.202,
    "text": "What would make a 10-year-old think the same way as somebody with an additional 30 years of experience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.861,
    "end": 2319.382,
    "text": " They want uncertainty reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.444,
    "end": 2324.146,
    "text": "That's a generalization that I can agree with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2324.186,
    "end": 2325.527,
    "text": "But what about the specifics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.987,
    "end": 2327.268,
    "text": "I'll give a specific and a general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.769,
    "end": 2332.452,
    "text": "I think that for disciplinary education, some of the questions might be very similar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2332.973,
    "end": 2336.435,
    "text": "Like, why is this leaving group superior to that one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.356,
    "end": 2365.367,
    "text": " in organic chemistry i think if somebody were very precocious and 10 and learning about the halides as leaving groups or if they were learning about it in adult education they would ask that question and then once they got the answer they would have moved on in their learning in that disciplinary finding out way like here's the periodic table here's why the trend is this way so that's not the whole of education but in that mode",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2366.147,
    "end": 2372.993,
    "text": " which many of us have come from and exist within, that was the education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2373.314,
    "end": 2375.215,
    "text": "That's educational instruction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2376.554,
    "end": 2397.658,
    "text": " that's the instructionism component and then i think it becomes different as you move away from that spotlight um so then a few other comments like about the specifics of how the different age would be different um there's the the biology of how the individuals would be different like in uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2399.153,
    "end": 2423.148,
    "text": " some of their cognitive features whatever it meant for that person from working memory to the specific long-term memories and other capabilities they have perspectives they've learned about um they're a different complex system but they can be a complementary part of a system like older people providing mentorship for younger people but i think that's what kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.527,
    "end": 2430.95,
    "text": " comes to some of these notes on science as an extended cognitive phenomena, which is partly what has been got at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2433.291,
    "end": 2436.893,
    "text": "So science has many different possible goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2437.994,
    "end": 2441.595,
    "text": "And sometimes scientists in an ad hoc way will appeal to different components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2441.655,
    "end": 2444.357,
    "text": "Like science is correct because there's technology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2444.837,
    "end": 2446.838,
    "text": "Like it's demonstrable or it's useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2448.478,
    "end": 2451.1,
    "text": "Not always providing a null hypothesis for what we would have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2451.96,
    "end": 2452.98,
    "text": " if we had done something different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2453.581,
    "end": 2457.662,
    "text": "But there's all kinds of different ways to look at it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2457.702,
    "end": 2463.984,
    "text": "But it deals with individual cognitive features and learning and action in their niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2464.625,
    "end": 2467.566,
    "text": "But it also refers to broader phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.766,
    "end": 2473.308,
    "text": "Like maybe a differentiating question is, can one person on an island by themself do science?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2473.928,
    "end": 2479.112,
    "text": " And if the answer is like, yes, they could explore and hypothesis test, then that's one perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2479.472,
    "end": 2491.64,
    "text": "Another perspective would be you're only doing science when you're using this interpretation of the scientific method and you're using science as a body of knowledge, like you're using the literature with the DOIs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2492.601,
    "end": 2503.088,
    "text": "And some people go as far to say that you need to have a career in a certain specific institution or a specific degree or a specific training or approach, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2503.428,
    "end": 2507.51,
    "text": " So that is clearly not applicable to the one person on the island.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2508.471,
    "end": 2513.073,
    "text": "And not that one of them is better, but that whole apparatus that's part of the extended niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2513.773,
    "end": 2519.797,
    "text": "And then also there's, at least in our case, the emphasis on the digital or at least informational stigmergy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.517,
    "end": 2528.701,
    "text": "Like there's a recognition in science in a different way than like there's many books you could read on tying knots, probably a lot of YouTube channels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2531.01,
    "end": 2533.352,
    "text": " Is there a DOI for information on knots?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2534.332,
    "end": 2535.273,
    "text": "Probably not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2536.074,
    "end": 2545.04,
    "text": "But that in science is a big emphasis, reading and writing the literature, at least in the way that we know it today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2545.701,
    "end": 2549.523,
    "text": "But again, that could also perhaps not be as much of a core component.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2550.124,
    "end": 2552.265,
    "text": "Anyways, just like a few points that this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2553.666,
    "end": 2560.532,
    "text": " Maybe now we'll bring it back to this paper, but science is kind of the representational paradigm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2561.152,
    "end": 2565.055,
    "text": "And I think Dean's question is getting at what is before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2565.155,
    "end": 2570.139,
    "text": "What's the before and the after or the subconscious or the submerged of science?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.201,
    "end": 2579.267,
    "text": "And that when we're talking about that representational piece and when we're talking about science, we typically talk in terms of isms, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2580.086,
    "end": 2585.528,
    "text": " what is, where is, how is, when we set up our hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.328,
    "end": 2609.015,
    "text": "And I think what this paper, if we're bringing it back to the paper, I think what section five of the paper speaks to, especially when we're talking about the functional dimension, is the if, the counterfactual, and how they talk in there about how, I'm not sure if it was Clark or Hoey, or one of them talks about the fact that, so a bacteria doesn't typically ask the question, what if,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.293,
    "end": 2639.048,
    "text": " when it's sampling its environment so that's that's pre-science yeah i think that relates a lot to martin boots's uh guest stream i think 12 on the event-based cognition and how if there is an event-based structure to cognitive events then for any given parameter in that model it can be otherwise you could say like the ball is rolling off a table",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2640.424,
    "end": 2641.697,
    "text": " ball is not rolling off the table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2642.714,
    "end": 2644.295,
    "text": " the cup is rolling off the table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.375,
    "end": 2653.541,
    "text": "Like you can start to just do single mutations, especially the important counterfactuals for linguistic structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2654.662,
    "end": 2669.112,
    "text": "And then that might be closer to what we've seen discussed in other Sims papers as the adaptive active inference agent, going back to earlier papers citing that, but just that was our previous discussion with Sims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2669.192,
    "end": 2672.254,
    "text": "This paper has Sims, like the pendulum,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2673.515,
    "end": 2679.119,
    "text": " does not have a counterfactual about whether it could go on a different axis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2679.919,
    "end": 2698.492,
    "text": "It's mechanically constrained, whereas cognitive structures can engage in counterfactual play in a way that the pinball machine can't, even if the pinball machine has chaotic or other types of seemingly agentic behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2699.653,
    "end": 2701.094,
    "text": "And in that context,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.174,
    "end": 2730.179,
    "text": " in that space, I can be at the top of the ski hill prior to a gradient descent, and I can be adaptive, meaning I can close my eyes and do a visualization, and I can also be variational, meaning that I can try to recreate through my proprioceptive sensors a sensation of floating pre-pushing off and engaging with that process, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.339,
    "end": 2731.799,
    "text": "So again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.568,
    "end": 2737.37,
    "text": " The when of this, I think, is something that really matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.41,
    "end": 2746.615,
    "text": "I think we gloss over it or we don't even pay any attention to it typically because we want to get to, in the paper, it's figure two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.675,
    "end": 2747.876,
    "text": "We want to get to figure two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2748.876,
    "end": 2759.982,
    "text": "But I think before there was a figure two, before there was a plan or a representation, we might want to ask when planned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.01,
    "end": 2771.119,
    "text": " If I'm engaging in counterfactual inference prior, then doesn't everything in the diagram depend on prospecting up the nodes in that representation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.921,
    "end": 2780.188,
    "text": "Do I not have to provision up a format that will be potentially something that others can comprehend?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.029,
    "end": 2788.271,
    "text": " as now organized, and don't I have to propose alternative paths as links?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.471,
    "end": 2791.072,
    "text": "All of those things are pre-planned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.552,
    "end": 2795.433,
    "text": "All of those things have to be present pre-science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.814,
    "end": 2811.418,
    "text": "So we can say, well, I'm not paying attention to that now because I'm busy processing something that I can now transfer to other readers and viewers of this diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.978,
    "end": 2821.92,
    "text": " But I think to ignore those things is to ignore the difference between a 10 year old doing a science experiment and a 40 year old doing a science experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.301,
    "end": 2826.161,
    "text": "Let me give one thought on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.501,
    "end": 2831.563,
    "text": "It actually speaks to this question of whether science is the same for everybody or different for everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2832.523,
    "end": 2838.044,
    "text": "Is this the board exactly as laid out that everybody has to play by?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2838.885,
    "end": 2840.065,
    "text": "That's like the game of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2841.065,
    "end": 2863.313,
    "text": " um the board game not the cellular automata simulator but the board game there's one path or there's limited points of agency and then everybody on the board on that layer one is moving through life on the same or on a constrained set of trajectories so it's like are these the immutable railroads of decision making and thought",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.609,
    "end": 2877.499,
    "text": " Or might other people have different connections or different decisions or totally different railroad stops or different dimensionality or just represented in a different format?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2878.843,
    "end": 2884.205,
    "text": " Is it like, well, here are the battle lines that are always going to be the case for philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2884.905,
    "end": 2893.189,
    "text": "And there's going to be some people whose situation and neurodiversity leads them to be on this side or this quadrant or emphasize this component of the regime of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.829,
    "end": 2903.013,
    "text": "Or is even that layer shifting because there isn't any stability to be found in counterfactuals?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2906.374,
    "end": 2906.674,
    "text": "There you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.868,
    "end": 2911.594,
    "text": " Back to the questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2917.83,
    "end": 2926.913,
    "text": " It was a great early point about the rates of change being different, because also that does, at least talking about rates of change, kind of evoke numbers, gets the scientists excited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2927.513,
    "end": 2929.753,
    "text": "Because could there be like a number?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2929.813,
    "end": 2931.234,
    "text": "Could it be a sentiment score?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2931.934,
    "end": 2934.895,
    "text": "Or could it be like this sentence is totally consistent with both?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2935.455,
    "end": 2936.995,
    "text": "Or it's inconsistent with this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.075,
    "end": 2941.817,
    "text": "Could we annotate the literature and measure or do surveys or...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2942.857,
    "end": 2971.032,
    "text": " um actually measure those rates of change in individuals on their learning trajectory or in fields like how could it go from just being a really insightful philosophy paper with a lot of scholarship into being something where we can use some numbers or something so i see the first three columns organization structure and content as the more stable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.932,
    "end": 2979.797,
    "text": " I think you had another diagram where you were showing that going out over longer periods of time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.018,
    "end": 2983.699,
    "text": "So which one do you think is the most rapidly changing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2984.64,
    "end": 2985.06,
    "text": "Functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.122,
    "end": 2989.883,
    "text": "Okay, so let's kind of recap them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2990.964,
    "end": 2999.889,
    "text": "So organizational seems to be related to the encapsulation of the organization, like the architectural structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3000.652,
    "end": 3021.151,
    "text": " features of the world such that the representation is separated from the what is represented so like you could have representation of the sun but then that's very far physically from the sun yeah the structural aspect is related to representational vehicles toot toot that are structurally similar to the state of affairs in the world they stand for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3022.734,
    "end": 3036.682,
    "text": " So that is the abstract structure of the representation having some congruence or isomorphism or like similarity to what is being represented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3037.703,
    "end": 3045.227,
    "text": "This one is super dependent on the definition of representation because someone go, well, you can't represent a car in your head because your head's not a car.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3048.028,
    "end": 3048.769,
    "text": "Content related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.151,
    "end": 3063.233,
    "text": " having internal models that either encode environmental contingencies or sensory motor contingencies, specification or description of how the world is taken to be turned, analyzed in terms of correctness or truth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.666,
    "end": 3068.987,
    "text": " So that seems to be more consistent with the car content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3069.468,
    "end": 3070.968,
    "text": "You know, it's like the YouTube content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3071.308,
    "end": 3076.19,
    "text": "The car content can be represented if it stands for something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.53,
    "end": 3080.472,
    "text": "The content of that message was an invitation to the birthday party.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3080.952,
    "end": 3088.455,
    "text": "So that is related to the information or like the memetics, especially in a actionable way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.878,
    "end": 3098.243,
    "text": " And then the functional role, this is where we're going to highlight and hopefully, Dina, I want to hear a little more about why this one is different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3098.924,
    "end": 3106.008,
    "text": "Supports vicarious use before or in the absence of external events of internal variables of model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3106.149,
    "end": 3109.591,
    "text": "That was discussed in the paper a lot in the context of sensory motor detachment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3111.192,
    "end": 3116.353,
    "text": " And there have been some blurry lines found there for sure, like motor replay and pre-play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3116.734,
    "end": 3134.758,
    "text": "So we know that it is on the spectrum of existing that neural dynamics, but cognitive dynamics involved during are involved, echoes or anticipations of them are involved in the before and in the after, as well as counterfactuals before and after.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3135.399,
    "end": 3140.34,
    "text": "So what is happening with functional representations and then maybe how does it relate to active and FEP?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3141.411,
    "end": 3148.275,
    "text": " Yeah, so I don't I didn't know, I know enough about dreams, and subconsciousness, just just to get me into trouble.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3148.776,
    "end": 3167.928,
    "text": "But the first three, when we reorganize through our dreaming, and whatever those representations are, non representations, depending on your, your wish, those are all backwards looking, typically, and then the functional, that's what segregates it out, it's it's forward and backwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.195,
    "end": 3190.544,
    "text": " So that's, to me, a huge differentiator right there in terms of how much or how long we expect something to stabilize versus how much we want to act on something and generate that change or outcome that we're seeking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3191.364,
    "end": 3197.107,
    "text": "That's why I get back to that search field being different than a framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.363,
    "end": 3207.244,
    "text": " Okay, it's a lot to think about, but it's interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3209.385,
    "end": 3220.509,
    "text": "The organizational, maybe there's some dissenting view from this, but this is related to how the system is arranged.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.289,
    "end": 3226.231,
    "text": "So this one can be thought to be slowly changing because we're talking about things",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.099,
    "end": 3229.221,
    "text": " which means we're talking to something that has persistence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3229.781,
    "end": 3239.908,
    "text": "And so the organizational aspects of systems tend to be the slowest changing perhaps, like the organization of the servers changes on a very slow time scale relative to the processor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3240.891,
    "end": 3249.358,
    "text": " Then the structural aspect, also it's very important that it has persistent, like storing a variable in memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3249.939,
    "end": 3253.301,
    "text": "Like you want things to stand for each other for a long time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3253.501,
    "end": 3257.024,
    "text": "You want the DOI to be a representation of that paper for a long time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3257.865,
    "end": 3259.506,
    "text": "Those are also related to like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3260.529,
    "end": 3277.08,
    "text": " it's sort of the functional side of organization, like form and function a little bit, but I know functional is used later, so not to confuse the term function, but this is related to some of the performative aspects of organization and infrastructure and architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.801,
    "end": 3281.363,
    "text": "So that's also, you don't want the screwdriver to be a different thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3282.384,
    "end": 3306.46,
    "text": " in your hands that's too slow but maybe it'd be cool if you could modify or tweak the tool or like you know unscrew it and bolt something in a little slower to make it different but usually you don't want to change too fast then um but what about the content related this seems to be also changing somewhat faster because environmental or sensory motor contingencies",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3307.486,
    "end": 3309.186,
    "text": " That seems like that could change on the fly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3310.047,
    "end": 3326.171,
    "text": "And then I agree that the functional role as defined here, like vicarious detachment, including counterfactual and self-modeling counterfactuals, this is like some of the most rapidly mutating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3326.611,
    "end": 3328.952,
    "text": "But what do you think about content also changing fast?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3330.247,
    "end": 3339.95,
    "text": " Well, I think whenever I make a mistake and I accidentally hit the delete button on my notes, how upset I get because the stability of the content is lost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.191,
    "end": 3347.933,
    "text": "So I actually see it as still relatively stable as opposed to something that's changing rapidly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.774,
    "end": 3357.556,
    "text": "So these four columns here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3359.127,
    "end": 3365.134,
    "text": " there is a different temporal aspect which relates to what you asked earlier about when representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3365.474,
    "end": 3369.779,
    "text": "So instead of the possessive, do organisms have representations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3370.7,
    "end": 3374.304,
    "text": "Or the identitarian, are organisms representations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3376.059,
    "end": 3378.581,
    "text": " Or the definitional, what are representations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3379.342,
    "end": 3384.125,
    "text": "This is the temporal or the dynamical, when are representations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3384.786,
    "end": 3385.707,
    "text": "Well, that's not complete.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3385.727,
    "end": 3386.667,
    "text": "You have to say what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3386.707,
    "end": 3387.728,
    "text": "You can't just say when it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3388.429,
    "end": 3390.37,
    "text": "Well, couldn't you just flip the words?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.53,
    "end": 3392.912,
    "text": "Wouldn't it be just the other person's perspective?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3394.133,
    "end": 3396.435,
    "text": "You can't talk about is without when.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3397.295,
    "end": 3398.096,
    "text": "So why is that one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3398.476,
    "end": 3398.777,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.077,
    "end": 3401.319,
    "text": "Why are there papers about what is a representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3402.179,
    "end": 3403.44,
    "text": "What is it like to be a bat?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3404.061,
    "end": 3405.642,
    "text": "Rather than when is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3406.972,
    "end": 3410.094,
    "text": " I don't think it has to be, or I think it's both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.955,
    "end": 3423.203,
    "text": "The other thing that I think we need to maybe think about a bit is the first three tend to be on a continuum that's orthogonal to the fourth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.943,
    "end": 3429.847,
    "text": "I can organize, I can structure, and I can content build.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.108,
    "end": 3433.91,
    "text": "Functional now is orthogonal to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3434.03,
    "end": 3434.35,
    "text": "I will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3435.964,
    "end": 3438.326,
    "text": " because it's going, it's used before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.366,
    "end": 3443.289,
    "text": "So again, back to that temporal aspect, it's both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3444.21,
    "end": 3446.691,
    "text": "And I wouldn't drop any of the four columns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.192,
    "end": 3455.758,
    "text": "I'm just saying that I think that the fourth column is maybe on a Y axis relative to the first three that are on the X plane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.244,
    "end": 3458.665,
    "text": " Okay, a few notes here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3459.005,
    "end": 3462.168,
    "text": "So before or in the absence of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3463.329,
    "end": 3470.114,
    "text": "Now, isn't it the case that usually anticipation entails something being both before and in the absence of?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3470.774,
    "end": 3473.396,
    "text": "I wonder what it will be like when my friend comes over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3473.837,
    "end": 3479.241,
    "text": "That's in the absence of the event and it's a counterfactual before, but it may happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3479.281,
    "end": 3480.622,
    "text": "It's a prediction, it's an expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3481.303,
    "end": 3483.504,
    "text": "And maybe even an active inference, it's a preference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3484.625,
    "end": 3499.462,
    "text": " So I agree, like even the way that the authors have written it, these are related to architectural and performative features of like basically functional or structural definitions of representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.356,
    "end": 3519.465,
    "text": " what they are what they do and then this is even uses temporal words as well as counterfactual words though um and those are probably like used elsewhere in the paper but that's a very interesting uh distinction and so it's like there's our map but you know how easy is it to just lay out the map and go all right here's northern california here's a map",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3521.292,
    "end": 3524.054,
    "text": " Instead of the temporal aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3524.774,
    "end": 3531.839,
    "text": "And I think that also shines a light actually on another feature of what people would call science, which is like science, the metric system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3532.987,
    "end": 3562.141,
    "text": " then like okay you've gone too far with the metric time but then pretty much on a lot of the other fronts except in the united states um the metric system has um hold as how people are sense making in terms of like distance and time and other units and that's chronos like like like um chronology and time in the decimal time and then kairos is like the timeliness and there's other ways to think about time so we kind of open it up and it just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3563.895,
    "end": 3566.297,
    "text": " makes me wonder, okay, what else is handed with the map?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3567.257,
    "end": 3568.498,
    "text": "Is there a time object?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3568.698,
    "end": 3571.16,
    "text": "How do we share time along with the map?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3571.24,
    "end": 3572.021,
    "text": "Is that attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3572.581,
    "end": 3578.486,
    "text": "Is focus, times, time, times, all these other things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3579.066,
    "end": 3586.232,
    "text": "So how do we convey the temporal aspect instead of just this gene regulatory network or this is the map here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3587.256,
    "end": 3592.763,
    "text": " or the map and the math and the territory, how do we bring the temporal along?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3594.645,
    "end": 3604.817,
    "text": "So I wonder about the temporal also, and especially now that we're kind of delving into quantum aspects,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.32,
    "end": 3614.122,
    "text": " Because the simultaneous existence of more than one state is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.262,
    "end": 3623.425,
    "text": "And so is it possible to be building and executing your model at the same time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.565,
    "end": 3626.385,
    "text": "Is it input then output?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.485,
    "end": 3627.566,
    "text": "Is it always sequential?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.706,
    "end": 3631.747,
    "text": "Or is there some kind of simultaneous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.206,
    "end": 3634.193,
    "text": " happening, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.233,
    "end": 3635.804,
    "text": "Like that's going on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.844,
    "end": 3636.126,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.259,
    "end": 3641.222,
    "text": " Oh, Blue, that's perfect for the next question I wanted to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.382,
    "end": 3649.527,
    "text": "So is one of the assumptions here that there's a continuum, like if then, between I can and I will?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.547,
    "end": 3658.872,
    "text": "Because this was a debate that I got into with people forever when I was in education, that there's some sort of an assumption that because I can, therefore I will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3659.553,
    "end": 3662.174,
    "text": "Well, I wouldn't jump off a cliff, even with a parachute on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.775,
    "end": 3665.677,
    "text": "There's no will for me to do that because that's just not my...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3666.647,
    "end": 3682.88,
    "text": " It's not my jam, but, but if orthogonally speaking, if, if, if organization is on the, on the X and structural is on the X and content is on the X, but functional is on the Y. Now I can separate the two things out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3683.567,
    "end": 3691.23,
    "text": " And as you said, if I go back to the quantum level, now I'm pre-decision branch in that diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.05,
    "end": 3694.871,
    "text": "Do you notice that the diagram is basically unidirectional?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3695.471,
    "end": 3698.312,
    "text": "It's always heading to a particular outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3698.352,
    "end": 3707.435,
    "text": "It's always, I can make this decision branch moment, therefore I will arrive at representational or non-representational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.196,
    "end": 3708.456,
    "text": "And I'm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3709.594,
    "end": 3715.642,
    "text": " With you, I'm not so sure that previous to this that it isn't bidirectional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.942,
    "end": 3716.984,
    "text": "It isn't functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3717.304,
    "end": 3718.606,
    "text": "It isn't orthogonal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.006,
    "end": 3720.668,
    "text": "I think it could be all three of those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.233,
    "end": 3725.875,
    "text": "Lou, would you like to say anything or can I?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3727.56,
    "end": 3730.623,
    "text": " All right, two points I would be remiss not to make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3730.763,
    "end": 3736.547,
    "text": "First, the tetrahedron and Fuller's synergetics gives us a mnemonic to have four spatial dimensions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3737.068,
    "end": 3742.392,
    "text": "So this four column scheme, all of them can be four intersecting spatial dimensions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3742.752,
    "end": 3744.934,
    "text": "They're coordinated at 60 degrees, not 90 degrees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3745.515,
    "end": 3746.576,
    "text": "And then the second...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3747.236,
    "end": 3768.308,
    "text": " point is like this um one directional maze reminded me a lot of the way that people study decision making and path finding or figuring whichever one may be in ants which is there's some laboratory maze like a y maze or a t maze or maybe some branch on a tree in nature and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3769.389,
    "end": 3798.829,
    "text": " for the purposes of the science so-called the paper it's going to be like we counted them as going down a certain branch making a decision at the node when they went five centimeters past the branch point and didn't return so it's like this is the the line that you trip when it goes from zero to one on that number and that's what gets fed into the scientific uh process and the method the observations the literature and the statistics and all of that but then if you're watching the ant or if you look at the video",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3799.529,
    "end": 3808.134,
    "text": " Maybe they dwell at the node or they turn around or they walk down one and then they come back or like even they go far down one and they come back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3808.575,
    "end": 3815.278,
    "text": "So it is very interesting and it's a subtle graphical point, but one that would be almost seen as like, what do you mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3815.339,
    "end": 3816.899,
    "text": "How could these be undirected edges?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3817.62,
    "end": 3821.002,
    "text": "Well, what if we say, hey, let's start at representational FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3821.582,
    "end": 3823.363,
    "text": "It's just where we're going to start today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3823.383,
    "end": 3827.706,
    "text": "And then let's pull back to the vicarious use of variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3829.011,
    "end": 3830.192,
    "text": " Now, where can we go from there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3830.792,
    "end": 3843.998,
    "text": "To sensory motor detachment, or we can take no, and all of a sudden we're a non-representational FEP because they're only one step away because they're both outcomes of the decision about the vicarious use of variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3844.738,
    "end": 3847.56,
    "text": "So I hope those are some interesting points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3847.6,
    "end": 3852.502,
    "text": "And I think that relates a lot to the discussions that we've been having in EDU about cyclic curriculum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3853.803,
    "end": 3854.603,
    "text": " And you touched on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3855.023,
    "end": 3858.565,
    "text": "I'm going to reduce it, not over-reduce it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.585,
    "end": 3861.286,
    "text": "I'm going to reduce it to your point, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3861.786,
    "end": 3865.967,
    "text": "There can be a yes, there can be a no, and there can be a maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.987,
    "end": 3869.528,
    "text": "And the maybe part is what's being left out of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3871.829,
    "end": 3872.069,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3872.469,
    "end": 3881.512,
    "text": "I'll read a comment from Serval in the chat, who I was also thinking of when we talked about science as a human phenomena and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3881.532,
    "end": 3883.133,
    "text": "I think Serval has a lot to say on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3884.54,
    "end": 3889.741,
    "text": " Serval wrote, considering many world... Hey, Dean, I'm going to read Serval's comment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3890.042,
    "end": 3895.603,
    "text": "Considering many world type theories, is it possible that can entails will?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3896.243,
    "end": 3900.224,
    "text": "It would be a distributional property, though, not a trajectory property.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3906.406,
    "end": 3911.148,
    "text": "Okay, I have to think of that in terms of how I set up entailment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3915.706,
    "end": 3916.066,
    "text": " Maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.247,
    "end": 3919.167,
    "text": "I'm not trying to duck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3919.607,
    "end": 3931.469,
    "text": "I think there will be times when my confidence through my ability to say that I've done something before leads me to a lower threshold around will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3932.71,
    "end": 3934.11,
    "text": "But then sometimes it doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.87,
    "end": 3943.452,
    "text": "So I'm not trying to be evasive, but I can think of times when it can entail, and I can also think of times when it very much does not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.638,
    "end": 3948.94,
    "text": " So will, it's a short English word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3949.641,
    "end": 3952.082,
    "text": "It could refer to something that will happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.883,
    "end": 3957.626,
    "text": "Like the ball will go to the bottom of the bowl unless anything else stops it from doing that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3958.707,
    "end": 3965.371,
    "text": "Or it can refer to sort of that motivational psychological energy, which is related to agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3966.132,
    "end": 3973.357,
    "text": "And so it's kind of an interesting congealed word because agency is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3974.221,
    "end": 3998.978,
    "text": " and will are very related and uh I'm just trying to think if they're positively related like to feel that you have the choice is to have the agency and that can be seen as willpower whereas willpower doesn't come into play in situations where there's no agency if you just need to sit in the seat on the airplane it doesn't require any willpower or agency",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4000.492,
    "end": 4001.953,
    "text": " for that action to occur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4002.593,
    "end": 4026.483,
    "text": "So I'm just thinking about Servel's comment and the distributional property, like counterfactuals, do we engage with them as a possible cosmological reality, like in the many world type theories or just cognitive possibilities so they can be engaged with without taking on like a cosmological meaning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4027.441,
    "end": 4048.901,
    "text": " And then what does that mean about our n equals one trajectory, the specifics of our kind of entity in motion, and then the distribution of perhaps different types of counterfactuals or different kinds of possible stochastic rollouts of the system given really similar starting conditions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4050.848,
    "end": 4052.989,
    "text": " And that's where the will can entail the can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4053.47,
    "end": 4060.695,
    "text": "I can start out by asking what if, but I still have to select the can, the which if.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.735,
    "end": 4075.324,
    "text": "So that's what, again, at some point we can have, we can see a relationship of entailment, but I think as a quantum question, they're orthogonal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4075.724,
    "end": 4079.547,
    "text": "Can and will are not one leads necessarily to the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4082.586,
    "end": 4092.555,
    "text": " So just to kind of, like, play on words and loop back around to what I was talking about earlier, like, can is an affordance, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4092.575,
    "end": 4097.74,
    "text": "Like, so if you have an affordance, like, that doesn't mean that you'll use it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.04,
    "end": 4104.466,
    "text": "And will, like, means I will choose or implies that you have some agency, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.486,
    "end": 4105.367,
    "text": "I choose to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.328,
    "end": 4112.689,
    "text": " not start a fight with a flight attendant while I'm sitting in my seat on the airplane or whatever, because you can do all kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.969,
    "end": 4114.77,
    "text": "You get many affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.25,
    "end": 4124.692,
    "text": "And I just wonder how this ties into these representational and non-representational aspects of the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4124.812,
    "end": 4132.514,
    "text": "Like really when I was talking about free will earlier, if internal states are a direct representation of external states,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4133.455,
    "end": 4137.166,
    "text": " It seems to me like I kind of feel like there's less...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.664,
    "end": 4139.624,
    "text": " options there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.205,
    "end": 4155.75,
    "text": "Whereas internal and external states have coupled dynamics that kind of leaves some like mystical fluff outside, like that I can potentially leverage with my own choice or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.77,
    "end": 4161.332,
    "text": "I mean, I don't know what to call it mystical fluff, but, but it leaves something unsaid, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.352,
    "end": 4168.054,
    "text": "Like there's a coupling, it's like a hidden, there's a hidden states there that like are only that that's where I can impose my will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4169.09,
    "end": 4171.091,
    "text": " Well, I'm going to put that fluff on a pedestal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.931,
    "end": 4185.956,
    "text": "I'm going to honor the fluff because I do think that there are actual times when the ability not to be captured by our observations is actually an advantage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.436,
    "end": 4187.256,
    "text": "So mystical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.656,
    "end": 4187.957,
    "text": "Meh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4188.817,
    "end": 4189.737,
    "text": "Maybe uncertain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4190.637,
    "end": 4190.938,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.238,
    "end": 4194.779,
    "text": "And are there advantages to that at times?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4195.39,
    "end": 4219.983,
    "text": " yes so we can call it fluff but i think sometimes um we don't pay it enough respect i think that relates to the cloud of unknowing which is perhaps a text if somebody wants to go into a more esoteric avenue but i'd like to return to the figure and ask what either of you thought about figure one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4220.703,
    "end": 4224.605,
    "text": " How does that play into this conversation we've been having?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4225.285,
    "end": 4230.788,
    "text": "What does this entity and action partitioning have to do with science?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4231.428,
    "end": 4234.19,
    "text": "Is this partitioning unique to active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4234.71,
    "end": 4236.211,
    "text": "Are other partitionings possible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4239.292,
    "end": 4240.013,
    "text": "Could it be another way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4244.455,
    "end": 4246.516,
    "text": "I think this is a pretty stable representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4247.529,
    "end": 4261.398,
    "text": " And I think it does honor to the scale-free aspects of what the free energy principle is pointing to in terms of a statistical pathway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4265.64,
    "end": 4265.88,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4266.161,
    "end": 4276.367,
    "text": "I mean, how many debates and uncertainties could be prevented by saying this is a representation of an entity and having people know what was meant by representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4279.107,
    "end": 4282.209,
    "text": " Because it's like, I made this representation of an entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4283.05,
    "end": 4284.971,
    "text": "I think it does this useful thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4286.352,
    "end": 4289.113,
    "text": "Those points cannot be false.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4290.875,
    "end": 4292.696,
    "text": "They're assertions by a person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4294.076,
    "end": 4295.998,
    "text": "And what would be disagreed with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4297.099,
    "end": 4298.259,
    "text": " that it's not a representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4298.399,
    "end": 4305.121,
    "text": "Someone could say there's a more useful representation or more good, true, beautiful, simple, but then let's see it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4306.341,
    "end": 4310.442,
    "text": "And then we can use science to compare representations because that would be okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4311.702,
    "end": 4311.922,
    "text": "Right."
  },
  {
    "start": 4313.342,
    "end": 4315.142,
    "text": "And then you said it does honor to the scale free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4315.923,
    "end": 4323.124,
    "text": "So the only thing that kind of hints otherwise is the person and the world kind of gives a scale",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4325.783,
    "end": 4345.869,
    "text": " uh indicator for this model but without that iconography it would uh be and also adding in perhaps a legend or description of what the edges mean because it does say schematic of reciprocal exchanges and it uses statistical vocabulary",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.176,
    "end": 4352.277,
    "text": " but it also uses actual like ontological vocabulary in the terms of actuators.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4353.258,
    "end": 4360.12,
    "text": "So are these the physical things that are doing the actuating or are they the statistical or informational exchanges?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4360.24,
    "end": 4363.921,
    "text": "Or is this the representation, the form of the scientist's model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4364.421,
    "end": 4367.402,
    "text": "So we're only ever talking about scientists using these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4367.982,
    "end": 4372.123,
    "text": "So we're only ever talking about that kind of nexus where we're referring to both loosely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4372.783,
    "end": 4374.004,
    "text": "And so it shouldn't be interpreted as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4376.573,
    "end": 4377.674,
    "text": " either of them specifically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4378.535,
    "end": 4379.536,
    "text": "It's just dialogue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4380.657,
    "end": 4388.463,
    "text": "There's a lot of ways to interpret what the edges are and they might have similar different labelings and different schemes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4389.144,
    "end": 4390.345,
    "text": "But it is statistical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.686,
    "end": 4392.867,
    "text": "It is quantifiable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.631,
    "end": 4397.351,
    "text": "It's amenable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4397.972,
    "end": 4401.275,
    "text": "It's a qualitative topological partitioning that's amenable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4402.463,
    "end": 4405.425,
    "text": " and beyond to certain quantitative analysis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4405.906,
    "end": 4414.752,
    "text": "Like if you can draw it like that, you might be able to do a Bayesian graph and then there's software toolkits and there's implementable algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4415.312,
    "end": 4431.464,
    "text": "And then there might be some quite interesting guarantees or tendencies with certain architectures, for example, to perform predictive processing or to have learning anticipation and memory or to engage in control or anticipatory control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4434.366,
    "end": 4462.917,
    "text": " that's definitely some of the most core iconography that we've seen i mean 50 of papers or what we'll find out blue have the action loop because what what little side hustle of you blue got going here we're trying we're trying to um read more papers together and learn about them okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4463.672,
    "end": 4469.916,
    "text": " But it's interesting how often this has come up and sometimes authors draw on the same image.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4470.156,
    "end": 4471.077,
    "text": "Other times they do different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4471.657,
    "end": 4477.0,
    "text": "And sometimes the arrows are just the clock, like just a unidirectional flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4477.12,
    "end": 4486.746,
    "text": "Other times there are some bidirectional arrows and there are several guest streams on the more technical aspects there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4486.826,
    "end": 4489.588,
    "text": "But let's return to the general questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4489.788,
    "end": 4491.329,
    "text": "Anyways, anything else to say on figure one though?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4491.409,
    "end": 4492.23,
    "text": "Like just on this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4493.291,
    "end": 4496.494,
    "text": " Like, what is this and how does it matter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4496.514,
    "end": 4507.203,
    "text": "I think this represents better the eye fixating on the pot fly than it does on the physics model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.683,
    "end": 4518.453,
    "text": "And so I think it's until somebody, as you said, until somebody comes along with a better representation, one that seems to give us the maximum amount of information that we need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.721,
    "end": 4526.025,
    "text": " versus the maximum that we can handle, I think this is a good rep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4528.366,
    "end": 4531.027,
    "text": "Great and very satisfying conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4531.047,
    "end": 4533.589,
    "text": "Yeah, go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4533.929,
    "end": 4534.189,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.97,
    "end": 4545.255,
    "text": "I really think that what's not shown in this representation and what I feel like is always left out is the fact that the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.376,
    "end": 4548.557,
    "text": " some states are hidden, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.217,
    "end": 4551.298,
    "text": "And so where is the hiding here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.358,
    "end": 4553.92,
    "text": "What is hidden from what in this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.42,
    "end": 4561.764,
    "text": "And so the sensory states, we don't even know if we perceive, I mean, we know that we all perceive temperature differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.224,
    "end": 4564.985,
    "text": "Some people, I'm cold in this room, but many people would be comfortable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.526,
    "end": 4569.528,
    "text": "And some people, my favorite color is purple, my daughter's favorite color is yellow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.068,
    "end": 4573.49,
    "text": "So we don't perceive things in the same way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.21,
    "end": 4579.015,
    "text": " And so there's always something hidden from everyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.055,
    "end": 4581.557,
    "text": "And I think that this schematic kind of leaves that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.918,
    "end": 4587.303,
    "text": "I've seen the hidden states represented well in other action perception loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.883,
    "end": 4593.469,
    "text": "But I think that it's important to recognize what's obvious and what's not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4595.686,
    "end": 4598.148,
    "text": " If I could give one thought there then, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4598.468,
    "end": 4601.871,
    "text": "So I think there's two levels of what are the hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4602.511,
    "end": 4609.476,
    "text": "From the perspective of the internal states, the system of interest, the external states are hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4609.716,
    "end": 4613.899,
    "text": "Implicitly or explicitly modeled, but they're the ones that are never directly observable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4614.56,
    "end": 4615.26,
    "text": "They're only...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4616.101,
    "end": 4623.203,
    "text": " observed through their proxy sensory states and enacted or the transition frequencies are modified through policy selection through action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4623.584,
    "end": 4631.266,
    "text": "So within the model, within the tetrahedra, the hidden states are relative to the internal states on the other side of the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4631.786,
    "end": 4638.169,
    "text": "And then there's like the implicit tetrahedra, which is like us modeling this fourfold partitioning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4638.829,
    "end": 4644.791,
    "text": "And then everything that's not included as a variable in that statistical model is like implicitly a hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4646.596,
    "end": 4647.436,
    "text": " But then what is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4648.477,
    "end": 4650.697,
    "text": "But then we'd have a different model if it wasn't a hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4653.939,
    "end": 4665.843,
    "text": "And the other thing I think is that the vertical line between sensory states and action states, if you tip that 90 degrees, it would look like a blank, even though it has two points on the end of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.263,
    "end": 4670.544,
    "text": "And I think that blank is, by definition, hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.984,
    "end": 4671.925,
    "text": "It's to be filled in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4673.166,
    "end": 4683.271,
    "text": " So I think, again, you can fill in the blank or you can leave it blank and say, because it's blank, that is by definition hidden.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.452,
    "end": 4689.615,
    "text": "So another related point, thanks for bringing that up, Dean, is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4691.041,
    "end": 4709.331,
    "text": " There's one edge that's not shown here, but has featured very importantly in recent discussions on ACT-INF, and that's the sigma or the mapping function from number 26 and number 32, the mapping function of internal states to external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4711.072,
    "end": 4722.534,
    "text": " Look at Axel Constant and Jelle Bernberg's work to think about how the niche is also doing like anticipatory modeling of the individual, so the other way, but let's just focus on the entity and its mapping to external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4722.954,
    "end": 4728.275,
    "text": "It's predicting external states, or at least acting as if, or can be modeled as if.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4728.696,
    "end": 4732.636,
    "text": "So there is an edge there that we've seen in modern work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4733.517,
    "end": 4739.778,
    "text": "It's not drawn here, which actually might suggest either the inheritance of a legacy graphical pattern or some,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4741.937,
    "end": 4744.979,
    "text": " preferences or conclusions about what these edges do represent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4745.32,
    "end": 4746.761,
    "text": "Again, even though they're unlabeled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4747.121,
    "end": 4749.603,
    "text": "So that's one edge that we've been hearing more about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4750.143,
    "end": 4756.248,
    "text": "And then I think another edge that Dini just highlighted is this one directly between sensory and action states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4757.949,
    "end": 4760.591,
    "text": "And again, the clock flow doesn't have this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4761.272,
    "end": 4767.696,
    "text": "The one that's just internal action, external sense, that doesn't have the sense action bridge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4769.037,
    "end": 4769.158,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4769.921,
    "end": 4786.591,
    "text": " It depends a lot on what these things mean, but it'd be cool to understand what is meant by the backwards connections, as well as by the vertical connections, and why are there not backwards connections",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4787.881,
    "end": 4791.022,
    "text": " between action and internal and sensory and external.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4791.422,
    "end": 4796.564,
    "text": "It's like, it's really a four by four matrix with some connections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4797.124,
    "end": 4803.366,
    "text": "And that's how we've seen it represented as the sparse connectivity matrix in number 32.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.586,
    "end": 4813.349,
    "text": "And thinking about the way that we model complex systems and generate approximations that sometimes can also retain some other features like the highly operative exponent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4813.969,
    "end": 4815.65,
    "text": "So some thoughts there, Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4816.502,
    "end": 4822.889,
    "text": " So we've definitely seen internal states and sensory states, like that reciprocality happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4824.231,
    "end": 4830.478,
    "text": "But I do, I always wonder why, like, especially since we did the mental action paper, like how...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.679,
    "end": 4856.481,
    "text": " action states don't influence internal states and so for me like when you take action like when you practice playing the piano that affects your internal states totally like not just through external states or even mental action like where you're doing nothing with external states it's entirely internal um and so i always wonder why that action and internal um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.802,
    "end": 4864.204,
    "text": " But I less so wonder why there's not a reciprocal loop between external states and sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.184,
    "end": 4868.265,
    "text": "Like I never want the sensory states to go back to the external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.026,
    "end": 4871.566,
    "text": "For me, that doesn't make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4871.766,
    "end": 4873.987,
    "text": "And maybe you guys have an example where it does make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.447,
    "end": 4878.628,
    "text": "But I always want the action and internal states to loop together to have it bidirectional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.148,
    "end": 4885.871,
    "text": " Here's one possibility on the sense back to external, but it depends of course on a specific interpretation of those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4886.911,
    "end": 4889.933,
    "text": "A photon, let's just assume it's out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4890.693,
    "end": 4891.594,
    "text": "It hits the retina.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4892.314,
    "end": 4904.861,
    "text": "If we talk about the retina as a sense state, using it very loosely, not the statistical variable correlating to the sense state, but the actual retina, it's the absorption of the photon that changes the niche",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4905.939,
    "end": 4906.74,
    "text": " to be sensed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4907.22,
    "end": 4911.923,
    "text": "Like if you're going to be sensing molecules from the ants' cuticle, you have to take some.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4913.124,
    "end": 4920.709,
    "text": "You could sense from the ground, the ones that have already been deposited, but if you want some from the thing, you have to take a sample.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4921.709,
    "end": 4933.037,
    "text": "And so that may, whether that would be better understood as being an action in the niche is another question, but like you do have to change the external state to be half skin in the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4934.221,
    "end": 4938.284,
    "text": " No, and I just thought of it as you're saying that, like the observer phenomenon, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4938.344,
    "end": 4941.067,
    "text": "Like, so there's that too, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4941.167,
    "end": 4943.108,
    "text": "Just the act of sensing it changes it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.229,
    "end": 4947.072,
    "text": "Or is the observer phenomena, does that come from sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4947.932,
    "end": 4951.055,
    "text": "Does that come from internal states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4951.515,
    "end": 4952.896,
    "text": "Does it come from action states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4953.497,
    "end": 4959.242,
    "text": "Are the observers just acting in a way that might fit in within an action state?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4959.262,
    "end": 4961.764,
    "text": "But those are really interesting questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4961.964,
    "end": 4962.124,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4963.931,
    "end": 4964.993,
    "text": " No, I just think you're right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.033,
    "end": 4970.383,
    "text": "I think both of you are... We're getting closer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4970.403,
    "end": 4974.271,
    "text": "I don't think we'll ever fly directly into the sun, but we're getting warmer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4975.703,
    "end": 4998.002,
    "text": " yeah this uh we'll have another few minutes to talk this has been a really great discussion and i look forward to like re-listening to it and discussing more then of course feel so appreciative that we'll have a dot too as well so we can return to some of our early ones free will maybe save it for the dot too or if we want to talk about it now",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4999.554,
    "end": 5002.576,
    "text": " I think we've blurred and fuzzed some of these lines a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5002.957,
    "end": 5004.258,
    "text": "So we did kind of get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5004.558,
    "end": 5006.259,
    "text": "Let's see what else we had down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5006.299,
    "end": 5010.903,
    "text": "And of course, if anyone in the last 30 minutes has any questions they want to write.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5011.203,
    "end": 5014.986,
    "text": "So Steven wrote, I like your method to work backwards in the flow diagram.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5015.426,
    "end": 5016.147,
    "text": "Start at...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5016.787,
    "end": 5032.382,
    "text": " representative or non-representative assumptions or perhaps conclusions like starting at those endpoints as assumptions then looking for prediction errors in our action perception this maintains uncertainty in ways that does not happen when following the causal effective correlations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5036.718,
    "end": 5038.019,
    "text": " That's sort of like 20 questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5038.079,
    "end": 5042.724,
    "text": "It's framed as a game of... Oh, I'm sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5042.744,
    "end": 5045.507,
    "text": "I didn't know that mentioning common children's games was funny.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5047.049,
    "end": 5051.774,
    "text": "That's framed as a game of going from the most uncertain towards more certainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5052.234,
    "end": 5054.617,
    "text": "Like if you were asking uninformative questions...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5056.727,
    "end": 5084.325,
    "text": " what are you doing if you're not if you're just getting like and that's information theory kind of exemplified you're reducing the set of what you can be um guessing with the preference to like win within 20 questions and then this is as steven is pointing out kind of the other direction but then what does that look like and that is almost inflating uncertainty at least in the information theory sense",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5086.192,
    "end": 5088.913,
    "text": " So here's Steven's question, and then either of you, if you have a thought on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5090.774,
    "end": 5097.757,
    "text": "Do we model the temporal lags in dynamical change between sensory state in relation to changes in action state?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5101.999,
    "end": 5112.724,
    "text": "So maybe a related question would be, how do time scales and temporal lags play into our modeling of action, perception, and cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5115.512,
    "end": 5119.979,
    "text": " This is why I kept saying to young people, when in doubt, zoom in, zoom out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5119.999,
    "end": 5129.773,
    "text": "And it wasn't just zoom in, zoom out in a sort of a, in a visual sense, you have to zoom in and zoom out on a temporal sense as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5130.114,
    "end": 5131.256,
    "text": "You have to think about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5132.998,
    "end": 5150.084,
    "text": " You have to think about the unit of analysis, both as an object, but also the length of time something can remain stable or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.144,
    "end": 5159.087,
    "text": "I don't think we're naturally inclined to include the timeframe as much as we're inclined to include the, did it change?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.668,
    "end": 5160.268,
    "text": "Did it float?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5161.53,
    "end": 5162.171,
    "text": " Did it burn?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5162.351,
    "end": 5162.771,
    "text": "Whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5163.272,
    "end": 5166.154,
    "text": "Whatever it is that we're waiting to see what happens next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.715,
    "end": 5170.398,
    "text": "We don't tend to give as much attention over to how long did it take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5174.022,
    "end": 5180.764,
    "text": " I'll give a complimentary thought, which is more related to the kinds of models that we've specifically seen in ACT-INF.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5181.104,
    "end": 5184.766,
    "text": "So the deep temporal models or sophisticated active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5185.546,
    "end": 5192.108,
    "text": "In, for example, a three time step model, at time step one, it's doing inference on one, two, and three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5192.528,
    "end": 5195.409,
    "text": "That's planning as inference and anticipation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5196.03,
    "end": 5202.292,
    "text": "At time step three, it can still be calculating the model in light of incoming evidence about time step one, two, and three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5203.112,
    "end": 5210.795,
    "text": " which is related to memory and learning and all these other sorts of so-called backwards looking types of inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5210.815,
    "end": 5221.16,
    "text": "So there's like anticipation, there's now casting, and then there's reconstruction of your recent and long-term past and how that's related to identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5221.62,
    "end": 5222.761,
    "text": "So I think that the question",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5224.066,
    "end": 5229.648,
    "text": " Do we, or how do we model the temporal or just the temporality of sense and action states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5230.308,
    "end": 5236.311,
    "text": "The answer from model-based science is what's the time horizon parameter on the model that we ran?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5237.071,
    "end": 5238.171,
    "text": "Oh, it was 15 days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5238.191,
    "end": 5239.212,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5239.652,
    "end": 5243.813,
    "text": "Well, then we modeled the temporal lag up to 15 days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5244.674,
    "end": 5245.914,
    "text": "And that is what we modeled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5246.895,
    "end": 5249.556,
    "text": "And that is sort of where the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5251.152,
    "end": 5255.115,
    "text": " Scale-free becomes the scale-friendly becomes the scale-specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5255.976,
    "end": 5265.364,
    "text": "And then that's the most that it contracts down to is that one specific model as deployed by those researchers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5268.606,
    "end": 5269.687,
    "text": "Here's another question from Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5271.929,
    "end": 5274.451,
    "text": "When do we sense and when do we act?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5275.111,
    "end": 5276.753,
    "text": "When do our sense states update?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5277.073,
    "end": 5278.614,
    "text": "When does our generative model update?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5278.954,
    "end": 5280.436,
    "text": "And when do our action states update?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5281.451,
    "end": 5288.053,
    "text": " I'll start with the model-based science one, which is, again, it would just be the specifics of how the pseudocode and the actual computer code were written.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5288.594,
    "end": 5289.994,
    "text": "Which line of code updates first?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5290.354,
    "end": 5293.135,
    "text": "That's the narrow answer, but what about a more broader answer?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5297.757,
    "end": 5299.318,
    "text": "Does it depend on how open we are?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5299.338,
    "end": 5310.362,
    "text": "How confident we are in staying in an uncertain, non-specific,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5311.71,
    "end": 5317.553,
    "text": " space and can we necessarily know going in how long that will be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5317.573,
    "end": 5319.534,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5319.934,
    "end": 5320.775,
    "text": "I don't know how long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5322.163,
    "end": 5324.124,
    "text": " And what about precognition, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.144,
    "end": 5329.808,
    "text": "Like if we, you know, expand to that possibility, like I knew that was going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.888,
    "end": 5331.589,
    "text": "I mean, that happens to all of us, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.609,
    "end": 5333.951,
    "text": "We all experience that, like, oh, I knew that was going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.971,
    "end": 5340.555,
    "text": "Like if I, you know, step on this ice cube, it's going to, like this ice pile, it's going to crack through to water or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.615,
    "end": 5341.516,
    "text": "Like I knew that was going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5341.856,
    "end": 5345.879,
    "text": "So we're able to kind of perceive things before they happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5345.919,
    "end": 5351.263,
    "text": "And so, I don't know, like, is there not necessarily the temporal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5352.704,
    "end": 5357.848,
    "text": " separation, this makes me think back to Shanna Dobson and the flattening of the time diamond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5358.729,
    "end": 5367.177,
    "text": "So really, is it necessary that there's sequence here, or can it just all be happening simultaneously?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5367.497,
    "end": 5369.799,
    "text": "That kind of relates to what I was asking earlier, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.02,
    "end": 5371.741,
    "text": "Is there some kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.421,
    "end": 5376.123,
    "text": " simultaneous update sensing action possibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5376.143,
    "end": 5387.528,
    "text": "And I think that there is, I mean, I don't think that, um, not, not in a computational model because, you know, code just runs like it is, but, um, I think in our model it's possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5390.049,
    "end": 5413.122,
    "text": " okay one more general and then more specific comment the 4d spatial model tetrahedral synergetic geometry you have space and time four dimensions spatially represented rather than the xyz you have three spatial dimensions and then there's like the special question of how does t come into play so some is known there and some is not known there but when and where and how are of course very linked",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5414.102,
    "end": 5420.827,
    "text": " And if we take model-based science seriously, then they're also very enabled and constrained by the kinds of models we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5421.267,
    "end": 5423.709,
    "text": "So maybe it's related to how we think about geometry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5424.529,
    "end": 5432.195,
    "text": "And then the sense and action, are they continuous or are they discrete?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5433.419,
    "end": 5455.081,
    "text": " we've seen recently dacosta at all like the synthesis of active inference on discrete state spaces and then we've also seen some of uh alex chance's work on the continuous control settings with like the mountain car which is not just um the discrete case so it's just interesting to see how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5458.211,
    "end": 5466.898,
    "text": " Some of the theory goes out in front, and then there's parallel lines of mathematical development with continuous and discrete modeling, like digital and analog modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5467.438,
    "end": 5475.964,
    "text": "And sometimes those types of modeling scientifically are very well reconciled, and other times they result in pretty fundamentally different patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5476.705,
    "end": 5484.911,
    "text": "Like there are certain equations where the discretized form or the version that's computed without really high precision numbers on a computer has really different behavior patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5485.091,
    "end": 5501.18,
    "text": " than the other kinds of models which gets at the importance of thinking about how the model is is framed and then also applied because like if the precision of the processor matters for what the paper discovers then shouldn't that be a part of the consideration",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5508.228,
    "end": 5511.991,
    "text": " Okay, here's a few of the other comments for 36.1.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5512.872,
    "end": 5515.334,
    "text": "So by the way, we'll write down any other questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5515.414,
    "end": 5523.241,
    "text": "So if anyone in the last few minutes has some questions, they can ask, and we'll be just writing things down, getting excited for .2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5523.942,
    "end": 5528.065,
    "text": "And if anybody wants to join who wasn't here today, they're also very welcome to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5532.329,
    "end": 5534.971,
    "text": "How is representation related to autopoiesis?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5536.246,
    "end": 5541.727,
    "text": " So Refresher, autopoetic system is capable of producing and maintaining itself by creating its own parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5544.108,
    "end": 5556.912,
    "text": "So how does representation differ or does it differ for a system that is just engineered and secreted into the niche like a computer versus potentially something that is reassembling its parts continually?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5556.972,
    "end": 5558.312,
    "text": "Why does that matter if it does?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5570.318,
    "end": 5573.041,
    "text": " Is that a thing to look at in point two, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5573.681,
    "end": 5575.002,
    "text": "That sounds good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5575.262,
    "end": 5592.236,
    "text": "Not trying to push it on, but I mean, the reality is that we can take each of the different segments, the organizational, the structural, the content related, and then put them through the autopoetic grinder and see what pops out the other side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5592.556,
    "end": 5592.796,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5593.297,
    "end": 5594.157,
    "text": "Great suggestion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5594.238,
    "end": 5595.719,
    "text": "Apply this to the four columns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5595.739,
    "end": 5597.78,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5598.826,
    "end": 5622.743,
    "text": " what other things would be fun to discuss in dot two or what else can go through the four column grinder or what would be any other question that any of you have in the in the in the point two also if we can we can spend a little bit of time on some of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5624.028,
    "end": 5649.727,
    "text": " some of the comments that were in the section five of the paper specifically around how we face state from potentially they didn't say that this is true but they said if if this claim is true we could be faced stating from non-representational to representational maybe maybe could we spend a little bit of time not just looking at the autopoiesis aspect of that but how does",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5651.055,
    "end": 5656.76,
    "text": " How does that density form in relationship to this idea of modeling ourselves?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5658.501,
    "end": 5659.062,
    "text": "Great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5659.823,
    "end": 5662.445,
    "text": "Here's a question that Steven wrote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5662.505,
    "end": 5666.829,
    "text": "So feel free to give a thought on it or we can push it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5667.99,
    "end": 5677.678,
    "text": "It was, will robotics or neuro phenomenology help most in testing these complex temporal dynamics in a realist way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5683.174,
    "end": 5689.86,
    "text": " I'm just going to say that's a great question, and I think we need the person who asked the question to come on and chat with us about that a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5693.123,
    "end": 5694.765,
    "text": "We're just delegating so hard here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5695.005,
    "end": 5695.646,
    "text": "Blue, go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5697.344,
    "end": 5710.591,
    "text": " So something that I've brought up, I think in the dot zero is like, I would really like to tease apart the similarities and differences between like structural aspects and content related aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5711.191,
    "end": 5718.835,
    "text": "I'm not entirely certain, like that's a fuzzy blurred line for me there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5718.995,
    "end": 5721.396,
    "text": "So maybe we could get into that a little bit more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5721.416,
    "end": 5723.317,
    "text": "I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5723.477,
    "end": 5724.558,
    "text": "It's fuzzy for me too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.434,
    "end": 5727.635,
    "text": " These are awesome questions too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5728.476,
    "end": 5729.456,
    "text": "Thanks for writing this all out, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5729.697,
    "end": 5731.638,
    "text": "Well, we have multiple pages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5731.658,
    "end": 5740.345,
    "text": "So we have autopoiesis from non-rep to rep and back and forth or whatever else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5740.385,
    "end": 5742.946,
    "text": "How does that form in the context of self-representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5744.348,
    "end": 5746.429,
    "text": "I think there's a few Hamlet quotes that'll come into play there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5747.07,
    "end": 5749.692,
    "text": "Then Stephen's question about technology and realism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5752.554,
    "end": 5753.995,
    "text": "Structural and content aspects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5755.532,
    "end": 5760.976,
    "text": " Detached representations in the neurobehavioral systems in the sensory motor loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5764.639,
    "end": 5765.599,
    "text": "Niche modification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5766.54,
    "end": 5768.421,
    "text": "Stigma G in the digital case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5768.501,
    "end": 5774.686,
    "text": "Extended cognitive systems that include digital and mirror adaptive systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5776.707,
    "end": 5778.929,
    "text": "Steven's singing 80s songs in the chat, I believe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5780.63,
    "end": 5782.772,
    "text": "Thinking through other minds in multi-scale integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5783.312,
    "end": 5784.313,
    "text": "One of Sims's other papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5785.523,
    "end": 5786.463,
    "text": " How are they related?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5788.004,
    "end": 5790.964,
    "text": "Does the FEP exist independently or only in the mirror?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5790.984,
    "end": 5794.545,
    "text": "A lot of ways to answer that one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5797.386,
    "end": 5809.789,
    "text": "One part we could look into now or maybe in the dot two would be the expected free energy and variational free energy and how they play different roles in the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5812.523,
    "end": 5834.561,
    "text": " are also some things like if people are watching live or in the next few days then they can write a comment on it or get in touch with us or like if they want to submit a question or they can come on and discuss it in the dot too variational and expected free energy there's a lot of parts to the paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5836.01,
    "end": 5837.952,
    "text": " Oh, and action-oriented representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5838.072,
    "end": 5844.677,
    "text": "We didn't get to that slide in the dot zero, but just what is action-oriented representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5844.977,
    "end": 5852.143,
    "text": "We've talked about representations today, but then did we talk about, were we implicitly talking about action-oriented representations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5852.763,
    "end": 5853.764,
    "text": "Are those a subclass?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5854.444,
    "end": 5855.065,
    "text": "How are they different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5866.485,
    "end": 5866.985,
    "text": " Any other?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5867.085,
    "end": 5867.765,
    "text": "Yeah, blue, blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5868.525,
    "end": 5879.688,
    "text": "In our system, in human cognition, there are some hard-coded representations that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5879.848,
    "end": 5886.609,
    "text": "Action-oriented may be one of them, like kinesthetic memory and also visual recognition systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5886.729,
    "end": 5894.451,
    "text": "And it's really interesting that... And perhaps easy to apply the FEP to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5895.777,
    "end": 5924.051,
    "text": " specific cognitive systems like subsystems but it's really much more difficult when we have like multiple competing processes like we're not just playing the piano and we're not just looking at the piano keys like we're doing both of those things at the same time and lots of other things like we might be you know having some memory of one time that we heard the song that we're playing or something like that so it's really interesting to think about um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5925.49,
    "end": 5929.071,
    "text": " representation and all the ways that it exists also even in memory, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5929.091,
    "end": 5937.813,
    "text": "Like the memory representation is, it's like a, it's not, that's not a hard coded thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5937.853,
    "end": 5941.875,
    "text": "It's really squishy and it's subject to change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.975,
    "end": 5950.877,
    "text": "And, you know, we might remember a situation like you can tell me your phone number right now and I'll remember it, you know, in five minutes, but in five days, no, like, or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5951.397,
    "end": 5952.978,
    "text": "So I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5953.178,
    "end": 5954.098,
    "text": "It's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5954.878,
    "end": 5963.942,
    "text": " to think about the FEP and how it can apply in this overarching way where there are multiple competing goals and priorities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5964.322,
    "end": 5967.263,
    "text": "And yeah, that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5968.783,
    "end": 5974.666,
    "text": " One thought, I hope I'm not misrepresenting an empirical result, was in fruit fly, the Drosophila.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5975.486,
    "end": 5982.61,
    "text": "They found that short-term memories didn't require protein synthesis, like just second to second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5983.07,
    "end": 5988.093,
    "text": "Some sound or some symbol could be associated with a preferred or repulsive outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5989.193,
    "end": 5993.556,
    "text": " But preventing protein synthesis blocked the consolidation of memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5993.977,
    "end": 5996.378,
    "text": "And perhaps that's similar to other systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5996.438,
    "end": 6006.465,
    "text": "And so there's kind of like the resonant neural structures that are just using the system's connections as they are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6006.485,
    "end": 6010.688,
    "text": "That's sort of one perhaps faster mode of cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6011.209,
    "end": 6012.93,
    "text": "That's like running around figure two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6013.851,
    "end": 6017.153,
    "text": "And then there's a restructuring mechanism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6018.263,
    "end": 6045.95,
    "text": " that requires changing the model like structure learning but that also connects to realism because we're talking about the synapses and the neurogenesis like of specific cells that could be maybe measured and then the neurophysiology and the behavior can be observed as well if we have integrative frameworks like actinth so like it also relates to dean's comment about the scales the time scales of change",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6047.243,
    "end": 6051.81,
    "text": " Neural circuits cannot be changing at a timescale faster than neural firing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6052.411,
    "end": 6061.163,
    "text": "So how does the spiking component or the other sensory transduction or other chemical components, how do those overlapping timescales coordinate?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6062.771,
    "end": 6075.096,
    "text": " This reminds me too, Daniel, of something that we talked about, like the very first time we met, because it was a recent experiment at that time about the memory transfer between snails via injection of RNA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6076.436,
    "end": 6080.858,
    "text": "So that was like an interesting possible memory storage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6081.938,
    "end": 6089.721,
    "text": "And I'm not sure what else has developed from that, but also we've talked about ants and how they leave like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6090.741,
    "end": 6098.505,
    "text": " like you told me like that they're just throwing up RNA, like they're throwing up all the time, all over the place and like maybe leaving chemical like RNA traces for each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.945,
    "end": 6099.905,
    "text": "We talked about that too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6099.945,
    "end": 6107.448,
    "text": "So maybe, I don't know if you wanna expand on that or does that tie into this protein synthesis thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6109.289,
    "end": 6117.773,
    "text": "One thought on that, it was a recent ant paper where basically the act of mating, which we won't describe on this family friendly discussion,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6119.102,
    "end": 6144.986,
    "text": " directly infuses neurotransmitters into the recipient and that changes their behavior and induces all these other hormonal changes and so the realism of cognition like the embodiment and the physicality of these systems it is perturbable by infusions of neurotransmitters in other neural systems and in us so that's sort of where realism can't be eradicated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6145.896,
    "end": 6152.759,
    "text": " amidst all of these representations because things do hit our head and molecules do diffuse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6152.799,
    "end": 6154.04,
    "text": "It's kind of like grounding it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6154.78,
    "end": 6166.686,
    "text": "And that's, I think, why it's such an interesting and integrative area with a lot of contention because the 4E side is holding down that real side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6168.367,
    "end": 6174.19,
    "text": "And then the science side, so-called, is holding down the abstractions and the representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6175.103,
    "end": 6181.388,
    "text": " And then cognitive science, especially as applied to humans, is kind of where it meets in the middle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6181.408,
    "end": 6187.513,
    "text": "It's like, well, yeah, you're talking about embedded cognition and inactive cognition, but that's your cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6188.253,
    "end": 6189.114,
    "text": "That's modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6189.895,
    "end": 6202.825,
    "text": "And so then you get all kinds of fun viewpoints and ideas because of how mixed and complex that area is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6208.226,
    "end": 6214.728,
    "text": " Thanks Blue and Dean and those who participated in chat for this really great discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6215.308,
    "end": 6227.07,
    "text": "I hope you can digest it and learn in the next week and reflect on some of these questions and that anyone can ask more questions or start to prepare some thoughts so that they can also be involved because this was really fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6228.991,
    "end": 6229.191,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6230.031,
    "end": 6231.031,
    "text": "We've got one question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6231.231,
    "end": 6231.471,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6231.491,
    "end": 6232.592,
    "text": "Statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6235.307,
    "end": 6241.661,
    "text": " Every one of these live streams, I don't know ultimately how it's decided which order that we do them in, but the fact that we've gone",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6242.483,
    "end": 6256.232,
    "text": " from Connor's paper to Majee's paper to this one, whether it was done with some sort of intent and looking back, allow back to the future, or it was just, okay, well, I think we'll do this one next and see what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6256.672,
    "end": 6267.659,
    "text": "I think the order of these last three papers in particular has been pretty, just the order in which we've looked at them has generated a whole bunch of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6268.556,
    "end": 6294.097,
    "text": " interesting ideas including sort of the the idea of intransitivity in the last paper now potentially influencing how we've discussed this paper so again i don't know how much pre-thought goes into that but if there was some pre-thought that went into putting these papers in this particular order um it's been very uh helpful and one other thing if uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6295.58,
    "end": 6299.723,
    "text": " If I find something happy because it's true, I'm going to laugh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6300.483,
    "end": 6306.967,
    "text": "And if I find something happy because it's playing a game like 20 questions or any game, I'm going to laugh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6307.347,
    "end": 6319.235,
    "text": "So if I can't enjoy and really appreciate the sophistication of the conversation here, I probably wouldn't show up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6319.315,
    "end": 6320.896,
    "text": "So thanks to both of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6321.716,
    "end": 6324.378,
    "text": "You can make me read active papers, but you can't make me have fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6326.109,
    "end": 6335.812,
    "text": " But just to give it one closing answer, information for anybody who wants to like get involved with the discussions, here's our coda for the .coms unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6336.332,
    "end": 6340.394,
    "text": "And so here's the live stream table, the one that gets represented on the viewable public one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6341.074,
    "end": 6348.196,
    "text": "So we have all the papers planned, like in this case up till 37, 38, 39, 40, up through the end of March.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6348.617,
    "end": 6355.399,
    "text": "So we try to plan the papers in advance so that people can have time to read them and commit to collaborating on the .zero background video.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6355.999,
    "end": 6374.716,
    "text": " and then we have papers to potentially discuss and so here people add papers and then they click a heart and Dean we just sorted by hearts and then we picked the papers that were on the four top papers and we said okay we're going to read these four for um 36 7 8 9 um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6379.09,
    "end": 6380.331,
    "text": " Yeah, those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6381.031,
    "end": 6387.194,
    "text": "And then we emailed the authors of different papers and we said, well, what dates might work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6387.294,
    "end": 6391.796,
    "text": "Because we always will prefer to schedule a paper that we want to read when the authors want to join.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6392.156,
    "end": 6401.201,
    "text": "And so that's kind of our first, like the way that we pull papers out, like we set the dates for the quantum free energy discussions in March.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6401.781,
    "end": 6406.103,
    "text": "And then we work backwards from there and then just try to not do too...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6409.13,
    "end": 6418.175,
    "text": " not even overlapping papers, just try to provide rhythm and novelty and philosophy and technical details.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6418.216,
    "end": 6425.44,
    "text": "So it's sort of a local decision-making based upon the votes that people provide who are participating in the dot coms unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6426.721,
    "end": 6427.521,
    "text": " And pretty random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6427.882,
    "end": 6429.382,
    "text": "Yeah, and just what people surface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6429.663,
    "end": 6433.184,
    "text": "I was going to say, that's a pretty serendipitous order then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6433.285,
    "end": 6434.205,
    "text": "That's fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6434.685,
    "end": 6435.946,
    "text": "It's fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6436.066,
    "end": 6442.289,
    "text": "And if anybody watching or listening wants to suggest a paper for the live stream, please do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6442.75,
    "end": 6442.97,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6443.87,
    "end": 6444.13,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6444.591,
    "end": 6445.651,
    "text": "Thank you, Dean and Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6445.951,
    "end": 6448.333,
    "text": "So see you all next week for The Dot 2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6448.733,
    "end": 6448.893,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]