[
  {
    "start": 27.022,
    "end": 28.322,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 28.983,
    "end": 31.163,
    "text": "This is Act-Inf Lab live stream number 36.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 31.343,
    "end": 35.484,
    "text": "It's January 26th, 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 37.485,
    "end": 39.145,
    "text": "Welcome to Active Inference Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 39.906,
    "end": 46.067,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 46.648,
    "end": 48.688,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 49.848,
    "end": 55.05,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 56.294,
    "end": 61.918,
    "text": " All backgrounds and perspectives are welcome, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 63.459,
    "end": 77.77,
    "text": "Check out activeinference.org if you want to learn more about what Active Lab is up to, or if you want to participate in any of the activities, which include live streams in the communications organizational unit, but a ton of other stuff is happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 79.704,
    "end": 99.874,
    "text": " today in 36.2 our third discussion on 36 we're going to continue to learn and discuss this paper by sims and pizzulo 2021 modeling ourselves what the free energy principle reveals about our implicit notions of representation and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 101.069,
    "end": 109.053,
    "text": " We're going to have a nice jumping off dot two as we do and have some questions written down and prepared.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 109.793,
    "end": 111.874,
    "text": "Other things will spontaneously arise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 112.035,
    "end": 117.317,
    "text": "And if anyone watching live wants to just write a question in a live chat, we can also address that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 119.178,
    "end": 121.259,
    "text": "We'll start with an introduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 121.92,
    "end": 124.001,
    "text": "So we'll go around and introduce ourselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 124.844,
    "end": 135.008,
    "text": " People can say anything they want, and they can also add just what got them excited about the paper in general or for this DOT2 discussion specifically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 136.068,
    "end": 137.409,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 137.649,
    "end": 139.07,
    "text": "I'm a researcher in California.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 141.687,
    "end": 154.104,
    "text": " Just excited to see how this representation discussion influences our own self representation and that at the individual and the lab scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 154.906,
    "end": 157.289,
    "text": "Moving forward, I'll pass it to Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 161.186,
    "end": 161.967,
    "text": " Hi, I'm Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 162.187,
    "end": 165.149,
    "text": "I'm an independent research consultant in New Mexico.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 165.849,
    "end": 173.934,
    "text": "And I am excited by this paper because in our previous discussions we're, as usual, left with more questions than answers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 174.535,
    "end": 183.941,
    "text": "And also I kind of am finding myself swayed by the different representational, structural, content-driven, non-representational",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 184.361,
    "end": 185.643,
    "text": " like these different arguments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.763,
    "end": 187.665,
    "text": "And I just find them very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 187.685,
    "end": 197.074,
    "text": "And I just want to know if at the end of this, if I'll be swayed more or less in certain directions, or maybe just be more open to other interpretations of FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.795,
    "end": 199.457,
    "text": "And I will pass it to Danielle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 202.386,
    "end": 203.507,
    "text": " Hello, I'm Danielle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.547,
    "end": 207.89,
    "text": "I'm a cognitive scientist at Google with a background in language evolution, language development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.731,
    "end": 214.255,
    "text": "I'm really interested in thinking about how humans evolve the ability to model other minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.496,
    "end": 228.166,
    "text": "So interested in how this discussion can contribute to that and generally interested in how really good frameworks like the FEP can help kind of encompass other frameworks and revise them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.828,
    "end": 231.108,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 231.509,
    "end": 231.669,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 234.924,
    "end": 235.844,
    "text": " Hi, I'm Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.904,
    "end": 243.226,
    "text": "I'm up here in Calgary in Canada and a little bit of recency effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.306,
    "end": 250.188,
    "text": "I started watching Ozark the last season and so I'm trying to plug this paper in through what would Marty Byrd do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.729,
    "end": 253.609,
    "text": "So that's kind of my little twist on modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.85,
    "end": 255.51,
    "text": "So back to you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.47,
    "end": 259.131,
    "text": "Who is Marty Byrd and what would he do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 259.851,
    "end": 260.091,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.792,
    "end": 262.252,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.56,
    "end": 266.12,
    "text": " Great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.26,
    "end": 267.961,
    "text": "Well, that's all we prepared for today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 268.221,
    "end": 271.442,
    "text": "So we'll go into the discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 272.342,
    "end": 274.543,
    "text": "But we have some things written down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 274.903,
    "end": 282.706,
    "text": "Is there anything just off the bat that anybody wants to just ask or jump into or like a figure or a quotation to begin with?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 282.866,
    "end": 285.747,
    "text": "Or we can look at some of the things that we had written down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 290.29,
    "end": 296.334,
    "text": " Okay, let's just start with what we've written down and then of course at any point we can branch off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 298.935,
    "end": 299.335,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 301.837,
    "end": 315.625,
    "text": "I think a big theme that we'll probably return to again and again is this idea of moving back and forth from non-representational forms to representational forms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 317.186,
    "end": 319.527,
    "text": "In the paper, they introduce",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 321.476,
    "end": 330.724,
    "text": " four different facets of representation, and then how each of those facets can be approached in a representational or non-representational way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 331.245,
    "end": 341.815,
    "text": "And although the image here shows some solid black lines, that was kind of the discussion was, is there movement across these areas or blurriness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 342.455,
    "end": 343.296,
    "text": "So maybe Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 345.758,
    "end": 362.924,
    "text": " What is there to say or start to explore with representations emerging, like almost precipitating or crystallizing out of something non-representational, and then the reverse process of something that is more representational submerging back into something that's less?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 364.925,
    "end": 374.028,
    "text": "Well, one of the things the authors did talk quite a bit about in terms of the functional aspect of this was the vicarious nature, and then they also talked quite a bit about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.405,
    "end": 398.595,
    "text": " whether or not somebody who's sort of moving in that radical and activism space still has to be able to differentiate and include some of the temporal aspects of what might pop up and become something that we can stabilize in model representation form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.554,
    "end": 401.776,
    "text": " But then it has to also be able to disappear, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.016,
    "end": 407.74,
    "text": "It also has to not necessarily consume everything in terms of our attentional fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.86,
    "end": 414.045,
    "text": "So I'm not really sure exactly how that works itself through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.126,
    "end": 419.849,
    "text": "But I would think that it's difficult to say that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.59,
    "end": 428.256,
    "text": " even if we're in a flow state that there isn't some moment when we do reflect in that mirror.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.677,
    "end": 430.879,
    "text": "So that's kind of where I'm at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.139,
    "end": 437.565,
    "text": "I don't have any answers per se, but I don't want to get stuck in the idea that it's just a on off switch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.086,
    "end": 444.432,
    "text": "I think that there's a bit of a, a moment of dimming and then re relighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.653,
    "end": 445.773,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.67,
    "end": 457.814,
    "text": " That makes me think about certain paths that our thought takes over these eight cells.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 458.755,
    "end": 467.66,
    "text": "Like when we're in the representational side, when we're dealing with the representation, how do we take that tetrahedra and look at the four different sides?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 468.64,
    "end": 475.764,
    "text": "And then how do we stay within a column looking at just the organizational aspects of a system and then move",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 477.907,
    "end": 480.009,
    "text": " north and south on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 482.83,
    "end": 489.655,
    "text": "Do these kinds of knowledge or cognitive transitions happen all the time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 490.476,
    "end": 497.2,
    "text": "Do they have other names that might be more familiar than using some of this philosophical language?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.363,
    "end": 522.519,
    "text": " what is it are there any times in our days where we're dealing with something representationally and we shift to a non-representational version within one of these categories or across categories so i was just thinking of that actually like um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 524.164,
    "end": 530.089,
    "text": " What does an organizational representation look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.129,
    "end": 537.035,
    "text": "That is like a map, like a structural representation, a content-related representation, and a functional representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.095,
    "end": 541.598,
    "text": "And what do these representations look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.92,
    "end": 544.0,
    "text": "And how are they different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 544.861,
    "end": 545.822,
    "text": "I was just thinking about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 548.749,
    "end": 554.553,
    "text": " Let's go to the definition of the organizational representation just to kind of remember.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 562.919,
    "end": 572.587,
    "text": "The fact that FEP requires internal states, states that encode the recognition model that are statistically separated from the external reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 574.268,
    "end": 576.93,
    "text": "So the organizational area",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 578.584,
    "end": 587.106,
    "text": " is about how variables inside of systems are separated from variables outside of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 588.566,
    "end": 607.51,
    "text": "The pro representation take is there's an evidentiary boundary, the Markov blanket, and there's something on the inside that is doing something like a representation on what's outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 609.215,
    "end": 611.335,
    "text": " So that's the pro-representational take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.136,
    "end": 621.538,
    "text": "Then the non-representational take is where we get into the ecological and the inactivist persuasion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 623.198,
    "end": 637.021,
    "text": "And that's where the authors say that some have approached this Markov blanket structural formalism, even though we're talking about it in the organizational, not the structural facet, in a manner that suggests a non-representational view.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.912,
    "end": 662.155,
    "text": " And they argue that just partitioning two coupled systems like agent and environment with a Markov blanket doesn't imply that the behavior of the agent is explained by anything related to an internal model that's doing anything like capturing the structure of the outside world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 665.908,
    "end": 671.87,
    "text": " So you just use like organizational and structural, like in this like big hobnob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 671.89,
    "end": 676.412,
    "text": "But so my question was really, what does an organizational representation look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 677.032,
    "end": 687.575,
    "text": "And so I'm hearing that you answered that there are clearly defined boundaries in organizational representation or partitions between internal and external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.815,
    "end": 695.378,
    "text": "So like I have a clearly, when I have a representation in my mind that's organizational, it is like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 695.799,
    "end": 705.522,
    "text": " your boundary is different from like, is it only your own boundary or is it like the boundaries of each individual agent are organizationally represented in your mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 705.782,
    "end": 707.943,
    "text": "Or is it just the boundary between you and the outside world?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.744,
    "end": 713.345,
    "text": "And how might that differ from structural and content related?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 713.385,
    "end": 715.365,
    "text": "Like what do these different representations look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 715.405,
    "end": 716.586,
    "text": "That's what I'm trying to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 716.626,
    "end": 720.147,
    "text": "Like would they be maps and how would the maps be different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 725.151,
    "end": 730.833,
    "text": " The structural, which does come up several times in the organizational definition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 733.214,
    "end": 739.216,
    "text": "So we see structure coming up, the structure of the system in how it's organized, but what is the structural specifically?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 739.337,
    "end": 739.497,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 741.397,
    "end": 748.1,
    "text": "Having representational vehicles that are structurally similar to the state of affairs in the world that they stand for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 757.369,
    "end": 765.912,
    "text": " The pro-representational structural side is kind of like the good regulator theorem of cybernetics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 767.232,
    "end": 781.417,
    "text": "So the organizational side is highlighting that there is some sort of informational encapsulation, we might even say, like our previous discussions, but some sort of organization of variables such that there's an inside and an outside that are separated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.144,
    "end": 810.736,
    "text": " The structural side is saying that it's like if there's three things that are connected in the outside world, then not just that there are variables that are organizationally separated in the internal states, but that the structure of those isolated variables is gonna do something like recapitulate or have a structural resemblance to the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 811.923,
    "end": 814.928,
    "text": " Generative process, that's like the niche, that's what's outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 815.068,
    "end": 817.792,
    "text": "Generative model, that's what the agent has on board.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 818.632,
    "end": 830.479,
    "text": " And so if it's to be useful for control purposes, then it may have to have some sort of structural resemblance to the actual connectivity of the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 830.819,
    "end": 836.623,
    "text": "So generative model and generative process being separated is what's captured in the organizational side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 837.523,
    "end": 842.066,
    "text": "Them having similar resemblances or similar structures is what the structural side is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 844.056,
    "end": 854.104,
    "text": " the structural non-representationalists are suggesting, this is, I think, tale of two densities with Ramsted et al, or modeling ourself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 856.046,
    "end": 872.639,
    "text": "The author suggests that generative models do not meet the requirements of structural representations because the process of exploitable structural representations, so posterior beliefs in the entity,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.453,
    "end": 892.531,
    "text": " is enacted and so it doesn't necessarily have to recapitulate the form of the generative process so maybe one could be skilled in the performance of driving without having variables connected in the way that a car pieces are connected.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 907.702,
    "end": 919.288,
    "text": " It comes back to a theme that Active presents to us, perhaps more as a question than an answer, which is how much do we have to know in order to act?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 920.769,
    "end": 928.493,
    "text": "Do we have to have an internal model that is very similar to the process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 930.494,
    "end": 931.934,
    "text": "Uncorrelated in how similar it is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 932.635,
    "end": 934.656,
    "text": "Anti-correlated in how similar it is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 935.999,
    "end": 946.885,
    "text": " And can we have a framework as researchers that helps us compare the structure and organization of generative processes and generative models of those processes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 953.128,
    "end": 953.328,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 954.929,
    "end": 955.369,
    "text": "Go for it, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.99,
    "end": 961.971,
    "text": " So I'll put this out there and then people push back or say it doesn't make any sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.611,
    "end": 966.273,
    "text": "From what I read in the paper now, because I had to go back over and look at it again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.113,
    "end": 977.636,
    "text": "If I were to try to draw a simple comparison between organization and structure, organization would, you could see it as being something as being either in or out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.537,
    "end": 979.697,
    "text": "So you could be inside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.434,
    "end": 984.076,
    "text": " It could be inside a cell or outside of a cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.156,
    "end": 990.161,
    "text": "And in our mind, we can tell, we will draw those partitions and then we'll decide what's in or out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.922,
    "end": 1006.054,
    "text": "Structural, I think, takes on more of the entailing question, something that Sirval brought up in the chat, which is, so once you've decided whether something's in or not, is there something else that now can be seen as being superordinate to that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.743,
    "end": 1015.793,
    "text": " from the perspective of sort of what's wrapped around now the thing that's in, or what can sit upon",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.079,
    "end": 1028.584,
    "text": " theoretically the thing that you've now decided is foundational to whatever it is you're looking at and what can be set aside as not being important to what you're looking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.044,
    "end": 1037.227,
    "text": "So again, pull that apart and say that that's wrong, but that's kind of what I try to read into what the readers or what the writers were saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.567,
    "end": 1038.948,
    "text": "So it's just my interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.129,
    "end": 1041.649,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1043.632,
    "end": 1057.502,
    "text": " So I just wonder in this organizational representation, do you draw a distinction between, I mean, clearly there's one between like what's internal and external to yourself, but are you also trying to like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1057.938,
    "end": 1066.203,
    "text": " draw distinctions between what's internal and external to your computer or your refrigerator or your best friend or your child?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1066.723,
    "end": 1071.967,
    "text": "Are you making a representation of everything that's internal and external to every other thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1072.147,
    "end": 1076.229,
    "text": "Or is it only with respect to your own self versus environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1078.19,
    "end": 1080.111,
    "text": "I would think it's when you do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.532,
    "end": 1083.614,
    "text": "I don't know that it's implied that you do it all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.554,
    "end": 1092.259,
    "text": " But if you choose to do that, I think that that's something that's pretty easy to tell the difference around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.86,
    "end": 1099.104,
    "text": "So again, I'm not sure that they were saying that we do this, we're always constantly doing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.504,
    "end": 1108.19,
    "text": "But I think what they were trying to do is show the difference between knowing when something's in or out versus knowing when something's first or second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.046,
    "end": 1111.407,
    "text": " from a structural standpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.987,
    "end": 1129.195,
    "text": "Again, I don't want to put words in the author's mouth, but I did hear that in the words that they were doing to try to parse those two things and give each their due, as opposed to saying they're just the same thing overlapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.097,
    "end": 1134.558,
    "text": "Let's try one little thought loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1135.218,
    "end": 1136.499,
    "text": "So let's start with...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1137.605,
    "end": 1141.387,
    "text": " Blue's question of what does an organizational representation look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1142.108,
    "end": 1164.463,
    "text": "So we'll start in that very top left cell and then shift the focus towards the structural components and then challenge the structural representation, but stay within the structural domain and then see if that can result to us making it back to a non-representational organizational framing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1165.819,
    "end": 1173.862,
    "text": " So what is a good organizational, what's something that is classic vanilla organizational representation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1174.742,
    "end": 1181.044,
    "text": "Well, that's something that is well separated in terms of variables inside and outside the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1181.565,
    "end": 1186.966,
    "text": "So we're not worried about the structure of the variables inside or outside, just that they are separated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1188.047,
    "end": 1188.167,
    "text": "So,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1189.622,
    "end": 1212.44,
    "text": " Computers seem like pretty clear cases where within a program you could have variables that by design are separated through like an intermediate variable or computers and hardware, like two computer systems could be totally separated except for an interface like a USB port or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1212.981,
    "end": 1216.784,
    "text": "But of course this paper is about that strange loop",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1218.015,
    "end": 1240.912,
    "text": " when it's a cognizing agent, an adaptive active inference agent doing that representing not necessarily a mere active agent, but should we use a computational example or some sort of enacted human",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1242.443,
    "end": 1265.119,
    "text": " example but you got you got a good example right here on the page so how would we how would we shift across the y-axis between organizational representational because i'm assuming we're going clockwise to representational structural that's not that's not a hard example to to make yes um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.065,
    "end": 1292.399,
    "text": " yes so um in the human case this would be like um so two humans in a conversation they are in a conversation yes perfect outside of the conversation yes two humans when two humans are in conversation right there is separation in terms of their sensory motor",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.372,
    "end": 1302.555,
    "text": " So we have checked the box for organizational, representational, starting in the top left cell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1302.575,
    "end": 1308.057,
    "text": "All right, now the question would be, is there structural representation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1309.078,
    "end": 1316.341,
    "text": "So that would be like maybe if one person thought of a sentence and then said it, and then the other person thought of that sentence too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1319.144,
    "end": 1341.35,
    "text": " would that qualify as a structural representation because there's a structural resemblance in the model of the two conversions um yeah we could also find out if if both of us were talking at the same time and suddenly stopped turn taking that the structure of of that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1343.03,
    "end": 1361.333,
    "text": " model would would now fundamentally change it's still representational and two people arguing over top of one another to the third party isn't necessarily something comprehensible never mind to the two people that are inside the conversation right hello",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.763,
    "end": 1368.006,
    "text": " So when I think about conversation, something comes to mind recently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1368.307,
    "end": 1372.35,
    "text": "Like, really, you need to have, like, the order of the language specified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1372.41,
    "end": 1374.732,
    "text": "Like, my son is reading now, and he's five.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1375.292,
    "end": 1382.057,
    "text": "And, you know, he's taking the book, like, hop on top, the Dr. Seuss book, and he'll turn it upside down, and he'll say, dod, no, do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1382.157,
    "end": 1383.138,
    "text": "And, like, he'll read it that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1383.178,
    "end": 1390.184,
    "text": "And then he wants to read, like, every sentence backwards, like, from the end to the beginning, which I'm like, I don't care, as long as you're reading, because it gets him practicing reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.504,
    "end": 1391.645,
    "text": "But it's completely...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.125,
    "end": 1419.251,
    "text": " but the context is completely um different right when you're reading like each word in the opposite order so like when you're talking about a structural representation of a conversation i think that there needs to be like a literal representation or at least like a coarse-grained representation of in what order things are said in order to glean some kind of meaning but then are we bleeding into the content related but like as we're you know that's why i really feel like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1419.711,
    "end": 1443.859,
    "text": " like what are these different maps look like and trying to maybe elucidate what the representations are is valuable because i think when you have organization okay inside outside like this is the sentence or he said this and she said that or whatever and then you try to put structure on it like that gives it then content or context that they can then you know and so on and so forth dean",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1446.144,
    "end": 1455.787,
    "text": " No, I don't have much to add to that other than I just don't think that this loop that we've just selected this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.987,
    "end": 1459.688,
    "text": "We said there was going to be a certain amount of randomness in the last live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.728,
    "end": 1462.409,
    "text": "And we've chosen this now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.489,
    "end": 1463.369,
    "text": "Let's walk through it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.029,
    "end": 1465.93,
    "text": "I don't see it being difficult.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.172,
    "end": 1469.653,
    "text": " to follow that path and find examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.094,
    "end": 1471.915,
    "text": "So we have a superordinate right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.315,
    "end": 1480.619,
    "text": "Structurally, we want to carry out this directionality from the representational side of things to the non-representational side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.58,
    "end": 1488.283,
    "text": "And Blue, if your kid wants to turn the book upside down, that's actually a feature, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.523,
    "end": 1492.585,
    "text": "Because they're not already stuck in this only one way of doing it thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.665,
    "end": 1494.026,
    "text": "So, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.451,
    "end": 1501.156,
    "text": " Let's complete the red loop and then the green and the orange will come into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1501.296,
    "end": 1501.436,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1501.716,
    "end": 1503.838,
    "text": "So we started with two people in conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1504.038,
    "end": 1506.581,
    "text": "That's organizational separation of cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1508.323,
    "end": 1518.032,
    "text": "This brings us to the structural facet, which is where there's a structural resemblance in the representations of the conversants.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1519.473,
    "end": 1520.254,
    "text": "So there...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1521.508,
    "end": 1528.592,
    "text": " Maybe it is the case where they're both thinking about a similar topology of variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1528.792,
    "end": 1530.554,
    "text": "So there's some structural representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1531.494,
    "end": 1538.058,
    "text": "But now let's stay within the structural column, go from B to C. Okay, so the two people are in a conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.138,
    "end": 1539.759,
    "text": "It's kind of like a dance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1540.48,
    "end": 1543.782,
    "text": "So what if those two people's representation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1544.873,
    "end": 1549.234,
    "text": " is so different that it's actually not structurally resembling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1549.695,
    "end": 1556.037,
    "text": "So maybe one person is the more experienced in the discipline and the other is less experienced.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1556.177,
    "end": 1561.038,
    "text": "Like one person's super good at fixing motors, the other person just has no idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1561.859,
    "end": 1571.362,
    "text": "So the representationalist take would be like, well, they're both thinking about the motor, but then when we start to see like a cognitive asymmetry, all of a sudden,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1572.369,
    "end": 1582.513,
    "text": " we fall out of structural representationalist between these two systems because their cognitive models don't necessarily have similar structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1584.994,
    "end": 1585.714,
    "text": "Yes, Danielle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1589.235,
    "end": 1590.496,
    "text": "Oh wait, unmute it then, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1592.777,
    "end": 1595.718,
    "text": "So I might be missing something here, but I thought that we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.542,
    "end": 1605.624,
    "text": " can only start to talk about the structural dimension here once, in this example, the two people in the conversation are representing the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.724,
    "end": 1614.546,
    "text": "And then the question is, how much information, or how does each of their representations, do each of their representations have to look similar to one another?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.646,
    "end": 1618.587,
    "text": "But part of it has to be that they are representing the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.827,
    "end": 1621.487,
    "text": "Is that a necessary component?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.327,
    "end": 1624.908,
    "text": "If they're not representing the same thing, then we're having a different conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.963,
    "end": 1650.926,
    "text": " Well, that may come to the functional, that might come to the content related, like the novice and the expert, the representations are both about the engine, but they're so structurally different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1652.111,
    "end": 1678.094,
    "text": " in their representation of the engines so that although the content, the aboutness of the representation is similar, so still qualifying as a representation in that sense, there's a structural non-resemblance such that by that criteria in that situation, we've fallen out of the representational cell B into something non-representational potentially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1678.354,
    "end": 1679.055,
    "text": "Blue, what do you think?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1681.201,
    "end": 1686.423,
    "text": " So I think two people in a conversation can be trying to represent the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.423,
    "end": 1691.445,
    "text": "Yes, they both need to be trying to have the same representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.465,
    "end": 1695.887,
    "text": "They're trying to converge on a conversation, a meaningful conversation, presumably.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1697.207,
    "end": 1698.488,
    "text": "But they don't always converge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.548,
    "end": 1704.23,
    "text": "And then that's where you get misunderstandings or we both think that we think the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.971,
    "end": 1712.323,
    "text": " We both agree that we're thinking that we have the same structural representation, but perhaps they're different and then the communication breaks down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.539,
    "end": 1732.872,
    "text": " Okay, so the structures are so different that we're recognizing it as a continuum from total overlap of structural resemblance to total non-overlap, but it would be important to specify that null hypothesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1733.593,
    "end": 1735.535,
    "text": "So we've kind of scooted into C.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1737.236,
    "end": 1750.27,
    "text": " How do we stay in that space of like the novice and the expert who have different cognitive representations and then use that to challenge even organizational representationalism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1754.975,
    "end": 1755.636,
    "text": "Blue, then Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1756.097,
    "end": 1757.118,
    "text": "Oh, Dean first and then Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1757.779,
    "end": 1758.019,
    "text": " Go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1758.099,
    "end": 1758.84,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1759.26,
    "end": 1762.323,
    "text": "I just thought I want to just go back to the to Daniel's point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.843,
    "end": 1766.426,
    "text": "So if we're if we're structuring a conversation, normally we turn take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.047,
    "end": 1772.752,
    "text": "But if we're playing in a band, we're all playing at once and then we stop playing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.992,
    "end": 1775.414,
    "text": "So I think we can start with structure, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.795,
    "end": 1778.317,
    "text": "It's just deciding how we want to signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.704,
    "end": 1779.944,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.304,
    "end": 1786.508,
    "text": "So I don't think there's necessarily an order that we have to start with organization first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.748,
    "end": 1789.45,
    "text": "We can actually start with structure first as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.45,
    "end": 1796.334,
    "text": "Yeah, and I think a conversation is a particularly challenging example because we're representing two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.634,
    "end": 1803.378,
    "text": "We're representing what the other person is trying to say and then presumably what the conversation is about is something else in the world that we could be representing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.738,
    "end": 1804.499,
    "text": "Exactly, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1806.28,
    "end": 1806.48,
    "text": "Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1807.601,
    "end": 1809.322,
    "text": "So I think we're representing...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1810.648,
    "end": 1827.402,
    "text": " a degree of information sharing and I think that this is going to like lump into autopoiesis which I've been really wanting to kind of get into but when we have like I'm my own person and I'm communicating with Danielle from you know 50,000 miles away we both",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1828.022,
    "end": 1844.193,
    "text": " feel like we're getting on the same page when we actually like do get on the same page like do we form some kind of like separate cognitive unit like at what degree of model overlap is the degree of information sharing so high that then we are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1845.089,
    "end": 1847.19,
    "text": " worthy of our own Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1847.33,
    "end": 1850.09,
    "text": "We're sure that we understand that we are the same unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1850.71,
    "end": 1862.213,
    "text": "And I think that this idea of self-assembly and information sharing and model overlap, I think that there's an important path to traverse down this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1862.633,
    "end": 1871.936,
    "text": "Because if you don't have full overlap of the model, or do you need full overlap to form a self-assembling system to form a higher level?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1872.216,
    "end": 1873.296,
    "text": "It's just an interesting thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1876.792,
    "end": 1899.537,
    "text": " that's kind of where the c to d transition takes us which would be like so we have um the drummer's waiting for this and has a model resembling this and then the singer has a totally different structure and then when we think about the whole cognitive system it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1901.164,
    "end": 1921.63,
    "text": " it doesn't deny what we recognized in A, that there still is like the sensory motor separation, but we've reached that point by those people or roles being part of a larger non-separable extended cognitive system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1922.21,
    "end": 1927.412,
    "text": "So almost by recognizing the interaction, so here we focused on the separation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1928.467,
    "end": 1932.87,
    "text": " in A and that's what granted us the representational cell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1933.531,
    "end": 1948.122,
    "text": "But we've returned to seeing that partial information encapsulation within some type of broader structure where none of the entities have like the band level representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1949.223,
    "end": 1952.806,
    "text": "So hopefully other people can think of other like ABCD examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1953.466,
    "end": 1955.168,
    "text": "But when we were at B,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1956.687,
    "end": 1965.291,
    "text": " we kind of started branching off into like talking about the content related things, the aboutness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1966.311,
    "end": 1974.935,
    "text": "So here it's like two people do have a structural resemblance in their internal model and it's about the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1976.275,
    "end": 1984.759,
    "text": "But then what if one person sees the aboutness in such a different way that again, we fall out of the content related",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1985.723,
    "end": 2005.968,
    "text": " representation and then how would we move from there back to C, where all of a sudden the cognitive models in a sense don't have structural representations, resemblance, because they're about different things now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2013.17,
    "end": 2013.45,
    "text": "Danielle?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2015.655,
    "end": 2025.596,
    "text": " So would this be like in the case of two things that are so analogous that they share a lot of structural similarities and things of like Dedrick Entner's work that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.213,
    "end": 2033.938,
    "text": " you can actually draw lines between the individual aspects of, of the concepts, but they could be about totally different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.939,
    "end": 2040.923,
    "text": "But two people talking about these things can, can form some sort of structural similarity in the representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.103,
    "end": 2045.526,
    "text": "And it's just like an entry point into being able to think about all other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.547,
    "end": 2048.768,
    "text": "But the aboutness really has nothing to do with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.391,
    "end": 2054.092,
    "text": "Dean, then I might want to ask me on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2055.299,
    "end": 2071.384,
    "text": " I don't know if this answers that, Danielle, but from my space, I'm thinking the difference between, say, a distracted driver who's looking down at their phone between the seats and somebody who's got that information in a heads-up display on their windshield.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.679,
    "end": 2080.764,
    "text": " Right, so content twice, but structurally presented, one as a distracted state and one as a contiguous state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.545,
    "end": 2086.468,
    "text": "So I don't know if that answers your point, but I think we could, we know the difference, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.209,
    "end": 2094.694,
    "text": "In terms of where the content is structured and how we're trying to contextualize each matter, so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.115,
    "end": 2114.706,
    "text": " Again, staying with this sort of educational setting, what is it important to see a transference or a new emergence of?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2117.749,
    "end": 2127.078,
    "text": "Is it that the structural model of the learner is moving into more resemblance with the teacher?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.436,
    "end": 2135.401,
    "text": " Is it that the aboutness of the learner is moving towards the same aboutness of the teacher?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2137.283,
    "end": 2140.065,
    "text": "Or let's just remind about what the functional is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2142.466,
    "end": 2146.689,
    "text": "Supporting vicarious use before or in the absence of external events.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2147.47,
    "end": 2151.073,
    "text": "So does the teaching conversation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2153.159,
    "end": 2168.282,
    "text": " Will it be a functional representation when vicariously without the teacher, the student can carry out what the teacher could do, which might be having aboutness or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2169.523,
    "end": 2173.944,
    "text": "It might be with a structural cognitive resemblance or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2174.764,
    "end": 2178.865,
    "text": "It might involve total informational isolation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2180.128,
    "end": 2197.501,
    "text": " putting a squarely in A, or it might involve some type of challenging of that in D. The reason why there's not gonna be, I think, a precise answer, because as the paper lays out,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2198.59,
    "end": 2202.111,
    "text": " even for the same scenario, people do have different perspectives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2202.151,
    "end": 2222.215,
    "text": "So it's not like we're trying to take a scenario, then classify it into, well, that one's like an A, B, E, G, or an A, C, E, H. Like that is probably not what one of the outcomes could be, but these are all perspectives that we could take on a given scenario.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2223.775,
    "end": 2228.216,
    "text": "And they do reveal interesting things about the systems of studies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2231.522,
    "end": 2238.984,
    "text": " Anything else to add on this sort of like looping around the cells or should we push on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.666,
    "end": 2245.966,
    "text": "Push.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2246.706,
    "end": 2247.007,
    "text": "Push.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2249.167,
    "end": 2251.988,
    "text": "Okay, Blue, what were you thinking here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2254.625,
    "end": 2255.505,
    "text": " I was just taking notes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.065,
    "end": 2261.567,
    "text": "And so like if, so maybe we should talk about content related and functional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.027,
    "end": 2267.309,
    "text": "So I was just taking notes on, you know, what these are organizational, like how are the representations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2267.889,
    "end": 2269.21,
    "text": "And I was trying to draw a picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2269.35,
    "end": 2270.83,
    "text": "So if you, I will draw my picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2271.03,
    "end": 2278.473,
    "text": "If, if you will talk about maybe functional representation, like what does a functional representation look like or content related?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2278.513,
    "end": 2278.853,
    "text": "What is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.233,
    "end": 2280.073,
    "text": "What's inside of those?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.253,
    "end": 2282.574,
    "text": "And then I will draw my picture and then you can show it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2283.061,
    "end": 2284.702,
    "text": " All right, I'll just start while you're talking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2285.263,
    "end": 2285.463,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2285.743,
    "end": 2302.695,
    "text": "So the content related is whether the generative models need to explicitly model the ways external states produce sensations, environmental models, or the ways actions produce sensations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2304.767,
    "end": 2314.25,
    "text": " Is it really important that internal states resemble external states or is it sufficient that they afford accurate action control?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2322.293,
    "end": 2330.136,
    "text": "So let's just say there's a spotlight that's shining photons onto the eye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2332.685,
    "end": 2350.89,
    "text": " the content of the cognitive representation would put us more, we'd be more in the representational camp if the cognitive model were truly explicitly modeling the ways in which the photons hit the retina.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2353.29,
    "end": 2353.51,
    "text": "Maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2357.691,
    "end": 2360.452,
    "text": "But this or is a bit challenging because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2361.701,
    "end": 2369.242,
    "text": " The ways actions produce sensations, that could be a model of like, well, if I blink, it becomes darker, and when I open my eyes, it's lighter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2370.243,
    "end": 2375.604,
    "text": "But that's a totally disjoint question from understanding how a spotlight works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2379.504,
    "end": 2387.686,
    "text": "But those two scenarios of the spotlight's cognitive explicit modeling, the environmental model, or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2389.107,
    "end": 2394.631,
    "text": " The sensory motor model of blinking and it becoming darker, those are both content related.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.373,
    "end": 2397.714,
    "text": "And Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2399.995,
    "end": 2408.662,
    "text": "Well, I don't know if this helps or not, but one of the things that I used to bring up around this idea was the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.509,
    "end": 2428.379,
    "text": " was the the puzzle concept i.e so you got a box and it says a thousand piece puzzle and when you open up the box is that representational or is it not representational until you've figured out whether all thousand pieces have now been",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.542,
    "end": 2458.519,
    "text": " duly assembled right so from a from a content perspective do you have what you need in order to be able to tell the difference between something which is representative and that which is not so again i don't know if that's helpful in terms of sort of trying to see a difference between that say and structure like where it's placed relative to the context or not but that was the way i tried to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.283,
    "end": 2475.089,
    "text": " One evolution or handshake that hinges on that or of the environmental models and the sensory motor models, they do unpack a little bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2476.095,
    "end": 2480.497,
    "text": " So one approach consists in starting from the sensory motor models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2481.297,
    "end": 2483.918,
    "text": "So that would be when I blink, it becomes darker.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2484.098,
    "end": 2492.782,
    "text": "When my eyes are open, it's lighter, but progressively extends them to incorporate extra variables that describe external causes of sensation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2493.74,
    "end": 2505.943,
    "text": " So like if there's a light on one side, but not on the other side, then it can be the case that that blinking is true, no matter how you're turned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2506.884,
    "end": 2515.606,
    "text": "But then that could be enriched or augmented with a model of parameters that describes external causes of sensation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2515.646,
    "end": 2519.027,
    "text": "Like there's a light over there and not over there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2519.627,
    "end": 2522.268,
    "text": "And so actually that little loop that we just took",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2523.837,
    "end": 2538.861,
    "text": " was from the sensory motor B, the sensory motor model in B moving to a representational model of the content, like there's a light over there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2542.622,
    "end": 2547.063,
    "text": "And then does that, well, at least that was the BTE move.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2548.117,
    "end": 2551.578,
    "text": " But then maybe that could do something else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2551.618,
    "end": 2553.698,
    "text": "So maybe Blue will clarify there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2553.758,
    "end": 2556.039,
    "text": "But let's go back to just review functional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2556.779,
    "end": 2558.879,
    "text": "Like what is the functional?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2558.999,
    "end": 2566.661,
    "text": "And it's good to revisit these in the zero, one, two, three, four, five, because it's the contribution of the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.561,
    "end": 2571.682,
    "text": "And maybe there are other facets, other columns to add.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2571.722,
    "end": 2574.843,
    "text": "And there's just a lot of complexity, even as this is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2575.583,
    "end": 2576.703,
    "text": "So the functional one,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2580.091,
    "end": 2585.294,
    "text": " is about supporting vicarious use before or in the absence of external events.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2585.474,
    "end": 2598.102,
    "text": "So in that story with the lights and the blinking, that model only has to be instantiated while in that room with the photons hitting the eye and the blinking happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2600.224,
    "end": 2608.009,
    "text": "However, we can imagine a situation that's vicariously detached",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2608.982,
    "end": 2632.243,
    "text": " or before that setting like what would happen if there were a light over here and a light over here and it was the case that blinking made it darker and this is where they trace back to Piaget that representations should vicariously stand for something external in their absence and afford vicarious operations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2637.0,
    "end": 2639.262,
    "text": " So there's a light over on the left side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2639.983,
    "end": 2641.704,
    "text": "You reach over and you unscrew it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2644.047,
    "end": 2644.807,
    "text": "What is in your hands?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2648.691,
    "end": 2661.383,
    "text": "Now that is seeming to be in the functional facet because we're talking about the role the representation is playing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2662.535,
    "end": 2666.996,
    "text": " and the fact that it is standing for something external in the absence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2667.016,
    "end": 2669.017,
    "text": "There's no physical light that we're talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.397,
    "end": 2672.338,
    "text": "It's not like we're unscrewing it and then verifying that it's in our hands.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2675.439,
    "end": 2677.68,
    "text": "Who's for and against that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2688.543,
    "end": 2688.643,
    "text": "What?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2689.446,
    "end": 2693.61,
    "text": " What functional roles do internal models play during free energy minimization?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2695.251,
    "end": 2705.6,
    "text": "And does minimization require the internal manipulation of variables in ways that resemble vicarious operations in the classical Piaget account of representation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.426,
    "end": 2713.907,
    "text": "Yes, Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2715.154,
    "end": 2723.0,
    "text": " So this might be like, I don't know, maybe it's the easiest and also like the hardest to get a grip on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.18,
    "end": 2738.65,
    "text": "So I think about, um, like, do we, so if we have a representation of internal variables that like are functional, like a functional representation of a functional internal representation, is this like doing, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.663,
    "end": 2744.966,
    "text": " like you manipulate the variables internally and then manipulate them externally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2745.006,
    "end": 2758.056,
    "text": "Like you plan to reach for the cup to take a drink of water, and then you reach for the cup to take a drink of water, but you have to have like the internal execution prior to, or maybe simultaneous with the external execution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2760.158,
    "end": 2763.36,
    "text": "Is that like functional representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.58,
    "end": 2769.385,
    "text": "Like you plan the action and do the action, maybe separate or maybe together,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2770.902,
    "end": 2772.885,
    "text": " Is that what functional representation looks like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2774.408,
    "end": 2777.914,
    "text": "Let's go with a reaching for the cup, because as Danielle noted,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.318,
    "end": 2790.247,
    "text": " Conversation, improvised, spontaneous conversation of reflexive entities is one of the hardest cases, but it's the one that we have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2790.547,
    "end": 2791.268,
    "text": "So that's awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2791.868,
    "end": 2799.154,
    "text": "But we're going to be talking about a adaptive active inference agent reaching for a mere active inference agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2799.855,
    "end": 2805.579,
    "text": "So in the Sims other paper we discussed, now we're talking about the case of unidirectional",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2806.46,
    "end": 2817.468,
    "text": " integration rather than the multi-scale reciprocal integration so the person is separated from the cup there's a separation of the cognitive model of the agent from the cup",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2819.892,
    "end": 2835.5,
    "text": " The structural side, if the internal model is cup-like or it features a cup variable touching a table variable, and then another edge that is engaged of the hand touching the cup, for example, that might be a structural similarity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2836.341,
    "end": 2845.365,
    "text": "But I think that's part of the debate is how could there be a structural similarity when it's not a cup in your brain, which we kind of talked about last time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2845.385,
    "end": 2847.967,
    "text": "Like how could you have something that structurally resembles a car",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2849.312,
    "end": 2851.634,
    "text": " if it's your brain and body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2853.135,
    "end": 2857.839,
    "text": "The contents related, encoding environmental contingencies or sensory motor contingencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2858.96,
    "end": 2870.769,
    "text": "So it could be the case that a certain sensory motor action will result in picking up and grasping the cup, whereas another sensory motor action is gonna result in the shattering of the cup.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2871.27,
    "end": 2873.812,
    "text": "And that could be analyzed in terms of correctness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2875.868,
    "end": 2884.753,
    "text": " The functional representational question would be like the vicarious detachment of the sensory motor loop from the cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2885.574,
    "end": 2893.238,
    "text": "So then it would be like, if you were to pick up that cup, then you dumped it, what would happen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2893.458,
    "end": 2895.279,
    "text": "And then someone says like, well, water would fall out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2896.2,
    "end": 2901.783,
    "text": "So in that case, it is like there's a functional representation, whether or not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2902.583,
    "end": 2904.744,
    "text": " it resembles the structure of the cup.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2905.505,
    "end": 2920.593,
    "text": "There's a functional representation because that idea of grasping the cup, it's able to be operated on internally vicariously in the absence of direct stimuli related to the cup.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2922.294,
    "end": 2922.454,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2924.87,
    "end": 2927.472,
    "text": " Do you mind if I just read right from the paper for a second?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.492,
    "end": 2940.04,
    "text": "Because I think it helps in terms of this difference between the automaticity and reflective aspects of this action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.82,
    "end": 2952.548,
    "text": "One important implication falling out of this diagnosis is that when considering functional rural aspects, it's often how the details of our chosen process theories are fleshed out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.513,
    "end": 2960.387,
    "text": " and contextualized by the kinds of cognitive phenomena that we are attempting to account for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.03,
    "end": 2968.673,
    "text": " for that skew, our interpretation of FEP in one direction or another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.133,
    "end": 2989.561,
    "text": "For example, one may consider that there are core aspects of FEP, such as the possession of a Markov blanket and more ancillary aspects, and I think ancillary is the key here, such as the possibility, but not the necessity to engage in counterfactual inference, which is only required for planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.649,
    "end": 2997.951,
    "text": " And it is only the latter more ancillary aspects that call for a representational interpretation under a given process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.571,
    "end": 3012.856,
    "text": "This would imply that when using functional role as a sole criterion for representational processes, only some FEP agents, mainly those that can engage in counterfactual forms of inference would meet the criteria for representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.716,
    "end": 3019.626,
    "text": " It is only this subset of FEP agents that would be equated to full-fledged predictive processing agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.248,
    "end": 3022.531,
    "text": "So there is an automaticity part to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.737,
    "end": 3025.619,
    "text": " where it's really not a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.639,
    "end": 3028.261,
    "text": "You just do it almost subconsciously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.681,
    "end": 3030.903,
    "text": "And that's, again, the authors are trying to point this out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.143,
    "end": 3036.087,
    "text": "Yes, if we fail, I drop the cup and now I reflect on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.048,
    "end": 3038.849,
    "text": "That's the representational piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.53,
    "end": 3043.513,
    "text": "But prior to that, I was just going through the motions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.933,
    "end": 3047.917,
    "text": "I didn't need a set of instructions telling me to reach out for the cup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.058,
    "end": 3050.639,
    "text": "So that's just in the author's words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.466,
    "end": 3054.347,
    "text": " Thanks a lot for clarifying that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3054.587,
    "end": 3080.921,
    "text": "It's like, yes, if one is reflexively grasping at it or accidentally, then grasping the cup, like if you're groping around in a dark room and then you happen to grasp the cup, it doesn't have to be representational because there isn't a counterfactual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3081.762,
    "end": 3081.922,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3085.698,
    "end": 3089.961,
    "text": " And that's very interesting how like they say that it is ancillary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3090.702,
    "end": 3111.957,
    "text": "So that's kind of like secondary or not essential to it because we can imagine an active inference entity that's taking in sensory observations, updating its generative model, engaging in policy selection, and then resulting in some action output impacting the niche and the cycle begins again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3113.334,
    "end": 3118.117,
    "text": " that can be just like a single layer model that doesn't engage in counterfactuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3119.979,
    "end": 3135.45,
    "text": "But they raised that notion that it's only the counterfactuals in cognition that actually like give us the space to have a functional representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3136.07,
    "end": 3140.694,
    "text": "It's like if the shell just represents the shell, can't be anything else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3141.564,
    "end": 3148.671,
    "text": " but then there's another kind of entity who can see the shell as financial or can see it in a different way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3148.912,
    "end": 3158.502,
    "text": "And then it's those counterfactuals that enable the shell to play a functional representational role in that it stands for something else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3160.944,
    "end": 3164.268,
    "text": "Blue, what is this imagery on the bottom?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.785,
    "end": 3175.166,
    "text": " So I just was trying to really look at or try to visualize what would these different representations really look like, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.206,
    "end": 3176.609,
    "text": "So if we take the idea of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3177.495,
    "end": 3179.797,
    "text": " to a person and a cup even, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3179.857,
    "end": 3180.097,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3180.117,
    "end": 3182.679,
    "text": "So on the first one, right, we have organizational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3183.139,
    "end": 3185.02,
    "text": "So like I am a thirsty body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3185.04,
    "end": 3187.062,
    "text": "I'm contained within me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3187.422,
    "end": 3189.503,
    "text": "There is a cup that contains water over there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3189.684,
    "end": 3190.624,
    "text": "Like I know my boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3190.644,
    "end": 3194.207,
    "text": "I know the boundary of the cup and the representation looks like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3195.468,
    "end": 3203.193,
    "text": "And then a structural representation is just me and the cup",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.692,
    "end": 3207.094,
    "text": " And that my relationship between me and the cop, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3207.114,
    "end": 3215.259,
    "text": "Like, so do I have to also have like, like, so, so my, my real question here is do these perhaps build on one another?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3215.839,
    "end": 3221.143,
    "text": "So, so here you have the structural and, and, um, then the next one would be content related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.623,
    "end": 3225.745,
    "text": "Do I also have to have this connecting line in the content related?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.765,
    "end": 3227.827,
    "text": "Uh, is that required?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.867,
    "end": 3231.689,
    "text": "Like, do I have to have an idea of the structure to understand the content?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3232.639,
    "end": 3244.061,
    "text": " And then in the functional, do you need to know the content and the structure and the organizational to have an understanding of the functions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3244.645,
    "end": 3267.618,
    "text": " do i need to know like the content related like i know that there's water in the cup right i assume that there's water in the cup to find out i have to realize that there's an inside of me and outside of me and inside of the cup and outside of the cup i have to realize my relationship between me and the cup and then to find out the content like i have to go sample the cup like to see what's inside of it and i have to know what's inside of me and then the function like like can i only",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3268.118,
    "end": 3269.781,
    "text": " I wonder if there's water in that cup.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3269.921,
    "end": 3278.517,
    "text": "And then if I go to drink it and there's whiskey in it or something, I'm not going to understand the function until I have all of those things layered on top of each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.208,
    "end": 3283.391,
    "text": " And so that's kind of really my question here, and Daniel's drawing on my drawings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3285.472,
    "end": 3304.242,
    "text": "But really, I just wonder if there's levels of increasing complexity between these different kinds of representations, or if it's just merely the structure, the organizational, and I don't need these boundaries between self and cup in these other models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.282,
    "end": 3308.285,
    "text": "Maybe it's just the line without the circles in the structural, or...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3309.085,
    "end": 3326.595,
    "text": " the no external circles and content related so i just want to know like what you guys maybe think of that if there is a layering here because i was kind of layering them up but i don't know if that's really the right mental representation thanks blue dean um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3328.256,
    "end": 3328.876,
    "text": " I'm not muted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.916,
    "end": 3329.116,
    "text": "Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3330.197,
    "end": 3332.477,
    "text": "I think there's two parts to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.738,
    "end": 3338.219,
    "text": "One is that we are able to differentiate, which is what the table allows for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.559,
    "end": 3349.663,
    "text": "And I think that the second part is the curved arrow that Daniel drew, which essentially represents boundary crossing, number one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.255,
    "end": 3356.357,
    "text": " So the difference between something that's static and something that is translatable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.077,
    "end": 3369.961,
    "text": "And then the second part of it, I think, without going back down the rabbit hole that we almost fell into in the point one of this, when we started talking about free will and can and will and the orthogonal piece of that, I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.11,
    "end": 3380.458,
    "text": " What it speaks to, maybe, is that it's not a question of free or encapsulated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.679,
    "end": 3383.501,
    "text": "It's a degree of dependency question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.541,
    "end": 3386.264,
    "text": "When you throw that curved line on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.401,
    "end": 3392.482,
    "text": " on this sort of tiled representation and start moving across a boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.062,
    "end": 3402.404,
    "text": "So I don't want to call it degrees of dependency will up to a point of passing through zero, but I'd like to, because I think there is an aspect of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3402.884,
    "end": 3410.425,
    "text": "And that's why I think it's kind of crazy if we just focus on the static things instead of the moving around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3410.445,
    "end": 3416.686,
    "text": "The moving through four squares is what I really think gives our minds a good workout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.723,
    "end": 3422.345,
    "text": " Yep, so here's another little workout.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3422.725,
    "end": 3426.426,
    "text": "So blue had two circles in relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3427.067,
    "end": 3432.189,
    "text": "So here, the circle is going to reflect an adaptive active inference agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3433.334,
    "end": 3437.915,
    "text": " or the full-fledged predictive processing agent, one that can engage in counterfactuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3438.555,
    "end": 3449.557,
    "text": "So the top is two adaptive entities in relationship, and the triangle is going to reflect a mere active inference entity like a cup or just something that doesn't engage in counterfactuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3450.637,
    "end": 3454.538,
    "text": "So organizational is the separation of the systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3454.738,
    "end": 3460.399,
    "text": "So that's very similar because it's just describing there being a Markov blanket separating the systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3462.298,
    "end": 3465.881,
    "text": " The structural representation is having vehicles that are structurally similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3466.282,
    "end": 3470.045,
    "text": "So it's simpler in the lower case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3471.246,
    "end": 3474.549,
    "text": "Triangle out there in the world, is there a structural resemblance?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3474.709,
    "end": 3476.19,
    "text": "That would be very representational.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3476.791,
    "end": 3482.316,
    "text": "Whereas if they were cognitively imagining something different than a triangle, that would have less resemblance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3483.116,
    "end": 3488.861,
    "text": "But that gets challenging with adaptive-adaptive because...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3490.137,
    "end": 3492.858,
    "text": " We're modeling ourself, modeling each other, blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3493.559,
    "end": 3495.56,
    "text": "So here's them modeling the conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3495.6,
    "end": 3504.604,
    "text": "And that's where there's sort of like very complex dynamics, which is how can we have a structural similarity about a conversation with another person?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3504.744,
    "end": 3508.386,
    "text": "But it's simpler in the adaptive mirror case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3509.909,
    "end": 3515.511,
    "text": " The content related representations encode environmental contingencies or sensory motor contingencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3515.771,
    "end": 3521.313,
    "text": "So like in this case, the triangle, it is the case that it can rotate clockwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3522.233,
    "end": 3532.917,
    "text": "And so this entity does have a good content related representation if it can actually turn the dial to that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3534.602,
    "end": 3538.284,
    "text": " And again, that's a little bit more complex in the reciprocal case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3538.944,
    "end": 3547.868,
    "text": "But in the unidirectional case, this red arrow is a content-related representation of the actual motion in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3548.648,
    "end": 3551.59,
    "text": "And then this last case is the functional representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3552.23,
    "end": 3556.752,
    "text": "And here it still is, it could be more structural.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3557.532,
    "end": 3559.653,
    "text": "So like more about the actual motion",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3560.399,
    "end": 3565.202,
    "text": " structure of the cognitive model, or it could be more about the encoding of the contingencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3566.003,
    "end": 3570.866,
    "text": "But the key piece is this isolation, which isn't a Markovian isolation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3571.206,
    "end": 3574.228,
    "text": "This is actually the true vicarious separation of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3574.949,
    "end": 3589.859,
    "text": "So here the person or the entity is able to engage in either structural pondering of the triangle or functional pondering of the triangle in the absence of seeing the triangle or grasping the triangle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3591.024,
    "end": 3601.41,
    "text": " And again, though, that's a little bit complex when you have multiple counterfactual cognizers asking each other questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3602.431,
    "end": 3605.753,
    "text": "I just added a counterfactual to your question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3606.574,
    "end": 3607.554,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3607.774,
    "end": 3610.636,
    "text": "The red one is... Then there's the blue one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3610.776,
    "end": 3611.957,
    "text": "It could go a different way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3613.818,
    "end": 3616.54,
    "text": "And then this is how we know that it's a true...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3618.069,
    "end": 3639.797,
    "text": " cognizer and a true functional representation yes great call thanks a lot blue because it has to do with the vicarious nature with not directly seeing it but it also has to do with that representation whether more structural triangular or more functional red arrow could be different so there's them having a counterfactual um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3641.627,
    "end": 3657.287,
    "text": " action contingency and here they're also imagining a counterfactual structural position okay i'm gonna go to a question from steven in the chat steven asked",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3658.413,
    "end": 3664.117,
    "text": " how do we resolve the use of the term functional as used in correlational dynamics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3664.857,
    "end": 3679.666,
    "text": "So that's referring to some of our earlier discussions on like functional and effective connectivity in neuroimaging and the term functional in use, and the term functional in terms of having cognitive counterfactuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3680.267,
    "end": 3686.511,
    "text": "So how is the functional here related to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3687.728,
    "end": 3693.813,
    "text": " effective and functional connectivity in neuroimaging and time series statistics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3699.477,
    "end": 3700.278,
    "text": "I'll give a first thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3701.439,
    "end": 3706.923,
    "text": "It's not that it can't be linked or connected, but they are different namespaces and they're totally different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3708.084,
    "end": 3712.087,
    "text": "The functional connectivity in the time series is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3713.607,
    "end": 3721.334,
    "text": " about how changes in one variable through time influence another variable through time or are associated with changes in the other one through time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3721.954,
    "end": 3733.204,
    "text": "So it's not a mechanistic causal relationship per se, but it's just that changes in one variable have an edge reflecting how changes in some other variable change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3734.326,
    "end": 3746.673,
    "text": " that does not engage either of the pieces that we're highlighting here, which is the vicarious or standing for nature, nor the counterfactual nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3747.554,
    "end": 3751.656,
    "text": "So it is a different use of the term functional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3752.377,
    "end": 3754.258,
    "text": "Functional is an overloaded word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3754.998,
    "end": 3760.942,
    "text": "And so, yeah, it's not that you couldn't have a paper that was looking at functional representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3762.06,
    "end": 3772.046,
    "text": " and using neuroimaging and using functional and effective connectivity of brain regions while individuals were engaged in functional representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3772.887,
    "end": 3776.889,
    "text": "But that would a little bit be like the star was the star of the movie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3777.469,
    "end": 3789.897,
    "text": "It's just using a word in multiple senses in a way that may give some ambiguity to those who don't parse out the different senses extremely clearly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3791.892,
    "end": 3794.935,
    "text": " Is that fair to say, or does anyone have a different thought?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3799.0,
    "end": 3804.366,
    "text": "Functional can also mean teleological, like the function of something essentially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3804.406,
    "end": 3811.253,
    "text": "So there's many uses of function, and I think it's interesting that it has come up in these different spaces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3814.215,
    "end": 3826.901,
    "text": " So I do agree that they're disconnected, but I am able to perhaps see a relationship in functional connectivity and also in counterfactuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3827.342,
    "end": 3833.665,
    "text": "So when things are functionally connected, one drives the other, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3835.266,
    "end": 3843.67,
    "text": "And then the counterfactual is when things are not functionally connected, there's no corresponding correlation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3844.93,
    "end": 3873.143,
    "text": " so so in the exploration of functional connectivity you have to have all of the data points like over a time series so you have to um like you understand functional connectivity through the exploration of counterfactuals does that make sense okay how about this functional connectivity the term it is a functional representation that cognitive scientists use",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3874.093,
    "end": 3876.474,
    "text": " because it could be otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3877.054,
    "end": 3886.037,
    "text": "They're engaging and they're saying region A and B have functional connectivity because I did the time series statistics in SPM and we got this value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3886.818,
    "end": 3895.301,
    "text": "And so that functional connectivity value is able to be used in subsequent internal cognitive representations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3896.454,
    "end": 3901.157,
    "text": " It stands for something and it can be engaged with in a counterfactual way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3901.197,
    "end": 3902.718,
    "text": "Like what if it would have been stronger?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3903.438,
    "end": 3905.099,
    "text": "Then what would our conclusion have been?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3905.119,
    "end": 3906.079,
    "text": "Or what if it would have been weaker?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3906.139,
    "end": 3906.88,
    "text": "What would it have been?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3909.822,
    "end": 3913.884,
    "text": "And then Steven wrote, these are definitions and ways to name.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3914.244,
    "end": 3917.146,
    "text": "Could be where the ontology working group could have a future role.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3918.306,
    "end": 3922.809,
    "text": "Yes, ontology development in active inference and...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3924.923,
    "end": 3935.888,
    "text": " How will we even make the decisions of what terms to use and what senses and disambiguate the uses and the different corpuses that we are looking at?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3936.709,
    "end": 3940.17,
    "text": "So pretty interesting, this graphic, actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3940.19,
    "end": 3947.974,
    "text": "I hope any of the authors or anyone who is interested in this topic, what do you think about these doodles?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3949.354,
    "end": 3949.835,
    "text": "Do you agree?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3949.915,
    "end": 3950.235,
    "text": "Disagree?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3953.001,
    "end": 3955.243,
    "text": " Let's go to Blue's question about autopoiesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3955.743,
    "end": 3959.586,
    "text": "What is interesting or that about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3963.309,
    "end": 3970.054,
    "text": "Just really where it comes in, and I think we kind of brought it up earlier in the sharing of a model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3972.276,
    "end": 3981.163,
    "text": "So is sharing of a generative model necessary for self-assembly or even the attempt to share?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3981.932,
    "end": 3982.692,
    "text": " a generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3983.052,
    "end": 3987.133,
    "text": "Is that a necessary component of autopoiesis?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3988.073,
    "end": 3988.833,
    "text": "And at what level?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3988.994,
    "end": 3993.855,
    "text": "Like, organizationally, structurally, content-related, functionally, like, at all the levels?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3995.395,
    "end": 3997.555,
    "text": "I just wonder, like, how these things are related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3997.655,
    "end": 4009.678,
    "text": "And when we were talking earlier about having a conversation and trying to make your models align with one another through information sharing, and like we saw with the computational boundary of a self about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4010.245,
    "end": 4021.57,
    "text": " self-assembly and autopoiesis via Mike Levin, just about the informational sharing between subunits leads to the formation of a larger cognitive unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4022.15,
    "end": 4030.194,
    "text": "And so I was just wondering about model relationships and forming a larger cognitive unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4030.214,
    "end": 4034.135,
    "text": "Like we were talking about the conversation and then we formed with complete overlap of, yes, we get it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4034.555,
    "end": 4035.616,
    "text": "We grok, we're there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4036.096,
    "end": 4038.077,
    "text": "And then we form a larger cognitive unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4039.119,
    "end": 4041.421,
    "text": " Um, and is that on all aspects?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4041.501,
    "end": 4046.346,
    "text": "Is it just related to content structure, organization or function or all of the above?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4046.946,
    "end": 4048.948,
    "text": "Um, just what anybody thinks about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4051.05,
    "end": 4051.271,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4053.272,
    "end": 4058.798,
    "text": "So we saw this actually in Matt Sims earlier paper, the biological symbiosis, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4060.679,
    "end": 4060.9,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4063.68,
    "end": 4069.206,
    "text": " The autopoetic system is capable of producing and maintaining itself by creating its own parts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4069.906,
    "end": 4072.85,
    "text": "So it's kind of like the ship of Theseus plus crew.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4073.35,
    "end": 4080.838,
    "text": "They're able to be modifying and reconstructing the material basis of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4084.685,
    "end": 4094.469,
    "text": " On one hand, that maintains an organizational separation of like the cell and the surrounding in terms of the realist interpretation of a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4097.11,
    "end": 4108.395,
    "text": "At the same time, the autopoetic process does not need to have, well, it involves ingressing and outgressing material.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4109.115,
    "end": 4113.577,
    "text": "So that does blur the boundary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4114.577,
    "end": 4124.163,
    "text": " And structurally, it doesn't need to be the case that the autopoietic process of the cell has like a blueprint or a structural resemblance of the cell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4124.724,
    "end": 4130.047,
    "text": "It could just be subunits that are non-representational.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4130.748,
    "end": 4132.229,
    "text": "They cannot engage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4135.271,
    "end": 4142.636,
    "text": "It doesn't even make sense to ask whether the cognitive model has structural similarity with the target",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4144.315,
    "end": 4146.257,
    "text": " because it's a non-cognitive entity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4146.337,
    "end": 4160.368,
    "text": "And similarly, on the functional side, the enzymes can't engage in counterfactuals that synthesize the lipids and add them to the membrane.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4161.349,
    "end": 4166.373,
    "text": "So is information a representation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4172.088,
    "end": 4172.468,
    "text": " I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4172.769,
    "end": 4175.171,
    "text": "I mean, we're getting into the quantum now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4175.191,
    "end": 4179.835,
    "text": "So, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4180.015,
    "end": 4182.558,
    "text": "Where's information in this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4183.879,
    "end": 4191.966,
    "text": "It comes up in the paper 18, 17 times based on local information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4192.507,
    "end": 4194.629,
    "text": "Information comprises the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4197.093,
    "end": 4205.478,
    "text": " Past and present information, future information, information gain, no additional information about internal states, that's the Markov definition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4206.319,
    "end": 4217.946,
    "text": "High mutual information can be in the context of a non-representational generalized synchrony, like the pendulums that synchronize.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4219.027,
    "end": 4222.409,
    "text": "Where is information in this eight-fold distinction?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4223.47,
    "end": 4226.592,
    "text": "So the author talks about here, if I can read a quote quickly,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4227.899,
    "end": 4246.35,
    "text": " If one only appeals to the organizational aspect of representation, the presence of environmental or sensory motor or complex or frugal model does not matter insofar as the internal variables of the model are understood to be separated from external reality by a Markov blanket and the generative model is leveraged",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4246.85,
    "end": 4250.913,
    "text": " to infer the causal structure of external reality via self-evidencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4251.414,
    "end": 4263.303,
    "text": "However, these differences matter if one considers structural aspects and the degree of resemblance between hidden variables and environmental dynamics, as opposed to action or information gathering dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4265.105,
    "end": 4266.826,
    "text": "So, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4267.106,
    "end": 4275.773,
    "text": "Here the content of representations is used to draw a further distinction within the representational view between an internalist, sometimes called intellectualist or encodist,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4276.638,
    "end": 4279.06,
    "text": " versus an action-oriented perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4280.821,
    "end": 4281.081,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4283.743,
    "end": 4286.845,
    "text": "Probably one of the most thrilling academic debates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4288.006,
    "end": 4288.266,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4291.228,
    "end": 4295.731,
    "text": "Well, please don't judge what I'm about to say next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.991,
    "end": 4297.612,
    "text": "Just bear with me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4297.652,
    "end": 4298.032,
    "text": "Be kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4298.633,
    "end": 4301.775,
    "text": "So in this representation, for example, where we've got this table,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4302.805,
    "end": 4329.558,
    "text": " if we were to look at those lines, each one of those horizontal lines, because there's three IC, and each one of those vertical lines, because there's four IC, and we realized them as a standard XY graph, we know that there's a relationship between X and Y, that every one of those horizontal lines relative to Y has a zero component to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4330.489,
    "end": 4336.832,
    "text": " And we know that every one of those vertical lines relative to X has a zero component to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4337.593,
    "end": 4345.097,
    "text": "So most people will look at the blackness of that relative to the white background and they'll just see something material separating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4345.899,
    "end": 4364.871,
    "text": " But if we actually look at it graphically, and we take Daniel's idea of the tetrahedron, every time we round an edge and change direction on that tetrahedron, there is a zero element that allows for that boundary crossing that we, again, don't pay as much attention to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.912,
    "end": 4374.358,
    "text": "And so from an autopoetic standpoint, you can actually see where something like a Markov blanket both separates",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4375.607,
    "end": 4383.152,
    "text": " and leaves the potential open for that transfer or that crossing or that transition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.192,
    "end": 4395.019,
    "text": "So when we're modeling ourselves, the last paragraph of the section five of the paper, they wrote, arriving at an FEP as synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4396.039,
    "end": 4401.723,
    "text": "So some non-zero number and zero,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.85,
    "end": 4417.802,
    "text": " view depends upon which representational criterion we are assuming when either considering FEP central constructs or considering specific cognitive phenomena through the lens of a process theory under FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.363,
    "end": 4421.165,
    "text": "Do we include the zero piece of this or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.006,
    "end": 4422.666,
    "text": "Tentatively?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4423.787,
    "end": 4424.167,
    "text": "Fully?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4424.928,
    "end": 4426.509,
    "text": "Or do we willfully ignore it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4428.05,
    "end": 4431.733,
    "text": "Hence, in the end, the debate about FEP may reveal more about us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.871,
    "end": 4457.13,
    "text": " our criteria whether we want this to be a material thing and not not include the zero aspect of it and our interest in particular facets of cognition than does about the representational status of fep so i just want to kind of bring that again don't judge me because i i could be way wrong here and i may be overfitting but i think that the autopoetic part of it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.169,
    "end": 4465.996,
    "text": " We can see both the separation and we can see the portal in a line if we choose to include both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.057,
    "end": 4468.978,
    "text": "That's kind of what I wanted to bring up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4471.781,
    "end": 4472.101,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4472.762,
    "end": 4473.803,
    "text": "Very interesting, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4473.843,
    "end": 4474.103,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4476.986,
    "end": 4480.148,
    "text": " Here's the unfolded tetrahedra.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4481.409,
    "end": 4485.552,
    "text": "There's a few shapes of paper that can be folded into a tetrahedra.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4485.812,
    "end": 4494.698,
    "text": "One looks more like a parallelogram and one looks more like an equilateral triangle where it just kind of like folds up like the petals of a flower.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4496.28,
    "end": 4498.041,
    "text": "So these zero lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4499.102,
    "end": 4503.765,
    "text": "So there's the zero point of within a facet,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4505.484,
    "end": 4526.169,
    "text": " representational and non-representational that's almost like the two sides of the paper like how many triangles are here oh four how about eight how many units how many triangle units of paint do you need to paint this four no eight two sides so the zero is like the thickness of the paper and that's also when you fold it up that's like inside versus outside of the tet",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4527.182,
    "end": 4547.556,
    "text": " And then these zero Y lines are like the movements from one face to another face, where it's also thin enough as to be imperceptible, especially when it's laid flat, but it makes all the difference to move from one side to another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4551.879,
    "end": 4552.319,
    "text": "How do we use...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4554.258,
    "end": 4571.566,
    "text": " Moving through zero in this eightfold or other cognitive models, how do we use that to increase the efficacy or the fluidity or the accessibility of models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4574.848,
    "end": 4581.651,
    "text": " Does it help us in explaining that we're not locked out of that self-organization loop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.291,
    "end": 4584.092,
    "text": "That we can actually participate in it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.633,
    "end": 4588.394,
    "text": "Is that the first thing that it tells us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.575,
    "end": 4597.278,
    "text": "That we're not locked out of that ability to self-generate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4601.445,
    "end": 4602.405,
    "text": " That was a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.445,
    "end": 4604.446,
    "text": "I wasn't questioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.507,
    "end": 4607.528,
    "text": "It was like an honest, sincere question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4611.85,
    "end": 4612.731,
    "text": "I think so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4614.671,
    "end": 4621.735,
    "text": "One supportive or complimentary component would be, this is sort of a map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4622.515,
    "end": 4623.716,
    "text": "This is like a cognitive map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4623.816,
    "end": 4626.957,
    "text": "And someone could say, this side of the paper is better than the other side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4627.858,
    "end": 4629.279,
    "text": "And this is my favorite face.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4630.442,
    "end": 4653.923,
    "text": " it's presented as part of a larger knowledge structure such that the learner could engage in counterfactuals like what if we were on the other side of the paper or what if we were on a different face so this allows for example individuals to reflect their understanding of the lay of the land but also communicate their preferences",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4654.898,
    "end": 4661.141,
    "text": " And as the paper shows, different individuals do have different outcomes in terms of their cognitive conclusions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4661.861,
    "end": 4664.942,
    "text": "And that's what reveals the super fascinating thing about us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4665.783,
    "end": 4668.584,
    "text": "And that's why the paper is modeling ourself",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4669.505,
    "end": 4682.928,
    "text": " what the free energy reveals about our implicit notions of representation, not free energy principle modeling representation, what the free energy principle reveals about representation, which would be a slightly different paper and title.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4685.069,
    "end": 4698.252,
    "text": "So just the scholarship and the sense-making phase that only very few have to engage in, like Sims and Pizzulo have, is to make these",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4700.163,
    "end": 4728.64,
    "text": " maps and then bring the perspectives that were not integrated to be shown as just different locations in a phase space like we put four zeros but so it's not as simple as just like two numbers but you know if there was if it was just two topics being against each other",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4729.682,
    "end": 4732.625,
    "text": " Every perspective could have a position in that phase space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4735.048,
    "end": 4736.329,
    "text": "And then what do we do with that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4742.676,
    "end": 4743.257,
    "text": "Yes, Danielle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4744.799,
    "end": 4748.202,
    "text": "I guess I'm thinking about the ourselves part of modeling ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4748.382,
    "end": 4749.544,
    "text": "I'm not really thinking about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.077,
    "end": 4754.039,
    "text": " all humans and the way that our minds work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.099,
    "end": 4761.807,
    "text": "It's more of the academic conversations that have been happening around the sort of intellectual tradition that's been happening around representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4761.907,
    "end": 4770.937,
    "text": "And so the contribution of this paper, as I see it, is that, look, we've got this framework that does a lot of work for us in a lot of different disciplines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4771.037,
    "end": 4774.18,
    "text": "And if we apply it to this conversation, this intellectual debate,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4774.901,
    "end": 4779.024,
    "text": " that's been happening, we can reveal implicit assumptions of the debate itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.264,
    "end": 4792.834,
    "text": "And what emerges is that perhaps as an artifact of particular examples that have been used to understand representation, we see one side of the coin or another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4792.994,
    "end": 4796.857,
    "text": "We can see these, we pull on these different dimensions that are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4797.307,
    "end": 4798.308,
    "text": " laid out in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4798.388,
    "end": 4803.591,
    "text": "So I guess it's just important to think about and disagree if you disagree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.651,
    "end": 4810.635,
    "text": "But the ourselves is really just about the way that philosophers and cognitive scientists have been thinking about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.695,
    "end": 4811.896,
    "text": "Nothing is true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4812.597,
    "end": 4815.238,
    "text": "This is not revealing something about cognition per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4815.678,
    "end": 4822.943,
    "text": "It's more about the implicit assumptions that have been kind of unfolding and how we're thinking about the discipline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4825.506,
    "end": 4826.066,
    "text": " Thanks for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4827.287,
    "end": 4847.735,
    "text": "Just like there was a sort of hinge on the functional being used in two different ways, another sense of representation, one that might be more commonly used outside of cognitive science would be like representation in terms of different perspectives or identities in a group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4848.655,
    "end": 4852.317,
    "text": "And then that made me think of nothing about us without us,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4853.297,
    "end": 4865.028,
    "text": " which is used in different contexts, but basically has to do with participatory decision-making that decisions are not being made in a way removed from the people who it influences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4865.989,
    "end": 4871.134,
    "text": "And that has to do with representation, no taxation without representation, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4871.895,
    "end": 4873.457,
    "text": "And so cognitive science is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4874.477,
    "end": 4877.7,
    "text": " is actually in a nothing about us without us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4878.44,
    "end": 4887.108,
    "text": "Because if there's just an academic discussion, especially an unexamined one with a lot of implicit baggage about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4888.169,
    "end": 4892.331,
    "text": " a hyper-intellectualized, hyper-abstracted scenario.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4892.732,
    "end": 4897.354,
    "text": "Or like, we like to study representational organizational cases where it's super clean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4897.434,
    "end": 4898.455,
    "text": "These are the ones that we study.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4898.495,
    "end": 4899.536,
    "text": "These are the model systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4899.616,
    "end": 4903.998,
    "text": "These are the kind of careers that have been built in academia, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4905.099,
    "end": 4912.503,
    "text": "But it's about us in the broader sense, like humans, and then even us as cognitive entities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4913.444,
    "end": 4913.824,
    "text": "And so...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4915.327,
    "end": 4927.775,
    "text": " it is the philosophers and the literature that is in this paper, as Danielle kind of highlighted, that's the modeling ourself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4929.075,
    "end": 4940.583,
    "text": "The selves there are the participants in the discussion around representation, which of course has been textual, abstract, English speaking,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4941.772,
    "end": 4944.234,
    "text": " qualitative, other adjectives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4945.755,
    "end": 4948.497,
    "text": "So it's another interesting connection there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4948.717,
    "end": 4948.937,
    "text": "Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4951.579,
    "end": 4963.367,
    "text": "So definitely the subjectivity that Danielle highlighted is a big part of perhaps why we have these organizational, structural, these different viewpoints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4964.007,
    "end": 4970.392,
    "text": "But maybe something that I don't think is really emphasized too much in this paper is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4971.404,
    "end": 4976.768,
    "text": " is kind of the realist versus instrumentalist viewpoint of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4976.848,
    "end": 4983.153,
    "text": "And so there's a pretty big argument in the literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4983.293,
    "end": 4993.24,
    "text": "And I think probably the math is not the territory maybe gets into it the best, maybe, or in the most detail of the papers that we've studied here on this stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4993.34,
    "end": 4994.041,
    "text": "But there's,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4996.67,
    "end": 5004.558,
    "text": " people that say like active inference is a way to model the cognitive process or the action perception process that we all undergo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5005.078,
    "end": 5011.424,
    "text": "And then there are people who say that this is actually happening in a computational way in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5011.704,
    "end": 5014.727,
    "text": "It's not a model of, it is how it works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5015.748,
    "end": 5021.053,
    "text": "And so there's this ongoing like vision fusion feud",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5022.168,
    "end": 5024.53,
    "text": " happening in the active inference community also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5024.61,
    "end": 5030.934,
    "text": "And I just wanted to highlight that because, yeah, because you may not know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5030.954,
    "end": 5031.655,
    "text": "Thanks a lot, Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5031.835,
    "end": 5042.903,
    "text": "I pulled out a few quotes because I also noticed that when we, it was one of the earlier quotes when we were talking about the, I think, organizational element.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5044.564,
    "end": 5050.969,
    "text": "So look at how often reality comes into play in these conversations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5052.162,
    "end": 5054.123,
    "text": " Discussion, so internal variables of a model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5054.803,
    "end": 5056.664,
    "text": "Okay, so we're talking about instrumentalism, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5056.824,
    "end": 5062.445,
    "text": "Like models are understood to be separated from external reality by a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5062.726,
    "end": 5064.246,
    "text": "Wait, reality?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5065.907,
    "end": 5073.369,
    "text": "And the generative model, model, is leveraged to infer the causal structure of external reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5075.89,
    "end": 5081.372,
    "text": "So it flips four times in that sentence",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5082.861,
    "end": 5091.828,
    "text": " from reality, from model to reality, back to model, back to reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5095.731,
    "end": 5098.353,
    "text": "It doesn't make it right or wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5099.794,
    "end": 5103.077,
    "text": "It's just a very interesting epistemic artifact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5107.761,
    "end": 5110.163,
    "text": "Because within the reality of the model,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5111.209,
    "end": 5118.232,
    "text": " like the reality of the map, it is the case that the internal variables are separated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5120.613,
    "end": 5132.618,
    "text": "And if the model is trying to do determination on that level of reality, like maps trying to infer maps, that is reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5134.658,
    "end": 5137.96,
    "text": "But then that's not the sort of layer one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5139.33,
    "end": 5142.784,
    "text": " external reality in the sense that many people often mean or use it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5143.025,
    "end": 5143.186,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5144.65,
    "end": 5153.853,
    "text": " Yeah, I think, Danny, if you take the words reality and model and push them out into even more extreme tales, you could see the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5153.893,
    "end": 5160.075,
    "text": "You could see people who are pushing back against the model idea, and they're arguing you're just too rigid, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.115,
    "end": 5161.315,
    "text": "You're just too stuck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5161.855,
    "end": 5169.518,
    "text": "And you can see people that are taking the non-representational sort of reality view, the variance view,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.384,
    "end": 5178.569,
    "text": " maintained or retained view as say, you can see the people that are on the model end of the continuum saying, that's just chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.049,
    "end": 5186.374,
    "text": "There's nothing about that that we can actually make sense of because the cognitive overload right now is just swamping me, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5186.875,
    "end": 5191.118,
    "text": "And so I think what these authors were trying to do is say, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5192.082,
    "end": 5206.527,
    "text": " Can we move back and forth instead of getting stuck on those really far out positions in terms of this way of being able to see when we have these densities, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5206.647,
    "end": 5215.991,
    "text": "And then how do those densities re-reset back to some sort of invariance and then re-reform?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5217.267,
    "end": 5217.527,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5217.947,
    "end": 5238.994,
    "text": "So I think that's, I hope that kind of speaks to what Daniel was saying too, because sure, we can point out the most extreme example, like at the very end of the continuum, or we can actually talk about how we're going to draw these unidirectional or bidirectional lines and boundary cross.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5239.815,
    "end": 5243.396,
    "text": "And I think that's what they were trying to open our thinking up to, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5244.284,
    "end": 5247.625,
    "text": " Maybe I'm just being Pollyanna here because I really like the paper animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5253.086,
    "end": 5255.787,
    "text": "Interesting point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5256.367,
    "end": 5263.428,
    "text": "Realism is also used in another way, which is kind of like it's a school of literature or a thread of literature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5264.309,
    "end": 5270.13,
    "text": "And so then I found this paper, Affect of Realism, Evoke Realism Beyond Representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5272.227,
    "end": 5274.368,
    "text": " And so this is in the case of literary expression.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5275.048,
    "end": 5277.829,
    "text": "So that's an activity that cognitive entities are engaged in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5279.31,
    "end": 5288.033,
    "text": "And we just see a lot of terms that we talk about in ACT-INF, like agency, affect, process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5289.173,
    "end": 5295.956,
    "text": "And here it's not about reality, realism, territory, it's like realization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5297.014,
    "end": 5298.575,
    "text": " And realization is an interesting word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5299.056,
    "end": 5305.561,
    "text": "And I know Verveke and others use it as well because realization, it is about the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5306.322,
    "end": 5311.146,
    "text": "But when something is realized, it becomes real in the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5312.267,
    "end": 5319.894,
    "text": "But usually we wouldn't say that something is realized like, oh, I just realized that zebras have nine legs, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5320.333,
    "end": 5330.541,
    "text": " It's like you engaged in a counterfactual, but is it a realization if the model is updated in a way that isn't concordant with reality?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5331.482,
    "end": 5348.636,
    "text": "And I agree that the paper gives us a lot of nuance to talk about these areas because we can talk about how, well, the isolation of the variables doesn't change, or the structure of the legs and the zebra",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5349.622,
    "end": 5353.283,
    "text": " doesn't change or it can still run, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5353.843,
    "end": 5355.464,
    "text": "So why not nine legs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5355.984,
    "end": 5356.964,
    "text": "Is it still a zebra?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5356.984,
    "end": 5376.95,
    "text": "There's a lot of open threads, but the way that they use model and reality in light of a lot of the other discussions we've had is really illustrative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5381.035,
    "end": 5381.255,
    "text": " Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5383.476,
    "end": 5390.62,
    "text": "So one of my favorite things to think about in terms of the realism versus the instrumentalism is the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5391.38,
    "end": 5396.323,
    "text": "I was looking for the picture of the person sleeping under the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5396.383,
    "end": 5402.866,
    "text": "Really, as a partition for a system, do systems have Markov blankets?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5403.486,
    "end": 5407.248,
    "text": "Or can they be modeled with Markov blankets?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5407.328,
    "end": 5408.389,
    "text": "And I always just like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5408.939,
    "end": 5412.48,
    "text": " Think of that cute little picture with the little person sleeping under the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5412.56,
    "end": 5414.36,
    "text": "Like, do I have Markov blanket wrapped around me?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5414.96,
    "end": 5420.321,
    "text": "Um, because that's really where it, um, tends to break down in my mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5420.361,
    "end": 5422.081,
    "text": "It's like, yes, there's a boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5422.101,
    "end": 5429.703,
    "text": "Um, but I'm not sure that it's a fist and blanket or a Pearl blanket or a Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5429.843,
    "end": 5431.983,
    "text": "Like maybe it's just skin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5432.784,
    "end": 5435.204,
    "text": "Um, yes, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5438.363,
    "end": 5465.061,
    "text": " I hate answering a question with another question but in the conclusion of the paper the authors speak specifically to the free energy principle can be very heuristic and so I'm wondering in the instrumentalist versus realist debate whether it has to necessarily get up to that abstract level of Markov blanket or whether we can just say that sandwiched between those two are rules that we demarcate, that we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5466.142,
    "end": 5472.125,
    "text": " we lay down and that we have act as a parsing mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.686,
    "end": 5472.946,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.966,
    "end": 5473.646,
    "text": "What do you think, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5474.747,
    "end": 5484.072,
    "text": "Like our rules are rules, things that we can just get our hands on right today instead of having to go all the way up to figuring out what a Markov blanket is under this set of circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5485.074,
    "end": 5486.535,
    "text": " No, I think definitely rules, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5486.655,
    "end": 5490.358,
    "text": "So, I mean, we all agree that there are laws in physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5490.418,
    "end": 5493.1,
    "text": "Like, if you drop an apple, it will fall to the floor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5493.7,
    "end": 5495.821,
    "text": "Like, we all abide by these rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5496.182,
    "end": 5507.009,
    "text": "They might not apply at every scale, but I definitely think that a rule-based construction or understanding, like, does that then bridge the realism versus instrumentalism debate, perhaps?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5507.029,
    "end": 5510.852,
    "text": "So...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5513.018,
    "end": 5519.543,
    "text": " Building on the point that the ourselves in the title is the people reading the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5520.584,
    "end": 5527.529,
    "text": "So not just like people in the psych department, but it's the ourselves, the people who are in that epistemic commons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5529.991,
    "end": 5541.219,
    "text": "So using that, but also the content related representations in terms of correctness or truth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5543.041,
    "end": 5561.687,
    "text": " So if the ourselves are those who are pondering FEP, then the heuristic that they refer to, we conclude by highlighting the heuristic power of the FEP to advance our understanding of the notion of internal representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5563.047,
    "end": 5569.729,
    "text": "It is pretty meta because we're representing the debate about people representing the debate about representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5571.75,
    "end": 5572.09,
    "text": "However,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5573.115,
    "end": 5602.701,
    "text": " the fact that it has a heuristic utility within the content related aspect at the very least it does have representational impact i'm not sure where that takes us there's probably other ways to take it but i think something about um the diversity of conclusions that people have and how that shines a light back on us or is a mirror",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5604.312,
    "end": 5621.421,
    "text": " and how the FEP has been applied here in this paper as a heuristic for sense-making in this meta-debate says something, I hope.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5621.621,
    "end": 5621.941,
    "text": "Danielle?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5625.083,
    "end": 5628.204,
    "text": "I hope I'm addressing what you're saying and not taking this in another direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5630.879,
    "end": 5639.382,
    "text": " Stepping back, I'm thinking of FEP as just one of many different tools of thought that we have that allow us to align our representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5639.982,
    "end": 5646.925,
    "text": "And if it is an effective tool, we all start having a conversation that makes sense to each other, that's mutually intelligible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5649.706,
    "end": 5652.347,
    "text": "In this case, it is kind of meta because it's about how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.479,
    "end": 5660.382,
    "text": " the academics, the intellectual conversation about representations have failed to converge on something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5660.422,
    "end": 5661.322,
    "text": "There's this debate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5661.362,
    "end": 5662.963,
    "text": "There are many layers of the debate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5663.523,
    "end": 5666.324,
    "text": "And so what it reveals is that we haven't yet converged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5666.905,
    "end": 5668.145,
    "text": "The community hasn't converged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5668.165,
    "end": 5669.126,
    "text": "And so FEP is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5670.37,
    "end": 5680.714,
    "text": " is this thing that we can use that reveals those things and allows us to then better, because it's revealing these things, we can all attend to those things that were implicit and are now made explicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5680.794,
    "end": 5683.134,
    "text": "We're converging our representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5683.334,
    "end": 5685.155,
    "text": "So I think that kind of addresses what you're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5685.195,
    "end": 5696.879,
    "text": "It's about representations, but it's also this tool, like there are many other types of tools that allow us to realize what we've been taking for granted and align our representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5699.073,
    "end": 5699.533,
    "text": " Thanks a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5700.274,
    "end": 5700.514,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5701.816,
    "end": 5709.363,
    "text": "Yeah, just to add on to that, if you're like me, you think rules and tools are interchangeable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5710.744,
    "end": 5719.472,
    "text": "And the other thing you think is that if it's a heuristic, it speaks kind of to that vicarious function in terms of content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5720.153,
    "end": 5724.397,
    "text": "So I just want to throw that on top because I think there's some agreement around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5729.295,
    "end": 5737.219,
    "text": " We use the rules to make that next vicarious play before we make the next move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.819,
    "end": 5744.763,
    "text": "So, I mean, anybody that doesn't is kind of kidding themselves, I think, but maybe I'm wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5747.671,
    "end": 5751.774,
    "text": " Okay, here's a little bit of FEP in a heuristic case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5752.294,
    "end": 5774.331,
    "text": "So we've talked about the Helmholtz decomposition of vector fields, like in stream number 32, about how there's this pragmatic or sort of hill climbing or gradient descending component, whether you take the optimistic biology, climbing mountain probable, go straight up the mountain of fitness, or the physicist's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5775.216,
    "end": 5777.058,
    "text": " gradient descent into the bottom of the well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5778.078,
    "end": 5782.823,
    "text": "In either case, there's that irrotational component that's associated with pragmatism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5783.483,
    "end": 5788.728,
    "text": "And then there's this epistemic component that's associated with the solenoidal isocontour.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5789.068,
    "end": 5791.53,
    "text": "So we've talked about that Helmholtz decomposition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5792.291,
    "end": 5796.534,
    "text": "So here's one way in which the FEP is being heuristically applied.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5797.555,
    "end": 5802.94,
    "text": " So Danielle said, the academic conversation on representation has not converged.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5803.081,
    "end": 5805.543,
    "text": "And it has not converged.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5805.883,
    "end": 5809.607,
    "text": "And it has also not even cohered.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5810.828,
    "end": 5813.531,
    "text": "Like there isn't a shared ontology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5813.591,
    "end": 5814.612,
    "text": "There's not a shared narrative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5814.912,
    "end": 5819.296,
    "text": "There's not shared words or regime of attention or what people are even focused on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5820.29,
    "end": 5830.233,
    "text": " And so what the FEP is doing literally like they did here with this distinction, it does a few things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5830.553,
    "end": 5833.854,
    "text": "It holds space for not overfitting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5833.894,
    "end": 5839.615,
    "text": "Like let's just say in 2055, all the people in the world or all the cognitive scientists, they all agreed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5839.895,
    "end": 5840.816,
    "text": "Oh great, we converged.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5841.656,
    "end": 5842.396,
    "text": "Let's lock that in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5843.376,
    "end": 5848.958,
    "text": "But FEP even then will remind us like not to overfit",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5850.612,
    "end": 5853.875,
    "text": " and also not to center one side of the tetrahedra.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5854.195,
    "end": 5870.829,
    "text": "We could say, this is the side that has these attributes, or we focus on this side for these reasons, and no one goes there to this other side, or there's a reason why we don't go there, or we take a journey, we travel through there, but we don't live there or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5872.691,
    "end": 5878.916,
    "text": "It brings a level of coherence to the discussion that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5880.911,
    "end": 5899.245,
    "text": " doesn't necessarily have the goal of perfect static convergence but still there'll be solenoidal flow and differences in opinion even then um who said the fep wasn't useful",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5904.002,
    "end": 5908.685,
    "text": " Well, and maybe this is obvious, but is that not what any good theory does?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.805,
    "end": 5912.847,
    "text": "Like Blue said, well, gravity is true because if I drop an apple, it will fall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5912.967,
    "end": 5915.408,
    "text": "Yeah, so the theory of gravity does the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5915.448,
    "end": 5918.97,
    "text": "It allows us to kind of converge our representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5919.03,
    "end": 5921.972,
    "text": "It's just that the theory of gravity is not itself about representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5926.182,
    "end": 5941.751,
    "text": " Yes, this is like the hall of mirrors, this paper and conversation, because it is like, it's the group of people in the hall of mirrors and they're all wearing mirror suits in a weird way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5942.311,
    "end": 5953.538,
    "text": "But it is our gem for building the kind of frameworks that then can reduce our uncertainty a ton",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5954.755,
    "end": 5956.576,
    "text": " potentially in similar cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5957.537,
    "end": 5968.405,
    "text": "And the strange loop of reflexive cognitive entities is going to be this open-ended bount for a long time to come.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5969.006,
    "end": 5979.254,
    "text": "But just like how we started here with a really complex reciprocal case of two adaptive entities, but then it was a lot less ambiguous here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5981.936,
    "end": 5982.576,
    "text": "And I wonder if...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5984.298,
    "end": 6013.182,
    "text": " active informed system design will frame an increasing amount of pieces especially in a digital world into this bottom tier offloading some of the repetitive tasks attention consuming tasks anxiety producing stimuli into these type of interactions which opens up new spaces for these kinds of interactions with the two adaptive entities",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6020.578,
    "end": 6029.521,
    "text": " To return to that having or possessing a Markov blanket, just one quick point was, which we already even read the quote, which was a core aspect of FEP, such as the possession of a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6030.201,
    "end": 6034.323,
    "text": "So is the Markov blanket the system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6035.343,
    "end": 6036.684,
    "text": "Or does it have one?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6037.004,
    "end": 6037.904,
    "text": "Those are both realist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6038.424,
    "end": 6040.825,
    "text": "Or is it modeled as having?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6040.965,
    "end": 6042.386,
    "text": "Is it modeled as being?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6042.646,
    "end": 6045.127,
    "text": "Those are instrumentalist ways of similar framings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6045.727,
    "end": 6047.967,
    "text": "And how do we know what the core aspects are?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6049.188,
    "end": 6049.348,
    "text": "What",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6051.445,
    "end": 6070.579,
    "text": " does that stem from so there's a ton to learn and discuss there and then let's look at any in just our last few minutes any of the other topics and if anybody wants to highlight one of these or also maybe as we jump off from 36.2 to 37 and beyond",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6074.775,
    "end": 6096.549,
    "text": " when we discuss free energy a user's guide but also we just continue on our paths like why does it matter not all these papers maybe make the argument for why this whole representation debate matters so what is the pragmatics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6098.396,
    "end": 6114.339,
    "text": " that make this meaningful, make it important to fund people working on it or the way that it influences the technologies that we're developing rather than just a pure info gain reduction of uncertainty question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6115.659,
    "end": 6125.901,
    "text": "So any topics here or any like thoughts on how this will or could or should influence our action selection going forward?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6140.413,
    "end": 6145.601,
    "text": " I'm comfortable with long silences, but I'm going to throw this out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6149.454,
    "end": 6174.346,
    "text": " I think people will be able to use this tool to become more creative, not just be able to reduce or minimize their prediction errors, but actually have the confidence to come up with new and different ways of looking at problems that we probably didn't have in our toolkit before in terms of being able to come up with something different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6175.546,
    "end": 6176.387,
    "text": "And so I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6179.627,
    "end": 6191.991,
    "text": " the first thing that it does is it allows for a boundary crossing that maybe we constructed in our minds before, but we're seeing less and less of it as being a hard stop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6192.771,
    "end": 6195.072,
    "text": "And there's now maybe a little bit more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6198.894,
    "end": 6201.416,
    "text": " More say in whether to go or don't go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6201.856,
    "end": 6207.42,
    "text": "So that's what I would think that this kind of work is maybe opening up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6207.96,
    "end": 6209.441,
    "text": "Unless somebody comes and shuts it down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6210.742,
    "end": 6216.106,
    "text": "And I can't speak to what outside forces would find terribly threatening, but I'm sure there are some out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6219.448,
    "end": 6219.889,
    "text": "Outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6221.43,
    "end": 6221.57,
    "text": "Luke?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6224.159,
    "end": 6236.836,
    "text": " so I'm not sure if this has any pragmatic value, but I'm, I'm certainly interested in kind of really exploring like sensory motor engagement and structural representation and maybe like synesthesia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6236.856,
    "end": 6239.38,
    "text": "I know Daniel's been to Meow Wolf, but like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6239.78,
    "end": 6246.508,
    "text": " You know, when you're playing these invisible, like the invisible harp, you know, and it's like, could you structure a room, like draw a map in a room?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6246.548,
    "end": 6253.736,
    "text": "And your goal is to like, kind of like an escape room, but your goal is to find, navigate your way through based on sound, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6253.756,
    "end": 6255.918,
    "text": "Like you ting the things and you have to find the right sound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6255.958,
    "end": 6260.784,
    "text": "You're playing Mary Had a Little Lamb and then you get to your prize at the end or you get to get out of the room at the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6261.284,
    "end": 6275.311,
    "text": " So I wonder creatively, like Dean was saying, like really these maps, these representations, can we get literally out of our own representation and into the feeling of an alternate representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6275.631,
    "end": 6277.492,
    "text": "And what would that feel like or be like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6277.512,
    "end": 6279.173,
    "text": "And that's also why I brought up like blindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6279.193,
    "end": 6283.515,
    "text": "Like, you know, if you ever wake up and like a totally, like my power went out the other night and it was like black.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6284.062,
    "end": 6285.403,
    "text": " I mean, no moon, nothing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6285.583,
    "end": 6287.524,
    "text": "It's just like, whoa, total darkness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6287.884,
    "end": 6290.905,
    "text": "No little blue light from the plug or nothing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6291.225,
    "end": 6298.789,
    "text": "So in these total darkness situations, you have this representation of what does my house look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6299.109,
    "end": 6300.069,
    "text": "Where's my flashlight?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6300.29,
    "end": 6305.512,
    "text": "You have to be able to navigate yourself in a totally dark situation, which is very foreign.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6305.956,
    "end": 6307.016,
    "text": " to go find a flashlight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6307.237,
    "end": 6320.982,
    "text": "And so I like these kind of boundary pushing experiences because they really force us to examine our own model and perhaps allow us to explore the kind of models that other people use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6324.163,
    "end": 6332.026,
    "text": "Thinking through other minds is this case with adaptive agents in dialogue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6333.152,
    "end": 6358.068,
    "text": " And it's like thinking through other representations and this paper and discussion opens up not to then simply converge, but opens up and holds ways to think and act through other types of representations, not just the same type, but in a different cognitive entity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6363.982,
    "end": 6388.005,
    "text": " it comes up a lot and it'd be awesome to see how just as so many other themes that we've had raised by very prescient papers like 14 math is not the territory 20 emperor's new markov blanket and some of the further nuancing about the markovian assumptions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6390.416,
    "end": 6406.572,
    "text": " this representational and non-representational and these words like organization structure content and function they will come up again and maybe they'll be citing this paper maybe they won't but like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6407.662,
    "end": 6414.248,
    "text": " It's almost like when we see in a future paper, just one facet of the Tet and they'll say, here's how it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6414.668,
    "end": 6415.569,
    "text": "It's this one side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6415.609,
    "end": 6419.813,
    "text": "It's like, well, no, there's other sides and we could be inside or we could be outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6420.774,
    "end": 6431.464,
    "text": "And someone could still say, I prefer this one, but we know there's a bigger system that we can at least come to the table around Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6434.075,
    "end": 6438.157,
    "text": " I'm not marketing, but it's going to come up in 37.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6438.277,
    "end": 6441.059,
    "text": "It's going to come up a bunch of times in 37.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6441.759,
    "end": 6443.26,
    "text": "So that's just the next paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6444.641,
    "end": 6451.244,
    "text": "So anyway, hold on to your socks because if you think you have to wait for it to come up again, it's going to come up again next week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6452.905,
    "end": 6453.945,
    "text": "Don't touch that dial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6460.728,
    "end": 6463.289,
    "text": " Thanks a lot for the awesome sequence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6463.489,
    "end": 6471.25,
    "text": "This was a somewhat complex or intellectual paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6471.27,
    "end": 6479.812,
    "text": "I mean, they're all written, but this one was like challenging topics, a lot of different perspectives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6480.852,
    "end": 6482.993,
    "text": "And then not only did they",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6485.106,
    "end": 6512.756,
    "text": " hold it open for all of the different perspectives, but then rather than pick a winner, they flipped the table in the end and posed it not as an answered competition for us to then have like domain specific clarity of action within, but really a challenge on multiple levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6513.68,
    "end": 6519.202,
    "text": " for researchers who are familiar with FEP and not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6522.223,
    "end": 6531.826,
    "text": "The big question we asked was, can the free energy principle help us advance or even resolve the long lasting debate on internal representation in philosophy of mind?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6534.647,
    "end": 6535.508,
    "text": "We certainly asked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6538.989,
    "end": 6539.089,
    "text": "So,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6540.799,
    "end": 6548.784,
    "text": " If anybody has any last comments they wanna make on anything, they're welcome to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6553.347,
    "end": 6555.368,
    "text": "The last word, so I'll get this in real quick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6555.508,
    "end": 6569.637,
    "text": "I think that if we're still arguing about whether or not representation and modeling is heavily dependent, like that there is a dependency, I think that the more philosophical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6571.311,
    "end": 6587.899,
    "text": " views that we see come up around FEP and active inference, the harder and harder it is to make the case that we can remove that dependency or somehow just see the scale-free aspects of this tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6588.68,
    "end": 6595.363,
    "text": "That there's actually a heavy dependency on what we're going to get out of representation or non-representation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6596.578,
    "end": 6604.209,
    "text": " based on our awareness or our realization that every time we cross a boundary, that is just an independent act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6604.249,
    "end": 6606.112,
    "text": "That's a highly dependent act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6606.272,
    "end": 6607.915,
    "text": "So that'll be my last word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6612.04,
    "end": 6614.802,
    "text": " So I just want to give a final comment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6615.163,
    "end": 6622.248,
    "text": "You know, we talk about instrumentalism and realism, and then there's like the third axis of utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6622.909,
    "end": 6641.364,
    "text": "And I really think that this paper was super useful in prompting new questions and holding up these different views of representation and non-representation and in these different categories and allowing us to really kind of view them through like a partitioned framework that I think will drive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6642.133,
    "end": 6650.096,
    "text": " future questions and really be useful in helping researchers formulate their theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6651.617,
    "end": 6651.877,
    "text": "Great."
  },
  {
    "start": 6656.319,
    "end": 6661.021,
    "text": "Danielle, if you're still here, thanks for joining for your first stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6661.061,
    "end": 6662.522,
    "text": "Do you have any last comments?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6664.622,
    "end": 6666.803,
    "text": " Well, this was a wonderful introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6666.823,
    "end": 6671.406,
    "text": "I'm curious how representative it is of other conversations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6671.426,
    "end": 6674.887,
    "text": "It was super heady in a really pleasant way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6676.928,
    "end": 6680.23,
    "text": "It was not representative or representational of other conversations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6680.29,
    "end": 6680.45,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6681.751,
    "end": 6683.712,
    "text": "Thanks a lot for the awesome convo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6683.872,
    "end": 6688.454,
    "text": "Everyone's always welcome to join these discussions or other lab activities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6688.534,
    "end": 6692.476,
    "text": "So thanks again to the authors and all the participants here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6692.496,
    "end": 6692.556,
    "text": "See",
    "speaker": "SPEAKER_03"
  }
]