[
  {
    "start": 26.032,
    "end": 27.656,
    "text": " All right, hello and welcome everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 28.618,
    "end": 31.104,
    "text": "It is Act Inflab live stream number 36.0 and it's January 13th, 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.523,
    "end": 37.165,
    "text": " Welcome to the ACT-INF Lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.745,
    "end": 43.17,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.53,
    "end": 45.292,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 46.433,
    "end": 52.018,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.358,
    "end": 57.343,
    "text": "And also, if you're watching along live, please write any comments or questions you have in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.524,
    "end": 64.768,
    "text": " All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.928,
    "end": 69.731,
    "text": "And thanks, Blue, for helping a lot with those slides and for coming on, because this will be a fun convo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 71.512,
    "end": 79.217,
    "text": "Go to ActiveInference.org to learn more about how to participate in any of the lab activities or bring some new idea to the lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 81.624,
    "end": 103.82,
    "text": " okay here we are in live stream number 36 in the second half of january 2022 and the goal is to learn and discuss this paper by matt sims and giovanni pizzulo from 2021 the paper is called modeling ourselves what the free energy principle reveals about our implicit notions of representation and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 104.66,
    "end": 110.868,
    "text": " As with all .Zero videos, the video is an introduction for some of the ideas and a hasty review.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 111.569,
    "end": 113.831,
    "text": "So it's not a review or a final word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 114.072,
    "end": 122.882,
    "text": "We're going to have the upcoming two weeks to talk more about this paper and hopefully talk to some of the authors or any other people who are interested in this idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 123.863,
    "end": 146.322,
    "text": " and uh get involved if you want to talk about the paper so let's just start with saying hello and an introduction and then what we were excited to read about the paper i'm daniel i'm in california and was excited to read yet another paper on representations and the fep because it feels like we had a stretch back there of five in a row or something what about you blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 150.071,
    "end": 158.017,
    "text": " I'm blue, I'm in New Mexico and I really enjoyed Matt Sims paper on symbiosis that we did a while ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.257,
    "end": 173.81,
    "text": "And I thought this paper was really neat and really a clear elucidation of the different categories of representation and how like there's overarching like representation and non-representation and then several different layers within that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.85,
    "end": 179.234,
    "text": "So I thought it broke it down in a really clear and concise way, even though it's a lot of material to digest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.148,
    "end": 184.53,
    "text": " Want to ask the big question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 186.191,
    "end": 186.431,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.591,
    "end": 197.459,
    "text": "The big question of the article was, can the free energy principle help us advance or even resolve the long lasting debate on internal representation in philosophy of mind?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.723,
    "end": 202.044,
    "text": " It's a long lasting debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 202.544,
    "end": 207.746,
    "text": "So this is like the dot zero of dot zeros because it's clearly a topic you could spend a lot of time on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.786,
    "end": 214.728,
    "text": "So that's our disclaimer is it's a longstanding debate, but here's kind of a meme slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 215.008,
    "end": 219.89,
    "text": "So it's the first section of this paper right below the title.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 220.631,
    "end": 225.132,
    "text": "It has this quotation from Walt Whitman and it says, hold it up sternly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.673,
    "end": 226.933,
    "text": "See this, it sends back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.873,
    "end": 228.334,
    "text": "Who is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.454,
    "end": 228.774,
    "text": "Is it you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.131,
    "end": 247.837,
    "text": " And then here are several different images and just think about your perception of these images and the cultural significance that you might attach to them or the way that black and white pixels or gray pixels on a screen give the illusion of depth or remind you of an experience that you've never had.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 247.897,
    "end": 252.759,
    "text": "So that's kind of trippy and representation gets at some of those issues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.619,
    "end": 256.28,
    "text": "That's one non-philosophical take on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 257.04,
    "end": 266.907,
    "text": " What are they going to aim to do in this debate, which we're going to sketch out the sides of in this talk, or I guess this discussion?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 269.943,
    "end": 271.264,
    "text": " Do you want to read it, Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.305,
    "end": 271.505,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.525,
    "end": 288.583,
    "text": "So the authors argue that even if the FEP can't solve this longstanding debate, it can play an invaluable role in revealing our hidden assumptions about the very notion of representation and can create some common ground to discuss and negotiate them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.364,
    "end": 295.368,
    "text": " So they say our general strategy is to use the FEP for conceptual clarification of different notions of representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.748,
    "end": 306.155,
    "text": "We work backwards from representational or non-representational interpretations of the FEP's constructs to the various notions of representation that motivate those interpretations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.815,
    "end": 317.76,
    "text": " So they claim that it emerges from their analysis that the FEP has been or can be used to implement various kinds of computational models which satisfy the requirements of certain theories of representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.24,
    "end": 325.463,
    "text": "Hence, the question of whether or not the FEP entails representations depends on what notion of representation one uses in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 327.532,
    "end": 349.854,
    "text": " gonna unpack that a lot but just wanted to give the first coat of paint on what they're aiming and what they claim to do so i'll read the first half of the abstract predictive processing theories are increasingly popular in philosophy of mind such process theories often gain support from the free energy principle fep a normative principle for adaptive self-organized systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 350.754,
    "end": 360.5,
    "text": " Yet there is a current and much discussed debate about conflicting philosophical interpretations of FEP, for example, representational versus non-representational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 361.32,
    "end": 368.765,
    "text": "Here we argue that these different interpretations depend on implicit assumptions about what qualifies or fails to qualify as representational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.646,
    "end": 385.712,
    "text": " The next part, we deploy the FEP instrumentally to distinguish four main notions of representation, which focus on organizational, structural, content-related, and functional aspects respectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.372,
    "end": 393.136,
    "text": "The various ways that these different aspects matter in arriving at representation or non-representational interpretations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.716,
    "end": 395.118,
    "text": " of the FEP are discussed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.678,
    "end": 411.433,
    "text": "We also discuss how the FEP may be seen as a unified view where terms that traditionally belong to different ontologies, for example, notions of model and expectation versus notions of autopoiesis and synchronization, can be harmonized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.074,
    "end": 439.089,
    "text": " However, rather than attempting to settle the representationalist versus non-representationalist debate and reveal something about what representations are simpliciter, this paper demonstrates how the free energy principle may be used to reveal something about those partaking in the debate, namely what are hidden assumptions about what representations are, assumptions that act as sometimes antithetical starting points in this persistent philosophical debate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.325,
    "end": 444.887,
    "text": " There's really two or three pieces to this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 445.808,
    "end": 449.009,
    "text": "There's an introduction and an abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 449.029,
    "end": 449.95,
    "text": "I guess we can delete that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 451.511,
    "end": 454.933,
    "text": "The first part introduces a short summary on the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 455.673,
    "end": 460.676,
    "text": "And we'll see that action, perception, cognition loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.247,
    "end": 472.63,
    "text": " The bulk of the paper is in these four segments of each with a dyadic relationship of the representational and the non-representational perspectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.25,
    "end": 485.153,
    "text": "And that section is a lot like a literature review and a philosophical taxonomy of different perspectives and arguments related to representation and FEP and these four subdivisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.214,
    "end": 486.694,
    "text": "There's then a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 488.226,
    "end": 508.125,
    "text": " addendum on evolutionary function specifically and that's apt as nothing in biology makes sense except in the light of evolution as they say and then section five kind of turns a mirror back on the process and thought just like those earlier images with the mirror and that's where fep",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.885,
    "end": 519.892,
    "text": " differences in perspective are used almost as input data for theorizing and speculating about different things, which we'll get to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 520.432,
    "end": 522.874,
    "text": "So that takes the authors then to the conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 523.475,
    "end": 525.276,
    "text": "So it's a pretty wide ranging paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 526.417,
    "end": 541.139,
    "text": " And the keywords that are here are active inference, free energy principle, predictive processing, generative model, internal representation, action-oriented representation, inactivism, forward model, and Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.841,
    "end": 547.623,
    "text": " There's no single path or single slide that would do justice to all these keywords.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.683,
    "end": 556.106,
    "text": "So we're just gonna kind of jump in and knowing that some people will be really familiar with some of these terms and others will be hearing about them for the first time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 557.406,
    "end": 559.947,
    "text": "So first, the big topic is representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 560.807,
    "end": 563.208,
    "text": "Now, this is just a quote from the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 563.768,
    "end": 570.591,
    "text": "Whether or not living organisms have or need internal representations is an old and fiercely debated topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 571.644,
    "end": 579.726,
    "text": " So we kind of unzipped that citation to add the titles and the links and just some of the images from these citations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 580.246,
    "end": 590.869,
    "text": "So if these topics or any of this body of literature you feel like is well-motivated or well-reasoned or you've never been exposed to it, that's sort of the continent we're on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.06,
    "end": 593.9,
    "text": " And it is such a large continent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 594.361,
    "end": 598.661,
    "text": "So the authors write, such a debate is reiterated within the predictive processing view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.242,
    "end": 609.364,
    "text": "So they're gonna tell the story of representation from predictive processing as sort of a implicit starting point from a more specific and mechanistic angle, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 609.444,
    "end": 615.285,
    "text": "assuming the FEP is a good model of living organisms, does it entail the notion of internal representation or not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 615.845,
    "end": 619.886,
    "text": "So it's almost like we're conditioning our analysis, whether it's a counterfactual or not,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 620.726,
    "end": 641.697,
    "text": " on fep being used instrumentally so we're going to use it just like we would use a ruler not by questioning the ruler against known objects but by going to unknown objects and investigating them so that's the way that the fep is going to be used in this very large scale topic and complex area of representation any comments blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.424,
    "end": 652.203,
    "text": " All right, another big topic and word that comes up in this paper, but also a lot of other of our discussions is inactivism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.428,
    "end": 680.311,
    "text": " and so who better to hear it from than the radicals so herrick 2014 i think it's a thesis why radical and activism is not radical enough a case for really radical and activism so take it up with the author if this is oversimplifying or that's kind of the joke slash um appeal here it is oversimplifying and here we see three different uh frameworks contrasted against each other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.172,
    "end": 685.353,
    "text": " Cognitivism, radical inactivism, and then really radical inactivism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 686.074,
    "end": 698.598,
    "text": "And cognitivism differs from inactivism on the top row in that cognitivism says basic cognition is representational and inactivism is going to be rejecting that claim on all accounts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 699.637,
    "end": 725.03,
    "text": " then where this author is saying that you could even go further into the inactive camp or forest or whatever is you could even deny that linguistic cognition is representational so even if it looks symbolic and it looks like it has some representational characteristic and it's the gray zone that makes people go oh okay maybe there is some redeeming aspect of representation you just have to keep on denying it so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.618,
    "end": 734.871,
    "text": " Maybe we can pick that thread up again, but that's sort of the lay of the land of maybe the center and activists, the moderates, and then the extremists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 737.996,
    "end": 738.637,
    "text": "Blue, anything to add?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.918,
    "end": 745.004,
    "text": " No, it's just, it's so interesting to really think about representation and the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.024,
    "end": 747.527,
    "text": "I mean, coming from neuroscience, actually, okay, I'll add something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.827,
    "end": 760.022,
    "text": "Coming from neuroscience, it's interesting to really think about, I mean, the visual cortex is very unique in the sense that we like know that there's representation that is replicated in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.322,
    "end": 767.245,
    "text": " But everywhere else, it's just kind of like, you know, we've never found like the word for apple in the brain somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.345,
    "end": 769.146,
    "text": "Like there's no like apple neuron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.246,
    "end": 777.71,
    "text": "So it's just an interesting, I don't know, just a juxtaposition, I guess, about representation and language, thinking about it in terms of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.09,
    "end": 783.052,
    "text": " Also one really important aspect that we didn't mention is it's about action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.312,
    "end": 792.357,
    "text": "Like it is basically saying that action is, it's related to embodiment and all these other things, but in activism is just focusing on action and what that means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 794.538,
    "end": 799.96,
    "text": "All right, free energy principle, which we're gonna spend a lot of the discussion on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.601,
    "end": 806.544,
    "text": "It's an integrative proposal on adaptive self-organizing systems that remain far from thermodynamic equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 807.364,
    "end": 813.406,
    "text": " So that would be cool if we had one common framework for things that maybe were far or close to equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.806,
    "end": 816.947,
    "text": "Currently, we only have some of those areas of phase space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 817.987,
    "end": 824.669,
    "text": "It starts from the premise that in order to survive, living organisms engage in reciprocal action perception exchanges with their environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.549,
    "end": 829.69,
    "text": "They must do what they can in order to remain within a neighborhood of viable states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 830.47,
    "end": 832.832,
    "text": " That's kind of the cybernetic regulator insight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 833.873,
    "end": 835.274,
    "text": "Then the bottom paragraph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 836.055,
    "end": 841.939,
    "text": "The idea is cast in Bayesian terms by assuming that ecologically adaptive states constitute the priors of the agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.8,
    "end": 847.504,
    "text": "The states that an agent prefers to visit become the states that it expects to visit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.167,
    "end": 867.522,
    "text": " Hence, minimizing surprise or its long-term average, which is entropy, becomes a primary imperative for living organisms as it permits them to counteract an otherwise unavoidable process of dispersion and loss of integrity, which kind of closes the loop back with the resistance to dissipation that was brought up in the beginning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.243,
    "end": 884.495,
    "text": " So this is kind of one FEP boomerang from starting with a focus on resisting dissipation and then moving through the action and perception loop to ecological preferences and back to the reduction of uncertainty and thus resisting dissipation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.194,
    "end": 896.319,
    "text": " A partitioning that is natural or at least complimentary to the FEP is the Markov blanket partitioning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 897.519,
    "end": 903.323,
    "text": "And we've talked about this in several other streams, so we won't go into it in too much detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 903.363,
    "end": 903.843,
    "text": "This is from 26.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 905.324,
    "end": 911.968,
    "text": "And the Markov blanket condition, at least in its more narrow slash technical sense,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 913.323,
    "end": 918.486,
    "text": " is referring to some set of nodes representing statistical variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.267,
    "end": 928.192,
    "text": "And that set of nodes that make up the blanket makes some other sets of nodes, two other sets of nodes, which we can call the internal and the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.392,
    "end": 930.293,
    "text": "It makes those two sets conditionally independent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 931.294,
    "end": 933.695,
    "text": "And the edges are statistical influence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.996,
    "end": 935.176,
    "text": "Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.738,
    "end": 939.14,
    "text": " What else would you say about Markov blankets?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.661,
    "end": 940.782,
    "text": "They say it here beautifully.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.082,
    "end": 946.907,
    "text": "So the blanket states act as an informational boundary between internal and external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.347,
    "end": 949.609,
    "text": "And that's like the simplest way to think about it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.629,
    "end": 952.772,
    "text": "Like my skin acts as a barrier between myself and the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.812,
    "end": 954.974,
    "text": "The blanket acts as a barrier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.256,
    "end": 958.037,
    "text": "Yes, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 960.04,
    "end": 971.044,
    "text": " Okay, leaving FEP land proper, we can zoom out to some related topics that sometimes get brought up in discussions of FEP, but often don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.885,
    "end": 974.826,
    "text": "So first is the predictive processing framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 975.606,
    "end": 982.189,
    "text": "This is drawn from a citation that was in the bibliography, but not sure if it was in the text, Highway 2020.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 983.029,
    "end": 987.291,
    "text": "And this is a paper, New Directions in Predictive Processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 988.251,
    "end": 998.976,
    "text": " so predictive processing asserts that perceptual and cognitive systems engage in prediction error minimization enabling approximate bayesian perceptual inference and some but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 999.895,
    "end": 1002.958,
    "text": " apparently not all authors emphasize action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1003.058,
    "end": 1014.21,
    "text": "So Clark and Howie famously and recently have emphasized that action is essential to predictive processing in the form of active inference where the system infers its own policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1014.891,
    "end": 1022.058,
    "text": "So really emphasizing that the predictions are not just about sensory inputs,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1022.984,
    "end": 1033.509,
    "text": " but causes of sensory input, hypotheses about latent unobserved causes in the world, and also one's own action and policies, what one expects to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1034.43,
    "end": 1046.156,
    "text": "And there's a really awesome supplemental file for this paper that includes a great literature analysis and a lot of keywords and unique information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1047.13,
    "end": 1049.951,
    "text": " predictions and lists of empirical evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1050.151,
    "end": 1061.634,
    "text": "So this is really awesome work and it'd be great to hear from people who study predictive processing or are more familiar with it, how they see it in relationship to active inference and FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1065.155,
    "end": 1073.417,
    "text": "Something that's in the overlap of predictive processing, Bayesian statistical theories, active inference is the idea of a generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.097,
    "end": 1075.658,
    "text": "So let's recall from,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.284,
    "end": 1086.568,
    "text": " DCM, the dynamical causal modeling, which we talked about in the previous weeks in number 35.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1088.268,
    "end": 1099.933,
    "text": "And here in DCM, it's appealing to biologically grounded models and dynamical systems theory to create a probabilistic generative model of hemodynamic fluctuations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1100.593,
    "end": 1101.814,
    "text": "So what is a generative model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1102.814,
    "end": 1104.916,
    "text": " It's basically opposed to a descriptive model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1105.476,
    "end": 1108.058,
    "text": "So why would one use a generative model in statistics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.158,
    "end": 1111.221,
    "text": "Because these types of models can be run in both directions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1111.661,
    "end": 1116.044,
    "text": "They can be fit from data, but they can also be used to generate data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1117.005,
    "end": 1120.328,
    "text": "And then they can be used in different ways because of that capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1121.624,
    "end": 1132.433,
    "text": " Lower dimensional generative models can be very computationally efficient because they only have to be updating a few parameters rather than keeping track of every single data parameter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.173,
    "end": 1148.425,
    "text": "And then a little bit more on the interpretive layer or beyond the merely statistical, generative models capture some of these open-ended and creative or complex dynamics that are associated with action and perception and cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1149.622,
    "end": 1170.073,
    "text": " therefore there are links to not only the cognitive sciences but also philosophy and phenomenology so it's kind of an idea from statistics that gets connected to some of the fundamentals of neuroscience and philosophy and uh anything to add on that blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1171.57,
    "end": 1171.87,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.01,
    "end": 1186.18,
    "text": "So just when I think of the generative model, having listened to so many people describe it, my favorite description is almost as like the recognition model is more like the hardware or like the states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.26,
    "end": 1195.006,
    "text": "And then the generative model is like the software, the action between them or like the dominoes and the like stack dominoes and then the cascading wave, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.026,
    "end": 1197.347,
    "text": "So the dominoes would be the recognition model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.487,
    "end": 1201.11,
    "text": "And then the generative model is the relationship between them, the cascading wave of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.45,
    "end": 1204.151,
    "text": " I always like to use that analogy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.591,
    "end": 1205.391,
    "text": "It's clear for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.611,
    "end": 1205.851,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.112,
    "end": 1218.576,
    "text": "And here's one more slide from 26, where the idea of the Markov blanket, which we pulled from 26 as well, is connected to the idea of a generative model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1219.901,
    "end": 1221.684,
    "text": " in the section on predictive processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1222.625,
    "end": 1228.333,
    "text": "And so in this paper, so go check out number 26 or the paper on Bayesian mechanics to learn more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.854,
    "end": 1234.982,
    "text": "But the idea is that it's possible to use that Markov blanket partitioning so that there's the blanket states,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.743,
    "end": 1251.771,
    "text": " statistically isolating internal and external states and then there might be some systems where those partitioned internal states are acting as if they are doing inference on external states so that would be like if i",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1252.811,
    "end": 1279.045,
    "text": " said i'm gonna hold up three fingers and put it behind my back and then you had a generative model that was about what was the state of that unobserved variable and uh that's something to look more into from the details on generative model as with other papers and that kind of brings us to our last keyword which is active inference so we'll go into a little more detail here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.57,
    "end": 1294.726,
    "text": " They describe that active inference agents are self-evidencing, which is to say that because minimizing free energy over time is equivalent to maximizing Bayesian model evidence or self-evidence, engaging in long-term",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1295.828,
    "end": 1314.915,
    "text": " active inference agents seek out or generate those sensory samples that maximize the lower bound on the evidence for an implicit model of how their sensory states were generated as such active inference agents author evidence for their own continued existence via free energy minimizing model optimization so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1315.862,
    "end": 1343.748,
    "text": " active inference is using statistics to operationalize some of the information thermodynamic like formalisms of the fep so it'd be a more narrow interpretation that that carries no or little philosophical baggage or claims to how the world really is it would be a more broad or stronger interpretation to think that this is capturing the actual information dynamics or the actual thermodynamic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.827,
    "end": 1368.002,
    "text": " relationships of systems but the instrumental usage is more of a statistical similarity or at least attractability argument and that is not without precedent not even close because the variational bayesian methods which minimize or optimize this quantity called the evidence lower bound start maximizing the lower bound for how good the evidence is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1369.139,
    "end": 1379.126,
    "text": " And others in many places have motivated this fundamental component of modern Bayesian statistics from multiple different areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.326,
    "end": 1381.267,
    "text": "And it's kind of like equations are true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1381.367,
    "end": 1382.868,
    "text": "So equations can be linked to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1382.888,
    "end": 1394.316,
    "text": "And it's just kind of cool that these KL divergences, as well as free energy and the information or description length criterion all align.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1394.456,
    "end": 1396.978,
    "text": "And that's not even like an act-inf synthesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.345,
    "end": 1412.875,
    "text": " applying that to inference on action is something that is bringing together a lot of these ideas from variational Bayesian methods with a lot of ideas from control theory, cybernetics, inactivism, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1413.515,
    "end": 1423.142,
    "text": "And again, we can explore back and find out which ideas came from where, but just to keep in mind is like, these pieces were not tied together by act-inf.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1423.702,
    "end": 1427.925,
    "text": "Those are extant relationships in the literature, but act-inf does integrate,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.745,
    "end": 1450.194,
    "text": " the free energy principle and that center meme that they started with that things have to resist dissipation with all of this philosophy and more quantitative areas that have to do with action and perception and then in the dot one and dot two we'll go more into the variational and expected free energy but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1450.914,
    "end": 1478.953,
    "text": " kind of wanted to just give a little thought on active inference and if someone has a different thought it'd be awesome to hear it as well but this paper was very precise and very um subtle in how I thought about some of these areas so I think it's really good to be clear about what we're talking about in this case okay onto the paper all right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1480.805,
    "end": 1483.707,
    "text": " So this is going to be a slow roll of the introduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.749,
    "end": 1496.917,
    "text": "There's a growing consensus in computational and systems neuroscience around the idea the brain is a predictive machine, which uses internal or generative models to continuously generate predictions in service of prediction, action, and learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1497.457,
    "end": 1499.318,
    "text": "So starting with the idea of prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1500.899,
    "end": 1501.48,
    "text": "Second sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1502.421,
    "end": 1507.844,
    "text": "One of the ways that people are studying prediction in the brain is predictive processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.365,
    "end": 1509.746,
    "text": "So we talked about that a few minutes ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1512.777,
    "end": 1529.933,
    "text": " free energy principle is extending predictive processing by providing it with a fundamental principle of adaptive self-organization that's the resist dissipation meme that isn't intrinsically within predictive processing framework which might describe audio processing in a radar signal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.134,
    "end": 1549.348,
    "text": " And so that union of FEP and predictive processing are starting to become prominent outside of systems neuroscience, which might seem like their natural niche or origin, but it's also the case that philosophers in the philosophy of mind are starting to think about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1551.309,
    "end": 1559.355,
    "text": "And despite that attention, the authors are arguing that some of the implications for FEP's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1561.485,
    "end": 1564.579,
    "text": " existence remain widely debated i think we can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1565.563,
    "end": 1594.181,
    "text": " agree on that and they're going to focus on one of the prominent discussions that they think is the most prominent which is whether the FEP is representational or non-representational and then to what extent it is also bearing on debates related to internalism action orientation and activism so just it's all over the map it's a multi-dimensional philosophy face space with the FEP and it's not totally resolved but that's what they're going to go into in this paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1597.594,
    "end": 1597.794,
    "text": " OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.818,
    "end": 1602.779,
    "text": "Oh yeah, Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.98,
    "end": 1616.491,
    "text": "So they note here that philosophical discussions or representation wars about the FEP have typically been focused on four aspects of the notion of representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.072,
    "end": 1622.957,
    "text": "So these four aspects are organizational, structural, content-related, or functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.138,
    "end": 1632.042,
    "text": " And the organizational aspects have some variable inside a system that's separated from that which it represents outside the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1632.703,
    "end": 1639.727,
    "text": "Structural aspects have representational vehicles that are structurally similar to the state of affairs in the world that they stand for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.447,
    "end": 1647.711,
    "text": "Content related aspects have internal models that either encode environmental contingencies or sensory motor contingencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.311,
    "end": 1654.819,
    "text": " Specification or description of how the world is taken to be in turn analyzed in terms of correctness or truth conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.4,
    "end": 1663.59,
    "text": "And then the functional aspects support vicarious use before or in the absence of external events of internal variables of a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.551,
    "end": 1673.838,
    "text": " Well, it is kind of a woe, but this fourfold distinction is the structure of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1674.399,
    "end": 1682.125,
    "text": "So we're going to do a few fun things to help understand this because it is the contribution and the structure of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1682.565,
    "end": 1686.168,
    "text": "So everyone's going to interpret all of this in their own way, which is awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.208,
    "end": 1690.552,
    "text": "But we do really want to be clear about what the author's contributions are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1690.572,
    "end": 1690.612,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1692.333,
    "end": 1712.162,
    "text": " in an almost unprecedented maneuver we're going to go to the end of the paper first and then also have the figures out of order we're going to start with what we can learn from this debate so if you're not sure if you want to listen to the next like 40 minutes on going into this for um full distinction you get it up front so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.328,
    "end": 1718.136,
    "text": " They're going to review some of the most prominent philosophical interpretations of the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.977,
    "end": 1725.829,
    "text": "They then summarize those interpretations according to the four different categories that Blue just read.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.52,
    "end": 1732.042,
    "text": " For each of those categories, they're gonna consider multiple constructs of FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.902,
    "end": 1736.483,
    "text": "So kind of tools in the FEP toolkit slash ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1737.403,
    "end": 1752.208,
    "text": "And they're going to argue that depending on which perspective you take on which of these categories and which constructs, you're gonna come to different conclusions about the representational or non-representational nature of the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1752.728,
    "end": 1754.629,
    "text": "So it's kind of like a checkerboard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.77,
    "end": 1756.97,
    "text": "That's their first,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1758.487,
    "end": 1786.472,
    "text": " salva is we're going to outline a flow chart and a grid and a structure like a taxonomy of philosophical ideas related to this triple dimensional space of aspects of representation constructs of the fep and then the categorical variable representational or non-representational claims and then the whole second part is saying we're going to use that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1787.995,
    "end": 1795.799,
    "text": " three-dimensional phase space to shine a light on one's own implicit notions of representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1796.299,
    "end": 1800.481,
    "text": "So that's kind of like the looking in the mirror, strange loop part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1800.581,
    "end": 1808.045,
    "text": "But the first part is more like a philosophical literature analysis and their contribution in figure two",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1809.145,
    "end": 1829.531,
    "text": " is to make this awesome flow chart so this is going to funnel you from the start in the four different domains four aspects organizational structural content and functional and then from those four starting points kind of like sorry board you're going to get funneled towards",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.928,
    "end": 1835.35,
    "text": " non-representational or representational FEP, depending on decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1835.81,
    "end": 1838.931,
    "text": "And that's what we're going to unpack in the next sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1841.372,
    "end": 1846.714,
    "text": "Because again, it's kind of like trippy and there's a lot to think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1846.914,
    "end": 1848.534,
    "text": "This is going to be our map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1849.415,
    "end": 1852.336,
    "text": "So it's going to be at the bottom of all of the upcoming slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1853.876,
    "end": 1859.098,
    "text": "Which of these eight sections we're in, it's like a cube divided in eight",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1859.864,
    "end": 1864.087,
    "text": " little cubes or two tetrahedra or some other pattern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1864.487,
    "end": 1872.112,
    "text": "But basically we're gonna see whether we're in like representation camp or non-representation camp and which aspect we're focused on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1872.692,
    "end": 1875.094,
    "text": "And then here's that table, but it's just the tip of the iceberg.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1875.975,
    "end": 1880.358,
    "text": "So how can we organize our thinking around philosophy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.565,
    "end": 1892.789,
    "text": " and increase the rigor and the accessibility of different arguments, because it can be difficult sometimes to parse it in long texts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1893.889,
    "end": 1896.43,
    "text": "And so the authors clearly thought a lot about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1896.49,
    "end": 1899.891,
    "text": "So it's a really pleasure to read about it and learn about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1901.052,
    "end": 1902.932,
    "text": "And the flowchart is a great addition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1903.393,
    "end": 1907.414,
    "text": "So that is going to be our map in the coming slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.632,
    "end": 1912.853,
    "text": " Thanks for making such a beautiful map, I have to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.833,
    "end": 1920.516,
    "text": "I had pasted a whole bunch of these ideas and tried to categorize them, and then Daniel constructed them into this beautiful flowchart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.556,
    "end": 1923.517,
    "text": "Well, they made the flowchart, I made the grid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1924.177,
    "end": 1925.137,
    "text": "The grid, that's what I meant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.197,
    "end": 1925.957,
    "text": "The grid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.138,
    "end": 1936.221,
    "text": "Before we see the grid in action now, let's just recall this action perception loop, and we're not going to go into it right now, but that's definitely for a dot one and dot two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.301,
    "end": 1938.182,
    "text": "What are these...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1939.48,
    "end": 1967.279,
    "text": " nodes and edges and which can and can't happen and what do they represent so that is sort of the partitioning that we're going to be working within which we brought up a little earlier with the markov blanket and in a lot of our other discussions okay so let us start in this top left square so this is the organizational aspect the representational perspective",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1968.45,
    "end": 1978.796,
    "text": " So the organizational aspect is describing how variables inside a system are separated from what it represents outside the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1979.657,
    "end": 1985.38,
    "text": "So that's like the architectural take on representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1985.44,
    "end": 1987.542,
    "text": "I don't know, is it classic representations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1988.202,
    "end": 1997.608,
    "text": "But the pro-representation camp are going to argue that internal states are segregated from the external world via Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1998.53,
    "end": 2004.936,
    "text": " Therefore, the brain's activity cast as internal states do represent what it doesn't have access to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2006.777,
    "end": 2008.339,
    "text": "Blue, what do you think?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2009.039,
    "end": 2010.601,
    "text": "Or anything else to add on it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2013.643,
    "end": 2016.926,
    "text": "Nothing I want to delve into here because I'm going to save it for that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.026,
    "end": 2017.287,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2018.267,
    "end": 2018.508,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2018.768,
    "end": 2019.669,
    "text": "In contrast...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2021.021,
    "end": 2039.248,
    "text": " there's other people and other perspectives who are going to in the organizational aspect take a non-representational perspective and so philosophers of the ecological and activist persuasion have approached that same markov blanket formalism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2040.874,
    "end": 2046.658,
    "text": " and basically framed it in terms of non-representational view of the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2047.199,
    "end": 2054.264,
    "text": "Like Jelle Brunnenberg's paper, The Anticipating Brain is Not a Scientist, Free Energy Principle from an Ecological and Active Perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2055.105,
    "end": 2065.933,
    "text": "So they argue in those papers, in a lot of papers by Jelle and others, that just because you deploy the Markov blanket formalism,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2067.128,
    "end": 2089.818,
    "text": " it doesn't imply the behavior of the system is best explained by inferences generated by an internal model the structure of which is representing that which is a model of so read the papers for more detail but it's like um it's an interesting idea and it was also interesting to read in from this paper that uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.151,
    "end": 2115.886,
    "text": " the restatement of this argument that these partially informationally encapsulated systems, like we talked about in 35, are parsimoniously understood in terms of achieving high relative mutual information between the non-representational process of generalized synchrony in Huygens, 1673, the pendulum clock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2116.507,
    "end": 2119.329,
    "text": "So you could get like oscillating pendulums that synchronize",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2120.438,
    "end": 2139.073,
    "text": " but they don't have representations of each other now maybe you need representations to um do something else but that kind of gets to that inactivist radical and activist debate so we'll go more into it later just kind of cool old citation and um interesting idea so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2140.509,
    "end": 2142.089,
    "text": " based upon the organization of the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2142.489,
    "end": 2152.652,
    "text": "There's people who say, yeah, the FEP is representational, of course, because the internal states are isolated, or no, because you can get high mutual information without representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.672,
    "end": 2156.112,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2156.132,
    "end": 2158.753,
    "text": "That's like what Dean called nine o'clocking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.113,
    "end": 2161.693,
    "text": "It's nine o'clock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.073,
    "end": 2162.934,
    "text": "That's general synchrony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.954,
    "end": 2163.454,
    "text": "Exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2163.534,
    "end": 2163.914,
    "text": "Exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2164.778,
    "end": 2187.015,
    "text": " there's doesn't need to be a representation of brushing the teeth in the in the mind or the anything of the reader okay on to the second aspect the structural aspects so the question to be addressed is whether generative models are structurally similar to their targets or accurate descriptions of external reality or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.373,
    "end": 2195.498,
    "text": " whether models needn't be accurate, but merely adequate enough to leverage for adaptive behavioral control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2196.359,
    "end": 2208.007,
    "text": "So does it actually need to represent the thing, or can it be just some other representation that is effective enough?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.908,
    "end": 2214.872,
    "text": "So here's the pro and the con for representational on one slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.092,
    "end": 2226.522,
    "text": " The top structural representationalist view argues that the generative model has to have some structural resemblance with the generative process in order to be useful for control purposes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.143,
    "end": 2231.487,
    "text": "That's really related to the good regulator theorem from cybernetics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2235.131,
    "end": 2240.155,
    "text": "And so the argument there is you're going to need the good representation about it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2241.05,
    "end": 2245.232,
    "text": " in order to be on the right page in complex environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2248.374,
    "end": 2250.015,
    "text": "Others disagree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2251.095,
    "end": 2263.162,
    "text": "So here's one line of argument that the formal constructs in active inference, specifically the generative density G, if it's understood correctly, according to some authors, it would turn out to be non-representational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2264.295,
    "end": 2274.825,
    "text": " Those authors suggested, Rampstead et al., 2019, that generative models do not meet the requirements of structural representations where some internal structure replicates some structure of a generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2275.445,
    "end": 2279.149,
    "text": "So the generative model is the organism's model of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.949,
    "end": 2285.415,
    "text": "The generative process is the actual world out there, the niche, that's giving rise to observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.015,
    "end": 2287.356,
    "text": "And so in other words, you might be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2288.197,
    "end": 2295.744,
    "text": " I don't know if this might be a mal example, but like to run, you don't need to have an abstract representation of your own body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2297.145,
    "end": 2301.969,
    "text": "You merely need the action interactions with your body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2303.05,
    "end": 2315.121,
    "text": "And so this is kind of arguing that the internal generative density G in ACT-INF doesn't have to have any resemblance structurally to even the problem which it's being deployed to solve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2317.185,
    "end": 2322.769,
    "text": " Well, and this, this always goes to the map and the territory and the difference between the map and the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.01,
    "end": 2327.433,
    "text": "So structural similarity, like what does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.574,
    "end": 2328.834,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.894,
    "end": 2333.318,
    "text": "Like, so, so how similar is there some metric that you're using for structural similarity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.738,
    "end": 2338.302,
    "text": "Like how similar is the map of the United States to the actual United States?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.802,
    "end": 2338.982,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.302,
    "end": 2340.864,
    "text": "And so what, what does that even mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.964,
    "end": 2341.965,
    "text": "Structural similarity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2342.065,
    "end": 2342.385,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2342.425,
    "end": 2346.308,
    "text": "Like I'm, I'm probably, you know, poking the fire, but.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.601,
    "end": 2369.026,
    "text": " let's hear from um alex keifer or maxwell or anyone else who feels really strongly about this issue because we've had some fun talks on it before and it's just i just liked seeing the pro and the con laid out together and then the authors were very um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2371.942,
    "end": 2374.964,
    "text": " I just like arguing what is the difference between the pro and the con.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.104,
    "end": 2377.066,
    "text": "I want somebody to draw the line for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2377.466,
    "end": 2380.248,
    "text": "What is similar and what is not similar enough?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2381.309,
    "end": 2381.589,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2381.609,
    "end": 2384.07,
    "text": "OK, now to the third aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2384.331,
    "end": 2387.373,
    "text": "So this is the content-related aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2391.932,
    "end": 2417.988,
    "text": " whether the generative models need to explicitly model the ways external states produce sensations aka environmental models or the ways that actions produce sensations or sensory motor models this is very closely related to the previous aspect so i think it'd be cool to unpack it a little more but there is a little bit of nuance with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2419.398,
    "end": 2446.985,
    "text": " sensory motor systems which we talked about in several places like skilled performance and um basically this is just one uh sub argument within this section a pro and a con um and they're talking about essentially skilled performance how sensory motor models can afford sophisticated cognitive processing and so the first",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2448.266,
    "end": 2473.897,
    "text": " argument here is that here comes that same yellow burnberg 2016 paper the anticipating brain is not a scientist saying that yeah actually sensory motor loops if you're going to trust the story for one level of analysis then why are more so-called complex behaviors not just more complex combinations of modules which don't uh appeal to any representational content",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2475.171,
    "end": 2484.254,
    "text": " And then the sensory motor dynamics created by those models may be progressively internalized to support mental operations detached from the sensory motor cycle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.855,
    "end": 2498.7,
    "text": "So maybe like walking and chewing gum or something like that, or maybe think about like an insect flying or walking and how much of that is just the shape of its body in motion and just the way that the muscles and the joints just like flex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2498.78,
    "end": 2503.462,
    "text": "And so ascribing the total motion of every joint to cognitive actions,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2504.554,
    "end": 2525.986,
    "text": " just is probably asking too much of cognition unless taking embodied and morphological computation as another type of computation and then um firing back for the representationalists um is um coming from the area of schema theory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2527.662,
    "end": 2551.328,
    "text": " which is where there is a nucleus of sensory motor models but then they're extended to include external causes of sensations so that just kind of like a flavor of one of the sub debates and it'd be good to discuss i think how the um structural and organizational and content related differ because it is like a nuanced debate and so i appreciate how clear they did make it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2552.068,
    "end": 2564.114,
    "text": " given that it's murky waters because these are like four aspects of a philosophical idea oh then of course this meme okay so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2566.119,
    "end": 2573.681,
    "text": " The embodied cognition literature has shown some practical examples of how good control can be realized using fast and frugal solutions and very simple models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.401,
    "end": 2578.382,
    "text": "This is an example that Dave described on a live stream just recently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2579.282,
    "end": 2594.585,
    "text": "One popular example is the baseball outfielder problem, or the fact that catching a moving ball may not require a full model of the ball's position, velocity, and direction, allowing for trajectory prediction, but a simpler control mechanism that only keeps the image of the ball stationary on the retina.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2595.345,
    "end": 2603.531,
    "text": " All right, so here on the left, this is like the physics class model of some of the parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2603.951,
    "end": 2605.593,
    "text": "So this is already a map of the territory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2605.913,
    "end": 2610.116,
    "text": "We're not going into the temperature of the ball and the wavelength of the grass.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2610.196,
    "end": 2611.637,
    "text": "So this isn't like a world model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2612.238,
    "end": 2618.662,
    "text": "This is just the physics reduced model of the physics of the asymptotic ball in this kind of idealized setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2619.403,
    "end": 2622.005,
    "text": "And so that's a lot of parameters like parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2622.89,
    "end": 2647.821,
    "text": " as drawn out there and here from this wired article how do people actually catch baseballs here's the apparent ball position as a function of time and just showing how if if um you're in the position to catch the ball that there's a simple heuristic line related to the apparent balls position whereas um balls that you're too short or too long to catch",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2649.667,
    "end": 2651.509,
    "text": " have a very different visual trajectory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2652.05,
    "end": 2658.378,
    "text": "So in other words, an activism is saying, this on the left doesn't have to be the representation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.631,
    "end": 2666.913,
    "text": " That would be something that might satisfy the most formal representationalist, but then this is sort of a gray area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2666.954,
    "end": 2670.835,
    "text": "Like what if there is a visual representation of the ball on the retina?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2670.875,
    "end": 2685.52,
    "text": "So there is something that's featuring information about the real world in an actionable way, but it is of a totally different type than the parameters in the physics class.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2686.491,
    "end": 2688.353,
    "text": " And so that can get, of course, a little sticky.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.373,
    "end": 2690.735,
    "text": "So here is us on the Phillies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2691.475,
    "end": 2693.237,
    "text": "We're trying to catch the fly ball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2693.797,
    "end": 2701.203,
    "text": "Here's Friston hitting it out of the park with the action perception loop and all the work in this field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.164,
    "end": 2704.106,
    "text": "So what is the equivalent?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2704.546,
    "end": 2708.049,
    "text": "Do we need to have the physics class model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2710.111,
    "end": 2715.355,
    "text": "Or is it possible for us to have some other type of understanding",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2717.708,
    "end": 2718.228,
    "text": " Just a thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2718.368,
    "end": 2719.009,
    "text": "What do you think, Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2719.829,
    "end": 2723.452,
    "text": "So it just really makes me think about blindness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.752,
    "end": 2730.777,
    "text": "And I know that this seems like a way out there trajectory, but we know the physics of our natural environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.817,
    "end": 2731.577,
    "text": "We know it pretty well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.098,
    "end": 2736.54,
    "text": "What about when we remove ourself or remove one sense, like remove vision, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.761,
    "end": 2738.582,
    "text": "Now we have a really different...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.694,
    "end": 2742.215,
    "text": " perception of our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.216,
    "end": 2750.441,
    "text": "And we have to completely retrain through kinesthetic memory where we are in our environment if the lights go out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.721,
    "end": 2757.986,
    "text": "I mean, I was without power for four hours the other day in the middle of the night, and I was totally freaked out because I live in the country, and there was absolutely no light, none.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.606,
    "end": 2762.388,
    "text": "So in that, you have to know where all the things are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.449,
    "end": 2770.514,
    "text": "So this is a structural map in your mind of your reality that's really different from what you're able to absolutely perceive at that moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.294,
    "end": 2772.295,
    "text": " It just makes me think of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.116,
    "end": 2774.356,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2774.596,
    "end": 2776.477,
    "text": "That's just a fun slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2778.138,
    "end": 2778.718,
    "text": "Various slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.679,
    "end": 2783.321,
    "text": "This is still on the functional aspects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2783.361,
    "end": 2786.683,
    "text": "Here's the functional aspects of representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.304,
    "end": 2802.555,
    "text": " Another way to address the issue of what a representation is and what it is not is by asking what functional role representations play within a hierarchical architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2803.416,
    "end": 2808.563,
    "text": "So this is the function, kind of the pragmatics of the representation, what it does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2809.744,
    "end": 2822.628,
    "text": " An idea that dates back to at least Piaget, 1954, is the idea that representation should vicariously stand for something external in its absence and afford vicarious operations, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.728,
    "end": 2834.691,
    "text": "mental operations, using an internal vehicle that are executed before acting on the external referent of the vehicle, or even when the external referent is absent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2836.051,
    "end": 2837.772,
    "text": "So it is able to be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2838.806,
    "end": 2852.115,
    "text": " cause and effect within the mental ecosystem, like we'll see from these examples, consider mentally whether one would enjoy eating a pizza with no pizza in sight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2852.135,
    "end": 2854.556,
    "text": "So it'd be like, okay, think of a pizza.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2854.576,
    "end": 2855.277,
    "text": "Do you want to eat that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2855.477,
    "end": 2865.504,
    "text": "Now imagine that type of food that I previously mentioned and then what type of restaurant it is and what equipment do they have in the kitchen, like an oven or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2866.184,
    "end": 2871.647,
    "text": " So there's something that's being functionally carried forth in that cognitive sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2872.388,
    "end": 2878.872,
    "text": "Can that be uniquely explained, predicted, controlled, designed with just sensory motor loops?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.087,
    "end": 2893.119,
    "text": " This functional role of representations has been expressed in terms of whether the agent's internal operations are detached from its action perception cycle and hence autonomously generated versus determined or sustained by external stimuli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.86,
    "end": 2901.728,
    "text": "So if something were just repeatedly causing visual stimuli and now we're causing like sort of unaware movements,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.529,
    "end": 2913.738,
    "text": " That might be one category of phenomena, but what about going on a walk and remembering a five digit number by just chanting it to yourself?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.159,
    "end": 2916.48,
    "text": "Is that sensory motor?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2917.001,
    "end": 2918.482,
    "text": "How is that playing out?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.622,
    "end": 2929.331,
    "text": "And when cognition is playing a functional role, seemingly uncoupled from the action perception loop, which is probably not exactly how Piaget framed it, but that's what that notion is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2930.271,
    "end": 2930.532,
    "text": "And so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2931.676,
    "end": 2940.598,
    "text": " Within the functional aspect, the FEP is leading one to ask, what functional roles do internal models play during free energy minimization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2941.018,
    "end": 2953.841,
    "text": "So just like the memorizing the number was like a cause and effect of a cognitive environment, is it the case that the FEP is featuring things that are also causes and effects in the cognitive environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2955.282,
    "end": 2962.045,
    "text": " And does that resemble vicarious operations in the classical Piaget-based account of representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2963.146,
    "end": 2968.929,
    "text": "And again, it's going to be the dot one, the dot two when we go into the variational and the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2969.369,
    "end": 2980.235,
    "text": "But that's like the big picture on the functional aspect is do these variables play functional roles in a way that's uncoupled from the immediacy of action and perception?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2980.915,
    "end": 2984.817,
    "text": "I hope I represented that because I'm also not sure about that one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2987.668,
    "end": 2988.669,
    "text": " Okay, anything to add, Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2989.89,
    "end": 2991.751,
    "text": "So I think about it in a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.811,
    "end": 3001.479,
    "text": "Like you're walking down a path and remembering a five-digit number, but like, I don't know, something that probably resonates with Sasha or like anybody else that does extensive wet lab research, which you've done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.919,
    "end": 3007.083,
    "text": "So it surprises me that like it doesn't bring it to mind for you is like thinking about your actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.143,
    "end": 3010.165,
    "text": "Like it's like a dry run of your experiments the next day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.185,
    "end": 3010.866,
    "text": "Like do I have...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.266,
    "end": 3013.827,
    "text": " the tubes I need, the enzymes I need, the reagents I need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3013.887,
    "end": 3015.187,
    "text": "Where are all these things located?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.567,
    "end": 3022.528,
    "text": "When it's a really important experiment, hit or miss, it has to be done now or never, which you know that there are some that are like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.488,
    "end": 3027.249,
    "text": "It's important to go through and make sure that you've got a cognitive representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.269,
    "end": 3032.29,
    "text": "You build it, and so it's fresh in your mind for when you absolutely execute the experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3032.39,
    "end": 3037.111,
    "text": "And so instead of walking down a path thinking of a five-digit number, how about planning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.651,
    "end": 3042.494,
    "text": " Like the sensory motor planning of executing a series of experiments, it brings that to mind for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.395,
    "end": 3044.915,
    "text": "Yeah, great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.215,
    "end": 3053.219,
    "text": "And that makes me think like, let's just say it's a one hour experiment that you're thinking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.019,
    "end": 3066.446,
    "text": "Now, does the motor pattern firing associated with pushing your thumb down on the pipette, does that get engaged during the prospective planning of that event?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3068.38,
    "end": 3072.284,
    "text": " Who knows to what extent, but that's kind of what's at play here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3072.704,
    "end": 3083.213,
    "text": "If there's a totally disjoint neural phenomena associated with prospective planning, then the inaction, we're in one camp of representationism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3083.494,
    "end": 3085.015,
    "text": "I don't even know which side of the line anymore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3085.475,
    "end": 3094.323,
    "text": "But then if you do have that thumb neural firing pattern, like it's just like sped up or just shortened or something, maybe we're in a different area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3094.603,
    "end": 3094.723,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3095.768,
    "end": 3112.68,
    "text": " let's return to these ideas because again it's like very nuanced and it's just great the authors laid it out as simply as they did because this is clearly a lot of literature to go through so that was the um the eight the four times two you know the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3113.732,
    "end": 3115.372,
    "text": " I won't even go into it, but four times two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3115.973,
    "end": 3118.153,
    "text": "And that's the bulk of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3118.353,
    "end": 3123.334,
    "text": "And then there was this addendum section on representation as an evolutionary function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.075,
    "end": 3132.897,
    "text": "So similar to other cognitive functions like working memory, planning, cognitive control and attention, or perhaps even to functions like flying or swimming,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3133.817,
    "end": 3157.24,
    "text": " representation here intended in the sense of affording vicarious operations and detachment from the current action perception cycle may be an evolutionary function so it's kind of like when people argue that consciousness has an adaptive role and that the origination of consciousness could be scaffolded or nurtured or selected for once it arose this is a little bit less phenomenological",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3158.101,
    "end": 3166.028,
    "text": " and more cognitivist or computationalist with respect to saying how representation might play an evolutionary role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3166.889,
    "end": 3171.734,
    "text": "So let's just imagine that there was this detachment between the action, perception, role, and planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3172.374,
    "end": 3174.516,
    "text": "Like here's Pogonomimax ants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.977,
    "end": 3177.299,
    "text": "Imagine if they're able to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3179.83,
    "end": 3194.463,
    "text": " perceive the polarization of light or the intensity of the light or the humidity and then have something like a representation that helps them assess whether it's appropriate to forage on that day, that is going to be a more adaptive nestmate for the colony.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3195.884,
    "end": 3197.906,
    "text": "Does the colony have a representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3199.567,
    "end": 3202.67,
    "text": "What level is the representation existing at?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.671,
    "end": 3203.871,
    "text": "Is it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3205.799,
    "end": 3210.695,
    "text": " the direct target of selection or is it arising from selection on other units?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3212.26,
    "end": 3212.782,
    "text": "What do you think, Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3213.646,
    "end": 3216.869,
    "text": " like we were just talking about this, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.889,
    "end": 3220.813,
    "text": "Like, like, so it is the niche, the internet, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3221.113,
    "end": 3226.538,
    "text": "Is that like the, the meta representation of humanity, like the, the web, like that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.859,
    "end": 3233.145,
    "text": "So, so I, I wrote that here and things to discuss and the dot one or dot two is external representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.205,
    "end": 3237.289,
    "text": "Like what, how do you offload this representationalism into the niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.245,
    "end": 3241.105,
    "text": " Awesome question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3241.165,
    "end": 3246.467,
    "text": "And I also, I think probably subconsciously was thinking about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3246.507,
    "end": 3251.768,
    "text": "Like the image on the right is a trail, a trunk trail that the Pogonomyrmex use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3252.448,
    "end": 3254.849,
    "text": "And so it's like, it's not going in every direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3255.089,
    "end": 3256.909,
    "text": "In this colony, it's only going in one direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3257.049,
    "end": 3258.449,
    "text": "It's along a tree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3259.03,
    "end": 3264.231,
    "text": "So it's kind of accentuating this natural pattern in the generative process, in the niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3264.871,
    "end": 3267.692,
    "text": "But then now that is like an externalized,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3268.832,
    "end": 3293.565,
    "text": " prior for foragers that's based upon the clearing of grass and then they're less likely to go like walk over the midden pile and forage in a different direction but then it does happen so the trail does move so it's like interesting topics yes thanks for writing down about the internet okay let's continue through a few of these last ideas and i'm glad that we're moving basically through this um long paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3295.74,
    "end": 3314.095,
    "text": " okay so let's keep thinking about that detachment of representation from the action perception loop they write in other words full-fledged decoupled representational capacities might shade off which i wasn't even sure what the origins were maybe it's used in godfrey smith 96.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3315.723,
    "end": 3337.938,
    "text": " into other cognitive or minimal cognitive processes the dynamics of which are increasingly more coupled to the environment through action sensory perception so it's like being at a level of cognitive complexity where you can spin up other active entities or like the queen as a reproductive ant is spinning off cognitive but not reproductive nest mates",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3339.019,
    "end": 3366.092,
    "text": " therefore when taking functional role as contextualized by evolutionary function as a criterion for identifying when recourse to representation is warranted in explanation which is a very complex linguistic clause but we're finding out when representation is warranted the criteria for that would be evolution shaping function",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3367.048,
    "end": 3370.55,
    "text": " So it's a lot like saying nothing in biology makes sense except in light of evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3371.791,
    "end": 3382.057,
    "text": "And then under those settings, it is plausible to interpret at least some processes, the ones that involve vicarious variables related to minimizing free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3384.799,
    "end": 3392.864,
    "text": "Under that context, the author suggests that could drive the kind of self-organization that FEP would describe as representational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3394.761,
    "end": 3408.51,
    "text": " So it's layered, but it's very fascinating because it is just like you had said, Blue, with our niche, but it's like just stacking rocks on top of each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3408.751,
    "end": 3417.396,
    "text": "It's resisting disorder, it displays culture, but those rocks don't have a self-modeling capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3417.496,
    "end": 3423.521,
    "text": "It's like unidirectional multiscale integration, the other Sims paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3424.619,
    "end": 3433.869,
    "text": " Whereas here we have like a human who as part of their niche has made another adaptive active inference entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3434.63,
    "end": 3438.374,
    "text": "And now they're engaged in this reciprocal multi-scale integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3439.495,
    "end": 3446.062,
    "text": "And so I think the authors might be suggesting that there's aspects of this setting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3446.997,
    "end": 3455.159,
    "text": " that might be described as, or might be warranted to utilize representation in the explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3456.66,
    "end": 3457.14,
    "text": "What do you think?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.4,
    "end": 3471.884,
    "text": "So I wonder if this is, so I always wonder whether we should talk about multi-scale integration or like thinking through other minds in terms of translating into the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.489,
    "end": 3489.797,
    "text": " And how do you like decide whether like we're integrating as, I mean, I guess there's always this thinking through other minds aspect of, you know, we leave like stigmatic traces in like our niche environment and then they're picked up by other people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.977,
    "end": 3496.403,
    "text": " Or is it really multiscale integration, like in terms of you and I are connecting and forming a bigger unit?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.863,
    "end": 3501.928,
    "text": "I always, and this is, we were just talking about this like 10 minutes before we got here today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.328,
    "end": 3506.693,
    "text": "So this is something to me that's like this fundamental paradox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.733,
    "end": 3510.376,
    "text": "Like, I don't know how to distinguish these two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.977,
    "end": 3512.618,
    "text": "Like, we can never really...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.006,
    "end": 3525.215,
    "text": " I mean, I guess that shared informational channel always comes through the niche environment, whether it's the internet or some knowledge artifacts like a scientific paper or a computer or something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.295,
    "end": 3530.42,
    "text": "But my relationship with you or any human is always through the niche environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.96,
    "end": 3532.501,
    "text": "There's always that filtration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.682,
    "end": 3537.926,
    "text": "And whether it's in real time, like we are here now, or sequentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.197,
    "end": 3560.446,
    "text": " even if it's uh so-called in person it's mediated by vibrating air molecules now it's intermediated through routers and such it's a utilization of the niche and i think this is just raising a super fascinating question well yeah thanks for raising this we'll discuss that and then this is like saying",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3561.482,
    "end": 3585.114,
    "text": " what it's one thing to talk through the tin cans that's like using the direct um passive active inference agents um even if we could describe the tin can as perception and action but now what if there's a chat bot that's intermediating between the two of us or it's translating between two different languages then where does that put the status of that entire cognitive system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3586.585,
    "end": 3608.991,
    "text": " does it influence thinking through other minds when the intermediaries are passive versus adaptive active inference entities so nice questions all right this is the part which also will unpack more in the dot one and two um this is kind of the wormhole strange loop turning the mirror back on itself part so the authors write",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.271,
    "end": 3616.256,
    "text": " in much the same manner as arriving at a representational or non-representational interpretation of FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3616.717,
    "end": 3621.641,
    "text": "So that's the whole sections that we just spent the whole time on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3622.522,
    "end": 3625.084,
    "text": "Everything within the realm of actually using the FEP",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3626.788,
    "end": 3635.394,
    "text": " not taking it as an unknown, but taking the FEP as an instrument and then using it to ask whether it is representational or not on those different aspects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3635.694,
    "end": 3652.986,
    "text": "So now we're gonna put that behind us and consider arriving at FEP as a synthesis depends on which representational criteria are assumed when either considering FEP central constructs or considering specific cognitive phenomena through the lens of a process theory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3653.766,
    "end": 3679.111,
    "text": " under fep hence in the end the debate about fep may reveal more about us our criteria for representation and our interests in particular facets of cognition than it does about the representational status of the fep so you know jfk is out there somewhere ask not what the fep can do for you it's saying because you can be all over the map",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3680.373,
    "end": 3691.399,
    "text": " maybe all of these sectors are in play and all the perspectives in each of those aspects, that means that somebody's posterior confidence in different",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3692.903,
    "end": 3714.442,
    "text": " claims is probably better reflecting of their priors and update process than some sort of objective stance or consensus reality about what the FEP is as if it could be such a thing independent of how it's specifically deployed as we talked about with model-based science and Majid Benny.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3715.643,
    "end": 3718.546,
    "text": "So this is a very nice point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3721.567,
    "end": 3722.448,
    "text": " Want to add anything, Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3723.129,
    "end": 3726.894,
    "text": "Yeah, I mean, fundamentally, the FVP is a representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.914,
    "end": 3731.0,
    "text": "I mean, it is our representation, our model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.02,
    "end": 3736.687,
    "text": "I mean, it might be the one that we employ with which to... It might be an instrument or it might be a real thing, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.8,
    "end": 3745.864,
    "text": " Still, we represent the FEP with equations and with ideas and memes and I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.244,
    "end": 3749.125,
    "text": "I mean, we impute our representation on it all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.846,
    "end": 3758.33,
    "text": "So whether it is a representation itself or we represent the FEP, but there's some play there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.75,
    "end": 3765.554,
    "text": "It's integrated with representation all the time, like linguistically or otherwise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3765.934,
    "end": 3766.374,
    "text": " Or maybe not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.755,
    "end": 3770.296,
    "text": "Maybe I'm not a real inactivist enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.476,
    "end": 3773.158,
    "text": "Or what was the radical inactivist?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.238,
    "end": 3774.118,
    "text": "Really radical, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3774.138,
    "end": 3775.039,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3775.059,
    "end": 3777.86,
    "text": "Well, I'm sure we'll talk more about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3777.96,
    "end": 3781.222,
    "text": "So just the conclusion and then a few last points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3782.082,
    "end": 3785.164,
    "text": "So nine sentences in the conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3785.704,
    "end": 3789.706,
    "text": "One, they looked at four different aspects of representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3790.587,
    "end": 3790.707,
    "text": "Two...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3792.188,
    "end": 3819.945,
    "text": " understanding which side of which line to come down on was complicated because the FEP appeals to multiple constructs that don't a priori seem to be strongly linked or naturally linked like it's unclear whether one begets the other or whether they co-instantiate or and that's the kind of work that we're really interested in in the ontology project and in the knowledge corpus engineering of course in the dot edu organizational unit of act inf lab",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3820.945,
    "end": 3847.981,
    "text": " the fep appeals to multiple constructs and those models can be constructed in various ways so it's good to clear up representation into these four full distinctions however it's complex still because the fep is kind of like a plurality in and of itself three they argue that depending on how you think about things you're going to think about things differently they then turn the mirror back",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3849.201,
    "end": 3861.359,
    "text": " and suggest that that's an opportunity to challenge, but it's also an opportunity to reflect upon how we value representation and different features in our model selection",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3862.509,
    "end": 3864.33,
    "text": " related to the main part of this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3865.311,
    "end": 3875.919,
    "text": "And then they sort of salvage the utility of FEP, whether heads FEP wins, tails not FEP loses, because the FEP can be heuristic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3876.559,
    "end": 3889.768,
    "text": "So like kind of good for functionally or pragmatically for philosophy of mind, even if not so much to settle the dispute on internal representation, but to unveil and dissect the hidden assumptions in the debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3890.649,
    "end": 3891.329,
    "text": "So it's kind of like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3892.19,
    "end": 3896.612,
    "text": " deploying FEP into the representation debate, it's not gonna be the judge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3896.932,
    "end": 3900.654,
    "text": "It's gonna be like some other role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3901.054,
    "end": 3903.095,
    "text": "What is the FEP in that setting?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.975,
    "end": 3912.759,
    "text": "Six, another lesson learned is that some traditional polarizations might be attenuated or dissolved under the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3913.739,
    "end": 3918.962,
    "text": "So here we're seeing multiple uses of the FEP, which is why there's a bunch of different colors on here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3920.359,
    "end": 3922.101,
    "text": " It's a theoretical plurality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3922.902,
    "end": 3926.786,
    "text": "It's also a plurality of applied models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3928.047,
    "end": 3928.708,
    "text": "It's a mirror.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3930.95,
    "end": 3931.651,
    "text": "It's a bet hedge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3933.371,
    "end": 3937.952,
    "text": " It's a unifier with traditional polarizations like cognitivist versus an activism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3938.933,
    "end": 3942.974,
    "text": "And then here's a really fascinating part that I know many people in the lab will be excited to talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3943.734,
    "end": 3950.156,
    "text": "The FEP advances a unified view where terms that traditionally belong to different ontologies can be harmonized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3951.817,
    "end": 3953.877,
    "text": "So it's an ontological unifier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3954.557,
    "end": 3961.7,
    "text": "For example, modeling and expectation is not used in some of the works that talk about autopoiesis and synchronization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3965.188,
    "end": 3966.592,
    "text": " How does the FVP do this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3967.594,
    "end": 3973.408,
    "text": "It begins with a strong inactivist flavor and a focus on action that's missing from traditional cognitive theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3974.249,
    "end": 3991.864,
    "text": " So by starting with one foot squarely in action, it brings something that a lot of neurocognitive theories are missing from, and then extends the scope of an activist thinking to territories of, for example, counterfactual thinking and model selection and abductive logic, like we talked about also with Benny.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3992.544,
    "end": 4000.931,
    "text": "So it's kind of like coming from actionlandia and bringing in inference, and then starting from inferencelandia and bringing in action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4001.892,
    "end": 4005.595,
    "text": " Almost like it's called active inference or that's like a related idea or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4006.195,
    "end": 4012.32,
    "text": "And then the ninth sentence is just saying the space of the possible is big.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4013.1,
    "end": 4016.923,
    "text": "And we're going to have to reduce our uncertainty by making it happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4018.604,
    "end": 4021.066,
    "text": "So it's a really great conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4025.009,
    "end": 4025.87,
    "text": "Any other comments on it, Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4026.77,
    "end": 4028.471,
    "text": "Just pretty epic paper work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.434,
    "end": 4035.479,
    "text": " Like, I think it ties together a lot of stuff we've talked about, stuff we will talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.1,
    "end": 4036.26,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4037.12,
    "end": 4037.341,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4037.821,
    "end": 4040.784,
    "text": "Final things and things to discuss in dot one and dot two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4041.564,
    "end": 4041.804,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4041.824,
    "end": 4051.833,
    "text": "So here is a quote from the paper where they say, given that FEP has been implemented in a family of computational models that are by definition fully observable,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4053.82,
    "end": 4054.88,
    "text": " Dot, dot, dot, dot, dot, dot, dot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4055.421,
    "end": 4057.121,
    "text": "That's the first part to highlight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4057.741,
    "end": 4061.763,
    "text": "So in what sense are computational models fully observable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4061.903,
    "end": 4064.244,
    "text": "Or what does observability mean for models?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4064.884,
    "end": 4068.025,
    "text": "What does explainability mean or transparency mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4068.465,
    "end": 4069.666,
    "text": "Is that reproducibility?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4070.206,
    "end": 4071.346,
    "text": "Is that perturbability?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4072.767,
    "end": 4074.127,
    "text": "Is the map fully observable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4074.868,
    "end": 4076.348,
    "text": "Is the territory fully observable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4077.108,
    "end": 4080.87,
    "text": "Are there settings where one or the other or neither or both are visible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4081.806,
    "end": 4089.473,
    "text": " So what is this visual metaphor and what are some of the nuances with like observability and visual perception?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4090.574,
    "end": 4093.597,
    "text": "And then here is FEP as a unifier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4096.974,
    "end": 4101.616,
    "text": " it's less surprising if one considers FEP unites notions that are generally considered antithetical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4102.116,
    "end": 4103.637,
    "text": "So meaning like contrary to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4104.077,
    "end": 4114.962,
    "text": "Most notably, the notion of internal generative model, which is usually associated with representationalist theories and autopoiesis, which is usually associated with non-representational inactive approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4115.623,
    "end": 4121.646,
    "text": "So I think just who considers which notions antithetical?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4122.685,
    "end": 4133.994,
    "text": " Some classic examples are provided here, like to Helmholtz and Maturana and Varela, but just who disagrees and why?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4134.855,
    "end": 4139.058,
    "text": "And what can we learn by just hearing different perspectives on some of these debates?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4139.899,
    "end": 4144.843,
    "text": "And then how is representation related to autopoiesis?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4146.064,
    "end": 4146.204,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4147.475,
    "end": 4153.279,
    "text": " Autopoetic systems are those that are capable of producing and maintaining themselves by creating their own parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4154.08,
    "end": 4156.481,
    "text": "It's kind of a classic complexity idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4157.642,
    "end": 4165.187,
    "text": "And it made me think about poetic naturalism, and then all these other proposals like the meta poetic naturalism and stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4165.828,
    "end": 4166.068,
    "text": "And then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4167.648,
    "end": 4190.964,
    "text": " There were zero Google hits for autopoetic naturalism, but I think it's very related to what we spoke about with Majid Beni and science as modeling in the world and about, of course, the title of this paper and the representations questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4192.405,
    "end": 4196.628,
    "text": "So this is just a very provocative paragraph that brings a lot of ideas in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4196.688,
    "end": 4196.848,
    "text": "Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4197.665,
    "end": 4200.029,
    "text": " Well, it's also just the middle way, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4200.049,
    "end": 4201.752,
    "text": "Like, is it this or that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.932,
    "end": 4205.679,
    "text": "Or maybe some combination of these two things is the right thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.816,
    "end": 4209.337,
    "text": " the depth perception, as Dean says.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4209.617,
    "end": 4214.16,
    "text": "So then one more sort of general comment, and then we'll go to the specifics to discuss next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4214.36,
    "end": 4217.402,
    "text": "So this is the FEP as mirror.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4218.223,
    "end": 4228.59,
    "text": "So one can use the debate on representation and FEP the other way around, not as a way to resolve the issue at stake, but as a mirror to look at one's own implicit notions of representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4229.23,
    "end": 4233.733,
    "text": "So here's a paper that I wrote with my colleague, Eric Sovik in 2019,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4235.154,
    "end": 4237.736,
    "text": " where we talked about scientific theories for consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4238.918,
    "end": 4258.656,
    "text": "And so instead of using a model of consciousness for granted, like integrated information theory or some other quantitative measure of consciousness, we took the system as the precondition, which was an ant colony, and then reflected back on different scientific theories of consciousness",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4260.197,
    "end": 4268.642,
    "text": " what that said about what people value about, for example, anatomical versus functional, linguistic, behavioral components of systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4269.323,
    "end": 4275.146,
    "text": "And so we talked about like forward tests where you're good with your tests, you've got a calibrated instrument,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4276.087,
    "end": 4284.937,
    "text": " And so this is like what the bulk of the literature review was in the first half of this paper, which was like, we're just going to go with the FEP as what our framework is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4285.637,
    "end": 4293.125,
    "text": "And then we're going to assess, there's still a diversity of perspectives on representation, even if you think the FEP is totally the go-to theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4293.726,
    "end": 4296.089,
    "text": " So this does not mean that you eliminate ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4296.59,
    "end": 4309.805,
    "text": "It just means that you're using your tool in a deployment oriented way versus the reverse test, which is like taking things that are known in the world or some sort of internal reference data and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4312.04,
    "end": 4324.086,
    "text": " shining it back as a mirror on the test and comparing amongst tests, which also does, of course, recurse because it's a test being applied to do so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4324.846,
    "end": 4328.628,
    "text": "But that's where the real revolutionary science happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4329.389,
    "end": 4333.571,
    "text": "And so this paper by Pizzullo and Sims",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4335.419,
    "end": 4354.068,
    "text": " showed both modes in total harmony and so i think it's an awesome contribution from philosophy of science perspective so i look forward to talking about that and about forward and reverse tests and then here's a bunch of other stuff what are you excited about here blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4354.821,
    "end": 4364.527,
    "text": " This is just stuff I wrote down to talk about while I was just taking notes while we were talking today about what might be cool to discuss in the dot one and dot two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4364.567,
    "end": 4368.489,
    "text": "A lot about the sensory motor loop, mental engagement, mental action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.11,
    "end": 4374.513,
    "text": "Does that trigger the same kind of physiological response as an actual action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.533,
    "end": 4380.837,
    "text": "And then the idea of thinking through other minds versus multiscale integration, what might be similar or different there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.637,
    "end": 4388.401,
    "text": " and the independent existence of the FEP, or is it just a mirror we hold up maybe for ourselves?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.961,
    "end": 4391.963,
    "text": "But I think that this paper was provocative and great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.563,
    "end": 4407.332,
    "text": "I have been a big fan of Pazulo for a long time, more recently a Matt Sims fan, but probably I've been reading Pazulo's papers for 10 years and I'm excited to have the chance to really dissect a paper by him with more than just myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.056,
    "end": 4409.276,
    "text": " Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4409.957,
    "end": 4414.059,
    "text": "Well, Blue, thanks a ton for the awesome work on the .Zero.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4414.239,
    "end": 4421.784,
    "text": "I think we were trepidatious to jump into this, Pape, but then it was rewarding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4421.864,
    "end": 4422.924,
    "text": "You were trepidatious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.944,
    "end": 4423.745,
    "text": "I was like, oh, easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4423.845,
    "end": 4424.565,
    "text": "No problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4424.625,
    "end": 4425.206,
    "text": "I got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.226,
    "end": 4425.746,
    "text": "I got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.866,
    "end": 4426.587,
    "text": "I'm projecting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4426.787,
    "end": 4427.227,
    "text": "It's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4427.367,
    "end": 4427.787,
    "text": "It's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4427.987,
    "end": 4429.689,
    "text": "I was like, yeah, that's an easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.709,
    "end": 4430.429,
    "text": "Yeah, we got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4430.529,
    "end": 4430.889,
    "text": "One week?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4430.929,
    "end": 4431.209,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.45,
    "end": 4432.59,
    "text": "Three days for .Zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.61,
    "end": 4433.111,
    "text": "We got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4433.151,
    "end": 4433.551,
    "text": "We're good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.912,
    "end": 4436.593,
    "text": "I read it a long time ago also, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4437.898,
    "end": 4444.403,
    "text": " Yep, we just hope that anyone who wants to ask a question can, even if it's long past the .1, .2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4444.804,
    "end": 4450.048,
    "text": "If you're listening to this in time, then congrats, and you should definitely get involved in the conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4450.808,
    "end": 4453.571,
    "text": "And otherwise, we'll see you around the lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4454.071,
    "end": 4456.353,
    "text": "So thanks again, Blue, and thanks everybody for watching.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4456.393,
    "end": 4456.773,
    "text": "See you later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4457.413,
    "end": 4457.894,
    "text": "Thanks, bye.",
    "speaker": "SPEAKER_01"
  }
]