[
  {
    "start": 2.478,
    "end": 21.313,
    "text": " All right, greetings everyone welcome back it's Halloween 23 and we're in our second discussion on Chapter three, so we will look at the cohort five questions on Chapter three um so.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 23.318,
    "end": 33.71,
    "text": " I encourage people to add even now questions directly to cohort five questions or there's all this other questions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 33.75,
    "end": 37.735,
    "text": "So maybe people added directly to the table and so it doesn't have the cohort five tag.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 38.736,
    "end": 52.532,
    "text": "But before we go to any questions, does anyone just want to bring up some piece of chapter three that stuck with them or highlight some other topic or...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 53.339,
    "end": 78.857,
    "text": " share a little bit about how they're seeing the low road and the high road now that we're getting to our second discussion on the high road yeah Susan then anyone else who raises their hand so does the low road and the high road are they differentiated",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 79.782,
    "end": 92.813,
    "text": " by active inference versus active learning no active learning was the term used by that one paper just to sort of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 93.704,
    "end": 119.695,
    "text": " spin the fastball a little bit different to highlight kind of like a regime that an active inference agent can be in instead of a purely conform confirmatory sensory mode rather a mode that that reduces uncertainty maximally about world states but active inference is the bigger circle which what the authors characterized as active learning is a smaller subset within",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 121.413,
    "end": 122.535,
    "text": " which incorporates it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 123.236,
    "end": 135.656,
    "text": "And so Dean brought up that active inference was a process of provisioning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 137.439,
    "end": 138.621,
    "text": "Can you speak to that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 142.768,
    "end": 145.412,
    "text": "This was in private conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.337,
    "end": 168.615,
    "text": " we'd have to know a little more about what he meant um but it's a very evocative yeah so that but that kind of brought the question of differentiating active learning from active inference versus police updating say because learning would involve belief updating right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.317,
    "end": 181.866,
    "text": " Yeah, as with a huge number of the topics that we hear about, belief updating, attention, learning, anticipation, there's often a narrower technical sense.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 182.046,
    "end": 186.537,
    "text": "Like belief updating is just any Bayesian parameter updating at all.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 186.517,
    "end": 209.959,
    "text": " so belief updating doesn't always refer to a human with a psyche undergoing some kind of like narrative development it can be a lot more narrow and small and less loaded with like philosophical or cultural baggage than if we were to say hey when's the last time you had a belief updating most people aren't going to say well when one of my proprioceptors in my arm",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 209.939,
    "end": 234.411,
    "text": " you know did something different um so sometimes yeah the narrow sense or the technical sense of a term and then the the broader um um scope of what it might evoke and and so these are all good comments um christoph then anyone else raised their hand",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 237.26,
    "end": 258.014,
    "text": " I just want to say that the high road and the road to active inference through this ideas of self-organization and self-evidencing, that really reminded me of some work that I'm not familiar with deeply mathematically, but conceptually it seems very similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 258.055,
    "end": 263.183,
    "text": "That's Jeremy England's work on the thermodynamic origin of life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 263.298,
    "end": 284.949,
    "text": " He kind of, in his work, he has shown that if you have a system that's receiving an energy from external source and it has a place to dissipate that energy, and there are certain other conditions that need to be met, then the system will necessarily organize itself in such a way to take advantage of that energy source.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 285.17,
    "end": 286.892,
    "text": "So it will start creating structures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 287.092,
    "end": 293.427,
    "text": " that will allow it to utilize that energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 293.808,
    "end": 304.172,
    "text": "And in his talk, I think that was at MIT a couple of years ago, at the very end of the talk, he makes this offhand remark that probably",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 304.152,
    "end": 312.585,
    "text": " when the energy coming in has some kind of temporal structure that may eventually lead to the emergence of intelligence or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.685,
    "end": 320.858,
    "text": "That kind of made me, when he said that in the talk, made me think about, you know, Faraday speculating about the electromagnetic nature of light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 321.779,
    "end": 323.722,
    "text": "He's probably right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 323.862,
    "end": 331.594,
    "text": "And I'm pretty sure that he's, I'm quite sure because he started with thermodynamics with his work, that it can be reconciled with active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 331.574,
    "end": 347.549,
    "text": " So it's also kind of fascinating that there is this very close but slightly different view that kind of arrives at pretty much the same kind of conclusion from, you know, quite different set of assumptions, but related.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 347.589,
    "end": 351.593,
    "text": "Yeah, very interesting.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 351.753,
    "end": 353.535,
    "text": "Dr. Einstein, then anyone else?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 360.322,
    "end": 360.822,
    "text": "This isn't",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 361.409,
    "end": 363.973,
    "text": " Aaron Ostrowski- Low road high road specific So do you want to.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 363.993,
    "end": 373.286,
    "text": "Aaron Ostrowski- shelf it for a second, but I was curious about something on page 52 that goes back to the conversation we were having here.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 373.306,
    "end": 378.794,
    "text": "Aaron Ostrowski- Two weeks ago in the in the morning group or wherever you guys are.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 378.814,
    "end": 382.399,
    "text": "Aaron Ostrowski- And it's about the idea of perception is action.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 383.921,
    "end": 386.505,
    "text": "Aaron Ostrowski- And we were getting into that.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 387.329,
    "end": 398.123,
    "text": " And on 52, you know, they, um, use this example of you're hungry and your, your glucose is low.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 398.143,
    "end": 399.225,
    "text": "So you have a hunger response.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 399.305,
    "end": 408.056,
    "text": "And so, you know, there is this line that says, um, perception cannot go further than to reduce your surprise.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 409.498,
    "end": 413.303,
    "text": "And it got me thinking about like, if anybody here has ever fasted.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 414.211,
    "end": 417.775,
    "text": " for example, you know, you'll be really hungry the first day or whatever.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 417.815,
    "end": 423.582,
    "text": "And then by the second day, your hunger is just dissipated.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 423.622,
    "end": 436.978,
    "text": "And that got me thinking about that conversation we were having here regarding perception as action, because, you know, what is it in terms of this",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 437.718,
    "end": 463.624,
    "text": " field i mean obviously that's like a belief updating about your need to eat or something but what what would be the mechanism you know uh according to this theory that would cause your hunger to dissipate because there's been no act there's been no action in the external world to reduce your hunger it seems like it would be purely just a matter of perception",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 465.764,
    "end": 493.392,
    "text": " so when when they have that one line that perception you know can go no further than to reduce the surprise i yeah it just made me think about that kind of as a thought experiment cool yeah francis i know a little bit about that this is okay go for it go for it yeah there there is action going on your body's metabolism is changing and um there is a yeah there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.777,
    "end": 517.388,
    "text": " there's essentially external states that are functioning on your mind um in that transition between day one and day two on fasting that makes it not a completely internal state derived activity i mean would that count as taking an action though i mean because you're not consciously you know changing your external environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.81,
    "end": 526.981,
    "text": " I think that if you sketch it according to the act in fontology, it'll bring it into the rails.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 527.602,
    "end": 533.071,
    "text": "If you sketch out what's being observed, what are the hidden states being inferred, it will clarify a lot of pieces.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 533.091,
    "end": 540.304,
    "text": "Because otherwise, I mean, we could go infinitely into the actual biomolecular processes that happen in human fasting.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 541.027,
    "end": 570.274,
    "text": " but to kind of return to my question yeah yeah but that's everything is how how do we take that situation of interest with its particularities and approach it from the high road Francis and then and then Christoph so uh from a counseling background I'd say that you have to look at the whole self the part of you that needs the need for food is one of your needs",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 571.368,
    "end": 581.257,
    "text": " You have other needs, maybe the need to fit in with your group, whatever need is driving you to fast.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 583.459,
    "end": 592.587,
    "text": "So you have to look at the perceptions, the goals of the whole self and how these balance out.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 594.949,
    "end": 598.933,
    "text": "You're always dealing with conflict, inner conflict.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 599.293,
    "end": 601.155,
    "text": "We have multiple needs at any one time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 602.452,
    "end": 609.82,
    "text": " Um, so, uh, uh, yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 610.28,
    "end": 613.383,
    "text": "Um, and how that would work at the active inference level.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 613.824,
    "end": 615.546,
    "text": "I'm not entirely sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 615.566,
    "end": 632.323,
    "text": "Maybe it would, uh, reinforce the, uh, uh, strengthen, uh, the expectations in such a way that, uh, you ignore the, um, evidence against.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 634.177,
    "end": 640.322,
    "text": " I don't have a sufficiently good, strong understanding to propose the mechanism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 641.648,
    "end": 642.732,
    "text": "That's what I wanted to say.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 642.772,
    "end": 643.917,
    "text": "It's the whole self.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 646.09,
    "end": 673.279,
    "text": " cool mark miller has explored this kind of like multi-drive balancing and about well-being as optimizing well across multiple domains because you can't just like optimize your blood glucose and not your blood oxygen you die um and then also internal or covert action as attention to simply disattend or to attenuate from the grumbling of the stomach",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 673.985,
    "end": 682.814,
    "text": " helps make it an unsurprising path of policy selection not to order something at the restaurant or put the fork in the mouth or whatever it may be.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 683.697,
    "end": 685.142,
    "text": "Andrew, then Christoph.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 688.919,
    "end": 713.475,
    "text": " sure uh not just a general thought of um regarding the active inference framework I mean could we say something like um you know someone is making a decision to fast is a sort of like a higher order decision but nonetheless on the day today if they're not used to fasting or even if they have in the past but you know have not been for say the past week",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 713.455,
    "end": 730.578,
    "text": " such that they are very used to and therefore expecting to eat at regular time intervals on the day-to-day that despite the fact that they've made this kind of higher order decision to not eat, nonetheless, like their body and other processes are expecting food.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 731.88,
    "end": 735.725,
    "text": "They are in fact not receiving food because of the fasting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 736.066,
    "end": 740.492,
    "text": "And so there's a higher level of something, like there's an increase of something like surprisal",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 740.472,
    "end": 758.346,
    "text": " or or uncertainty that is like even though i can kind of consciously think like oh no i could eat food i'm just choosing not to my body is still experiencing physiological shifts and changes because i'm not eating that is generating a lot of like um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 758.731,
    "end": 765.786,
    "text": " kind of uncertainty in my body, you know, this is different, this is not usual, this is not realizing my typical set of preferences.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 766.607,
    "end": 770.436,
    "text": "And then over time is the body kind of adjust to that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 771.698,
    "end": 774.985,
    "text": "Suddenly, the need, you know, hunger, other",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 774.965,
    "end": 798.981,
    "text": " um kind of sensations of surprises or otherwise might start to reduce is you the body starts to realize like oh no i'm fine like my my homeostasis is not exactly in danger here even though you know it was kind of a shock initially to start experiencing the um you know the the the difficulties of fasting uh in the first place on day one right",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 799.855,
    "end": 806.201,
    "text": " Yeah, here we have the glucose observations, and then you can infer what the hidden state is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 806.381,
    "end": 809.924,
    "text": "Again, it's the modeler's choice, map, not territory, but this could be risk of death.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 810.425,
    "end": 812.526,
    "text": "So it might be a matrix learning.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 813.107,
    "end": 818.592,
    "text": "Oh, actually, I don't have a high risk of dying, even when it's at this value or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 819.293,
    "end": 821.515,
    "text": "Then you've mentioned like habits.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 821.715,
    "end": 823.036,
    "text": "I mean, oh, it's 5 p.m.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 823.757,
    "end": 828.681,
    "text": "So the generative model is in the business of the path of least action, doing the likeliest thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 828.661,
    "end": 848.221,
    "text": " So if 99% of the last 1,005 PMs you did something, your prior's high on simply doing it as a matter of habit or of having a preference for a high glucose would then lead to the selection of policies that make those observations unsurprising.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 849.061,
    "end": 858.651,
    "text": "So once you start to kind of take a figure or some formalism and go beyond just associating components of territory,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 858.698,
    "end": 872.436,
    "text": " to bringing them in to stitching together a total generative model, you find that there's many generative models you can draw, sometimes with convergence insights, other times that highlight different features.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 873.277,
    "end": 887.575,
    "text": "And that's part of the iterated process of modeling is like developing a portfolio of generative models, like many maps of the city, and then finding out, well, where are these special cases or generalizations of each other?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 887.757,
    "end": 897.735,
    "text": " What's the kind of measurement or experiment that as a modeler is going to help me differentiate amongst these two different structural hypotheses?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 900.04,
    "end": 901.362,
    "text": "Christophe, then anyone else?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 905.594,
    "end": 909.359,
    "text": " You kind of beat me to the punch because I was about to say that it's all about tuning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 909.439,
    "end": 913.265,
    "text": "Well, it's not all about, but it's largely about tuning precision parameters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 914.046,
    "end": 928.767,
    "text": "So if you do an experiment where you fast regularly, like say every week, you're going to find that even though you're starting from effectively the same starting point, so it's a somewhat reproducible experiment, week after week after week after week, it's becoming easier and easier and easier to fast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 929.067,
    "end": 934.814,
    "text": " And also, I'm not an adept meditator, but I have some level of skill.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 935.034,
    "end": 939.32,
    "text": "And in my case, I can easily distinguish between two kinds of hunger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 939.82,
    "end": 945.107,
    "text": "There's an intellectual craving for novelty, which I derive quite a lot of novelty from food.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 945.207,
    "end": 946.949,
    "text": "It's a pretty easy source of novelty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 946.969,
    "end": 954.619,
    "text": "And a lot of people, I think, their feeling of hunger is kind of virtual that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 954.599,
    "end": 960.07,
    "text": " And there is a physiological hunger that's a very distinct and different kind of feeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 960.771,
    "end": 971.292,
    "text": "And most of the time I actually know that my body does not need food, even though I feel like I would like to eat something because I'm creating this intellectual novelty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 971.272,
    "end": 986.817,
    "text": " And I think there's an interesting way to actually experience this very directly, like how this process of tuning precision parameters happens, is that if you take a big exhale and empty your lungs and hold your breath for as long as you can,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 986.797,
    "end": 989.46,
    "text": " At some point, your body will force you to take a breath.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 989.821,
    "end": 1002.056,
    "text": "You can't really just suffocate that way because amygdala will kick in and they will trigger this kind of panic fight or flight response that will kick you into taking a big breath.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1002.617,
    "end": 1012.769,
    "text": "But if you do it again and again and again and again, very quickly, you just get used to it and you're no longer reacting to that with panic and you can hold your breath for much longer and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1013.19,
    "end": 1015.993,
    "text": "And you can actually experience some really nice effects of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1015.973,
    "end": 1020.057,
    "text": " saturating your blood with CO2, which is extremely relaxing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.618,
    "end": 1031.069,
    "text": "And it pushes O2 deeper into the cells and actually helps to pry oxygen away from red blood cells and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.39,
    "end": 1033.952,
    "text": "And it's entirely controlled by amygdala.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1034.573,
    "end": 1037.296,
    "text": "And that's why it comes with this fascinating reaction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1037.336,
    "end": 1041.12,
    "text": "And you can observe yourself tuning that parameter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1041.438,
    "end": 1049.79,
    "text": " and very quickly you can get used to much higher concentrations of CO2 in your blood, and it's not a problem at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1049.811,
    "end": 1050.712,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1051.573,
    "end": 1060.406,
    "text": "Just to sort of look ahead to the kinds of generative models that make up doing active inference modeling, we see this all the time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1061.007,
    "end": 1063.711,
    "text": "Figure 4.3, we're going to revisit Chapter 7.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1064.633,
    "end": 1068.238,
    "text": "So this is the partially observable Markov decision process.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1068.337,
    "end": 1072.881,
    "text": " Now, as shown here, there are no precision parameters.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1073.442,
    "end": 1089.016,
    "text": "But then quickly after, they show, well, yeah, you can actually have another parameter kind of on top of each of them, little d on top of the d prior, little a on top of the a, little b on top of the b, and so on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1089.937,
    "end": 1096.403,
    "text": "And this speaks to the extensibility or the modularity of building",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1097.159,
    "end": 1108.842,
    "text": " generative models using Bayes graphs is in the kind of plain first level model, you just have a fixed A matrix.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1110.145,
    "end": 1118.02,
    "text": "And then you can say, well, what about having a variance on the A matrix, like a kind of precision on A?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1118.658,
    "end": 1122.644,
    "text": " Well, if that helps you get at the phenomena that you're interested in, that might be something to try.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1122.684,
    "end": 1126.37,
    "text": "You could also continue to even develop further.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1126.71,
    "end": 1133.44,
    "text": "So what if we had policies on which attention we wanted to have on A?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1134.882,
    "end": 1135.744,
    "text": "No one's stopping you.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1136.465,
    "end": 1138.007,
    "text": "It's just map building.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1138.868,
    "end": 1146.64,
    "text": "And especially if it's being done as a kind of thought experiment outside of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1147.345,
    "end": 1166.586,
    "text": " reconnecting with the empirical measurements then yeah there's basically no end to speculating about where you could it's just like building Lego constructions because you could you could have another variable connected to here and here and here and here and so",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1167.578,
    "end": 1173.992,
    "text": " Hence, it can be kind of an open-ended and aesthetic journey to make these kinds of glyphs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1175.054,
    "end": 1187.241,
    "text": "But then if you want to reconnect it back to the empirical data, which is discussed most in Chapter 9, then you kind of have a divergent, convergent, iterative process",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1187.221,
    "end": 1206.799,
    "text": " where you expand the portfolio of generative models you have, and then you use some experiments or measurements to then select or do Bayesian model selection to go back down to a smaller subset of them, and then you can kind of diversify from there, select them back down.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1211.808,
    "end": 1220.478,
    "text": " Any other thoughts or we can look at some of the most upvoted questions or any other questions that people want to look to?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1228.947,
    "end": 1234.153,
    "text": "Any other thoughts or just remarks on the low road and the high road?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1236.04,
    "end": 1252.125,
    "text": " um I did just kind of want to throw it out there like near the end of the high road like box 3.3 they're describing entropy minimization and open-ended behavior",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1252.375,
    "end": 1260.284,
    "text": " And I guess just I just want to mention generally the topic of like, how does an agent within a fluctuating environment?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1261.405,
    "end": 1277.843,
    "text": "On the one hand, find means of like adapting to that environment like that is how does it act in order to maintain something like homeostasis or allostasis, but at the same time not become too rigid, like not",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1278.734,
    "end": 1297.78,
    "text": " repeatedly make the same exact decisions purely to maintain its homeostasis and instead allow for something like improvisation or like they phrase it as an open-ended repertoire of novel behaviors, creativity or something like that can arise.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1298.32,
    "end": 1306.311,
    "text": "So just that question of like behavior being like too rigid in an environment versus like actually being able to change, being able to",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1306.291,
    "end": 1329.497,
    "text": " come up with new things unexpected things even things that haven't been tested so you would expect that like why would you do that that would probably bring higher surprise uh even more uncertainty so that just those kinds of questions balancing those things yeah the the there's there's a ton to say there um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1331.637,
    "end": 1346.473,
    "text": " well what one aspect is in expected free energy so in the criterion used for prospective selection of action there's an information gain or epistemic value term so",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1347.685,
    "end": 1363.163,
    "text": " surprising information informative information is actively sought after because policies that lead to information gain are directly chosen so that's one kind of prospective looking",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1363.244,
    "end": 1388.29,
    "text": " answer um that holds up both seeking observations that that accord with um preferences that's loaded onto pragmatic value and seeking out informative information that's the information game and that's um referenced here at the end of the box um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1391.51,
    "end": 1418.749,
    "text": " another piece to it is it's kind of like all these different seesaws epistemic and pragmatic value or underfitting and overfitting active inference isn't saying there is a specific answer to that but it gives us the the canvas that we could then do the balancing within like you can make an agent that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1419.32,
    "end": 1447.183,
    "text": " only undertakes epistemic action or conversely under only undertakes pragmatic action so it's not that just framing it with an active inference gives you an adaptive agents it's just that this is an expressive enough framework for generative modeling that you can find those special regions or manifolds within state space that might have those kind of like flexible or adaptive properties",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1451.399,
    "end": 1460.295,
    "text": " So it's not that something works and does balance informational and pragmatic value just because it's using expected free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1464.202,
    "end": 1471.936,
    "text": "It has to be kind of tuned to sit at that special place.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1473.639,
    "end": 1475.162,
    "text": "Dr. Einstein, then anyone else?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1481.352,
    "end": 1482.093,
    "text": " Okay, you're a minute.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1482.113,
    "end": 1491.472,
    "text": "I never expected these computers, you know, still learning curve since I hopped in the time machine.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1494.938,
    "end": 1498.365,
    "text": "But yeah, I think last week we we.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1499.071,
    "end": 1504.279,
    "text": " Towards the end of the session, got to that line in box 3.3.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1504.92,
    "end": 1516.238,
    "text": "This could be understood as the imperative to explain things as accurately as possible, but also keep options open and avoid committing to any specific explanation unless this is necessary.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1516.819,
    "end": 1519.203,
    "text": "That's the maximum entropy principle.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1520.505,
    "end": 1524.591,
    "text": "I mean, yeah, that's such a curve ball.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1524.611,
    "end": 1526.935,
    "text": "They kind of sneak in there.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1527.37,
    "end": 1552.095,
    "text": " At the end, I'm still trying to reconcile that because it makes sense intuitively in respect to like information forging behavior, the necessity to calculate surprise beyond just simply minimizing it or in respect to expected free energy rather than variational free energy.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1552.582,
    "end": 1569.22,
    "text": " So it's kind of, I guess, it's an epistemically interesting question as far as what is the conception of truth in the active inference framework.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1569.84,
    "end": 1581.913,
    "text": "I mean, it seems that it implies that everything, you know, any agent has to simply view the world and truths in the world through a probabilistic framework.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1582.214,
    "end": 1600.138,
    "text": " and um there can be no absolute you know a priori truth in in this or am i i mean these are huge huge philosophical questions yeah",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1600.338,
    "end": 1624.219,
    "text": " suffice to say that it's not about what the territory is or does however we may take a probabilistic approach to modeling a system that has deterministic or probabilistic characters and then whether or not we think this or that about this or that and whether it thinks this or that any one of those could be right or wrong or literally whatever",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1624.418,
    "end": 1652.451,
    "text": " so I think it's it's a jumping off point for some larger philosophical questions but certainly it's not at the fundamental layer of the framework to to have an opinion on stances that even with little familiarity we can see one could jump one way or the other um Andrew oh yeah sorry just a follow-up on that um and then",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1652.735,
    "end": 1674.364,
    "text": " My question would be is, you know, how would you, how do you, and maybe I just need to research more, but how to reconcile, you know, that forging imperative or maximum entropy imperative with the Hamiltonian, you know, gradient of least action, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1674.505,
    "end": 1682.235,
    "text": "Is there a, I mean, is there a statistical means of reconciling?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1683.329,
    "end": 1709.067,
    "text": " reconciling those concepts yeah great great question the path of behaviors that the agent undergoes is being conceptualized as a path of least action most likely thing that the generative model could do so depending on the generative models set up the most likely thing for it to do might be engage in exploratory behavior",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1711.392,
    "end": 1740.994,
    "text": " um Andrew then call it yeah um we had the what is the low road versus the high road question earlier um and I thought I'd give my stab at it um nice the low road is the fundamental question is what's the nature of inference and the high road the fundamental question is what is the nature of identity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.927,
    "end": 1744.808,
    "text": " That's my stab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.129,
    "end": 1751.578,
    "text": "I have some for follow-on questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.24,
    "end": 1757.406,
    "text": "I voted up a couple that I thought are interesting and were questions I had.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.027,
    "end": 1761.312,
    "text": "Hopefully they rise to the top, but that's all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.675,
    "end": 1763.056,
    "text": " Cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1763.576,
    "end": 1764.678,
    "text": "That's awesome.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1764.698,
    "end": 1766.681,
    "text": "Because inference could be about anything.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1766.701,
    "end": 1768.163,
    "text": "It doesn't have to be about identity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1768.443,
    "end": 1770.686,
    "text": "So we could do Bayes' theorem, Bayesian statistics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1770.867,
    "end": 1774.251,
    "text": "It doesn't have to be about a cybernetic, autopoetic entity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1774.271,
    "end": 1786.328,
    "text": "And then identity, especially if we're going to be talking about persistence of identity and self-organization in a dissipative niche and all of this, it doesn't tell us how.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1786.769,
    "end": 1790.034,
    "text": "So I think this is an awesome dyad.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1791.115,
    "end": 1792.497,
    "text": "Colin, then Pablo.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1795.042,
    "end": 1810.418,
    "text": " I was just stimulated to think from looking again at the explanation of expected free energy as a balance between information gain and pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.459,
    "end": 1822.551,
    "text": "And I found all of these formula were interesting in that they all represent a kind of balancing of two things, one of which you could prioritize more, but only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.97,
    "end": 1824.974,
    "text": " by reducing the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.676,
    "end": 1836.919,
    "text": "And it just seemed to me that we're prescribing the right way in which these two things are to be balanced against each other when active inference is done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.34,
    "end": 1840.607,
    "text": "And we were kind of saying, therefore, that this is the way it must happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.672,
    "end": 1851.711,
    "text": " but I was wondering why is it not possible to take a step back and say, well, my model about how I decide what to do is I could give greater priority to information gain and less to pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1852.372,
    "end": 1865.515,
    "text": "And is it not a reasonable thing that people could make choices to do it differently in what way is forbidden or made difficult by active inference theory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.828,
    "end": 1867.749,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.45,
    "end": 1870.373,
    "text": "Yeah, these are great questions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1871.614,
    "end": 1878.042,
    "text": "Very nice insight that there's like two pieces broken out in each of these framings.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1880.706,
    "end": 1883.189,
    "text": "Don't get hit with the equal time fallacy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1884.01,
    "end": 1893.983,
    "text": "When you actually calculate this for real policies, this one might, depending on how the numbers are, this might equal 0.1 and this might equal a million.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1895.06,
    "end": 1898.806,
    "text": " So policy selection might be driven by one or the other.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1899.527,
    "end": 1901.87,
    "text": "Just because there's two terms doesn't mean that it's 50-50.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1903.813,
    "end": 1921.32,
    "text": "So if the C vector, to be more concrete here, is very large, and we'll see this later in the textbook, if the C vector has a large size, then pragmatic value dominates expected free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1921.469,
    "end": 1930.442,
    "text": " if the C value is small relative to uncertainties, then information gain dominates pragmatic considerations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1931.784,
    "end": 1944.022,
    "text": "And so again, this is like a seesaw and then adaptivity is like the seesaw being balanced, but just the seesaw itself is not balanced because that's kind of, there's no one on it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1945.144,
    "end": 1949.991,
    "text": "But when you actually build the generative model and parameterize it,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1950.865,
    "end": 1976.029,
    "text": " then you'll start to play around and see oh maybe something needs to change because it's only doing information forging it's never going for the pragmatic outcome um i was thinking more in a situation where they were they were closely balanced and that one that that there was a fine tuning of moving more more more waiting one more than the other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.144,
    "end": 1979.829,
    "text": " It seemed like it's been prescribed here how you should weight them in that situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.85,
    "end": 1988.703,
    "text": "And should I spend time getting results or should I abandon getting results and go and get more information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.704,
    "end": 1991.246,
    "text": "Sometimes we actually face that choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.807,
    "end": 1993.991,
    "text": "Do I do more research or do I start writing now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.692,
    "end": 1996.494,
    "text": "And both seem attractive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.574,
    "end": 2001.021,
    "text": "So both have the similar weight, as it were, in the decision making context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.76,
    "end": 2024.562,
    "text": " yeah this is a uh articulation but not a waiting and there are policies and niches where maybe a given policy has high pragmatic and informational value so just it it really if you sketched out the generative model of doing research as some have and when to start or stop or move to a different resource",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2026.398,
    "end": 2033.666,
    "text": " Then this articulation would help at least kind of reckon with that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2033.767,
    "end": 2046.101,
    "text": "And then if it turns out that there's two policies that have a similar expected free energy, because one of them is really informative and one is pragmatic, then they would have similar posterior probabilities of being selected.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2046.701,
    "end": 2049.765,
    "text": "And that agent would potentially switch between those policies.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2051.667,
    "end": 2053.249,
    "text": "Pablo, then Susan.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2055.187,
    "end": 2066.881,
    "text": " Yes, this chapter, it makes me think about that we live in an entropy universe, but active agents are like entropy fighters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2067.682,
    "end": 2069.965,
    "text": "That's kind of right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2074.03,
    "end": 2081.92,
    "text": "Yeah, anything that's being repeatedly measured at least has to weather the storm, even if it's just an inert particle.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2082.237,
    "end": 2100.702,
    "text": " and then things that are active seem to go even beyond that like they reconstitute themselves and they persist even more than you'd expect for just something and being inert and weathering the storm what does that make you think about",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2101.475,
    "end": 2102.797,
    "text": " It's fun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2102.817,
    "end": 2111.449,
    "text": "It's like we are like, as far as we know, not many of these agents on the universe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2111.469,
    "end": 2118.419,
    "text": "So I wonder why it's like entropy all around us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2118.66,
    "end": 2125.089,
    "text": "And we are trying to like, we want it or not, fight against it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2125.75,
    "end": 2128.293,
    "text": "And it's cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2128.313,
    "end": 2128.714,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2129.622,
    "end": 2134.091,
    "text": " Yeah, that's classical high road.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2134.893,
    "end": 2140.223,
    "text": "That's kind of the mystery of persistence or of just perpetuation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2141.245,
    "end": 2148.981,
    "text": "And then why active inference is in the middle is we have a first principles persistence imperative.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2149.349,
    "end": 2177.938,
    "text": " with an implementable process theory coming from the low road and that's why the active inference generative model can be used to address those kinds of situations of persistence and it also has a tractable way otherwise it's just a description of the problem of persistence without a way to generate any kind of agent to actually do it um susan then christoph",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2180.551,
    "end": 2208.448,
    "text": " um see I like the distinction between um the nature of identity and nature of inference and that kind of brings me to how to understand and yeah the probability versus possibility kind of comes into my frame of reference because if I'm looking at the high road through the nature of identity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.137,
    "end": 2217.447,
    "text": " then that's going to lead to my preferences and my perceived affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2218.748,
    "end": 2223.434,
    "text": "So how does that change my Markov blanket?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.279,
    "end": 2229.321,
    "text": "How does what change it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.223,
    "end": 2238.992,
    "text": "If I'm moving between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.428,
    "end": 2249.759,
    "text": " Barbara Kirby- You know what i'm what i'm interpreting here is that, if I look at the high road as the nature of identity, then that for me has more to do with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2250.54,
    "end": 2264.035,
    "text": "Barbara Kirby- The area of possibility, or you know going back to a statement made I think last week in terms of action starts with an imagined imaginative process or predictive representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.28,
    "end": 2277.703,
    "text": " so that's going to that's going to drive my perceived affordances right yes what what what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2278.966,
    "end": 2282.589,
    "text": " There's a lot of different ways to say it for something that's simpler or more sophisticated.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2282.609,
    "end": 2284.651,
    "text": "But yeah, what actions can I select from?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2284.751,
    "end": 2293.919,
    "text": "What are my affordances such that I'm in the business of finding out what I am or confirming what I am?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2293.959,
    "end": 2300.646,
    "text": "And confirming what I am might be I'm the kind that goes and finds out new information.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2301.026,
    "end": 2302.727,
    "text": "That's the information foraging piece.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2303.448,
    "end": 2308.973,
    "text": "So just self-evidencing doesn't mean just navel gazing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2308.953,
    "end": 2338.082,
    "text": " or just um shutting down sensory input as people for years have kind of repeatedly raised so evidencing can be broader than just seeking confirmation of sensory evidence in a short term right and and so how would that would that not you know let's say that I recognize that you know hey I can be this way too so I basically um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2338.67,
    "end": 2364.778,
    "text": " invoked or updated my beliefs about what my affordances are would that not change my markov blanket expand it or am i not thinking again it's a little it's a little understated because a markup blanket in what sense i mean the sensory apparatus",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2365.366,
    "end": 2366.768,
    "text": " is not going to change.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2366.788,
    "end": 2369.651,
    "text": "So let's just say someone says, I'm not the kind of person who goes to parties.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2370.572,
    "end": 2372.854,
    "text": "If it were at a party, it wouldn't be me.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2373.715,
    "end": 2376.918,
    "text": "So that's the kind of identity and what something expects to be.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2377.799,
    "end": 2388.01,
    "text": "But then if someone has a different internal model says, I'm the kind of person that sometimes is at a party and sometimes isn't, then they could self-evidence in either of those settings.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2388.651,
    "end": 2393.196,
    "text": "But in either of those settings, they would still have visual input and hands.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2393.75,
    "end": 2400.998,
    "text": " So their markup blanket wouldn't change or a generative modeler modeling the person going to the party or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2402.119,
    "end": 2408.246,
    "text": "It doesn't need to entail a difference, but you could make a situation where the markup blanket does change.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2408.266,
    "end": 2423.402,
    "text": "Like I'm the kind of person who does or doesn't use neural link or does or doesn't take on this extra sensory technology because that is a more structural modification of the interface of the agent with the niche.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2423.838,
    "end": 2446.825,
    "text": " and that has a more vital relationship with the blanket and with the objects um sense of self perhaps so can I ask one more question does that so does that lead me to the boundary of my Markov blanket if I'm updating my affordances",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2448.847,
    "end": 2477.655,
    "text": " get you out the space and see what it looks like and sketch what is the about what is the bound and what's what's inside and what's outside because Markov blankets very general any base graph is going to have Markov blankets aplenty so that it can be helpful to clarify are we talking about like what kinds of spaces okay um that's the modeling part right yeah yeah go for",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2479.373,
    "end": 2498.741,
    "text": " Hey, Susan, so your question about the nature of identity and how can the Markov blanket of an agent shift around reminds me of some ideas that I was thinking about recently.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2499.582,
    "end": 2506.832,
    "text": "And this is maybe a bit more of a psychological and philosophical perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2507.656,
    "end": 2521.93,
    "text": " but thinking about maybe two kinds of organisms, let's say biological cells and then also people, humans that are in a relationship.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2522.271,
    "end": 2531.72,
    "text": "So the question is about what do we consider at any given moment to be me?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2532.401,
    "end": 2534.743,
    "text": "What is it that I...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2534.909,
    "end": 2537.793,
    "text": " say or have in my mind, this is what counts as me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2538.574,
    "end": 2562.267,
    "text": "And I think you can notice if you get into a very serious relationship, romantic relationship, or even having a child, I imagine, and I think I experienced this as well, that boundary between what I think of as myself begins to extend and begins to wrap around",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2562.77,
    "end": 2564.012,
    "text": " the other person.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2564.352,
    "end": 2580.697,
    "text": "And to the extent that we begin to have the same shared goals and beliefs, that extension of the boundary becomes more well-defined and more robust.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2580.717,
    "end": 2590.431,
    "text": "And the other way that I was thinking about this is in cells, in biological cells, how it seems to be that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2591.356,
    "end": 2592.958,
    "text": " for example, in cancer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2593.138,
    "end": 2618.671,
    "text": "Cancer cells are cells that have separated from the parallel organism, have become alienated in a sense, and no longer share the same goal or know what's the same, have the same instructions as the rest of the cells in the organism have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2618.691,
    "end": 2620.333,
    "text": "So they see the rest of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2620.735,
    "end": 2622.978,
    "text": " their environments as external environments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2623.559,
    "end": 2638.863,
    "text": "Whereas usually yourselves, even though each of them are individuals, they kind of have this synergy because they're all integrated and have the same sort of objective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2639.684,
    "end": 2647.857,
    "text": "But when a cancer cell gets alienated and it starts to have the same",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2648.427,
    "end": 2668.318,
    "text": " intentions and goals as a cell that's what is not part of an organism, just kind of an individual cell up in the wild would have, which is to find as much nutrition as possible and then start to spread.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2669.24,
    "end": 2675.329,
    "text": "And then that's where you have excessive growth of the cell.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2675.545,
    "end": 2705.417,
    "text": " so the connection I make there is how biological cells also have need to be able to figure out this process of redefining what do they think of how do they think of as themselves and they manage to do that and that's how you end up having a multicellular organism that is composed of many",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2706.022,
    "end": 2726.427,
    "text": " uh individual cells that would otherwise have their own um notion of of what they have to do in order to persist as individuals thank you yes self-organization is described in the kind of kernel",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2728.313,
    "end": 2738.745,
    "text": " here but then there could be composite self-organization with multiple layers so thank you um christoph and andrew quickly and then we'll look at it try to look at a few questions before we end",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2741.324,
    "end": 2743.608,
    "text": " I just want to make two very quick points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2743.728,
    "end": 2752.484,
    "text": "One, Susan, when you were talking about this notion of identity, just somehow the serenity prayer popped into my head.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.824,
    "end": 2758.995,
    "text": "God grant me the serenity to accept the things I cannot change, the courage to change the things I can, and the wisdom to know the difference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2758.975,
    "end": 2761.899,
    "text": " So what exactly constitutes your identity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2761.979,
    "end": 2763.061,
    "text": "It's a very good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2763.201,
    "end": 2766.626,
    "text": "And if you start looking for it, the answer is really not obvious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2767.267,
    "end": 2774.818,
    "text": "And in my view, we draw these Markov blankets around parts of the graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2774.838,
    "end": 2781.388,
    "text": "And you say there was some statistical independence of certain variables from certain variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2781.368,
    "end": 2788.22,
    "text": " And that's a useful distinction, but it's not actually, it's a kind of, in some sense, a virtual distinction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2788.981,
    "end": 2800.36,
    "text": "Basically, Markov blanket is a perspective, and that perspective can simply be changed from one perspective, because there's always some kind of hierarchical nested structure, and we can adjust it as needed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2800.42,
    "end": 2802.043,
    "text": "So the notion of identity,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2802.023,
    "end": 2824.082,
    "text": " is is very fluid and a lot of traditions um you know like like Buddhist traditions for instance um teach you how to look for your identity and you will find that there is no such thing as identity that boundary cannot be really drawn um and you know the the goal of of a lot of these practices to simply lead you to the realization that we're all interconnected",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2824.062,
    "end": 2825.844,
    "text": " at some incredibly deep level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2825.904,
    "end": 2830.751,
    "text": "And if you're trying to draw the boundary, you're always going to find some kind of way in which the boundary doesn't hold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.472,
    "end": 2833.294,
    "text": "But it's still nevertheless kind of useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2833.414,
    "end": 2844.028,
    "text": "And to go back to the previous point about this information gain versus epistemic value, the way I started seeing free energy principle is that we start with Bayes' theorem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2844.008,
    "end": 2849.999,
    "text": " And which is kind of like this kind of non-computable in the general case piece of mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2850.079,
    "end": 2863.143,
    "text": "And then we use it to almost pretty much, not almost, but tautologically carve up that belief updating in all kinds of different ways to give us a different perspective on what's going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2863.603,
    "end": 2866.168,
    "text": "But it's not an implementation approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2866.672,
    "end": 2891.278,
    "text": " It's a certain kind of myopic view for the lens of probability distributions and base theorem and so on and so forth, kind of geometric view on the world and how it's actually implemented, whether there is some kind of parameter that weighs information looking for epistemic value versus",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.258,
    "end": 2917.013,
    "text": " um the other term um that's that that's still you know that's kind of hidden by the by the formalism and that's necessarily hidden because the formalism kind of comes up from basically making this distinction up out of nowhere right we just we just take the posterior expand it through base theorem carve it up however we like it group some terms and say like well this is this and this is that and the distinction is in some sense",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2916.993,
    "end": 2934.867,
    "text": " imposed on something where that that doesn't necessarily uh you know um it's it's not inherent in the object it's it's it's an imposed point of view okay thank you yes Andrew and Dr Einstein very quickly and then let's see if we can go to a question",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2938.053,
    "end": 2943.421,
    "text": " Yeah, I just have a couple thoughts on some previous points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.382,
    "end": 2953.075,
    "text": "One, I forget who it was, but the comment about entropy and us kind of being entropy fighting machines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.656,
    "end": 2966.355,
    "text": "I just had a thought that we've probably all been embedded in this milieu that treats the second law of thermodynamics as like universally inevitable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.875,
    "end": 2981.837,
    "text": " And I think there's some good evidence due to like cosmic expansion and some arguments that contemporary thinkers are making that actually order might be more likely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.877,
    "end": 2987.145,
    "text": "The second law only applies when you have a closed container.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.665,
    "end": 3014.955,
    "text": " uh that you'll reach kind of heat death and most of our evidence in terms of the universe is we are in open systems all the way around and closed containers are actually the exception not the rule um i'm going to post a couple links to books that sort of talk about that uh what i i first found it from julian barbeau um who's kind of a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.982,
    "end": 3018.164,
    "text": " oddball physicist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.625,
    "end": 3024.01,
    "text": "He's got a book called The Janus Point that he talks about the relevance for that in terms of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.03,
    "end": 3035.421,
    "text": "And also, I believe Alicia Girarro has been, her name pops up in the CODA, our textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.542,
    "end": 3038.083,
    "text": "The context changes everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.744,
    "end": 3045.33,
    "text": "And she's got some interesting arguments that kind of touch on that and also touch on the whole Markov blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.783,
    "end": 3074.777,
    "text": " uh dialogue we're having here um I believe you can get her book for free it's unlocked I'm currently looking at it and highly recommend it so far um and finally the whole um related to this entropy question um there's some uh debate going around on a new theory called assembly theory um that some people think is just utter balderdash but it's got a new interesting take on uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.314,
    "end": 3094.318,
    "text": " the the nature of order and worth taking a look at um so yeah and oh one final thing Markov blankets um I I believe in your Markov blanket changes if uh you've ever used a hammer before and um you just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.838,
    "end": 3095.72,
    "text": " hammer and a nail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.323,
    "end": 3110.251,
    "text": "The change between where the blanket ends and begins and your body, there's evidence that your mind incorporates a tool from a car to a hammer to anything in between.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.431,
    "end": 3114.079,
    "text": "And spectacles will change your Markov blanket as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3116.438,
    "end": 3116.899,
    "text": " Thank you.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3117.5,
    "end": 3118.541,
    "text": "Yes, indeed.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3118.681,
    "end": 3130.84,
    "text": "That's why there's so much discussion of the extended embedded cognitive processes, because we can both hold up what the thing is and understand how tools and so on change it cognitively.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3131.06,
    "end": 3134.285,
    "text": "Dr. Einstein, quickly, and then we'll look at one question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3134.706,
    "end": 3135.627,
    "text": "Yeah, just real quickly.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3135.647,
    "end": 3142.918,
    "text": "I posted a link in the chat to a conversation in his Hippolyto head on converging dialogues.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3143.489,
    "end": 3162.75,
    "text": " And just on that notion of embodiment, she does a really thorough overview of some of the philosophical underpinnings of the High Road as it relates to embodiment in the work of Merleau-Ponty and Heidegger, Andy Clark.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3162.77,
    "end": 3168.277,
    "text": "So I really, really recommend it, even for non-philosophers.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3168.637,
    "end": 3172.281,
    "text": "It's very accessible.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3173.746,
    "end": 3188.287,
    "text": " And she really touches on that, the need of, or yeah, the relationship of the body and the environment, you know, as an agent for gathering information and model updating, respect to Andy Clark's work.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3188.648,
    "end": 3190.09,
    "text": "So check that out, guys.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3190.791,
    "end": 3191.071,
    "text": "Cool.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3194.476,
    "end": 3203.449,
    "text": "In our last minutes, first, if you feel like you have more to say, or you have more questions than answers, more answers than questions,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3204.914,
    "end": 3208.938,
    "text": " I so heavily and hardly encourage you to modify the coda.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3209.619,
    "end": 3211.841,
    "text": "Please, please add the links there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3211.881,
    "end": 3215.284,
    "text": "That's how we move together as a niche.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3215.724,
    "end": 3221.35,
    "text": "If you add questions, if you add links, if you improve links, you will learn, you will help others learn.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3221.55,
    "end": 3223.672,
    "text": "It's really super important and special.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3226.115,
    "end": 3234.803,
    "text": "There's a ton of questions, of course, that we didn't get to, but just even highlighting some of the questions in red,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3235.188,
    "end": 3238.495,
    "text": " These are like epic things that people have asked.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3238.535,
    "end": 3243.244,
    "text": "And again, there's a lot of improvable discourse in a lot of these topics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3243.284,
    "end": 3249.957,
    "text": "So I know it's a lot to look at and discuss.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3250.645,
    "end": 3255.731,
    "text": " We're like all just kind of forging through this massive niche, but no one's going to read all of this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3256.592,
    "end": 3261.499,
    "text": "So we're always just kind of like finding and leaving things forward from each other.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3261.539,
    "end": 3263.782,
    "text": "That's part of the fun.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3264.022,
    "end": 3266.565,
    "text": "Let's just look ahead to what's going to happen.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3268.508,
    "end": 3272.873,
    "text": "This was our second discussion on chapter three.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3274.574,
    "end": 3277.2,
    "text": " We're going to be heading next into chapter four.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3278.062,
    "end": 3282.572,
    "text": "Chapter four is where we get to the generative models of active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3284.396,
    "end": 3286.441,
    "text": "Chapter one, just background.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3286.962,
    "end": 3290.49,
    "text": "Two and three were like the roads into town.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3290.926,
    "end": 3292.989,
    "text": " Chapter four is the town.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3293.59,
    "end": 3295.893,
    "text": "This is active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3295.913,
    "end": 3302.702,
    "text": "Chapter five is going to discuss what's happening in that town in the mammalian neuroscience district.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3303.463,
    "end": 3311.854,
    "text": "Just focusing on a few human or mammal type neuroscience cases where generative models have been deployed.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3312.037,
    "end": 3339.58,
    "text": " that'll take us basically to the end of the year um people can add their different ideas and and so on but that's kind of what the first half of the book the epistemic half of the book ends up looking like and then the second half is bringing closer to the modeling and the hands-on and so on with the recipe starting in chapter six but um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3339.56,
    "end": 3361.45,
    "text": " yeah it's quite a journey and the low road and the high road definitely invoke very different regimes of attention chapter four um is going to be longer and with some more analytical details than the previous chapters so",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3363.353,
    "end": 3373.989,
    "text": " I encourage people to read it lightly, which may be slowly, but there are some formalisms and so on that are not vital for understanding.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3374.51,
    "end": 3378.956,
    "text": "In fact, they even suggest like you can like skip over this chapter, which is very funny that they say that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3379.557,
    "end": 3382.482,
    "text": "But we will return next week.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3383.483,
    "end": 3387.129,
    "text": "I'll be really looking forward to the notes and the questions that people have.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3387.509,
    "end": 3388.971,
    "text": "So thank you, everybody.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3389.512,
    "end": 3390.053,
    "text": "See you next time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3391.602,
    "end": 3392.542,
    "text": " Thanks a lot, guys.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3392.664,
    "end": 3393.951,
    "text": "Happy Halloween.",
    "speaker": "SPEAKER_08"
  }
]