[
  {
    "start": 1.561,
    "end": 3.562,
    "text": " Hello, thanks for all joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.302,
    "end": 12.985,
    "text": "It's Actin textbook group, cohort one, meeting 22, chapter nine on October 28th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.946,
    "end": 17.226,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.166,
    "end": 22.388,
    "text": "We're in the second discussion on chapter nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.249,
    "end": 28.79,
    "text": "Model-based data analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.816,
    "end": 52.257,
    "text": " anyone like to add anything they want or mention how the generative model discussion from the previous one hour relates to model-based data analysis how does chapter four relate to chapter nine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.472,
    "end": 70.233,
    "text": " What does chapter 9 address?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.734,
    "end": 76.635,
    "text": "What do chapter 6 and 9 address that chapter 4 doesn't?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.099,
    "end": 96.623,
    "text": "I mean, 6 is about thinking about applying it in an incredibly kind of simplified",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 100.504,
    "end": 101.945,
    "text": " step-by-step kind of way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 103.966,
    "end": 126.936,
    "text": "And nine is very specifically about answering scientific questions with it and doing that with a sort of this Metabasian, it's like an almost nested sort of schema of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.863,
    "end": 147.858,
    "text": " so i mean that's the through line i guess but um i'm not sure more than that what to say that's really you know insightful thank you ali",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.714,
    "end": 166.529,
    "text": " Yeah, actually, I would compare it to a kind of learning how to solve problems in, I don't know, mathematics or physics or other areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.15,
    "end": 168.051,
    "text": "For example, in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.182,
    "end": 190.018,
    "text": " Chapter 4, we acquired some necessary knowledge or prerequisites about how to think about the phenomena or the problem we're dealing with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.638,
    "end": 205.969,
    "text": " Chapter 6 outlines a roadmap about how exactly we should proceed to solve that problem in a formulaic way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.276,
    "end": 224.583,
    "text": " And chapter 9, actually, in chapter 9, we get our hands dirty and try to solve some of the actual or empirical problems with the tools or techniques we learned in chapter 4 and 6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.904,
    "end": 232.207,
    "text": "So in this case, I somehow think of chapter 9 as a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.167,
    "end": 246.795,
    "text": " kind of case study, well, kind of case studies or a kind of solved problem section of this textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 247.515,
    "end": 255.12,
    "text": "And yeah, I don't know how much that captures their nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.641,
    "end": 257.201,
    "text": "That's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.942,
    "end": 258.162,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.782,
    "end": 259.783,
    "text": "Great thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.783,
    "end": 261.504,
    "text": "I totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.407,
    "end": 290.299,
    "text": " let's look at the table of contents chapter one special overview chapter mirror symmetry same but different with ten so now in the middle eight chapters two chapters on the low road and the high road",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.411,
    "end": 308.083,
    "text": " helping two different approaches, which can be developed like in a lot more detail to approach active inference from two fascinating and non-controversial starting points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.284,
    "end": 319.831,
    "text": "Bayesian inference from the low road, free energy principle, and the repeated measurement persistence imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.932,
    "end": 329.335,
    "text": " Chapter four is the first chapter on active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.876,
    "end": 336.92,
    "text": "Active inference is about the generative models that are being specified and how they're being computed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.982,
    "end": 351.59,
    "text": "After just one chapter on active inference, it goes to the area where the most research and modeling has been done in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.901,
    "end": 356.043,
    "text": " which is computational mammalian neuroanatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.744,
    "end": 363.767,
    "text": "One chapter on ACT-INF, one chapter on the primary domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.429,
    "end": 367.349,
    "text": "First half of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.732,
    "end": 372.552,
    "text": "Second half of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.633,
    "end": 378.616,
    "text": "This is the part where you're going to be in parallel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.943,
    "end": 392.771,
    "text": " perhaps on your first, but perhaps not on your first reading, you're going to be doing, playing through these applied aspects of modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.132,
    "end": 403.738,
    "text": "First is the recipe for designing active inference models in chapter six, as both of you have very nicely said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.246,
    "end": 433.492,
    "text": " then the um figure 4.3 dialectic discrete continuous time is revisited in two chapters because it probably it's one key difference it's a minimum of two so it prevents like any like oh well it has to be a pmdp it's like well obviously not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.325,
    "end": 456.48,
    "text": " So it keeps the space of generative modeling open, and it allows for discussion of the very interesting topic of hybrid active inference nested models with continuous actuators, for example, but discrete decision-making apparatus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.276,
    "end": 489.547,
    "text": " so it just is like wanting to cover these two key types of models in a bit more detail than was addressed in chapter four but this was the first possible moment to address it after 4.3 just kidding maybe about then chapter nine or yeah where we are now which is just okay you've built your pure discrete time pure continuous time or hybrid generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.99,
    "end": 494.954,
    "text": " If it's a toy model, you can just generate data and just do whatever you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.176,
    "end": 510.371,
    "text": "Or you might have data from sensors or real world or however, that's in the data format that your generative model expected to receive, which was part of your design process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.789,
    "end": 515.371,
    "text": " You could have determined what structure literally the data is going to be in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.292,
    "end": 527.959,
    "text": "Is it going to be like, yes, data can be reshaped, but just broadly, is it like 256 sensors in a row of one, or is it like eight by eight?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.0,
    "end": 530.501,
    "text": "Just those kinds of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.722,
    "end": 539.307,
    "text": "So that when the data start coming in for the experiment, whether you generated the data from the generative model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.396,
    "end": 544.158,
    "text": " or whether you're using it in a purely recognition model capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.219,
    "end": 556.565,
    "text": "On real-world data, what does it look like to do statistical modeling with these statistical models that we've been using?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.187,
    "end": 561.428,
    "text": "And then chapter 10 is a review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.809,
    "end": 568.292,
    "text": "It restates what each chapter does, provides some further thoughts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.493,
    "end": 598.028,
    "text": " and just summarizes the unifying capacity of active inference modeling then there are the appendices ali and also one uh in my opinion very interesting section of chapter nine is uh the section on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.332,
    "end": 620.69,
    "text": " Models of False Inference section 9.7 in which there's an interesting definition of the disorders I mean the mental disorders and how we can actually computationally model those different disorders",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.77,
    "end": 631.879,
    "text": " Sorry, it says that here the disorder does not necessarily imply that the inferential mechanism is flawed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.56,
    "end": 639.147,
    "text": "In most of the studies, the inferential mechanism operates normally, but based on a flawed generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 639.687,
    "end": 641.209,
    "text": "So that's basically...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 642.59,
    "end": 659.068,
    "text": " what we had learned about how we can somehow update our beliefs or correct our perceptions based on either refining our generative model or modifying our generative model or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.29,
    "end": 670.677,
    "text": " Somehow, sometimes we can just well act upon those errors and try to reduce our uncertainties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.278,
    "end": 679.484,
    "text": "But in this case, it's a very interesting point on the case of computational pathologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.485,
    "end": 689.028,
    "text": " Because oftentimes people ask, well, what does Active Inference actually explain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.108,
    "end": 698.391,
    "text": "So I think this is a very good example of its very meaningful and significant application",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.031,
    "end": 701.832,
    "text": " I mean, in any sense of the word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.453,
    "end": 726.446,
    "text": "So if we can somehow computationally model these kinds of disorders, we'll most probably have a much better understanding of its origin and the way to probable treatments of those disorders and many",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.026,
    "end": 746.536,
    "text": " other applications can come to comes to mind but yeah i think this part of the chapter nine is something that was not addressed quite explicitly in the previous chapters and i in my opinion is the most interesting part of this one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 749.397,
    "end": 775.045,
    "text": " great awesome yeah it reminds me of the table in chapter four or sorry chapter five with the neurotransmitters so that was they were still at the organ systems level in chapter five but five is very much related to nine i guess in that sense as well because it's like it's like here's what dopamine does here's what acetylcholine does just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.232,
    "end": 779.294,
    "text": " at the computational model level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.134,
    "end": 796.825,
    "text": "And then here it's like that computational model was fit like between the phenomena, like attention or policy precision or however, phenomena to a molecule in chapter five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.645,
    "end": 805.13,
    "text": "Here, the phenomena is being connected to a real human clinical application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.079,
    "end": 822.201,
    "text": " So it's not that we're saying, or anyone is saying, or anything like that, that the molecule is being directly linked to this paper, even if it's mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.462,
    "end": 833.463,
    "text": "The direct linkage approach is people in group X have more molecule, have less molecule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.144,
    "end": 836.864,
    "text": "And even the neuroimaging approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.482,
    "end": 866.519,
    "text": " be seen as a variant of that which is people in group x have more brain activation pattern in computational pathology those kinds of biochemical measurements and neuroimaging measurements can and they are used however this type of computational modeling is referring to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.114,
    "end": 891.535,
    "text": " parametric modeling where the parameters are related to the pathology so it's not an a priori classification of those with and without and then descriptive statistics showing that a biochemical or a brain imaging pattern are differentially expressed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.171,
    "end": 894.832,
    "text": " That's descriptive statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.692,
    "end": 897.413,
    "text": "It's not computational pathology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.913,
    "end": 900.334,
    "text": "It might be precision pathology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.295,
    "end": 910.778,
    "text": "But it could still be precision or big data or however, with just like purely doing data summaries, doing a random forest model to diagnose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.199,
    "end": 920.162,
    "text": "These models have a cognitive structural hypothesis about the nature of these phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.165,
    "end": 923.686,
    "text": " like the ocular motor syndromes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.207,
    "end": 926.229,
    "text": "Again, it's not just people with the diagnosis and without.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.989,
    "end": 932.414,
    "text": "It's a neurocognitive model of eye behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.136,
    "end": 941.282,
    "text": "And then explanations can be made from clinical data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.144,
    "end": 953.731,
    "text": " By rendering various aspects of the generative model conditionally independent of others, ocular motor syndromes such as intranuclear optopolegias may be induced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.273,
    "end": 966.56,
    "text": "So if you just were diagnosing these as different conditions, maybe they have similar etiologies, how the condition arises, maybe they have different, maybe they have multiple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.381,
    "end": 970.303,
    "text": "But these two conditions...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.321,
    "end": 1000.735,
    "text": " computationally can be understood as parametric modulating in a computational model of ocular motor behavior this isn't people with internuclear opto have higher glucose or lower glucose or this brain region or this aspect of them those are all absolutely valid approaches",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.506,
    "end": 1030.42,
    "text": " that's like scientific methodological pluralism which is like it's okay that people want to do different approaches everybody's contributing to a common people who care about this and are creating high quality reproducible data their data will always be useful and their perspectives are valid and we don't want to have um a discourse space on inter-nuclear optimal Asia that's um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.759,
    "end": 1056.822,
    "text": " know like uh saying that one model is like simply the only correct model this paper makes a positive contribution and points to some new ways of thinking about various pathologies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.123,
    "end": 1087.672,
    "text": " and thinking beyond the ways that they've been worked on before where one can imagine that before 2000 and so on you had what health records and you have some double blind experiments and so you might do a meta-analysis to find correlations with features of people and all of those things that we've been describing but it was not plausible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.649,
    "end": 1095.951,
    "text": " to actually implement computational models of these phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.672,
    "end": 1102.494,
    "text": "Now, interestingly, that's something that can be worked on by researchers directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.035,
    "end": 1113.779,
    "text": "And then somebody can, a doctor could download ocularmotorsyndromes.programming.com",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.618,
    "end": 1144.38,
    "text": " whatever it is but this can be developed in a pure research context and the generative model is like the interface for the kind of information that might not be available to the person developing the generative model because it relates to a lot of problems and issues about data availability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.997,
    "end": 1177.177,
    "text": " one's kind of just side note but that's all but really thanks for raising that point that i just wanted to emphasize and unpack which is that these this table which is taking up two and a half pages of a pretty short book is describing these are like the cases that can be brought up which they're providing in a helpful table for what active inference describes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.294,
    "end": 1189.844,
    "text": " So if the principle of least action, gauge theory, et cetera, sophistication does not interest one, these are more pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.025,
    "end": 1199.393,
    "text": "Now that will probably move the goalpost to show me where the computational modeling helped somebody with delusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.616,
    "end": 1204.797,
    "text": "And that's a fine place to want to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.725,
    "end": 1216.431,
    "text": " but it's also a standard and an approach that it's not related to the substance of the theoretical development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1223.675,
    "end": 1231.641,
    "text": "I mean, I think you could probably, the response to that question might be something like the difficulty of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1234.218,
    "end": 1263.34,
    "text": " implementing that model in a way that provides you know actionable real-time you know affordances to address the aberrant priors in a way that's causally you know going it's going to actually affect that uh system is we need",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1264.983,
    "end": 1293.741,
    "text": " you know either more compute or a particular kind of algorithmic medicine that doesn't exist yet or etc like but that's not a problem with the particular approach it's just an insufficiency of ability to enact it i guess um but i wanted to ask a question um about specifically this uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1295.126,
    "end": 1297.367,
    "text": " aberrant prior beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1297.607,
    "end": 1300.669,
    "text": "It says, ultimately, the pathology is a consequence of aberrant prior beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1301.229,
    "end": 1302.41,
    "text": "It's not a generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1302.43,
    "end": 1303.33,
    "text": "It's aberrant prior beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1303.711,
    "end": 1321.16,
    "text": "Is that... I think this is, like, Ellie's point is, and everything that you just went through is correct, that this is kind of where the rubber really meets the road for its value in demonstrating or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1321.18,
    "end": 1321.5,
    "text": "But...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1324.127,
    "end": 1333.92,
    "text": " I'm wondering also, to me, that there's like an easy confusion thing there about beliefs and priors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1334.141,
    "end": 1337.826,
    "text": "And so, well, if they just believed the right thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1339.599,
    "end": 1344.703,
    "text": " then they wouldn't have these, you know, um, so that's not, that's not really what that means though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.743,
    "end": 1345.023,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.163,
    "end": 1364.817,
    "text": "So like, is another way of saying this, like in the ocular motor, uh, you know, disorder case, like a, you know, kind of, uh, neurobiological, like, you know, bias in, in some kinds of cells or whatever, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1364.897,
    "end": 1365.878,
    "text": "For that, that's like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1367.793,
    "end": 1371.395,
    "text": " you know, pathologically different than normal or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1372.176,
    "end": 1379.7,
    "text": "Like some, you know, receptor for a particular chemical or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1380.2,
    "end": 1393.588,
    "text": "Is that a kind of thing that the way of saying that differently that, you know, that particular case that is more commensurate with what they're actually saying there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1394.849,
    "end": 1396.87,
    "text": "Or like, not more commensurate, but just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.436,
    "end": 1427.832,
    "text": " not relying on jargon and or domain knowledge specific for what i mean by beliefs and priors is that or is that not right yeah well there's a lot there are you talking about the comparison of the terms beliefs and priors in relationship to the way people might",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.514,
    "end": 1454.447,
    "text": " naturally interpret such beliefs to be and they may indeed be people's beliefs about the world in the conversational sense like some beliefs are just your retinal states and those but other states of the world as if or really are your states on other things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.667,
    "end": 1484.377,
    "text": " right um yeah i mean i guess i'm asking if beliefs is um in some cases it is beliefs but uh it's also another way of stating if another way of stating that is like a like physical like a structural like systemic bias or one thing or another or whatever you know in that context is that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1489.514,
    "end": 1507.712,
    "text": " know the like physical or informational kind of non folk psychology is that commensurate with what they mean by beliefs there okay let's try to yeah ollie please first",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.76,
    "end": 1526.259,
    "text": " Sorry, I'm sorry, but you mean the statistical use of the word belief because in statistics and in folk psychology, as far as I know, this term is used in quite different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.819,
    "end": 1549.574,
    "text": " So I guess that what you're talking about is the statistical sense of the word belief, and if it maps onto the folk psychological sense of this term, or am I missing something here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.235,
    "end": 1553.016,
    "text": "Well, let's just take two steps back for a second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1553.897,
    "end": 1554.978,
    "text": "In the text, it says...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1558.015,
    "end": 1584.53,
    "text": " at the bottom of page 185 here the at the top of that yeah uh it says um the infertile uh mechanism operates normally but based on a flawed generative model this means that ultimately pathology is a consequence of aberrant prior beliefs yeah and i'm and i'm asking um a kind of just to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1585.948,
    "end": 1609.413,
    "text": " explicate different whatever uh right there in in the context of psychological disorders which is not necessarily pathology but i'm just you know if you tell somebody oh yeah it helps with uh it was the impetus or whatever for this whole thing was to think about um yeah like specifically like schizophrenia and other you know but that's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1611.095,
    "end": 1632.518,
    "text": " immediately kind of puts it in that category or that context of definitions and so uh just to um kind of you know nuance the term their beliefs a little bit um yeah is it commensurate with the rest of the text",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1634.756,
    "end": 1656.497,
    "text": " to say like in the case of this you know like specifically of this oculomotor disorder category like you're saying beliefs in the retina or something like that that is like cones like being sensitive to something they they well it's just what they are sensitive to and in this particular person",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1657.93,
    "end": 1684.135,
    "text": " know they're just sensitive to or whatever the relevant you know structure is there but it's you know sensitive to to something right and that's its belief you know in some sense um i'm not looking for yeah yeah what's the statistical definition or anything like that but just is that is that completely off track or is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1685.652,
    "end": 1687.917,
    "text": " I have a thought, but Ali, if you wanna make a response, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.77,
    "end": 1711.363,
    "text": " Yeah, I think that this term belief and its different meanings and different contexts actually sort of bleed into each other and there cannot possibly be separated cleanly from each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.423,
    "end": 1716.846,
    "text": "So in this particular case, I believe that the word belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.489,
    "end": 1743.57,
    "text": " Partly is this folk psychological sense of the word and partly it's based on the kind of philosophical slash epistemological sense of this word because especially in epistemology when philosophers talk about belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.29,
    "end": 1749.615,
    "text": " usually they don't mean just the folk psychological sense of this term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.075,
    "end": 1755.721,
    "text": "Although it relates to that concept, but it's much more nuanced than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.821,
    "end": 1764.549,
    "text": "So in the case of oculomotor pathology, well, I believe that the word belief somehow...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.489,
    "end": 1781.082,
    "text": " can be interpreted in a little more abstract philosophical sense or epistemological sense of this word than our folk psychological sense of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.724,
    "end": 1792.832,
    "text": "But again, I think it also has some overlappings with the folk psychological sense of it as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.055,
    "end": 1823.704,
    "text": " great thought just to kind of restate that then say what i was planning to before so here it's situational um where people talk commonly about uh don't talk about beliefs like the eye like where it believes it should be looking um people don't talk about that but there might be another cognitive model that does align very well with an expressed felt cognitive belief",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.83,
    "end": 1853.831,
    "text": " and everything in between and bundles that are mixed like people who believe that they're accurate on a task but actually are low accuracy so it's going to be very model specific i think how it maps to different people's understanding but what i was uh that was what ali's response kind of made me think about and that's why i didn't choose an example like delusions to focus on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.83,
    "end": 1862.435,
    "text": " Because that is related to a felt or experienced or reported phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.497,
    "end": 1884.171,
    "text": "Okay, so beliefs and priors and this question of disorders of inference, which as Brock mentioned, was like part of the early impetus in relating to studying, for example, schizophrenia and Friston's earlier and continued work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.362,
    "end": 1904.306,
    "text": " Maybe there's a part I'm missing and maybe it's not the right context or way, but I think first we can narrowly interpret what they've used to mean disorder and then have a more broad perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.366,
    "end": 1912.669,
    "text": "So I read this does not necessarily imply the inferential mechanisms flawed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.249,
    "end": 1916.85,
    "text": "Like the CPU has the right number of cycles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.41,
    "end": 1920.251,
    "text": " The machinery are not flawed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.311,
    "end": 1924.493,
    "text": "The car is operating at normal burning temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.494,
    "end": 1943.862,
    "text": "Given its generative model as specified, hashtag chapter four, it is doing appropriate variational message passing, belief propagation, approximate Bayesian computation, Bayesian brain, however you want to see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.216,
    "end": 1953.758,
    "text": " Given what this person has experienced and their parameterization, it's not the case that they're making a fallacious estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.119,
    "end": 1960.84,
    "text": "Now that's sort of, in their situation where it's like, yeah, okay, but you're going to say that for whatever they do do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.66,
    "end": 1964.741,
    "text": "But it's like, that's kind of that tautology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.341,
    "end": 1970.442,
    "text": "It's like, right, that's our best estimate of the system as it is, is just how it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.482,
    "end": 1989.769,
    "text": " In most of the studies reviewed in table 9.1, which is to say the pathologies that are identified in table 9.1, the inferential mechanism operates normally as per the previous meaning, but based upon a flawed generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.709,
    "end": 1992.35,
    "text": "And it's literally like, there's the rub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.851,
    "end": 1996.132,
    "text": "Aberrant prior beliefs is like what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.692,
    "end": 1998.673,
    "text": "And so that is where I would say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.171,
    "end": 2013.987,
    "text": " there's two ways to zoom out from that and contextualize that statement the first is aberrant prior beliefs are not intrinsically apparent whether they're subconsciously or consciously held",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.855,
    "end": 2024.741,
    "text": " The belief in itself is not aberrant, but there's the niche and especially just the human cultural when we're talking about these felt beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.702,
    "end": 2031.605,
    "text": "So in the niche, it's like there is ant colonies that were high foraging and low foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.866,
    "end": 2035.608,
    "text": "Those are not aberrances of foraging behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.988,
    "end": 2040.611,
    "text": "That's variation in foraging behavior with respect to variation in weather and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.79,
    "end": 2067.57,
    "text": " and there was probably decades where one was better than the other and that's why there's evolution so it's like what's the per okay so level one of aberrant is in a niche context and then especially for these like expressively human um experienced settings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.201,
    "end": 2090.704,
    "text": " that's where I think there's an opportunity again not saying that this paragraph is the right place in this textbook but that's where it's important to also bring in like the um like I'm not expert in this area but like Foucault social descriptions of um mental illness diagnosis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.353,
    "end": 2119.041,
    "text": " people are only crazy if the majority of people people are only crazy if the majority of people people are only crazy if the majority of people this book yeah which i've mentioned on this book yeah which i've mentioned on this book yeah which i've mentioned on live streams before if i could just live streams before if i could just live streams before if i could just describe why i bring it up and like how i describe why i bring it up and like how i describe why i bring it up and like how i think it's relevant to chapter nine think it's relevant to chapter nine think it's relevant to chapter nine is just like is just like is just like she's saying there's different methods she's saying there's different methods she's saying there's different methods and there's different theoretical and there's different theoretical and there's different theoretical interpretations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.566,
    "end": 2148.397,
    "text": " and it's very clear and it's very pluralist and though guided everybody will also i think see like deeper aspects too but just i studied with helen in stanford and she was just very like it was very interesting to see that coming from philosophy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.202,
    "end": 2153.903,
    "text": " because in the scientific domains, it's like not framed that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.104,
    "end": 2167.687,
    "text": "It's like, we could have a generative model for these conditions and scenarios that integrates different types of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.938,
    "end": 2172.279,
    "text": " in a situational way with a sparse model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.459,
    "end": 2174.899,
    "text": "And we could all work on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.639,
    "end": 2180.081,
    "text": "And then different people could have different data sets or different public or private data sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.142,
    "end": 2196.665,
    "text": "But that requires not just sort of like operational coordination and ontology driven design and other features, but it also requires",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.295,
    "end": 2224.691,
    "text": " basically personally held commitment to pluralism at least in practice because there's too many methods and methods are too last mile to dictate models of phenomena these are not measurements",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.298,
    "end": 2230.24,
    "text": " but they're generated alongside and with and from measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.122,
    "end": 2238.804,
    "text": "And so that's not descriptive statistics per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.545,
    "end": 2253.452,
    "text": "And that's a major difference in this, what you can do with the Taylor two densities approaches these situations differently",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.407,
    "end": 2266.53,
    "text": " than one might see in a health journal showing the population level factors associated with a disease.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.03,
    "end": 2270.311,
    "text": "This is a different kind of study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.871,
    "end": 2278.813,
    "text": "But it could be done in a population context, which has been done extensively in SPM and neuroimaging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.601,
    "end": 2292.709,
    "text": " So you can still bring in features of the people and understand how different features of people are quite literally associated with the diagnosis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.09,
    "end": 2302.717,
    "text": "And that is seen as a label on a neurocognitive model, a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.738,
    "end": 2305.219,
    "text": "Now what's the generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.8,
    "end": 2308.161,
    "text": "Chapter four, chapter six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.417,
    "end": 2316.943,
    "text": " And then it's like, okay, we're just going to say that all of the people's ocular motor circuitry are structurally the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.044,
    "end": 2321.967,
    "text": "And we're going to explore how the two groups differ in the parameter estimates of these different features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.288,
    "end": 2328.433,
    "text": "Or you could say, I'm studying a situation where this region has been severed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.451,
    "end": 2339.437,
    "text": " So the hypothesis I'm testing is actually whether this connectivity versus this connectivity is going to have this observable difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.259,
    "end": 2344.12,
    "text": "That's testing a structural hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.606,
    "end": 2361.056,
    "text": " you could test parametric hypotheses within a generative model and or structural hypotheses across but to kind of return to this point those are these two ways that the model can be quote in in their you know way aberrant or flawed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.182,
    "end": 2384.171,
    "text": " quite literally it could be a parametric estimate that's aberrant which as discussed does not mean intrinsically bad number 4.2 or 3 7.3 is not bad it's about its relationship within a niche and fitness context and like all of that so it could be a parametric uh aberrance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.921,
    "end": 2410.559,
    "text": " respect to a state estimator like an expectation on a variable variable or precision so that's the laplace approximation it's the hierarchical predictive processing approximation slash structure expectation variance mean variance mode variance center of the path width of the path",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.759,
    "end": 2416.54,
    "text": " Those are the Gaussian distribution takes two parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.96,
    "end": 2418.901,
    "text": "The plus approximation takes two parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.261,
    "end": 2426.623,
    "text": "Hierarchical message passing has these kinds of variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.223,
    "end": 2434.025,
    "text": "Or it can be structural differences, which is quite open-ended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.746,
    "end": 2438.426,
    "text": "How is this useful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.115,
    "end": 2444.036,
    "text": " An example is provided here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.457,
    "end": 2450.119,
    "text": "Potentially, for example, let's just say that there's people who do and do not have a certain situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.219,
    "end": 2454.44,
    "text": "Some moths go towards the light and some don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.701,
    "end": 2466.285,
    "text": "Is that because of differences in their behavior where the statistical variance gets loaded onto differences in behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.822,
    "end": 2478.457,
    "text": " their realized preference vector or their habit e so there could be a behavioral setup",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.577,
    "end": 2504.201,
    "text": " that would do you know the fibonacci pattern of variability just whatever it happened to be which is extensively described in spm how to time different behavioral stimuli some natural observational setting or controlled behavioral setting both of which have pros and cons both quote controlled conditions in the lab and natural observation they have pros and cons",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.165,
    "end": 2514.607,
    "text": " But the idea in model-based analysis is that those can be the observables, and you may or may not control the observations, but at least you know what they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2515.767,
    "end": 2530.47,
    "text": "And then you can explore whether differences in behavior end up being reflected in statistically differentiable parameter estimates, or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.957,
    "end": 2543.512,
    "text": " prior preference or for prior D or for the fixed form term E. Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.838,
    "end": 2562.915,
    "text": " And yes, for what it's worth, I also put a quote from this recent paper by Carl Friston from a couple of months ago, which is, by the way, is a great overview of this whole field of computation psychiatry through the lens of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.216,
    "end": 2590.403,
    "text": " active inference and here it provides a clear and explicit definition of the term belief used in this area so I thought that might be helpful here the kind of belief beliefs here are Bayesian beliefs and then it goes on to describe what Bayesian beliefs mean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.804,
    "end": 2600.787,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2601.888,
    "end": 2602.188,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2602.668,
    "end": 2606.11,
    "text": "That was super clarifying, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2608.292,
    "end": 2613.234,
    "text": "It makes a lot of sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.414,
    "end": 2618.077,
    "text": "And I have still a kind of maybe, I don't know if,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2620.262,
    "end": 2648.736,
    "text": " the answer was already given exactly or i'll just ask it a different slightly different way about um the the separation between the generative model and the priors here in this toy you know frog jumping example are are the aberrant priors the you know the frog apple distribution on that belief",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2650.136,
    "end": 2678.928,
    "text": " and the observation, the updating, all of that being the generative model is working as intended, but it's just that the priors were so out of whack that when the generative model kind of observes and steps through or whatever, that it's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2681.479,
    "end": 2688.144,
    "text": " You know, it just ends up in the wrong state and or is the likelihood model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2689.005,
    "end": 2695.931,
    "text": "It just I'm not sure, I guess, in this in the toy example there, how you could have how it would be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2695.951,
    "end": 2699.934,
    "text": "I guess the part that's missing there is the context, maybe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2700.034,
    "end": 2706.019,
    "text": "But yeah, like if I had a prior belief that was different than your prior belief, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.673,
    "end": 2714.859,
    "text": " we weren't, you know, we didn't have a disorder or whatever, I would imagine our priors wouldn't be the same, but they would still kind of converge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2718.381,
    "end": 2727.068,
    "text": "So I'm not sure how you get there without an outside prior belief or something about the environment that's totally wrong, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2727.308,
    "end": 2734.433,
    "text": "Or like, or, you know, some something else about the environment or the likelihood model is somehow really wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.795,
    "end": 2737.396,
    "text": " Yeah, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.456,
    "end": 2738.536,
    "text": "Great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.777,
    "end": 2740.178,
    "text": "Those are exactly the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.718,
    "end": 2740.958,
    "text": "Greetings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.978,
    "end": 2741.559,
    "text": "Welcome back, Holly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.24,
    "end": 2744.201,
    "text": "Those are exactly like the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.221,
    "end": 2746.763,
    "text": "Let me unpack that in the pathology example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.324,
    "end": 2759.033,
    "text": "So society expects us and or we actually die or have consequences with when it's a frog, you're not supposed to eat it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.454,
    "end": 2761.095,
    "text": "Apples are okay to eat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.74,
    "end": 2767.061,
    "text": " Now, if you turn down too many apples, you starve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.301,
    "end": 2770.402,
    "text": "If you eat too many frogs, you die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.182,
    "end": 2785.405,
    "text": "So you have to balance your type 1 and type 2 false positive and false negative error rates in this eat, do not eat, jump, does not jump observation setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.385,
    "end": 2792.907,
    "text": "Because these are idle classifiers here, but we can imagine these as more action-oriented classifiers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.951,
    "end": 2796.813,
    "text": " Apples are for eating, frogs are for throwing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.316,
    "end": 2817.829,
    "text": "Now, society and or the niche defines aberrant behavior as one that does not conform to expectations or to a thriving state in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.485,
    "end": 2824.048,
    "text": " while recognizing that all parameter values that are actually observed are at least there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.609,
    "end": 2832.714,
    "text": "Now that doesn't mean you want them to be there, they want them, but also then that's a belief an agent has about another system that also exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.896,
    "end": 2842.24,
    "text": "So there would be many ways to see that aberrant behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.621,
    "end": 2848.685,
    "text": "So if you, like speaking to the person who discards too many apples,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.424,
    "end": 2853.586,
    "text": " Maybe they believe that they have a strong prior on frogs, 0.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.568,
    "end": 2862.932,
    "text": "Or their likelihood, which is also a parametric belief, is different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.833,
    "end": 2866.214,
    "text": "They have a different action mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.815,
    "end": 2867.635,
    "text": "Now here's the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.675,
    "end": 2872.578,
    "text": "Now you put them in the lab and you have jumping and non-jumping frogs and apples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.56,
    "end": 2878.142,
    "text": "And then you can use those experimental techniques",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.154,
    "end": 2892.578,
    "text": " to, on a computational model, narrowly to determine, do they simply expect frogs to appear, but they know what frogs and apples do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.778,
    "end": 2903.541,
    "text": "Or do they have an appropriate belief about the likelihood a priori of frogs and apples,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.977,
    "end": 2907.919,
    "text": " but they have an incorrect action mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.939,
    "end": 2911.961,
    "text": "I hope I said it correctly, but I think you get the picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.601,
    "end": 2922.527,
    "text": "The point is you could then use experiments to determine whether groups of people who had effective or ineffective behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.537,
    "end": 2936.021,
    "text": " And then if somebody, for example, had an overestimate of frogs, then the message to pass is frogs are not as common as you think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.402,
    "end": 2944.324,
    "text": "Whereas if there was somebody with a variance, interpretable variance,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.198,
    "end": 2964.871,
    "text": " Here, in the likelihood model, difference with some other preference, again, keeping in mind that that's still, it's like outlier detection and attracting, which isn't even necessarily a preferable thing, but just pointing out just statistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.652,
    "end": 2973.037,
    "text": "This person's model would be updated by saying, you know, it's not known that apples can jump, but actually they can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.394,
    "end": 2975.815,
    "text": " It's possible that apples jump.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.855,
    "end": 2978.237,
    "text": "So next time something jumps, don't just throw it away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.839,
    "end": 2984.862,
    "text": "And those are very different points to convey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.664,
    "end": 2995.389,
    "text": "And this is a very simple example, but it's helpful to think about because those are the kinds of parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.489,
    "end": 3000.033,
    "text": "If this was your model of schizophrenia, those would be your levers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.818,
    "end": 3030.651,
    "text": " your knobs if you had a more complex model and the models are more complex then there's a lot more associated um you know challenge yeah brock oh no i was just going to say that you know yeah that was really helpful and um i don't even know it seems i mean obviously i don't i know next to nothing i guess about psychiatry uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3033.37,
    "end": 3036.311,
    "text": " I don't know how you'd do it, though, without something like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3036.811,
    "end": 3052.014,
    "text": "I mean, I guess they were doing something kind of like this approximately informally to some degree in some cases, but it would seem like just guessing almost.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.735,
    "end": 3057.356,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3058.236,
    "end": 3062.177,
    "text": "I could infer about schizophrenia without something like this, so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3064.571,
    "end": 3081.037,
    "text": " Well, to simplify a complex area, there was studies that associated either a biomolecule or a genetic variant, but especially biomolecules and brain imaging directly to a diagnosis, which from a health record perspective, exactly makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.057,
    "end": 3081.798,
    "text": "It's the data you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.498,
    "end": 3087.3,
    "text": "However, this is a unobserved model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.886,
    "end": 3112.94,
    "text": " of the phenomena itself that can incorporate measurements including health records and that allows the development of an actual understanding of the etiology and the causation and therefore could be used to justify traditionally understood interventions or suggest different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.543,
    "end": 3142.653,
    "text": " behavior and interventions like maybe you don't oh you're low on this just take this thing that raises it it's like maybe that's not exactly the move but there's more precise like affordance to do that yeah yeah including the counterfactuals like in a clinical setting that is going to be quite interesting all right let's just in the last minutes look to 10. minsky",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.682,
    "end": 3171.376,
    "text": " active inference as a unified theory of sentient behavior if anybody wants to do a little like twitter thread recap on the sentient the sentience discourse over the last few weeks I'm sure we can find some funny tweets but with the sentient pong playing neurons and just wave after wave of semantic discussion about the term sentient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.584,
    "end": 3182.03,
    "text": " In this chapter, we wrap up active inference main theoretical points from the first part of the book, chapter 1 through 5, and its practical implementations from the second part, 6 through 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.47,
    "end": 3183.391,
    "text": "Then we connect the dots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.552,
    "end": 3190.917,
    "text": "We abstract away from the specific active inference models discussed in previous chapters to focus on integrative aspects of the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.897,
    "end": 3192.698,
    "text": "Benefits of ACT-INF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.012,
    "end": 3217.795,
    "text": " summary of the book 10.2 chapter 1 chapter 2 chapter 3 chapter 4 5 6 7 and 8 no love chapter 9 you just read it go read it again um connecting the dots the integrative perspective on active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.283,
    "end": 3226.546,
    "text": " Interestingly framed in terms of some early Dennett work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.728,
    "end": 3236.613,
    "text": "A call to model the whole iguana, a complete cognitive creature, perhaps a simple one, and an environmental niche for it to cope with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.054,
    "end": 3247.86,
    "text": "Rather than single-dimensional analyses and measurements on a complex system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.369,
    "end": 3278.267,
    "text": " just too much like a whirlwind to just measure and oh well brain regions correlated with this and this region is correlated with that those kinds of structural and behavioral morphological any given measurement does not ever get at the underlying causal structure unless you specifically model it that way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.951,
    "end": 3288.176,
    "text": " Active inference helps with that issue by offering a first principle account of the ways in which organisms solve their adaptive problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.337,
    "end": 3306.548,
    "text": "So by framing attention, memory, anticipation under common computational framings and a unified imperative, it's possible to integrate different kinds of phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.549,
    "end": 3309.41,
    "text": "Memory, attention,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.229,
    "end": 3339.354,
    "text": " be thought of as optimizing the same objective 10 4 predictive brains predictive minds and predictive processing kind of a provocative selection active inference creatures or their brains are probabilistic inference machines connecting to the kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.455,
    "end": 3343.916,
    "text": " Focus of predictive mind, predictive brain, predictive processing, coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.317,
    "end": 3356.762,
    "text": "Area, which is like the real-time and anticipatory, especially real-time unfolding, anticipation, self-evidencing, prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.062,
    "end": 3360.523,
    "text": "Predictive processing specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.044,
    "end": 3362.784,
    "text": "Livestream 43.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.365,
    "end": 3367.126,
    "text": "Perception, section 10.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3370.02,
    "end": 3391.992,
    "text": " helmholtz perception as unconscious inference then how that was implemented in bayesian brain bayesian brain the inactive turn the pragmatic turn action control bringing action in end of live stream 43 end of paper 43 idea motor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.385,
    "end": 3423.708,
    "text": " cybernetics, some other ontologies that are kind of like easily functionally equated with parts of Act-Inf, ideomotor theory, cybernetics, optimal control theory, utility decision-making, Bayesian decision reinforcement learning, planning as inference, behavior-bounded rationality, and then specifically what free energy brings into bounded rationality, valence of motion and motivation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.165,
    "end": 3436.649,
    "text": " homeostasis, allostasis, interoceptive processing, attention, salience, epistemic dynamics, rule learning, causal inference, fast generalization, and next steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.79,
    "end": 3441.09,
    "text": "Social, machine learning, and robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.351,
    "end": 3448.793,
    "text": "Summary, Lord of the Rings, we are confident that you will continue to pursue active inference in some form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.987,
    "end": 3454.308,
    "text": " So it's a quite long chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.408,
    "end": 3455.089,
    "text": "There's a lot in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.611,
    "end": 3459.232,
    "text": "We'll talk about it next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.373,
    "end": 3461.134,
    "text": "Thank you, fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.795,
    "end": 3462.935,
    "text": "Bye."
  }
]