[
  {
    "start": 2.714,
    "end": 23.49,
    "text": " all right welcome back everyone we're in cohort four of active inference textbook group and picking up on the second round of activity over the last few months in cohort four some of you were there there were some people who were not there who are here now and vice versa",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.77,
    "end": 50.693,
    "text": " we went through the first five chapters and now in this last three months of 2023 we're going to head through the second half of the book so before we like go into anything even remotely active conceptual does anyone just want to share like where did the first half of the book leave them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.495,
    "end": 59.206,
    "text": " And or what are they excited about in the second half of the book for this interval?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.287,
    "end": 78.739,
    "text": "Or any questions that are kind of guiding people's curiosity and learning journeys?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 84.372,
    "end": 90.684,
    "text": " I thought that this was the first meeting for cohort five, but I'm still works for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.967,
    "end": 94.111,
    "text": "Yeah, just just briefly to that note.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.355,
    "end": 97.498,
    "text": "It's every Tuesday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.899,
    "end": 101.566,
    "text": "There's a core five and a cohort four, and they're like an alternating times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.628,
    "end": 106.836,
    "text": "So sometimes people just join whichever time is more convenient for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.985,
    "end": 108.366,
    "text": " But by the way, it's all recorded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.407,
    "end": 108.907,
    "text": "It's all here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.927,
    "end": 111.129,
    "text": "It's all the same textbook and it's many coats of paint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.149,
    "end": 114.653,
    "text": "So there's like literally no reason to even read one chapter for another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.693,
    "end": 118.297,
    "text": "In fact, chapter six is a very great entry point in certain ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.819,
    "end": 120.139,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.239,
    "end": 121.641,
    "text": "I'll probably come to both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.661,
    "end": 121.921,
    "text": "Anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.001,
    "end": 122.342,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 123.623,
    "end": 126.046,
    "text": "Esmail, and then anyone else who wants to raise their hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.328,
    "end": 131.672,
    "text": "My question is about our Discord group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 132.713,
    "end": 134.815,
    "text": "Long time I'm looking for...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.2,
    "end": 149.226,
    "text": " some mass group for learning but i don't know i can't find there is some group about mathematics in the discord or no now it's stopped",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 150.387,
    "end": 150.768,
    "text": " Um.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.169,
    "end": 153.514,
    "text": "So you're referencing the math learning group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.594,
    "end": 155.739,
    "text": "There's no special place in discord.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.18,
    "end": 157.442,
    "text": "This this math learning group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.603,
    "end": 170.691,
    "text": "It just kind of like it's like a team name that if there's people who are motivated to like pick up that banner and commit to doing some organizing, like, say, I will be here weekly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.671,
    "end": 195.396,
    "text": " to do this and that or here's where we're going to take notes people are welcome to do that so it's just kind of like there for people who would love to see it be there but we're not doing anything further and it's not like there's like another forum or anything like that everybody who registered is added to all the calendar events and this is the shared document for everything yeah thanks",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.45,
    "end": 235.39,
    "text": " yeah where does the first half of the book leave us and then how do we set an intention or what is exciting about the second half of the book yeah i smell or anyone else uh i thought the first half was pretty comprehensive um and i do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.467,
    "end": 249.343,
    "text": " I like your description of many coats of paint, because it is like each chapter, you are going over a lot of things that you covered in a different way in the previous chapter, but in a sort of new light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.904,
    "end": 256.132,
    "text": "And I do wonder how that will come back up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 256.292,
    "end": 265.343,
    "text": "A lot of the concepts will come back up when we're designing the models, which I think the next half is more focused on actual applications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.707,
    "end": 290.924,
    "text": " And I'd say, you know, there are certain things I want to like go back over on myself just later in the previous chapters, especially like message passing and more of the neurobiology stuff, which I, uh, am very interested in, but, um, not as familiar as like maybe just some of the regular like Bayesian statistics aspects of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 293.868,
    "end": 294.189,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.609,
    "end": 295.11,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.098,
    "end": 299.762,
    "text": " Yeah, again, anyone can use their hand or write anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.743,
    "end": 307.734,
    "text": "Just to recap though, the first five chapters, the authors say is the epistemic or the learning part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.034,
    "end": 312.461,
    "text": "And that's where the kind of what is active inference is covered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.302,
    "end": 317.688,
    "text": "First, there's a context provided, then the low and the high road are gone through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.728,
    "end": 320.753,
    "text": "Low road is how, that's Bayesian statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.314,
    "end": 325.62,
    "text": "The high road is why, that's that persistence imperative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 325.6,
    "end": 355.557,
    "text": " chapter four goes into the generative models of active inference which are exactly what the second half of the book is about applying however chapter four gives a pretty long and comprehensive treatment of what a generative model is and then chapter five studies the setting where the most generative models have been constructed and deployed and associated with empirical data which is mammalian neuroscience so it's a very tight first half of the book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 355.722,
    "end": 378.928,
    "text": " then we get into the second half of the book and in the beginning of chapter six they call their shot they said this chapter provides a four-step recipe to construct an active inference model and it discusses a bunch of other design choices the quote here give me six hours to chop down a tree and i will spend the first four sharpening the axe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.908,
    "end": 402.3,
    "text": " pretty interesting it's like okay well how much time do you have to make this active inference generative model do you have 10 minutes and you're scribbling it on a napkin or do you have four years or 15 years to develop this and then here we are in this chapter where it's like yeah what is sharpening the axe what is the tree that we're going to cut down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.027,
    "end": 408.87,
    "text": " kind of starts it on an interesting note.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.851,
    "end": 418.22,
    "text": "Is there anything anyone wants to like, ask or say about just active inference generative modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.562,
    "end": 424.747,
    "text": "We can dip into chapter six now and look at the recipe itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.809,
    "end": 432.355,
    "text": "But is there anything people are thinking or curious about in terms of like, active inference generative modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.345,
    "end": 450.892,
    "text": " It's an exciting moment, and this in certain ways is the topic itself in practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.194,
    "end": 466.654,
    "text": "All of the discussion around an active inference model of this and of the eye saccade and of depression and of organizations and of Gaia, those are active inference generative models of insert system of interest here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.755,
    "end": 472.922,
    "text": "So that's what the earlier part of the textbook approaches in theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.78,
    "end": 479.099,
    "text": " And chapter six is where the recipe is laid out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.962,
    "end": 484.819,
    "text": "And there's a lot of dots to connect and some of it, we can add detail and connective tissue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.043,
    "end": 503.044,
    "text": " But this is kind of like the real moment where active inference goes from being like something that's being discussed on stage or conceptualized by others in their mind into being something that we enact through constructing a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 503.525,
    "end": 515.481,
    "text": "Like reading the first five chapters to continue with this culinary analogy is like reading recipe books or reading a molecular gastronomy textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 515.461,
    "end": 543.848,
    "text": " or reading about micro and macronutrients or the mylar reaction or like all these like sort of like ideas about cooking and here's the recipe and then there's still more guidebooks and play-by-plays and workplace training and all these kinds of things would be associated with the practice of cooking but this is where that culinary textbook does a crossover moment into talking about the recipe itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.578,
    "end": 567.945,
    "text": " thank you Andrea yes we can definitely overview six also on the top of each chapter page there there is a short textual or a video with a short overview that Ollie and I have prepared for for the chapters um okay so let's look at the the recipe itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.722,
    "end": 580.655,
    "text": " So section one, they're just talking, section one of chapter six is an introduction and they do make some very relevant points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.476,
    "end": 586.323,
    "text": "And then in section 6.2, we see the recipe itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.343,
    "end": 589.748,
    "text": "So we've pulled the recipe out just so we can kind of expand and discuss.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.571,
    "end": 593.934,
    "text": "The recipe asks four questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.016,
    "end": 597.139,
    "text": "Which system are we modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.418,
    "end": 606.146,
    "text": " what is the most appropriate form for the generative model, how to set up the generative model, and how to set up the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.807,
    "end": 611.611,
    "text": "And then they write, these four steps in most cases suffice to design an active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.372,
    "end": 619.099,
    "text": "Once completed, the behavior of the system is determined by the standard schemes of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.119,
    "end": 625.185,
    "text": "Specifically, or technically, the descent of the active and internal states, the autonomous states,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.79,
    "end": 653.94,
    "text": " on the free energy functional associated with the model so the recipe is asking us questions that only we can address situationally that help us set up the landscape could be a very dynamic landscape it might be a very trivial one that just kind of rolls to a single Valley but these questions are going to help us construct the landscape that then the ball rolls downhill on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.473,
    "end": 684.349,
    "text": " so it's kind of like making a pinball machine or like making some other kind of um Rube Goldberg machine we're at the second level conceptualizing of a system and then asking that's like what what system are we modeling what do we want to model and it uh isn't necessarily always uh easy which system we're modeling someone's joining we'll see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.375,
    "end": 694.563,
    "text": " But this question about system of interest is in common to active inference generative modeling, as well as to just broader systems engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.004,
    "end": 704.833,
    "text": "And we get into the active inference specific questions here about the appropriate form of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.853,
    "end": 711.679,
    "text": "So this is the first... This is the first of the three practical challenges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 712.86,
    "end": 714.842,
    "text": "And this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.733,
    "end": 742.467,
    "text": " is brought up in chapter four earlier when discussing generative models in discrete or continuous time and then it's revisited in chapter seven and eight which are going to go into more detail on time but it's one of the big upfront questions that come into play after the system of interest has been determined is where and how time is going to be traded",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.016,
    "end": 755.648,
    "text": " maybe if anyone wants to, like, what's a system of interest that we could kind of carry through for the rest of this discussion as an example, or just to kind of ground some of these more general topics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.395,
    "end": 770.743,
    "text": "Like an example of something like, example of what we would want to model with this recipe?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 771.523,
    "end": 772.464,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.484,
    "end": 773.145,
    "text": "Like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.767,
    "end": 775.389,
    "text": " What would you answer to the first question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.157,
    "end": 790.863,
    "text": "Could be like, you know, a robot that we're trying to model using active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 792.765,
    "end": 793.245,
    "text": "Sounds good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.446,
    "end": 796.368,
    "text": "Let's continue with the robot setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.531,
    "end": 802.474,
    "text": "What is the most appropriate form for the generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.197,
    "end": 808.062,
    "text": " So that brings up this time question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 809.404,
    "end": 817.893,
    "text": "And you could imagine different time conceptions, maybe even different sensors and actuators on the robot have a different time conception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.577,
    "end": 828.985,
    "text": "From that early question, steps three and four are really where the work happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.669,
    "end": 847.029,
    "text": " The second question with time is an early modeling decision that sets up broadly which branch, chapter seven or chapter eight, the model is going to be built in line with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.59,
    "end": 852.176,
    "text": "These are kind of like two architectural styles with their associated technical differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.839,
    "end": 859.545,
    "text": "As they write, if you have a process that's more in terms of categorical inferences,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.234,
    "end": 862.538,
    "text": " That leads you to the discrete case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.159,
    "end": 868.368,
    "text": "So like chess, the moves in the board are discrete in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.408,
    "end": 869.63,
    "text": "There's like a click of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.311,
    "end": 875.74,
    "text": "Anywhere that there's a click of time, discrete time is usually appropriate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.262,
    "end": 885.516,
    "text": "Where there's a flow or an unfolding of time, then the continuous time models are specialized on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.985,
    "end": 889.19,
    "text": " And then as they point out, you can make hybrid models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.231,
    "end": 901.267,
    "text": "So a really common example of a hybrid model has at the lower or the sensory motor level, continuous models, and then at the higher cognitive level, something more discreet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.59,
    "end": 911.101,
    "text": "But that question about time sets up all of the work itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.121,
    "end": 912.162,
    "text": "And this is where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.39,
    "end": 940.512,
    "text": " really the iterated modeling comes out so we're dealing with this robot and um we're going to make a discrete time model because it's a digital computer and so this discrete formulation represents well how this robot works we could zoom out and make a continuous time model with a person or we can zoom in and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.93,
    "end": 947.096,
    "text": " make a continuous model for some sensor or actuator, but just at the robot level, think about discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.217,
    "end": 956.765,
    "text": "So then that just sets up really the canvas for all of these questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.429,
    "end": 963.512,
    "text": "What are the generative models most appropriate variables and priors?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.634,
    "end": 967.596,
    "text": "Which parts are fixed and what must be learned?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.073,
    "end": 974.218,
    "text": " If anyone wants to add anything, please raise your hand or give a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.238,
    "end": 978.504,
    "text": "But there's little else we can say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.564,
    "end": 987.895,
    "text": "This is the work itself of the modeling after you've kind of unrolled the canvas and decided that we're going to be talking about discrete time model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.857,
    "end": 995.625,
    "text": "These are all of the real modeling questions that basically take you from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.736,
    "end": 1006.249,
    "text": " I'm interested in a robot and I'm going to do a discrete time model all the way on through a description of a system that's necessary and sufficient for understanding its behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.717,
    "end": 1014.14,
    "text": "Does anyone have like thoughts or ideas on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.093,
    "end": 1026.237,
    "text": "Sorry, the last thing you said, you were muted there for a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.55,
    "end": 1054.84,
    "text": " just does anyone have a thought or question on this well i think it's it's pretty interesting uh one thing that stuck out to me not from the textbook but from listening to the last panel in the symposium was what burt devries was talking about you know needing to be able to scale",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.254,
    "end": 1060.218,
    "text": " HAB-Jacques Juilland, models according like say for an autonomous let's say the robot is an autonomous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.238,
    "end": 1063.121,
    "text": "HAB-Jacques Juilland, self driving car and.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1063.141,
    "end": 1073.993,
    "text": "HAB-Jacques Juilland, It needs to be able to to calculate with a different degree of precision, whether it's driving you know straight down a freeway or going around a roundabout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.234,
    "end": 1085.805,
    "text": "HAB-Jacques Juilland, And so I guess would that be an example of you know, trying to build a. HAB-Jacques Juilland, hybrid you know, a hybrid model that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.308,
    "end": 1092.916,
    "text": " based off that circumstances is following a different route in that pathway in the tree?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.08,
    "end": 1096.801,
    "text": "Is that appropriate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.461,
    "end": 1098.643,
    "text": "It's a great connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.524,
    "end": 1104.23,
    "text": "We're in the room talking about the generative model of the self-driving car.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.491,
    "end": 1108.615,
    "text": "Now we're thinking about two possible ways we could go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.955,
    "end": 1114.662,
    "text": "We could have a fixed precision model or we could have a variable precision model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.194,
    "end": 1121.947,
    "text": " Even if somebody doesn't have a lot of background in modeling, it's pretty clear what the strengths and weaknesses would be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.288,
    "end": 1124.353,
    "text": "Well, in the fixed precision model, it's simpler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.393,
    "end": 1131.469,
    "text": "And if you fix it at an adequate frequency or precision, it might work totally fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.449,
    "end": 1155.145,
    "text": " okay and what do you get with a variable precision model well you have this hyper parameter which is like how variable or how should i change how i change the precision so it's not like you've answered the last mile by saying we'll make it variable precision you could imagine a variable precision model that just adds hyper parameters that don't make it a more effective robot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.31,
    "end": 1158.474,
    "text": " or take up a huge amount more computational resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.994,
    "end": 1164.841,
    "text": "So that's exactly the conversation about which features of the model do we want to combine?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.881,
    "end": 1166.583,
    "text": "Yes, please, Jesse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.944,
    "end": 1178.336,
    "text": "Could you give an example of, like, in that case, what would be an example of a hyperparameter that you might program in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.137,
    "end": 1182.921,
    "text": "Yeah, in that specific case, the hyperparameter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.525,
    "end": 1188.692,
    "text": " So the parameter itself would be how precise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.053,
    "end": 1194.038,
    "text": "The fixed parameter model would just say precision level 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.679,
    "end": 1196.762,
    "text": "You could think of that as the function y equals 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.743,
    "end": 1198.925,
    "text": "It's just a static line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.325,
    "end": 1206.394,
    "text": "And then the hyperparameter would now say, well, let's do inference on what that precision parameter should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1207.91,
    "end": 1213.155,
    "text": " And you might say, I'm going to draw precisions from a distribution that has this and that shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.136,
    "end": 1215.398,
    "text": "Do you want to draw precisions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1215.758,
    "end": 1217.28,
    "text": "So let's just say the fixed example is 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.74,
    "end": 1223.706,
    "text": "Do we want to draw our precisions from 10 plus or minus 2 or 10 plus or minus 8?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.427,
    "end": 1227.831,
    "text": "Or do we want to sweep between 10 and 100?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.631,
    "end": 1234.137,
    "text": "Whatever strategy you take in a Bayesian setting is like the hyperprior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.538,
    "end": 1246.472,
    "text": " That's you kind of surveying out or mapping out another space that you explore the parameters of the distribution on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.393,
    "end": 1258.386,
    "text": "And the double-edged sword is almost always, quite literally, hyperparameters are more expressive and they can fit situations better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.632,
    "end": 1265.918,
    "text": " However, they introduce compounding exponential search spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.661,
    "end": 1286.82,
    "text": "So if you just have to do something, you could get into a lot of recursive, especially in cognitive modeling, a lot of recursive possibilities that are like way past the point of diminishing return of being relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.087,
    "end": 1293.796,
    "text": " Bayesian model selection is a principled way to understand how many parameters to include in a model and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1294.638,
    "end": 1299.104,
    "text": "So there are methods to address this question of how many parameters should we have?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.645,
    "end": 1301.087,
    "text": "How meta do we have to go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1301.127,
    "end": 1307.215,
    "text": "And those are exactly the kinds of evaluative criteria that would come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.956,
    "end": 1315.727,
    "text": "Again, we're in the room talking about the two different generative models, fixed precision, variable precision, or time horizon of three and time horizon of 12.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1316.753,
    "end": 1322.4,
    "text": " Are we getting a better model period with a longer time horizon?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1323.061,
    "end": 1323.702,
    "text": "Is it worth it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.022,
    "end": 1327.527,
    "text": "Those are exactly the kinds of questions that come into like model evaluation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.628,
    "end": 1330.851,
    "text": "So it'd be like the cooking evaluation stage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.173,
    "end": 1336.638,
    "text": "Here's the recipe and the questions that you ask when you're the chef preparing this recipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.62,
    "end": 1344.649,
    "text": "And then there could be another chapter on how do you evaluate cuisine in general or for some specific genre?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.029,
    "end": 1345.63,
    "text": "Yeah, Jesse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.74,
    "end": 1361.753,
    "text": " Um, with the limiting variable on that generally be computational power, or just just uninterpretable results both great great suggestions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.514,
    "end": 1364.158,
    "text": "Yeah, in principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.797,
    "end": 1366.919,
    "text": " you can always add more hyper parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.6,
    "end": 1376.248,
    "text": "You might be making a bigger search space and just sifting through a progressively larger space to find little needles in the haystack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.009,
    "end": 1385.417,
    "text": "And then exactly the second piece, which is like the interpretability and AI interpretability and all these things are very important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1386.118,
    "end": 1393.605,
    "text": "And sometimes a parameter can be constructed to have a certain semantics or interpretability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.969,
    "end": 1403.863,
    "text": " Other times there are parameters that you could kind of describe, but parameters don't need to necessarily be interpretable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.383,
    "end": 1415.28,
    "text": "However, one of the cool things about active inference, especially because we're taking such a hands-on approach to building these generative models, is we can design interpretable systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.781,
    "end": 1421.089,
    "text": "And that's something that Ines Hippolito and colleagues have recently explored in a little bit more detail as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.71,
    "end": 1423.913,
    "text": "But it's exactly that approach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.045,
    "end": 1438.753,
    "text": " interpretability, that we're like, in the farmers market boutique generative model construction workshop here, talking about what's the game plan for how we're going to make this artisan dinner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.838,
    "end": 1442.661,
    "text": "That's kind of where chapter six sits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.091,
    "end": 1471.274,
    "text": " And maybe if at some point you could put in the chat, maybe a link to like a paper in respect to the interpreted, what you were just saying via interpretability or maybe in the textbook, in the CODA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.616,
    "end": 1473.677,
    "text": "Oh yeah, I'll add it to this page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.697,
    "end": 1475.119,
    "text": "I see you right here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.76,
    "end": 1476.981,
    "text": "But yeah, I'll add it to the page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.001,
    "end": 1477.642,
    "text": "Totally good call.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.722,
    "end": 1478.503,
    "text": "All right, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1480.728,
    "end": 1481.809,
    "text": " Yeah, from June.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.11,
    "end": 1484.212,
    "text": "Oh, no, it's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.232,
    "end": 1489.619,
    "text": "I mean, this is like we want to be hands on with the models so that we can understand them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1490.981,
    "end": 1497.749,
    "text": "And this is the textbook shows some simple settings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.869,
    "end": 1506.28,
    "text": "So from earlier in the book, we had the frog that did or didn't jump out of the person's hand or the object that was in their hands that did or didn't jump.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.53,
    "end": 1510.654,
    "text": " And that was a kind of case study in passive inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.715,
    "end": 1519.543,
    "text": "The person's just holding the object, it jumps or it doesn't, and then they're gonna update their beliefs about whether it's a frog or an apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.563,
    "end": 1531.416,
    "text": "So that brings up a lot of important topics like Bayesian belief updating and learning, surprise, Bayesian surprise, sensor fusion, multimodal inference, but it's passive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.658,
    "end": 1535.76,
    "text": "In the second half of the book,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.892,
    "end": 1540.978,
    "text": " a kind of canonical active inference setting is going to be the rat in the tea maze.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.62,
    "end": 1547.025,
    "text": "That's a setting where the world doesn't just happen to the animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.185,
    "end": 1551.67,
    "text": "It's like its actions matter for what sensory stimuli it gets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1552.771,
    "end": 1564.785,
    "text": "And so this example of like a tea maze, where there's something that's rewarding or preferred at the ends or either or both end, and then there's something informational at the bottom of the tea maze,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.373,
    "end": 1580.255,
    "text": " that's kind of like a minimal model system for active inference because it captures different things that you might want to emphasize, like the value of information or habit, all these different features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.315,
    "end": 1592.292,
    "text": "So these are kind of like pedagogical or toy examples that are very graspable and very small scale models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.132,
    "end": 1601.082,
    "text": " And then in the literature, you see more like medium to large scale models, or really more in the small to medium space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.122,
    "end": 1604.066,
    "text": "And then in applications, you might see large scale models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.247,
    "end": 1614.599,
    "text": "From the research and development side, oftentimes people are just like, I introduced a new motif and made a small scale model that demonstrates the motif.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1616.441,
    "end": 1619.545,
    "text": "And then they move on developing motifs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.284,
    "end": 1641.347,
    "text": " because if you can develop the motif and make it rock solid in a small case that's actually clearer and more preferable and then people can introduce that motif into medium and large scale models a lot more to say about modeling but but yeah anyone can like give a thought or a question about modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1649.123,
    "end": 1652.087,
    "text": " Hal Hallstein, yeah I guess in that respect i'm just curious about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.107,
    "end": 1655.071,
    "text": "Hal Hallstein, You know model switching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.091,
    "end": 1657.955,
    "text": "Hal Hallstein, And if there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.975,
    "end": 1668.649,
    "text": "Hal Hallstein, I guess, are the if there's master models that can determine when to switch between models in a given you know, based off updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.69,
    "end": 1677.882,
    "text": "Hal Hallstein, You know, updating either a belief system or or essentially learning your environment learning and environmental circumstance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.679,
    "end": 1707.548,
    "text": " yeah a lot to say on that um let's look at figure 4.3 this is our Rosetta Stone figure on the top is the discrete time generative model on the bottoms the continuous time generative model they're being positioned provocatively",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.473,
    "end": 1711.119,
    "text": " to highlight their structural similarities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.881,
    "end": 1718.055,
    "text": "There's the downstairs part that looks like an E, and that's like the passive part going through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1718.597,
    "end": 1723.107,
    "text": "And then on the top part and upstairs of each, there's the policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1724.622,
    "end": 1749.82,
    "text": " action policy selections being treated a little bit differently between these two settings and what the world is is treated differently between the two settings in the discrete time setting we have a past present and a future time point that emit observations and then you have policies that intervene into how the world changes through time and thus which observations it emits",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.935,
    "end": 1753.178,
    "text": " But in the discrete time setting, you have a past, a present, and a future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.859,
    "end": 1759.705,
    "text": "And you could have it look 100 time steps in the past and one in the future or none in the past and 100 in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.905,
    "end": 1762.848,
    "text": "Those are the kinds of parameters that the modeler plays with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.868,
    "end": 1767.173,
    "text": "Whereas in the continuous time model, you have only the present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1767.974,
    "end": 1779.165,
    "text": "And then you have derivatives of the present, like the first, second, third derivative that reflect how the present is changing through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.871,
    "end": 1784.422,
    "text": " So we have like the car's location is at location 100 and it's going 10 miles per hour.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.244,
    "end": 1787.41,
    "text": "So that means at the next time point, we expect it to be at 110.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.47,
    "end": 1794.066,
    "text": "Now, if we said, well, it's at 100 and its speed is 10 and its acceleration is one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.248,
    "end": 1803.605,
    "text": " So then it's going to get to a little bit more than 110 by the next time point in continuous time, but you're all at every moment you can like recheck the flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.625,
    "end": 1806.43,
    "text": "Okay, so you asked about model switching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.451,
    "end": 1811.059,
    "text": "So let's look ahead a bit to figure 8.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.545,
    "end": 1816.37,
    "text": " So here, the upstairs part is a discrete model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.071,
    "end": 1820.795,
    "text": "We know we're in the discrete setting because we have like the past, present, and future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.315,
    "end": 1825.199,
    "text": "So that's the discrete time, partially observable Markov decision process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.781,
    "end": 1834.409,
    "text": "And then coming out of each observation, we have like another little figure 4.3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.79,
    "end": 1840.455,
    "text": "And it's the bottom part of figure 4.3 with the continuous time model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.498,
    "end": 1846.825,
    "text": " So you could compose discrete on discrete, continuous on continuous, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.865,
    "end": 1849.569,
    "text": "But in this case, let's think about model switching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.829,
    "end": 1851.792,
    "text": "There's a world where there's two possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.972,
    "end": 1855.637,
    "text": "Either the weight is 5 pounds or the weight is 50 pounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.879,
    "end": 1863.608,
    "text": "And so you have some belief before anything else happens about how likely is it to be 5 versus 50.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.128,
    "end": 1877.193,
    "text": " And then there's a descending expectation, like I'm in five, that then is going to set a policy on the sensory motor model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.656,
    "end": 1881.782,
    "text": "And so you could imagine that if you expected five,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.353,
    "end": 1911.162,
    "text": " then it was five or if you expected 50 and it was 50 it would be not surprising that's like when the step is at the distance that you expect the step to be those are like literally the things that we don't attend to when our descending predictions are accurate however if there was a mismatch there's a prediction error that some that it was heavier than you thought",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.019,
    "end": 1916.81,
    "text": " that would update your belief at the higher level in the way you'd expect and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.777,
    "end": 1929.218,
    "text": "So descending predictions, one example or one way we could think about those is like, those are the models that you can switch over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.56,
    "end": 1942.515,
    "text": " And then that sets the top down expectation, which includes action policies, because we're not just expecting sensory data, we're expecting ourselves to do things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.196,
    "end": 1945.138,
    "text": "That's why we select the most likely thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.34,
    "end": 1950.225,
    "text": "Because the top down expectations are over the sense and the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.647,
    "end": 1952.168,
    "text": "And then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.599,
    "end": 1979.218,
    "text": " when what we get back from the ascending levels is what we expect it's the least surprising which means that we had the most model evidence the prediction error was lowest the surprise was lowest the free energy was lowest things are good the ball is on the bottom of the hill and then as sensory feedback diverges you have more surprise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.992,
    "end": 1982.858,
    "text": " That means the ball is not on the bottom of the bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.619,
    "end": 1990.434,
    "text": "There's a higher free energy and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.454,
    "end": 1990.774,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.957,
    "end": 1993.64,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.66,
    "end": 1998.23,
    "text": "In that respect, could you consider prediction error almost as like a thermostat for model switching?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.572,
    "end": 1999.873,
    "text": "Where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.202,
    "end": 2033.067,
    "text": " could be used as such if you made the model that had that kind of a feature or or attribute then it literally would be if you didn't it wouldn't be and this is what and that's what carl friston and others sometimes call a deflationary account which is like deflating all the hot air out of the account and just ending up with the lean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.295,
    "end": 2061.349,
    "text": " distilled you know if and only if necessary and sufficient whole truth nothing but the truth status that's the deflationary account is like well I made a cognitive model where ascending prediction errors are used as a cue for model switching then the deed is done but until the generative models on the table the discussion is very speculative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.848,
    "end": 2071.198,
    "text": " It's like until you have on the table, the linear regression, connecting smoking and cancer, you might have a super strong anecdotal belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2071.218,
    "end": 2090.762,
    "text": "You might have a strong prior, but if you're just speculating, especially if you think, well, depending on how you include covariates, it's not so simple before you make the model, even for very large effect phenomena in the world, which is why statistics is a process and why it matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.198,
    "end": 2103.938,
    "text": " So chapter six shows us the recipe and is like, hey, there is a bright line between like the recipe talking about the food and having the food on the plate in front of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.839,
    "end": 2109.707,
    "text": "The recipe is how you get from being like, I would like to have this dish to a dish.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.229,
    "end": 2119.602,
    "text": "Your version of the dish isn't necessarily going to look like food channel status, but it will be what you did do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2120.881,
    "end": 2128.089,
    "text": " And so that is really the clear line between ultra speculative hypotheticals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.13,
    "end": 2131.553,
    "text": "Like what does active inference say about attention?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.614,
    "end": 2135.237,
    "text": "There's not even a system of interest in that sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.018,
    "end": 2146.129,
    "text": "Realistically, that's not even a complete question because you could, depending on the system of interest, do any number of things, just too many to even say in one sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.353,
    "end": 2155.208,
    "text": " but we have a recipe and a process that actually works towards giving a deflationary account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.295,
    "end": 2176.823,
    "text": " So here is one case where Michael Karl, I believe, we looked a little bit about like translation and eye gaze.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.684,
    "end": 2181.688,
    "text": "So humans translating, that could even be understood as a translation or switching behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.197,
    "end": 2195.944,
    "text": "Great point that several have raised, like the steps in the recipe don't need to be sequential or separate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.211,
    "end": 2204.543,
    "text": " So in a way, these are kind of like, these are everything you need to think about when you want to serve dinner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.644,
    "end": 2209.57,
    "text": "But depending on different people's kitchen and setup, like they might do one thing before another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.71,
    "end": 2223.89,
    "text": "Now there's some things that you might suffer if you do one before the other, but there's other things where the order doesn't really matter, but just in a book or in a verbal speech, you have to present one in front of another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.471,
    "end": 2225.813,
    "text": "But just because things are,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.261,
    "end": 2232.928,
    "text": " presented in a order doesn't mean that that's like from most to least important or least to most important, any of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.03,
    "end": 2240.638,
    "text": "So these are like just questions that we ask ourself as part of the iterated modeling process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.364,
    "end": 2247.827,
    "text": "And they're big questions that aren't going away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.867,
    "end": 2252.012,
    "text": "And none of them are too simple to speed over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.193,
    "end": 2254.095,
    "text": "What system are we modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.193,
    "end": 2256.796,
    "text": " Well, it's like, is it going to be the robot and the niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.657,
    "end": 2259.419,
    "text": "But then where do you go with the niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.439,
    "end": 2260.681,
    "text": "Does that include the power plant?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.462,
    "end": 2265.527,
    "text": "I mean, where do you really develop these reasonable bounds?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.608,
    "end": 2268.871,
    "text": "And that's, again, to give a deflationary account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.252,
    "end": 2271.494,
    "text": "It's like, what is this model for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.776,
    "end": 2283.289,
    "text": "So you can never, even from the very outset, disentangle the generative model from it being specifically constructed by a team in a place where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.995,
    "end": 2292.569,
    "text": " And that's like a kind of radical scientific inactivism, perhaps, or scientific realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.609,
    "end": 2308.534,
    "text": "And again, it's really fascinating how there is a clear line between generative model on the table, maybe limping along, maybe simple,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.138,
    "end": 2338.335,
    "text": " but generative model on the table exhibiting simulated behavior being used to process data and then we have like the space of the cognitive so productive but that's the conversation around the dinner table and if all the chefs walk away from the table and there's no food on the table maybe it was just a conversation group but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.564,
    "end": 2349.085,
    "text": " If the business plan was to produce a certain kind of food with reliability, then just speculating about variants to the recipe wouldn't have gotten you there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.378,
    "end": 2393.702,
    "text": " then there's a lot of just big topics that come up repeatedly like having multiple time scales of inference and like real systems are happening all scales all times at once and this is a fact that's often pointed to for example with biological systems but for a given system of interest or phenomena of interest there may be some spatial temporal scales that are more relevant to model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.239,
    "end": 2405.977,
    "text": " Like if we're simulating eye movement behavior, if we make something that is iterating every picosecond, we're just way oversampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.139,
    "end": 2413.328,
    "text": "And so there'd be a lot of boring time steps and then there'd be some shocking time steps and we would have like a really...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.966,
    "end": 2414.687,
    "text": " inadequate model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.488,
    "end": 2427.843,
    "text": "Conversely, if we were to grain over hours, then we would think there was nothing interesting about gaze behavior because it ended up being just kind of sampled, looking no different than an inanimate gas particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.864,
    "end": 2436.032,
    "text": "But then there's certain observations, certain scales of interest that have these rich cognitive dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.176,
    "end": 2443.281,
    "text": "And the meaning isn't just simply like out there ready for us to pick it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.392,
    "end": 2452.209,
    "text": " it's actually in the co-construction of the model and in the analysis and the unfolding of a system of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.672,
    "end": 2464.375,
    "text": "One other useful figure from chapter nine, they described this as the meta-Bayesian perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.895,
    "end": 2487.088,
    "text": " here we have figure 4.3 in the center generative model discrete time generative model past present future so this is going to be the subjective model which is to say that of the subject of the experiment and then a little bit more philosophically or metaphysically the subjective model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.296,
    "end": 2492.541,
    "text": " could be that which is subjectively experienced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2492.561,
    "end": 2497.047,
    "text": "But putting that aside, Anil, not sure if you're actually here or not, but it'd be very cool if you were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.849,
    "end": 2502.014,
    "text": "This model is of the experimental subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.175,
    "end": 2505.339,
    "text": "And then here we're out in the room now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2505.659,
    "end": 2507.962,
    "text": "So inside was the rat in the maze.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2508.443,
    "end": 2509.685,
    "text": "That's our experimental subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.586,
    "end": 2519.218,
    "text": "But then from the perspective of the researcher, the subject is the object and the behavior that it emits is objective behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.245,
    "end": 2528.476,
    "text": " So just like if we were doing an animal behavior experiment, you'd have like, well, what does the animal know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.556,
    "end": 2531.761,
    "text": "What is its input stimuli and what actions can it do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.801,
    "end": 2532.642,
    "text": "What are its affordances?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.623,
    "end": 2535.546,
    "text": "So that's like the system of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.567,
    "end": 2538.93,
    "text": "And then now what else is in the room?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.573,
    "end": 2549.745,
    "text": "And then if you can develop that thin wrapper around your system of interest, you have the minimal benefit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.4,
    "end": 2577.167,
    "text": " set up to have something on the table and maybe it's good enough with just that first framing or maybe you want to go way way way deeper in a certain way or you want to explore some other cognitive phenomena but broadly just connecting it to behavioral sciences and just like looking at like what is the animal under observation and its cognitive model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2577.991,
    "end": 2588.949,
    "text": " And then what's the thin wrapper around that that helps bring a closure to this encounter so that we can get a grasp on it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.212,
    "end": 2593.316,
    "text": "Ajith?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2593.336,
    "end": 2594.237,
    "text": "I didn't have a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2594.257,
    "end": 2598.003,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.023,
    "end": 2604.133,
    "text": "So I think it's super cool because a lot of these conversations aren't necessarily active inference specific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.177,
    "end": 2615.508,
    "text": " Spatial and temporal scale system of interest, identification, um, positioning of your model, multimotor sensor fusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.568,
    "end": 2627.861,
    "text": "Um, like in certain ways, the active inference part in chapter six, it's like, that's the work again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.881,
    "end": 2633.547,
    "text": "All the part that gets us to the kitchen are general modeling commentaries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.231,
    "end": 2640.1,
    "text": " And then we have the specific work itself, which is setting up the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2644.168,
    "end": 2657.813,
    "text": "And then they just have a very, very brief section 6.7, which gets revisited in chapter nine about interfacing data to these generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.518,
    "end": 2672.419,
    "text": " So there's a lot of ways to go in this chapter is like the recipe for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.884,
    "end": 2678.552,
    "text": "What are anyone's thoughts or questions on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.608,
    "end": 2708.37,
    "text": " yeah so i was wondering like i know like in the active inference institute they have a lot of projects and sort of uh github repositories where they show examples of using these to model like cognitive agents and things like that but i was wondering like does this textbook itself have sort of maybe like a github repo with examples of sort of them using these recipes or things like that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2708.519,
    "end": 2726.41,
    "text": " um great great question very important question in appendix C they do provide some matlab code we have our own repo for the textbook so like we might just want to bring that code in and also develop other examples like I would love to see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2728.077,
    "end": 2735.828,
    "text": " the chef and the sous chef and, and the client, everyone's notes and just everyone's thoughts about like what could be developed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.609,
    "end": 2741.475,
    "text": "A lot of times people pick really ambitious systems of interest to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.535,
    "end": 2754.473,
    "text": "And that can be like daunting because these are, you can go arbitrarily sophisticated cognitive modeling and three humbling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.605,
    "end": 2778.57,
    "text": " and often seen as like not the real work to build these simpler pedagogical examples to get a feel for these models by hand and like kind of start with the lighter weights basically so that people can develop an intuition for these different tools and skills and practices um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.086,
    "end": 2807.325,
    "text": " seeing examples is helpful especially really simple ones seeing complex examples may actually not give the kind of information that people are always looking for because for really well-built examples the kernel is kind of lost in the specifics so if you have something that's taking in these five different kinds of sensors and doing this kind of a planning on this kind it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.284,
    "end": 2815.022,
    "text": " the real essence of active inference is spread across thousands of lines of code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.027,
    "end": 2823.263,
    "text": "And then you have to abstract away from those five different sensors and specific action setting to kind of reconstruct what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.985,
    "end": 2824.707,
    "text": "Your own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.728,
    "end": 2829.852,
    "text": " carrying on board sense of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.033,
    "end": 2835.138,
    "text": "So the small and the medium models are really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.278,
    "end": 2838.342,
    "text": "And then that helps you scope whether a large scale model is even possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.184,
    "end": 2841.346,
    "text": "So don't be discouraged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.366,
    "end": 2844.329,
    "text": "Yeah, that the large scale model is not in hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.931,
    "end": 2850.236,
    "text": "That, um, you know, that you're not a factory kitchen today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.316,
    "end": 2855.082,
    "text": "Because you got curious about the cuisine of cooking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.272,
    "end": 2862.96,
    "text": " Maybe we can have a whole restaurant analogy thread.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.662,
    "end": 2868.347,
    "text": "Well, I got an analogy for you on that to go off topic a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.408,
    "end": 2872.674,
    "text": "But out here, there's like tons of prickly pears.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.174,
    "end": 2874.636,
    "text": "They probably have them up in Davis too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.297,
    "end": 2876.218,
    "text": "They're right there right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.279,
    "end": 2881.606,
    "text": "So I just went and collected like a whole bucket full and I've been making like juice from it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.447,
    "end": 2885.912,
    "text": "But my hands are just so full of thorns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.373,
    "end": 2904.998,
    "text": " same way with active inference i'm trying to just make a cup of juice and i have like got thorns all over my body now that's funny yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.492,
    "end": 2934.411,
    "text": " just just like right at the very beginning we're discussing like chapter six I feel like chapter one and chapter 10 are great entry points into the um theory in the context of active inference chapter six is like the sort of doing out because chapter six grounds the fulcrum of this book in a almost boringly inactive framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2937.496,
    "end": 2939.298,
    "text": " That's the deflationary angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2940.799,
    "end": 2943.723,
    "text": "And it's the real work of building the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.823,
    "end": 2963.203,
    "text": "Not everyone's going to build every generative model, but it's super exciting that the bright line exists, that the culinary sector exists, and that actually dancing amongst different metaphors and systems of interests, we're able to have the conversations we want to have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.404,
    "end": 2965.866,
    "text": "So like for systems design,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.82,
    "end": 2981.307,
    "text": " these questions from chapter six these are things maybe you don't call it a generative model or generative process but like what are you interested in what matters to you about it what phenomena do you think are relevant like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.793,
    "end": 2985.399,
    "text": " Those are questions that everyone can be addressing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.459,
    "end": 2998.802,
    "text": "And then to bring those questions and awarenesses legibly into a modeling process that can have the integrity of all other engineering, it's super exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.862,
    "end": 3007.176,
    "text": "And it's what, among other things, differentiates academic from being just like a hot take or like a kind of mic drop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.696,
    "end": 3011.261,
    "text": " It's like, yeah, chapters one, two, three, four, five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.301,
    "end": 3012.743,
    "text": "The mic is dropped repeatedly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.783,
    "end": 3015.406,
    "text": "And then what do we do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.083,
    "end": 3028.384,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.866,
    "end": 3033.21,
    "text": "Well, we're in the game now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.811,
    "end": 3035.273,
    "text": "Cohort four, we're back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.805,
    "end": 3062.678,
    "text": " we out there we back um we'll continue in chapter six earlier times uh slot next week and we'll be in the game and and let's think about how we can kind of curate and improve our niche for future cohorts also maybe develop along the weeks if someone has like a system of interest that they want to kind of develop out and play with different features of like if you had a system of interest robot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3062.658,
    "end": 3085.645,
    "text": " and you kind of answered the four questions the recipe and then in week uh three and four in chapter seven you explored the discrete time model and then in the next weeks we explored a continuous time feature of the model and then in chapter nine you thought about how data comes into play and in chapter 10 recontextualized you know you'd have a transformative understanding and trail of work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.625,
    "end": 3108.578,
    "text": " for a very limited amount of time regarding your system of interest so if you choose something that cares uh that you care about then that kind of work sequence should be as meaningful as anything could be what time is the earlier time um uh it will be uh it's at 13 UTC all right 13.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.997,
    "end": 3115.475,
    "text": " And I feel like there's going to be some time zone changes or something like that, or daylight savings or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3116.498,
    "end": 3118.544,
    "text": "But yeah, it's all on the calendar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.564,
    "end": 3120.569,
    "text": "It's all also written here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.051,
    "end": 3123.718,
    "text": "So thank you all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.54,
    "end": 3127.93,
    "text": "I hope that you have a great rest of your day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.892,
    "end": 3129.173,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.193,
    "end": 3129.514,
    "text": "Likewise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.554,
    "end": 3130.477,
    "text": "Thank you so much, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.359,
    "end": 3131.459,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.48,
    "end": 3131.74,
    "text": "Peace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.941,
    "end": 3132.743,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]