[
  {
    "start": 6.511,
    "end": 36.45,
    "text": " hello and welcome it is april 29th 2024 we're an active guest stream 82.1 with robert warden discussing bayesian model-based cognition the requirement equation thank you robert to you for introduction and jumping into a presentation and discussion thanks for joining hi i'm robert warden and i work theoretical neurobiology group at ucl london",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.92,
    "end": 47.955,
    "text": " I'm going to talk in this live stream about an equation called the requirement equation, which has a lot to do with free energy principle and active inference, but it's not the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.995,
    "end": 60.212,
    "text": "And I hope this is the first of a series of live streams talking about how we apply these ideas to 3D spatial cognition, particularly and eventually to consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.573,
    "end": 65.88,
    "text": "But to get on with this presentation, here's a summary of the key ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.637,
    "end": 74.929,
    "text": " The main idea of this requirement equation is to ask, not ask what brains have to do, not ask how they do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.67,
    "end": 82.961,
    "text": "And so this approach is different from the free energy principle and active inference, but I believe it complements it in a way I'll try to explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 84.002,
    "end": 92.094,
    "text": "So as a statement of what brains have to do, there is this requirement equation, which is a mathematical equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.136,
    "end": 95.479,
    "text": "Essentially, brains need to compute it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.151,
    "end": 102.54,
    "text": " or to give the same answer as if they'd computed it to give the greatest possible fitness to their owners.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.241,
    "end": 106.926,
    "text": "So that's, it's a statement of what brains need to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.986,
    "end": 109.088,
    "text": "And it's not a statement of how they need to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.289,
    "end": 113.594,
    "text": "It doesn't say anything about neurons or pre-energy minimization or anything like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 113.635,
    "end": 118.121,
    "text": "It simply says to get as fit as possible, a brain has to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.842,
    "end": 120.344,
    "text": "And I'll describe what this is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.485,
    "end": 124.369,
    "text": "And it turns out this requirement equation is like Bayes' theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 124.389,
    "end": 125.871,
    "text": "It's very similar to Bayes' theorem,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.104,
    "end": 127.506,
    "text": " but it has some extra terms in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.028,
    "end": 129.829,
    "text": "And you'll see that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.109,
    "end": 138.22,
    "text": "And because it's the fittest possible brain, brains have to evolve towards the requirement equation, towards doing that thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.422,
    "end": 145.03,
    "text": "And the trouble is the requirement equation itself is too expensive to compute and brains don't compute it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 145.931,
    "end": 152.82,
    "text": "So animals don't compute it, but they have to produce very similar results to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.425,
    "end": 155.768,
    "text": " But we can compute the requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 155.808,
    "end": 157.589,
    "text": "We can compute it by brute force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.23,
    "end": 160.893,
    "text": "And this makes no assumptions about how brains do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.754,
    "end": 164.157,
    "text": "And so that gives the best possible fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.617,
    "end": 169.843,
    "text": "That's a kind of yardstick against which you can calibrate any model of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.344,
    "end": 176.61,
    "text": "And particularly, you can use it to calibrate and test free FEP and active inference models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 177.531,
    "end": 181.275,
    "text": "And I will put the viewpoint that they are really approximations to this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.856,
    "end": 183.077,
    "text": "And so we can test",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.53,
    "end": 209.79,
    "text": " active inference models by comparing their results with the requirement equation results so the first part of this talk is to derive this equation and show you how it works the second part of the talk is to show how it can be used to test and calibrate active inference models and the third part of in point six is just a few remarks about internal bayesian models okay so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.12,
    "end": 217.108,
    "text": " To start, how do we characterize what a brain does without making assumptions about how it does it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 217.889,
    "end": 226.76,
    "text": "And the first characterization is a black box that takes sense data as an input and produces choices of actions as its output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.84,
    "end": 229.103,
    "text": "So that's all a brain does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.704,
    "end": 236.993,
    "text": "It takes a set of sense data, D, which can include vision, touch, all sorts of stuff, and then it chooses an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.12,
    "end": 241.183,
    "text": " Now, we want to go a little beyond that black box model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.345,
    "end": 246.689,
    "text": "And we're going to what I call a grey box model, shown in the lower diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 247.59,
    "end": 252.556,
    "text": "And what happens is this, the brain examines, it has a set of possible actions, AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.216,
    "end": 254.838,
    "text": "I is one, two, three, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.459,
    "end": 266.811,
    "text": "Now, for each of those possible actions, it calculates some real function, f of d and a. And that real function depends on both the sense data and the action it's going to choose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.128,
    "end": 271.436,
    "text": " So F is a kind of expected payoff for that action in these circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.418,
    "end": 274.642,
    "text": "And then the brain compares all the possible Fs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.403,
    "end": 277.588,
    "text": "So here we are on the bottom left diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.209,
    "end": 286.043,
    "text": "It's computing a bunch of different Fs in parallel, and then it puts them all to a comparison, and it picks the biggest one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.083,
    "end": 290.672,
    "text": "It picks the best possible payoff from any action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.85,
    "end": 293.993,
    "text": " And so this is the gray box model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.073,
    "end": 300.561,
    "text": "It's assuming the brain looks at all the alternatives and chooses the best one, but it doesn't assume anything more than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.622,
    "end": 304.507,
    "text": "It doesn't assume how it computes the Fs or what the Fs are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.348,
    "end": 308.712,
    "text": "It just assumes that it compares them all and picks the best one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.834,
    "end": 313.318,
    "text": "So that's kind of minimal set of assumptions about how a brain works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.5,
    "end": 319.326,
    "text": "Now we'll go on to put that set of assumptions inside",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.048,
    "end": 349.228,
    "text": " a real life situation where we've got probabilities and this comes in the next diagram this is a kind of meta model of how brains work life for an animal is divided with a number of different domains where it has different kinds of decisions to make and it has encounters in each domain and we're show here a picture of one encounter in one domain so we start on the left there is s which is state of affairs that's a state of the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.951,
    "end": 359.359,
    "text": " and it has a certain probability, a prior probability p of s. And the animal doesn't know what that state is, of course, but the state gives rise to sense data in the animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.26,
    "end": 366.846,
    "text": "So these two arrows here show sense data about the external world and sense data about the animal's internal state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 367.327,
    "end": 378.777,
    "text": "So the animal has some sense state of d, which it receives with a conditional probability for any given state s, it gets sense data d with a conditional probability p of d given s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.297,
    "end": 389.591,
    "text": " Then it has a decision function f that I talked about in the previous slide, and it computes f of d and a for all the possible a's it might think of doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.332,
    "end": 401.608,
    "text": "And then it chooses one of the actions a. And what happens when it chooses an action is the action a and the previous state s lead to a next state, which are called s prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.175,
    "end": 412.484,
    "text": " And so that comes about with a certain conditional probability, again, P of S prime given S and A. And that next state has a certain value to the animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.827,
    "end": 418.01,
    "text": "And that value relates in some way to its lifetime fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.971,
    "end": 422.615,
    "text": "And so that's, in principle, the computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 423.335,
    "end": 429.281,
    "text": "And the assumption is that brains act as if they've computed F of DA to choose their actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.442,
    "end": 432.945,
    "text": "And this as if will turn out to be very important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.516,
    "end": 459.321,
    "text": " so how do we use these probabilities in terms of an actual situation the mean payoff an animal has loads of different encounters in its life and the mean payoff is just given by this expression and so w is the average over all the states of affairs it's going to encounter weighted by their probabilities and then each state of affairs gives some sensitive d",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.689,
    "end": 463.716,
    "text": " with a certain probability, so it gets all the possible sense data that it might have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.317,
    "end": 481.187,
    "text": "Then it makes a decision, chooses an action A of D, and that produces a new state, S prime, with a probability P of S prime, given S and A of D. And there's a value for the new state, value for the animal of a new state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.267,
    "end": 484.633,
    "text": "For instance, if it's dead, the value is zero, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.086,
    "end": 489.855,
    "text": " So this is just a straight application of probabilities to the previous diagram, and you get that formula.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.037,
    "end": 495.606,
    "text": "And then you just rearrange the formula slightly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.646,
    "end": 502.499,
    "text": "What you do is you shove this first term, PS, inside the second term, and then you write it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 503.22,
    "end": 504.242,
    "text": "W is the sum of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.458,
    "end": 507.842,
    "text": " functions j of d, and j of d is this thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.882,
    "end": 510.765,
    "text": "And it's already beginning to look very like Bayes' theorem, you can see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.785,
    "end": 512.487,
    "text": "But it's got some extra stuff at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.527,
    "end": 515.63,
    "text": "It's got these values stuck in at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.871,
    "end": 522.938,
    "text": "So that is the first step towards this requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.719,
    "end": 529.825,
    "text": "And to understand how it's used, what I'm going to do is to choose a very simple example of an animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.885,
    "end": 560.588,
    "text": " um a simple special case and the simple special case come out here is an animal that has only two actions and i think you can imagine something like a clam living in the sea it has two actions it can open up and try and eat consume food or it can shut down it can clam up and so those two actions are called action one and action two and this simple animal has very little sense stage it only has one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.973,
    "end": 589.14,
    "text": " piece of sense data it can say detect the salinity of the water or the temperature of the water and that thing it can detect with its sense data has values between naught and one and now we consider various kinds of this simple animal firstly we consider two no-brainer animals a no-brainer is an animal that doesn't use its sense data and just makes the same choice of actions the whole time and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.803,
    "end": 603.234,
    "text": " The animal that is open all the time, it gets value H1 of D, and depending on D, it gets a payoff, positive, less positive, more positive, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.556,
    "end": 619.971,
    "text": "An animal that stays closed all the time gets a payoff H2 of G. And so you can see that for each of these two no-brain animals, the average payoff is just the integral of P of D times H of D",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.592,
    "end": 622.093,
    "text": " over this interval 0 to 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.233,
    "end": 626.817,
    "text": "So that's the payoff for a no-brainy animal is either W1 or W2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.379,
    "end": 635.044,
    "text": "But an animal can do better than that if it uses its sense data to choose which action to take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.905,
    "end": 648.336,
    "text": "So a brainy animal can choose the correct H that gives a bigger payoff in terms of any sense data D. So a brainy animal can ride the top of this curve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 648.356,
    "end": 649.857,
    "text": "It can go down here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.972,
    "end": 653.738,
    "text": " along the green curve, along the red curve, and finally along the green curve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.159,
    "end": 662.392,
    "text": "Now that gives the greatest possible payoff, the greatest possible average payoff in all situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.452,
    "end": 664.755,
    "text": "So it's the greatest possible fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.238,
    "end": 672.688,
    "text": "So a brainy animal that can compute these two functions, H1 and H2, and can always choose the largest one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.158,
    "end": 700.684,
    "text": " is going to get the best possible fitness and if it gets it wrong if it's got some inaccuracy in the way it commutes h1 or h2 so these overlap points move around a little it gets less average fitness uh productly away from that best point so that's what happens in a very simple case where you've got two actions and one real piece of sense data now we're going to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.153,
    "end": 706.758,
    "text": " generalize back again, and you can see what kind of decision function this simple animal's got to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.179,
    "end": 716.347,
    "text": "The decision function it's got to calculate is basically the average fitness, and that gives it the greatest possible fitness over all situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.988,
    "end": 722.133,
    "text": "So if we generalize away from this to the more general case, can you see all that slide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.153,
    "end": 723.194,
    "text": "I hope you can, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.835,
    "end": 730.08,
    "text": "So we generalize this case to when the animal's got more choices of action, say five actions or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.203,
    "end": 734.986,
    "text": " more sense data, different dimensions of sense data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.747,
    "end": 743.956,
    "text": "And you can see when you generalize away from the simple case to the general case that the best possible decision function is given by this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.957,
    "end": 757.992,
    "text": "The decision function f is the sum over all states of the probability of the state weighted by the post theory of probability and the sum over all final states of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.512,
    "end": 762.217,
    "text": " probability of the final state weighted by the value of that final state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.257,
    "end": 764.76,
    "text": "And we could simplify that by this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.8,
    "end": 773.371,
    "text": "But that equation is basically a definition which doesn't say anything about what happens inside a brain, how it computes it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.451,
    "end": 782.382,
    "text": "It says if a brain chooses the same actions as if it had worked out these equations, it gets the best possible fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 783.283,
    "end": 786.207,
    "text": "So the requirement equation, which is here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.322,
    "end": 788.405,
    "text": " says what brains are required to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.445,
    "end": 794.273,
    "text": "And any brain which chooses actions as if it had done all this has the best possible fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.994,
    "end": 804.468,
    "text": "So that means that brains will evolve to choose actions as if they computed this equation, which you can see is very like Bayes' theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.429,
    "end": 809.275,
    "text": "And so that's the first result that comes out of this work is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.014,
    "end": 816.944,
    "text": " The Bayesian cognition, the assumption that animals use Bayesian cognition is not really a hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.024,
    "end": 821.83,
    "text": "I believe Carl Friston has said and has been quoted as saying that it is a hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.451,
    "end": 825.115,
    "text": "This result implies it is not really a hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.175,
    "end": 831.303,
    "text": "It follows from a piece of analysis that makes no assumptions about how brains do what they do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.226,
    "end": 839.835,
    "text": "So I should say this derivation of the requirement equation has some similarities to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.187,
    "end": 845.755,
    "text": " partially observable Markov decision processes and some differences, and you'll have to look at the paper to find out those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.315,
    "end": 857.811,
    "text": "So that, if you like, is the end of the first part of the talk, which is deriving this equation and saying that is a way of analysing what any brain is needed to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.851,
    "end": 860.975,
    "text": "The second part of the talk is how you use this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.998,
    "end": 868.405,
    "text": "So all terms that you put in the requirement equation, all those probabilities,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.785,
    "end": 871.907,
    "text": " depend on things happening outside the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 871.927,
    "end": 874.89,
    "text": "They depend on states of affairs in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.33,
    "end": 876.772,
    "text": "They depend on sense data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.312,
    "end": 882.578,
    "text": "They depend on what's the payoff, what happens to the animal after it takes various actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.058,
    "end": 884.84,
    "text": "So it's all external biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.061,
    "end": 889.725,
    "text": "And you don't have to make assumptions about what's going on in the brain to compute it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.545,
    "end": 892.908,
    "text": "And that, I think, is a big advantage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.229,
    "end": 898.273,
    "text": "Now we can write down the requirement equation in lots of different domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.709,
    "end": 906.017,
    "text": " And to do that, we have to model biology, which we can observe directly, rather than modeling brains, which we can't observe very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.219,
    "end": 910.963,
    "text": "The trouble is, computing this requirement equation is very expensive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.043,
    "end": 912.725,
    "text": "It's expensive in four different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.586,
    "end": 924.278,
    "text": "Because to really compute it, you have to sum over all possible states S, you have to do the parallel computation over all possible actions A,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 925.405,
    "end": 928.608,
    "text": " you have to sum over all possible subsequent states S prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 929.109,
    "end": 933.413,
    "text": "And in some domains you have to compute the value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.433,
    "end": 937.157,
    "text": "You have to have branching look ahead to different future situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 937.878,
    "end": 942.983,
    "text": "So it's very expensive and it's not tractable in animal brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.644,
    "end": 946.827,
    "text": "It will be too slow to try, too expensive to compute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.448,
    "end": 950.13,
    "text": "So animal brains don't compute this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.19,
    "end": 952.813,
    "text": "They do much cheaper as if calculations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.519,
    "end": 955.842,
    "text": " Now, having said that, animals don't compute it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.922,
    "end": 966.897,
    "text": "We can compute it because we have digital computers and we can do the Monte Carlo integrations and we do the optimizations and so on to do all of this by brute force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.578,
    "end": 970.662,
    "text": "And that's what I will call brute force Bayesian computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.165,
    "end": 975.509,
    "text": "And that we can compute it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 975.689,
    "end": 979.594,
    "text": "It acts as a kind of yardstick, which we can use to compare.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.869,
    "end": 990.405,
    "text": " how well they compute their choices of action and any cognitive model, including models built in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.608,
    "end": 999.262,
    "text": "So that I'll skip over this slide just to say you can apply this equation in all sorts of domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.924,
    "end": 1000.926,
    "text": "Skip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.946,
    "end": 1001.246,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.888,
    "end": 1004.232,
    "text": "So coming on to active inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1006.54,
    "end": 1013.671,
    "text": " FEP and AI models are not like the requirement equation in that they do make assumptions about what happens in brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.071,
    "end": 1023.385,
    "text": "They assume there's a generative model, which is a simplified version of the actual generative process, some simplification that the animal uses in its brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.141,
    "end": 1025.963,
    "text": " They use variational model fitting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1026.003,
    "end": 1036.075,
    "text": "They minimize a variational free energy, minimize a KL divergence between that and minimizing a KL divergence is the process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.076,
    "end": 1045.986,
    "text": "And they have a certain model of the fitness payoffs of actions, and they are represented as bias prior probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.566,
    "end": 1048.949,
    "text": "And the animal has a goal to minimize its .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.271,
    "end": 1052.393,
    "text": "And an active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.065,
    "end": 1064.18,
    "text": " It predicts how animals make the trade-off between exploration, trying to get sense data to help better future decisions, and exploitation here and now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.961,
    "end": 1069.888,
    "text": "So there's a whole load of assumptions in there which are different from the requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.87,
    "end": 1078.76,
    "text": "And so for any FEP or active inference model, we can test those assumptions against the requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.78,
    "end": 1081.384,
    "text": "And this procedure to do that is here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.225,
    "end": 1089.78,
    "text": " You first compute the FEP-AR model, which you've been doing already anyway, and you define the equivalent requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.521,
    "end": 1096.453,
    "text": "And so you make biological assumptions about the states in the environment, about the sense data, about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.72,
    "end": 1098.623,
    "text": " consequences of actions and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.124,
    "end": 1100.907,
    "text": "And then you compute the requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.948,
    "end": 1105.235,
    "text": "And that, as I said, you can do by brute force integration and optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.996,
    "end": 1110.745,
    "text": "And then you compare the two sets of results, requirement equation and FEP results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.386,
    "end": 1113.85,
    "text": "You compare them in terms of the lifetime fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.311,
    "end": 1117.317,
    "text": "How many encounters of this kind does an animal have in its lifetime?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.898,
    "end": 1120.382,
    "text": "How much does the fitness vary between the two?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.476,
    "end": 1128.604,
    "text": " And you get a fitness gap between the requirement equation and the FEP result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.325,
    "end": 1133.57,
    "text": "And the requirement equation is in some sense bound to come out fitter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.591,
    "end": 1135.732,
    "text": "And so there'll be a gap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1136.333,
    "end": 1144.863,
    "text": "And if that gap is significant, even a very small gap, 1%, natural selection will have improved on the FEP model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.983,
    "end": 1149.728,
    "text": "In other words, if there's a 1% difference in fitness between two animals,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.079,
    "end": 1154.784,
    "text": " In a hundred generations, the fitter animal will come to dominate the population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.025,
    "end": 1160.81,
    "text": "And based on that, you can use, you can refine the FEP model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.83,
    "end": 1166.496,
    "text": "In other words, you can ask questions like, what's the sense data which makes the largest fitness gap?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.616,
    "end": 1172.923,
    "text": "What can we do to get the FEP model better for those kinds of sense data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1173.744,
    "end": 1177.588,
    "text": "So I'll illustrate this process here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.935,
    "end": 1184.043,
    "text": " Some animal has a lifetime fitness, which you measure percentages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.804,
    "end": 1187.368,
    "text": "We compute what that is in the requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.388,
    "end": 1188.55,
    "text": "So that's that point there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.01,
    "end": 1193.337,
    "text": "We also compute what it is in the FEP, and those are different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.739,
    "end": 1201.93,
    "text": "And we can also, by the way, look at no-brainer animals, which just make the same stupid decision every time, or real animals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.691,
    "end": 1207.879,
    "text": "All four points on this graph can be computed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.348,
    "end": 1213.714,
    "text": " And the interesting comparison is here between FEP active inference and the requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.275,
    "end": 1219.682,
    "text": "So the question we're asking is how close is the FEP model to the optimum?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.143,
    "end": 1230.314,
    "text": "And what is the gap between the two and what difference is that going to make over, say, 100 generations of natural selection?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.175,
    "end": 1234.339,
    "text": "Now, I think this comparing with the requirement equation is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.741,
    "end": 1258.639,
    "text": " very useful thing to do for an FEP and AI models because it's a win-win test if the model comes very close to the optimum then you've confirmed it you can't do better than that but if it's not very close you can work out how to improve it you work out what sense data is not doing so well for how to make it do better for those sense data right um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.745,
    "end": 1267.595,
    "text": " Now we come on to the third part of the talk and the headline is that brains are not always Bayesian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.755,
    "end": 1274.905,
    "text": "I know it has been stated as an assumption that brains are Bayesian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.466,
    "end": 1283.978,
    "text": "The requirement equation tells you exactly what are the circumstances under which they are Bayesian and under what circumstances they don't need to be Bayesian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.24,
    "end": 1289.706,
    "text": "And it turns out that in complex domains where there are complicated choices of actions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.091,
    "end": 1292.334,
    "text": " the brain needs to build an internal model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.514,
    "end": 1301.545,
    "text": "And the two most complex domains in that respect are two-dimensional navigation, finding a way around, and 3D spatial cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.786,
    "end": 1313.118,
    "text": "And there's always been a kind of debate between in modeling people and in activist people who say the brain just reacts to events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1313.939,
    "end": 1317.043,
    "text": "You can prove this way that in complex domains,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.682,
    "end": 1323.57,
    "text": " And an activist brain may do a job, but it doesn't do as good a job as a brain that makes an internal model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.551,
    "end": 1332.022,
    "text": "And so you can prove in certain domains, mainly the complicated ones, that you need to build internal models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.843,
    "end": 1334.986,
    "text": "You can't prove that in all domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.547,
    "end": 1337.81,
    "text": "In simple domains, models aren't needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.751,
    "end": 1345.14,
    "text": "And these are domains in which there are very few choices of action or very simple states or simple sense data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.001,
    "end": 1347.503,
    "text": "And in these simple domains,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.803,
    "end": 1353.471,
    "text": " The as-if computation can be very simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.651,
    "end": 1361.002,
    "text": "It can just be a matter of some very simple neural relay and no internal model is needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.022,
    "end": 1366.97,
    "text": "And an example of that is the special case that I used to motivate the requirements equation where you've only got two possible actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.272,
    "end": 1371.276,
    "text": "You don't have to build a complete internal model of what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.717,
    "end": 1376.123,
    "text": "You simply have to know the thresholds at which you switch from one action to the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.217,
    "end": 1380.641,
    "text": " And this can be seen in terms of information capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.942,
    "end": 1388.188,
    "text": "What comes into the brain is some Bayesian priors, which have made it evolve, and some sense data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.089,
    "end": 1393.634,
    "text": "And it makes an internal model, or may or may not make an internal model, and then it chooses actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.395,
    "end": 1404.986,
    "text": "Now, if the choice of action is very small, it's a very small information content, then it doesn't need to make a big complicated internal model in order to make that simple choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.006,
    "end": 1407.088,
    "text": "So the information in the internal model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.452,
    "end": 1411.997,
    "text": " needs to be less than the information in the choice of actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.637,
    "end": 1420.087,
    "text": "And if the choice of actions is very simple, small information content, there is no point in constructing a very complicated internal model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.708,
    "end": 1422.23,
    "text": "It's a waste of effort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.672,
    "end": 1437.43,
    "text": "So if you regard the brain's internal models as an informational channel between sense state and actions, then you can see the information model is very necessary in complex domains, but not so necessary in simple domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.304,
    "end": 1446.714,
    "text": " Now, as a further comment on this, I say you should not trust the good regulator theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.754,
    "end": 1455.365,
    "text": "Now, in FEP literature, the good regulator theorem is often cited as support for the idea that brains need internal models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.286,
    "end": 1459.37,
    "text": "I'll just very briefly say I don't believe it does give them support.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.191,
    "end": 1467.94,
    "text": "When you compare it with the requirement metamodel and the good regulator theorem, which was a paper in 1970 by Conant and Ashby,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.308,
    "end": 1472.153,
    "text": " That has a couple of different metamodels of what cognition is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.394,
    "end": 1477.899,
    "text": "And it's based on Ashby's ideas of homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.919,
    "end": 1486.429,
    "text": "But I think the argument they make, Conan and Ashby make from the good regulator theorem, I don't think it really holds up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.449,
    "end": 1488.352,
    "text": "And I've just listed the reasons here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1488.412,
    "end": 1494.619,
    "text": "There's the good regulator result that every good regulator of the system is a model of that system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.937,
    "end": 1521.99,
    "text": " here's the requirement equation result in complex domains only the fittest brains computer model of the domain now the regular later model i'll assert is not a realistic model it lacks some key ingredient and it's less realistic it assumes a homeostatic picture of a brain whereas the requirement equation analysis is much more flexible and realistic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.797,
    "end": 1532.271,
    "text": " But mainly this fourth point, the regulator concept of a model is not a graduated, it's a yes, no, all or nothing concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.393,
    "end": 1545.15,
    "text": "And what it says is a model, how they define a model, you can have any function of the system variables can be a model of the system, even a very trivial function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.472,
    "end": 1550.037,
    "text": "And so the concept of a model they use is a binary yes, no concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.472,
    "end": 1555.44,
    "text": " But the real meaning of model in everyday life and in science is a graduated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.48,
    "end": 1562.371,
    "text": "In other words, the more complicated, the more detail there is in a model, the more it counts as a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.391,
    "end": 1566.979,
    "text": "So this is just my personal beef.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.079,
    "end": 1572.868,
    "text": "You should not be using the good regulator theorem to justify internal models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.802,
    "end": 1589.815,
    "text": " Few remarks about how brains evolve because obviously this analysis depends totally on the idea that the requirement equation defines the fittest possible brain and brains evolve towards that optimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.016,
    "end": 1604.509,
    "text": "And as I said, even a small deficit in lifetime fitness, even a 1% deficit in lifetime fitness, over 100 generations, that gives enough selection pressure to make something start dominating the population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.333,
    "end": 1610.86,
    "text": " But if the properties in the habitat change rapidly, brains can't catch up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.98,
    "end": 1614.044,
    "text": "They only evolve very slowly by random mutations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.065,
    "end": 1623.775,
    "text": "And therefore, if the properties in the habitat are changing, brains need to learn and they need to learn fast within a short animal lifetime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.957,
    "end": 1629.282,
    "text": "And you can actually apply this requirement equation analysis to learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.7,
    "end": 1636.527,
    "text": " And animal learning, it turns out, is very close to the kind of learning you get out of the requirement equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1638.309,
    "end": 1646.598,
    "text": "On the other hand, if probabilities in the habitat stay constant for a very long time, brains can evolve to come very close to the optimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.499,
    "end": 1653.666,
    "text": "And the key place where this is the case is spatial cognition, 3D spatial cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.945,
    "end": 1659.011,
    "text": " where the states of the world have to obey some very strong constraints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1659.131,
    "end": 1662.916,
    "text": "They have to obey Euclidean geometry and they obey constraints of physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.196,
    "end": 1667.542,
    "text": "And these constraints have been true for all evolutionary time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.103,
    "end": 1672.269,
    "text": "So animal brains have evolved to embody those constraints very precisely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.891,
    "end": 1678.718,
    "text": "A final point is that animals we know have very precise and sensitive sense organs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.399,
    "end": 1684.125,
    "text": "They would not have evolved if the brain couldn't make the very best use of the data from them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.029,
    "end": 1688.316,
    "text": " So here's a plug for the next live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1688.356,
    "end": 1692.669,
    "text": "The next live stream is applying these ideas to 3D spatial cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.535,
    "end": 1700.713,
    "text": "Understanding three-dimensional local space is actually the most important thing a brain can do because it has very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.807,
    "end": 1729.502,
    "text": " huge impact on survival because it's a 3d model of local space is used to control physical movements at every moment in the day and if the model is has inaccurate mistakes in movement can cost the animal his life any time and they're also used for recognizing things in action so the selection pressure to get the internal model of 3d space good has been very strong and sustained",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.887,
    "end": 1736.233,
    "text": " over 500 million years since the Cambrian explosion when animals first had limbs and precise sense data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.215,
    "end": 1740.417,
    "text": "Even insects control their movements very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.959,
    "end": 1748.405,
    "text": "And consciousness shows that our own internal human internal model of space is a good precise model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.485,
    "end": 1752.469,
    "text": "So the 3D model of space is a very good model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.85,
    "end": 1757.734,
    "text": "And what this next live stream is going to talk about is how you build that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.068,
    "end": 1761.653,
    "text": " how you build neural models of 3D local space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.394,
    "end": 1765.718,
    "text": "Now, people have, there have been very few attempts to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.798,
    "end": 1774.691,
    "text": "There are no working neural models of 3D spatial cognition that I know about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.452,
    "end": 1777.114,
    "text": "One of the reasons is the architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.635,
    "end": 1781.68,
    "text": "How do you, what's the neural architecture to represent three dimensions of space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.824,
    "end": 1788.551,
    "text": " Neural sheets can represent two-dimensional space, but there's no equivalent architecture for 3D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.174,
    "end": 1793.157,
    "text": "And the key problem is neural spatial memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.177,
    "end": 1801.909,
    "text": "If you represent spatial coordinates by neuron firing rates, it turns out that that memory is too imprecise and too slow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.969,
    "end": 1809.118,
    "text": "Insects, for instance, have a tiny fraction of a second to work out what their surroundings are like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.368,
    "end": 1816.899,
    "text": " And in that space of time, you can't get precise representation of 3D space using neuron firing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.64,
    "end": 1829.016,
    "text": "So in the next live stream, I will introduce the proposal that 3D space is not represented by neuron firing at all, but it's represented by a wave in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1829.977,
    "end": 1834.684,
    "text": "And that wave is actually a projective transform of 3D space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.457,
    "end": 1844.369,
    "text": " And that's the same transform was used in the projective consciousness model, PCM, which is an FEP-derived model of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.869,
    "end": 1848.134,
    "text": "So that's the commercial for the next live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.875,
    "end": 1854.041,
    "text": "Just to summarize on this live stream, gosh, I've been quick, 30 minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.283,
    "end": 1857.125,
    "text": "There are two kinds of modeling you can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.185,
    "end": 1859.929,
    "text": "You can model biology or you can model the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.242,
    "end": 1865.427,
    "text": " And modeling biology is a great deal easier because we can observe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.547,
    "end": 1870.854,
    "text": "We can observe easily what's happening to animals in their habitat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.874,
    "end": 1873.638,
    "text": "Whereas modeling what happens inside the brain is more difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.658,
    "end": 1876.361,
    "text": "There's much more hypothesis and guesswork about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1877.182,
    "end": 1887.115,
    "text": "And the requirement equation approach, which I've talked about in this talk, only requires modeling biology, only to model events outside the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.989,
    "end": 1892.213,
    "text": " And you can compute this requirement equation in any domain you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.994,
    "end": 1895.597,
    "text": "And it defines the very best a brain can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.637,
    "end": 1903.586,
    "text": "So it's a kind of yardstick against which you compare actual brains and models of brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.606,
    "end": 1909.011,
    "text": "So you can compare the requirement equation with any active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.592,
    "end": 1914.317,
    "text": "And that I say is a win-win for the model, because if the model comes close to the optimum,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.77,
    "end": 1917.774,
    "text": " then you've confirmed it, but it doesn't come close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.275,
    "end": 1921.539,
    "text": "You can use what you learn to work out how to improve it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.24,
    "end": 1928.208,
    "text": "And I would offer to work with anybody who wants to make that kind of comparison with their active inference models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.41,
    "end": 1929.791,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.971,
    "end": 1931.893,
    "text": "So I finished rather ahead of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.458,
    "end": 1935.959,
    "text": "Questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.541,
    "end": 1938.262,
    "text": "Thank you, Robert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.366,
    "end": 1941.807,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.221,
    "end": 1967.71,
    "text": " you for the presentation there's a lot to discuss and also people can write questions in live chat while i'm just like re-cropping everything um do you want to give any like context how did you come to study this question and how did you get to this equation and why um i got this equation about 25 years ago actually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.263,
    "end": 1994.389,
    "text": " um and i came back to it when i joined carl's group and got interested in the requirement in fep and so on and i realized there was a link between it and and fep and active inference and i've just been working recently to work out what the link is and this is what i think the link is um but i think it's a very basic foundation for studying the brain is to not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.74,
    "end": 2008.699,
    "text": " make hypotheses about what is how brains do what they do but to just analyze what they have to do and i think this is quite a powerful approach in all sorts of domains hope to convert one to other people to it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.607,
    "end": 2032.037,
    "text": " yeah okay well questions are kind of coming in i'll go over a few of my notes just to go over some of these core pieces because i think there's a lot lot to say and it's really exciting um in quantitative evolutionary population biology fitness is conceived of as like a top-down force",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.017,
    "end": 2059.611,
    "text": " whereas the generative model is built up as like an agent level view from the inside like agent-based modeling with kind of a top-down pressure and that's one way to look at that kind of setting and I got the sense that I want to explore and learn more about that the requirements equation sits basically between those two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.591,
    "end": 2087.742,
    "text": " and sets the high bar that gives a requirements for the agent-based model because you can always just build an agent-based model and have a constraining force we know from simulations that that all does give um improvement of algorithms uh in simulations but it's kind of an open-ended search and there isn't necessarily a calibration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.257,
    "end": 2116.564,
    "text": " do you think about this is a calibration if if you are prepared to analyze an animal's lifetime in terms of a number of different encounters like each time it goes out to get food or each time it meets a potential mate or each time it comes across a predator and say what's its probability of surviving all those encounters then you can start doing the requirement equation analysis and you can find",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.422,
    "end": 2119.765,
    "text": " In principle, you can find the very best it can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.785,
    "end": 2122.087,
    "text": "And that is an endpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.167,
    "end": 2130.957,
    "text": "If you've got your FEP model and you're improving it, improving it, this is a kind of endpoint beyond which you don't expect to get, but you know when you're getting near.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.56,
    "end": 2133.92,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.06,
    "end": 2137.304,
    "text": "And here's one other kind of angle that I was noting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.965,
    "end": 2141.168,
    "text": "So the standalone Bayes equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.076,
    "end": 2147.604,
    "text": " Bayes with no additional terms is like this unified imperative for sensemaking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.285,
    "end": 2152.832,
    "text": "It can cover discrete or continuous state spaces, single dimension, multiple dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.932,
    "end": 2163.848,
    "text": "There's even considerations for like how many parameters should be Bayes optimal, but it's all framed in terms of this unified sensemaking imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.828,
    "end": 2189.616,
    "text": " requirements equation and and so then one of the key steps in active inference is to expand that unified bayesian imperative to not just the sense making but include action like a variational autoencoder with action the requirements equation says well it's a little bit more over the lifespan than just optimal sense making about sense and action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.187,
    "end": 2219.097,
    "text": " action but not sense making has fitness or survival consequences so then there's another term that applies to only actions because there's a direct fitness consequence of actions and phenotypes whereas the internal sense making is actually shielded from direct selection because it has no consequence except through the actions in the black or the gray box",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.608,
    "end": 2234.468,
    "text": " Yeah, I mean, I think active inference is a particular way of making the trade-off between, I mean, the way I understand it, it's a bit simple, the trade-off between exploration and exploitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.508,
    "end": 2240.798,
    "text": "In other words, do I fly higher so I can see more prey or do I go down and actually catch that bit of prey?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.719,
    "end": 2248.83,
    "text": "And the requirement equation can encompass that because the value that an animal gets from an action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.857,
    "end": 2258.135,
    "text": " It can be direct exploitation that gets a piece of food, or it can be exploration that it learns something that it can use downstream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2258.736,
    "end": 2262.104,
    "text": "So that kind of trade-off is made in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.585,
    "end": 2269.62,
    "text": "There is also the apparatus in the requirement equation of making the same trade-off and seeing if you get the same answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.633,
    "end": 2296.266,
    "text": " just one last framing and then i'll go to the live chat questions just at the purely empirical even just putting aside the evolutionary setting it's a common theme to make a model and then do a variance partitioning on the residual and find if it's loaded or associated with anything so when we're studying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.246,
    "end": 2303.578,
    "text": " bird migration and empirically 80% survive some stage, and then we're making an agent-based model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.798,
    "end": 2312.773,
    "text": "Well, we don't want a model where 100% of them survive because we've kind of overshot how successful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.474,
    "end": 2322.068,
    "text": "So then the empirical path could be like, okay, we just made a simple version and 50% of the simulated birds make the migration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.128,
    "end": 2324.93,
    "text": " How is that correlated with the actual?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.351,
    "end": 2327.353,
    "text": "And then how is what's left in the residual?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.533,
    "end": 2329.336,
    "text": "Oh, it's associated with age.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.876,
    "end": 2332.179,
    "text": "Okay, now we include age as a factor in the agent-based model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.199,
    "end": 2333.721,
    "text": "That eats up some of that variance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.382,
    "end": 2338.907,
    "text": "How is the remaining variance associated with known or unknown factors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.608,
    "end": 2349.54,
    "text": "And so there's an iterative process where you can discover potentially associated variables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.655,
    "end": 2376.388,
    "text": " and have that in feedback with the agent-based constructions like the agent responds to the requirements as modeled and then it looks like they're doing something else that's required that you don't have in your requirements equation so then but it sets a kind of local calibrator again to what kind of performance envelope could even be expected or relevant so that you don't have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.448,
    "end": 2402.14,
    "text": " in silico experiments where like bacteria are trying to read a book and a person is trying to do a metabolic thing that they can't do it doesn't make sense we all have a feeling like well that's not the niche it's not what they are being selected on for and so this again helps put an adapter in between the kind of bulk properties of the niche and then the specific performance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.407,
    "end": 2426.22,
    "text": " that gets all the way down to thinking like you mentioned about like the survival through time as being like the joint distribution of many many many many many encounters yeah I mean I I agree with all that I I think the requirement equation can be used to do those kinds of analysis when when you when you formulate it you're really looking at lifetime Fitness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2426.96,
    "end": 2436.073,
    "text": " And so you should be looking at all the things that influence lifetime fitness, including things that are nothing to do with brains at all, as you say, old age or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.794,
    "end": 2453.457,
    "text": "But nevertheless, the requirement equation, it gives you, I think, starting just from FEP models and AI models, you have the model on the one hand and practical observation of animals on the other hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.943,
    "end": 2455.425,
    "text": " And you've got nothing in between.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.565,
    "end": 2463.515,
    "text": "But requirement equation is somehow in between them that you can say, here's this requirement for what a brain needs to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.595,
    "end": 2468.221,
    "text": "And if a brain does it absolutely as well as that, then here's the survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.241,
    "end": 2473.808,
    "text": "So you've got a midpoint in the calibration between your brain model and your real life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.551,
    "end": 2477.132,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.209,
    "end": 2505.668,
    "text": " okay i'm gonna go to read some questions in the chat if whatever you want to say or answer or we'll just however you see okay bert asks is inactivism exclusive to internal representations i always think of it that way and activism is generally the idea that you don't need internal representations you can just sort of do something um and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.103,
    "end": 2507.545,
    "text": " In simple cases, you can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2507.705,
    "end": 2515.633,
    "text": "In that simple clam case, the clam case only has to know what are the three thresholds at which it has to switch over from open to closed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.334,
    "end": 2517.555,
    "text": "That's an activist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.816,
    "end": 2524.063,
    "text": "I think an activist is usually hostile to internal representations, and they are in opposition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.824,
    "end": 2532.752,
    "text": "And what I'm saying is the requirement equation tells you which circumstances one is right and which circumstances the other is right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.483,
    "end": 2560.512,
    "text": " awesome one other free energy principle paper that this reminded me of it and I'll go back to the live chats was by yellow Brunberg in and others in 2018 the anticipating brain is not a scientist the free energy principle from an ecological inactive perspective which discusses it's kind of like the good scientist and the good engineer like it's not just the pure sense making imperative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.183,
    "end": 2562.626,
    "text": " when action is considered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.767,
    "end": 2576.577,
    "text": "It's not just about accuracy and action because actions have consequences in a way that the sense-making component doesn't because the black or the gray box is set up so that the sense-making doesn't have consequences except through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.518,
    "end": 2578.599,
    "text": " That's that partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.1,
    "end": 2594.338,
    "text": "If you explored a model with telepathy, where there was direct consequence for internal states, then it would be basically as if that was an external or an action state, because it would just make those representations external facing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.918,
    "end": 2598.763,
    "text": "So it's like, whichever states aren't external facing are the internal ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.143,
    "end": 2606.412,
    "text": "Whichever ones are external facing, and then those can be under, quote, no selective pressure,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.695,
    "end": 2635.521,
    "text": " they're all that's like a novelty type or just an open diffusion space or it can be under strong selection pressure which just means that there are higher consequences for a certain distribution but that's a distribution that you're actually having the agent's model converge towards and maybe maybe the populations convert maybe the optimal height would be like 15 feet and it just there's so many other trade-offs that that actually the population just continues to push up against five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.075,
    "end": 2642.788,
    "text": " but at least there was a way to say, well, it only got to a third of the value, but that's the highest score is 30%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.808,
    "end": 2643.249,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.471,
    "end": 2647.897,
    "text": "And that sort of approach sounds very congenial to what I'm doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.917,
    "end": 2649.601,
    "text": "I have to read the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.621,
    "end": 2651.805,
    "text": "I'm afraid I haven't read it yet, but I certainly will do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.266,
    "end": 2652.887,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.907,
    "end": 2653.247,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.268,
    "end": 2654.59,
    "text": "Benjamin asks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2655.228,
    "end": 2667.684,
    "text": " How does the amalgamation of Markovian dynamics and Bayesian theory reflect the necessity for brains in complex domains to construct internal models for better adaptation and decision-making?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.648,
    "end": 2675.875,
    "text": "How does the combination of... Markovian dynamics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.836,
    "end": 2677.136,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.578,
    "end": 2683.024,
    "text": "How does how you brought together... Well, I think this equation... Okay, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.848,
    "end": 2709.113,
    "text": " um this equation certainly builds in markovian dynamics i mean the probabilistic model of the state is a markovian model if there are certain state transitions in the world then those are modeled so i um i believe that that's encompassing this approach i don't know the word markovian changes things particularly okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.827,
    "end": 2741.057,
    "text": " benjamin asked another question as the brain has evolved do we know which of these definitions of brain functions are inherent versus emergent and how does this potentially impact their functioning as they evolve collaboratively or independently um there seem to be two questions there can you read it again yes oh we have many amazing um conjugate question askers um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.235,
    "end": 2746.782,
    "text": " How do we know which of the definitions of brain functions are inherent versus emergent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.683,
    "end": 2748.825,
    "text": "I think that's the first part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.845,
    "end": 2750.407,
    "text": "Inherent versus emergent, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.427,
    "end": 2757.317,
    "text": "And then how does that impact their functioning as they evolve potentially collaboratively or independently?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.681,
    "end": 2770.437,
    "text": "Well, the requirement, I've tried to state the requirement in other words, what brains are required to do as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.48,
    "end": 2776.325,
    "text": " in the abstract and making no mention of how they've actually evolved to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.545,
    "end": 2785.595,
    "text": "And that applies to brains at the very beginning of their evolution when they were totally unfit and they gradually got fitter by natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2785.695,
    "end": 2788.138,
    "text": "So inherent versus emergent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.318,
    "end": 2795.706,
    "text": "I mean, what is emergent is brains getting closer and closer to an optimum given by that equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.246,
    "end": 2796.947,
    "text": "The equation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.67,
    "end": 2825.314,
    "text": " doesn't describe how brains are described where brains are evolving towards so that's the first part of the question now the second part of the question was a different contrast which was how does that potentially impact their functioning as they evolve collaboratively or independently now collaboratively or independently there's a huge amount of questions there I mean obviously um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.969,
    "end": 2830.776,
    "text": " social insects, for instance, their brains work collaboratively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.577,
    "end": 2833.32,
    "text": "Is that the distinction we're talking about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.56,
    "end": 2847.32,
    "text": "I mean, again, I think the requirement equation is applicable to social insects that don't have, they're not so concerned about individual survival, they're concerned about survival of the genotype of the hive, if you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.961,
    "end": 2850.264,
    "text": "But I think the equation still applies to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.546,
    "end": 2853.529,
    "text": "But collaboration and competition,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.948,
    "end": 2879.415,
    "text": " are very complicated areas to analyze well definitely especially next time i look forward to going very deep into the insect questions um i'll give some thoughts though i mean to the first half in inherent versus emergence without just saying it depends on how you define it it can be emergent through development that certain functions arise so that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.8,
    "end": 2880.761,
    "text": " That can be both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.382,
    "end": 2882.844,
    "text": "That was the sense of the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.864,
    "end": 2884.527,
    "text": "Was it emergent in a lifetime?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.248,
    "end": 2886.73,
    "text": "I don't know what the sense of the question is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2886.79,
    "end": 2887.992,
    "text": "Maybe I didn't get that right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2888.272,
    "end": 2894.801,
    "text": "Certainly, emergent in a lifetime, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.083,
    "end": 2909.402,
    "text": "Because it's optimizing a lifetime fitness, you have to consider different periods in the lifetime and whether the brain gets fit in adulthood by having learnt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.855,
    "end": 2933.567,
    "text": " along the way or having inherent innate traits is a choice that brains have but as I said the requirement equation can be applied to learning and that's a very interesting application I haven't done talked about it at all here but it can be and there's a result a book from Anderson in 1990",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.087,
    "end": 2948.253,
    "text": " which shows that data on animal conditioning, the sort of rats and pigeons in cages and so on, agrees very well with the Bayesian model, the requirements equation model of what the best possible learning is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.215,
    "end": 2956.348,
    "text": "So that's another domain in which the Bayesian assumptions are confirmed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2960.851,
    "end": 2980.176,
    "text": " interesting this is making me wonder about abiotic constraints and biotic constraints for the requirements equation so maybe one setting is that the external environment of the organism is very harsh like it's a desert ant colony",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.156,
    "end": 2998.418,
    "text": " and so a lot of the selective pressure and the differences amongst colonies like in their persistence or their survival is related to their performance against the environment and there's another setting where maybe the environment is materially abundant but then there's a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.512,
    "end": 3025.823,
    "text": " dynamics like game theory and sexual selection and like these internal so how does the requirements equation I mean if we have to change that as often as the weather changes then what are we really getting by just setting this local requirement which itself could be changing all the time or variable across settings that's a great question I mean in principle the requirement equation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.731,
    "end": 3030.675,
    "text": " takes as its starting point natural selection, not sexual selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.376,
    "end": 3039.764,
    "text": "But sexual selection, as you know, doesn't always make animals fitter, and sometimes makes them less fit, as in the peacock's tail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.745,
    "end": 3050.154,
    "text": "And I've got a whole separate interest in how sexual selection is acted on the human brain, particularly, and in terms of social and sexual competition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.376,
    "end": 3053.818,
    "text": "And that, I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.895,
    "end": 3057.738,
    "text": " The requirement equation is not a result of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.898,
    "end": 3061.582,
    "text": "The requirement equation is what you get after natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.927,
    "end": 3067.829,
    "text": "What do you mean after natural selection?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.75,
    "end": 3078.321,
    "text": "Well, natural selection, you have to have the fittest possible animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.01,
    "end": 3107.599,
    "text": " is one that survives to adulthood with the greatest probability and gets a mate with the greatest probability getting a mate with the greatest probability is not as simple as surviving the greatest probability because it's a competitive activity and you get positive feedback effects for instance as in classic peacock case where female peacocks prefer males with long tails and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.44,
    "end": 3118.293,
    "text": " And so that gets baked into the genotype by a kind of conspiracy between female genes preferring long tails and male genes having long tails.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.235,
    "end": 3122.379,
    "text": "But it's not good for the peacock species in terms of fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.539,
    "end": 3125.944,
    "text": "Male peacocks are less fit because they've got big tails.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.705,
    "end": 3129.569,
    "text": "And you could have similar things like that happening inside the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.25,
    "end": 3136.438,
    "text": "And I have a whole separate set of ideas which I would love to give a talk about sometime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.891,
    "end": 3163.641,
    "text": " that natural that human language is actually a consequence of sexual selection um perhaps we could live stream that sometime but human language hasn't made us more fit in natural habitats there's some controversy for you wow to return to one other potentially interesting um aspect of of benjamin's question there with the second half",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.296,
    "end": 3193.915,
    "text": " collaborative or independent uh challenges so this made me think about how the factorization of the problem to be solved like the sparsity of what depends on what in the problem may be very disjoint from what is connected to what in the organism so that's kind of widely been recognized by like evolutionary constraints or just evolutionary or tray architectures like if there's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.895,
    "end": 3221.438,
    "text": " yeah if there's a covariance in the niche um between two factors and then that is not the case in the organism then there can be like separated movement of those traits or you can have the opposite setting where two things are i mean there's also pieces that are correlated just like having length and volume like having a long body these other things change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.548,
    "end": 3234.749,
    "text": " I would guess that in terms of physical evolution of bodies, you can get two traits that have to be correlated, like long legs inevitably correlated with something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.789,
    "end": 3246.45,
    "text": "But in terms of evolution of the brain, it's not so constrained and you can have different cognitive functions that evolve independent of each other, much more freedom there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3246.81,
    "end": 3247.712,
    "text": "That's just a guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.953,
    "end": 3275.421,
    "text": " yeah that's very interesting and the kind of there's a lot to say about that and also with um very fruitful to consider the differences with the mammal nervous system and with the insect nervous system and the ways in which the insect nervous system helps clarify certain sensory mappings that get very lost in the large mammal brain yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.236,
    "end": 3281.081,
    "text": " I agree insects are very worth looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.944,
    "end": 3289.075,
    "text": "Okay, so anyone else can write questions in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.095,
    "end": 3292.161,
    "text": "But I mean, what other directions would you like to explore?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.502,
    "end": 3295.787,
    "text": "How do you think this moves forward given where it is now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.212,
    "end": 3302.86,
    "text": "Well, as I say, I'd be very interested if anybody's interested in taking an active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.38,
    "end": 3308.045,
    "text": " and trying to calibrate it this way, I'd be very happy to work with them too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.726,
    "end": 3316.034,
    "text": "I would do the requirement equation side of things, and that would be a very interesting comparison for me to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3321.179,
    "end": 3328.387,
    "text": "But, say we're going to make the next live stream in a month's time, and that'd be about spatial cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3328.727,
    "end": 3331.21,
    "text": "That's the main direction I want to take this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3335.24,
    "end": 3364.386,
    "text": " yes moving things animals with spatialized nervous systems and then also nervous systems that enable movement but don't necessarily need to be spatialized like a worm may just have a topological or a tactile mapping but it may not need to have the kinds of echolocation or center place foraging components of a bat or a bee",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.75,
    "end": 3393.158,
    "text": " i agree i agree um am i allowed to play with robert's equation is that okay of course you are of course you are okay um all right so this is very cool it sounds like in around one month we will have a session on insect brain and foraging spatial cognition and then there's probably many other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.138,
    "end": 3394.66,
    "text": " things we can continue to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.68,
    "end": 3409.302,
    "text": "And also, it would be awesome if somebody has a active inference model or some other kind of model that they could reach out to you and try to get some more empirical and specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.482,
    "end": 3416.793,
    "text": "Have you applied this to any specific like empirical or published cases yet so people could see like what the kind of analysis is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.758,
    "end": 3422.622,
    "text": "Well, the main analysis is coming in the second live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.226,
    "end": 3431.659,
    "text": " Can I just move to the slide that shows where you can get out of the paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.021,
    "end": 3433.281,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.728,
    "end": 3440.191,
    "text": "So there is the link to get hold of the papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.653,
    "end": 3441.954,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.015,
    "end": 3446.621,
    "text": "And there's an application, which we'll look at next time as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.721,
    "end": 3451.528,
    "text": "But there's a very interesting video game slash",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.808,
    "end": 3474.225,
    "text": " executable simulation baselanguage.org baselanguage.org cool all right thank you very much robert thanks everyone for the comments the questions and chat all right okay great thanks farewell bye bye",
    "speaker": "SPEAKER_00"
  }
]