[
  {
    "start": 9.059,
    "end": 36.113,
    "text": " hello and welcome everyone this is active inference guest stream number 82.4 on july 29th 2024 we are continuing this series of presentations and discussions with robert warden and friends so today we'll be discussing assessment of the brain wave hypothesis thank you robert and everyone else for joining so please for the presentation okay um this talk is about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 36.7,
    "end": 42.467,
    "text": " a hypothesis that we've had previous live streams about the hypothesis is that there is a wave in the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 42.507,
    "end": 47.413,
    "text": "And this talk is assessing the likelihood of that being true, basically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 48.074,
    "end": 57.786,
    "text": "And so if you want to see the previous talks, which one of which was about the link between the wave and consciousness, then you can follow this link here to an actual inference web page.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 58.627,
    "end": 65.155,
    "text": "So what I'm going to do in this talk is firstly try and describe to you what the wave hypothesis is,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 66.029,
    "end": 73.909,
    "text": " And secondly, in point two, give some of the evidence, which I think points towards there being a wave in the brain and some of the evidence against it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 75.573,
    "end": 79.363,
    "text": "Now, the question then arises, we've got different lines of evidence,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 79.664,
    "end": 85.294,
    "text": " How do we combine those lines of evidence to make some overall estimate of how likely it is that there is a wave in the brain?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 85.935,
    "end": 94.269,
    "text": "And so what I do in point three, stage three, is an overall Bayesian assessment of the probability that there is this wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 94.87,
    "end": 98.676,
    "text": "And the answer I come to is about 0.5 of the probability.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 98.696,
    "end": 100.339,
    "text": "The detailed number doesn't matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 100.741,
    "end": 103.885,
    "text": " What matters is that it's not a tiny probability.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 104.405,
    "end": 108.85,
    "text": "In other words, we can't just dismiss this wave hypothesis out of hand.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 108.951,
    "end": 113.796,
    "text": "We need to think seriously about what it might mean for the brain if there is a wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 114.357,
    "end": 120.064,
    "text": "And at that point four, we will break for discussion and feedback from people on the call.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 120.744,
    "end": 128.353,
    "text": "And after point four, we'll go on to discuss possible future tests of the wave hypothesis in five.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 128.433,
    "end": 129.955,
    "text": "And finally, after five,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 130.762,
    "end": 132.044,
    "text": " further discussion again.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 132.064,
    "end": 134.728,
    "text": "So that's the plan of the talk roughly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 134.768,
    "end": 140.658,
    "text": "And the first part is to describe what the wave hypothesis is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 140.798,
    "end": 150.313,
    "text": "So wave hypothesis says that there is some region of the brain which is approximately round in which there are waves going in all three directions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 151.054,
    "end": 153.918,
    "text": "And there's a round region shown with a couple of waves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 153.939,
    "end": 157.444,
    "text": "And these waves represent objects in space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 158.15,
    "end": 164.218,
    "text": " The long wavelength wave, lambda 2, the green one, represents an object at r2, a small distance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 165.059,
    "end": 170.085,
    "text": "And the red wave, with shorter wavelength, represents an object at longer distance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 170.926,
    "end": 179.758,
    "text": "So that is the hypothesis that there is this wave region in the brain and neurons coupled to the wave as transmitters and receivers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 180.058,
    "end": 185.625,
    "text": "So a wave acts as a kind of working memory for a 3D model of space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 185.74,
    "end": 188.944,
    "text": " and all the models around the animal in space at the time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 189.865,
    "end": 193.05,
    "text": "So that, in essence, is the wave hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 193.69,
    "end": 199.458,
    "text": "But the important thing about it is how well would a wave-based spatial memory perform?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 200.98,
    "end": 202.622,
    "text": "And you do some elementary maths.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 203.704,
    "end": 210.212,
    "text": "The number of waves you can get in this round region is approximately, if there's some minimum wavelength, which I call lambda min,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 210.479,
    "end": 215.487,
    "text": " then the number of waves you can get in the space is d of a lambda cubed, roughly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 215.567,
    "end": 218.191,
    "text": "So that's quite a lot of things you can represent in the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 218.732,
    "end": 225.222,
    "text": "And the spatial precision you can get is of the order of lambda min over d. And that can be quite small.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 225.543,
    "end": 230.03,
    "text": "So the benefits of this wave storage are you can get high precision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 230.43,
    "end": 233.074,
    "text": "And that, I claim, you can't get out of neurons.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 233.595,
    "end": 236.339,
    "text": "You can get high capacity to represent lots of different objects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 236.92,
    "end": 238.663,
    "text": "You get low spatial distortion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 241.698,
    "end": 246.565,
    "text": " And generally, it is a very simple and direct physical representation of 3D space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 247.387,
    "end": 248.749,
    "text": "It really acts like a hologram.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 249.67,
    "end": 253.656,
    "text": "So the question is, is there any evidence that there is such a wave in the brain?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 254.758,
    "end": 258.303,
    "text": "And I think there are three main pieces of evidence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 259.685,
    "end": 265.434,
    "text": "The first one comes from the mammalian thalamus, and the second one comes from the central body of the insect brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 266.275,
    "end": 270.321,
    "text": "Now, the thalamus is shown in the left, in green for three mammals,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 271.398,
    "end": 280.895,
    "text": " The point about the thalamus is it's approximately round, so it's well suited to hold a weight, and it has all the right connections to hold a representation of space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 281.376,
    "end": 289.351,
    "text": "It has all the sense data coming in, pretty much all the sense data, and it has connections to all the cortical regions that are making sense of that sense data.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 290.713,
    "end": 294.52,
    "text": "So there are more specific reasons about the thalamus, but I'll come to those later.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 295.057,
    "end": 298.545,
    "text": " So that's why the thalamus is a likely candidate holding the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 299.006,
    "end": 312.998,
    "text": "And similarly, in insects, there's a central body of the insect brain, which is a small part of the center of the insect's brain, which its shape is remarkably preserved across all insect species, and it's nearly round.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 313.94,
    "end": 323.394,
    "text": " The central body, like the thalamus, is well suited to hold a wave, and it's connected, has all the right neural connections to hold a representation of space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 323.514,
    "end": 325.697,
    "text": "So those are the first two pieces of evidence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 326.378,
    "end": 330.965,
    "text": "Now, the third line of evidence comes from building neural computational models.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 331.846,
    "end": 334.47,
    "text": "And it's a thing that I think has not been much remarked upon.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 334.49,
    "end": 339.577,
    "text": "3D spatial cognition is very fundamental.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 340.098,
    "end": 343.423,
    "text": "It's the first thing an animal has to do to understand the space around it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 344.399,
    "end": 345.501,
    "text": " in order just to move.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 346.703,
    "end": 352.772,
    "text": "Now, I've tried building 3D models of space at David Marr's level too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 352.812,
    "end": 360.684,
    "text": "And the point is that to build a model of space in the brain, it has to be fairly precise, approximately 1%.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 361.505,
    "end": 367.214,
    "text": "And you can see this because vision and other sense data is fairly precise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 367.274,
    "end": 373.343,
    "text": "And there'd be no point in getting that precise sense data if you didn't make a fairly precise model of space out of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 374.757,
    "end": 388.804,
    "text": " However, it's very difficult to do that with neurons because in a fifth of a second, which is approximately the time an animal has to have to construct his model of space, a typical neuron spike train has only about 10 spikes in it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 389.445,
    "end": 397.12,
    "text": "And so this can represent a real number such as a dimension in space with a precision of approximately square root one in space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 397.353,
    "end": 398.554,
    "text": " square root 10 parts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 398.635,
    "end": 400.497,
    "text": "In other words, 1 in 3 or 30%.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 400.617,
    "end": 408.266,
    "text": "And that precision is very far out from the precision which I think you need to represent 3D space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 408.787,
    "end": 422.483,
    "text": "I think why this has not been recognized or not been spotted is that we've done neural modeling of the brain for years and years, but everybody models neurons as highly precise, reproducible,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 422.885,
    "end": 445.7,
    "text": " units with outputs of real variables, as is shown at the top of this figure, the output of a neural neuron is usually modeled as a real variable with very high precision, so you can get high spatial precision out of that, whereas real neurons, they have spike trains, and in a short time, a spike train doesn't represent a number precisely at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 446.661,
    "end": 449.145,
    "text": "So this, I think, has not been spotted,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 449.817,
    "end": 453.263,
    "text": " And I think it makes a huge gap in neural models of the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 454.605,
    "end": 458.852,
    "text": "And as I've just said, the wave storage can get much better precision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 458.972,
    "end": 461.897,
    "text": "So wave storage might fill this gap.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 461.917,
    "end": 465.242,
    "text": "And that is the third piece of evidence for a wave in the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 465.402,
    "end": 474.998,
    "text": "So in summary, three main pieces of evidence, the thalamus, the insect central body, and these neural computational models, which have",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 475.585,
    "end": 477.827,
    "text": " model 3D space properly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 477.927,
    "end": 481.531,
    "text": "And I think that's a bit of an embarrassment for the neural model of the brain, really.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 482.552,
    "end": 492.942,
    "text": "So if you have those pieces of evidence and some evidence against the wave, which I'll come to, how do you assess the overall probability that the wave is there?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 494.264,
    "end": 495.685,
    "text": "Well, it's a binary hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 495.845,
    "end": 497.948,
    "text": "Either there is a wave or there's not a wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 498.868,
    "end": 503.033,
    "text": "And we want to estimate the probability that there is one based on several pieces of evidence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 503.833,
    "end": 504.394,
    "text": "And this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 504.88,
    "end": 507.004,
    "text": " in analogy is like a biased coin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 507.104,
    "end": 511.593,
    "text": "In other words, how likely is that coin going to turn up heads on the next time we toss it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 512.655,
    "end": 514.218,
    "text": "And you do various experiments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 514.318,
    "end": 519.007,
    "text": "One experiment is toss the coin M times and you get heads N times.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 520.53,
    "end": 522.514,
    "text": "So what you do is several different experiments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 522.534,
    "end": 526.602,
    "text": "You might toss with your left hand, might toss the coin from an airplane.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 527.257,
    "end": 529.6,
    "text": " and you might build a special coin tossing machine.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 530.161,
    "end": 532.063,
    "text": "And with each one, you do some experiments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 532.303,
    "end": 539.272,
    "text": "And so the best estimate coming out of all those experiments is the sum of all the heads over the sum of all the coin tosses.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 540.113,
    "end": 548.303,
    "text": "And so this is the Bayesian way that you combine the evidence from different lines of evidence on the same hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 548.363,
    "end": 552.468,
    "text": "You allot a weight to each one, which has a certain subjective element to it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 552.989,
    "end": 555.051,
    "text": "And then you sum them all according to their weights.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 555.512,
    "end": 556.673,
    "text": "And that's what I'm going to do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 557.075,
    "end": 562.563,
    "text": " to make a Bayesian combination of the different lines of evidence about the wave hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 562.783,
    "end": 570.675,
    "text": "And I just, what you do is you simply, you allot coin tosses to each line of evidence and you sum the coin tosses together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 571.977,
    "end": 575.622,
    "text": "That I think is how people do science roughly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 576.243,
    "end": 580.99,
    "text": "And it is, if you like, it's in the textbooks as the Bayesian philosophy of science.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 583.033,
    "end": 586.879,
    "text": "So when we do this assessment, what answer do we get?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 587.264,
    "end": 597.798,
    "text": " And I've summarized the answers in this little table, and I've put red rows for things that are mainly against the wave hypothesis, and green rows for things that are mainly for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 598.379,
    "end": 608.072,
    "text": "The two red rows you'll find are prior considerations, prior prejudices, and the idea and biophysical mechanisms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 608.193,
    "end": 610.576,
    "text": "I've given those large negative weights.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 611.838,
    "end": 613.66,
    "text": "I've done that deliberately to show that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 614.247,
    "end": 618.252,
    "text": " the overall result is not too sensitive to those negative weights.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 618.573,
    "end": 621.757,
    "text": "You can adjust them a bit and you won't change the result much.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 622.839,
    "end": 630.249,
    "text": "And the positive lines of evidence are the three things I talked about, the thalamus, the insect central body and computational models, and a couple of others.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 630.309,
    "end": 634.735,
    "text": "There is some evidence from phenomenal consciousness and there are some other considerations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 635.596,
    "end": 639.141,
    "text": "So what I'm going to do, quite briefly,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 639.458,
    "end": 662.462,
    "text": " is go through those different rows in the table summarizing basically what the considerations are i won't spend too long on them because the tables are not that interesting but you can come back to anyone or you can stop me on anyone ask questions if you like or come back to anyone in discussion so what is the prior considerations that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 662.83,
    "end": 664.393,
    "text": " go against the wave hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 664.473,
    "end": 668.74,
    "text": "First one, I've put in a big weight of 20 for Occam's razor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 668.8,
    "end": 671.444,
    "text": "In other words, it's an extra hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 671.485,
    "end": 673.147,
    "text": "We just don't want an extra hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 673.248,
    "end": 675.431,
    "text": "So let's put a weight against it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 677.034,
    "end": 678.957,
    "text": "And so I've put a big weight of 20 against that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 679.778,
    "end": 688.433,
    "text": "It's bigger than I think is realistic, but I've done so purely to make it clear that the eventual answer is quite robust against that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 689.662,
    "end": 693.849,
    "text": " And there's a couple of other arguments I've put in, which people might make.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 694.65,
    "end": 699.077,
    "text": "One is the classical neural model of the brain has served us well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 699.177,
    "end": 700.359,
    "text": "So why do we need anything else?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 700.399,
    "end": 708.932,
    "text": "But I think that's a weak line of argument because the classical neural model of the brain hasn't worked that well that we're ready to, that we've described all the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 708.972,
    "end": 711.577,
    "text": "There's still massive number of things we don't know about the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 712.017,
    "end": 713.159,
    "text": "So that's a weak argument.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 713.68,
    "end": 715.062,
    "text": "And the second argument is,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 715.936,
    "end": 718.94,
    "text": " Well, we've never seen a wave, so surely that means there's not one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 719.02,
    "end": 724.566,
    "text": "But that, again, is a weak argument, I think, because we just don't know how to look for this wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 725.688,
    "end": 728.932,
    "text": "And it probably has very low intensity, for reasons I'll come to later.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 729.432,
    "end": 730.714,
    "text": "So those are weak arguments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 730.754,
    "end": 737.862,
    "text": "But nevertheless, I come up with 25 points against the wave, 25 coin tosses against the wave from prior considerations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 739.224,
    "end": 742.428,
    "text": "So now we move on to positive evidence for the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 742.908,
    "end": 745.251,
    "text": "And the first one of these is the mammalian thalamus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 745.872,
    "end": 748.234,
    "text": " There is both general evidence, which I've talked about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 748.254,
    "end": 754.66,
    "text": "In other words, the thalamus has the right shape and it has the right connections to hold a 3D model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 755.14,
    "end": 762.707,
    "text": "And there's what I call smoking gun evidence, something that's much more specific about the thalamus, which points to there being a wave in it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 762.727,
    "end": 767.952,
    "text": "Now, I'm going to come to that later in the talk, so I won't go into that in detail now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 768.453,
    "end": 775.339,
    "text": "But in summary, I think the thalamus offers quite a lot of positive support, 14 against 2, for the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 776.551,
    "end": 778.793,
    "text": " Then we come on to the insect central body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 778.833,
    "end": 786.64,
    "text": "There is, again, the general evidence that the insect central body has the right shape and it's highly conserved across all insect species.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 786.68,
    "end": 788.322,
    "text": "And I think that is quite significant.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 788.843,
    "end": 794.868,
    "text": "In other words, every insect in the world has the same shape, pretty much the same shape of its central body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 796.049,
    "end": 797.671,
    "text": "So the shape must mean something.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 798.452,
    "end": 804.297,
    "text": "Whereas you compare that with other parts of the insect brain, like the mushroom bodies, for instance, they have very variable shapes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 805.238,
    "end": 807.34,
    "text": " And they just have to make neural connections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 807.42,
    "end": 813.707,
    "text": "But this is a clue that the central body of the insect brain is doing something other than making neural connections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 814.448,
    "end": 816.79,
    "text": "And the idea of a wave in it fits it quite well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 820.374,
    "end": 828.782,
    "text": "And I think there's other evidence from the insect brain, mainly that the insect brain has very few neurons in it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 828.923,
    "end": 834.148,
    "text": "So there are probably not enough neurons to make a decent representation of 3D space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 834.55,
    "end": 837.073,
    "text": " but we know that insects do it rather well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 838.274,
    "end": 839.495,
    "text": "So that's the central body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 840.536,
    "end": 842.959,
    "text": "Next is the computational modeling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 844.3,
    "end": 862.279,
    "text": "As I said, 3D spatial cognition is a vital function of the brain, but as far as I know, Carl can put me right on this, there is no working neural computational model of it, especially when you ask for a model which models spike trains rather than idealized theoretical neurons.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 863.288,
    "end": 875.239,
    "text": " And in any sub-second time intervals, neurons give a big error rate, about 30%, whereas we really need 1% or something to construct a decent spatial model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 875.259,
    "end": 877.641,
    "text": "So the evidence for... Yeah?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.661,
    "end": 879.383,
    "text": "May I ask just a precision here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.724,
    "end": 890.393,
    "text": "The point here is, I think, if I follow you well, that we should all bear in mind is the model that is needed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 892.28,
    "end": 894.503,
    "text": " performance in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.644,
    "end": 913.965,
    "text": "So what you are saying is the lack of precision may come also because of some time pressure that for the model to be valid, should be able to build and update this 3D model of space in quote unquote, real time, correct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 914.666,
    "end": 919.091,
    "text": "Yeah, very short time, when you need that model of space to be really up to date.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 920.132,
    "end": 921.173,
    "text": "So you only have a",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 921.406,
    "end": 923.009,
    "text": " In mammals, you have a third of a second.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 923.069,
    "end": 924.832,
    "text": "In insects, you have even less time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 925.553,
    "end": 930.861,
    "text": "And in that time, neurons, real neurons, are very imprecise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 931.222,
    "end": 932.043,
    "text": "That's the argument.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 934.507,
    "end": 938.394,
    "text": "Okay, so that's the three lines of evidence for the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 940.056,
    "end": 944.043,
    "text": "One line of evidence I think that goes against it is biophysical mechanisms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 944.183,
    "end": 947.869,
    "text": "In other words, how does this wave work?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 948.052,
    "end": 952.036,
    "text": " As far as I know, no biophysical model for the wave has ever been proposed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 952.956,
    "end": 958.481,
    "text": "And we make, again, the rather pessimistic assumption that the chances that we'll find one are small.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 958.602,
    "end": 959.562,
    "text": "We'll come to that later.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 959.642,
    "end": 965.308,
    "text": "But we've put 10 points against the chances of finding a decent biophysical model of the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 965.348,
    "end": 972.514,
    "text": "Now, I think that is very pessimistic, especially in view of the point that evolution is cleverer than we are.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 972.574,
    "end": 975.797,
    "text": "And so even if we can't think of it, evolution may be able to think of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 976.334,
    "end": 982.168,
    "text": " And there in this table, there's some other biophysics evidence, which approximately balances out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 982.188,
    "end": 987.641,
    "text": "So the biophysics evidence is taken to go against the wave broadly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 989.566,
    "end": 990.107,
    "text": "Finally,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 990.83,
    "end": 993.534,
    "text": " the last thing I'll consider is phenomenal consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 994.375,
    "end": 1001.545,
    "text": "And this was on the last live stream that if there is a wave in the brain, it leads to a new theory of how consciousness works.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1002.286,
    "end": 1004.469,
    "text": "And you can see that on that live stream.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1005.01,
    "end": 1007.113,
    "text": "And this series, I think is quite nice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1007.193,
    "end": 1015.485,
    "text": "It solves a lot of the problems, neural theories of consciousness, but we don't want to put too much weight on it because consciousness theories are so controversial.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1015.905,
    "end": 1020.111,
    "text": "But I think what we can do is that spatial consciousness,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1021.171,
    "end": 1026.6,
    "text": " the consciousness that we have right now, the space around us, must come from something happening in the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1028.162,
    "end": 1031.928,
    "text": "And our spatial consciousness is quite detailed and precise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1032.769,
    "end": 1041.764,
    "text": "And so that tells us, however it's done, that the model of space in the human brain is quite detailed and precise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1043.406,
    "end": 1045.71,
    "text": "And so that, again,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1046.298,
    "end": 1049.901,
    "text": " If you come back to the point, neurons can't do it, but waves might be able to do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1050.021,
    "end": 1053.284,
    "text": "That is further evidence in favor of the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1053.364,
    "end": 1058.068,
    "text": "But again, because consciousness is controversial, I haven't given it big weight at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1058.108,
    "end": 1059.129,
    "text": "I've given it four points.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1060.31,
    "end": 1064.774,
    "text": "So when we come, and there's some other evidence I don't think I'll go into.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1064.814,
    "end": 1073.181,
    "text": "So when we combine all the evidence, here's the scores we've been keeping and adding up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1073.661,
    "end": 1075.663,
    "text": "Here's the coin tosses which came out heads.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1076.116,
    "end": 1078.281,
    "text": " Here's the coin tosses which came up tails.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1079.463,
    "end": 1084.394,
    "text": "We have a total of 91 coin tosses of which 47 came up heads.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1085.296,
    "end": 1091.53,
    "text": "So basically, we were deliberately pessimistic in stacking up the negative evidence against the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1092.051,
    "end": 1095.559,
    "text": "But in spite of that, the positive evidence has won.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1096.855,
    "end": 1100.04,
    "text": " And quite literally, the many pieces of positive evidence add up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1100.561,
    "end": 1102.444,
    "text": "And so we get to a probability of 0.52.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1102.985,
    "end": 1116.388,
    "text": "Or if we take a simpler view, that we just give every line, every piece of evidence one vote, we get 31 votes, and 24 of those are in favor of the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1116.428,
    "end": 1119.032,
    "text": "So you get a more positive number out of that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1119.147,
    "end": 1128.118,
    "text": " And my main point is not the number, 0.5 or whatever it is, but the main point is it would take very strong negative evidence to change this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1129.339,
    "end": 1130.561,
    "text": "And I don't know if that evidence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1131.322,
    "end": 1135.687,
    "text": "And so my main point is really, you can't easily dismiss this wave hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1136.308,
    "end": 1139.031,
    "text": "And if you can't dismiss it, then it raises some big questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1139.792,
    "end": 1144.698,
    "text": "I think if the wave exists, we need to really rethink how the brain works.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1145.079,
    "end": 1148.783,
    "text": "It's a very different model of the brain we have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1149.134,
    "end": 1157.009,
    "text": " If not, by the way, there's still a huge unsolved problem, because how do these imprecise neurons do 3D spatial cognition?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1158.752,
    "end": 1170.374,
    "text": "So what I'm doing, one trouble with the wave hypothesis is it really rests on the work of one person at the moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1170.394,
    "end": 1172.458,
    "text": "That's just me that's been interested in it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1172.675,
    "end": 1175.82,
    "text": " But science requires reproducibility and debate between lots of people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1175.84,
    "end": 1184.372,
    "text": "So what I'm asking people to do watching this live stream and asking you to do is please look at these ideas and assess them for yourselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1186.335,
    "end": 1191.382,
    "text": "Please provide some commentary of your own on the way, whether it's specialised or generalised or whatever.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1192.363,
    "end": 1194.126,
    "text": "Please challenge the ideas, please",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1194.595,
    "end": 1195.697,
    "text": " Get a hold of the spreadsheet.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1195.717,
    "end": 1200.884,
    "text": "You can download the spreadsheet and change the weights and see what you end up with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1200.904,
    "end": 1202.407,
    "text": "Or please bring new evidence to bear.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1202.427,
    "end": 1205.692,
    "text": "There may be some evidence against the wave for it that I don't know about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1206.132,
    "end": 1207.514,
    "text": "And please agree or disagree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1208.035,
    "end": 1216.909,
    "text": "And what I'd like to do is to collect that commentary and to make that commentary available when people want on this website.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1217.63,
    "end": 1218.871,
    "text": "You can get the spreadsheet.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1219.953,
    "end": 1223.218,
    "text": "And please, therefore, send your comments to my email address.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1224.025,
    "end": 1225.547,
    "text": " So that's the call for commentary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1225.607,
    "end": 1227.769,
    "text": "And we come on now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1228.21,
    "end": 1230.092,
    "text": "Oh, by the way, this is very important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1230.152,
    "end": 1232.835,
    "text": "Carl Friston has endorsed the call for commentary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1232.876,
    "end": 1234.277,
    "text": "I hope you're on the call, Carl.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1236.199,
    "end": 1250.376,
    "text": "Based on this short description of the wave hypothesis, which I'll leave you to read, Carl writes, this is the Bayesian waves in the brain hypothesis, and it challenges conventional views of belief updating in the Bayesian brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1250.977,
    "end": 1251.838,
    "text": "And it offers...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1251.953,
    "end": 1261.288,
    "text": " as a perspective on neuromorphic computation that's supported not only by theoretical accounts of functional brain architectures, but by receiving empirical evidence that speaks to effecting mechanisms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1262.59,
    "end": 1271.344,
    "text": "But the important part to me is it would, he says at the end, it would be very useful to see other people's take on this proposal for mortal computation in the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1272.225,
    "end": 1273.808,
    "text": "So please send in your comments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1275.09,
    "end": 1279.817,
    "text": "But on the next slide, just before discussion,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1281.637,
    "end": 1284.202,
    "text": " a few words of explanation of mortal computation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1287.708,
    "end": 1295.762,
    "text": "This was introduced by Geoff Hinton in 2022, mainly in the context of neural net learning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1296.563,
    "end": 1300.27,
    "text": "And the paper I'm mainly referring to is by",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1300.705,
    "end": 1309.638,
    "text": " Alex and Carl in 2023, where they relate mortal computation, particularly to Markov blankets, but also to a lot of other things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1309.658,
    "end": 1311.701,
    "text": "There are so many ideas in that paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1312.181,
    "end": 1320.173,
    "text": "I can't possibly summarize them, but basically these are proposals for brain inspired biomimetic computing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1321.214,
    "end": 1327.303,
    "text": "I'll summarize, a quote from that paper summarizes what mortal computing means to Alex and Carl.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1327.604,
    "end": 1332.051,
    "text": " Software is immortal because it can be copied to different hardware and still be executable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1332.551,
    "end": 1342.687,
    "text": "Mortal computation means that once the hardware medium on which a program is implemented fails or dies, the knowledge, behavior and functionality will cease to exist.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1342.847,
    "end": 1345.511,
    "text": "So that's mortal computation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1346.673,
    "end": 1349.697,
    "text": "My take on it is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1350.233,
    "end": 1361.847,
    "text": " Direct physical computation, which is the kind of computation the wave does, is simpler and more efficient than a universal computing machine, like a universal Turing machine or a universal von Neumann computer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1363.87,
    "end": 1373.902,
    "text": "And in particular, immortal software needs very reproducible hardware, but that doesn't work out in the brain for two reasons, two big reasons.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1374.022,
    "end": 1377.827,
    "text": "Firstly, no two neurons are identical in the brain, I believe.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1378.195,
    "end": 1381.479,
    "text": " And secondly, even one neuron never does the same thing twice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1382.921,
    "end": 1393.735,
    "text": "So coming on to the relationship between wave-based cognition and mortal computation, I think wave-based spatial computation is mortal and is morphic, to use a word from this paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1394.116,
    "end": 1397.981,
    "text": "In other words, it depends on the physical shape of the thing holding a wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1398.922,
    "end": 1405.811,
    "text": "In terms of their 5Es model, it is elemental because I think spatial cognition is a very basic thing that any animal needs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1406.352,
    "end": 1407.814,
    "text": "It's embodied because",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1408.334,
    "end": 1409.556,
    "text": " We're embodied in space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1409.576,
    "end": 1410.797,
    "text": "We're all embodied in space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1411.418,
    "end": 1416.345,
    "text": "And it is inactive because we have to move in space in order to understand 3D space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1418.027,
    "end": 1420.971,
    "text": "So wave computation is tied to a visible wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1422.133,
    "end": 1427.641,
    "text": "And I will claim that we need to understand 3D space before we need to learn things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1427.721,
    "end": 1432.367,
    "text": "And that's why spatial cognition is really very elemental.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1433.208,
    "end": 1442.88,
    "text": " And an interesting consequence of this, if you believe there's a wave in the brain, and if the wave is the source of consciousness, then you get the conclusion that consciousness is more.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1443.521,
    "end": 1445.804,
    "text": "I think we knew that, but I think it's quite interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1447.005,
    "end": 1454.555,
    "text": "So onto discussion, and these are some of the points I would like to hear about in discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1455.576,
    "end": 1459.401,
    "text": "Perhaps you can take them in any order, but Dan, do you want to take over?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1461.642,
    "end": 1476.36,
    "text": " thank you yeah how about alex if you'd like to give a first comment and then anyone else can can start to jump in can you hear me",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1477.285,
    "end": 1481.37,
    "text": " Okay, let me know if the background noise is really bad because I'm in like a cafe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.911,
    "end": 1484.455,
    "text": "So, first of all, I think this is very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1484.555,
    "end": 1490.022,
    "text": "I did read Robert your call for commentary paper before as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.443,
    "end": 1491.784,
    "text": "I did have a few notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.185,
    "end": 1501.217,
    "text": "I mean, there's a lot of things that we could talk about, but I do really appreciate the connections to mortal computation thesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.197,
    "end": 1522.834,
    "text": " uh which is a corollary of the free energy principle so i think this is really nice and uh i did i did like the argument about that waves are morphic thus you know that they fit in the framework because we kind of need that uh otherwise we're just dealing with immortal computation so i had actually some questions i'll just throw at you that might",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.185,
    "end": 1549.362,
    "text": " might even just be for further information so one one comment question is i don't know if you're aware of robert west at uh carlton university in canada uh who has worked on holographic declarative memory uh one of your comments earlier about uh things being holographic and are there neurons that try to explain or try to model things that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.342,
    "end": 1569.662,
    "text": " are wave-like but these aren't really wave-like uh holographic declarative memory comes into play where they use complex numbers and complex number representations which complex numbers are often used to model waves um so i was curious if you had known about that work or if you did uh why would that be insufficient or how that might",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.642,
    "end": 1570.523,
    "text": " play in the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.944,
    "end": 1575.672,
    "text": "And I'll lump with this another body of work so that way I don't break this up into too many questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.573,
    "end": 1583.545,
    "text": "Resonator networks or resonating fire neurons have a wave-like construction about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.927,
    "end": 1585.508,
    "text": "What is his name?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.688,
    "end": 1589.254,
    "text": "Eugene Ezekiewicz in computational neuroscience proposed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.234,
    "end": 1594.301,
    "text": " the Ezekovitch neuronal model, which is a very complex spiking neural model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.741,
    "end": 1601.39,
    "text": "And those dynamics can be constructed such that they emulate resonating fire dynamics or wave-like dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.811,
    "end": 1615.95,
    "text": "And I was wondering how that, if you were aware of that, if not, that might be very relevant in a potential neural model that could be a step in the right direction, since you said that we don't really have the neuronal models or neural computational models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.93,
    "end": 1618.853,
    "text": " that get at this notion of wave-like computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.574,
    "end": 1621.155,
    "text": "They might not be completely relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.175,
    "end": 1622.717,
    "text": "So I was kind of curious about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.758,
    "end": 1626.721,
    "text": "I'll stop there because then I have like one or two other questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.061,
    "end": 1628.783,
    "text": "So I was curious if you had any comments on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.944,
    "end": 1630.845,
    "text": "Thanks a lot for that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1630.865,
    "end": 1633.228,
    "text": "The quick answer is no, I'm not familiar with either of those.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1633.268,
    "end": 1635.75,
    "text": "And I will go and look at them as soon as I can.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1635.81,
    "end": 1638.413,
    "text": "They may well have insights.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1639.274,
    "end": 1645.06,
    "text": "What I'd say about the wave hypothesis is it is the key thing about the wave",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1645.462,
    "end": 1649.629,
    "text": " and I didn't emphasize this enough, is it's got to be a working memory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1649.669,
    "end": 1653.275,
    "text": "So it's got to hold information for a fraction of a second.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1655.438,
    "end": 1662.61,
    "text": "And that makes it rather different from anything that is neuron-oriented.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1662.69,
    "end": 1665.535,
    "text": "But I will certainly read those two with great interest.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1665.555,
    "end": 1666.356,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1666.657,
    "end": 1672.847,
    "text": " Yeah, I'll try to send Daniel or you some links to some of those papers to point you into those directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.347,
    "end": 1676.653,
    "text": "And then I guess I'll ask my other question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.394,
    "end": 1685.847,
    "text": "I mean, I can also lump in Chris Eliasmus' work on Spawn because there are lots of neuronal models that try to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.827,
    "end": 1701.557,
    "text": " get at modeling the dynamics through spikes and again maybe this goes into that spikes just don't give us enough precision because in the paper i didn't quite see that but in your talk i did um which was why why do you claim that we don't model spikes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.537,
    "end": 1730.734,
    "text": " well as we have a long history of spiking neuronal models and computational neuroscience and brain inspired computing that do work very well now again i don't want to claim that there this is where carl could chime in as you mentioned him earlier uh if there was any that have been used to model aspects of complex spatial cognition that i think might be lacking but like we have hodgen huxley model again i mentioned the izikovic model uh fitzonagumo there's a lot of these complex dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.714,
    "end": 1736.601,
    "text": " that can actually be used to engage in very complex machine intelligence tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.543,
    "end": 1753.703,
    "text": "That, for example, you can train simple robotic control systems with like modulated forms of spike timing dependent plasticity, which is also a very rich and long history in neuroscience for plasticity, of course, and this is where we're now we're encoding in synapses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.223,
    "end": 1756.266,
    "text": "I'm not sure that this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.246,
    "end": 1777.798,
    "text": " feels at odds uh with the wave hypothesis but rather could be tools uh that you could be used to build wave-like models and again i was just curious to know if there's still something about those particular spiking neuronal dynamics of which we have decades and decades of work that are just lacking to give you what you seek",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.778,
    "end": 1806.115,
    "text": " um and again is it just because we can't really represent things with 10 spikes in five milliseconds that even if we represent them faithfully to the neurophysiological data uh that's still insufficient for representing what you want and you're just saying we need another mechanism that's the part where i was a little confused yeah i i think i please send the references i'd love to see those papers i think specifically what i'm saying is in i haven't seen a detailed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.297,
    "end": 1815.208,
    "text": " 3D model of space to the level of resolution like a bee's eyes or our eyes that's actually built with neurons firing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1815.869,
    "end": 1820.034,
    "text": "There may be lots of neural models built with spike trains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1820.915,
    "end": 1826.863,
    "text": "I'm not aware of any models within the FEP active inference work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1827.384,
    "end": 1834.853,
    "text": "I'm not aware of any models outside like Edmund Roll's business or Jeff Hawkins' stuff and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1835.305,
    "end": 1839.569,
    "text": " I believe that all of those use precise theoretical abstract neurons.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1842.952,
    "end": 1843.853,
    "text": "Okay, that's fair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.594,
    "end": 1849.378,
    "text": "I think, yeah, I think I get what you're trying to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.518,
    "end": 1853.622,
    "text": "I do feel like there might be some interesting work out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.722,
    "end": 1862.63,
    "text": "Like, for example, I'm sure you've heard of the recent model, computational models that have been proposed for like grid cells, which is used as an important part of... Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.79,
    "end": 1864.772,
    "text": "I think looking at grid cells is an important...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1865.005,
    "end": 1889.292,
    "text": " thing we have to do okay that might be complementary rather than an opposition as i i do like the wave hypothesis i don't necessarily think that this is data that would necessarily refute it and this is where carl might chime in uh because again if he's aware of any good neuronal models or computational neural models that actually get at this that i'm not sure that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.655,
    "end": 1895.358,
    "text": " Great, thanks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1901.906,
    "end": 1905.019,
    "text": "Carl or Ken or David, feel free.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1909.724,
    "end": 1914.854,
    "text": " Perhaps I'll take the lead and just respond to those comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.416,
    "end": 1929.825,
    "text": "I think you could argue both ways, but it does rest very sensitively on whether the wave is a description of neuronal dynamics under the neuron doctrine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.868,
    "end": 1941.847,
    "text": " or whether the wave hypothesis commits to some divorce between the wave, however instantiated, and the neuronal activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.388,
    "end": 1953.788,
    "text": "So certainly, if you say that the wave is an appropriate description",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.768,
    "end": 1970.738,
    "text": " of ensemble dynamics on the cortex or in the hippocampus or in the thalamus, then one could easily argue that it would be difficult to disprove the wave hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.859,
    "end": 1978.392,
    "text": "And indeed, there are people whose entire career is built upon understanding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.372,
    "end": 1985.181,
    "text": " spatial cognition and beyond in terms of cortical field theory, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.201,
    "end": 2005.527,
    "text": "So if you just look at the, there are many examples here, but the sort of classic example that comes to mind is the work of Peter Robinson, Australia, and developing quite sophisticated wave-like models of neuronal dynamics, idealized- Can I come in there, Karl?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.878,
    "end": 2011.105,
    "text": " Just briefly, I mean, the key thing about this wave hypothesis is it's got to be working memory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2011.506,
    "end": 2018.576,
    "text": "So it's got to store information for, and it is a separate non-neural wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2018.596,
    "end": 2020.038,
    "text": "That's basically the way it's pitched.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2022.281,
    "end": 2027.308,
    "text": "And it has to be a wave which can store information for a fifth of a second or a third of a second or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2028.71,
    "end": 2032.695,
    "text": "And so it's not just electric fields passively caused by neurons.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2035.156,
    "end": 2041.123,
    "text": " Yes, so that speaks to what does the wave hypothesis commit to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.823,
    "end": 2050.873,
    "text": "And you're giving a very clear answer that it is not merely articulating ensemble dynamics that could transcend neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.934,
    "end": 2052.295,
    "text": "We could be talking about glial cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.335,
    "end": 2054.337,
    "text": "We could be talking about quantum coherence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.399,
    "end": 2061.265,
    "text": "But the key thing is that you're summarizing spatially extended",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.245,
    "end": 2069.979,
    "text": " collective dynamics of active matter in the brain in terms of infrequency space, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.42,
    "end": 2075.368,
    "text": "So you could say this is exactly the same move that quantum physics makes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.388,
    "end": 2077.532,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.512,
    "end": 2098.761,
    "text": " Yeah, you know, basically, I mean, at its simplest, you can regard quantum physics as basically articulating dynamics, be specific about this slide, articulating density, probability density dynamics in frequency space by appeal to complex numbers and Fourier transforms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2098.741,
    "end": 2128.68,
    "text": " and what's what's the benefit of doing that well you can use fourier transforms and all the orthogonalization and all the linearization of various problems that ensues um what's the difficulty well the same problem with um modeling probability waves is that once you take a fourier transform there is no natural way to uh impose the sum to one constraint that you would need in order to interpret as a possible probability so what do you do you have to invoke a born rule and then think about probability amplitudes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.66,
    "end": 2145.838,
    "text": " Well, the message here is that there is a great utility in taking any arbitrary dynamics in some metric space, and specifically density dynamics, and projecting them into the space of waves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.478,
    "end": 2153.045,
    "text": "And from that point of view, one could argue that the wave hypothesis is not a hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.145,
    "end": 2155.107,
    "text": "It's actually a principle or a proposal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.087,
    "end": 2157.531,
    "text": " for a better way of understanding collective dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.891,
    "end": 2160.816,
    "text": "And in that sense, I think there are lots of examples of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.836,
    "end": 2174.496,
    "text": "And I come back to cortical field theories, quantum field theories applied to the brain that have the right kind of dynamics and will have exactly the right kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.847,
    "end": 2176.829,
    "text": " working memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.07,
    "end": 2178.451,
    "text": "So I'll just give you a couple of examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.492,
    "end": 2196.193,
    "text": "There is work looking at chimera states in cortical field theory where one can find things like solitons, which brings us back to last year's conversation about condensates and the like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.754,
    "end": 2203.082,
    "text": "More interestingly, more recently, there's been empirical evidence from both EEG and fMRI",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.062,
    "end": 2222.657,
    "text": " of vortices on the cortex which are if you you know one way of understanding classical like dynamics in the space of waves that have the kind of itinerancy and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.818,
    "end": 2250.383,
    "text": " solenoidal aspects that do remember things by returning to the same state um so if you know i think there's lots of empirical evidence um and thereby um meaning that they have memory in the sense of say a ponkari map um and these are explicitly articulated in terms of traveling waves that have this sort of circular solenoidal aspect that can be empirically detected",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.97,
    "end": 2272.825,
    "text": " However, I think it answers the question, is there any empirical evidence for a formulation of brain dynamics beyond a commitment to particularly the neuron doctrine that can be articulated in the space of waves that fulfils the requirements of precision for memory and representation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.845,
    "end": 2277.552,
    "text": "I would say yes, but that does not answer the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.375,
    "end": 2290.212,
    "text": " are these waves mere descriptions of one of many kinds of descriptions of some underlying dynamics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.013,
    "end": 2303.651,
    "text": "Or does the wave hypothesis of the brain say that the actual substrate, the mortal substrate, cannot be just limited to message passing among neurons?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.691,
    "end": 2306.155,
    "text": "And that's what I meant by the neuron doctrine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.135,
    "end": 2311.052,
    "text": " That, I think, is the whole question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.293,
    "end": 2312.397,
    "text": "I think that is one view.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2312.457,
    "end": 2315.588,
    "text": "It cannot be reduced to neurons, basically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2317.222,
    "end": 2322.91,
    "text": " Yeah, that's what I understood from your previous talk and the slide you shared before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.431,
    "end": 2334.206,
    "text": "Of course, there are a lot of waves in the brain, for instance, related to electromagnetic induction, and there are a lot of old and very powerful models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2334.387,
    "end": 2339.394,
    "text": "I go back to Núñez, you know, to connect with Carl's discussion of EEG dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2339.834,
    "end": 2345.102,
    "text": "But I think one of your points is that the wave, whatever that is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2345.082,
    "end": 2352.924,
    "text": " cannot be just an epiphenomenon and it has to have an inductive power on neuronal dynamics in return.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2353.907,
    "end": 2360.104,
    "text": "There is some model I think that are emerging or some theories that are emerging about electromagnetic induction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2360.084,
    "end": 2366.859,
    "text": " like electromagnetic wave in the brain that will conductive power on current in the neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2368.021,
    "end": 2369.906,
    "text": "I haven't followed that literature for a while.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.966,
    "end": 2375.157,
    "text": "As I told you before, I gave up on neuroscience, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2375.137,
    "end": 2384.007,
    "text": " So what you require is really something that has a, you know, bottom-up and top-down quote-unquote sort of mechanism to begin with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2384.048,
    "end": 2392.277,
    "text": "This wave has to be sustained and it has to be in and of itself a form of computation that can then feed back to the neuronal network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2393.118,
    "end": 2394.199,
    "text": "That's the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.721,
    "end": 2395.881,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2398.825,
    "end": 2400.587,
    "text": "Ken, would you like to give any comments?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2402.137,
    "end": 2410.999,
    "text": " uh just to maybe a one for everybody a question for everybody might reveal some of my ignorance here but um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2412.211,
    "end": 2420.4,
    "text": " Are there any sort of general results about the capacities of waves for computation relative to other types of computation?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2420.98,
    "end": 2423.643,
    "text": "It's a kind of analog in computation, isn't it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2423.944,
    "end": 2424.304,
    "text": "It is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2424.504,
    "end": 2426.907,
    "text": "Analog is a very appropriate term for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2426.927,
    "end": 2436.497,
    "text": "But I would say the role of the wave is more information storage than computation, but it actually may be involved in both.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2436.477,
    "end": 2446.75,
    "text": " But the key thing is neurons may compute 3D space, there's got to be some way of storing it with adequate precision, and that's what the wave is supposed to do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2448.212,
    "end": 2463.531,
    "text": "But I should add, if I may, that computing 3D space, in particular in an active infant cell, kind of a realistic biological context for animals,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2463.511,
    "end": 2481.098,
    "text": " that's not just representing space, it's also acting upon it through transformations that are not just about change of coordinates, for instance, under our hypothesis, there is the projective group that is acting on a projective space, but then you have the space that is itself",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2481.078,
    "end": 2505.06,
    "text": " filled with features that themselves as their own operators like different groups for instance spaces colors and how all these things like perhaps through models of fiber bundle interacts is very key so the computation of space as you think of it and i think is perfectly correct and and i'm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.04,
    "end": 2512.527,
    "text": " talks to me is much more than just representing three coordinates at one point in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2513.708,
    "end": 2514.128,
    "text": "I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.148,
    "end": 2514.709,
    "text": "I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.371,
    "end": 2524.378,
    "text": "Just to speak to Ken's question about, are there any laws that would be applicable under the wave hypothesis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.499,
    "end": 2533.326,
    "text": "Just going back to the analogy with quantum mechanics, if one thinks of the wave as a probabilistic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.306,
    "end": 2540.52,
    "text": " representation or memory, then you'd certainly be looking to Heisenberg and certainty principle and the de Broglie relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.061,
    "end": 2549.619,
    "text": "So perhaps if this could be a question for Robert, how would you unpack the spatial precision in relation to the temporal precision?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.639,
    "end": 2551.382,
    "text": "Because you talk about memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.362,
    "end": 2560.635,
    "text": " But the uncertainty principle would mean that you can have a certain spatial precision at the expense of a temporal precision and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.655,
    "end": 2571.109,
    "text": "And indeed, that is one, if you like, gift of wave hypotheses, certainly as read on the point of view of elementary quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.089,
    "end": 2582.104,
    "text": " The other sort of question I'd reflect to you, in terms of the de Broglie relationship, what is the analogy of, say, energy and maths in these ways?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2582.404,
    "end": 2591.336,
    "text": "How would you interpret this to a 101 physics student when it comes to- With great difficulty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2592.198,
    "end": 2594.781,
    "text": "Let me first speak to the spatial precision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2594.921,
    "end": 2599.948,
    "text": "I think the uncertainty principle is basically a property of the Fourier transform.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2599.928,
    "end": 2628.906,
    "text": " a wave that's confined in a certain distance has a certain uncertainty in its wavelength and wavelength and momentum in quantum mechanics and position is position so that's the answer that's the the origin of heisenberg uncertainty principle is simply the freer transform of a bounded wave that speaks to the spatial precision but as to the actual biophysics of the wave and there is some relationship between wave vector",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2629.426,
    "end": 2637.411,
    "text": " and frequency, I don't know what that relationship is, but the great, as you recall, uh,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2638.1,
    "end": 2638.901,
    "text": " which way does it go?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2639.001,
    "end": 2649.332,
    "text": "Frequency over wavelength is phase velocity, and the derivative of wavelength with respect to frequency is the group velocity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2649.572,
    "end": 2657.0,
    "text": "Now, all those questions about what the group velocity is, what the rest mass of these, if there are quasiparticles, what's their rest mass?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2657.741,
    "end": 2658.261,
    "text": "I don't know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2658.381,
    "end": 2666.47,
    "text": "But for instance, one of the more far out hypotheses I consider is, as we discussed it last time was,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2666.753,
    "end": 2669.457,
    "text": " that the wave is actually held in a Bose-Einstein condensate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2670.218,
    "end": 2679.97,
    "text": "And in a Bose-Einstein condensate, there are particles called rotons, and phonons normally have zero rest mass.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2679.99,
    "end": 2686.679,
    "text": "But there are particles called rotons and others which have non-zero rest mass.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2686.699,
    "end": 2690.284,
    "text": "And that may be something to do with their persistence in time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2690.825,
    "end": 2693.368,
    "text": "But non-zero rest mass gets you into the whole question of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2693.838,
    "end": 2695.482,
    "text": " What's the frequencies of this wave?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2695.723,
    "end": 2696.866,
    "text": "What are the wave vectors?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2697.608,
    "end": 2700.996,
    "text": "And as far as I'm concerned, it's all the Wild West.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2701.037,
    "end": 2702.621,
    "text": "It's all to play for, really.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2703.483,
    "end": 2705.468,
    "text": "I'm only making suggestions at the moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2707.726,
    "end": 2731.978,
    "text": " thanks i'll make a few short comments so thank you all for the discussion and robert also for making the bayesian epistemology very clear i think it's really cool also that was very insightful discussion on one possibility the wave is epiphenomenal like david said plays more of like a memory possibly even a memory with no causal efficacy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2732.212,
    "end": 2733.977,
    "text": " I'm sorry, I did not mean that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2734.057,
    "end": 2745.31,
    "text": "I mean, according to what I understand and is necessary for Robert's model, the wave must not be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2745.492,
    "end": 2746.694,
    "text": " epiphenomenal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2747.094,
    "end": 2765.219,
    "text": "And what we know about EEG, except some models, for instance, nowadays some models of electromagnetic propagation with notion of feedback induction that should be looked into, but overall the way we model EEG, for instance, from the neuronal current is epiphenomenal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.339,
    "end": 2773.17,
    "text": "It's just, you know, summation at the level of an electrode, and so the wave itself is an epiphenomenon, and the model of Robert does not want that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2773.302,
    "end": 2802.043,
    "text": " i totally agree and that's where i was going was sorry to attribute it to you that way but it was yes to a more active computational role kind of like this reservoir computing area um also general point kind of summed up by figure 4.3 in the 2022 textbook is there's like continuous and there's discrete models in space and in time so given the continuity of space and time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2803.93,
    "end": 2831.389,
    "text": " just at a first pass a continuous representation or model like a wave may have certain advantages over holding it in a discrete way and then um in the active inference does not contradict folk psychology work there's the continuous time model on the lower scale and then a discrete more switching slower model that could be like an attentional context oh so so there is precedent in terms of having a lower",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.369,
    "end": 2838.51,
    "text": " level continuous model higher level discrete models and then more to taking that to the bigger questions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2838.794,
    "end": 2865.73,
    "text": " there's also some natural empirical correlations with bigger slower things and faster smaller things so to the discussion of well multiple things are represented like space and time some of that is doesn't need to be an open-ended representation it can be like evolutionarily tuned or developmentally tuned or learned and then last comment just on the insects it was a great point",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2865.777,
    "end": 2891.329,
    "text": " line of evidence that's very promising because there's a lot of neurophysiology and neuroanatomy available in insects and just to say that the visual region of the brain this is arthropods and insects and the olfactory as well as the mushroom body have more like stereotypical units and they do have more change in size and more variation in evolutionary",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.309,
    "end": 2916.574,
    "text": " whereas some of the interesting evidence from what you presented from the insect brain is that the actual geometric volume and size of the central body is relatively conserved even as other parts of the brain have a lot of allometry so that suggests that one way or another either it doesn't need to be explained in terms of fulfilling a adaptive function you could just be oh it's a constraint or something like this but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2916.554,
    "end": 2944.283,
    "text": " if it is going to be playing a role which is a fair assumption in an energy limited system then part of its role can't necessarily be improved by making it bigger or smaller yeah i agree you mean relatively bigger or smaller right because i mean the central body does scale a little bit with the insect brain size but it scales less",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2944.567,
    "end": 2946.669,
    "text": " rapidly than the total insect brain size.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2951.854,
    "end": 2956.618,
    "text": "Interesting to see whether it scales with the visual acuity of the insect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2958.64,
    "end": 2964.966,
    "text": "Yeah, how the different regions size and other attributes this could be a mammal and or arthropods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2965.626,
    "end": 2971.772,
    "text": "How are the empirical psychophysics and the just noticeable differences",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2973.44,
    "end": 2985.778,
    "text": " described or explained by like for example just geometric volume of the olfactory lobe whereas if or is there some other variants to be explained yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2987.21,
    "end": 2993.783,
    "text": " Well, but there will be a lot of correlations between, you know, the normal population densities and volumes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2993.863,
    "end": 2996.669,
    "text": "So if volume increase, you may have more neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2997.791,
    "end": 3005.266,
    "text": "Obviously, you know, that's basic Neuropsychology 101 and Vision Neuroscience 101.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3005.286,
    "end": 3008.492,
    "text": "You know, if you lose neurons, your acuity diminishes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3008.472,
    "end": 3018.634,
    "text": " So there seems to be a strong correlation between your angular precision or acuity for many other things, and the number of neurons and connections that those neurons make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.975,
    "end": 3025.148,
    "text": "But after a while, if you lose too many neurons, you have a de-differentiation, like think about neurodegenerative",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3025.567,
    "end": 3032.593,
    "text": " diseases like, you know, take Alzheimer's, for instance, where everything gets disconnected and there is not enough neurons to represent stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3032.934,
    "end": 3053.312,
    "text": "So that I think it would be hard in the, you know, given what is fairly known in neuroscience to reject the importance of the, I'm simplifying here, the number of neurons, the number of neuronal units in your brain and your resolutions capacities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3057.022,
    "end": 3057.523,
    "text": " Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3057.823,
    "end": 3058.084,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.324,
    "end": 3061.429,
    "text": "How about Robert, continue with part two?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.449,
    "end": 3062.35,
    "text": "Shall I?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3063.272,
    "end": 3063.652,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3064.554,
    "end": 3064.754,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3064.774,
    "end": 3065.916,
    "text": "Well, thanks, everybody, for that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3067.718,
    "end": 3069.561,
    "text": "So here's what we've got to on the roadmap.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3069.762,
    "end": 3074.128,
    "text": "We've described the hypothesis, evidence for and against.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3074.148,
    "end": 3075.61,
    "text": "We've done the assessment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3076.452,
    "end": 3078.735,
    "text": "And we're now on to future tests.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3078.755,
    "end": 3082.441,
    "text": "How can we test this weight hypothesis?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3082.661,
    "end": 3085.105,
    "text": "And I'll divide this roughly into",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3085.912,
    "end": 3094.305,
    "text": " What can we tell from the thalamus, from the insect central body, from computational models, from biophysics and from other sources of evidence?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3094.546,
    "end": 3096.148,
    "text": "So I'll just go through some of those.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3098.532,
    "end": 3103.64,
    "text": "So this probability of 0.5 is an unsatisfactory place to be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3103.72,
    "end": 3106.284,
    "text": "We really want to drive the probability up or down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3107.126,
    "end": 3113.556,
    "text": "And so the first thing to do is to stress test the three main groups of evidence that we have already.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3113.806,
    "end": 3116.108,
    "text": " Then we look at other evidence, for and against.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3116.969,
    "end": 3121.995,
    "text": "And there are a lot of possible tests described in this paper, which I've given the link to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3122.035,
    "end": 3126.059,
    "text": "The tests are all in this table here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3126.079,
    "end": 3127.901,
    "text": "Now, I'm not going to go through all the table.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3128.762,
    "end": 3134.988,
    "text": "I'll just say the paper allows you to sample the particular area that may interest you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3135.028,
    "end": 3139.913,
    "text": "So you can just pick out the section that speaks to whatever test you're most interested in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3140.994,
    "end": 3141.535,
    "text": "And I'll just",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3142.527,
    "end": 3144.369,
    "text": " do some dipping and sampling myself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3145.831,
    "end": 3152.14,
    "text": "So the first thing is the so-called, what I call the smoking gum, the specific evidence in the thalamus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3152.34,
    "end": 3158.989,
    "text": "And what this specific evidence is, is there's a picture of thalamus here on the right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3159.189,
    "end": 3164.336,
    "text": "And so thalamus is a round thing at the center of the cortex, which is like a hemisphere around it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3165.037,
    "end": 3171.285,
    "text": "And what you have to notice is the thalamus in mammals has lots of different nuclei, thalamic nuclei.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3172.531,
    "end": 3180.039,
    "text": " And the thalamic nuclei are only very weakly connected to each other, but they are strongly connected both ways to the cortex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3180.88,
    "end": 3188.448,
    "text": "So the question is, why don't the thalamic nuclei move out of the thalamus towards the cortex?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3188.468,
    "end": 3189.669,
    "text": "They're getting away from each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3189.689,
    "end": 3191.971,
    "text": "There's only weak connection with other nuclei.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3191.991,
    "end": 3193.653,
    "text": "They're getting closer to the cortex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3193.673,
    "end": 3197.257,
    "text": "So they're reducing the length of myelinated axons.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3197.577,
    "end": 3199.399,
    "text": "And that would save a lot of energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3200.476,
    "end": 3204.28,
    "text": " So that's the problem with the thalamus under the nuclear model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3204.48,
    "end": 3217.773,
    "text": "If the nuclei exist just to have neural connections to each other, they're very weak neural connections, and energy could be saved by moving out each nucleus towards the cortex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3217.793,
    "end": 3223.398,
    "text": "Whereas if the thalamus has a wave in it, there's a good reason for all the nuclei clustering together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3223.438,
    "end": 3227.462,
    "text": "The nuclei have to be together in the same wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3228.708,
    "end": 3237.38,
    "text": " Now, I've tested this energy argument by actually modeling what happens when you move thalamic nuclei.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3237.4,
    "end": 3241.707,
    "text": "And approximately, obviously, it was a very approximate test on the human thalamus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3242.628,
    "end": 3245.853,
    "text": "And the answer was, yes, you can save energy that way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3245.933,
    "end": 3249.518,
    "text": "So there is a mystery of why the thalamus stays together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3250.299,
    "end": 3252.021,
    "text": "But that was an approximate test.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3252.943,
    "end": 3255.947,
    "text": "I think now that test could be done much more precisely",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3256.332,
    "end": 3258.815,
    "text": " using connectome data, brain connectome data.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3259.196,
    "end": 3268.148,
    "text": "So you could use brain connectome data, you could have a computer program that tries out various moves of nuclei to see if they save energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3268.188,
    "end": 3274.777,
    "text": "So that is the test that you could make this argument about the smoking gun much more precise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3275.999,
    "end": 3280.145,
    "text": "And there's a similar test for the thalamic reticular nucleus, which I won't go into.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3280.165,
    "end": 3282.508,
    "text": "I would say this...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3283.484,
    "end": 3285.748,
    "text": " Sorry to interrupt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.149,
    "end": 3291.478,
    "text": "Is it possible to interact slide by slide, or do you prefer that we... Oh yeah, absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3293.02,
    "end": 3307.365,
    "text": "So I get your energy argument in terms of neurodevelopment or neuroevolution of anatomy and anatomical relationships, though I would argue, I mean, I would",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3308.392,
    "end": 3334.18,
    "text": " not argue, I would, you know, ask you, but, you know, what if in this energy model you take into consideration all the inputs and the outputs from sensory neurons, for instance, from sensory organs, the eyes, for instance, through the optic nerve, and of course, then the output toward the cortex, but also the, you know, motor input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.16,
    "end": 3359.307,
    "text": " uh i'm not sure uh that if you think about all this wiring then your energy model not forgetting all the white matter that you have you know in connectivity that you have between the cortex and the thalamus not sure that the energy model would fare that well that's the question well the basic point is that when i did the approximate calculations i did take account of the upcoming",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3359.641,
    "end": 3366.394,
    "text": " know the sensory neurons coming into thalamus the point is if the thalamus is just a relay",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3366.931,
    "end": 3373.601,
    "text": " pushing data on from sensitive cortex, then moving the thalamic nuclei would be neutral.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3374.202,
    "end": 3382.575,
    "text": "Whereas because there was feedback cortical thalamic connections, you actually gain an energy by moving out towards cortex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3382.935,
    "end": 3386.821,
    "text": "So this calculation has been done, albeit very approximately.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3386.901,
    "end": 3394.052,
    "text": "And I think the opportunity is to do it much more precisely taking account of all thalamic connections from connectome data.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3395.652,
    "end": 3408.674,
    "text": " But you know, of course, and that's really a bit old for me, I haven't been into this literature for a long time, but there are bimodal connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3409.475,
    "end": 3415.686,
    "text": "Yeah, the dynamic nuclei kind of live in silos, but they actually have silos, I don't know, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3415.666,
    "end": 3423.455,
    "text": " modular, but they actually have bimodal or trimodal interactions that are kind of fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3423.816,
    "end": 3427.76,
    "text": "Some of them are modulated by the reticular nucleus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3427.841,
    "end": 3428.862,
    "text": "Is that with each other?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3428.882,
    "end": 3437.833,
    "text": "I understood from Murray Sherman, there's a quote from him that says there are no connections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3438.093,
    "end": 3439.214,
    "text": "He puts it very strictly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3440.155,
    "end": 3444.12,
    "text": "When was that published, remind me?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3444.691,
    "end": 3460.945,
    "text": " well i mean he published his book about thalamus in 2006 but since then he's written a lot of papers about thalamus and and he is well okay yeah sometimes people are very assertive but uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3460.925,
    "end": 3465.25,
    "text": " You have a great old neuroanatomist that I've met in the past, like Gary Vanhausen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3466.851,
    "end": 3471.316,
    "text": "They look at the brain in very, very, very, very small, in minute details.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3471.576,
    "end": 3475.661,
    "text": "They do real microscopic anatomy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.582,
    "end": 3485.591,
    "text": "And the way they see the brain universe is quite different from... I don't know if this neuroanatomist you are talking about works with these methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.852,
    "end": 3489.295,
    "text": "I would be very...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3489.275,
    "end": 3492.438,
    "text": " prudent with connectomic data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3493.78,
    "end": 3494.721,
    "text": "I think they are useless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3494.761,
    "end": 3496.382,
    "text": "But anyway, that's another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3496.402,
    "end": 3498.745,
    "text": "So you're suspicious of connectome data?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3499.445,
    "end": 3504.07,
    "text": "Yeah, all the DWI on DTI data and function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3504.09,
    "end": 3505.812,
    "text": "Okay, that's my personal opinion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3505.852,
    "end": 3506.753,
    "text": "But I'm a radical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3506.773,
    "end": 3509.596,
    "text": "I'm almost you know, I think they are useless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3510.056,
    "end": 3510.797,
    "text": "I think they are useless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3510.857,
    "end": 3513.4,
    "text": "But anyway, we can have another discussion about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3514.321,
    "end": 3514.641,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3516.072,
    "end": 3527.065,
    "text": " Anyway, to me, there's quite a close analogy between this argument about the thalamus staying together and the argument from galaxies for dark matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3527.205,
    "end": 3535.475,
    "text": "In other words, when people looked at galaxies a long time ago, they found there wasn't enough mass in stars to hold the galaxy together by its gravity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3536.016,
    "end": 3537.297,
    "text": "So they invented dark matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3538.158,
    "end": 3543.244,
    "text": "So I think when we look at thalamus, there's not enough neural connections in the thalamus to hold it together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3543.629,
    "end": 3546.273,
    "text": " against the pull outwards towards the cortex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3546.814,
    "end": 3550.54,
    "text": "And so the wave is a bit like dark matter in the thalamus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3550.941,
    "end": 3554.226,
    "text": "So that's the analogy anyway.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3555.168,
    "end": 3562.319,
    "text": "But I think the connectome test should be a precise way of stress testing this hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3564.463,
    "end": 3567.848,
    "text": "Right, the central body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3568.537,
    "end": 3573.723,
    "text": " As I said, the gross anatomy suggests a way, but you can't make the same smoking gun argument.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3574.144,
    "end": 3584.155,
    "text": "But I think there's a lot of detailed anatomy that you look at, of detailed neural connectivity, where the synapses are distributed, and what happens in the compound synapses.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3584.215,
    "end": 3585.477,
    "text": "I think they're very suggestive.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3586.518,
    "end": 3597.531,
    "text": "And there may be not a simple connectome test using nuclei, because I don't think there are nuclei in the central body, but there may be some connectome tests that can",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3597.815,
    "end": 3603.604,
    "text": " reveal whether the neural model actually is sufficient to account for the shape of the central body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3604.185,
    "end": 3606.669,
    "text": "So this, I think, is a very open area for investigation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3607.13,
    "end": 3610.775,
    "text": "I personally like it because I think science should be done on simple things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3610.856,
    "end": 3618.227,
    "text": "And there's this quote from Ramon y Cajal that said, the mammalian brain is like a grandfather tot, the insect brain is like a Swiss watch.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3618.728,
    "end": 3619.449,
    "text": "And I like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3619.649,
    "end": 3621.653,
    "text": "So I think we should look at them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3623.716,
    "end": 3625.138,
    "text": "So the third",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3626.502,
    "end": 3629.845,
    "text": " argument we should stress test is neural computational models.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3631.967,
    "end": 3636.371,
    "text": "I make this claim that understanding 3D space is very elemental.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3636.431,
    "end": 3640.995,
    "text": "It comes before learning, I think, because animals have to do that before they can start learning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3642.896,
    "end": 3649.942,
    "text": "And I've built a model of 3D spatial cognition at level two, and that needs high precision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3649.962,
    "end": 3656.408,
    "text": "And I've had this argument before, neural spike trains only give much less precision in short time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3657.012,
    "end": 3671.005,
    "text": " So what we need to do, I think, is to stress test this argument by really trying to build a model of a neural model of spatial computation using mortal, fallible neurons.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3671.542,
    "end": 3678.17,
    "text": " And one good framework to do this is the free energy principle, because it's got a well-established neural process model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3678.77,
    "end": 3682.995,
    "text": "And if we can make this work with neurons, then maybe a wave's not necessary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3683.215,
    "end": 3687.68,
    "text": "But if we can't make it work with neurons, then that strengthens the case for the wave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3688.441,
    "end": 3689.723,
    "text": "Just another slide on this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3690.343,
    "end": 3698.713,
    "text": "I think we should try and build two models, say, in the FEP.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3699.622,
    "end": 3702.124,
    "text": " perhaps using the level two model as a starting point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3703.726,
    "end": 3713.594,
    "text": "But in the model, neural model, we have to model, do we model spike trains or do we model just a variable neural precision?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3713.614,
    "end": 3716.397,
    "text": "There must be some neural imposition we model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3717.077,
    "end": 3719.84,
    "text": "If we model neural imposition, how do we do gradient descent?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3720.701,
    "end": 3727.907,
    "text": "Because you'll see, I've struck out here, if you do naive calculation of gradients, in other words, you compute",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3728.697,
    "end": 3740.93,
    "text": " a quantity and then you shift some input variable a small amount and you compute the quantity again to compute the derivative, if there are lots of errors, that doesn't work because the imprecision overwhelms the gradient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3742.211,
    "end": 3745.434,
    "text": "So there's an issue there about how you do gradient calculation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3745.494,
    "end": 3747.697,
    "text": "I'm not sure how you tackle that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3749.078,
    "end": 3754.924,
    "text": "Obviously, you can compute gradients explicitly, but it's a more complex computation than computing a quantity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3757.03,
    "end": 3759.532,
    "text": " Next question, how do you do a gradient descent in space?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3760.754,
    "end": 3769.602,
    "text": "And I think in the FEP, a gradient of a free energy is a three vector, and precision in the FEP sense is a tensor, probably.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3771.644,
    "end": 3773.326,
    "text": "What coordinate system do you use?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3773.366,
    "end": 3775.227,
    "text": "Do you use Cartesian coordinates?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3775.468,
    "end": 3775.948,
    "text": "I don't know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3776.048,
    "end": 3779.692,
    "text": "I mean, it seems to me Cartesian coordinates in the brain is a bit unrealistic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3780.652,
    "end": 3785.417,
    "text": "So the key question, I think, is I expect that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3786.072,
    "end": 3790.939,
    "text": " the naive precision of neurons from spike trains is not going to do the job.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3791.019,
    "end": 3797.628,
    "text": "So the question is, can we have some clever neural micro design which gives us high precision and high speed?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3798.769,
    "end": 3805.138,
    "text": "And the final question is, do we use a spatial hierarchy as is common in the FEP or do we use a blackboard?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3806.5,
    "end": 3813.75,
    "text": "Again, I would prefer using both, but the issue of what are the mark of blankets arises there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3814.068,
    "end": 3816.852,
    "text": " So that's the issues we would have in a pure neural model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3818.255,
    "end": 3821.5,
    "text": "In a wave neural model, how do we model a wave?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3821.52,
    "end": 3822.822,
    "text": "Do we build a physical wave?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3822.882,
    "end": 3825.707,
    "text": "Now, that suggestion is not quite so stupid.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3827.63,
    "end": 3828.631,
    "text": "One could build it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3829.112,
    "end": 3838.347,
    "text": "In the very early days of computing, there was a thing called a mercury delay line memory, which actually used a wave for storage in one dimension.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3838.948,
    "end": 3841.392,
    "text": "And we could build something like that in three dimensions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3841.692,
    "end": 3847.359,
    "text": " I think that would be very expensive, not as expensive as building a quantum computer, but very expensive anyway.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3847.92,
    "end": 3853.326,
    "text": "So do we simulate a physical wave or do we just simulate the memory parameters that we get?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3853.506,
    "end": 3856.19,
    "text": "So simulate the precision and the capacity and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3857.511,
    "end": 3861.696,
    "text": "I would prefer to start with a simple simulation of the memory parameters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3862.377,
    "end": 3867.763,
    "text": "And in other words, I like to move down from level two to level three in successive stages.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3869.005,
    "end": 3870.687,
    "text": "So that's, um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3871.308,
    "end": 3874.132,
    "text": " the active vision in exploration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3874.632,
    "end": 3881.301,
    "text": "Another area we can look at is if there is a wave in the brain, it should show up in genomics and proteomics somewhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3882.582,
    "end": 3888.249,
    "text": "And there should be some genes which are expressed only in certain places like in the thalamus or in the insect central body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3889.911,
    "end": 3898.362,
    "text": "All those genes may, the proteins may be particularly affected by anesthetics because on the hypothesis of anesthesia,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3898.696,
    "end": 3907.609,
    "text": " disables spatial cognition, disables the wave, you might expect a link between those proteins and anesthetic molecules.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3907.629,
    "end": 3918.265,
    "text": "And we're looking for proteins which not only sustain the wave, but also proteins involved in neural transmitters and receivers, which exchange information with neurons.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3919.207,
    "end": 3923.493,
    "text": "And I think that's a promising line of investigation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3923.894,
    "end": 3927.96,
    "text": "If we find any possible proteins, they could help to constrain the biophysics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3928.328,
    "end": 3929.71,
    "text": " which I think comes next.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3931.071,
    "end": 3934.135,
    "text": "Biophysics of the brain is absolutely wide open.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3934.195,
    "end": 3935.597,
    "text": "I have no idea, really.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3935.617,
    "end": 3939.862,
    "text": "There are some very preliminary clues, and I think most of the ideas are probably wrong.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3940.482,
    "end": 3942.985,
    "text": "But the key thing is the way it needs to store information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3943.045,
    "end": 3945.648,
    "text": "It must persist for fractions of a second.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3945.769,
    "end": 3954.018,
    "text": "So it's probably not purely electromagnetic because, as David said, that's an epiphenomenon of activity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3954.659,
    "end": 3957.222,
    "text": "So could it be a coherent quantum effect?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3958.197,
    "end": 3966.269,
    "text": " The problem with quantum mechanics, of course, is that decoherence removes it very quickly and you have to somehow conquer decoherence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3967.511,
    "end": 3970.075,
    "text": "There are ways to combat decoherence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3971.697,
    "end": 3975.803,
    "text": "I'm particularly interested in looking at nuclear spins.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3975.883,
    "end": 3984.316,
    "text": "There's a chap called Fisher who's looked at spins of the phosphorus molecule, which he claims can have coherence times as long as seconds or even minutes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3986.439,
    "end": 3987.04,
    "text": "There is this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3988.488,
    "end": 3994.596,
    "text": " possibly attractive idea that the wave could be in a Bose-Einstein condensate or a Froehlich condensate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3997.059,
    "end": 3999.181,
    "text": "So there are all these questions, all these possibilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3999.261,
    "end": 4006.29,
    "text": "I haven't really any strong direction or other, but we have to answer the question, A, how does the wave persist?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4006.45,
    "end": 4008.112,
    "text": "And B, how do neurons couple to it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4009.134,
    "end": 4012.758,
    "text": "And we might get a clue in that respect from single-celled animals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4012.938,
    "end": 4014.36,
    "text": "We'll come to that in the next slide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4015.91,
    "end": 4018.573,
    "text": " But I'm saying this is a tremendously difficult problem.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4018.713,
    "end": 4022.858,
    "text": "And just because we can't think of an answer, we shouldn't underestimate evolution.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4024.36,
    "end": 4030.707,
    "text": "And I think broadly, we need to find some possible mechanism before we can start looking for it experimentally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4034.171,
    "end": 4035.413,
    "text": "This is intriguing to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4036.214,
    "end": 4040.399,
    "text": "There are single-celled animals like erypsophages.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4040.419,
    "end": 4041.66,
    "text": "I can't pronounce it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4041.68,
    "end": 4042.782,
    "text": "It's a single-celled animal.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4042.822,
    "end": 4044.043,
    "text": "It's a kind of vanavide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4044.698,
    "end": 4046.46,
    "text": " And it has complex behavior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4046.601,
    "end": 4048.503,
    "text": "It hunts and eats crustacean eggs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4049.044,
    "end": 4055.933,
    "text": "And it has something in it which looks suspiciously like a lens of an eye and something which might well be a retina.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4055.993,
    "end": 4058.156,
    "text": "So does it have a lens and a retina?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4058.977,
    "end": 4062.662,
    "text": "If so, how does it use that information if it hasn't got any neurons?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4063.643,
    "end": 4065.125,
    "text": "How does it guide its own behavior?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4066.247,
    "end": 4068.189,
    "text": "Can there be a brain without any neurons?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4069.09,
    "end": 4071.874,
    "text": "And could that be a precursor for all the brains?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4072.235,
    "end": 4073.997,
    "text": "Could it evolve in",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4074.466,
    "end": 4077.676,
    "text": " pre-Cambrian era and persisted through the Cambrian era.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4078.158,
    "end": 4082.612,
    "text": "So I think there is something to be learned by looking at these single-celled animals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4084.658,
    "end": 4087.508,
    "text": "May I comment again?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4087.528,
    "end": 4088.29,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4088.978,
    "end": 4090.16,
    "text": " I totally agree with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4090.28,
    "end": 4095.126,
    "text": "If you look at paramecia, obviously they are very sophisticated sensorimotor schemes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4095.607,
    "end": 4105.761,
    "text": "There is some evidence that they can have some memory, they can be conditioned, they have potentiation, some of them like spirostomum, if I remember well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4106.241,
    "end": 4117.737,
    "text": "And obviously the computation, quote-unquote, or the analog computation, if you prefer, is going through molecular networks, but works exactly as well as a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4117.717,
    "end": 4125.01,
    "text": " as a collection of neural animals so that's also is telling that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4125.04,
    "end": 4153.039,
    "text": " computation again quote-unquote memory and active inference can go through many type of biological networks and so we shouldn't think that because the neurons are the most apparent and they are very very sophisticated and complex that there are no other kind of unknown for us mechanism of computations that go through biological network or protein network if you wish",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4153.019,
    "end": 4156.623,
    "text": " That, I think, is a very interesting hypothesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4156.924,
    "end": 4164.372,
    "text": "The multi-scale interaction between all those things is also kind of an entire universe that we barely understand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4164.413,
    "end": 4174.064,
    "text": "Microglial cells, now we understand better that they have not just a trophic role but a very sophisticated computational role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4174.084,
    "end": 4180.832,
    "text": "So anyway, I think that's a very important thing to consider for the future of neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4182.685,
    "end": 4183.506,
    "text": " Great, thanks, David.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4185.068,
    "end": 4188.551,
    "text": "So I've really finished my talk.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4189.152,
    "end": 4190.313,
    "text": "Over to discussion again.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4192.175,
    "end": 4204.949,
    "text": "So some of the topics we might touch on with the connectome issue, or particularly the computational model, very interested to hear Carl and Alex on that, and insect brain studies, and even the biophysics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4205.149,
    "end": 4209.013,
    "text": "So over to you, please.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4222.105,
    "end": 4230.433,
    "text": " Well, Alex is preparing his revealing answers and commentary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4230.593,
    "end": 4232.135,
    "text": "I'll talk rubbish for a moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.516,
    "end": 4237.94,
    "text": "So I just pick up on the sort of practical issue of the connector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4237.98,
    "end": 4251.353,
    "text": "I think David was showing an understandable allergic response to connector based upon diffusion weighted imaging using non-invasive magnetic resonance imaging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.333,
    "end": 4259.024,
    "text": " I think what you're talking about is this connectivity that could be tracing studies, it could be supplemented with probabilistic tractography.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.364,
    "end": 4265.012,
    "text": "So if you just don't use the word connectome, I think you'll be fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4265.093,
    "end": 4277.871,
    "text": "Just talk about connectivity studies, which are usually definitively based upon sort of, you know, staining and tracing at a microscopic level as opposed to reconstructions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.793,
    "end": 4280.935,
    "text": "For me,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.708,
    "end": 4300.215,
    "text": " Well, the tests of the hypothesis, for me, the ones that you've offered, they do invite rather deflationary responses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4300.275,
    "end": 4310.77,
    "text": "So for example, the arguments that a single neuron firing over a 256 millisecond period",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4310.75,
    "end": 4324.286,
    "text": " cannot contain the sufficient statistics required for spatial temporal precision of the sort required for spatial navigation at a certain space-time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.808,
    "end": 4337.922,
    "text": "One simple way of countering that, well, that's true, but if you give me 10 to the 3 of these spiking neurons, and I can now just write down the ensemble average, then they do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.902,
    "end": 4346.997,
    "text": " So the whole precision argument can be, I think, almost dissolved without making any empirical moves or any tests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4347.017,
    "end": 4347.958,
    "text": "Can I come in on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.1,
    "end": 4353.167,
    "text": "I think if the test... No, you've had your chance, Robert.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4353.207,
    "end": 4354.088,
    "text": "No, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4356.051,
    "end": 4362.542,
    "text": "Just briefly, the test of the precision argument is to build a model that works and, by the way, do it for an insect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4363.653,
    "end": 4366.226,
    "text": " Yeah, so I think we're getting pretty close to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.01,
    "end": 4369.242,
    "text": "And in so doing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.424,
    "end": 4382.244,
    "text": " you actually appeal explicitly to mean field approximation, which is exactly modeling the probability distribution of populations or ensembles in the statistical mechanics sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.685,
    "end": 4394.503,
    "text": "So I'm reminded now of Rodney Douglas's ambition for the EU to build a B. I think if you look at certain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4394.483,
    "end": 4416.379,
    "text": " drone, rumba, applications of SLAM, simultaneous localisation and mapping in industry, actually out there, you will find that not perhaps to the level of a bumblebee, but certainly sufficient to clean up the airport floor amidst moving passengers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.7,
    "end": 4419.124,
    "text": "That kind of technology is already there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4419.104,
    "end": 4442.226,
    "text": " um and you know i would imagine in about three years you will have um the same kind of technology um operating at the level of drones and and at that point i think you can say yeah we can do this without without a wave hypothesis um yeah but drones with respect have perfect theoretical accurate neurons they don't have mortal neurons",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4444.13,
    "end": 4455.642,
    "text": " That's the point being that you can simulate a population of mortal neurons such that the random uncertainty averages to zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4455.962,
    "end": 4458.225,
    "text": "So this is what is meant by mean field approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.245,
    "end": 4461.648,
    "text": "So that all of stochastic and statistical thermodynamics rests upon this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.009,
    "end": 4465.052,
    "text": "So the density dynamics itself now becomes deterministic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.432,
    "end": 4471.639,
    "text": "You are still modeling something which can be quite noisy with lots of random fluctuations and thermodynamics underneath them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4471.619,
    "end": 4499.871,
    "text": " but the density dynamics of the kind that quantum physics would appeal to is actually deterministic but i'm not i'm not you know the reason i sort of was teasing you said you can't respond because it's our turn now was i don't think i don't think these are important arguments to me the important argument is something which came out in the last discussion and yeah i think daniel summarized very nicely is is there any top-down causation between the wave",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.851,
    "end": 4519.395,
    "text": " and the neurons that are controlling my body and my eyes um and um you know because i could argue that it's all bottom-up causation and just rewriting neuronal density dynamics or population dynamics in fourier space yeah everybody does that even to the extent of um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.375,
    "end": 4526.263,
    "text": " focusing on the relevant variables as the rate of change of phase, which, Robert, you were saying that was a really interesting interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4526.523,
    "end": 4530.187,
    "text": "Yeah, that is the Kuramoto model of neural dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4530.327,
    "end": 4531.709,
    "text": "This has been around for decades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4532.029,
    "end": 4548.488,
    "text": "People do work in this space, but the assumption is that you are basically appealing to a bottom-up causation from some underlying mortal computation at the level of neurons, and then you're just lifting it to a level of description in a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4548.468,
    "end": 4561.026,
    "text": " in a Fourier space or in a phase space with the right kind of dynamics, making all the arguments that you have made in favor of the wave hypothesis, it seems to me the important thing is a top-down causation that destroys the biological thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4561.487,
    "end": 4564.451,
    "text": "So I'm just trying to think about tests of top-down causality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.712,
    "end": 4571.482,
    "text": "Of course, not easy to do, but I'm just wondering, you know, if I squashed your thalamus, would you have different spatial cognition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4571.822,
    "end": 4573.885,
    "text": "So I preserve the connectivity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4573.865,
    "end": 4576.289,
    "text": " but I actually changed the shape of your thalamus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4576.749,
    "end": 4588.708,
    "text": "Things like that, I think, would be more compelling demonstrations of the top-down causation, which I think is at the heart of your spatial wave hypothesis, that it's not just an epiphenomenal bottom-up consequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4589.008,
    "end": 4589.889,
    "text": "It actually matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4589.909,
    "end": 4593.595,
    "text": "This wave, my neurons have to be immersed in this wave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.575,
    "end": 4618.89,
    "text": " to function properly and it matters where they are and in that mortal sense it matters um that the anatomical constraints afforded that support this wave will have an influence on neural dynamics and subsequent belief updating and movements and sense making and projected geometries and so i don't don't have an answer but i would look into you know at those things that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.87,
    "end": 4632.655,
    "text": " if you like, address the notion of circular causality from the point of view of physics, and in particular, drill down on what would it mean to demonstrate empirically top-down causation in the sense of the spirit of George Ellis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.517,
    "end": 4636.582,
    "text": "So that's where I took from that conversation, that exchange.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.724,
    "end": 4638.786,
    "text": "I agree, heartwarming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4641.382,
    "end": 4664.605,
    "text": " honestly i think even though carl you said you're just gonna you know babble or say rubbish i think that was the most important point because that touches on the things that we even discussed in the mortal computation thesis framework um and that was actually so i don't know if i have the wonderful insightful answer that you claimed i might produce but uh just to speak to what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.585,
    "end": 4685.226,
    "text": " you said and uh and what robert discussing i think that is what relies the most important if we're going to build computational models which obviously appeal to me quite a bit uh and the mortal computation thesis said well okay the real way to do this is we would take actual substrate like for example a neuromorphic chip if we were doing artificial",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.573,
    "end": 4695.785,
    "text": " or we would work with xenobots or anthrobots and build little systems of these actual biotic or chimeric type of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.905,
    "end": 4698.508,
    "text": "But we did discuss virtual morphology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4698.528,
    "end": 4704.416,
    "text": "So I think you could just go down to the simulation route, which touches on what you said, Robert, about, well, we could build waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.576,
    "end": 4707.199,
    "text": "We have examples of those, but those come with some difficulties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.6,
    "end": 4708.861,
    "text": "We could just simulate them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.042,
    "end": 4714.909,
    "text": "And I think the answer to answering the question, how do neurons...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.889,
    "end": 4728.594,
    "text": " couple to the waves and what does that look like and how do we build those computationals might be one of the most important questions, I think, in building any testable computational model in any useful simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.075,
    "end": 4730.417,
    "text": "I do think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.397,
    "end": 4758.784,
    "text": " probably what i was saying in the earlier discussion about looking at resonator neurons or resonating dynamics uh which has some history and as well as uh the cognitive math learner and the stuff of some holographic memory which kind of builds on the complex number representation and the wave representation and how do you encode that in spiking dynamics i think that might be an interesting and useful building block and i will send daniel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4758.764,
    "end": 4763.289,
    "text": " and you some information and then you could look and see if that's rubbish or if that might be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.349,
    "end": 4770.796,
    "text": "But I think that might be important building blocks to actually building a workable computational model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.097,
    "end": 4775.381,
    "text": "I do think simulating the wave could be interesting to from a different direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4775.421,
    "end": 4784.991,
    "text": "I was another thought that you produced was from nature inspired meta heuristic computation or optimization where we model things like bumblebees",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4784.971,
    "end": 4807.873,
    "text": " and beehives and ants and ant colonies and i know daniel has done work with ants as well and likes them quite a bit um and also we've done things with bats echolocation and wave transmission so if we model mathematical waves at least we could use that or frameworks for metaheuristic computation and sort of backwards build that let's say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.853,
    "end": 4825.238,
    "text": " derive the computational mechanisms that could allow us to couple neurons to use that information and then we could do actual simulations of different waves of different properties we can model the frequencies we can kind of control those hyper parameters and then in doing so we could then look at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.218,
    "end": 4838.419,
    "text": " what Carl was then bringing up, which is one of the key essences of mortal computation, which is that spatial arrangement, that anatomical organization of neurons and their particular components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.261,
    "end": 4842.045,
    "text": "Then you could also do tests like, okay, if we build them in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.025,
    "end": 4858.413,
    "text": " a spherical kind of construct, or we build them in such an anatomical construct that is conducive to those simulated waves, then you could do what Carl said computationally, which is we could change the shape of these computational thalamus models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4858.613,
    "end": 4867.628,
    "text": "We could make them cubic or other types of weird shapes and see if squashing them changes, for example, how these neurons respond on simple",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4867.608,
    "end": 4869.49,
    "text": " cognitive tasks that we can emulate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4869.551,
    "end": 4889.257,
    "text": "Again, we could use very simple spatial cognition tasks that we could simulate, and then we could start manipulating the actual virtual morphology, as Caller and I would call it, or just the virtual anatomy, and then that could give you some at least computational tests of the effect and value of weight computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.817,
    "end": 4897.227,
    "text": "I think that's the key, and I'm not even sure if what I just said mostly is rubbish and just means kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.207,
    "end": 4906.086,
    "text": " generating what i would do if i had to build something like that and i think that might be one of the single most important questions because i think it answers both",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4906.572,
    "end": 4910.557,
    "text": " Neural models without waves and neurons plus waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.778,
    "end": 4912.58,
    "text": "As you said, we need to build both those models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4912.62,
    "end": 4919.269,
    "text": "And I think that kind of coupling and that modeling of that relationship is a first step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4919.289,
    "end": 4926.379,
    "text": "And then, of course, then you could then start to look at actual physical constructs that emulate that computation, kind of like a reverse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.399,
    "end": 4932.948,
    "text": "We're using computation to drive what we think the structure should be and then say, are there actual structures that we find?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4932.968,
    "end": 4935.111,
    "text": "And then we can constrain our models a little bit better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4935.091,
    "end": 4945.79,
    "text": " as we do have an atomic or we do have computational models of thalamic structures, like Chris Eliasmus Group has a thalamus structure in their Nengo framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4946.351,
    "end": 4950.619,
    "text": "Again, Spawn, I think, has like a thalamus component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.599,
    "end": 4953.586,
    "text": " And those are very biophysically grounded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4953.646,
    "end": 4958.436,
    "text": "They use anatomical values, things that are actually grounded from neurophysiological data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.777,
    "end": 4960.601,
    "text": "So that could be an interesting starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.761,
    "end": 4970.262,
    "text": "And that could allow us to then actually test and simulate what Carl was saying about squishing and stretching and changing the form of the thalamus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4970.242,
    "end": 4985.124,
    "text": " So that's something I thought might be worth mentioning, and that's where the mortal computation thesis really comes in play because, again, it's that specific morphological arrangement, that actual construction and relationship between neurons that's really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.364,
    "end": 4987.427,
    "text": "And changing that would change the computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4987.487,
    "end": 4996.08,
    "text": "That's what another byproduct of our framework was basically saying is that you're not going to get the same computation if you change the anatomy, if you change this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4996.06,
    "end": 5017.714,
    "text": " um so that's that's an important part and then just quickly i wanted your last slide before this one i don't know how to pronounce the name of that uh that entity either um but i thought that was really interesting because it you were saying it has essentially like a little eye but it doesn't have any known neurons or anything that we can perceive directly so could that be neurons",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5017.694,
    "end": 5047.482,
    "text": " without cognition and I think that gets that to what Michael Levin and again Carl and I cite and talk with him a lot which is the idea of basal cognition and I think that's kind of where we don't really have that quite right from a computational point of view so I do think that's even more important to try to model these elementary cognitive systems and again looking at these building computational models I think of like that single cell organism could be valuable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.647,
    "end": 5060.782,
    "text": " and maybe give us some insights as to, well, okay, what is it that we need to get this thing to actually solve very, very simple tasks like follow gradients of chemicals, which we do that in chemotaxis and phototaxis experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5060.822,
    "end": 5067.47,
    "text": "And we do build little models of, for example, E. coli, trying to traverse these little niches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.49,
    "end": 5076.861,
    "text": "And I think that's the other part that you're going to need in building even simulated versions of what you seek, which is you're going to need that virtual niche",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5076.841,
    "end": 5104.3,
    "text": " because again and you point out robert which i was happy to see that that you know you're what you're thinking is that it's uh elemental embodied but i think the other part that can't be ignored if you're going to properly uh examine and simulate mortal computing systems is you need a niche you need that more uh virtual environment to actually and those physical properties need to be very explicit um when you build it so i think that that was something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5104.28,
    "end": 5112.632,
    "text": " that I think is going to be also very difficult, but probably the most important to make the next step for model computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.692,
    "end": 5115.816,
    "text": "And hopefully some of that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5117.038,
    "end": 5117.799,
    "text": "No, thanks, Alex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5118.079,
    "end": 5125.169,
    "text": "I agree with you that the simple animals, the simple, simple brains are the place to look.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5125.409,
    "end": 5131.097,
    "text": "I always recall that quantum mechanics started with the hydrogen atom, not with the uranium atom.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5132.596,
    "end": 5136.005,
    "text": " I'll actually kind of add a complimentary view.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5136.025,
    "end": 5145.812,
    "text": "I was wondering to what extent will the kind of representationalist form and context for the way that you described in humans",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5146.231,
    "end": 5150.737,
    "text": " be of maybe even a slightly different kind in a single cellular or in an insect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5150.817,
    "end": 5162.411,
    "text": "So for example, there's the outfielder catching a fly ball who, yes, you might be able to describe that in terms of the spatial temporal frequency of the baseball moving through space and the body moving through space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5162.892,
    "end": 5175.107,
    "text": "There also may be a heuristic such as following a gradient of shade that also gives a behavioral solution or even an indistinguishable approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5175.188,
    "end": 5196.64,
    "text": " so that may speak to again the variety of possible substrates of mortal computers because the insect central body and this is the to the empirical point how can we differentiate the situation where spatial representation is happening with or without a causality closure",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5196.687,
    "end": 5216.063,
    "text": " from where behavioral strategies are integrated like moving away from a shadow for a fly it may not require the spatial precision on the object so actually just determining where and how variation across",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5216.043,
    "end": 5228.819,
    "text": " different species and across individuals and settings, how would we differentiate that from a null hypothesis where neural or wave, wave particle or both or neither, we don't even need to invoke space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5229.66,
    "end": 5231.563,
    "text": "We just invoke reflexive behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5232.905,
    "end": 5233.385,
    "text": "I agree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5233.465,
    "end": 5234.867,
    "text": "That's a very important question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5234.907,
    "end": 5239.553,
    "text": "It's addressed a little bit in the paper, but what we need is tests of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5240.478,
    "end": 5249.754,
    "text": " insect behavior, for instance, which depend on the 3D spatial model and which don't depend on just, as you say, detecting a shadow or detecting a looming thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5250.936,
    "end": 5253.32,
    "text": "And it's quite difficult to devise those tests.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5254.422,
    "end": 5254.663,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5255.504,
    "end": 5259.892,
    "text": "I'll read a question from the live chat and anyone can give a thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5259.912,
    "end": 5260.092,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5261.154,
    "end": 5263.498,
    "text": "Courtney writes, thank you for the interesting talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5264.305,
    "end": 5270.153,
    "text": " Could this theory be used to test whether or not someone in the ICU with brain damage is conscious?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5270.233,
    "end": 5275.28,
    "text": "And if so, to what degree could it be tested similarly to integrated information theory?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5275.661,
    "end": 5277.523,
    "text": "Or are we far away from something like that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5280.828,
    "end": 5288.418,
    "text": "I'd say we're far away because even experimentally finding the wave is far away.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5288.478,
    "end": 5293.485,
    "text": "We have to work out what the biophysics of it is before we can build detectors for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5293.904,
    "end": 5302.439,
    "text": " And that may be as far away as detection of dark matter or for the neutrino, for instance, that was theoretically predicted.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5302.459,
    "end": 5304.182,
    "text": "It took 25 years to find it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5304.282,
    "end": 5307.928,
    "text": "I think it may take a long time to find a wave experimentally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5307.988,
    "end": 5312.336,
    "text": "So in terms of measures of consciousness, I'd say we're a long way off.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5314.599,
    "end": 5315.421,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5316.483,
    "end": 5319.608,
    "text": "Ken, David, please go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5321.63,
    "end": 5351.232,
    "text": " well i just wanted to mention one thing um that this whole discussion reminded me of a long time ago i think i was in graduate school i read a book by ralph d ellis not to be confused with the george ellis that um that uh carl mentioned but it's called a book called an ontology of consciousness and if if my memory serves it defends just the general idea that consciousness is a wave",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5351.92,
    "end": 5357.053,
    "text": " and defends the kind of wave medium model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5357.455,
    "end": 5359.177,
    "text": " thinking about the mind body problem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5359.937,
    "end": 5365.722,
    "text": "And I just remember it being very interesting, but I don't, but that's so long ago that you might read it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5365.742,
    "end": 5370.386,
    "text": "I might read it now and be totally disappointed, but just something to throw out there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5371.067,
    "end": 5371.808,
    "text": "Send me the reference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5371.828,
    "end": 5372.388,
    "text": "That'd be great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5372.688,
    "end": 5372.869,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5373.429,
    "end": 5373.709,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5373.729,
    "end": 5374.49,
    "text": "Ralph DL.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5374.69,
    "end": 5383.138,
    "text": "I can send you that an ontology of consciousness, but I do remember being, being struck by it as being sort of plausible, but you know how those things go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5383.218,
    "end": 5386.821,
    "text": "It's like it's metaphysics is ontology, you know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5387.729,
    "end": 5398.903,
    "text": " You're pretty far away from physical testing, but in terms of some of the sort of theoretical advantages of thinking about it that way, it might be worth a look.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5411.911,
    "end": 5441.783,
    "text": " put it in the chat thank you david any thoughts and then anyone watching can write any last questions and then otherwise robert let's hear like what are your next moves and just kind of summarize the commentary affordance maybe i can you know i i this is the kind of question that you know anybody interested in topics struggle with in kind of uh okay what is the sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5442.927,
    "end": 5457.932,
    "text": " integrative mechanism that is required to understand things like consciousness how does it relate to the brain with all the limitation of both you know theoretically and methodologically of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5458.486,
    "end": 5460.43,
    "text": " contemporary neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5461.352,
    "end": 5478.03,
    "text": "I'm totally open now at this point to the possibilities that here there is, you know, some form of physics that we haven't understood about the brain, or that is related to the brain or interact with the brain and becoming like, even open to some form of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5478.466,
    "end": 5481.13,
    "text": " you know, physical dualism, I don't know you would call that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5483.113,
    "end": 5495.893,
    "text": "I'm sure that it's going to be very hard to progress with that, that we are still at a sort of metaphysical age of this type of science and discoveries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5496.955,
    "end": 5499.799,
    "text": "We don't have the principle yet, maybe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5499.779,
    "end": 5525.77,
    "text": " I doubt, but I'm not a physicist, so it's really like, you know, no matter talking that a Bose-Einstein condensate will address the question, I mean, think about the size that has been achieved, the maximal size of Bose-Einstein condensate, and under what circumstances, irrespective of, you know, okay, temperature issue, you know, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5525.75,
    "end": 5532.773,
    "text": " it's what like a picoliter like a billion uh atoms um so you would have like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5533.175,
    "end": 5560.431,
    "text": " billions and billions of Bose-Einstein condensate that would have... I mean, it seems as... I don't have a good gut feeling about it, but there is also more mundane things like, you know, we had this discussion about electromagnetic wave in the brain at the kind of macro scale or meso scale as epiphenomenon, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5560.411,
    "end": 5577.728,
    "text": " As I said before, although I don't recall the names of the authors working on that, but there is a bunch of labs and researchers working on that, there is now, or at least there is some theoretical, well-formulated theoretical ground and some empirical evidence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5577.708,
    "end": 5592.763,
    "text": " For inductive mechanism in the brain, basically you have currents going through your axons, bundles of fibers, your action potential, if you wish, that are associated with those currents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5592.743,
    "end": 5603.599,
    "text": " that induce electromagnetic waves that propagate and may have a role of, for instance, synchronization with another bundle just next to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5603.639,
    "end": 5607.304,
    "text": "So those things are very minute as effects, apparently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5608.366,
    "end": 5612.812,
    "text": "They don't have a very, very large, long-range effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5612.973,
    "end": 5615.376,
    "text": "That's because of biophysical constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5615.356,
    "end": 5640.182,
    "text": " if i recall well but it talks about the possibility that you know we may not want to throw the baby out of the bath water classical electromagnetism may still have something to say and in particular if this kind of induction mechanism uh which is literally top down i mean the downward causation if you wish you know there is a fiber bundle that generates",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5640.162,
    "end": 5656.213,
    "text": " electromagnetic waves that then affect currents in another fiber bundle we could say well you know then you could imagine something quite sophisticated and in which the role of anatomy gross anatomy the shape of the brain organization then might become",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5656.193,
    "end": 5669.411,
    "text": " very important to understand because of course the relationships, if those electromagnetic wave induction are short range, you know, how you bring anatomically things closer in order to make them interact becomes very important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5669.851,
    "end": 5672.395,
    "text": "And maybe that connects back to your thalamic hypothesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5672.815,
    "end": 5681.246,
    "text": "But again, what I'm talking about is very, very, very speculative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5681.266,
    "end": 5681.827,
    "text": "Thanks, David.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5682.268,
    "end": 5682.488,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5683.801,
    "end": 5684.382,
    "text": " I agree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5685.543,
    "end": 5691.03,
    "text": "My feeling is the biophysics is wide open, so an electromagnetism may well be a part of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5693.113,
    "end": 5695.516,
    "text": "And you used Mars levels earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5695.656,
    "end": 5699.701,
    "text": "It's possible the wave has different implementations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5699.801,
    "end": 5708.712,
    "text": "I think this conversation brought up a lot of different dimensions and also even begets bigger questions like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5709.94,
    "end": 5712.683,
    "text": " do scientific hypotheses have for and against?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5712.883,
    "end": 5730.943,
    "text": "Is there only one hypothesis chosen or could there be functionality distributed across multiple biophysical systems such that something being a binary true or false, which is kind of predicated the whole Bayesian epistemology, that doesn't necessarily need to be true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5731.003,
    "end": 5736.169,
    "text": "There could be a utility continua for a theory and a predictive continua.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5738.852,
    "end": 5739.913,
    "text": "Yeah, I guess...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5741.243,
    "end": 5757.64,
    "text": " The hint is that since there's a hint of the wave in both the thalamus and insects at opposite ends of the animal tree, evolutionary tree, that the wave hypothesis might carry across the whole lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5758.22,
    "end": 5767.85,
    "text": "And in which case you ask, is it convergent evolution and different species, different branches, or did it go right back to the primordial branch before the Cambrian era?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5768.291,
    "end": 5769.732,
    "text": "I would like it to go right back.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5770.133,
    "end": 5799.027,
    "text": " yeah in that case you can consider like arthropods or look how far back but insects are only one kind of arthropod and they have enough homology that you might be able to extend this argument and do ancestral state reconstruction on neuroanatomy at different levels and these analyses may have already been done and then the allometry of those reconstructions can be compared to yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5799.26,
    "end": 5803.184,
    "text": " Any last comments or Robert would last word?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5805.185,
    "end": 5808.408,
    "text": "Yeah, well, many thanks to all of you for your comments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5809.029,
    "end": 5812.972,
    "text": "It's been most useful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5813.293,
    "end": 5824.002,
    "text": "And I guess I just finally request if I would like to have to get some commentary from all sorts of people on this hypothesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5824.042,
    "end": 5829.047,
    "text": "So if you would send me some comments, just initial ones,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5829.432,
    "end": 5838.146,
    "text": " and gut reaction comments, if you like, on this core question of can we dismiss the wave hypothesis, or do we need to take it seriously?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5838.726,
    "end": 5841.791,
    "text": "Then that would kind of kick off some of the commentary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5842.532,
    "end": 5845.597,
    "text": "Anyway, many thanks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5845.617,
    "end": 5848.321,
    "text": "Thank you to all the guests, and thank you, Robert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5848.722,
    "end": 5849.563,
    "text": "All right, farewell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5850.385,
    "end": 5850.645,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5850.765,
    "end": 5851.947,
    "text": "Bye, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5852.828,
    "end": 5852.969,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5853.409,
    "end": 5853.87,
    "text": "Thank you, Robert.",
    "speaker": "SPEAKER_00"
  }
]