[
  {
    "start": 8.182,
    "end": 32.923,
    "text": " hello welcome everyone we are in active inference guest stream 82.5 on april 14th 2025 discussing computers meaning and consciousness with robert warden and guests and guests so robert thank you for joining and for assembling this group to you to kick off this discussion",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 35.114,
    "end": 35.554,
    "text": " Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 36.115,
    "end": 37.596,
    "text": "Hi, thanks everybody for attending.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 38.617,
    "end": 41.961,
    "text": "I'm going to be talking as it says on computers, meaning and consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 44.123,
    "end": 45.144,
    "text": "Let me get straight into it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 45.404,
    "end": 48.947,
    "text": "What I'm going to be talking about is largely negative results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.967,
    "end": 52.211,
    "text": "And here are the two key negative results of this talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 52.971,
    "end": 59.277,
    "text": "One is that the information inside a computer doesn't define what the computing computation is about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 59.358,
    "end": 62.961,
    "text": "And that is because information in the computer is encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 64.072,
    "end": 72.62,
    "text": " And the second negative result is if the brain is only a computer, if it's thought of as only a computer, then it cannot be conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 73.08,
    "end": 77.884,
    "text": "So those are two quite paradoxical results and I expect you to be puzzled by them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 78.645,
    "end": 93.538,
    "text": "As I go through, I would really be grateful if people would put up their hands at any time and if there's something that's really perplexing about it, ask a question because very much my purpose is to find out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 93.805,
    "end": 97.01,
    "text": " what people don't understand about these results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 97.07,
    "end": 104.761,
    "text": "And what I think the argument to these results is fairly simple argument, but it's paradoxical and counterintuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 105.982,
    "end": 111.851,
    "text": "And I expect people to be puzzled, and I would like people to speak up when they are puzzled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 111.871,
    "end": 115.736,
    "text": "Okay, so those are the negative results I'm going to be talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 117.679,
    "end": 119.261,
    "text": "And this is one way to remember them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 120.543,
    "end": 123.407,
    "text": "It's like an incompleteness theorem for computers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.961,
    "end": 129.066,
    "text": " And what it says is the physical events inside a computer don't define what it computes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 129.626,
    "end": 131.148,
    "text": "They don't define what it's about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 132.769,
    "end": 135.312,
    "text": "And this, as I say, is because the information is encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 135.892,
    "end": 143.94,
    "text": "External information is required in order to interpret or decode the physical events in a computer as a computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 145.362,
    "end": 149.806,
    "text": "So that's basically what it's about, an incompleteness theorem, a negative result.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 150.326,
    "end": 152.128,
    "text": "I think as an incompleteness theorem,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.665,
    "end": 154.087,
    "text": " It can be quite important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 154.988,
    "end": 156.77,
    "text": "However, I've got another slide here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 157.231,
    "end": 168.225,
    "text": "So basically to try and understand the results, the first result is not original result is that computation itself is not a physical process in itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 168.685,
    "end": 181.221,
    "text": "It is our interpretation of a physical process and interpretation, but made by an external interpreter, usually people, but sometimes not people using a decoding of the physical events in the computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 182.146,
    "end": 189.393,
    "text": " And the information running inside a computer is encoded, so it doesn't of itself have meaning until you decode it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 190.034,
    "end": 196.18,
    "text": "And without decoding, the physical events inside a computer don't have meaning, and they're not actually about anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 197.021,
    "end": 202.386,
    "text": "And the puzzle here is that consciousness is about things, whereas the things in a computer are not about things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 203.067,
    "end": 210.955,
    "text": "Now this result that computation is not a physical process but an interpretation of a physical process, that's not a new result.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.318,
    "end": 214.241,
    "text": " It was derived by Horstmann et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 214.341,
    "end": 223.215,
    "text": "in 2014 for artificial computers and extended to natural computers such as brains by Stepney and Kendon in subsequent years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 223.355,
    "end": 227.621,
    "text": "So those two papers are very interesting precedents to the work here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 228.723,
    "end": 237.236,
    "text": "So that's the first part of it, is that computers don't have decoded meaning inside them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 237.256,
    "end": 239.76,
    "text": "The second part is applying that to consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 239.926,
    "end": 243.069,
    "text": " Because consciousness that we experience has meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 243.249,
    "end": 244.47,
    "text": "It's about things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 245.131,
    "end": 248.434,
    "text": "It's about the things in front of us, the things we see, the things we feel, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.775,
    "end": 254.32,
    "text": "But without decoding, the computation in the brain doesn't have meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 255.18,
    "end": 259.164,
    "text": "And the decoding requires information from outside the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 259.284,
    "end": 267.452,
    "text": "So if you model the brain purely as a computer, then the physical events inside the brain don't have meaning, and so they don't",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 267.719,
    "end": 269.823,
    "text": " They can't be the cause of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 270.605,
    "end": 273.851,
    "text": "So that is the basic framework for the results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 276.657,
    "end": 277.618,
    "text": "It's a negative result.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 277.638,
    "end": 278.721,
    "text": "They are negative results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 278.741,
    "end": 281.526,
    "text": "And I think negative results are important in science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 282.282,
    "end": 289.23,
    "text": " A lot of precedents like conservation of energy is if you like a negative result, this energy can't be created out of nowhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 289.31,
    "end": 292.793,
    "text": "So it leads to things like no perpetual motion machines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 293.334,
    "end": 299.741,
    "text": "Well, the second law of thermodynamics says you can't create heat differences out of nothing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 300.802,
    "end": 303.365,
    "text": "And so there's no such thing as a free heat engine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 304.466,
    "end": 308.931,
    "text": "Or another one more recent is Gödel's incompleteness theorem for mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 309.637,
    "end": 334.75,
    "text": " that says you can't derive all of mathematics purely axiomatically so these are important negative results and what negative results do is they clear the ground and make new room for new ideas so the result of this talk is an incompleteness theorem for computers excuse me but horse and i hope to show you that the result has far-reaching implications",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 335.641,
    "end": 339.085,
    "text": " firstly for man-made computers and secondly for cognitive science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 339.605,
    "end": 347.594,
    "text": "And so if you see, if you think you see a flaw in this argument, please put your hand up and ask me about it because that's the kind of thing I want to understand about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 350.958,
    "end": 358.386,
    "text": "So I'll proceed by a series of analogies going from books to computers to brains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 359.367,
    "end": 364.973,
    "text": "These are all physical devices and inside the devices, inside a book or inside a computer,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 365.594,
    "end": 367.897,
    "text": " All the information is physically encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.68,
    "end": 372.203,
    "text": "And without decoding, the information has no meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 373.164,
    "end": 377.11,
    "text": "And the decoding is always done outside the device.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 377.13,
    "end": 380.895,
    "text": "So a consequence of that is the device itself is not conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 381.736,
    "end": 383.198,
    "text": "Now, it feels all right for books.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 383.899,
    "end": 387.524,
    "text": "It feels a bit more troubling for computers and very troubling for brains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 388.826,
    "end": 393.272,
    "text": "Anyway, let's set off down this journey and see how far we go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 394.67,
    "end": 423.647,
    "text": " inside each of the devices the information in the device has no meaning it's quite obvious for a book that words characters inside a book have no meaning but it becomes less obvious for computers and for brains so let's go through that progression and see how we go yes i just have a question to be sure",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.914,
    "end": 453.06,
    "text": " what is the ground to assert that within the brain bearing in mind that actually we do not understand the brain very well at this point there is no encoding and decoding mechanism of source i think the modern view is that there is encoding and decoding but it doesn't happen inside the brain in other words",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.445,
    "end": 460.375,
    "text": " The sense organs encode things like light as pulse trains, neural spike trains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 460.916,
    "end": 465.943,
    "text": "They go into the brain as encoded information and the brain does something with them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 466.023,
    "end": 473.513,
    "text": "Lots of things about neuron spike trains and then spike trains come out of the brain and they are decoded as muscle actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 474.415,
    "end": 479.222,
    "text": "So the picture of the brain has encoding and decoding, but it doesn't actually happen in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 479.242,
    "end": 482.406,
    "text": "It happens in the body, in the sense organs or in the muscles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 484.546,
    "end": 496.806,
    "text": " I think it's something that could be discussed, bearing in mind again that there are probably fundamental mechanisms within the brain we do not yet fully understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.866,
    "end": 500.092,
    "text": "Let's assume it's a postulate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.155,
    "end": 505.761,
    "text": "More than something that is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.804,
    "end": 514.353,
    "text": " Well, I think I can assume that any information in the brain is encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 514.493,
    "end": 522.643,
    "text": "We know all we find in the brain is neural spike trains, and if that is information about the world, it's certainly encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 526.687,
    "end": 530.672,
    "text": "Anyway, let's go from books to computers to brains, and then we'll see how it feels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 531.213,
    "end": 535.798,
    "text": "So in a book, there are physical squirrels on the page, as shown here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 536.318,
    "end": 540.162,
    "text": " And we do a lot of interpreting of those in order to understand the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 540.743,
    "end": 543.546,
    "text": "We understand the shapes of the ink shapes as letters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 544.147,
    "end": 552.957,
    "text": "We understand strings of letters as words and word strings as sentences, sentences as meanings and meanings as stories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 553.017,
    "end": 559.805,
    "text": "So finally, after all that interpretation, all that decoding, we understand what the meaning is in the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 560.906,
    "end": 563.989,
    "text": "But to get the meaning from the book, we've had to do a lot of decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 564.35,
    "end": 566.292,
    "text": "By the way, I shall use the word interpret.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 566.845,
    "end": 570.69,
    "text": " and the word decode fairly interchangeably throughout this tool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 571.191,
    "end": 583.569,
    "text": "And I think, um, they obviously don't have entirely the same meaning, but I think that they're pretty synonymous for these purposes, but you may want to catch me up on that sometimes and say, look, you've used these words differently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 584.31,
    "end": 586.373,
    "text": "So that's what meaning is in books.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 587.314,
    "end": 589.116,
    "text": "It's not physically inside the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.257,
    "end": 591.32,
    "text": "It's inside our heads when we read the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 593.362,
    "end": 595.165,
    "text": "So we go on from books to computers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 596.174,
    "end": 600.738,
    "text": " And physically, what's going on inside a computer is digital electronics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 600.919,
    "end": 605.283,
    "text": "We understand the laws of physics and how all that stuff, all those circuits work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 606.043,
    "end": 610.748,
    "text": "But again, to understand it as a computer, we do a lot of interpretation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 610.868,
    "end": 615.132,
    "text": "We interpret the voltages in the circuits as bits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 616.073,
    "end": 618.275,
    "text": "We interpret bit strings as numbers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 619.396,
    "end": 624.561,
    "text": "We interpret numbers as being solutions to equations or whatever we've done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 625.03,
    "end": 628.874,
    "text": " problems sometimes interpret those equations and models of physical things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 629.475,
    "end": 639.165,
    "text": "We have computer simulation of anything in the world, and that's the way we understand it by doing all that decoding, all that chain of decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.225,
    "end": 640.787,
    "text": "So when do we do that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 640.807,
    "end": 647.034,
    "text": "There's a lot of decoding information in our heads, which I say is not inside the computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 647.775,
    "end": 651.038,
    "text": "The computer just has physical digital electronics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 653.532,
    "end": 677.987,
    "text": " so we go further to brains physically what happens in brains is neurons firing and as i say what what has started those neurons firing is sense organs like eyes and fingers sending spike trains to the brain recording information about the world but that information is encoded as spike trains then the spike trains are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 678.642,
    "end": 707.653,
    "text": " interpreted in the brain in various ways i use it as we interpret the brain as a computer doing bayesian probability for instance so we may think that the spike trains in the brain have a meaning as probabilities of things and probabilities of events and we interpret synaptic connection strength in the brain as learning and memory and then spike trains come out of the brain to our muscles and our muscles decode the spike trains as motor actions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 708.022,
    "end": 711.445,
    "text": " So again, there is encoding before stuff goes into the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 712.326,
    "end": 717.992,
    "text": "Stuff inside the brain is encoded, and then there's decoding when it comes out of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 719.133,
    "end": 721.896,
    "text": "So those are the three devices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 722.997,
    "end": 730.244,
    "text": "And to sort of draw the generalization across those, in all three cases, there's a chain of interpretations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 730.764,
    "end": 734.468,
    "text": "There's a chain of decoding, which says we decode A as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 735.68,
    "end": 764.91,
    "text": " c as c as d and so on we decode voltages as bits bits as numbers numbers as solutions to equations or whatever it may be or numbers as being about things and at each link in this decoding chain there is various very many possibles there's no one obvious choice there's a vast number of possible interpretations and when we do this interpretation it's us decoding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 765.076,
    "end": 767.74,
    "text": " And we need information to do that decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 767.76,
    "end": 775.331,
    "text": "We need to know things about how computers work, or things about how the brain works, or things about what problem we've set the computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 776.453,
    "end": 779.397,
    "text": "And so that's how we've set up our interpretations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 779.938,
    "end": 783.543,
    "text": "But there's a huge number of wrong interpretations we could set up instead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.565,
    "end": 789.953,
    "text": "But the important point is the information we use to decode resides outside the device.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 790.507,
    "end": 797.054,
    "text": " And that means that there may be information inside the device, but it doesn't have the meaning that we apply to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.216,
    "end": 806.685,
    "text": "And that the consequence of that, I would say is the device itself is not conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 807.626,
    "end": 811.17,
    "text": "And so we've gone through this progression from books to computers, to brains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 812.612,
    "end": 817.037,
    "text": "And the question is, is there anywhere along that trail where something different happened?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 818.317,
    "end": 821.48,
    "text": " And I claim there's not anywhere that something different happened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 821.5,
    "end": 827.065,
    "text": "The whole issue of encoding and decoding is the same for all three of those devices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 831.008,
    "end": 834.431,
    "text": "So an example of a computer is a floor cleaning robot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 835.052,
    "end": 836.153,
    "text": "Now, you know how these work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 836.213,
    "end": 840.137,
    "text": "Initially, it blunders around the room and bumps into doors and things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 841.538,
    "end": 846.282,
    "text": "And it's been designed with an onboard computer which has a digital map of the room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 846.987,
    "end": 852.272,
    "text": " with things in it and representation of things like chairs and tables and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 853.694,
    "end": 857.918,
    "text": "And so once it's bumped into a table, it doesn't bump into the table again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 858.999,
    "end": 862.243,
    "text": "And so it has the map inside it, which is encoded information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.963,
    "end": 872.573,
    "text": "And the decoding of that information happens outside the computer when the computer sends commands to the motor and to the steering to avoid the table leg.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 873.11,
    "end": 880.538,
    "text": " And the decoding also happens in the designer's mind, where the designer knows what the memory locations in the computer mean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 881.52,
    "end": 886.325,
    "text": "But there's no information in the computer which defines what the information means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 886.465,
    "end": 895.596,
    "text": "In other words, it's got a bunch of memory locations, but it doesn't know which memory locations refer to particular objects in the outside world or particular places.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 896.937,
    "end": 897.818,
    "text": "So the computer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 898.237,
    "end": 926.404,
    "text": " on the robot can't look at its memory locations to be aware of the table leg and this is illustrating the general point that the physical events inside the computer don't define what it's computing about and i think one of the reasons people find that puzzling is that when people talk about computers they use a lot of metaphors and even the word computer is a metaphor for people and these metaphors make computers sound like people",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 927.228,
    "end": 932.594,
    "text": " And those are the metaphors that I think have misled us and made this sound puzzling to many of us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 936.257,
    "end": 937.298,
    "text": "Where do we go next?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 938.279,
    "end": 941.523,
    "text": "Another simple example of a kind of computer is an abacus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 942.924,
    "end": 943.885,
    "text": "Now, there's an abacus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 944.146,
    "end": 948.05,
    "text": "And what happens inside an abacus, I think most people would say, is not addition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 948.49,
    "end": 953.235,
    "text": "The physical process inside an abacus is beads sliding along wires.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 953.738,
    "end": 958.104,
    "text": " But we've designed the abacus so we can interpret it as an adding machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 959.646,
    "end": 967.598,
    "text": "So in some bazaar in the Middle East or something, you see somebody doing things on an abacus, he's adding up numbers, money, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 968.559,
    "end": 973.126,
    "text": "Now that's the way we interpret the abacus as a computer which does additions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 973.746,
    "end": 977.432,
    "text": "But we could interpret the same physical device in many different ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 978.393,
    "end": 983.34,
    "text": "We could have used it as a model of sheep in the meadow, or we could have used it as a model of fish on the moon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 984.164,
    "end": 988.328,
    "text": " We could have used it for fortune telling, or we could have used it for multiplying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 988.348,
    "end": 990.751,
    "text": "I'll just talk about multiplying briefly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 990.791,
    "end": 1005.926,
    "text": "If you imagine those red beads as being digits in a number like 10,000, one zero zero zero, every time you move a bead over to the right hand side, you're multiplying the number on the right hand side by a factor of 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1006.567,
    "end": 1012.433,
    "text": "So in that sense, if we used abacuses that way, they would be multiplying devices, not adding devices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1014.1,
    "end": 1020.529,
    "text": " So again, the physical events that happen inside the abacus don't define what computation is going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.99,
    "end": 1025.036,
    "text": "It's people that encode the inputs and decode the outputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1026.238,
    "end": 1037.134,
    "text": "And in terms of the previous analysis of computers from Horstmann and Stemney and company, people are called representing entities who interpret the abacus as an adding machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1037.634,
    "end": 1040.158,
    "text": "They do the encoding and they do the decode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1043.26,
    "end": 1066.753,
    "text": " so the first set of consequences of this viewpoint are consequences for man-made computers and particularly artificial intelligence and the first consequence is you may have heard there's quite a popular idea around amongst philosophers and others that we might be living inside a simulation in other words there might be some grand simulation of the universe",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1067.24,
    "end": 1072.645,
    "text": " which simulates everything, the world and people and things, and we're just existing inside it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1073.246,
    "end": 1078.17,
    "text": "Now, this interpretation of computers shows that's not the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1078.831,
    "end": 1084.436,
    "text": "In other words, if you have a big simulating computer, information inside it is encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1085.357,
    "end": 1089.421,
    "text": "Sorry, I can't quite read some of my slides because the picture's in front of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1091.243,
    "end": 1095.366,
    "text": "So the simulated things don't exist inside the computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1095.547,
    "end": 1097.128,
    "text": "They exist inside the heads.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1097.378,
    "end": 1099.6,
    "text": " of the people looking at the computer outputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1100.441,
    "end": 1103.144,
    "text": "And so there are no simulated people inside a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1103.164,
    "end": 1107.328,
    "text": "So we cannot be simulated people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1107.348,
    "end": 1110.371,
    "text": "A second consequence, which again is quite topical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1110.831,
    "end": 1115.616,
    "text": "There's a lot of discussion about AI advancing and becoming more intelligent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1115.816,
    "end": 1124.465,
    "text": "And there's the idea of AI super intelligence, which completely exceeds all human intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1124.485,
    "end": 1124.905,
    "text": "Again,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1125.155,
    "end": 1136.932,
    "text": " If you take this interpreted view of computers, that can't happen because inside an AI computer, any computer doing AI, there is only digital electronics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1137.874,
    "end": 1140.398,
    "text": "There's not meaning about things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1141.179,
    "end": 1149.752,
    "text": "All the intelligence in AI computer is encoded information and it takes people to decode it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1149.772,
    "end": 1153.457,
    "text": "And so when we talk about AI, all the intelligence lies",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1153.775,
    "end": 1157.26,
    "text": " not inside the machine, but in human interpretation of the outputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1158.361,
    "end": 1167.654,
    "text": "And as an example of this, Deep Blue played wonderful chess, but it only played great chess because Garry Kasparov thinks it played great chess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1168.975,
    "end": 1178.068,
    "text": "Another more humble example, you may have heard the old wartime computer called ENIAC, which was very good at printing log tables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1178.148,
    "end": 1181.993,
    "text": "It could print log tables much better than people could print log tables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1183.728,
    "end": 1189.414,
    "text": " but it only printed great log tables because people were able to read them and say, yes, these are great log tables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1190.415,
    "end": 1204.969,
    "text": "So if an AI computer does something which you might want to call superintelligence, produces outputs that nobody can understand because it's beyond all human intelligence, it's actually not intelligence at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1204.989,
    "end": 1207.332,
    "text": "It's not intelligence until humans interpret it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.952,
    "end": 1208.953,
    "text": "It's just electronics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1210.034,
    "end": 1212.537,
    "text": "Now, these two results are quite",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1213.293,
    "end": 1243.114,
    "text": " against the tide of what a lot of people believe the way to remember them is that inside a computer there is no decoding so there's no the decoding is needed to make meaningful information and therefore people simulated people and ai super intelligence do not exist inside computers so um to go back to the analysis which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1243.786,
    "end": 1250.674,
    "text": " was the origin of this, in 2014 showed that computing is not just a physical process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.495,
    "end": 1259.304,
    "text": "It's an interpretation of a physical process by something they call a representational entity, an RE here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1259.884,
    "end": 1265.531,
    "text": "Now the RE is the thing that encodes the inputs to the computer and decodes the outputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1266.412,
    "end": 1272.038,
    "text": "And the important thing to know is that the information used by the RE to decode resides",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.558,
    "end": 1275.661,
    "text": " in the RE itself, not inside the computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1276.462,
    "end": 1277.363,
    "text": "And so this applies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1277.783,
    "end": 1286.452,
    "text": "Firstly, they applied this to manmade computers because that's their interest, but they extend it then to artificial, to biological computers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.233,
    "end": 1302.008,
    "text": "And in this case, the representational entity, which interprets the brain as a computer is the animal's body because it's the sense organs that encode the information on the way in and his motor actions, muscles,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1302.41,
    "end": 1304.635,
    "text": " which decode the information on the way out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1305.237,
    "end": 1312.915,
    "text": "And again, we get this result applying to brains that the physical events inside a brain don't define what it's computing about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1315.441,
    "end": 1316.824,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1322.255,
    "end": 1323.596,
    "text": " Yeah, just a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.798,
    "end": 1339.113,
    "text": "I think I understand where you're coming from when you state that the body is the decoder or is where decoding of neural information is enacted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1340.474,
    "end": 1344.878,
    "text": "But I think it's also a huge assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.98,
    "end": 1351.165,
    "text": "And I would, for instance, ask you what you think happens",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.415,
    "end": 1376.173,
    "text": " when we have a reminiscence when we recall something from memory and it's very vivid for instance or like in dreams or in imagination where we may imagine ourselves moving as a body in space but the body is not actually oh that's something we could discuss in the fine details yeah but okay well we're out of that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.132,
    "end": 1384.441,
    "text": " Where I'm going is that most theories of consciousness and the brain see the brain as only a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1385.382,
    "end": 1394.193,
    "text": "And what I'm saying is if the brain is only a computer, the information inside it can't have meaning and there cannot be consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1394.833,
    "end": 1398.077,
    "text": "What I'm going to say is the brain is more than just a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1398.137,
    "end": 1401.401,
    "text": "There's something else in the brain besides a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.162,
    "end": 1403.744,
    "text": "And I'll come to what that is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1404.365,
    "end": 1406.127,
    "text": "And that is the thing that is conscious,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1406.647,
    "end": 1412.254,
    "text": " when we have memories or when we make plans or imagine things or whatever else it might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.015,
    "end": 1413.216,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.236,
    "end": 1414.237,
    "text": "So that's where I'm going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1414.437,
    "end": 1418.423,
    "text": "The brain is, is a computer, but it's not only a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1418.443,
    "end": 1419.544,
    "text": "There's something else in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1424.35,
    "end": 1424.791,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1425.272,
    "end": 1425.552,
    "text": "So.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1426.513,
    "end": 1434.704,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1434.724,
    "end": 1435.145,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1435.165,
    "end": 1435.405,
    "text": "Um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1436.633,
    "end": 1437.329,
    "text": " just...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1437.68,
    "end": 1439.061,
    "text": " I should start by apologising.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1439.101,
    "end": 1444.787,
    "text": "I have to go to a TMB meeting in a few minutes, but I think it's a fascinating argument.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1445.168,
    "end": 1451.515,
    "text": "I just wanted to put a question that I'm hoping you can come back to later on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1451.555,
    "end": 1458.582,
    "text": "Again, acknowledging I think this is a really interesting approach and I suspect you're absolutely right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1459.603,
    "end": 1467.231,
    "text": "However, at the back of my mind, I'm wondering how many of these philosophical arguments have accommodated the free energy principle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1467.211,
    "end": 1476.032,
    "text": " That is just the statement that any physical process is just a process of computation in the sense of belief updating.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1476.674,
    "end": 1485.675,
    "text": "So that all the internal elements of your brain and a computer that can be read as a process, as opposed to a book or an abacus, which is not a process,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1485.875,
    "end": 1515.527,
    "text": " can be read as belief updating basically whose physics move on a statistical manifold and just by using those kinds of semantics and uh translating things like interpretation decoding observation measurement these are just processes of inference in that reading of physical processes you have meaning baked in so the whole point of the free energy principle is that the physical process",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1515.862,
    "end": 1544.4,
    "text": " encodes or has stands in for a parameterization of beliefs about something there is an inherent intrinsic meaning that is equipped or equips all the physical processes in virtue of the free energy principle because you can distinguish the physical process from the support of the beliefs entailed by that physical process about",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1544.903,
    "end": 1574.202,
    "text": " things that are not that physical process so that's the whole point of the markup blanket that now you have an information theory and information geometry that allows you to have beliefs about things which are just meaning so my question is how much of this philosophical work and and you know can you apply the second law of girdle's theorem um to um open systems that have a distinction between the encoding of beliefs by the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1574.182,
    "end": 1578.189,
    "text": " the inside about the outside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1578.57,
    "end": 1580.112,
    "text": "So that would be my challenge.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1580.292,
    "end": 1583.558,
    "text": "Oh, I've still got two minutes left to wit it, but I'm not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1583.618,
    "end": 1586.102,
    "text": "I'm going to listen to Brianna's question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1588.106,
    "end": 1588.767,
    "text": "Thank you, Carl.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1588.787,
    "end": 1594.477,
    "text": "It's a very profound question, and I do come to some of it later, but I'll try to address it properly later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.823,
    "end": 1598.063,
    "text": "Brianna?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1599.646,
    "end": 1601.468,
    "text": " Hi, thanks for having me here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1601.609,
    "end": 1603.351,
    "text": "And it's a fascinating argument.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1603.431,
    "end": 1606.515,
    "text": "I'm curious about the comments on AI.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1608.297,
    "end": 1611.201,
    "text": "So AI runs on an emulated substrate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1611.521,
    "end": 1614.745,
    "text": "So it's remarkably similar to how it works in human cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1614.946,
    "end": 1620.413,
    "text": "And I wonder if we're not taking into consideration that the substrate is emulated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1623.637,
    "end": 1627.662,
    "text": "I think the argument, I mean, AI is complicated because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1628.131,
    "end": 1632.458,
    "text": " It runs on digital computers, they're doing digital electronics and bits and bytes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1633.119,
    "end": 1636.764,
    "text": "And they are usually simulating neural nets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1637.606,
    "end": 1640.851,
    "text": "And the neural nets are something like what the brain works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1641.391,
    "end": 1643.154,
    "text": "And so it's a very complicated situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.194,
    "end": 1648.843,
    "text": "But fundamentally, there is still at the bottom level, a lot of encoding going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1649.504,
    "end": 1652.509,
    "text": "And a lot of decoding is needed to make any sense of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1653.971,
    "end": 1655.353,
    "text": "So it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1656.076,
    "end": 1663.442,
    "text": " That's a question that leads in a lot of directions, but fundamentally there is always encoding and decoding is always required.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1664.784,
    "end": 1672.15,
    "text": "There is, and it would be on top of the emulated substrate, which just... Yeah, you have to decode at this level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1672.23,
    "end": 1679.857,
    "text": "You have to decode the bits and bytes as simulating a neural net.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1680.317,
    "end": 1684.761,
    "text": "You have to decode the neural net as producing conclusions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1684.781,
    "end": 1685.982,
    "text": "So there are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1686.113,
    "end": 1694.923,
    "text": " Usually in computers, there are many, many levels of virtual machine going on, and many levels of decoding you have to do to get to the meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1696.445,
    "end": 1698.507,
    "text": "All I need is one level of decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1698.667,
    "end": 1699.208,
    "text": "That's enough.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1700.089,
    "end": 1704.014,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1704.034,
    "end": 1708.178,
    "text": "That's my question, or my remark.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1708.198,
    "end": 1710.501,
    "text": "Sorry, I'll carry on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1714.345,
    "end": 1722.817,
    "text": " So now we're coming onto brains and consciousness and we take three statements, which I think are fairly widely believed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1723.578,
    "end": 1726.902,
    "text": "One is that consciousness is caused by events inside the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1728.605,
    "end": 1736.996,
    "text": "Number two is that consciousness has meanings about external things like coffee cups or the presentation or your computer screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1738.518,
    "end": 1743.525,
    "text": "And the third point is that the brain is a neural computer and only a neural computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1744.079,
    "end": 1747.763,
    "text": " Now, these statements, I will claim, are not mutually consistent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1748.504,
    "end": 1749.585,
    "text": "One of them has to be wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1751.007,
    "end": 1759.057,
    "text": "The reason is, if the brain is only a neural computer, all the information inside is encoded and has no defined meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1759.677,
    "end": 1766.625,
    "text": "So that information can't cause consciousness of things, consciousness with meanings inside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1767.687,
    "end": 1773.073,
    "text": "And if you look at those three statements, the first two, I think, are empirical facts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1773.307,
    "end": 1775.109,
    "text": " And we can come back to discuss that later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1775.129,
    "end": 1782.175,
    "text": "But most people believe that consciousness is caused by events in the brain because when brains are damaged, consciousness gets interrupted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1782.936,
    "end": 1784.497,
    "text": "And you can't be conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1785.118,
    "end": 1790.002,
    "text": "Most of the things you're conscious of are something happening in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1790.783,
    "end": 1792.504,
    "text": "And it has meaning about external things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1792.564,
    "end": 1794.466,
    "text": "I think those two are well-established facts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1794.526,
    "end": 1796.728,
    "text": "So the third is an assumption.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1797.709,
    "end": 1802.233,
    "text": "We're only assuming that computing is the only thing that goes on in brains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1803.395,
    "end": 1805.238,
    "text": " I think three is the thing that's wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1808.163,
    "end": 1818.481,
    "text": "So that runs straight up against a philosophical assumption called computational functionalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1819.242,
    "end": 1828.558,
    "text": "Computational function is a thesis that forming the right kind of computations is sufficient and necessary and sufficient for consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1829.129,
    "end": 1835.416,
    "text": " And this is described recently as a mainstream, although disputed, position in the philosophy of mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1836.858,
    "end": 1839.341,
    "text": "Now, it's also called computational sufficiency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1840.062,
    "end": 1843.005,
    "text": "David Chalmers called it that in an article in 2012.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1843.786,
    "end": 1848.311,
    "text": "And what the results of the first half of this talk imply is that that is wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1849.492,
    "end": 1854.478,
    "text": "In other words, being a computer is not sufficient to be conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1855.792,
    "end": 1860.039,
    "text": " Now, most theories of consciousness assume computational functionalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1860.079,
    "end": 1866.45,
    "text": "They are theories in which the brain is a computer and the brain has consciousness by virtue of being a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1867.091,
    "end": 1872.4,
    "text": "So the implication of this viewpoint is that those theories of consciousness cannot be correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1872.5,
    "end": 1877.428,
    "text": "And that is the main implication of this talk for theories of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1878.235,
    "end": 1886.905,
    "text": " So to talk about some specific theories of consciousness, most of them assume that consciousness is caused by events of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1888.147,
    "end": 1892.412,
    "text": "The brain is a complicated neural computer, the most complicated machine in the universe we see here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1893.353,
    "end": 1897.999,
    "text": "And inside this computer, there are various computational processes taking place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1898.739,
    "end": 1900.902,
    "text": "And I call these P1, P2, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1902.08,
    "end": 1909.206,
    "text": " And most theories of consciousness assume that one or other of these processes called P5 or P4 causes consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1909.947,
    "end": 1915.472,
    "text": "And so you can look at examples of modern theories of consciousness from this viewpoint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1916.573,
    "end": 1920.036,
    "text": "You might think P1 is representing things in the visual field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1921.097,
    "end": 1929.405,
    "text": "Theories of consciousness like Lame, like, yeah, Lame and so on, people believe those theories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1929.625,
    "end": 1930.686,
    "text": "Or you might think,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1931.223,
    "end": 1937.933,
    "text": " As in the free energy principle, the brain is building Bayesian models of reality, and that leads to consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1937.953,
    "end": 1950.351,
    "text": "Or you might feel some higher order theory of consciousness that P3 is the brain reflecting on its own computations, and that causes consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1950.371,
    "end": 1959.424,
    "text": "Or going with Antonio Damasio, you might feel that the brain is computing an emotional response to events, and that emotional response is the heart of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1959.893,
    "end": 1966.003,
    "text": " Or you might feel along with Bernard Bars and Dehaene and others that global workspace is what makes us conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1966.063,
    "end": 1970.87,
    "text": "So making information globally available is a computational process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1971.812,
    "end": 1981.767,
    "text": "Or you might feel along with IIT that you need computations linked together with some very high connectivity, which is measure five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.428,
    "end": 1985.273,
    "text": "Or you might think that P7 is predictive coding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1985.974,
    "end": 1987.977,
    "text": "All of those you're saying, some",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1989.323,
    "end": 1992.366,
    "text": " computational process is what makes the brain conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1993.968,
    "end": 2000.555,
    "text": "The point of this talk is that those processes, P1 or P2 or whatever they are, don't happen inside brains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2000.696,
    "end": 2005.861,
    "text": "They happen in our interpretations of brains as computations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2006.482,
    "end": 2012.809,
    "text": "But from the information actually inside a brain itself, the processes could be completely different processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2012.829,
    "end": 2015.232,
    "text": "They could be Q1, Q2 and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2015.292,
    "end": 2018.335,
    "text": "And so those theories of consciousness cannot work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2019.327,
    "end": 2030.561,
    "text": " And if you want a short code mnemonic for why those theories of consciousness cannot be right, it is those theories of consciousness treat the brain as a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2030.881,
    "end": 2034.105,
    "text": "So they have encoding, but they don't have decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2035.627,
    "end": 2039.372,
    "text": "And so they can't get consciousness has decoded meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2040.133,
    "end": 2045.74,
    "text": "And so a theory which only has encoding, but no decoding can't get decoded meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2049.112,
    "end": 2054.818,
    "text": " And we go back again now to the example of a floor cleaning robot, just to illustrate what that means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2058.941,
    "end": 2072.735,
    "text": "Supposing in a floor cleaning robot, we can go and talk to the designer or read the design handbook and get the complete theory of how the robot computer works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2072.755,
    "end": 2078.14,
    "text": "Supposing we've done that for brains, supposing we have a complete model of all the neurons in the brain, what they're doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2078.947,
    "end": 2090.386,
    "text": " And so we happen to know that a particular computational process called visual perception is implemented by certain neurons we can point at in the brain, neurons N1, N2, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2091.668,
    "end": 2096.877,
    "text": "Or there's another process, higher order computing, that's done by a different set of neurons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2098.219,
    "end": 2099.821,
    "text": "And you can divide that set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2100.182,
    "end": 2103.267,
    "text": "You can say the higher order computing about an object B",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.533,
    "end": 2112.767,
    "text": " is done by process P4B, and that is done by certain neurons which we've identified called N4B and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2112.787,
    "end": 2117.474,
    "text": "And so there we are, we've made great progress in cognitive science, understanding how the brain works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2118.716,
    "end": 2120.599,
    "text": "And now we propose a theory of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2120.719,
    "end": 2127.229,
    "text": "So we say the consciousness of object B in our visual field is caused by process P4B.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.45,
    "end": 2130.233,
    "text": "So what form would that theory take?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2131.327,
    "end": 2151.726,
    "text": " What we're saying is information physically inside the brain, including the information in neural events N3B and the particular neurons causes awareness of object B. But this theory is not possible because information inside the brain doesn't define which neurons are the group N3B.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2153.188,
    "end": 2156.571,
    "text": "Inside the brain is not known which are neurons N3B.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2156.611,
    "end": 2157.872,
    "text": "There might be any neurons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2158.433,
    "end": 2160.675,
    "text": "So, and the information to decode",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2161.01,
    "end": 2165.656,
    "text": " N3B as the process P3B doesn't exist inside the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.598,
    "end": 2172.346,
    "text": "And so there's no possible theory in which consciousness arises from physical events inside the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2173.367,
    "end": 2182.86,
    "text": "To go back to the Roomba example, the robot example, the robot has memory with a load of memory locations, one of which represents a table leg.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2183.761,
    "end": 2189.329,
    "text": "But the robot itself doesn't know which memory location represents the table leg.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2189.782,
    "end": 2194.188,
    "text": " So the robot itself cannot be conscious of the table leg.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2194.208,
    "end": 2197.312,
    "text": "And it's an exact parallel, I claim, between those two cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2200.496,
    "end": 2208.447,
    "text": "So I would like to pause at this point, ask people to chip in with questions, doubts, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2210.19,
    "end": 2213.153,
    "text": "I'll just restate the incompleteness theorem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2213.454,
    "end": 2218.0,
    "text": "The physical events inside a computer don't define what it computes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2218.638,
    "end": 2226.249,
    "text": " and that external information is required to interpret those events as a computation and to give them any meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2227.17,
    "end": 2228.712,
    "text": "So a few questions for you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2228.752,
    "end": 2231.035,
    "text": "Is this a correct viewpoint of computation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2231.156,
    "end": 2232.477,
    "text": "Is it just a physical process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2233.239,
    "end": 2236.183,
    "text": "Or does it require an external interpreter or decoder?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2237.284,
    "end": 2242.291,
    "text": "And do modern theories of consciousness have any decoding built into them?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2243.032,
    "end": 2245.356,
    "text": "Or if they don't, what does it imply for those theories?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.376,
    "end": 2248.56,
    "text": "So I will pause and anybody wants to put their hands up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2250.346,
    "end": 2251.508,
    "text": " come out with objections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2253.791,
    "end": 2255.093,
    "text": "Yeah, Kenneth and anyone else?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2257.477,
    "end": 2258.218,
    "text": "Yeah, thanks, Robert.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2258.278,
    "end": 2271.679,
    "text": "I mean, I think, you know, I was reminded when I was looking at your slides earlier and then now again, that this was all debated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2273.06,
    "end": 2284.553,
    "text": " for a long time, actually, in the late 80s and early 90s, kind of famously by John Searle and Daniel Dennett.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2284.573,
    "end": 2286.975,
    "text": "So, Searle on one side and Dennett on the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2287.876,
    "end": 2295.625,
    "text": "You know, Searle kind of, in a way, made most of his or a big chunk of his philosophical career just going around",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.145,
    "end": 2297.687,
    "text": " giving the Chinese room argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2298.329,
    "end": 2299.911,
    "text": "Absolutely, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2300.492,
    "end": 2311.69,
    "text": "And Dennett, I mean, in a way, Dennett's response was something, you know, it was kind of unclear, but it sort of bordered on illusionism some of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.21,
    "end": 2313.071,
    "text": " Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2313.091,
    "end": 2325.872,
    "text": "And then sometimes a kind of incoherent position where it seemed to presuppose that you could take the intent, what Dennett called the intentional stance, which is to interpret entities as exhibiting intentionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2325.932,
    "end": 2333.965,
    "text": "So for Searle, you know, the vacuum cleaning computer robot, the vacuum cleaning robot, it's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.945,
    "end": 2359.648,
    "text": " it's uh is as if it wants to you know vacuum stuff and make a map of the room but it doesn't literally do it it just sort of has a structure that's sufficient for us to go oh it it's as if it maps the room but it doesn't literally map the room right and of course dennett wanted to um either say that all intentionality is all is as if intentionality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2359.628,
    "end": 2369.571,
    "text": " and and that as if intentionality meant adopting the intentional stance and interpreting an entity as if it had intentionality so then if you apply that apply that to yourself",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.602,
    "end": 2390.952,
    "text": " what is your interpreting activity is it intentional or not so that's the kind of the incoherence not as if i mean i know i'm not as if yes of course dennett would say oh no you don't know that right so i yeah yeah there's that there's those i mean those questions are very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2391.505,
    "end": 2405.262,
    "text": " important questions and i would go back even further than john searle to leibniz the leibniz mill the cogs inside the mill do they know anything about the wind sort of thing sure but john searle made the chinese room argument",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.933,
    "end": 2408.439,
    "text": " that said computers can't have meaning inside them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2409.141,
    "end": 2412.168,
    "text": "And to my mind, nobody produced a satisfactory answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2412.188,
    "end": 2413.531,
    "text": "Yeah, I agree with you on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2414.133,
    "end": 2415.296,
    "text": "I've always thought that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2415.436,
    "end": 2418.543,
    "text": "I think there was a lot of debate about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2419.325,
    "end": 2423.335,
    "text": "It lasted to about the mid-90s, and then people just quit talking about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.007,
    "end": 2426.112,
    "text": " Well, also David Chalmers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2427.134,
    "end": 2427.595,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2427.615,
    "end": 2431.383,
    "text": "I mean, I think David Chalmers came back to it in about the 2000s.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2431.724,
    "end": 2437.476,
    "text": "He said computation is a causal network of causal topology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2438.047,
    "end": 2456.46,
    "text": " and that has meaning i think his answer was unsatisfactory but we could talk about that but i think basically nobody's really answered john searle and the conclusion that i'm reaching is that it agrees with john searle that you need something else besides computers going on to get consciousness",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2456.44,
    "end": 2457.542,
    "text": " I see that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2457.622,
    "end": 2463.39,
    "text": "And then there's also, you know, those old sort of famous results in mathematical logic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2463.41,
    "end": 2468.498,
    "text": "I mean, other than girls and completeness theorems, I'm talking about the Lervenheim-Skolem theorems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2469.499,
    "end": 2470.46,
    "text": "Gosh.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2470.48,
    "end": 2484.0,
    "text": "Where you can have, you know, non-standard models of domains where it's like just a first order, you know, model of even arithmetic doesn't really capture arithmetic, you know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.217,
    "end": 2485.319,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2486.882,
    "end": 2495.938,
    "text": "It requires a kind of, oh, we're going to interpret it as just being this, and then I may have gotten that one wrong, but there are results like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2496.038,
    "end": 2502.791,
    "text": "And then there's the whole issue of the non-categoricity of first-order models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2503.953,
    "end": 2504.373,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2504.393,
    "end": 2508.621,
    "text": "Like second-order, but we don't have a good idea of how to compute second-order models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2508.702,
    "end": 2537.781,
    "text": " module models to get categoricity um no no my views on athletics are unpopular i i would say mathematics i mean everybody sees mathematics as this separate abstract domain actually i think certain elementary facts of mathematics like two plus two equals four they're about numbers they're not abstract and they are experimental facts and they agree with the data when you have two things and add two things you get four things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2538.503,
    "end": 2539.304,
    "text": " And we've learned that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2541.206,
    "end": 2565.237,
    "text": "Yeah, but I thought, you know, in terms... The only alternative a computationalist has here is to say something like there are objective facts that pertain to, say, what a computation, what a realized computation computes that are kind of intrinsic to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2565.436,
    "end": 2571.885,
    "text": " And that's almost exactly, yeah, that's almost a kind of Pythagorean position you would have to hold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.045,
    "end": 2575.49,
    "text": "Well, I, I think that is, is straightforwardly wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2575.67,
    "end": 2581.338,
    "text": "In other words, I can have a computation, uh, like a logical and gate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2581.638,
    "end": 2594.295,
    "text": "I can have two ones make a one, but I can interpret that either as an and gate, or if I interpret, if I change around and say, no one means true and Paulson and not means true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2594.883,
    "end": 2596.846,
    "text": " I can say, no, it's not an and gate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2596.866,
    "end": 2614.913,
    "text": "You're not doing and it's doing all or again, in terms of bitwise operations, I can say this operation on bits in the computer is addition, or I can say, no, I haven't represented used bits represent one, two, three, four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2614.933,
    "end": 2617.858,
    "text": "I've used bits to represent one, 10, a hundred, a thousand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2617.938,
    "end": 2620.722,
    "text": "So the operation is actually doing is multiplication.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.427,
    "end": 2645.005,
    "text": " so there is no objective fact about what operation what computation is doing yeah i mean if you think that then i think you're right so i've often thought this that what the computationalist has to say is that no there are objective facts about what certain realized computational structures compute",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2645.761,
    "end": 2651.069,
    "text": " And maybe, was Carl saying something like that about the free energy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2651.63,
    "end": 2654.995,
    "text": "I think he was, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2655.696,
    "end": 2661.124,
    "text": "It's a shame because I've got slides coming up about the free energy principle and Markov blankets and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.144,
    "end": 2662.446,
    "text": "We could have discussed them then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2662.546,
    "end": 2669.296,
    "text": "But anyway, I'll get to discuss that with Carl later because I'm giving this talk to the TNB later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2671.178,
    "end": 2674.283,
    "text": "But I think Carl was sort of saying that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2674.769,
    "end": 2678.753,
    "text": " that there is an interpretation, a unique interpretation of a computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2679.794,
    "end": 2682.137,
    "text": "And I think there are just too many counter examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2682.237,
    "end": 2691.146,
    "text": "I think any computation you show me, and you show me your interpretation of it, I can show you another interpretation that's just as good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2693.048,
    "end": 2695.05,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2695.07,
    "end": 2696.011,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.031,
    "end": 2701.637,
    "text": "Well, when you said, if I may say one last thing, when you talked about, and David mentioned this,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.018,
    "end": 2712.493,
    "text": " the sensory and motor encoding as a kind of locus of real representational content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2713.094,
    "end": 2715.898,
    "text": "Is that how I... Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2715.918,
    "end": 2719.524,
    "text": "Sensory organs encode and muscles decode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2719.764,
    "end": 2730.561,
    "text": "Okay, why couldn't somebody raise the same objection that you're raising to computation as encoding meaning to that process?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.532,
    "end": 2740.045,
    "text": " Um, because there again, you might say, well, it depends, you know, to kind of look at another",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.683,
    "end": 2747.851,
    "text": " line of theory of intentionality, theory of meaning, theory of representation that went on around the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2748.332,
    "end": 2758.723,
    "text": "There's, for example, Ruth Milliken's sort of naturalistic theory that would allow you to assign a definite content to sensory and motor encoding and decoding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.444,
    "end": 2762.708,
    "text": "But it's all kind of based on evolutionary history.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.059,
    "end": 2772.66,
    "text": " And if the evolutionary history were different, but you had exactly the same physical inputs, outputs, and so on, you would get a different content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2773.502,
    "end": 2775.145,
    "text": "And that's kind of a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2775.817,
    "end": 2791.777,
    "text": " To my way of thinking, I kind of unsatisfied... It may be fine with respect to, like, what the body is objectively doing and what it evolved for, but in terms of conscious content, it seems to me it's not going to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.178,
    "end": 2794.02,
    "text": "It's too externalist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.521,
    "end": 2804.153,
    "text": "Even if I had a completely different evolution, but I ended up being this kind of atom-for-atom replica of what I am now...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2804.504,
    "end": 2806.867,
    "text": " The contents of my thoughts don't really change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2807.148,
    "end": 2807.709,
    "text": "It seems to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2808.55,
    "end": 2815.239,
    "text": "Well, yeah, I mean, I would say you can't throw evolution away like that, but you can't play with it like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.88,
    "end": 2832.604,
    "text": "I think the brain is a result of evolution and evolution has meant that since organs have evolved to encode light and touch and so on, and muscles have evolved to do things and brains evolved to make sure that they do the right things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2833.09,
    "end": 2837.896,
    "text": " And all that is a coherent picture, and I cannot just pull that apart, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2839.538,
    "end": 2858.623,
    "text": "So if I understand you, would you think that you can't play the same objection to the representational content of sensory encoding and motor decoding, or however you want to think of it, as you can play it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2858.803,
    "end": 2861.747,
    "text": "Well, I think, to step back a bit, I think all the theories we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2863.617,
    "end": 2871.648,
    "text": " in natural science or gas laws or whatever it might be, involve encoding and decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2871.668,
    "end": 2877.917,
    "text": "And the theory we have of the brain involves encoding by sense organs, involves decoding by muscles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2878.638,
    "end": 2884.606,
    "text": "So that is, that theory is a coherent package that we can test against data on its own.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2885.407,
    "end": 2890.654,
    "text": "Whereas the difficulty with consciousness is that we don't see the decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.967,
    "end": 2896.573,
    "text": " Whereas we know that consciousness is about decoded information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2897.374,
    "end": 2897.594,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2897.614,
    "end": 2905.404,
    "text": "But ordinary physical theories or theories of the brain, they always have an encoding bit and a decoding bit, and they kind of balance out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2905.564,
    "end": 2911.812,
    "text": "So we've got at the end of the day, predictions we can test against data and we can say this theory is right or wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2912.773,
    "end": 2916.177,
    "text": "So that's roughly my viewpoint, but there's a lot there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2916.197,
    "end": 2917.378,
    "text": "We're getting into deep water.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2917.739,
    "end": 2920.743,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2920.763,
    "end": 2921.063,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2922.595,
    "end": 2929.822,
    "text": " Robert, we've also, of course, emailed on this, but external information is required to interpret those physical events as a computation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2930.222,
    "end": 2939.411,
    "text": "So I think I'm 100% with you on relational semiosis and the idea that multiple perspectives could be taken on a computational process.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2940.071,
    "end": 2949.16,
    "text": "But what causal relevance, other than actually intervening on the internal states, would those external states have?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2949.967,
    "end": 2974.455,
    "text": " those interpretations matter for the interpreter but but unless they re-enter causally into the target system how do they come to matter for the system itself well i think that's what i'm going to address on the second half of the talk um and again you know the whole picture is the computer only picture",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2974.874,
    "end": 3004.273,
    "text": " is radically incomplete and you get gaps like that but there's something else comes along which fills the gap and that's what i'm going to talk about okay so uh that by the way we can come back to that but that's more discussion i thought some people might object might have that question which in a sense was carl's question that isn't every physical thing a computation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3004.54,
    "end": 3009.385,
    "text": " And to a certain extent, I can regard lots of physical phenomena as computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.405,
    "end": 3013.529,
    "text": "I can regard a gas in a cylinder as a computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3014.37,
    "end": 3017.834,
    "text": "And there, the encoding is something that gives the gas a certain temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3018.995,
    "end": 3022.739,
    "text": "But my theory is not just gas in a cylinder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3022.819,
    "end": 3026.143,
    "text": "It's gas plus a pressure piston, which measures the pressure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3026.743,
    "end": 3030.447,
    "text": "And the pressure piston is what does the decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3030.747,
    "end": 3032.83,
    "text": " So that's a bit of a diversion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3032.87,
    "end": 3037.917,
    "text": "I'd like to move on from this slide because that's not what the second half talks about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3038.037,
    "end": 3041.422,
    "text": "If anyone wants to come back to this slide later, I'm happy to do so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3043.966,
    "end": 3045.808,
    "text": "Now, what's the positive proposal?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3045.849,
    "end": 3047.11,
    "text": "How can brains be conscious?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.238,
    "end": 3055.903,
    "text": "The positive proposal is the brain is a neural computer, but it's not only that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3057.325,
    "end": 3058.847,
    "text": "Something else is happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.996,
    "end": 3062.08,
    "text": " And it has to be happening because we know brains are conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3062.841,
    "end": 3065.024,
    "text": "And so we need something else to make them conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3066.085,
    "end": 3068.008,
    "text": "So what might that something be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3068.769,
    "end": 3074.496,
    "text": "The proposal here is that the extra something is an analog model of reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3075.597,
    "end": 3081.425,
    "text": "And that an analog model is different from what goes on in digital computers or neural computers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3082.266,
    "end": 3083.788,
    "text": "So what's an analog model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3086.114,
    "end": 3087.435,
    "text": " Approach this by examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3087.455,
    "end": 3090.639,
    "text": "A toy car is an analog model of a real car.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.54,
    "end": 3094.603,
    "text": "Or a map is an analog model of a piece of terrain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3095.464,
    "end": 3098.227,
    "text": "Or a photograph is an analog model of some scene.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3099.269,
    "end": 3102.733,
    "text": "So this gives us some idea of what analog models are about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.254,
    "end": 3110.021,
    "text": "And I claim we try and encapsulate this in definition of what is an analog model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.862,
    "end": 3115.767,
    "text": "A model M is an analog model of some physical situation P if",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3116.422,
    "end": 3124.432,
    "text": " M has the same topology as P. In other words, if the situation P is donut shaped, then M is donut shaped.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3125.313,
    "end": 3137.687,
    "text": "And there's some kind of point to point correspondence between the physical situation P and the model M. So a point in the model is a function of a point in the physical thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3138.248,
    "end": 3140.691,
    "text": "And the function F, which relates",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3140.857,
    "end": 3145.063,
    "text": " points in model and physical reality are a continuous function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.684,
    "end": 3147.486,
    "text": "Mathematically, it's a fiber bundle, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3148.467,
    "end": 3150.01,
    "text": "And it preserves neighborhoods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3151.291,
    "end": 3152.954,
    "text": "And it preserves spatial binding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3153.074,
    "end": 3162.747,
    "text": "So there are things in the analog model, which are like borders, for instance, borders on a map, which are also borders in the real situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3162.867,
    "end": 3169.176,
    "text": "So some of the information in the model M, in the physical situation P,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3169.797,
    "end": 3173.523,
    "text": " is reproduced in the model M, but with no encoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3175.166,
    "end": 3180.555,
    "text": "And so there's certain information you can get out of the model M, which doesn't require decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3180.595,
    "end": 3190.05,
    "text": "And that is, I believe, the secret to consciousness, that there is an analog model inside the brain, and that model is a source of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3190.691,
    "end": 3193.155,
    "text": "That model doesn't need any decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3193.321,
    "end": 3202.651,
    "text": " So there can be information in consciousness about external things, because it's gone into the analog model without it being encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3204.594,
    "end": 3213.183,
    "text": "So, I should say that I've tried to discuss analog models in a couple of minutes, but they're not that simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3213.203,
    "end": 3219.71,
    "text": "Because you could say, analog computation requires external decoding, just like any other form of computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.73,
    "end": 3221.392,
    "text": "And that's what I believe Orsman et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3221.412,
    "end": 3222.113,
    "text": "said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3222.262,
    "end": 3227.55,
    "text": " And there's been loads of philosophical debate about what analogue modelling is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3228.111,
    "end": 3230.374,
    "text": "People like Gibson, Fodor and Peleshin and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3231.636,
    "end": 3237.425,
    "text": "And you could say, well, you've given the examples of maps and photographs, but they're actually encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3237.725,
    "end": 3238.626,
    "text": "They are divisible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.887,
    "end": 3247.179,
    "text": "You look very closely at a map, you can divide it into little fibres on the paper and they've got ink or they haven't got ink.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3247.339,
    "end": 3249.703,
    "text": "And the ink is an encoding of information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3250.139,
    "end": 3254.669,
    "text": " Or you look at a photographic film and there are molecules of dye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3255.971,
    "end": 3259.078,
    "text": "Or you look at a computer screen, there are pixels, they're all encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3260.521,
    "end": 3263.427,
    "text": "However, those aren't the only examples of analogue models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3264.489,
    "end": 3267.135,
    "text": "There are other analogue models which aren't divisible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3268.043,
    "end": 3280.36,
    "text": " For instance, if you have a lens and the optical image is a model of reality, but it is not divisible because you zoom in very closely on the image, you get to the diffraction limit and usually get blurry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3280.38,
    "end": 3284.326,
    "text": "So you cannot keep dividing an image from a lens as far as you like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3285.688,
    "end": 3292.578,
    "text": "Similarly, a hologram, it's not divisible because a hologram is a Fourier transform of a spatial distribution on a film, say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3293.038,
    "end": 3297.865,
    "text": "And so you can't zoom in as close as you like on a hologram and keep dividing and dividing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3298.823,
    "end": 3304.19,
    "text": " And another more exotic example is a single quantum state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3304.21,
    "end": 3305.151,
    "text": "That's not divisible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3306.253,
    "end": 3307.655,
    "text": "Notoriously not divisible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3308.396,
    "end": 3316.807,
    "text": "And there are some quantum states which can hold very large amounts of information, macroscopic amounts of information, and they last longer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3316.847,
    "end": 3317.908,
    "text": "They last a long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3318.529,
    "end": 3323.896,
    "text": "Most quantum states get dissipated in 10 to the minus 18 seconds and don't last at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3324.797,
    "end": 3326.94,
    "text": "But certain quantum states can last",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3327.308,
    "end": 3330.212,
    "text": " very long times, and these are Bose-Einstein condensates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3330.232,
    "end": 3333.136,
    "text": "They're things like superconductors or superfluids.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3334.678,
    "end": 3336.581,
    "text": "By the way, Fran is watching this talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3336.661,
    "end": 3340.066,
    "text": "I'm running out of water, so if she could bring me some water, I'd be very grateful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3342.389,
    "end": 3352.323,
    "text": "So Bose-Einstein condensates are an example of quantum states which can exist for a long time and can hold a lot of information, but they are very rare states of matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3353.004,
    "end": 3354.666,
    "text": "So they...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3354.764,
    "end": 3362.159,
    "text": " I think people say that couldn't exist in the brain, but I think we shouldn't rule them out because evolution is very clever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3363.101,
    "end": 3374.443,
    "text": "So the question of analog representations in the brain is still, I think, an open question and it's a question of physics or biophysics rather than a philosophical mathematical question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3376.587,
    "end": 3377.008,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3378.642,
    "end": 3381.346,
    "text": " So what's this got to do with consciousness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3382.107,
    "end": 3384.131,
    "text": "Analog models have spatial binding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3384.271,
    "end": 3389.078,
    "text": "In other words, they have things like boundaries which map to boundaries in the real world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3390.881,
    "end": 3394.988,
    "text": "Now, our conscious experience includes a 3D model of local space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3395.909,
    "end": 3397.372,
    "text": "That's what it's like to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3397.492,
    "end": 3402.139,
    "text": "You see a model of your computer screen in front of you, a model of your table itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3403.141,
    "end": 3406.065,
    "text": "And that model has spatial... Oh, my wall's coming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3406.085,
    "end": 3406.506,
    "text": "That's great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3407.937,
    "end": 3408.257,
    "text": " you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.121,
    "end": 3419.933,
    "text": "That model has spatial spatial binding and so that model could be the source of consciousness with no decoding required.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3420.614,
    "end": 3435.835,
    "text": "So here is the positive proposal that the brain as well as a computer contains an analog model of local space and that analog model is the sole cause of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3436.287,
    "end": 3465.265,
    "text": " source of consciousness isn't consciousness is nothing to do with the neurons in the brain it's all coming from that analog one so that's a positive proposal and i'll sketch a bit um so the question you might ask is well you've said there might be an analog model of space in the brain what use would that be why would it evolve would it serve any purpose would it help the brain do any real computing brains need to do and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3465.498,
    "end": 3477.457,
    "text": " The answer is yes, it could be very useful because it could store a Bayesian maximum likelihood model of what's going on around the animal for limited periods of time, say for a few seconds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3478.859,
    "end": 3486.791,
    "text": "It could be the place where all the sense data about the animal's surroundings get integrated into a single best likelihood model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3488.234,
    "end": 3493.682,
    "text": "And it could persist this information for a fraction of a second while the animal decides what to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3494.0,
    "end": 3500.646,
    "text": " It could keep this information while the animal classifies the things around it, recognizing things that they have to do things about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3501.347,
    "end": 3504.97,
    "text": "It could be used for simulating and planning what the animal's going to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3505.771,
    "end": 3511.296,
    "text": "And it could be used for comparing the present situation with past situations like memory and learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3512.117,
    "end": 3516.642,
    "text": "So the answer is yes, there could be lots of uses for an analog model in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3518.643,
    "end": 3519.324,
    "text": "Could it happen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3519.945,
    "end": 3522.387,
    "text": "There is a possible physical form for the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3522.907,
    "end": 3526.111,
    "text": " as a wave excitation, and I've written papers about this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3526.952,
    "end": 3537.304,
    "text": "But I'm not going to divert into those papers now, because that is simply, for the purpose of this talk, just an existent proof, to prove that it can be done, it could be done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3537.344,
    "end": 3546.095,
    "text": "If evolution could use a wave excitation in the brain to store information, then that could be where the analogue model is stored.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3548.017,
    "end": 3552.222,
    "text": "And just to illustrate that in terms of free energy principle and active inference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3553.079,
    "end": 3559.228,
    "text": " Here is a picture of the classic active inference FEP model of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3559.628,
    "end": 3563.294,
    "text": "Brain is a neural computer and it has a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3563.314,
    "end": 3569.683,
    "text": "There's the outer, what I call, there are many Markov blankets, but it has an outer Markov blanket between the brain and the rest of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3571.285,
    "end": 3574.63,
    "text": "And the sense organs are outside the Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3574.65,
    "end": 3578.295,
    "text": "They encode information which comes through the Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3579.096,
    "end": 3581.82,
    "text": "The brain does computation and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3582.239,
    "end": 3587.824,
    "text": " neural spike trains come out of the market blanket and they go to muscles, which turn into physical action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3587.924,
    "end": 3595.812,
    "text": "So there is encoding and decoding in this computer model of the brain, but there's no decoding inside the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3597.053,
    "end": 3605.622,
    "text": "So active inference is all about this cycle here, where the muscle actions produce all sorts of changes in the world and they come back via sense organs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3605.722,
    "end": 3611.267,
    "text": "So active inference and the FEP is a very complete and capable model of the brain, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3611.483,
    "end": 3622.582,
    "text": " I would claim it cannot give you consciousness because all the information in here is encoded and there's nothing inside the brain that does the decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3622.803,
    "end": 3624.506,
    "text": "Decoding is done on the way out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3626.169,
    "end": 3632.8,
    "text": "So how would active inference and the FEP have to be modified to take account of consciousness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3634.349,
    "end": 3656.273,
    "text": " it's as in this diagram here, you have not only an outer Markov, you have the same senses and muscles in the outer Markov blanket as you had before, but also as well as the computer in the brain, the gray computer we've got here, we've got the inner ring, the inner right white ring, which is the analog model of local space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3656.954,
    "end": 3664.322,
    "text": "So what happens is the sense data comes in as encoded the brain, and then it gets decoded again into this analog model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3665.112,
    "end": 3672.2,
    "text": " and from the analog model it gets encoded, and there's a rapid iteration of comparing sense data with the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3672.7,
    "end": 3678.286,
    "text": "So that's the way the best possible model of local space gets developed inside the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3679.768,
    "end": 3694.343,
    "text": "And similarly, if the animal wants to plan things, then it extracts information from the analog model about the current situation, it does some computation about it, and it puts back",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3695.302,
    "end": 3699.246,
    "text": " what the situation would be if the animal made certain moves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3699.286,
    "end": 3703.972,
    "text": "So if the animal wants to plan certain movements, this green cycle here is what happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3705.233,
    "end": 3719.268,
    "text": "And so in this theory of enhanced accurate inference, if you like, there is an internal analog model as well as the computer and consciousness arises solely from that internal analog model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3719.288,
    "end": 3725.275,
    "text": "The advantage of that is that if you get consciousness from the analog model, you don't need to decode it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3726.773,
    "end": 3731.519,
    "text": " And the analog model is just like what consciousness is just like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3731.679,
    "end": 3739.529,
    "text": "So there's no decoding involved and we've solved the problem, which we had with purely neural computer models of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3741.031,
    "end": 3741.391,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3741.431,
    "end": 3750.082,
    "text": "So that I think is a future direction, which I would hope active inference would take in order to produce a decent account of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3750.142,
    "end": 3752.325,
    "text": "And I think that's a promising route.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3754.752,
    "end": 3773.312,
    "text": " So just to talk briefly about the future for theories of consciousness, I think some approaches, most approaches to theories of consciousness have this brain as a computer only assumption, and therefore they can't actually account for consciousness because they don't have decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3774.073,
    "end": 3777.316,
    "text": "But I think some of the theories do have some promising elements in them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3778.237,
    "end": 3784.624,
    "text": "I think the global workspace theory there,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3786.798,
    "end": 3794.568,
    "text": " It's compatible with the idea that the global workspace could contain an analog model of space somewhere in the thalamocortical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3796.971,
    "end": 3802.418,
    "text": "Certain people have written, Bjorn Merke has written about consciousness without a cortical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3802.438,
    "end": 3810.848,
    "text": "Again, this is compatible with the idea that somewhere in the midbrain, possibly the thalamus, there is an analog model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3812.212,
    "end": 3816.758,
    "text": " I'll talk briefly on the projective consciousness model, which some of you know very well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3817.919,
    "end": 3822.705,
    "text": "And that says there is a model of space in the brain, which is a projective transform model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3823.406,
    "end": 3830.395,
    "text": "Although the PCM doesn't talk about analog at all, it does talk of projective transform model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3830.415,
    "end": 3833.299,
    "text": "It has many properties in common with our consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3833.359,
    "end": 3835.662,
    "text": "And I think that is very much a step in the right direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3836.804,
    "end": 3840.328,
    "text": "And I've got a more detailed working out of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3841.169,
    "end": 3867.598,
    "text": " I call the projective wave model that says there is an analog of space in the brain it's in the thalamus it's in a wave excitation or in insects it's in the in the central body and that's the basis of consciousness but that is not really the main point of this talk is to talk about the future is to say we need to go in some different direction because the ordinary computational theories of consciousness are not going to hack it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3870.245,
    "end": 3875.209,
    "text": " So that is really the end of what I have to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3875.249,
    "end": 3879.373,
    "text": "After 35, how long?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3879.473,
    "end": 3880.154,
    "text": "No, an hour.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3881.955,
    "end": 3885.298,
    "text": "So open for discussion, here are a few questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3885.899,
    "end": 3888.801,
    "text": "Is there any alternative to having an analogue model in the brain?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3888.821,
    "end": 3891.424,
    "text": "Is there some other thing that could be the cause of consciousness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3892.645,
    "end": 3896.988,
    "text": "Could it be stored in neurons or does it have to be stored in some other form such as a wave?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3898.37,
    "end": 3898.75,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3899.32,
    "end": 3905.866,
    "text": " I think this has not only implications for consciousness, but also implication for cognitive models of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3906.467,
    "end": 3911.691,
    "text": "If we admit this possibility, does that actually help us produce models of how the brain works?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3912.592,
    "end": 3915.535,
    "text": "Or alternatively, should we just give up on theories of consciousness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3916.776,
    "end": 3919.318,
    "text": "So, open for questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3925.404,
    "end": 3927.806,
    "text": "May I jump in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3927.826,
    "end": 3928.787,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3930.455,
    "end": 3949.982,
    "text": " so one thing on just a second i'm going to close my door because there's people here all right so one thing to bear in mind with respect to this discussion about the brain in particular",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.198,
    "end": 3967.448,
    "text": " is that for most neurophysiologists brain scientists not cognitive brain scientists as you know who's often so are not real neuroscientists uh i've said and restated when after computers and in their",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3968.204,
    "end": 3991.697,
    "text": " digital form so with this encoding and decoding process involved have emerged that the brain is not a computer in the sense that precisely the brain is an analog machine that neurons do not encode things that actually spike strains are analog signals so it's actually the core belief of the classical neurophysiology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.082,
    "end": 4019.052,
    "text": " and computer sorry brain scientists that the brain is not digital but an analog machine that has analog model of the world now in the detail how that would work and how that would generate phenomenology at this as the subjective experience we have is i guess another question um so i think that is very what you are stating is actually very classical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4019.116,
    "end": 4021.318,
    "text": " from the perspective of neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.959,
    "end": 4028.466,
    "text": "But it has been forgotten by a lot of people who are in the business of cognitive neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4028.966,
    "end": 4038.036,
    "text": "And myself, at some point, I thought, we have to go back to the analogy between mind and brain and software and hardware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4038.176,
    "end": 4042.48,
    "text": "So un-tailing some sort of encoding, decoding through virtualization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.5,
    "end": 4045.123,
    "text": "But that's the theory of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.103,
    "end": 4054.255,
    "text": " I don't know what I believe today, but actually what you say is about, you know, can the brain be considered or part of the brain or neurons can encode an analog model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.295,
    "end": 4056.758,
    "text": "For most neurophysiologists, that's already the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.04,
    "end": 4059.482,
    "text": "How is another question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.343,
    "end": 4067.432,
    "text": "So now in terms of the particular model and implementation or form of this analog model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4067.986,
    "end": 4087.492,
    "text": " I would even go further and say at this point in my career and reflection where I'm actually completely lost, I'm open to anything, including what I used to consider as sort of science, like the claims of the Chalmers about quantum mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.512,
    "end": 4087.952,
    "text": "Why not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.673,
    "end": 4096.744,
    "text": "And even some other physics that we don't even know yet and haven't understood in terms of, you know, the brain, maybe like a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.213,
    "end": 4107.028,
    "text": " I'm going to use an analogy like an antenna of sorts receiver and emitter that connects to physics in which you know consciousness resides that we may never understood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.088,
    "end": 4114.8,
    "text": "So the field is open for me and I'm not shocked by your arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.92,
    "end": 4121.77,
    "text": "I think it's worthwhile to pursue but I don't have a definite answer neither of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4122.442,
    "end": 4131.144,
    "text": " what it could be, this analog model, or even if there is not a physics in which encoding and decoding can perfectly make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4133.028,
    "end": 4137.7,
    "text": "Okay, I've got two remarks, I suppose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4138.726,
    "end": 4141.348,
    "text": " Well, let me remember one of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4141.368,
    "end": 4152.118,
    "text": "The idea that the brain is an analog computer and neuron spike trains are an analog representation of reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4152.199,
    "end": 4161.347,
    "text": "I don't think that... To me, spike trains are irretrievably encoded, and we don't know how they're encoded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4161.367,
    "end": 4161.908,
    "text": "We don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4162.608,
    "end": 4165.611,
    "text": "Certain neurons, pyramidal neurons, may be firing rate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4166.3,
    "end": 4168.082,
    "text": " is the way to look at it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4168.102,
    "end": 4170.706,
    "text": "Even looking at firing rates is decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4171.847,
    "end": 4184.483,
    "text": "But nobody in neurophysiology looks at firing rate in a computational sense of the term, as computational neuroscientists do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4184.964,
    "end": 4187.667,
    "text": "They just consider it's an analog signal that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4188.018,
    "end": 4201.839,
    "text": " as an analog relationship with the amount of neurotransmitters that are going to be released and how that's going to affect, based on the biochemistry of the synaptic cleft, the potential of membrane on other neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4202.199,
    "end": 4213.636,
    "text": "So for them, it's really like an electronic machine of a classical analog, you know, there is no analog digital converter, if you wish, in the sense of an analogue signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.676,
    "end": 4214.818,
    "text": "For them, it's all analog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.963,
    "end": 4226.915,
    "text": " I suppose the other problem I have with that is you can look at certain neurons in the brain and it appears that they encode things or they represent things by firing rate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4226.935,
    "end": 4243.573,
    "text": "You could say that is analogue, but actually... I'm sorry to cut you Robert's enthusiasm of the discussion, but those are models that have been extracted and designed by people who started thinking computationally about the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4243.553,
    "end": 4266.793,
    "text": " and we had a fairly superficial culture about neurons and electrophysiology, I would say, for many of them, and that decided to interpret spike trains and their frequency or the rate of spiking as a signal that in itself was the meaningful signals in their simplified model of neurophysiology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.773,
    "end": 4276.971,
    "text": " to be able to compute certain functions like doing arithmetics or understand certain basic memory mechanisms and input-output relationships through transfer function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4277.331,
    "end": 4280.818,
    "text": "But that's a small, very small part of neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4280.838,
    "end": 4288.852,
    "text": "That's the computational neuroscientists that we're trying to do modeling and that interpreted spike trend as a relevant parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.912,
    "end": 4291.937,
    "text": "But a true neurophysiologist would never think that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.065,
    "end": 4295.608,
    "text": " Do you mean experimental neurophysiologists?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4295.628,
    "end": 4303.8,
    "text": "Or even theoretical, I mean an electrophysiologist who masters the biophysics of membranes, of active conduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.92,
    "end": 4304.22,
    "text": "Oh, sure, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.24,
    "end": 4306.243,
    "text": "That's a physical theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4306.643,
    "end": 4310.268,
    "text": "They think that... Yeah, I'm talking about people who worry about consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4311.51,
    "end": 4314.895,
    "text": "Yeah, but they are usually not real brain scientists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.915,
    "end": 4315.696,
    "text": "That's what I'm saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4316.477,
    "end": 4317.418,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4321.398,
    "end": 4348.266,
    "text": " uh kenneth and then paul or anyone else who hasn't spoken ben on mute kenneth sorry just to uh make a quick remark uh with relation to what david just said i mean i think mcculloch and and pitts knew their neurophysiology pretty well and they knew they were making a massive simplification",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4348.533,
    "end": 4357.194,
    "text": " and making a choice and kind of setting up neural network modeling as computational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4357.214,
    "end": 4366.997,
    "text": "But I just want to say, and it's also kind of following up with what David says, well, I have two questions, really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4368.074,
    "end": 4371.679,
    "text": " So, one is, suppose there is this analog model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4373.081,
    "end": 4387.24,
    "text": "I mean, can't we raise the same sort of objections to computational models that we, I mean, couldn't we raise to analog models the same sort of objections we're raising to computational models?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4387.781,
    "end": 4395.111,
    "text": "So, for example, if you take analog computers like the differential engine, you know, Charles Babbage's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4395.833,
    "end": 4397.797,
    "text": " Wasn't it called the differential engine?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4397.877,
    "end": 4400.722,
    "text": "Yeah, that was later than Babbage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4401.383,
    "end": 4407.053,
    "text": "Well, he did the differential engine, and there was a later one in the 30s.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4407.073,
    "end": 4410.499,
    "text": "Okay, so it's using gears, if I'm not mistaken, to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4410.519,
    "end": 4411.16,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4412.122,
    "end": 4413.124,
    "text": "You mentioned the abacus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4413.324,
    "end": 4418.213,
    "text": "I mean, it's an analog device, and someone might kind of push and go, well, really...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4418.716,
    "end": 4423.943,
    "text": " Digital computers are all implemented in an analog world, so really they're analog.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4423.983,
    "end": 4433.998,
    "text": "I know there's the flip side where everybody's trying to turn everything analog into something digital, like information ontologies or it from bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4434.478,
    "end": 4442.85,
    "text": "To me, the key distinguishing factor is that some of the information in an analog model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4444.113,
    "end": 4445.375,
    "text": " Doesn't need decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4445.835,
    "end": 4446.136,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.777,
    "end": 4453.045,
    "text": "And I can... I like that idea because I think that there's... And that leads me to my second question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4453.065,
    "end": 4460.755,
    "text": "I like the idea because I'm one of those who thinks that consciousness is not exhausted by intentionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4460.975,
    "end": 4462.898,
    "text": "And what I mean by that is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4463.198,
    "end": 4473.22,
    "text": " Yes, there's the intentional level where you think, like, you're seeing something as something, but there's also the level at which you're just seeing, if we're talking about 50, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4473.44,
    "end": 4482.76,
    "text": "So, for example, if you... you might wake up in the morning and have, like, a wadded sheet in front of your face, and for a second you don't know what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4482.74,
    "end": 4485.844,
    "text": " But there's before you interpret before you interpret it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4486.025,
    "end": 4486.185,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4486.425,
    "end": 4493.255,
    "text": "So there's still something you're sort of directly aware of that doesn't require any decoding to be aware of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4493.536,
    "end": 4499.204,
    "text": "And then there's this further layer of decoding, which is like, oh, yeah, sheet or oh, it's kind of perceptual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4499.484,
    "end": 4506.514,
    "text": "And that's where intentionality or meaning in the sense we've been talking about it enters in now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4507.195,
    "end": 4509.118,
    "text": "OK, so I like that idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4509.098,
    "end": 4526.635,
    "text": " uh that an analog model might give you that layer that isn't it's information that doesn't have to be decoded because it's really sort of just built into the structure of that episode or that phase of consciousness itself but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4527.442,
    "end": 4535.813,
    "text": " My question for you really is, what is it to decode or interpret or intentionally animate, to use a Husserlian language?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4535.893,
    "end": 4538.276,
    "text": "What is it to see something as something?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4538.877,
    "end": 4541.7,
    "text": "That's like a further process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4542.662,
    "end": 4551.593,
    "text": "You can imagine, in theory anyway, a kind of consciousness that doesn't do it, that is basically just kind of locked in this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4551.573,
    "end": 4554.136,
    "text": " you know, it doesn't really sort of get outside of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4554.297,
    "end": 4556.239,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4556.259,
    "end": 4558.042,
    "text": "That's a complicated question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4558.462,
    "end": 4571.78,
    "text": "Your arguments earlier on kind of depend on consciousness always involving intentionality or interpretation, which, you know, is certainly a tempting thought that it always does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4572.04,
    "end": 4579.249,
    "text": "I can't say that it's false, but I wonder, like, what is the theory of interpretation or the theory of intentionality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4579.61,
    "end": 4581.192,
    "text": "And do you need one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4581.695,
    "end": 4602.117,
    "text": " your for your project um well this um i would say in that moment you wake up before you've interpreted your sense data as this is a sheet um there are things in your sense stage like a boundary between red and green yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4602.637,
    "end": 4607.905,
    "text": " you know, and you're, you're aware of that boundary before you say, Oh, that's, it's about my sheet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4608.526,
    "end": 4608.866,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4608.886,
    "end": 4614.735,
    "text": "And so there is a pre interpretation, experience, raw experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4615.716,
    "end": 4624.189,
    "text": "And that quality of the raw, the what it is like, bit is what, where the analog model represents",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4625.08,
    "end": 4627.783,
    "text": " It has a nice fit to consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4628.444,
    "end": 4630.707,
    "text": "Analog model has got a barrier between red and green.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4631.348,
    "end": 4632.549,
    "text": "Your consciousness has that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4633.11,
    "end": 4635.933,
    "text": "And that's for classification and intentionality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4636.233,
    "end": 4638.837,
    "text": "When you see something on the wall, you say, oh, that's a fly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4640.038,
    "end": 4642.341,
    "text": "That is built in by evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4642.441,
    "end": 4648.488,
    "text": "Animals have to take their sense data and classify it into things they need to do things about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4649.089,
    "end": 4649.71,
    "text": "That's a fly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4649.73,
    "end": 4650.31,
    "text": "I can eat it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4651.071,
    "end": 4651.472,
    "text": "Whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4652.033,
    "end": 4654.075,
    "text": "And that secondary experience of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4656.957,
    "end": 4663.708,
    "text": " Taking a piece of sense state and classifying it as something is useful for the animal, but it also involves the conscious bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4664.149,
    "end": 4672.362,
    "text": "But once the animal has seen a fly as a fly, it doesn't quite see the raw sense state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4672.382,
    "end": 4678.392,
    "text": "It mixes the fly up with previous flies it's seen in his memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4678.793,
    "end": 4690.385,
    "text": " And its current model of reality involves not only the sense data coming in, but all the flies it's seen before, that they're going to behave that way and be edible or whatever it may be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4691.166,
    "end": 4703.318,
    "text": "I can agree with that, but what I wonder is, is that, you know, the seeing as or the interpretation, is that, do you also want to, you want to deny that that could be computational, correct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4704.279,
    "end": 4707.923,
    "text": "No, no, it's computational, but it feeds results back into the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4708.375,
    "end": 4716.747,
    "text": " So you think that when I see a fly on the wall, there's computation in my brain that says that's a fly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4717.628,
    "end": 4721.093,
    "text": "But then that computation feeds back into my analog model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4721.894,
    "end": 4725.539,
    "text": "So my model is a bit more fly like than it was before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4725.92,
    "end": 4729.885,
    "text": "But now you've got intentionality in your computations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.905,
    "end": 4730.586,
    "text": "And then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4731.089,
    "end": 4737.179,
    "text": " We can go back and go, well, why were you objecting to computations being intentional in the first half of your talk?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4737.84,
    "end": 4745.132,
    "text": "No, my computation has evolved to classify the visual field into useful things that I need to know about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4746.254,
    "end": 4749.439,
    "text": "And, you know, the computation doesn't know that's a fly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4749.479,
    "end": 4751.923,
    "text": "The computation just does some grinding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4752.965,
    "end": 4755.088,
    "text": "And it makes my muscles do a fly thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4756.165,
    "end": 4783.472,
    "text": " it makes my conscious awareness do a fly thing but inside it the computation are not aware of a fly oh okay okay i all right i have to think about i'm not i'm not sure i follow you completely but well my brains evolved to classify things usefully to help me survive i agree with that yeah and it that evolution hasn't made it aware of what the things are it's just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4784.633,
    "end": 4791.02,
    "text": " For certain inputs, it produces good outputs, which make me avoid flies, whatever it may be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4792.081,
    "end": 4810.0,
    "text": "But also, it produces outputs into the analog model that says, when I see a blur on the wall, and I'm not sure what it is, I suddenly interpret that blur becomes a bit more focused as a fly, because I know there are flies on that wall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4811.482,
    "end": 4816.028,
    "text": " Okay, so the interpretation is a consciousness, is a conscious matter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4816.268,
    "end": 4817.429,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4817.45,
    "end": 4826.06,
    "text": "No, the interpretation happens in the computer bit, but the result of being more fly-like than a blur on the wall is in the conscious bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4831.888,
    "end": 4840.138,
    "text": "Then it seems to me you're using interpretation or decoding in one sense in the first half of your talk and in another sense right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4840.777,
    "end": 4841.858,
    "text": " I don't think so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4841.938,
    "end": 4848.927,
    "text": "I'm saying that the decoding happens on the brain has the computer brain has encoded stuff in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4849.628,
    "end": 4851.25,
    "text": "And there's two kinds of decoding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4851.73,
    "end": 4856.796,
    "text": "There's decoding out the muscles and there's decoding going into the analog model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4858.538,
    "end": 4869.872,
    "text": "At some point, if you wish, Ken, for what I understand, there is a decoding that comes from the processing of the within the brain that involved initially a form of encoding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.493,
    "end": 4882.871,
    "text": " that remaps somehow this code into an analog model that maps the outside world in a manner that is coherent in term of shape, if you wish.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4883.612,
    "end": 4885.475,
    "text": "So there is a shape outside the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4885.835,
    "end": 4886.957,
    "text": "You don't see it directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4886.977,
    "end": 4889.0,
    "text": "You encode it through neural process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.501,
    "end": 4899.876,
    "text": "And somewhere, somehow, or some mechanisms to be defined, it's decoded within to generate and synthesize an analog",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.856,
    "end": 4913.117,
    "text": " experience of the world for which, even though there is an indirect process, there is a one-to-one of sorts mapping or some mapping that is more analogous in the sense of continuous deformation, if I understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4914.078,
    "end": 4914.399,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4914.96,
    "end": 4923.934,
    "text": "But this is the same kind of decoding that can happen when you ask ChatGPT a question and it spits out an answer, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4923.954,
    "end": 4925.897,
    "text": "No, it just does that at times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4925.978,
    "end": 4926.359,
    "text": " What's that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4927.26,
    "end": 4929.723,
    "text": "ChatGPT just does electronics, nothing else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4930.624,
    "end": 4939.537,
    "text": "Yeah, I got you, but we're talking about the... you want to say there is still a computational sense of encoding and decoding, yes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4940.378,
    "end": 4952.374,
    "text": "But earlier in the talk it was about there's really no computation without some external observer sort of attributing or interpreting a computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4952.438,
    "end": 4954.64,
    "text": " I'm totally fine with your model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4954.66,
    "end": 4957.784,
    "text": "And that's the role of the analog model, if I understand well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4957.904,
    "end": 4958.965,
    "text": "Yeah, that's what I'm trying to get at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4961.108,
    "end": 4972.861,
    "text": "So there's sensory inputs, they get encoded, and then there's a decoding step from the sensory inputs into the analog model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4973.762,
    "end": 4974.403,
    "text": "That's right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4974.763,
    "end": 4980.91,
    "text": "And the analog model is like the conscious episode, and it's what we might call the conscious interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4981.008,
    "end": 4981.869,
    "text": " That's right, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4982.289,
    "end": 4986.273,
    "text": "I'll go back to this diagram if you like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4986.293,
    "end": 4993.541,
    "text": "I'll just come back to... Is that diagram showing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4995.262,
    "end": 4996.183,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4996.604,
    "end": 5000.748,
    "text": "But earlier you said decoding was going to be the same as interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5000.848,
    "end": 5008.956,
    "text": "And so what I'm getting at is like the D, like for your set, your outer D to muscles, is that really interpretation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5009.324,
    "end": 5013.47,
    "text": " They are decoding spike trains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.531,
    "end": 5016.455,
    "text": "They are interpreting spike trains as physical movements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5018.318,
    "end": 5033.421,
    "text": "From the outset, Robert said, if you only take the computer model, which in the digital world excludes an analog model in this rationale, then you cannot get an interpreter that is inside the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.662,
    "end": 5037.728,
    "text": "It's always some human or some other type of interpreter outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5037.708,
    "end": 5067.715,
    "text": " now what is introducing is a new mechanism that is still to be uncovered in terms of its physics or its whatever in which a analog model is actually working within the brain and therefore is not digitally operating as in a computer so there is a mixed architecture between a digital and analog system in the brain yeah so to speak",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5067.695,
    "end": 5096.217,
    "text": " yes but but just it just to it's it seems to me like your your d and the red box that process is not it's the the coding process is not itself an intentional interpretation but it results in one yeah uh it results in one yeah it's creating the analog model okay uh benjamin and then paul and then anyone else who wants to add more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5100.736,
    "end": 5101.457,
    "text": " Unmute, Benjamin.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5105.102,
    "end": 5105.823,
    "text": "Benjamin, unmute.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5109.728,
    "end": 5110.289,
    "text": "Apologies.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5111.911,
    "end": 5129.595,
    "text": "If I understand correctly, and I'm sure you can clarify this for me, there are, according to this projective wave theory of consciousness, there are certain things that are built in or baked into the system, such as time pressure or time perception,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5130.098,
    "end": 5142.216,
    "text": " And, uh, are there other things besides, you know, uh, time and space that are, would be necessary for this, uh, for consciousness consciousness to emerge?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5142.556,
    "end": 5146.742,
    "text": "Or, uh, is it just that with, you know, the effects of entropy?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5148.044,
    "end": 5149.627,
    "text": "I would put the emphasis on space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5150.328,
    "end": 5153.833,
    "text": "The animal model is a model of space in the present moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5154.654,
    "end": 5159.481,
    "text": "And I think for most animals, the present moment is all that exists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5160.322,
    "end": 5164.066,
    "text": " they don't have a sense of chronological time and they don't worry about time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5164.086,
    "end": 5166.108,
    "text": "They're just worrying about what they're going to do right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5167.089,
    "end": 5170.753,
    "text": "And so that's, for that they need analog model of space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5170.853,
    "end": 5173.836,
    "text": "So I would put much more emphasis on space than time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5173.876,
    "end": 5183.366,
    "text": "I think chronological time is a recent human thing that came along with language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5183.386,
    "end": 5183.606,
    "text": "Great.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5183.626,
    "end": 5186.369,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5186.389,
    "end": 5188.371,
    "text": "Brianna, then Paul or anyone else.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5190.73,
    "end": 5191.21,
    "text": " Hi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5193.453,
    "end": 5196.996,
    "text": "So what if I look at something and I can't quite comprehend it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5197.056,
    "end": 5201.14,
    "text": "Would that mean I'm not conscious of... I'm not currently conscious?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5201.6,
    "end": 5207.626,
    "text": "What if an animal can't comprehend something or anything, for that matter?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5209.007,
    "end": 5211.129,
    "text": "Sorry, I didn't catch all the questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5212.451,
    "end": 5213.211,
    "text": "Try again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5213.672,
    "end": 5219.117,
    "text": "So the ability to extract meaning in an analog model is what you would say is required for consciousness, then?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5220.076,
    "end": 5220.396,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5221.377,
    "end": 5224.02,
    "text": "So what if I'm unable to extract meaning about something?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5224.04,
    "end": 5226.223,
    "text": "Am I not conscious in that moment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5227.364,
    "end": 5229.406,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5229.606,
    "end": 5231.088,
    "text": "I think you were asking about animals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5232.87,
    "end": 5235.793,
    "text": "I think we've got a perfectly good theory of animals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5236.554,
    "end": 5247.906,
    "text": "Animal brains absorb sense data and classify sense data into situations they need to do things about and do things about those situations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5248.274,
    "end": 5251.538,
    "text": " Now that theory doesn't tell us how animal brains are conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5254.001,
    "end": 5266.297,
    "text": "So I would decouple the two issues of how a brain does its practical job of helping the animal or the person survive versus how a brain actually creates consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5266.357,
    "end": 5271.143,
    "text": "Now we don't actually know whether animals are conscious, but I would guess that they are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5271.933,
    "end": 5279.867,
    "text": " So if they're unable to make the classification of, for example, the sheep from the earlier analogy, then they would not be conscious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5281.67,
    "end": 5283.773,
    "text": "Well, I think the two questions are independent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5284.354,
    "end": 5295.694,
    "text": "The animal brain can make the classification that it has to, but it can do that without being conscious of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5295.714,
    "end": 5295.814,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5296.672,
    "end": 5301.183,
    "text": " Perhaps, Brianna, you can think of an example that comes from neuropsychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5301.264,
    "end": 5310.647,
    "text": "Think about a person who gets dementia or some other very debilitating neurological disease.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5311.572,
    "end": 5334.188,
    "text": " and for whom at some point everything is a confused world, which is very difficult to interpret, very disorienting, very minimalistic in terms of the content, the quantity of information that a person can integrate, but nevertheless the person still is trapped into this confused and disorienting experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5334.168,
    "end": 5342.262,
    "text": " So there might be consciousness, but not necessarily very informative in the sense of a coupling, adaptive coupling with the world, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5342.282,
    "end": 5343.704,
    "text": "Would you agree with that, Robert?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5343.724,
    "end": 5350.135,
    "text": "I agree that if you take this viewpoint,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5351.448,
    "end": 5359.781,
    "text": " you can bounce it off all sorts of situations like that, the sort of person who's terminally confused and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5359.801,
    "end": 5365.611,
    "text": "And I think you keep getting insights as to how the picture works in those cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5366.392,
    "end": 5374.485,
    "text": "And it takes to me quite a lot of sort of reflecting about what this model of the brain actually means and how it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5375.478,
    "end": 5380.245,
    "text": " how it affects how we interpret various strange conditions like that, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5380.966,
    "end": 5386.695,
    "text": "I agree, it's instructive to do, but I don't have all the answers to what comes out of asking those questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5387.857,
    "end": 5392.864,
    "text": "So the patient with dementia would be less conscious than someone without it is?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5393.906,
    "end": 5396.31,
    "text": "What we would denote from that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5396.33,
    "end": 5400.736,
    "text": "No, a person with dementia might still be very conscious of the room around them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5401.337,
    "end": 5402.199,
    "text": "But they're missing the meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5402.219,
    "end": 5404.422,
    "text": "But in a really instantaneous way, rather than like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5405.262,
    "end": 5409.751,
    "text": " an animal has no sense of the future or the past or causality or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5410.472,
    "end": 5414.5,
    "text": "It could be just conscious of sensations in the present moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5415.381,
    "end": 5415.642,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5415.822,
    "end": 5420.892,
    "text": "And for me, you know, Brianna, what you say is somewhat what would the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5421.293,
    "end": 5436.555,
    "text": " integrated information theory with claims that you need to have some sort of complexity and efficiently integrated information that is both rich and synthetic to get a high quantity of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5438.638,
    "end": 5442.523,
    "text": "But to me, the core of consciousness is not that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5443.144,
    "end": 5447.25,
    "text": "And I worked a lot with patients a long time ago in neuropsychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5447.483,
    "end": 5454.092,
    "text": " And I think you can be acutely conscious while being totally confused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5454.673,
    "end": 5457.958,
    "text": "It can be a very intense conscious experience to be totally confused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5457.978,
    "end": 5459.88,
    "text": "I'll change to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5460.06,
    "end": 5463.265,
    "text": "It's not informative in the sense of adaptive coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5464.186,
    "end": 5468.412,
    "text": "So then meaning is not required for consciousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5469.843,
    "end": 5477.396,
    "text": " Or maybe a bit of meaning, but at least some... And again, that begs the question of what we call meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5477.436,
    "end": 5478.739,
    "text": "It's a complicated question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5479.28,
    "end": 5491.581,
    "text": "But at least the structured, adaptive, highly informative contents of consciousness, when the brain is super efficient and well coupled with its environment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5492.101,
    "end": 5498.812,
    "text": " might not be what really is the most fundamental aspect of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5499.173,
    "end": 5500.335,
    "text": "It often goes with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.355,
    "end": 5502.558,
    "text": "It's very useful to have it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5502.578,
    "end": 5514.278,
    "text": "But I remember a patient is a very amnesic patient with anterograd amnesia that were very, very bad or dementia patient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5514.562,
    "end": 5540.822,
    "text": " that really really really were confused but we are living very intense and distressing experience and i would say that even though they could not necessarily have a very profound recursive thinking about their own consciousness and how it is perceived by others etc even though they they would have a very hard time to navigate even their immediate environment their experience was intense",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5542.388,
    "end": 5544.772,
    "text": " Yes, I definitely agree with your interpretation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5546.194,
    "end": 5550.381,
    "text": "Fascinating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5550.461,
    "end": 5551.122,
    "text": "Can I chip in?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5551.222,
    "end": 5551.683,
    "text": "Is it here?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5553.926,
    "end": 5554.327,
    "text": "Hi, Paul.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5555.529,
    "end": 5555.929,
    "text": "Hi, Robert.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5556.831,
    "end": 5558.694,
    "text": "I thought you'd be disappointed if I didn't say something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5558.754,
    "end": 5561.759,
    "text": "So here we go.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5562.96,
    "end": 5565.865,
    "text": "I'm also a little disappointed you didn't credit me with the Roomba example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5568.005,
    "end": 5593.759,
    "text": " didn't I didn't what didn't credit me with the Roomba I didn't get in that the rumor example is due to Paul um so first of all just to say that I I'm a lay person in all of the aspects of um of this discussion except for the fact I'm a professional human being um and uh Robert and I often engage in uh philosophical and um computational discussions",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5594.549,
    "end": 5596.952,
    "text": " around the area, this area.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5597.834,
    "end": 5609.069,
    "text": "And being a layperson, I can pose some questions, but I may not understand your answers, so I'm going to say that right from the outset.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5609.67,
    "end": 5620.084,
    "text": "Nor may I. But Robert's requirement for encoding and decoding",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5623.0,
    "end": 5645.312,
    "text": " relies on the requirement for an extra layer of significance a meaning to use the word that he has given it um and my understanding is that those requirements for extra significance and meaning come from the fact that we know we are conscious that we have consciousness",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5645.714,
    "end": 5657.225,
    "text": " So Robert and I, in one of our discussions, came to a bit of an impasse where he said, well, I know I can take the rim bar apart and I can see how it works.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5657.806,
    "end": 5662.25,
    "text": "And it's clearly just a matter of physics and electronics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5664.012,
    "end": 5668.737,
    "text": "And so we have that evidence and then we have the evidence that we are conscious.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5669.277,
    "end": 5671.119,
    "text": "Then he said, at least I'm conscious.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5671.539,
    "end": 5672.74,
    "text": "Do you not know that you are, Paul?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5673.741,
    "end": 5675.383,
    "text": "And I",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5676.376,
    "end": 5677.338,
    "text": " I don't know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5678.96,
    "end": 5700.274,
    "text": "I don't know I'm conscious in the sense that there is a clear category difference between what I experience, what I feel, if you like, and what I can imagine an advanced AI, self-evolving,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5702.836,
    "end": 5731.375,
    "text": " computer with sensors actuators etc to have i cannot hand on heart so that i know where that dividing line comes so i would just like to posit that there is no meaning beyond what our brains our neural brains what their currency is what their conclude what the conclusion of our neural brains is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5731.709,
    "end": 5750.853,
    "text": " There is no meaning beyond that because both the advanced Roomba or ourselves, we attach adequate meaning to what we perceive to inhabit the environment we're in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5752.395,
    "end": 5760.265,
    "text": "So I would question why there is a divide that requires encoding and decoding to happen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5760.852,
    "end": 5767.578,
    "text": " I think in a nutshell, that's the essence of the argument, which I've rehearsed with Robert before.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5769.419,
    "end": 5770.34,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5770.52,
    "end": 5772.002,
    "text": "Let me try and approach that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5772.062,
    "end": 5775.425,
    "text": "I mean, I'm concerned with doing science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5777.386,
    "end": 5780.929,
    "text": "In order to do science, I need experimental data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5782.451,
    "end": 5789.577,
    "text": "And if I'm going to do science about consciousness, I need experimental data about consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5790.08,
    "end": 5793.966,
    "text": " And I have got data, I claim, that tells me I am conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5795.148,
    "end": 5797.913,
    "text": "But I haven't got data that tells me the Roomba is conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5798.013,
    "end": 5811.936,
    "text": "So the question of whether or not a Roomba is conscious, I don't feel it's justified to assume it is conscious in anything it is like to be a Roomba.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5813.08,
    "end": 5821.827,
    "text": " I just don't see that's a problem for my science if it's solely trying to account for consciousness of things with brains, biological things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5822.668,
    "end": 5831.556,
    "text": "So in a sense, the question of whether the rumour is conscious or not is of less interest to me just because I don't have data about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5832.536,
    "end": 5834.618,
    "text": "But I think I do have data about me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5835.359,
    "end": 5837.901,
    "text": "But that's not the challenge I'm putting to you, Robert.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5838.822,
    "end": 5840.323,
    "text": "No, you're totally wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5841.104,
    "end": 5842.885,
    "text": "Well, the challenge...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5843.033,
    "end": 5872.517,
    "text": " I'm putting to you in essence is whether there is a distinction between the sensory experience, ability to operate in this environment that are, well, it's a Roomba and beyond sort of advanced AI, self-evolving, possibly self-replicating with improvements, robot, between that and what we are.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5873.138,
    "end": 5895.332,
    "text": " So I'm challenging the notion that humans have some categorical distinction, sort of self-awareness, awareness of our environment, which we call consciousness, which I have a real problem with that word, which is different to that of an advanced",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5895.886,
    "end": 5899.27,
    "text": " piece of electronics and computing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5900.172,
    "end": 5904.397,
    "text": "So I'm not challenging you to say whether a Roomba is conscious or not.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5904.457,
    "end": 5911.947,
    "text": "I'm challenging you to identify a distinction between the two, because if there is no distinction between the two... The only distinction is I've got data about me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5912.047,
    "end": 5913.489,
    "text": "I don't have data about a Roomba.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5915.572,
    "end": 5917.354,
    "text": "And I'm doing science, so I need data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5919.46,
    "end": 5928.55,
    "text": " But the data you've ascribed to yourself is consciousness that is distinct from a machine's.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5929.211,
    "end": 5933.335,
    "text": "I have data that says there is something that is like to be me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5934.356,
    "end": 5938.28,
    "text": "This is the Thomas Nagel sense of consciousness that is what it is like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5938.961,
    "end": 5945.348,
    "text": "And internally in my brain, in my life, there is something that is like to be alive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5945.909,
    "end": 5948.151,
    "text": "I don't have that evidence about a Roomba.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5948.62,
    "end": 5950.242,
    "text": " So a Roomba doesn't worry me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5953.507,
    "end": 5956.992,
    "text": "Because I'm trying to do science, not just philosophy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5957.033,
    "end": 5959.797,
    "text": "I'm using philosophy for science, if you like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5960.518,
    "end": 5963.883,
    "text": "And for my scientific purposes, I need data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5964.323,
    "end": 5968.89,
    "text": "And the only data on consciousness that I've got is data on consciousness in people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5971.013,
    "end": 5975.32,
    "text": "So I'm deliberately restricting my focus, if you like, just to do this and not that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5976.161,
    "end": 5977.463,
    "text": "But what you're saying is that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5978.894,
    "end": 6007.197,
    "text": " you have is that your consciousness is putting a degree of significance on the objects which your eyes light on which is greater than that simply required to operate in your environment um i i don't i don't see yeah i mean it's a remarkable fact i i could be a zombie but i'm not right well that's what i'm trying to do in the lightest possible way",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6008.611,
    "end": 6018.063,
    "text": " I mean, it's a philosophical possibility that I am a zombie, but I haven't had a first-person experience which says I'm not a zombie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6019.024,
    "end": 6023.409,
    "text": "Whereas a Roomba could well be a zombie, and I think it actually is a zombie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6024.09,
    "end": 6024.791,
    "text": "It doesn't bother me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6025.412,
    "end": 6028.375,
    "text": "I just restrict my viewpoint to where I've got data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6029.977,
    "end": 6036.205,
    "text": "I'm not sure that's what Paul is talking about, but... No, I think you got it wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6039.982,
    "end": 6042.426,
    "text": " I'm saying my viewpoint is restricted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6042.546,
    "end": 6043.988,
    "text": "I'm only trying to do science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6044.029,
    "end": 6046.653,
    "text": "I'm not trying to evaluate philosophical possibilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6048.756,
    "end": 6051.541,
    "text": "I'm only trying to produce a scientific account of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6052.242,
    "end": 6059.273,
    "text": "And the only consciousness I know about is what happens in biological things such as me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6061.008,
    "end": 6064.513,
    "text": " Yeah, and I'm not making a philosophical point.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6065.194,
    "end": 6084.682,
    "text": "I'm simply saying that your requirement for encoding and decoding is only there because you think that there is something, some attachment of meaning and significance required to those things over and above what is simply required to operate in an environment like a Roomba.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6085.263,
    "end": 6087.206,
    "text": "And I don't see that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6087.547,
    "end": 6088.087,
    "text": "I don't see that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6088.468,
    "end": 6088.568,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6091.079,
    "end": 6103.215,
    "text": " I mean, part of the confusion in these debates is that we're stuck with language and language is encoded and it's encoded very badly and ambiguously.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6103.255,
    "end": 6106.239,
    "text": "And we use words with very different meanings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6106.459,
    "end": 6118.335,
    "text": "And so we can construct all these constructs about consciousness, which go way beyond the thing itself and which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6120.661,
    "end": 6124.685,
    "text": " get us down blind alleys, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6124.845,
    "end": 6134.574,
    "text": "I think, you know, I have a problem with the term consciousness and it's very... It is one of those words that we're very bad at.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6135.575,
    "end": 6141.721,
    "text": "I mean, when we use words, we imagine they're kind of precise and say what we mean, but they are so imprecise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6143.443,
    "end": 6150.229,
    "text": "It does surprise me that the scientific community would continue to use a word like consciousness rather than break it down to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6150.479,
    "end": 6153.206,
    "text": " its constituent parts and banning the use of the word consciousness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6153.727,
    "end": 6154.95,
    "text": "It does not feel helpful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6157.335,
    "end": 6157.957,
    "text": "That's been true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6159.841,
    "end": 6164.252,
    "text": "Well, I think Brianna had a follow-up, isn't that right, to Paul's?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6165.515,
    "end": 6166.396,
    "text": " You are right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6166.456,
    "end": 6167.418,
    "text": "Okay, go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6168.479,
    "end": 6180.656,
    "text": "So building on Paul's point, I'm actually curious whether an AI model's need to navigate its environment through interacting with us and processing tokens might lead to its own development of a subjective experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6181.537,
    "end": 6190.51,
    "text": "Could it be that such operational requirements foster an emergent intelligence that we simply can't grasp because we don't share the same kind of subjectivity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6190.49,
    "end": 6206.008,
    "text": " In other words, if these models engage with the world in ways that parallel our interactions, what exactly distinguishes their processes from what we recognize as human consciousness and does this experience involve extracted meaning?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6209.392,
    "end": 6214.658,
    "text": "I don't think I have a neat answer to that, really.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6215.414,
    "end": 6226.998,
    "text": " I just come back to my view that anything that goes on inside an AI computer, whether it's running a robot or anything else, is not about things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6228.34,
    "end": 6233.17,
    "text": "And I have consciousness which seems to me to be about things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6234.938,
    "end": 6241.965,
    "text": " For you, I mean, you can't verify that I'm conscious or that no one else is conscious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6242.085,
    "end": 6246.429,
    "text": "So why can't we verify that a machine is also conscious?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6250.412,
    "end": 6254.136,
    "text": "Can they extract meaning like we do from their own subjective experience?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6254.216,
    "end": 6255.978,
    "text": "And does that fit into your model?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6259.641,
    "end": 6263.865,
    "text": "If they are conscious, the consciousness they have is not the subject I'm studying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6265.297,
    "end": 6290.038,
    "text": " does that help at all no probably not that that does help actually it's a fascinating conversation yep how about each person can give sort of a final round where does this take benjamin and then continue around hello uh yeah so i i",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6290.727,
    "end": 6304.787,
    "text": " To answer questions about artificial intelligence and consciousness, no, I don't think artificial intelligence can be conscious, at least not distributed systems specifically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6304.807,
    "end": 6313.68,
    "text": "The needing diversity complexity, these kind of things would",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6313.88,
    "end": 6323.704,
    "text": " prevent that from occurring in any real measurable way, like in terms of subconscious or something of that nature.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6324.578,
    "end": 6328.424,
    "text": " Like a thousand of a thing is not diversity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6328.444,
    "end": 6329.345,
    "text": "It's not complexity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6329.425,
    "end": 6331.028,
    "text": "It's just one thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6331.509,
    "end": 6341.804,
    "text": "So in that regard, no, I don't think that it's possible in any way for artificial intelligence to achieve like sentient self-awareness consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6343.006,
    "end": 6344.869,
    "text": "But it definitely looks like it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6345.87,
    "end": 6346.972,
    "text": "And I think that's pretty cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6347.693,
    "end": 6348.274,
    "text": "Certainly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6349.456,
    "end": 6352.24,
    "text": "If it walks like a duck and it talks like a duck, it's probably a duck.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6352.574,
    "end": 6381.349,
    "text": " yeah exactly David and Kenneth well I'm gonna be a bit mischievous I agree with everybody and I don't know at this point so the everything is open to me almost not everything but I don't know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6383.877,
    "end": 6388.806,
    "text": " Yeah, I think that is the last word, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6388.826,
    "end": 6389.006,
    "text": "Ken?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6389.868,
    "end": 6406.678,
    "text": "Well, I mean, I think it's perfectly conceivable that you could have an AI that passes every kind of souped-up Turing test you want, and they become our best friends.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6406.912,
    "end": 6409.118,
    "text": " or whatever, and they're complete zombies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6409.258,
    "end": 6410.441,
    "text": "I think that's perfectly possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6411.363,
    "end": 6412.466,
    "text": "At least it's conceivable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6413.248,
    "end": 6420.988,
    "text": "On the other hand, I take your argument, Robert, to be something like, look, if all you've got is computation...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6421.323,
    "end": 6437.627,
    "text": " So if an AI, no matter how fancy it is, no matter how behaviorally equivalent it is to a conscious being, if all it's got is computation going on, it's not conscious because we know that these computations do not carry any meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6438.265,
    "end": 6444.378,
    "text": " They're not carrying intentionality and consciousness at least has the capacity for intentionality and meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6444.819,
    "end": 6455.903,
    "text": "That whole argument, as I said earlier on, is going to depend on just, like, do you think there is a reasonable theory of intentionality that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6455.883,
    "end": 6459.628,
    "text": " could be applied to computational systems or natural systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6459.648,
    "end": 6466.398,
    "text": "And that, of course, is an old debate, as I said earlier, that goes back to even before Searle and Dennett.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6466.438,
    "end": 6472.266,
    "text": "But Searle and Dennett and then people arguing about intentionality and representation after that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6472.927,
    "end": 6480.658,
    "text": "And then kind of, you're right, that Chalmers kind of resuscitates it, but it's also like, it's a kind of a debate that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6480.638,
    "end": 6508.637,
    "text": " that went somewhat silent i think because everybody realized they have no idea what to say um and at the end of the day but i think it's it's it's good that you're bringing it back up and that you're making us think about this in light of a new idea um now that idea itself i want to ask you one sort of last detail oh let me just say in in favor of the word keeping the word consciousness",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6510.271,
    "end": 6516.085,
    "text": " No, it's been tried before to ban the word consciousness from the philosophy of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6516.146,
    "end": 6523.183,
    "text": "This was a very formidable attempt by none other than the nefarious Martin Heidegger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6523.653,
    "end": 6530.144,
    "text": " with the word Dasein, and then of course you just end up creating more ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6531.265,
    "end": 6534.25,
    "text": "So I think we got to pick some word, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6534.371,
    "end": 6535.492,
    "text": "Consciousness is fraud.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6535.512,
    "end": 6538.277,
    "text": "It has an interesting history, but we got to pick some word for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6538.297,
    "end": 6540.22,
    "text": "But okay, let me put that aside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6540.24,
    "end": 6542.764,
    "text": "The thing about your model is this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6542.905,
    "end": 6549.255,
    "text": "When you say that this analog model of space has to be topologically equivalent to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6550.585,
    "end": 6551.147,
    "text": " Space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6551.669,
    "end": 6552.452,
    "text": "Ambient space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6552.693,
    "end": 6553.235,
    "text": "Is that right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6553.938,
    "end": 6555.163,
    "text": "Physical reality, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6555.183,
    "end": 6557.833,
    "text": "If you feel a change in front of you, your muscle has a change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6558.275,
    "end": 6561.507,
    "text": "And there's a continuous function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6562.651,
    "end": 6562.951,
    "text": " right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6563.032,
    "end": 6565.835,
    "text": "The function relating them must be continuous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6566.496,
    "end": 6571.483,
    "text": "Does that mean that the analog model of space is itself really just a space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6571.503,
    "end": 6574.367,
    "text": "It is in fact itself a kind of space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6574.908,
    "end": 6575.989,
    "text": "And is it continuous?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6576.27,
    "end": 6581.176,
    "text": "And is it going to require that the physical realization of it involves continuity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6581.777,
    "end": 6591.19,
    "text": "Well, in my particular theory, the analog model is a Fourier transform of a spatial distribution, which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6592.402,
    "end": 6596.986,
    "text": " And consciousness somehow involves a Fourier transform, but that gets technical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6597.847,
    "end": 6607.295,
    "text": "But nevertheless, Fourier transforms are very deep in physics and quantum mechanics, so I think Fourier transforms having to do with consciousness is not a big stretch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6609.477,
    "end": 6610.979,
    "text": "That's a way of evading the question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6611.499,
    "end": 6613.221,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6613.481,
    "end": 6620.367,
    "text": "Because you might think, no, whatever's going on here, like our experience of space, it cannot be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6620.836,
    "end": 6638.157,
    "text": " like Actually realized in something continuous or it can't know I think a real a miniature space inside the brain is not gonna happen Cannot that we know enough about the brains and that there's not some Miniature model of the world inside the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6638.457,
    "end": 6644.004,
    "text": "Yeah, but I think for a transform in a wave is Is the way that can happen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6644.425,
    "end": 6644.785,
    "text": "Okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6649.81,
    "end": 6650.271,
    "text": " All right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6650.893,
    "end": 6651.655,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6651.956,
    "end": 6655.466,
    "text": "Thank you to the live chatters also for their vigorous commentary.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6656.89,
    "end": 6658.434,
    "text": "So thank you all.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6659.116,
    "end": 6660.099,
    "text": "Till next time.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6663.288,
    "end": 6663.488,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6663.508,
    "end": 6663.789,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6664.11,
    "end": 6664.832,
    "text": "Many thanks.",
    "speaker": "SPEAKER_07"
  }
]