[
  {
    "start": 6.528,
    "end": 31.978,
    "text": " hello welcome everyone it is august 20th at the stroke of zero utc on the 21st in 2025 and it's active inference guest stream 118.1 we're here with tadihiro taniguchi and we'll see a presentation on co-creative learning via metropolis hastings interaction between humans and ai",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.347,
    "end": 38.964,
    "text": " And then I will read any questions in the live chat and ask some things about this fascinating research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.304,
    "end": 43.555,
    "text": "So thank you for joining again, Tadahiro, and to you for the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.577,
    "end": 50.963,
    "text": " Thank you very much for inviting me to this great guest stream again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.944,
    "end": 69.762,
    "text": "I'm Tadahiro Taniguchi from Kyoto University and today I'll be talking about co-creative learning by a method of processing interaction between humans and AI and this is based on our preprint which is recently available on arXiv.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.062,
    "end": 72.766,
    "text": " So this is the co-creative learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.367,
    "end": 77.432,
    "text": "It's a new theory of human-in-the-loop machine learning method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.413,
    "end": 88.467,
    "text": "So I'll also discuss a collective predictive coding hypothesis, which I talked in the previous guest stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.928,
    "end": 90.991,
    "text": "Maybe you can check it later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.531,
    "end": 93.454,
    "text": "But as a background of this work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.227,
    "end": 95.368,
    "text": " OK, let me start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.309,
    "end": 101.936,
    "text": "So here is an overview of our main contributions of this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.677,
    "end": 107.122,
    "text": "The first, we formally propose co-creative learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.842,
    "end": 114.65,
    "text": "This is a novel paradigm where humans and AI collaboratively achieve symbol emergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.111,
    "end": 119.796,
    "text": "In other words, the formation of the external representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.776,
    "end": 127.305,
    "text": " by mutually integrating their partial perceptual information to build shared representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.433,
    "end": 140.667,
    "text": " This fundamentally shifts the perspective on human-AI alignment or teaching process, moving beyond traditional unilateral approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.328,
    "end": 147.696,
    "text": "Second, we introduce an experimental framework based on the Metropolis-Hastings naming game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.617,
    "end": 153.242,
    "text": "Through this framework, we propose the comparing empirical evidence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 155.315,
    "end": 160.621,
    "text": " can effectively engage in this creative learning process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.363,
    "end": 179.061,
    "text": "So the visual of this slide illustrates the idea of mutual interaction between the human and the AI centering around the shared world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.969,
    "end": 186.338,
    "text": " So let's consider why co-creative learning is so crucial currently at this phase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.34,
    "end": 192.808,
    "text": "So the first one is limitations of unilateral alignment or teaching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.709,
    "end": 206.888,
    "text": "Traditionally, unilateral alignment or teaching, typically supervised learning based on ground truth labels provided by human annotators, have significant limitations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.986,
    "end": 218.981,
    "text": " For instance, AI systems already excel beyond average human performance in many areas, possessing distinct and often superior domain knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.163,
    "end": 225.97,
    "text": "Furthermore, the human and AI inherently have heterogeneous knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.811,
    "end": 233.82,
    "text": "Our ways of understanding and processing information are fundamentally different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.29,
    "end": 254.562,
    "text": " And also, when embodied AI agents start exploring the world autonomously, it becomes questionable whether we should enforce our existing human knowledge and values as the sole ground truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.742,
    "end": 262.474,
    "text": "In some sense, we should respect AI's perception and our knowledge to bring our knowledge better status.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.517,
    "end": 269.646,
    "text": " Another thing is the bidirectional influence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.746,
    "end": 279.301,
    "text": "Actually, the large language models, for example, actively impact the human language use and decision-making, as shown by recent studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.962,
    "end": 290.217,
    "text": "This mutual influence clearly highlights the limitation of the perspective of purely one-sided alignment teaching strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.382,
    "end": 312.23,
    "text": " Therefore, looking beyond the current generative AI era, it is important that we establish a new systems theory, principle, and learning method to achieve a true human-AI symbiosis, considering bidirectional alignment or teachings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.431,
    "end": 316.575,
    "text": "That can be called co-creative learning process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.956,
    "end": 332.581,
    "text": " So to position co-creative learning more intuitively from the machine learning perspective, let's briefly and roughly review existing traditional unilateral machine learning frameworks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.601,
    "end": 337.028,
    "text": "So in the most common, in supervised,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.008,
    "end": 339.172,
    "text": " or reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.993,
    "end": 347.486,
    "text": "The human's perspective, P, this human's perspective can be written like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.207,
    "end": 352.194,
    "text": "The Xn human is the human's observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 352.214,
    "end": 362.391,
    "text": "And Sn is the kind of cross-level or description of the human's perceptional information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 362.371,
    "end": 375.609,
    "text": " In our society, we form the relationship between the labels and the partial information in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.091,
    "end": 387.265,
    "text": "This effectively serves as the ground truth or the target or the source of reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 387.92,
    "end": 389.742,
    "text": " for the AI to learn from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.704,
    "end": 396.552,
    "text": "The AI's understanding is therefore fundamentally bounded by the human's perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.434,
    "end": 412.273,
    "text": "In contrast, in unsupervised or self-supervised learning, the AI agent learns in isolation, inferring knowledge thoroughly from its own observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.84,
    "end": 423.536,
    "text": " In this case, its understanding is bounded only by the limits of its own perceptual data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.838,
    "end": 439.543,
    "text": "A key takeaway from both these traditional approaches is that only partial information, either human or AI, is used for the learning process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.3,
    "end": 442.724,
    "text": " So this highlights a critical limitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.586,
    "end": 457.231,
    "text": "The NISA approach fully leverages the combined potentially richer information available when humans and AI interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.152,
    "end": 463.422,
    "text": "So this brings us to our proposal, the new bilateral frameworks, co-creative learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.093,
    "end": 480.683,
    "text": " Here, the goal is not for one agent to teach the other, but for both to engage in bidirectional message passing through language games and communication to integrate their partial observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.966,
    "end": 488.177,
    "text": "So, instead of treating one agent's perspective as the sole ground truth,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.444,
    "end": 498.881,
    "text": " The running target for the diode that becomes the true posterior distribution are conditioned on the joint observation of both agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.724,
    "end": 503.589,
    "text": "Here, X and AI and X, the human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.891,
    "end": 506.554,
    "text": "This is crucial distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.061,
    "end": 528.063,
    "text": " and partial information, this approach allows emergent shared understanding to surpass the knowledge and perception that either the humans or the AI could have formed alone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.445,
    "end": 539.697,
    "text": "The diagram on this slide illustrates this mutual interaction and the formation of a joint, more complete understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.647,
    "end": 545.33,
    "text": " But how can we do this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.211,
    "end": 547.412,
    "text": "That is the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.993,
    "end": 561.427,
    "text": "And before diving into today's main topic, let me briefly introduce or review the collective predictive coding hypothesis, which I proposed last year and gave a talk in this guest stream last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.248,
    "end": 570.797,
    "text": "So this hypothesis extends the idea of well-known predictive coding to social and linguistic phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.212,
    "end": 580.186,
    "text": " So it states that symbol systems, including language, are formed through collective predictive coding by humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.128,
    "end": 596.295,
    "text": "In other words, a human society, which can be regarded as a symbol emergence system, the systems performing symbol emergence technically, can be understood as a social representation learning system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.68,
    "end": 605.28,
    "text": " As a result, the information of the world may be encoded in the distributional semantics of our language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.062,
    "end": 612.276,
    "text": "The hypothesis also suggests that this is why large language models appear to understand the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.256,
    "end": 620.706,
    "text": " they inherit this structure through vast amount of distributed human-generated text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.507,
    "end": 638.027,
    "text": "By the way, the diagram illustrates this complex process where the emergent, where the individual inference and action loop contribute to an emergent, the symbol system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.007,
    "end": 642.994,
    "text": " that in turn constrains the organizers' collective behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.015,
    "end": 645.237,
    "text": "So let me illustrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.098,
    "end": 649.703,
    "text": "So maybe the explanation was too quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 650.043,
    "end": 661.539,
    "text": "So let me illustrate the CPC hypothesis, collective predictive coding process, the bridging the idea of emergent communication and predictive coding, or free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.36,
    "end": 666.546,
    "text": "First, let's start from the predictive coding, or world model learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.982,
    "end": 669.145,
    "text": " So there is a person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.066,
    "end": 676.914,
    "text": "He or she internally has internal representation over world models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.576,
    "end": 683.341,
    "text": "And we are living with action perception loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 684.362,
    "end": 688.607,
    "text": "So this is, very roughly speaking, the inference process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.508,
    "end": 691.511,
    "text": "But we humans, we are so many.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 692.352,
    "end": 695.115,
    "text": "And through communication, we form language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.428,
    "end": 713.884,
    "text": " So following that predictive coding hypothesis, through language game, we can form language-like external representations through this total learning process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.945,
    "end": 719.869,
    "text": "I think through this process, we model and adapt to the world collectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.832,
    "end": 725.254,
    "text": "But here, let me take another view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.555,
    "end": 732.823,
    "text": " Until now, we believe, we assume that each person is an independent and autonomous agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.404,
    "end": 737.629,
    "text": "But let's change and take another viewpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.713,
    "end": 742.114,
    "text": "First, language is here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 742.855,
    "end": 745.078,
    "text": "Language is a kind of autonomous system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.94,
    "end": 751.084,
    "text": "And they have sensors or also actuators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.525,
    "end": 752.406,
    "text": "That's us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.757,
    "end": 757.101,
    "text": " The language utilizes us to model the world through interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.442,
    "end": 762.767,
    "text": "From this viewpoint, we are subordinate to the language system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.467,
    "end": 771.195,
    "text": "This kind of view is often mentioned in sociology or other social science area or cultural psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.036,
    "end": 781.785,
    "text": "So I think this kind of dual viewpoint is very interesting to extend our view of cognition to the social viewpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.765,
    "end": 811.637,
    "text": " and actually this dual viewpoint actually gave us opportunity gives us opportunity to formalize this process from the viewpoint of free energy principle so the based on the generative model representing a cpc i mean this kind of the the language model let's let's let's consider a language is a kind of brain having these uh sensors sensor motor systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.005,
    "end": 829.744,
    "text": " So, following the graphical model, the probabilistic generative model, describing such kind of process, we can define the free energy in the same way as the normal, usual free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.614,
    "end": 840.829,
    "text": " Interestingly, we can naturally derive this kind of formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 841.209,
    "end": 847.179,
    "text": "And interestingly, the final form can be divided into two parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.561,
    "end": 853.148,
    "text": "So the first one is an ordinary variation of free energy term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.869,
    "end": 858.837,
    "text": "And this is sum of the variation of free energy of a number of agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.137,
    "end": 862.022,
    "text": " In addition to that, an interesting term pops up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.684,
    "end": 865.889,
    "text": "We call this a collective regularization term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.871,
    "end": 879.795,
    "text": "This term tries to align agents' external representations, W, and with each agent's internal representation, Z.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.775,
    "end": 890.528,
    "text": " With this term, the problem of minimization of individual free energy becomes the minimization of free energy of a single total system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.52,
    "end": 904.213,
    "text": " I think this book can extend the free energy principle from the individual to the collective level, with a clear relationship to the emergence of symbol systems or language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.974,
    "end": 917.646,
    "text": "As the simplest instance of the theory of collective predictive coding, let me introduce the Metropolis-Hastings naming game, which we previously proposed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 917.626,
    "end": 922.814,
    "text": " It is a type of language game built on solid mathematical foundations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.056,
    "end": 928.983,
    "text": "This will serve as the basis of co-creative learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 929.404,
    "end": 930.445,
    "text": "I will introduce data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.867,
    "end": 932.789,
    "text": "How does it work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.81,
    "end": 934.691,
    "text": "Here is the eyeline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.252,
    "end": 942.503,
    "text": "First, in the perception phase, the speaker and the listener observe the same object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.107,
    "end": 946.191,
    "text": " and infer their internal representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.872,
    "end": 951.498,
    "text": "We assume joint attention here, which is crucial for human language acquisition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.219,
    "end": 959.849,
    "text": "Next, in communication phase, the speaker probabilistically utters a name for the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.91,
    "end": 969.722,
    "text": "The listener then determines if it accepts the naming or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.963,
    "end": 973.665,
    "text": " with a certain probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.066,
    "end": 979.674,
    "text": "The probability depends on its current belief state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.639,
    "end": 995.878,
    "text": "Specifically, this probability shown in the equation on the slide reflects how well the listener's belief matches the name proposed by the speaker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.247,
    "end": 1005.983,
    "text": " So if the listener agent does not find the incoming sign believable, it can reject the proposed name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.044,
    "end": 1009.088,
    "text": "This ability to reject is crucial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1009.548,
    "end": 1011.011,
    "text": "The third, the learning phase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.451,
    "end": 1016.179,
    "text": "After the communication, the listener updates its internal parameter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.159,
    "end": 1019.847,
    "text": " are related to representation, learning, and naming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.588,
    "end": 1028.224,
    "text": "And finally, in the turn-taking step, the speaker and the listener alternate their role, and the game continues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.246,
    "end": 1031.25,
    "text": "Overall, this is a very, very simple game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1031.891,
    "end": 1035.619,
    "text": "But importantly, this game has a solid mathematical basis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.962,
    "end": 1039.566,
    "text": " So, let's dive into the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.586,
    "end": 1055.903,
    "text": "If the acceptance decision is made according to this probability, we can mathematically prove that the naming game is equivalent to the method-processing algorithm for Bayesian inference of the shared representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.187,
    "end": 1079.005,
    "text": " the shown in this figure on the left so let's begin with this graphical model so here OA and OB or we can rename this XA or XB represents a visual observation of each agent they are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.985,
    "end": 1086.193,
    "text": " the agents with the visual input here, but any kind of input is okay, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.694,
    "end": 1092.5,
    "text": "ZA and ZB are the internal representations, latent variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.061,
    "end": 1103.492,
    "text": "We also assume the existence of a variable W, which serves as a prior for these two observations, two internal variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1104.373,
    "end": 1108.738,
    "text": "So if we treat W as a latent variable,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.292,
    "end": 1117.028,
    "text": " This graphical model becomes very similar to the multi-modal or multi-view variational autoencoder or latent variable models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.271,
    "end": 1123.943,
    "text": "And if the two agents' brains were directly connected,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.362,
    "end": 1142.874,
    "text": " and could use both observations simultaneously, yes, this variable can be inferred in the natural way and would encode the combined information from both agents' input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.535,
    "end": 1147.382,
    "text": "However, in reality, they are independent cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.337,
    "end": 1152.906,
    "text": " So let's introduce a trick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1153.527,
    "end": 1158.279,
    "text": "Algorithmically, we can decompose the model into two parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.299,
    "end": 1166.94,
    "text": "So the left-hand side is agent A, and the right-hand side is agent B. So let's consider the kind of alternative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.494,
    "end": 1174.409,
    "text": " the inference, the method for this w. Now think about the sampling process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.151,
    "end": 1184.592,
    "text": "Agent A proposes a candidate of latent variable w by sampling from its posterior distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.782,
    "end": 1204.875,
    "text": " and the proposed value is passed to agent B the agent B can decide whether to accept the sample from a sample based on that probability so this is this process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.294,
    "end": 1229.918,
    "text": " is the and this process can be designed by using the metropolis hastings algorithm which is which is a kind of marco chain monte carlo mcmc so actually the under certain conditions this guarantees that the shared signs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.286,
    "end": 1246.573,
    "text": " are formed and that categories emerges among the agents to approximate the posterior distribution based on the agents' observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.009,
    "end": 1257.986,
    "text": " So importantly, what I explained here is completely equivalent to this naming game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.007,
    "end": 1266.56,
    "text": "So it proves that this naming game itself is Bayesian inference, approximate Bayesian inference procedure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.241,
    "end": 1268.623,
    "text": "So this is a very important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.425,
    "end": 1270.907,
    "text": "This is a very important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1270.887,
    "end": 1276.674,
    "text": " So in the previous paper, we tested this idea on some data set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.135,
    "end": 1293.074,
    "text": "And we showed that the two agents playing Metropolis Hastings' naming game can effectively integrate their perceptual information and form and share signs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1293.955,
    "end": 1297.519,
    "text": "By signs, I mean the categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.499,
    "end": 1299.781,
    "text": " across the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1300.222,
    "end": 1310.112,
    "text": "And actually, such kind of process even outperforms the learning result achieved by a single agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1311.353,
    "end": 1326.409,
    "text": "So without any ground truth, this kind of method-based hasting interaction can improve the representation learning process, in some sense, the knowledge, the formation process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.363,
    "end": 1330.09,
    "text": " OK, so this is the background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1330.934,
    "end": 1336.618,
    "text": "And actually, after this computation study,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.29,
    "end": 1351.03,
    "text": " As you saw in my talk, I always assume that this is something happening in our society, humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.791,
    "end": 1361.104,
    "text": "So, to show that, we need to check, we need to validate that if this kind of things is happening in human interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.603,
    "end": 1377.793,
    "text": " So we designed an experiment to test whether a human participant, when playing a game similar to the MH, Metropolis-Hasings naming game, would follow the acceptance probability calculated by the algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.972,
    "end": 1383.765,
    "text": " The results, as shown in the graphs on the right, are positive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.406,
    "end": 1394.533,
    "text": "We found that human acceptance behavior indeed mostly aligned with the theoretically derived MH acceptance probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.513,
    "end": 1413.701,
    "text": " This is a crucial finding because it suggests that humans, to a certain extent, follow similar patterns to the Metropolis Hastings naming game, providing empirical support for the idea that human behavior on simple emergence might follow a CPC mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.103,
    "end": 1421.652,
    "text": "This paves the way for our recent work, integrating AI and humans into this framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.902,
    "end": 1441.041,
    "text": " so this is the beginning of actually today's main topic so a simple way to introduce co-creative learning is to view it through the lens of a metropolitan style interaction between human and ai like this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.101,
    "end": 1446.286,
    "text": " So OK, let's jump into this section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.087,
    "end": 1459.883,
    "text": "So given this insight, we then move to the core of our current work, the realization of collective predictive coding within a human and AI collaborative system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.005,
    "end": 1466.151,
    "text": "As depicted in this graphical model, we envision",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.367,
    "end": 1481.988,
    "text": " a system where a human and AI agent, each with partial observations, engage in bilateral message passing through language game or communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.009,
    "end": 1493.083,
    "text": "This interaction facilitates the formation and influence of a shared representation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.57,
    "end": 1500.54,
    "text": " And represented by the QSM, this is the kind of sign and shared latent variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.221,
    "end": 1508.832,
    "text": "And the XAI and XHUMAN, this means the AI's observations and the human's observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.359,
    "end": 1518.126,
    "text": "This is what we define as co-creative learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.899,
    "end": 1529.445,
    "text": " The key idea here is that instead of one agent simply teaching the other, the both mutually integrate their partial perceptual information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.127,
    "end": 1534.157,
    "text": "The display process enables the enabled",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.897,
    "end": 1549.197,
    "text": " by the mechanism like the MH energy, Metropolis-Hassings naming game, allows them to jointly construct a richer shared external representation that neither could achieve alone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.178,
    "end": 1560.432,
    "text": "This is a direct instantiation of the CPC hypothesis in a human AI triad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.238,
    "end": 1578.297,
    "text": " So more formally, to be precise, we formally define co-creative learning as an interactive, decentralized Bayesian inference process, as shown in definition one in our preprint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.778,
    "end": 1589.71,
    "text": "Through message-based update, like the Metropolis-Hessing naming game, jointly construct local belief distributions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.972,
    "end": 1602.383,
    "text": " The crucial aspect is that this process ensures the expected collective free energy, FT, decreases over interaction steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.704,
    "end": 1619.899,
    "text": "This means that the Markov chain formed by their interactions converges to the true posterior distribution conditioned on a joint observation of both AI and humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.318,
    "end": 1635.906,
    "text": " So what's remarkable about this mechanism is that it allows for improvement of Monte Carlo estimates of the evidence P .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.869,
    "end": 1644.942,
    "text": "Without requiring either agent to disclose their private observation or internal gradient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.411,
    "end": 1654.462,
    "text": " This decentralized nature is a key advantage in enabling robust and private knowledge co-construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.505,
    "end": 1668.6,
    "text": "With this formal definition in mind, our primary objective for this experiment was to empirically test this concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.656,
    "end": 1671.957,
    "text": " attention naming game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1672.097,
    "end": 1687.473,
    "text": "This is a kind of experiment with participants asking to play the MH naming game like naming game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1688.174,
    "end": 1694.841,
    "text": "So this game was played between human participant and the computer agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.142,
    "end": 1716.451,
    "text": " The central question we aim to answer was, can the human and the computer effectively integrate their respective partial observations through this naming game, thereby engage in the decentralized Bayesian inference, or as we term it, co-creative learning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.593,
    "end": 1722.82,
    "text": "To ensure this, each agent was given only a partial",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.087,
    "end": 1725.973,
    "text": " a missing subset of the full observational information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.294,
    "end": 1735.594,
    "text": "As you can see in this diagram, the human might have certain dimension of features",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.397,
    "end": 1741.907,
    "text": " and while the agent has others, and some are missing for each.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.688,
    "end": 1755.135,
    "text": "So this setup makes accurate categorization impossible based solely on individual information, thus necessitating information integration through communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.773,
    "end": 1767.41,
    "text": " We wanted to see if they could collaboratively fill in this missing piece and reach a shared understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.531,
    "end": 1773.238,
    "text": "So, let's detail our material methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.199,
    "end": 1777.444,
    "text": "The stimuli consisted on image,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.588,
    "end": 1782.638,
    "text": " images depicting a circle with a radial notch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.5,
    "end": 1794.488,
    "text": "So these were generated based on five-dimensional vectors sampled from one of three ground truth Gaussian distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.94,
    "end": 1800.909,
    "text": " and using the CIE lab color space, which is perceptually uniform.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.731,
    "end": 1812.287,
    "text": "So the parameters were chosen so that categories would overlap significantly in the partial observation space, like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1813.269,
    "end": 1822.163,
    "text": "Crucially, as shown in figure this part,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.143,
    "end": 1826.828,
    "text": " Humans and computer agents receive different partial observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.548,
    "end": 1836.197,
    "text": "Human participants view a grayscale rendering based on the original figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.099,
    "end": 1850.091,
    "text": "And the agent only can see the color.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.214,
    "end": 1852.975,
    "text": " color information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.976,
    "end": 1866.287,
    "text": "This partial observability makes accurate categorization impossible based solely on individual information, so making communication essential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.748,
    "end": 1878.578,
    "text": "So the dyad's task was to collaborate the categorized stimuli into up to three categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.219,
    "end": 1882.221,
    "text": "Yes, the ABC.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.201,
    "end": 1903.5,
    "text": " By playing the naming game, figure B illustrates experimental procedure flow involving initial categorization, initial categorization, and the naming game, turns and role switching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.987,
    "end": 1912.461,
    "text": " So this is actually a very difficult task for human participants, as you can imagine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.66,
    "end": 1915.784,
    "text": " OK, this is the process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.565,
    "end": 1924.615,
    "text": "The slides show a screenshot of the experimental interface used in our experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.576,
    "end": 1937.19,
    "text": "First, participants were asked to categorize the given images by dragging them into labeled boxes, as seen on the left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.791,
    "end": 1940.254,
    "text": "During the naming game, one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.061,
    "end": 1959.925,
    "text": " one image is presented on the right, and the naming agent proposes a name or sign for the image by clicking a button.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.945,
    "end": 1969.937,
    "text": "The listener then decides whether to accept the proposed name by clicking an accept or reject button.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.921,
    "end": 1975.706,
    "text": " Sorry, the instruction is in Japanese.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.248,
    "end": 1983.719,
    "text": "After this decision, the listener is prompted to revise their own categorization if needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.739,
    "end": 1997.562,
    "text": "This intuitive interface supports the partial observation and sign exchange between the human and computer agent, facilitating the interactive process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.191,
    "end": 2005.28,
    "text": " OK, so the experiment was conducted online by a web browser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.701,
    "end": 2010.55,
    "text": "We recruited 90 participants through CloudWorks, a crowdsourcing service.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.111,
    "end": 2022.672,
    "text": "And after filtering for engagement and adherence to instruction, 69 participants were included in our final analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.652,
    "end": 2037.201,
    "text": " The experiment typically lasted about 90 to 120 minutes with participants receiving compensation for their time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2038.683,
    "end": 2043.77,
    "text": " OK, so for Compison, participants were divided into three distinct groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.79,
    "end": 2053.143,
    "text": "So each interacting with computer agent, employing a different acceptance strategy for human proposal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.523,
    "end": 2068.183,
    "text": "Group 1, the MH group, the Metropolitan Hastings, engaged with an AI that accepted the proposals based on the Metropolitan Hastings acceptance probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2068.163,
    "end": 2072.311,
    "text": " serving as our primary co-creative learning condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.092,
    "end": 2087.64,
    "text": "Group 2, the always-accept group, interacted with an AI that always accepts proposals, acting as a proxy for traditional supervised learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.127,
    "end": 2092.495,
    "text": " The human's suggestion is always true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.515,
    "end": 2107.3,
    "text": "Finally, Group 3, the Always Reject Group, communicated with an AI that they always reject human proposals, mirroring an unsupervised learning scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.28,
    "end": 2113.912,
    "text": " So the AI just learns the form categories from their observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2114.634,
    "end": 2126.335,
    "text": "These conditions allow us to systematically evaluate the effectiveness of the MHNG in facilitating co-creative learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2127.125,
    "end": 2135.598,
    "text": " So let's look at the result for clustering accuracy measured by adjusted random index, ARI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.379,
    "end": 2146.534,
    "text": "Table 1 summarizes the initial and final mean ARI score for both human and computer agents across all groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.514,
    "end": 2158.845,
    "text": " A key finding is that participants in MH group achieve the highest categorization accuracy and sign agreement, particularly on the AI side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.206,
    "end": 2176.42,
    "text": "When compared to both the always accept and always reject group, specifically the computer agent in MH condition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.695,
    "end": 2184.625,
    "text": " achieved a significantly higher final mean ARI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2185.105,
    "end": 2200.23,
    "text": "This clearly indicates that the image-based interaction most effectively facilitated shared understanding between human and AI, engaging a more collaborative and accurate modeling of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.902,
    "end": 2222.353,
    "text": " While interacting generally helped the human improve, the image mechanism was uniquely effective for the AI agent to leverage the interaction for superior performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.325,
    "end": 2242.08,
    "text": " To visualize this trend, this figure, figure 3, plus the mean ARI over the 200 communication steps for both human and computer agent in the condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.803,
    "end": 2267.528,
    "text": " You can clearly observe that both the MH and AA always acceptance conditions show a general trend to increase ARI for both humans and computers, indicating successful information integration and learning from interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.993,
    "end": 2289.82,
    "text": " And in stark contrast, the AR condition, always reject condition, whereas the AI always reject proposal, show little to no improvement from the initial categorization accuracy, especially for the computer agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.154,
    "end": 2302.175,
    "text": " This graph vividly demonstrates the superior performance and learning trajectory achieved under the Metropolis-Hastings direction, particularly for the AI agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.281,
    "end": 2313.816,
    "text": "Beyond just categorization accuracy, we also evaluated the sign-posterior distribution convergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.218,
    "end": 2330.168,
    "text": " As highlighted in Table 1, the MH group achieves the highest convergence between the agent's final sign distribution and the target posterior distribution derived from the combined model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.907,
    "end": 2348.849,
    "text": " This indicates that the MH-based interaction most effectively guided the dyad towards the emergence of a shared informative sign system that truly reflects the integrated information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.291,
    "end": 2357.32,
    "text": "While human participants in the MH condition also show a high agreement,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.093,
    "end": 2365.386,
    "text": " the difference compared to the always accept condition was not statistically significant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.412,
    "end": 2393.01,
    "text": " However, the AI's performance in the MH group was significantly superior, demonstrating its ability to converge the interaction to align its understanding with humans, leading to a richer shared representation as indicated by the convergence toward the S-given X-AI and X-human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.8,
    "end": 2410.392,
    "text": " To summarize our discussion, our experiments clearly show that the human-AI pair can successfully engage in co-creative learning via the joint attention naming game, so under partial observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.76,
    "end": 2425.034,
    "text": " The Metropolis-Hassings acceptance rule significantly improved categorization accuracy and agreement that compare to both always accept and always reject control conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2426.275,
    "end": 2437.746,
    "text": "This is evident in the ARI graph and the sign agreement score we just discussed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.928,
    "end": 2453.659,
    "text": " Furthermore, a crucial finding was that human acceptance behavior aligned closely with the theoretically derived Metropolis-Hastings probability, as shown in Figure 4.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.175,
    "end": 2473.32,
    "text": " This reinforces the idea that the mechanism enhances perceptual integration and effectively facilitates decentralized Bayesian inference within human-AI diet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.34,
    "end": 2475.883,
    "text": "These findings collectively suggest",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.353,
    "end": 2501.972,
    "text": " a promising direction of designing truly symbiotic AI systems that run with humans by fostering emergent interaction-driven alignment, moving beyond the limitation of the traditional unilateral approach to AI development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.952,
    "end": 2509.95,
    "text": " While our findings are highly promising, we acknowledged several limitations in current studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.832,
    "end": 2518.729,
    "text": "We utilized actually simple, artificially generated visual stimuli and categorical signs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.709,
    "end": 2539.312,
    "text": " So this controlled setup was necessary for initial validation, I believe, but it naturally meets the generalizability of our findings to complex real-world tasks involving richer semantics and natural language, such as those handled by large luggage models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.053,
    "end": 2547.822,
    "text": "Additionally, our joint attention naming game, Paradigm, assumes the perfect joint attention between agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.802,
    "end": 2558.773,
    "text": " In real-world interactions, attentional alignment can fail, which is an important aspect for future research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.192,
    "end": 2562.817,
    "text": " Looking ahead, we identified several key future challenges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.939,
    "end": 2581.504,
    "text": "These include scaling to richer modality and semantics, robustness to imperfect attention, designing real-time co-adaptive systems, and understanding emergent dynamics in large-scale systems, and also ethical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.484,
    "end": 2586.037,
    "text": " And interpretability concern is also important, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.619,
    "end": 2596.708,
    "text": "And actually, to build a truly symbiotic human-AI society,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.688,
    "end": 2618.055,
    "text": " so how to how to integrate this kind of idea to the practical applications that is also important topic okay and that's all from my side i thank you very much for your attention and i look forward to further discussion okay thank you very much thank you for the talk awesome all right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.689,
    "end": 2625.76,
    "text": " I will ask a few questions that I wrote and I will copy them into the chat as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.82,
    "end": 2632.472,
    "text": "And for anyone in the live chat, please feel free to write questions and I'll copy them in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.754,
    "end": 2637.04,
    "text": "Alright, so first comment and question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.977,
    "end": 2652.902,
    "text": " The task focused on categorical discrete as well as quantitative aspects of situational semantics played via a language game related to sharing information about a shape in a shared world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.658,
    "end": 2659.087,
    "text": " What kinds of AI human tasks do you think this kind of algorithm could be used for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.028,
    "end": 2665.638,
    "text": "For example, do you see it in the domain of the text chat or a robotic setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.379,
    "end": 2679.801,
    "text": "Or just in other words, which application directions do you find promising or most able to demonstrate the differences and strengths of the framework compared with the unilateral supervised or unsupervised learning systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.317,
    "end": 2684.302,
    "text": " Thank you very much for great questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.683,
    "end": 2692.577,
    "text": "There are actually that I should ask, that I should add in our explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.757,
    "end": 2700.591,
    "text": "So actually, maybe this experiment itself looks very, how to say, simple and categorical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.571,
    "end": 2718.833,
    "text": " categorical sign formation and this but what i want to show in this talk and in this paper is the kind of the very the basic basic validation of this approach co-creative learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.813,
    "end": 2737.446,
    "text": " so and this kind of this graphical model and this setting is not limited to the categorical setting and also that you know the small number i i mean the simple visual image",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.426,
    "end": 2749.883,
    "text": " And actually, so as I mentioned, what I did is swapping the one agent in this kind of the language game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.318,
    "end": 2755.286,
    "text": " the swapping by a human participant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.047,
    "end": 2765.601,
    "text": "So actually, this kind of approach, collective predictive coding-based approach, is now extending to many domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.402,
    "end": 2770.909,
    "text": "So let me share the appendix slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.55,
    "end": 2777.98,
    "text": "So actually, this approach was extended to the multiple agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.96,
    "end": 2781.405,
    "text": " and also the multi-agent repostment learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.446,
    "end": 2789.156,
    "text": "And also, importantly, this is also another preprint we recently shared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.797,
    "end": 2794.924,
    "text": "So this approach can be extended to the more complex tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2795.625,
    "end": 2806.701,
    "text": "So this is, for example, this paper is dealing with the captioning game, not the naming game, captioning game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.681,
    "end": 2818.413,
    "text": " So between the two vision language model agents, one agent receives a natural image and describes it in natural language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.655,
    "end": 2823.038,
    "text": "So another agent receives the text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.599,
    "end": 2829.405,
    "text": "Text is just a vector, a sequence of categorical variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.146,
    "end": 2836.232,
    "text": "And that can be treated in our framework in a similar way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2836.212,
    "end": 2850.126,
    "text": " So actually, we showed that this kind of process improved, successfully integrated the two agents, the knowledge of the vision-language models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.706,
    "end": 2855.891,
    "text": "So I think we are now, many research is now ongoing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.352,
    "end": 2864.7,
    "text": "So I think that we can, I believe we can extend this idea to the large language model setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.68,
    "end": 2892.949,
    "text": " and also that we can uh say that now as you know currently in robotics field visual language action model vision language action model is gathering attention so maybe we can uh consider the how can we extend this idea to such kind of robotics scenario as well awesome um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2894.093,
    "end": 2899.693,
    "text": " Okay, next question, and then I'll read from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.714,
    "end": 2899.935,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.683,
    "end": 2920.109,
    "text": " How do you see this in terms of converging to a shared stable truth versus situations of novelty like co-creation of art or research, where there's not necessarily a pre-existing ground truth, even of a latent kind, to converge to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.149,
    "end": 2926.378,
    "text": "I'm thinking about situations where the agent models have overlapping information,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.358,
    "end": 2950.459,
    "text": " which is redundant though robust or non-overlapping information which is useful though fragile and then also information that maybe neither agent has so how do you adapt the situation to to tune whether you're looking to kind of find an existing compromise",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.743,
    "end": 2958.205,
    "text": " versus move into a third space that might be different than what either agent has or knows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.505,
    "end": 2964.589,
    "text": " Thank you very much for your great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.33,
    "end": 2974.606,
    "text": "And actually, that's very, very, very, very interesting topic and interesting discussion point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.347,
    "end": 2986.707,
    "text": "So actually, mathematically speaking, if they don't have the shared observation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2986.687,
    "end": 3008.29,
    "text": " the contain does not contains shared the information so it's very difficult to uh i i i expect that the it's very difficult to form the shared representations and reach agreement in some sense",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.27,
    "end": 3020.002,
    "text": " But I don't have the empirical evidence about that with some experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.062,
    "end": 3031.915,
    "text": "But I think that this is now a very important step to conduct constructive studies to analyze what kind of phenomena happens",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.895,
    "end": 3042.309,
    "text": " with this kind of basic mechanism of symbol emergence and formation of shared representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.95,
    "end": 3059.893,
    "text": "And also now, maybe this is somehow a bit outside of today's topic, but I think that this kind of scenario can be found in the democratic discussion in our society as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.873,
    "end": 3070.727,
    "text": " So I think that one of my students is working on the topic about the relationship between collective predictive coding and democracy and digital democracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.618,
    "end": 3093.795,
    "text": " so the if the two agents don't have the shared experience it's very difficult to have to reach or to reach agreement and also the you know the if they have a very different belief system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3093.775,
    "end": 3102.031,
    "text": " it will become very difficult to agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.312,
    "end": 3114.957,
    "text": "This kind of mechanism is somehow existing behind the curtain of the current social division.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.763,
    "end": 3132.358,
    "text": " I think that currently I'm very interested in the connection between this kind of computational research and the simple emergence of representation learning stuff and social science topics as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3133.119,
    "end": 3133.599,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.64,
    "end": 3137.162,
    "text": "Yes, that makes a lot of sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.302,
    "end": 3143.408,
    "text": "I guess just speculatively, if two agents are in a shared environment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.827,
    "end": 3158.058,
    "text": " with a simple optima to be reached or at least a gradient to be followed, at least there's a norm to which the gradient could be followed or local or global optima could be reached.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.599,
    "end": 3161.886,
    "text": "But if you have agents that are in two different environments,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.866,
    "end": 3183.385,
    "text": " you kind of lose even the possibility of a guarantee because if it's like if two people are in two different rooms with two different temperatures there's no guarantee they would converge to the same air conditioning but if they were in the same room with a shared air conditioning at least they could",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.74,
    "end": 3214.62,
    "text": " yeah okay yeah go ahead i think it's very interesting to think over the kind of how can we how uh should we in how can we improve the design of communication and how can we how uh should we uh consider the the environment the difference of environment uh to achieve the mutual and us to you know uh to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.988,
    "end": 3235.798,
    "text": " i'll say to understand the mutual understanding between two or more agents something like that i'm sorry yeah i'll read a question from the live chat if anyone else has a live chat question they should write it so Frederick Quintanar wrote",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.778,
    "end": 3254.361,
    "text": " in your model how do you approach the difference between the way silicon agents and humans model the concept level of words and context ai is opaque how can this be improved for interpretability okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.353,
    "end": 3255.995,
    "text": " Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3256.235,
    "end": 3258.08,
    "text": "That's also a very important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.942,
    "end": 3271.472,
    "text": "In our framework, the most important part of our framework is that we totally deal with a system, a kind of decentralized system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.756,
    "end": 3286.862,
    "text": " So in one of the most important part of this mechanism, each agent need not look into the internal phenomena of the counterpart agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.842,
    "end": 3304.935,
    "text": " so the even in the computer agent settings so what the agent do is just a kind of the utter the giving sign to speak something and listen and and determine the if it accepts or not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.152,
    "end": 3306.394,
    "text": " by itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.155,
    "end": 3319.17,
    "text": "So there is no need to look into the other agents' variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.55,
    "end": 3332.847,
    "text": "Actually, in the similar studies in emergent communication, many studies have said, ask",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.827,
    "end": 3355.358,
    "text": " agent to pass the kind of the gradient of the parameter through agents you know so across agents it's impossible for human but uh but uh in this setting uh we don't need to do that so actually that in this mechanism we just consider the counterpart agent as a black box",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3355.928,
    "end": 3377.852,
    "text": " So what we did in this framework is, in concrete planning, is just swapping the black box by human agent and just expect the human behavior follows the MH naming game-based mechanism, algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.052,
    "end": 3386.6,
    "text": " So actually, to validate that, we conducted this experiment previously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3387.161,
    "end": 3396.81,
    "text": "And we somehow found that in this kind of setting, humans actually follow the MH algorithm to some extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3397.371,
    "end": 3406.54,
    "text": "And also, in this experiment again, we checked the human behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.127,
    "end": 3431.785,
    "text": " is similar to the image algorithm and as a result that we can expect actually expect that the total the correct free energy can be decreased through this interaction that is a scenario and regarding the explainability there is a very hard say the difficult question and we need to consider",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.765,
    "end": 3448.373,
    "text": " In the series of studies of explainable AI, the definition of explainability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3448.353,
    "end": 3467.914,
    "text": " is how say very somehow uncertain you know the pleasure and actually the uh explain how to say uh even the in the current large language model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.894,
    "end": 3474.748,
    "text": " the explainability, I mean, what's happening inside of the neural network is a very challenging problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3474.768,
    "end": 3481.06,
    "text": "And I would say the human, I would say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.267,
    "end": 3491.837,
    "text": " I think that the similar problem can be found in this scenario as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3492.377,
    "end": 3506.153,
    "text": "But anyway, so when we introduce this kind of idea to our society, we assume that AI is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.133,
    "end": 3511.084,
    "text": " not just a follower of students, of human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.625,
    "end": 3517.678,
    "text": "So the human decision can be affected by AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.013,
    "end": 3531.814,
    "text": " So maybe, of course, we need to reconsider the issues and explainability based on such kind of assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3533.317,
    "end": 3540.087,
    "text": "Sorry, my answer is not perfect, but that's comment from my side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.71,
    "end": 3542.05,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.471,
    "end": 3543.733,
    "text": "OK, and one more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.063,
    "end": 3547.525,
    "text": " question I wrote in the comment in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.406,
    "end": 3557.536,
    "text": "So you mentioned different ways of communication amongst AI, human AI and human-human dyads and groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.316,
    "end": 3566.665,
    "text": "And I think the relevance of understanding and modeling and creating high integrity settings for these communications is clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.546,
    "end": 3571.83,
    "text": "So what might these communication strategies look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.81,
    "end": 3580.862,
    "text": " For example, let's assume that we can do real-time language translation between mother tongues like Japanese or English.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.844,
    "end": 3585.749,
    "text": "From there, what kinds of games might be possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.43,
    "end": 3592.839,
    "text": "For example, would that high bandwidth communication still look like, how are you doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.879,
    "end": 3595.202,
    "text": "What are you up to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.182,
    "end": 3609.561,
    "text": " Or could there be some structured communication games like captioning or joint classification which could engage shared attention in ways that were previously impossible and discover new global free energy optima?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3618.894,
    "end": 3621.898,
    "text": "Thank you very much for your questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3622.418,
    "end": 3647.7,
    "text": " and try to grasp the point we can do real-time language translation this is a mother tongue like from there what kind of game if everyone could speak and hear in the natural language that was most comfortable to them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3647.798,
    "end": 3655.57,
    "text": " what would be the semantics of the language games that would support high bandwidth communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3662.401,
    "end": 3671.055,
    "text": "you mean the... so what does the real-time language translation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.575,
    "end": 3695.305,
    "text": " means here so everyone can this this means that everyone can understand so what you can speak you can speak in japanese and hear what i'm saying in japanese and i'll hear what you say in english and i could speak in english so we're using some ai system to auto translate what we hear and say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.77,
    "end": 3714.508,
    "text": " in close to real time so that so we can have a natural conversation with our mother tongues so then i'm just kind of curious and and wondering whether then we would have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.488,
    "end": 3731.873,
    "text": " a sort of normal like on the street conversation or whether your work is providing some situations or structured games like kind of like language chess",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.393,
    "end": 3757.742,
    "text": " where we could play a game together like captioning or classification that could be used to reduce the free energy on a joint distribution in a way that would be like faster or different than just asking about your day or your friends or your family",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.789,
    "end": 3763.793,
    "text": " Thank you for your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.634,
    "end": 3770.865,
    "text": "I'm not sure if I got that point clearly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.886,
    "end": 3780.523,
    "text": "But basically, the image naming game, the naming game or captioning game, this is kind of a very, very small subset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.503,
    "end": 3798.242,
    "text": " or what the what's happening in our total language game the inner society so the the actually basically the our assumption is that our assumption or our idea is that uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.88,
    "end": 3817.463,
    "text": " the language the the formation of language or symbol emergence itself is a part of the adaptation to the environment and uh you know that's totally somehow same as uh collective uh predictive coding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.443,
    "end": 3820.188,
    "text": " and active influence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.735,
    "end": 3833.173,
    "text": "I don't have a clear answer to this question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3834.706,
    "end": 3850.504,
    "text": " know the we share some task we share some task or some environment if we are human that's task so maybe gradually the our way of communication uh gradually change and optimize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.484,
    "end": 3856.717,
    "text": " to the shared task or shared environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.398,
    "end": 3859.121,
    "text": "That's my idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.322,
    "end": 3872.408,
    "text": "And I don't know the connection with the real-time translation discussion point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.025,
    "end": 3875.308,
    "text": " Is it okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.328,
    "end": 3876.811,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.392,
    "end": 3883.044,
    "text": "I think it's a mystery for us and others to explore in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.104,
    "end": 3886.752,
    "text": "Like if we were fluent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.883,
    "end": 3916.89,
    "text": " in hearing and speaking to everybody what would we talk about like if we knew every language perfectly and we could communicate to to everyone and everyone could be included in the conversation would that conversation look like just meeting somebody at the bus stop or i think your work provides some structured settings where the information content of communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.87,
    "end": 3928.794,
    "text": " could be quantitatively analyzed and different contributions and proposals could be understood in terms of how they contribute to co-alignment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.459,
    "end": 3932.942,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.563,
    "end": 3933.804,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.205,
    "end": 3935.908,
    "text": "Last question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3937.188,
    "end": 3950.64,
    "text": " So what are your next research directions or questions and what milestones or developments from your group and colleagues or in the broader AI space are you looking out for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.708,
    "end": 3955.39,
    "text": " OK, thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.531,
    "end": 3972.551,
    "text": "In the relation with the development of AI system, so the one thing is that how can we integrate this idea into LLM, the agent systems, and VLM, and the vision language action model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.072,
    "end": 3982.163,
    "text": "And actually, basically, the CPC, the original idea",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.143,
    "end": 3985.788,
    "text": " is CPC and the simple emergent systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.409,
    "end": 3992.878,
    "text": "So I would like to jump out from this kind of agent viewpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.419,
    "end": 4002.852,
    "text": "But I think that this is crucial to consider how can we form the language system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.832,
    "end": 4023.675,
    "text": " or shared the brief system together with other agent i think it's crucial for human intelligence i think and cognition i think and uh the and from this viewpoint we can i think we can integrate the human and ai and robot to this system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.655,
    "end": 4045.444,
    "text": " so and that can bring us to the next step of ai human and ai symbiotic society so that is important point and the first one step is to the make the this kind of system work the with ai and robot i mean that you know i showed the vlm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.424,
    "end": 4072.326,
    "text": " the image captioning game system so actually that actually improve the performance of vlm and uh also that i can i think that llm that can can be uh say the you know the kind of the decentralized or much agent lm system can be uh reformulated from this viewpoint",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4072.306,
    "end": 4081.624,
    "text": " And also, we can put the human agent to such kind of ecosystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.958,
    "end": 4088.606,
    "text": " So of course, the human LLM interaction can take time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4089.307,
    "end": 4100.541,
    "text": "And through that process, LLM can learn from the human participants adaptively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.981,
    "end": 4109.772,
    "text": "But at the same time, inevitably, human agents can be affected by LLM's output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.646,
    "end": 4117.56,
    "text": " But in many discussions, this kind of phenomena is regarded as just a bias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4119.825,
    "end": 4123.873,
    "text": "Somehow, the bias tends to be considered a negative thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.015,
    "end": 4128.402,
    "text": "But such kind of bias",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.668,
    "end": 4134.535,
    "text": " it can be regarded as a kind of knowledge from AI agent as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.135,
    "end": 4153.596,
    "text": "So I think that one of the most important next step is to formalize this kind of interaction from the viewpoint of the collective free energy minimization and language, image-like language gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.576,
    "end": 4166.335,
    "text": " and produce qualitatively different human AI system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.815,
    "end": 4171.582,
    "text": "And that, hopefully, guarantees the co-creative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.404,
    "end": 4176.69,
    "text": "That is the most important step forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.71,
    "end": 4177.551,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.571,
    "end": 4178.132,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4180.171,
    "end": 4180.692,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4181.112,
    "end": 4183.355,
    "text": "A great way to end it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.837,
    "end": 4187.08,
    "text": "I really appreciated the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.921,
    "end": 4209.469,
    "text": "I think that the comparison of supervised or unsupervised learning makes it clear that both of the unilateral frameworks have fundamental limitations and that a co-creative path is a great joint distributional future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4214.917,
    "end": 4216.363,
    "text": " Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.383,
    "end": 4216.805,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.066,
    "end": 4217.367,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.93,
    "end": 4218.612,
    "text": "Till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.982,
    "end": 4221.906,
    "text": "See you.",
    "speaker": "SPEAKER_00"
  }
]