[
  {
    "start": 1.317,
    "end": 14.028,
    "text": " I'm ready Okay Hope that this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 15.41,
    "end": 19.214,
    "text": " is working well, and I guess this is where we can begin the conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 20.095,
    "end": 24.84,
    "text": "This is a Twitter Spaces on September 14th, 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 25.861,
    "end": 29.505,
    "text": "It is called Can Web 3 Survive Without Cognitive Modeling?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 30.166,
    "end": 36.953,
    "text": "And I know there's something they say about headlines that end in a question mark, something like always there are yes answers or no answers or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.772,
    "end": 46.955,
    "text": " In this conversation, we're going to be talking about Web3 and about cognitive modeling, and it will be less than an hour long.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.716,
    "end": 66.623,
    "text": "Hopefully, it will serve as a nice introduction to those who have little or some familiarity with Web3 and cognitive modeling, alone or together, but it's also meant to be kind of a broad-ranging discussion, and hopefully we'll have some other voices come up and add in some thoughts and questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.117,
    "end": 70.84,
    "text": " Let's start with just a description of Web3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 71.701,
    "end": 81.632,
    "text": "Surely elsewhere you'll be able to find audio and other kinds of content describing Web3, so I'll just describe what's relevant about it as we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.952,
    "end": 84.773,
    "text": " talk about cognitive modeling Web3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 85.613,
    "end": 93.517,
    "text": "Web3 is an ongoing movement that is applying blockchain and other distributed technologies to a wide ranging areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.517,
    "end": 105.322,
    "text": "And we can think of Web3 as creating critical infrastructure of the public goods type or not necessarily public goods in a wide range of areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 105.743,
    "end": 109.905,
    "text": "So in finance, there's decentralized finance or DeFi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 110.925,
    "end": 118.624,
    "text": " And DeFi requires the engineering of token schemes, which is sometimes called token engineering or tokenomics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 119.58,
    "end": 125.605,
    "text": " such that those token-based systems are able to be designed effectively and operate effectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.266,
    "end": 142.28,
    "text": "And there's a lot of other areas outside of the financial that are important for Web3, for example, community governance and meta-governance, like what people may have heard about DAOs, decentralized autonomous organizations, as well as all other kinds of organizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.18,
    "end": 145.482,
    "text": "And of particular interest for Web3,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.383,
    "end": 150.624,
    "text": " Our institute, and for many others, is decentralized science, or DSI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.425,
    "end": 167.49,
    "text": "And in many ways, DSI will succeed if it can have a balanced and coherent approach to tackle all the challenges that face the research and education stack, ranging from the who, what, why, where, when, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.065,
    "end": 184.249,
    "text": " Our question that we'll return to is how can any of these areas, finance, community, research, science, and education, how can any of these areas be successfully navigated or designed for without taking agents into account?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.129,
    "end": 196.612,
    "text": "So this is very related to agent-based modeling, and we're going to explore how there are several approaches to modeling these complex systems, and we're going to suggest that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.099,
    "end": 217.348,
    "text": " complementing top-down structural modeling of these systems there's a really important role for agentic or what we can consider cognitive modeling of the actors in these systems themselves and we believe that without this kind of like a bottom-up individual driven account taken conceptually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 218.462,
    "end": 241.19,
    "text": " into the design process but also more formally into the specification and evaluation of these critical infrastructure systems that there are going to be a lot of blind spots and a lot of failure modes that just simply will not be addressed by the structural analysis alone blue want to add on that or we can continue talking about this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 242.677,
    "end": 244.318,
    "text": " Yeah, so I can say a couple things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 244.498,
    "end": 259.766,
    "text": "So I think agent-based modeling is a super useful approach when you are getting into systems that are multi-agent that are maybe predictive of any kind of outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 260.386,
    "end": 262.547,
    "text": " So if this, then that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 262.607,
    "end": 268.11,
    "text": "How many agents does it take to defect for a system to fail?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 269.11,
    "end": 274.253,
    "text": "If everybody unloads their NFTs all at once, then the system collapses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 275.473,
    "end": 276.854,
    "text": "So it's these kinds of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 276.894,
    "end": 278.915,
    "text": "And what is the cognitive...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 280.595,
    "end": 285.877,
    "text": " underpinnings, what are the cognitive underpinnings of the decision making in an agent?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 286.097,
    "end": 291.519,
    "text": "Because everybody's influenced by a variety of factors, personal and environmental.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 291.64,
    "end": 305.745,
    "text": "So agents can start off with more of a different disposition than others, which is how we are in the real world, and can have different reactions to environmental cues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 306.685,
    "end": 308.666,
    "text": "And I think that that's all I'll say about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 310.799,
    "end": 311.279,
    "text": " Great point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 311.72,
    "end": 324.028,
    "text": "Agent-based modeling is really helpful for counterfactual analyses because we can ask, well, what would be different if we had this many instead of that many of this kind of entity or if they could do this instead of that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 325.649,
    "end": 333.615,
    "text": "Going back to the critical infrastructure and the need to design them reliably and also de-risk against a variety of failure modes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 334.639,
    "end": 344.223,
    "text": " Web3 has some failure modes and threat surfaces that are very similar to what is seen in Web2 and just other technological areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 344.683,
    "end": 354.307,
    "text": "And there's also some unique and partially modeled scenarios in Web3 relating to blockchain and distributed technologies specifically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.151,
    "end": 361.894,
    "text": " And a lot of the complexities come from the nested scales of decision-making and modeling that come into play in Web3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 362.414,
    "end": 379.562,
    "text": "So just speaking coarsely, there are decisions and discourse at the level of layer one chains themselves, like blockchains or among blockchains, as we're observing in this current day around the Ethereum changes that are happening, known as the merge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 380.404,
    "end": 394.752,
    "text": " But even within a layer one chain, there are multiple tokens and other kinds of entities on that chain and different communities that might be using the same or different tokens or their own tokens and teams and projects that might be on chain or off chain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 395.032,
    "end": 397.714,
    "text": "So there's a lot of interacting and nested layers of analysis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 398.234,
    "end": 409.02,
    "text": "So considering how different effects, greetings Jakob, how different effects of different actors percolate through that kind of a complex system is a key question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.855,
    "end": 417.139,
    "text": " And we can talk about a few different... Jakob, I'm going to make you invited to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 418.199,
    "end": 421.641,
    "text": "We can talk about a few different modeling paradigms and approaches",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 422.737,
    "end": 432.946,
    "text": " and talk about what is state of the art and used widely and wisely today, and then how cognitive modeling specifically might be complimentary and empowering those methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 433.746,
    "end": 445.516,
    "text": "So just speaking broadly, I'm going to mention smart contract auditing, and then top-down structural approaches, and then lastly, bottom-up agentic approaches, which is the cognitive modeling approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 446.397,
    "end": 449.399,
    "text": "So first, just speaking to smart contract auditing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.2,
    "end": 473.216,
    "text": " Smart contracts are familiar in financial areas and in kind of on-chain DeFi applications, although smart contracts also underlie technologies like DAO and DeSci and citations, identity, intellectual property, all kinds of aspects of society and culture may be occurring through broadly what are known as smart contracts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 474.096,
    "end": 477.159,
    "text": "And the computational details of smart contracts",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 477.839,
    "end": 483.14,
    "text": " can be audited along the lines of security audits for other kinds of computational programs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 483.62,
    "end": 493.143,
    "text": "For example, a Hacker Noon article describes that smart contract auditing identifies any errors in the code and ensures that the code is safe to use when transferring funds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 493.783,
    "end": 504.446,
    "text": "And so that kind of smart contract auditing is able to assess whether, for example, a given reservoir of funds can be extracted by an unauthorized user",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 507.014,
    "end": 511.777,
    "text": " That is absolutely valuable, and we're not suggesting that cognitive modeling replaces that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 513.157,
    "end": 522.683,
    "text": "We have two modes of systems modeling beyond simple smart contract auditing that are relevant, and that's the top-down structural modeling and the bottom-up modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 523.103,
    "end": 530.727,
    "text": "Perhaps, Jakob, you could describe top-down and bottom-up approaches to modeling here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 531.647,
    "end": 532.208,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 532.568,
    "end": 536.31,
    "text": "By the way, I'm on my phone right now because...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 536.943,
    "end": 543.686,
    "text": " I'm just walking in the middle of the city, so if the background noise is too loud, just let me know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 544.386,
    "end": 562.355,
    "text": "Yeah, so on the top-down versus bottom-up approach, I think the main, I guess, in classical CAD-CAD modeling, one of the main approaches is to identify the structure of the system that's being studied.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 562.395,
    "end": 565.096,
    "text": "In this case, it could be a decentralized system",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 565.779,
    "end": 571.264,
    "text": " protocol that enforces certain behaviors by smart contracts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 572.065,
    "end": 585.258,
    "text": "And then this kind of top-down structural modeling is parameter sweeps, where we try to identify all the different",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 586.105,
    "end": 609.695,
    "text": " um all all the different states that the system can reach and but that doesn't really tell us anything about what state the system will actually reach and how it performs from the perspective of its users so the bottom up cognitive sweeps but on the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 613.996,
    "end": 617.798,
    "text": " Okay, Jakob, your audience a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.779,
    "end": 623.902,
    "text": "More rigorous cognitive analysis from the perspective of the participants within that system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 626.103,
    "end": 635.749,
    "text": "So the idea behind active block friends is to kind of balance these two approaches and to take insights from both.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 637.25,
    "end": 639.211,
    "text": "I hope that provides a brief overview.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.307,
    "end": 641.128,
    "text": " Yep, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 641.148,
    "end": 644.732,
    "text": "I'll just kind of summarize that because there was a little bit of cutting in and out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 645.593,
    "end": 654.262,
    "text": "The top-down and the structural approach to modeling, which is commonly used in tokenomic suites like CAD-CAD that was mentioned by Jakob,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.515,
    "end": 664.06,
    "text": " It describes system states, like the yield return percentage on some kind of a smart contract and other system parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 664.821,
    "end": 669.404,
    "text": "And then it specifies the state spaces which those parameters can exist in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 669.724,
    "end": 673.826,
    "text": "And these tools also enable parameter sweeping across those system parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 674.307,
    "end": 681.271,
    "text": "And that's like a macroeconomic analysis that can be said to be taking like a population level analysis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.949,
    "end": 705.443,
    "text": " approach to modeling the behaviors of these complex systems so that would be equivalent to like modeling a macroeconomic sector with systems of equations and then exploring how those equations influence each other and in contrast there's a bottom-up agentic approach which entails a cognitive model of the agents because the cognitive model is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 706.303,
    "end": 729.15,
    "text": " which we're using in the active inference sense of the generative model that provides that agent with the ability to engage in perception cognition and action where cognition is describing various functionalities like memory preference and action selection anticipation and so on so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.841,
    "end": 746.655,
    "text": " We've been thinking about this angle of cognitive modeling in Web3 a lot because our project, Active Blockfronts, is an open source package that is explicitly addressing and trying to enable this kind of cognitive modeling in Web3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 748.636,
    "end": 757.384,
    "text": "And we're going to have a bunch of time to discuss aspects of where cognitive modeling could apply in Web3 and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.42,
    "end": 765.048,
    "text": " I'm gonna highlight three areas, but we'll discuss them one by one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 765.128,
    "end": 769.834,
    "text": "And also if anyone listening wants to join, they can absolutely feel welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 771.597,
    "end": 772.918,
    "text": "And there's gonna be three areas",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 774.514,
    "end": 776.495,
    "text": " or points of contact to explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 776.935,
    "end": 778.095,
    "text": "So this should be pretty fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.295,
    "end": 785.738,
    "text": "And Blue and Jakob, after each one of them, please feel free to share how you see it playing out or what you think is useful about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 786.018,
    "end": 792.04,
    "text": "So here's reason one for why we'll argue that Web3 needs cognitive modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.181,
    "end": 799.023,
    "text": "It is that we need to understand the consequences of single actions taken by single actors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.538,
    "end": 811.814,
    "text": " There are also singular events that happen at the system level that we might want to model, like rare or really important cascade-type events like a flippening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 812.779,
    "end": 818.683,
    "text": " And that might be able to be modeled or detected or designed around using top-down structural approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 819.203,
    "end": 830.911,
    "text": "Again, thinking about macroeconomics, one could imagine they have some dynamical equations describing different currencies, and then they could identify like a change point when one currency flipped another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.191,
    "end": 831.951,
    "text": "That's the flippening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 833.492,
    "end": 834.613,
    "text": "We're also interested...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.271,
    "end": 842.116,
    "text": " in the potentially cascading consequences of single actions by single actors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.736,
    "end": 856.505,
    "text": "So this one specific transaction that this one address sends to this one smart contract is possibly able to induce widespread consequences for the whole system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 857.266,
    "end": 864.35,
    "text": "And that level of atomic granularity in terms of which entity did which affordance, which action,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.311,
    "end": 883.837,
    "text": " towards which entity, and then understanding the consequences of that action at that granularity, it simply is inexpressible within the structural or top-down mode of modeling, which really can be said to abstract over individual entities and actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.457,
    "end": 891.2,
    "text": "So, we're not denying that the structural or the top-down can provide an immensely",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 892.0,
    "end": 897.382,
    "text": " coarse-grained, useful representation of systems during design and implementation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 898.143,
    "end": 908.667,
    "text": "But also, we, in this first point, argue that Web3 needs cognitive modeling because we do want to model and understand the consequences of single actions that single actors take.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.687,
    "end": 910.588,
    "text": "Blue or Jakob?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 915.57,
    "end": 917.13,
    "text": "Go ahead, Jakob, if you have anything there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 917.711,
    "end": 920.952,
    "text": "I will defect and wait until we talk about multi-agent systems, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 923.351,
    "end": 952.86,
    "text": " yeah i think uh i might add that also there's also a lot of um interesting overlap with um the work on computational psychiatry or other kind of psychology oriented uh models in the sense that these um by analyzing the cognitive states of agents",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 958.302,
    "end": 965.584,
    "text": " Things like what are their levels of curiosity within a system?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 965.824,
    "end": 977.889,
    "text": "Or is the distribution of beliefs more skewed towards higher levels of uncertainty?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 982.179,
    "end": 985.306,
    "text": " Okay, Jakob, your audio is just not too good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 988.122,
    "end": 993.085,
    "text": " Let me try to pick up with what you mentioned about computational psychiatry, though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 993.105,
    "end": 1010.053,
    "text": "So a top-down structural analysis of computational psychiatry might be able to say 10% of such and such group have this condition, and of them, then 1% go on to do this, and 1% of that goes on to be this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1010.613,
    "end": 1015.836,
    "text": "And so one could develop estimates like per thousand people with this characteristic,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1016.849,
    "end": 1022.111,
    "text": " we can expect these outcomes as a healthcare system or as an educational system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1023.326,
    "end": 1048.627,
    "text": " again the level of expressivity or granularity to describe measurements coming from a given individual like self-report or measurements made of their brain and their body these kinds of measurements just don't have a place in structural top-down modeling so it may be absolutely useful to take this macroeconomic structural top-down perspective to have population level descriptives",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1049.653,
    "end": 1075.779,
    "text": " However, the view from the inside, the bottom-up and the agentic perspective, and to incorporate the kinds of data and information which we have in the blockchain case, like individual addresses making transactions, we need to have agent-level modeling to be able to have that kind of a personalized clinical relationship, a personalized education relationship,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.667,
    "end": 1095.852,
    "text": " or making systems that account for what individual actors expect, prefer, and can do, rather than just designing systems only at the level of system state space parameters, and then expecting that somehow whatever it is that agents expect or prefer or can do will simply work within that framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1097.383,
    "end": 1111.633,
    "text": " Okay, so that was the first point about why Web3 needs cognitive modeling, because again, it's important to model and understand the consequences of single actions that single actors take, which might be extraordinarily rare or improbable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.594,
    "end": 1117.337,
    "text": "And so we won't be able to have useful top-down modeling of those kinds of actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.818,
    "end": 1119.939,
    "text": "Here's a second point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1121.26,
    "end": 1131.423,
    "text": " We believe that Web3 needs cognitive modeling because we want to consider the function of Web3 systems that are not simply quantitative or financial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1131.823,
    "end": 1140.805,
    "text": "For example, science, research, education, governance, all of these areas are not strictly about number crunching.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.545,
    "end": 1149.547,
    "text": "And so in these settings, knowledge and meaning, which are based around context, and we could even say that they're non-fungible,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1150.942,
    "end": 1177.192,
    "text": " knowledge and meaning making of epistemic entities will not be engaged with by top-down structural structural modeling or smart contract auditing because quite literally it is about the situated entity and their epistemic experience like the kinds of observations that they're making and how that's updating their generative model and then what that is helping them to do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1178.032,
    "end": 1194.904,
    "text": " So the way that that would get shoehorned into a structural model would be assume that some percentage of individuals are going to listen to this podcast, and then that makes some of them more likely to engage in this action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.425,
    "end": 1205.612,
    "text": "So that is, again, that view from the top, just like we explored in the computational psychiatry case, that view from the top or a probabilistic way to talk about the actions of groups",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1207.097,
    "end": 1210.639,
    "text": " And this is the complementary view, which is the view from the bottom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.179,
    "end": 1229.209,
    "text": "And this second point is just to say that especially if we're going to step beyond quantitative and financial analyses, that these kinds of knowledge and meaning making behavior of entities are just doubly inaccessible unless we have cognitive modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1229.689,
    "end": 1233.211,
    "text": "So to design appropriate systems for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1234.699,
    "end": 1254.598,
    "text": " science education governance we will need to have models of what individuals observe believe prefer and do rather than hoping that we can simply specify the state space that the system can exist in and then let individuals run within that framework",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.308,
    "end": 1258.949,
    "text": " So I'll follow up on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1259.589,
    "end": 1270.834,
    "text": "I think that, like, yes, for DeSci, but also systems like regenerative finance will require novel methods of accounting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1271.374,
    "end": 1278.738,
    "text": "And so this kind of cognitive modeling will enable, I think what Jakob was saying earlier that maybe Daniel haven't touched on yet, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1279.318,
    "end": 1280.86,
    "text": " this parameter sweeping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1281.861,
    "end": 1297.958,
    "text": "So when a person values something, whether it's carbon credits or epistemic knowledge, so when the value system differs from dollars and cents, these kinds of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1299.46,
    "end": 1304.481,
    "text": " Ultimate accounting systems are enabled or facilitated by this kind of cognitive modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1304.781,
    "end": 1307.842,
    "text": "Like, will these value systems and structures work for these people?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1308.302,
    "end": 1312.643,
    "text": "And, you know, multi-agent systems can have variable value systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1313.003,
    "end": 1320.045,
    "text": "So I think that these parameters will greatly help us to determine what kind of alternative accounting structures would work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1322.796,
    "end": 1336.653,
    "text": " Yes, and there's many ways, and it is by no means trivial, to incorporate these really rich and expressive things that we want to say about such systems into the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.154,
    "end": 1341.839,
    "text": "For example, even just in the example that Blue brought up with regenerative finance,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1342.85,
    "end": 1353.599,
    "text": " to describe how different individuals are making different decisions that might be a function of differences in their capacities, so their affordances, their capacities for action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.18,
    "end": 1359.765,
    "text": "It might also reflect different attention or different beliefs about the consequences of different actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1360.365,
    "end": 1365.83,
    "text": "And so there are vast combinations of cognitive models to explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1366.33,
    "end": 1370.194,
    "text": "And for that reason, being able to do parameter sweeps across them",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1370.774,
    "end": 1375.156,
    "text": " which is what CAD-CAD, the package, enables, is really valuable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1375.676,
    "end": 1396.663,
    "text": "And that's why Active Blockference is implementing active inference models in CAD-CAD, because it provides a useful and professional way to do some of these functions that are just not part of cognitive models in a narrow sense, like being able to do parameter sweeps, being able to specify the execution order.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.466,
    "end": 1406.651,
    "text": " But that's a bit more on the technical side of active block friends, which definitely we encourage people to learn more and get involved with and help with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1407.772,
    "end": 1409.533,
    "text": "I'll just go to this third.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1409.993,
    "end": 1410.413,
    "text": "Yes, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1412.535,
    "end": 1412.795,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1412.815,
    "end": 1415.997,
    "text": "Yeah, if I could just quickly follow up on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1420.606,
    "end": 1426.095,
    "text": " On the notion of parameter sweeps, I think they also serve two kinds of functions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1426.576,
    "end": 1431.203,
    "text": "On the one hand, it's for predictive purposes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1433.877,
    "end": 1444.222,
    "text": " designing models of different organizational systems and running multiple simulations to evaluate the different consequences of that system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1445.463,
    "end": 1457.889,
    "text": "On the other hand, it can also serve an explanatory purpose whereby we want to evaluate the state of an already existing system given data on the blockchain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1458.17,
    "end": 1460.371,
    "text": "So what active...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1461.418,
    "end": 1486.651,
    "text": " what the formalism of active inference allows us to do is to take data from the blockchain on the different actions that different agents take or actors within the system take and then do a parameter sweep over their beliefs to identify which set of beliefs make their actions base optimal and once we identify that set of beliefs we can do further analysis",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1487.563,
    "end": 1501.832,
    "text": " on what that means from a cognitive sense in what would that mean in different scenarios and do this kind of more, this retrospective analysis of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1502.252,
    "end": 1514.199,
    "text": "And one more thing on the voting mechanisms, just to give an example, I think there's an increasing, or it is increasingly mentioned that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1517.025,
    "end": 1524.928,
    "text": " quadratic voting is a more optimal paradigm for voting and governance in general.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1525.588,
    "end": 1529.729,
    "text": "But why is it quadratic?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1529.869,
    "end": 1535.171,
    "text": "Why isn't there a third exponent or fourth exponent?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1535.871,
    "end": 1543.514,
    "text": "And these kinds of questions, I think, can be answered through cognitive modeling, where we can evaluate the trade-off between",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1544.967,
    "end": 1558.461,
    "text": " higher mathematical complexity where the operation itself at more cognitive constraint and the actual results when the agents act within that voting system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1559.222,
    "end": 1566.95,
    "text": "So just wanted to give this example of how it can be used in a purely non-monetary governance type setting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1568.573,
    "end": 1592.492,
    "text": " nice points you laid out a lot of the kind of modeling pipeline which is that the blockchains themselves actually already contain the exact kind of agent level empirical data that we want and it's even structured in the way that we want to take it in which is like which entity which address did what and then what was the consequence of the action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1593.132,
    "end": 1601.02,
    "text": " So indeed, that information is already on chain and summarized in a way that's amenable to fitting cognitive parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.541,
    "end": 1607.027,
    "text": "So the question of how to determine which cognitive models are relevant is it's indeed a challenge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1607.748,
    "end": 1615.035,
    "text": "But at the same time, the data that is input is of the right type to fit various cognitive models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1615.856,
    "end": 1616.656,
    "text": " that could be useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.177,
    "end": 1626.502,
    "text": "For example, some hidden state that describes how much attention somebody is paying to a given governance system overall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1627.042,
    "end": 1631.905,
    "text": "And then also being able to subspecify at a given time or changing through time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1632.565,
    "end": 1635.048,
    "text": " their preferences on a variety of topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1635.689,
    "end": 1645.62,
    "text": "And that's exactly what allows the counterfactual analysis or exploring like alternate futures, because we could ask, well, what if people were paying more attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1646.08,
    "end": 1649.184,
    "text": "Is that an important area to go or should it be, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1651.129,
    "end": 1656.633,
    "text": " explored to modify not the attention being paid to this issue, but rather how much they know about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.953,
    "end": 1659.215,
    "text": "So nice point there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1659.715,
    "end": 1677.448,
    "text": "So for financial and for non-financial systems where entity level knowledge and meaning making is relevant, which it arguably always is, that is an important opening for cognitive modeling and this view from the inside to compliment the top-down structural modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1678.228,
    "end": 1678.428,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1680.492,
    "end": 1688.678,
    "text": " I'm going to just mention the third of the points, and then in the rest of the hour, we can hear some different questions, different thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1688.718,
    "end": 1691.099,
    "text": "So anyone who wants to speak, thanks for requesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.96,
    "end": 1702.808,
    "text": "And the third point is that we argue that cognitive modeling can complement traditional computational security analyses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.328,
    "end": 1706.69,
    "text": "So that was like static and dynamic analysis of smart contracts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1707.531,
    "end": 1710.013,
    "text": "And those kinds of analyses can be complemented",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1710.762,
    "end": 1731.551,
    "text": " by exploring in a test net or in a sandbox setting what happens when that smart contract is deployed in realistic settings, which is to say interacting with other contracts and interacting with individuals who might differ in their capacities, preferences, expectations, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.471,
    "end": 1736.373,
    "text": "So just to kind of give an example that seems relevant here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1737.705,
    "end": 1751.292,
    "text": " Smart contract analysis could determine if there was a contract which was supposed to hold funds securely and only be able to take in one or two kinds of tokens like a vending machine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1751.513,
    "end": 1757.116,
    "text": "You can put dollars in and then soda comes out or you put soda in and dollars comes out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1757.496,
    "end": 1761.158,
    "text": "So potentially like a liquidity pool based swap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1762.202,
    "end": 1774.251,
    "text": " Now, standalone analysis of that smart contract could absolutely tell you whether it was possible for somebody who shouldn't be able to access those funds was able to access those funds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1775.816,
    "end": 1789.967,
    "text": " There are also failure modes and risks associated with that smart contract in operation that can't be said to be within the smart contract, rather they're in the relationship of that smart contract with others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.548,
    "end": 1799.235,
    "text": "For example, other contracts or exchanges that are handling that token might be engaged in arbitrage relationships.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1800.143,
    "end": 1815.493,
    "text": " Once we think about social media and information sharing that happens off-chain, there might even be narrative or news-based events, which make it so that that smart contract's ability to hold the funds is great and enabling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.853,
    "end": 1822.538,
    "text": "However, still in the realized application of the contract, it is functionally getting rugged as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1823.178,
    "end": 1826.801,
    "text": "And so these are all areas that we want to explore more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1827.501,
    "end": 1846.7,
    "text": " with the active block friends package as we kind of build in these modules to consider it and do case study analysis but that is just to close this section of the discussion as we now open up to more broader discussion and just to restate that three of the key areas we think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1847.501,
    "end": 1851.084,
    "text": " Cognitive modeling can play a role in Web3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.724,
    "end": 1855.907,
    "text": "Our first understanding the consequences of single actions by single actors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1856.628,
    "end": 1865.394,
    "text": "Second, by expanding the scope of Web3 systems that we consider and design for to be systems that aren't simply quantitative and financial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1865.814,
    "end": 1868.676,
    "text": "So considering research, education, governance, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1869.477,
    "end": 1886.67,
    "text": " And then lastly, complementing computational security analyses with emulations and simulations, scenarios, and counterfactuals of how different aspects of cyber-physical systems might play out in specific testable settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1887.771,
    "end": 1897.679,
    "text": "So thanks for making it along this far, and now we can just talk about whatever people would like to go towards, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1899.622,
    "end": 1928.107,
    "text": " thank you so one of the things that's on my mind is that this is maybe abstracting away um an important layer that we're not really speaking about whether we're doing bottom-up modeling or top-down and that is you know that there are miso or middle level structures that are relevant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.313,
    "end": 1944.083,
    "text": " to cognitive modeling in terms of communities, cultures, organizations, and they have an influence on the mental model that a person has.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.284,
    "end": 1956.592,
    "text": "Very explicitly, by just talking about a wallet, a wallet might belong to an individual or it might belong to an entity, but their behaviors will tend",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.555,
    "end": 1984.899,
    "text": " to be different might not even know perhaps whether it is an individual or some other sort of entity that's behind a wallet but i think it gets more tricky to think about well you know what is the environment in which that entity that has the wallet exists in like what culture what regulatory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.695,
    "end": 2009.029,
    "text": " regime like what communities are they part of and I don't necessarily know how that should be done but it seems like that is an important part of the context that influences the model that any agent has in choosing whatever transactions they make with their wallet and so maybe we have to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.331,
    "end": 2015.272,
    "text": " THINK ABOUT HOW TO ADDRESS THAT OR IF YOU HAVE THOUGHTS ABOUT HOW THAT SHOULD WORK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.332,
    "end": 2015.692,
    "text": "THEY HAVEN'T.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.712,
    "end": 2024.194,
    "text": "NEW SPEAKER THANK YOU, RAY, FOR THIS COMMENT ABOUT THE MISO SCALE.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.754,
    "end": 2026.975,
    "text": "I THINK THERE'S A FEW POINTS TO ADD ON THAT.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2029.015,
    "end": 2031.636,
    "text": "STRUCTURAL SPECIFICATIONS OF SYSTEMS",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.816,
    "end": 2046.468,
    "text": " They identify really important system-level parameters, but then it can often be challenging to add in other parameters because the models are composable only with macro aspects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2047.168,
    "end": 2054.795,
    "text": "So it becomes hard to compose models that are taking a purely top-down as well as a purely bottom-up angle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.158,
    "end": 2067.087,
    "text": " Where cognitive modeling might help us explore that middle is that it makes a specific distinction between observed and unobserved aspects of systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2067.568,
    "end": 2069.77,
    "text": "So hidden states are unobserved states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2070.575,
    "end": 2076.098,
    "text": " The observed behavior in a blockchain setting are like the transactions that happen on chain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.698,
    "end": 2085.583,
    "text": "And then you're right that there's so much context that is unobserved in that one data artifact that would be relevant to know about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2086.023,
    "end": 2090.746,
    "text": "And so we can think about two cases where this context is either used or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.587,
    "end": 2095.569,
    "text": "The first case is where we actually have no other context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2096.536,
    "end": 2103.187,
    "text": " In that situation, we can still do intentional stance modeling towards unknown types of actors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2103.588,
    "end": 2109.257,
    "text": "Like we don't know what is behind this address, but we know that they engage with this kind of a pattern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.732,
    "end": 2126.623,
    "text": " And it's not enough just to take a top-down perspective and say, well, this many people interacted with this contract, or the average was two times per day, because that two times per day might be the average of a small fraction that interact 100 times per day and some that interact infrequently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2126.943,
    "end": 2134.107,
    "text": "So cognitive modeling first would help us take an intentional and a strategic stance in the absence of context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2134.768,
    "end": 2138.69,
    "text": "And then context, as we add it in,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2139.778,
    "end": 2140.759,
    "text": " can become useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2141.139,
    "end": 2146.283,
    "text": "So we might know that multiple addresses are under the control of a given team or individual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2146.943,
    "end": 2159.172,
    "text": "Or we might have access to connecting the social media profile of somebody who puts it in their ENS profile or page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2160.233,
    "end": 2164.716,
    "text": "That could be composable at the agent level and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2166.038,
    "end": 2176.76,
    "text": " I don't think that's an answer at all, so open to whatever else people add, because the miso is where the complexity is, and we would just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.89,
    "end": 2197.082,
    "text": " expect and prefer that the composability of specifying different kinds of entities, not just on chain entities, but also teams, organizations, and so on, that that will enable these kinds of models to do exploration and parameter sweeps in that exact space you described.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2200.985,
    "end": 2201.305,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.106,
    "end": 2226.518,
    "text": " I would maybe also add to that, that as the toolbox itself gets expanded and different computational models are added, I think it's the case where we want to distinguish between an actor that's actually",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2227.543,
    "end": 2239.549,
    "text": " a single human versus a team of people controlling a multisig should technically be reflected in the underlying data to some extent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2240.109,
    "end": 2255.596,
    "text": "Say if, for instance, you want to use cognitive modeling to analyze a certain DAO and you have a list of all the different addresses, as you perform this kind of multi-agent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2256.678,
    "end": 2281.774,
    "text": " model or even try to fit the belief states of each of the wallets given the prior data, it should become evident that certain wallets perhaps are operating at slightly different timescales or are updating their beliefs at",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2284.7,
    "end": 2288.242,
    "text": " again, at different time scales or in a slightly different way than the other agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2288.703,
    "end": 2306.212,
    "text": "And then we might also do some cross-correlation between the belief states of the individual actors about which we perhaps know that they are individual actors and the agents that we are not sure whether they represent a single entity or a group of people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2307.792,
    "end": 2309.813,
    "text": "So I think that...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2311.098,
    "end": 2336.922,
    "text": " A lot of it might already implicitly be available within the current toolbox, but as we add more algorithms that do more efficient computations and different schemes of performing belief updates and belief search, I think that's a very interesting area to explore as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2339.303,
    "end": 2339.923,
    "text": "Thanks, Jakob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.283,
    "end": 2340.483,
    "text": "Brock?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2341.277,
    "end": 2342.317,
    "text": " You want to add anything?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2344.498,
    "end": 2366.204,
    "text": "Yeah, I think Jakob's point here about having some verified data sources and having these kinds of generalities about how one kind of data source looks like for one kind of agent versus another kind, more of an organization or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.099,
    "end": 2374.921,
    "text": " a syndicate or some other kind of non-singular individual is correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.702,
    "end": 2384.624,
    "text": "And I think that this idea of the mesoscale being missed, generally speaking, in modeling is also correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.784,
    "end": 2395.387,
    "text": "And I think that cognitive modeling in general affords partially, I guess, a solution to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.414,
    "end": 2405.657,
    "text": " really this mezzo, both of these problems are really related to like the Oracle problem of just where does data come from and who do you trust and all this sort of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.817,
    "end": 2420.101,
    "text": "Um, because even if you get this culture data, it's like, you know, what's, what's in the water, what's in the food, what's this business doing with, you know, what are the externalities of this process or whatever?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.121,
    "end": 2425.363,
    "text": "You know, there's a lot of still unknown data and the only way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.724,
    "end": 2450.484,
    "text": " that we currently have to kind of model that effectively is with essentially a cognitive sort of model that, like you mentioned, Daniel, has this distinction between observed and unobserved or hidden states and known states to the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.222,
    "end": 2465.087,
    "text": " Um, it's never, I guess to frame it, it's, it's like security is this cat and mouse game really we're in this now in this cognitive security cat and mouse game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.127,
    "end": 2480.554,
    "text": "And we're just going to go further into that, but you know, is a large corporation or whatever, some, some syndicate, whatever, trying to maybe obscure their, you know, um, behavior on chain, like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.56,
    "end": 2486.563,
    "text": " so that they're harder to predict for some reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.325,
    "end": 2494.249,
    "text": "Probably things like that will, they already occur in the political context today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.75,
    "end": 2499.213,
    "text": "I'm sure that it will continue and decentralize in that fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.393,
    "end": 2511.683,
    "text": "And so it will just be a baseline, it'll just be table stakes to do cognitive modeling to have any kind of grip",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.507,
    "end": 2518.63,
    "text": " on something like prediction or discernibility of these kinds of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.532,
    "end": 2522.792,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.852,
    "end": 2525.073,
    "text": "Very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.854,
    "end": 2532.977,
    "text": "So in the last 10 minutes, we can have any speakers join or people can ask questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2534.298,
    "end": 2539.781,
    "text": "This is happening during the ongoing Gitcoin funding round, GR15.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2541.244,
    "end": 2553.647,
    "text": " And we have a grant in for this project, which is supportable, as well as many other awesome public goods and projects that people can check out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2553.667,
    "end": 2568.87,
    "text": "And on the grant page, you'll see some recent discussions we've had with CADCAD community and with the Smart Contract Research Forum, where we talked about a few different ongoing steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2569.75,
    "end": 2592.185,
    "text": " The current status of the package is that it's available, it's an open source package, and it is framed as notebooks, primarily made by Jakob, that are like the perception, cognition, and action of an entity in an abstract grid space, which sounds and basically is general and abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2592.705,
    "end": 2598.91,
    "text": "So some of our next steps are to bring that machinery and that approach to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2599.95,
    "end": 2604.113,
    "text": " take in the kinds of empirical data that are relevant for blockchain systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2604.773,
    "end": 2629.29,
    "text": "So that's one key area, as well as improving the functionality of the package through various means like improved ability to visualize outcomes of models, to specify models and sweep across them, to have documentation and other integrations that will just make it a better package and more useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2633.151,
    "end": 2638.613,
    "text": " I guess in the last 10 minutes, there's a few other ways to go, but I'll pause if anyone has any thoughts or questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2646.756,
    "end": 2651.338,
    "text": "The point I wanted to add in, and then again, anyone can feel free to add, is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2653.769,
    "end": 2667.239,
    "text": " Using active inference as a scale-free or scale-friendly framework, as we sometimes say, an advantage of it is that we can talk about perception, cognition, and action for different entities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2667.84,
    "end": 2673.064,
    "text": "This is not creating a little brain for individuals only, people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2673.704,
    "end": 2681.99,
    "text": "This is about being able to look at how decisions are enacted in different kinds of organizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2682.851,
    "end": 2698.133,
    "text": " And those organizations could be cellular biological organizations like humans, or it could be organizations that you suspect something complex is happening within, but you're only seeing the tip of the iceberg on-chain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2698.974,
    "end": 2702.076,
    "text": " Or it could be organizations that are entirely on-chain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.736,
    "end": 2717.243,
    "text": "And so that's one of the reasons why it's important to have a really flexible modeling framework like Active Inference for cognitive systems, because it's not bound to, for example, only human emotions and sensory processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2717.763,
    "end": 2722.726,
    "text": "It enables us to describe a wide variety of systems in a cognitive fashion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.306,
    "end": 2728.832,
    "text": " which is what we've explored in our EOS work, Active Entity Ontology for Science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2729.918,
    "end": 2738.94,
    "text": " So that is where we see active inference as a leading cognitive modeling framework and natural fit for this cyber-physical space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.72,
    "end": 2748.202,
    "text": "And then the other pillar of the active block inference project other than active inference is CAD-CAD, which was mentioned earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2748.823,
    "end": 2755.784,
    "text": "And CAD-CAD has been used in a wide range of token modeling and engineering settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2756.464,
    "end": 2758.025,
    "text": "You can see actually there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.005,
    "end": 2779.703,
    "text": " ethereum validator models which have been publicly available for uh several years i don't know the exact date but the um work on cad cad modeling of the f proof of stake transition has been in the works for a really long time and that kind of gives a a taste of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.834,
    "end": 2798.102,
    "text": " From the outside, speaking personally, of what it looks like to use formal system models over long timescales to strategize and de-risk really complex decisions that groups and individuals make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2799.458,
    "end": 2802.44,
    "text": " And that is still at the structural level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2803.161,
    "end": 2816.151,
    "text": "So it's one thing to be able to scan across different validator reward systems or percentages and ask what would happen if a certain parameter is set to three or two or one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2817.054,
    "end": 2824.82,
    "text": " Again, it's quite a different thing to ask how entities with different attentions and preferences will make certain decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2825.581,
    "end": 2829.704,
    "text": "And so it'd be like the equivalent of a macroeconomic change being induced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2830.064,
    "end": 2831.946,
    "text": "Like we raised the interest rate by 1%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2832.066,
    "end": 2840.192,
    "text": "Our macroeconomic curve intersection models show that that should increase consumer spending by this much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2841.073,
    "end": 2846.217,
    "text": "But that consumer spending, even if it is an accurate prediction from the structural modeling,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2847.057,
    "end": 2865.618,
    "text": " it is enacted by individuals making decisions in response to those common system parameters so that highlights that the agentic perspective is complementary to the systems and the structural description but we really think that it's going to bring a level of depth",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2866.659,
    "end": 2873.445,
    "text": " And also new challenges, because the state space of all cognitive parameters and how they interact is truly vast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.145,
    "end": 2886.216,
    "text": "So it will not be necessarily the shortest or simplest road, but we think it's going to be one of the most meaningful because it's going to bring new function to life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.699,
    "end": 2895.085,
    "text": " different Web3 ecosystems and subsystems that otherwise would have totally incommensurate models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2895.826,
    "end": 2903.132,
    "text": "The DeFi models are not going to apply to DAO decision-making, and those are not going to apply to science and how that works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2903.813,
    "end": 2911.46,
    "text": "And having some kind of an interoperable layer for what entities are doing what is going to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.836,
    "end": 2915.799,
    "text": " enabling really rich modeling of Web3 ecosystems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2916.7,
    "end": 2919.482,
    "text": "Now, can Web3 survive without cognitive modeling?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2921.084,
    "end": 2921.464,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2921.904,
    "end": 2922.385,
    "text": "We could vote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2924.639,
    "end": 2928.242,
    "text": " But we provocatively raised the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.262,
    "end": 2946.716,
    "text": "I think Jakob and Brock and others in some meetings with this framing, because we do want to suggest or at least raise this notion that no amount of top level systems engineering",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2948.021,
    "end": 2958.326,
    "text": " unless it's complemented by a bottom-up perspective on what are the capacities, attentions, preferences, and so on of entities in this world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2959.047,
    "end": 2974.275,
    "text": "The embodied natural ones, as well as computational artifacts, a runaway decision-making AI with a trading balance, all these kinds of systems that we have to model, including systems that we don't even know what type they are necessarily,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2975.236,
    "end": 2980.06,
    "text": " We need interoperable and expressive ways to describe those systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2980.64,
    "end": 2987.966,
    "text": "So that's why we think that Web3 with cognitive modeling can survive and without, we just don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2992.51,
    "end": 2993.591,
    "text": "I have another question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.631,
    "end": 3001.037,
    "text": "I think it relates fundamentally to potential biases in a model given",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.225,
    "end": 3003.366,
    "text": " data availability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3003.926,
    "end": 3018.994,
    "text": "So it's very clear always what data is available, like what transactions are on chain or what prices are paid in market for securities or commodity or what have you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.054,
    "end": 3029.219,
    "text": "But there is actually a lot that occurs in society, which is not necessarily a market type",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3030.382,
    "end": 3034.343,
    "text": " activity with hard data associated with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.063,
    "end": 3057.387,
    "text": "And how does a cognitive model account for the fact that many things are missed and that we simply overlook many aspects of things that, for instance, might be called the gift economy, where people just informally do things for each other and it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.388,
    "end": 3060.769,
    "text": " not really recorded anywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.969,
    "end": 3067.472,
    "text": "I mean, it is truly part of the representation of our individual cognitive models for how we exist in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.532,
    "end": 3072.534,
    "text": "But where is this going to make it into any model that we try to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.935,
    "end": 3075.335,
    "text": "It's great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.089,
    "end": 3081.453,
    "text": " question, and it's a thread I hope we keep alive even beyond this space ending in a few minutes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3081.493,
    "end": 3084.495,
    "text": "So no answer will do it justice, but I'll give some thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3085.275,
    "end": 3101.987,
    "text": "One is the difference between observables in our model, empirical data that we're reading in, and unobservables, which are considered factors, but not necessarily ones where we have data points, either because we just haven't added those data points in or maybe they don't even exist in principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3102.327,
    "end": 3105.469,
    "text": "So various kinds of features can be observed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3106.109,
    "end": 3107.01,
    "text": " and various can't be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3107.61,
    "end": 3109.792,
    "text": "So it's important to have a framework that deals with both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3110.372,
    "end": 3119.479,
    "text": "And then the second point is that it may be possible for some kind of like out in the open models to use some kinds of totally out in the open data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3120.0,
    "end": 3127.806,
    "text": "But then let's just say that within the context of a given community of care, people consented to having their information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3129.431,
    "end": 3135.296,
    "text": " digested or summarized, and used to augment a community-specific model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3135.976,
    "end": 3158.675,
    "text": "So the provenance and the use of that data that would be potentially speaking to these more authentic, inorganic social interactions, those kinds of data could be grafted or fused with more open-source templates dealing with open data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3159.574,
    "end": 3175.979,
    "text": " So there'd be a lot of opportunity for model templates and some pre-computed public goods type data sets to then be enriched on the edges by different communities that were going to be bringing in specific data types.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3178.579,
    "end": 3188.342,
    "text": "And the path has been in a way blazed forward by CAD-CAD where the package is open source and many of their models are open source yet",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3189.4,
    "end": 3200.269,
    "text": " They're also able to engage with clients in a consulting capacity using models that are not fully open source, probably, or data sets that aren't fully available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3201.149,
    "end": 3215.941,
    "text": "So it's one reason why we are strongly open source with the package, while also recognizing that a lot of the last mile use cases might bring in data that isn't strictly open source in the same way that this code should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.203,
    "end": 3221.503,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3222.284,
    "end": 3224.306,
    "text": "Well, thanks for listening, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.187,
    "end": 3233.617,
    "text": "Please head over to, I guess, our Twitter profile to learn more about our ongoing Gitcoin grant.",
    "speaker": "SPEAKER_02"
  }
]