[
  {
    "start": 10.24,
    "end": 38.273,
    "text": " hello and welcome it is august 12 2024 and we are in active math stream number 11.1 111111 and with repeat friend toby smythe today we're going to talk about structured active inference there will be a presentation followed by a discussion so thank you toby for joining and everybody for watching and asking questions and looking forward to learning more here so go for it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.692,
    "end": 38.992,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.032,
    "end": 39.313,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.333,
    "end": 39.894,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.914,
    "end": 40.855,
    "text": "Thanks for having me on again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.075,
    "end": 51.27,
    "text": "As Daniel says, this is going to be a talk about structured active inference, which is really my account of the structure of active inference systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.71,
    "end": 63.867,
    "text": "And really, it kind of extends beyond active inference to any kind of system that you could think of as being kind of agential and that has some kind of compositional structure in particular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.927,
    "end": 65.95,
    "text": "But we'll get to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.03,
    "end": 66.471,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.451,
    "end": 73.322,
    "text": " um the way i like to begin thinking about structure and x inferences at the moment is it's kind of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.028,
    "end": 94.89,
    "text": " If you wanted to model in Active Inference an agent or a person getting onto a bicycle or getting into a car, then I think as things stand, it might be a bit tricky because that process involves changing the agent's Markov blanket, or how I like to think of it is changing the agent's interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.31,
    "end": 103.579,
    "text": "And to be able to talk about that precisely, you need to have a good notion of what interface is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.559,
    "end": 129.702,
    "text": " you know you as you're you know getting into the getting onto the bike let's say you move you change from you know walking by taking steps one after another to you know um like changing your direction by like leaning and pedaling so the kind of type of actions you can take and the things that you pay attention to change yes because you're now this kind of composite system you and the bicycle and it's a similar story when you get into the car",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.171,
    "end": 138.682,
    "text": " That really that means that you don't just have one set of observations and one set of actions you can take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.162,
    "end": 143.848,
    "text": "This kind of composing process means that you have to have a bit more flexibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.868,
    "end": 150.036,
    "text": "And in particular, you need to say precisely what those sets of observations and sets of actions should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.653,
    "end": 160.887,
    "text": " So the basic idea behind structured active inference is really just to put the ideas of active inference into categorical systems theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.448,
    "end": 169.24,
    "text": "And so categorical systems theory is just an account of how dynamical systems of very general kind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.22,
    "end": 183.398,
    "text": " um yeah are made up of parts and how those parts compose together and it separates out the notion of the system from the notion of its interface and so this allows us to be very precise about what is the kind of agent marker blanket and how does that change",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.002,
    "end": 192.714,
    "text": " So we inherited a number of features of categorical systems theory in this notion of structured active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.754,
    "end": 197.2,
    "text": "In particular, we inherit this kind of idea of structured interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.261,
    "end": 213.283,
    "text": "And that means not only do we have to be precise about what the interfaces are, but we also are able to say what the structure in some sense of the interface is and how does it change and how does it interact with other kinds of interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.192,
    "end": 216.743,
    "text": " I'll say a lot more about that in the next few slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 217.297,
    "end": 244.755,
    "text": " um because categorical systems theory is all about the composition of systems and their interfaces so is structured active inference and that means that we get a nice kind of modular account of active inference and we can compare active inference with other accounts of agency and we can compare active inference systems of various different kinds in a nice precise way and so that means we could sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.735,
    "end": 273.477,
    "text": " translate between continuous time and discrete time systems or various different kinds of continuous time or stochastic systems those are all different systems theories of their own and active inference has lots to say about how to do inference and policy selection on those different kinds of systems but categorical systems theory means that we're very precise about what what those different systems and how that inference process works",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.604,
    "end": 281.531,
    "text": " And so this kind of comparability is formalized by the notion of morphism of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.671,
    "end": 286.555,
    "text": "So these morphisms, they come into two kinds in systems theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.595,
    "end": 288.157,
    "text": "We get morphisms of interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.138,
    "end": 295.123,
    "text": "Those are the things that allow you to sort of plug yourself into another sort of bigger system in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.143,
    "end": 302.13,
    "text": "That is, as you get onto the car, you get onto the bicycle, you're sort of wiring yourself into this composite human bicycle system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.11,
    "end": 310.881,
    "text": " But they also, these morphisms, they also encompass changing the model, that is changing the model of system, but also changing an individual model itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 310.981,
    "end": 320.453,
    "text": "So doing things like structure learning, parameter change, so normal learning, meta learning, or things that we might think of in neuroscience as effective connectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.854,
    "end": 322.917,
    "text": "These are all kinds of morphism of system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.938,
    "end": 329.485,
    "text": "And all of this stuff comes out of packaging active inference into this categorical systems theory language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.612,
    "end": 338.332,
    "text": " So with this, we gain a lot of things, not only do we sort of inherit these features, but we gain some nice new capabilities as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.392,
    "end": 342.022,
    "text": "So I've already talked about what we get from structured interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.385,
    "end": 346.714,
    "text": "So that means that we get systems where you can,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 347.403,
    "end": 359.556,
    "text": " The kinds of actions you take might depend on the situation or context or mode that you're in or that can act on very sort of precisely defined structured interfaces like computer APIs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.477,
    "end": 369.707,
    "text": "We get notions of agents that manage agents in a precise compositional way or sort of meta agents that can use active inference itself to change their structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.768,
    "end": 372.01,
    "text": "There seems to be an interesting link between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 371.99,
    "end": 393.458,
    "text": " um structure learning as in within one model and and planning as in choosing your sort of policy your series of actions both of those seem to be about composing sequences of morphisms and another thing that comes out of putting active inference into the language of categorical systems theory is that we can also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.809,
    "end": 422.162,
    "text": " make contact with categorical logic which can also be applied to categorical systems theory and that means that we can do things like or you know we in principle can do things like specify systems goals as logical predicates um talk about uh contracts that might have to hold between agents or um or sort of uh on their behaviors that you might you might something you might care about if you're interested in safety of artificial intelligences um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.716,
    "end": 429.587,
    "text": " And this logic, because it's in this systems theoretic framework, has to be compatible with the patterns of interaction of the systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.827,
    "end": 438.261,
    "text": "Now, I'm not going to say very much about this because there's really quite a big and open problem, like spelling out all of the details here, but I've got a couple of slides at the end about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.393,
    "end": 465.447,
    "text": " um and in in that same kind of vein and similar to this notion of policies as kind of being sequences of morphisms um structured active inference because we uh give some kind of typing or context information to the actions that are available that means that we can do things like type checking in principle on policies and that's a kind of rudimentary way to verify the safety of a policy i.e just that it makes sense",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.827,
    "end": 474.338,
    "text": " So the basic idea of categorical systems theory, this is the math stream, so I'm going to be quite mathematical here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.64,
    "end": 478.104,
    "text": "So there are two ingredients, as I mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.624,
    "end": 481.749,
    "text": "One is that we have a category of interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.829,
    "end": 484.673,
    "text": "So that is just something very syntactic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.693,
    "end": 489.961,
    "text": "It says, OK, here are the interfaces and Markov blankets of all my different systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.582,
    "end": 495.349,
    "text": "And those interfaces form the object of this category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.582,
    "end": 500.573,
    "text": " And then here are all the ways that these interfaces could link up or connect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.593,
    "end": 507.909,
    "text": "And these wirings, they become the morphisms of this category of interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.172,
    "end": 511.617,
    "text": "But there's no information in the category of interfaces",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.238,
    "end": 527.884,
    "text": " yeah about the systems themselves it's really just a sort of syntactic gadget for talking about how things connect up and so to to attach systems to interfaces we have what's known as an index category so we have for each",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.864,
    "end": 550.328,
    "text": " possible interface there's a whole category of systems that might somehow like fill that interface with a system so we think of the interface as like a box and then the index category of systems over that category of interfaces fills that box with an actual system it sort of brings it to life and it being indexed category means that this um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 550.966,
    "end": 555.873,
    "text": " These categories of systems over interfaces have to be compatible with wiring up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.893,
    "end": 565.166,
    "text": "So if you have an interface, one box and another box side by side, and you connect them together using one of the morphisms, you're also able to connect the systems in this way compatibly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.206,
    "end": 570.493,
    "text": "That is, you know, once you've plugged your boxes together, the systems sort of interact in this way accordingly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.908,
    "end": 593.612,
    "text": " um so that allows us to do this kind of um connection of systems um it's not normally just a category we also typically have what's known as the monoidal structure on the category of interfaces and that means that we can place systems side by side we don't just plug systems like one into another we can have like two systems next to each other and then sort of connect them into a bigger system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.913,
    "end": 609.255,
    "text": " that is like you know your body is made of lots and lots of cells next to each other but they're all sort of interconnected in parallel and that's that's sort of um um formalized by this monoidal structure which is sometimes called tensor and represented with this symbol here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.674,
    "end": 621.434,
    "text": " And so the system's theory again has to be compatible with this tensor, which means if you put two boxes side by side and systems in them, then you also get a system in the sort of composite double box system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.135,
    "end": 625.36,
    "text": "And so to do wiring, really often what happens is you have one box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.781,
    "end": 629.387,
    "text": "I've written it as P here and another box written as P prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.772,
    "end": 632.817,
    "text": " You put them together into this p tensor p prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.877,
    "end": 639.028,
    "text": "That means that you can connect a system over this and a system over this into a system over the joint interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 639.469,
    "end": 641.753,
    "text": "And then say you've got some wiring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 642.254,
    "end": 646.802,
    "text": "So wiring would be a morphism p tensor p prime to q.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.153,
    "end": 652.901,
    "text": " then the systems theory allows you to take that wiring and wire the systems together accordingly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.041,
    "end": 656.185,
    "text": "And then that means you've got a system on this Q interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.245,
    "end": 660.331,
    "text": "And so often you see diagrams in systems theory which are a bit like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.832,
    "end": 662.434,
    "text": "This is P. This is P prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.854,
    "end": 667.761,
    "text": "This is Q. And then this is some way of wiring the systems together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.277,
    "end": 675.349,
    "text": " And then this is your wiring, and then you've got the systems, and you get a sort of composite system like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.85,
    "end": 676.831,
    "text": "So I've gone very fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.851,
    "end": 679.877,
    "text": "This is the basics of categorical systems theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.398,
    "end": 688.213,
    "text": "As I say, it's a language for talking about building complex systems from their parts in a nice sort of formal compositional mathematical way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.868,
    "end": 700.855,
    "text": " And so what we're going to do is put active inference into this language in a way that generalizes active inference in this sort of quite big new direction that allows for things like mode dependence of actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.015,
    "end": 707.991,
    "text": "And so to do that, I want to introduce a particular category of interfaces, the category of polynomial functors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.882,
    "end": 717.233,
    "text": " If you know the work of David Spivak and his colleagues, he's a big proponent of this category for talking about things like systems and dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.554,
    "end": 721.539,
    "text": "And so I'm going to adopt his notation in talking about this category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.161,
    "end": 729.65,
    "text": "He calls it poly, and there's a nice book about this by David and Nelson New that you can read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.69,
    "end": 730.992,
    "text": "It's freely available online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.933,
    "end": 739.047,
    "text": " So a polynomial, it's really, again, as I say, it's like a syntactic gadget to talk about the interface of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.508,
    "end": 741.352,
    "text": "And it has kind of two key ingredients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.712,
    "end": 744.859,
    "text": "And it's really just like a polynomial that you see in high school algebra.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.879,
    "end": 750.55,
    "text": "So it has like a set of summands, which are these like y to the somethings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.53,
    "end": 754.434,
    "text": " And they're indexed by this p of 1 set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.454,
    "end": 755.075,
    "text": "This is a set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 755.556,
    "end": 759.74,
    "text": "And each sum and has another set attached to it, which is the exponent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.181,
    "end": 764.706,
    "text": "So it's really just like y squared plus 3y plus 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.567,
    "end": 766.528,
    "text": "This is a polynomial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.608,
    "end": 771.473,
    "text": "And this could be like sum over i y to the xi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.513,
    "end": 779.642,
    "text": "If we think of the three y's, like y plus y plus y.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.922,
    "end": 788.84,
    "text": " Rupert Clayton, And so, this is a sort of general representation of a polynomial and we think of the indexing set P of one as the set of the.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 789.181,
    "end": 798.542,
    "text": "Rupert Clayton, Of a set of the systems outputs or the configurations that it could adopt or an active inference language, like the observable states of a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.653,
    "end": 811.907,
    "text": " And then to each possible configuration of the system, as I say, you have this set which represents the inputs or the actions that a system might take in that corresponding configuration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.478,
    "end": 815.141,
    "text": " And so that's just how we think of a polynomial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.822,
    "end": 818.164,
    "text": "And then there are some things you can do with polynomials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.244,
    "end": 825.753,
    "text": "In particular, there's one trivial polynomial, one that has just one configuration and one possible input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.773,
    "end": 831.098,
    "text": "So there's no possible variation in its configurations and no interesting actions that it can take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.38,
    "end": 836.144,
    "text": "We can put polynomials side by side using this 10th of product.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.204,
    "end": 839.768,
    "text": "And this has the expected effect on the polynomials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.883,
    "end": 849.302,
    "text": " A configuration of a tensor is like a configuration of each part, and an input or an action is an action or an input of the corresponding part like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.852,
    "end": 860.746,
    "text": " And mathematically, we can translate between this kind of polynomial representation and what's known as a bundle, which is just a function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.887,
    "end": 864.131,
    "text": "So these are all sets, the p of i's and the p of 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.171,
    "end": 869.92,
    "text": "And so we can do the coproduct or disjoint union of these sets by summing over the i's.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.941,
    "end": 879.694,
    "text": "And this means that the elements of this big set here are pairs of an i, an indexing i in p of 1,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.995,
    "end": 885.016,
    "text": " and an element of the corresponding exponent set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.04,
    "end": 890.157,
    "text": "And this bundle is just a function that maps ix down to i.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.723,
    "end": 897.912,
    "text": " And this is useful for defining the morphisms of polynomials, which will do the things that I think of as wiring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.992,
    "end": 899.234,
    "text": "And I'll talk about that in a moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.534,
    "end": 912.192,
    "text": "But before I do so, I want to introduce one important example of polynomial, which are the monomials, because they don't have many interesting non-trivial summands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.232,
    "end": 914.355,
    "text": "They're just like one term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.335,
    "end": 922.206,
    "text": " So, and we write these as OY to the A, and these are going to be familiar because they capture the kind of classical active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.246,
    "end": 930.738,
    "text": "So here I think of the O as like the set of observations of an agent, and the exponent A as the set of actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.938,
    "end": 942.975,
    "text": "And so these actions are like the inputs to a generative model that makes it transition, and the observations are like the sort of data that the generative model or the environment produces that the agent receives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.58,
    "end": 955.572,
    "text": " And this is a polynomial because you're just summing over the O's, and for each O you have the same A. And the bundle just takes a pair of O and A and projects down to O. Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.812,
    "end": 960.157,
    "text": "So let me talk about how these things sort of wire up briefly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.817,
    "end": 971.088,
    "text": "This is done using the morphisms of polynomials, which are otherwise known as dependent lenses, if you know about functional programming, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.749,
    "end": 972.169,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.128,
    "end": 977.517,
    "text": " Amorphism is going to represent taking a system and putting inside a bigger system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.058,
    "end": 990.343,
    "text": "That is like if you've got two small boxes and you wire them together to build a big box, or you take two cells and you take multiple cells and you put them together to sort of make a multicellular organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.695,
    "end": 997.91,
    "text": " So if we've got polynomials P and Q, a morphism from P to Q is given by two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.711,
    "end": 1002.439,
    "text": "One sort of goes forward from P to Q and one sort of goes backwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.9,
    "end": 1009.834,
    "text": "And the forward one sort of takes the outputs of the inner systems and turns them into an output of the big system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.455,
    "end": 1019.865,
    "text": " And the backwards one takes the inputs to the big system and the outputs of the inner systems and uses them to produce inputs to the small systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.245,
    "end": 1024.43,
    "text": "So one of them goes from inside the box to the out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.51,
    "end": 1027.933,
    "text": "That's the phi 1 map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.953,
    "end": 1030.296,
    "text": "And then the other one goes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.876,
    "end": 1034.3,
    "text": "But it might take into account the internal inputs as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.34,
    "end": 1036.362,
    "text": "So it can be used for feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.05,
    "end": 1041.095,
    "text": " So that is to say, we've got this outputs map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.135,
    "end": 1043.818,
    "text": "So we take outputs of the inner box to the outer box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.339,
    "end": 1051.868,
    "text": "And for the corresponding inputs in the outer box, so that's these y's, we go backwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.948,
    "end": 1055.692,
    "text": "But we have to account for this mode dependence, which is a bit sort of funky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.113,
    "end": 1063.902,
    "text": "But this just says that if we've got an output corresponding to position or configuration i of the inner box,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.523,
    "end": 1089.906,
    "text": " then we're allowed to look at the inputs that correspond to the corresponding output and then we sort of back propagate those to the inputs again in configuration i so there's a bit of sort of accounting um you have to do to keep track of these like the sort of um of the configurations of all the systems but that just means that you know there's some like mode dependence or some like you know you might have some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.46,
    "end": 1111.675,
    "text": " you think of the sort of multi-cellular organism thing then you might have some like you know ion channels which are open or closed on the in on the membranes of the cells and what they do sort of depends on the state of all of those cells and so you have to account for that in these morphisms but in the monomial case where you don't have this like con context or configuration dependence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.925,
    "end": 1114.489,
    "text": " the morphisms become a little bit simpler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.529,
    "end": 1116.171,
    "text": "They just become like a forwards thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.271,
    "end": 1130.232,
    "text": "So here we've got an A and an S going forwards, and we have to figure out a way of giving an X. And in the backwards direction, we have an A and an S on the inside and a Y as well coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.272,
    "end": 1139.485,
    "text": "Then we have to figure out a way of giving a B and a T. So this really just encodes the wiring of these two boxes into the bigger box, like I said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.709,
    "end": 1151.784,
    "text": " So using this category poly, whose morphisms are the dependent lenses and objects of the polynomials, we can give a system theory which captures generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.665,
    "end": 1164.342,
    "text": "I'm going to just talk about discrete time ones in the traditional sense on the monomials, but also has some kind of more complicated mode dependent structure that I think could be useful in general as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.25,
    "end": 1168.094,
    "text": " So this is going to be an index category, like I said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.634,
    "end": 1170.156,
    "text": "It maps the polynomial, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.176,
    "end": 1178.466,
    "text": "an interface of the kind that I was just talking about, to a category whose objects are generative models on that interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.747,
    "end": 1182.532,
    "text": "So that means that they are going to be a quadruple like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.012,
    "end": 1187.257,
    "text": "So that is a state space, S. I'm just going to think of it as a set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.239,
    "end": 1194.126,
    "text": "A prior on the state space, which we could think of as like a goal or just prior beliefs about the agent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.258,
    "end": 1217.43,
    "text": " um a likelihood which is a sort of stochastic output morphism um in the case that this is um just a monomial O Y to the A then that's just like P of O given S and then there's also this transition map which says okay well given that I am in this state um I I sort of can sample",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.765,
    "end": 1228.878,
    "text": " Gareth J. An input that has to correspond to the configuration that i'm in so I sample from my pie and then okay i'm allowed to receive an input in this corresponding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.438,
    "end": 1240.791,
    "text": "Gareth J. At like configuration P of one which is given by my likelihood and then okay i've received an input and i've got a state and I get a new stage so that's like the transition function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.052,
    "end": 1246.978,
    "text": "Gareth J. Again, in this monomial case this is exactly what we normally have an active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.431,
    "end": 1253.119,
    "text": " we have a state S and an action in A, and we get a new state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.981,
    "end": 1258.628,
    "text": "It's just that now we're allowed to have the possible inputs to the system, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.648,
    "end": 1267.601,
    "text": "the possible actions that you could take on this generative model to be dependent on the state of the system or the state that the environment is in, according to that model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.222,
    "end": 1275.733,
    "text": "And so that captures this idea that, say, if I have my eyes closed, I can't receive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.713,
    "end": 1295.005,
    "text": " you know visual signals anymore uh or you know if i open my eyes then i can so there's a sort of difference in the sort of input signals that i can receive or if i'm sort of plugged into my computer i can't sort of easily get up and walk around because you know i might like have to like unplug a wire or something so that it captures this mode dependence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.065,
    "end": 1309.884,
    "text": " There are sort of important sort of mathematical bookkeeping duties we have to do, which I'm not going to do, but it's easy to check that it's like functorial, which means that it's indexed in the right way, and that it's monoidal, which means we can put systems side by side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.765,
    "end": 1323.642,
    "text": "And I've only just told you what the objects of this category gen of p are, but it also has morphisms, and these are ways of like comparing systems that are known in computer science as co-algebra homomorphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1323.824,
    "end": 1347.452,
    "text": " um so this captures the notion of generative model that we're used to in active inference but it allows for a lot more structure um in particular this kind of mode dependent structure and this compositional structure so just to sort of say like what kind of thing i mean by structured interface um i'm taking an example from computer science because um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.006,
    "end": 1357.68,
    "text": " There are lots of uses of polynomials in computer science, and one of them is defining domain-specific programming languages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.16,
    "end": 1367.393,
    "text": "And I think that one use of this could be for defining artificial agents that behave nicely with respect to computer interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.214,
    "end": 1374.283,
    "text": "And so we can encode the data of a domain-specific language into a polynomial,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.601,
    "end": 1377.245,
    "text": " Because, say, we've got a little calculator language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.325,
    "end": 1380.569,
    "text": "It has two binary operations, like plus and times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.609,
    "end": 1384.054,
    "text": "They each take in an input, take in two inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.074,
    "end": 1385.616,
    "text": "We've got a unary operation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.756,
    "end": 1387.578,
    "text": "It just takes in one thing, and it negates it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.959,
    "end": 1394.888,
    "text": "And we've got some constants, uncountably many, that represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.374,
    "end": 1416.572,
    "text": " real numbers then we can encode the data of this as like you know 2y squared plus y plus r because we've got these two little operations one two binary operations they've got two possible inputs one unary operation it's got one input and like these constants which don't take in inputs and then we can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.042,
    "end": 1431.16,
    "text": " you know, represent the set of all terms of this language as, like, a set by applying the polynomial to, like, some x. Those x terms, those x elements represent the inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.942,
    "end": 1433.245,
    "text": "And then we could think, okay, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.832,
    "end": 1459.08,
    "text": " what would be um a machine that like takes in terms of my little domain specific language and returns values it's it's something like r y to the p of x which is again another polynomial and you can do lots of things like this basically you can encode like any small um programming language or any any sort of abstract syntax tree into a polynomial um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.55,
    "end": 1463.558,
    "text": " It's not just examples from computer science that are relevant, but they have a lot of structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.578,
    "end": 1465.823,
    "text": "And so I wanted to show off those examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.184,
    "end": 1469.531,
    "text": "I think you could do a lot of things in biology as well using this language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.154,
    "end": 1477.828,
    "text": "But it's kind of more sophisticated than we can do with just sort of a set of observations and a set of actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1480.306,
    "end": 1491.72,
    "text": " Another thing that I wanted to mention is that in this context, it's quite natural to think of the actions that an agent takes as morphisms in a category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.08,
    "end": 1496.045,
    "text": "And this is where this typing information or this typing idea comes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.607,
    "end": 1503.214,
    "text": "Because in categories, morphisms have to compose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.254,
    "end": 1509.942,
    "text": "And so we can check that they are sort of compatible before we compose them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.529,
    "end": 1515.774,
    "text": " And so to give you an idea of how this works, we can think of categories as like little state machines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.195,
    "end": 1518.277,
    "text": "So here I've drawn a little category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.357,
    "end": 1521.78,
    "text": "It's got objects x, y, and z. And it's got these morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.061,
    "end": 1525.564,
    "text": "It's got two morphisms from x to y, f and f prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.904,
    "end": 1538.477,
    "text": "And we've got g from y to z. And we can go along f and then along g to go from x to y to z. And that takes us from x to z. Or we can go f prime to z and blah, blah, blah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.217,
    "end": 1542.481,
    "text": " But these are like steps or paths in a little space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.921,
    "end": 1547.948,
    "text": "And so we go from x to y and then y to z. But it doesn't make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.909,
    "end": 1553.474,
    "text": "If we had another object over here that wasn't connected to z, we could go over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.694,
    "end": 1565.389,
    "text": "But then we wouldn't immediately be able to go over z. That's to say, if we had an island or a peninsula or an island with just one bridge onto it, we could go onto the island.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.629,
    "end": 1568.312,
    "text": "But then to go somewhere else, we'd have to go back along the bridge",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.22,
    "end": 1572.443,
    "text": " Sometimes the places you can go depend on where you are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.483,
    "end": 1575.786,
    "text": "And this encodes that data into the notion of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1576.566,
    "end": 1582.071,
    "text": "And indeed, every category is itself can be turned into a polynomial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.252,
    "end": 1588.917,
    "text": "The configurations of the polynomial are the object of the category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.437,
    "end": 1595.242,
    "text": "And then the inputs to a system would be the morphisms of that category out of each object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.563,
    "end": 1598.485,
    "text": "That is to say, all the steps you could take out of each object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.887,
    "end": 1602.711,
    "text": " And then a policy would have to be a composable sequence of morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.391,
    "end": 1608.076,
    "text": "Or in active inference, you might have something more stochastic, so you have a belief over such sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.717,
    "end": 1614.843,
    "text": "But because you have this type of information, it means that you can check that your policies make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.063,
    "end": 1627.375,
    "text": "You don't try to go somewhere and then somewhere from that intermediate destination, you don't try to go somewhere that is not connected or take an action that doesn't make sense in some other way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.57,
    "end": 1636.804,
    "text": " And so we can use this to start to think about like safety of policies using the logic that comes with category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.865,
    "end": 1644.558,
    "text": "This isn't something that I elaborated, but I think it's a sort of starting step to talk about safe active inference systems in a very rigorous way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.62,
    "end": 1648.485,
    "text": "And I already mentioned that other kinds of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.702,
    "end": 1654.614,
    "text": " important notion are also morphisms in structured active inference, like changes of interface or changes of structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.894,
    "end": 1667.098,
    "text": "And that means, I think, that we can rigorously apply active inference to itself to do things like structure learning or to choose how you connect yourself into a bigger unit, like into an organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.559,
    "end": 1675.73,
    "text": " And on that note, let me tell you about how, in this setting, we talk about systems that manage systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1676.251,
    "end": 1684.446,
    "text": "This is a generalization, or will become a generalization, of what is known in the active inference literature as deep or hierarchical active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.928,
    "end": 1693.478,
    "text": " And so the sort of formal gadget that we use to talk about this is known as the closure of the category of interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.919,
    "end": 1700.668,
    "text": "That is to say, it has what's known as an internal home home because morphism is otherwise known as homomorphism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.25,
    "end": 1710.1,
    "text": "And the category of polynomials and also the category of lenses has one of these internal homes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.16,
    "end": 1713.825,
    "text": "That is a way to refer to the category within itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.514,
    "end": 1718.881,
    "text": " And that internal home has to be given a polynomial form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.362,
    "end": 1728.856,
    "text": "And so the sort of configurations of this polynomial from say from P to Q, they are the ways of wiring P into Q, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.876,
    "end": 1731.24,
    "text": "the set of lenses from P to Q.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.57,
    "end": 1736.978,
    "text": " And then, you know, we have to give as well exponents to provide a polynomial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.359,
    "end": 1747.818,
    "text": "And these exponents are going to be all the sort of data that the inputs to these sort of P systems, if we think of the P as like the inner systems that they require.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.858,
    "end": 1755.372,
    "text": "And so they require outputs from P and inputs from Q. And that's exactly what this like input data is here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.875,
    "end": 1781.258,
    "text": " so if we so we've got a polynomial that represents how p's connect into q's and we can think about what uh generative models would be over such a polynomial that is just like systems that control the wiring of p's into q's or as i've done in this example control the wiring of a p1 and a p2 into q",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.862,
    "end": 1809.169,
    "text": " and so what would these systems be well they would observe the outputs of p1 and p2 and then the inputs of q and they would update their states accordingly having made these observations and then they would output ways to connect p1 and p2 into q and that really is like what a manager does in an organization or sort of high level system does in a sort of hierarchical structure um and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.537,
    "end": 1815.303,
    "text": " There's a sort of nice fact that I'll use later on, that if you have a sort of trivial inner system, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.323,
    "end": 1825.135,
    "text": "just with this polynomial y, then the generative models on this hom polynomial are just the same as generative models on the outer polynomial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.915,
    "end": 1833.604,
    "text": "So we can use this to capture not only these hierarchical systems, but just kind of regular systems as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.989,
    "end": 1842.413,
    "text": " uh there's an interesting or you know the sort of side fact or reason why this is known as the closed structure is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1843.169,
    "end": 1847.694,
    "text": " This is the same as something that's known in computer science as currying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.555,
    "end": 1870.257,
    "text": "You might have seen this, that if you have a function that takes inputs in A and B and produces C, like this maps A, B to F of A and B, we could also write this as a function that maps from A to maps from B to C.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.979,
    "end": 1879.809,
    "text": " And that says, OK, well, this maps A to F of A something, which is a map from B to C. So this is the same idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.869,
    "end": 1889.279,
    "text": "It says, OK, well, the ways of mapping into this hom polynomial are the same as mappings of the joint systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.241,
    "end": 1894.084,
    "text": "It's an important structure that gets used a lot in this context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.253,
    "end": 1901.398,
    "text": " Okay, so I spent a lot of time talking about structured generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.598,
    "end": 1910.509,
    "text": "In particular, I introduced this hierarchical structure, and I talked about the structure of mode dependence in an abstract and general way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.53,
    "end": 1925.607,
    "text": "But it was always about generative models, and I haven't really talked much about doing action selection or state inference, which is, of course, a very important part of active inference, and in some sense is kind of what active inference is all about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.548,
    "end": 1933.719,
    "text": " But those processes fit very naturally into the same framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.2,
    "end": 1936.824,
    "text": "They're something that you attach to a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.224,
    "end": 1945.016,
    "text": "Active inference always starts from a generative model and then describes the process for providing a policy to control it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.998,
    "end": 1951.847,
    "text": "And so an active inference agent, or I think an agent more generally, is made up of two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.08,
    "end": 1960.878,
    "text": " It's made up of the generative model and then something that I call a controller, which basically chooses the policy to provide to the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.299,
    "end": 1965.448,
    "text": "It's a way to sort of take this generative model, which is an open system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.492,
    "end": 1985.8,
    "text": " like sort of meant to render it closed it sort of takes the observations that are produced by the generative model and then turns them into actions that can go into the generative model and so there's some sort of nice duality between the generative model and the controller and it's this duality that allows us to formalize um active inference in a nice compositional way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.387,
    "end": 1999.269,
    "text": " One way I sort of started to like to think about this, and I don't really know much about this subject, so I won't make any claims that it's rigorous or sensible, but I think of the sort of generative model as somehow like the consciousness of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.289,
    "end": 2008.564,
    "text": "It represents how the agent perceives the world, and then the policy part is it's sort of the subconscious processes which sort of drive the agent in that generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.303,
    "end": 2011.566,
    "text": " I mean, this is just sort of my thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.606,
    "end": 2013.308,
    "text": "I don't know if it's very sensible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.59,
    "end": 2029.59,
    "text": "But as I say, we can fit all of this into the same framework by kind of taking poly and this category of generative models and the home structure and sort of putting them all together into a sort of nice bundle or nice mix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.258,
    "end": 2037.087,
    "text": " So I had this two category called GenPoly made up of all of these ingredients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.148,
    "end": 2042.937,
    "text": "The objects are the interfaces, the polynomials, you can think of them as generalized Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.538,
    "end": 2045.161,
    "text": "And then now it's a two category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2045.201,
    "end": 2052.332,
    "text": "So instead of between one object and another having a set of morphisms, now we have a whole category of morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.352,
    "end": 2055.117,
    "text": "So we have both one cells and two cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.297,
    "end": 2057.08,
    "text": "So it's a two dimensional structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.92,
    "end": 2064.887,
    "text": " But the HOM category from P to Q is just the systems on the HOM interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.027,
    "end": 2071.634,
    "text": "So that is generative models on the structured interface that sort of takes P systems and turns them into Q systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2071.674,
    "end": 2074.416,
    "text": "So they're sort of hierarchical manager systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.077,
    "end": 2079.942,
    "text": "And then the two cells are ways of comparing these systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.402,
    "end": 2081.824,
    "text": "And I haven't really talked much about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.884,
    "end": 2084.366,
    "text": "And they won't feature much in this talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.627,
    "end": 2086.088,
    "text": "And they don't feature in the paper either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.996,
    "end": 2091.1,
    "text": " But they're important if you want to talk about things like structure learning or logic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.738,
    "end": 2117.121,
    "text": " then the composition of systems is as i've been saying all along we take a system over over one sort of home polynomial and the system over another home polynomial and then we wire them together so then we have like a sort of high level manager here and a sort of lower level manager and they talk to each other to produce what we could think of as like a hierarchical organization which takes sort of very low level things and turns them into high level things um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.94,
    "end": 2129.815,
    "text": " And yeah, so we're out of tensor polynomials, and that makes this gen poly two category into monoidal two categories, so we can put systems side by side in the way you'd expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.077,
    "end": 2138.687,
    "text": "And it means we can draw an active inference system in this kind of string diagram way that category theory people like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.005,
    "end": 2144.375,
    "text": " So the generative model is something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.575,
    "end": 2148.022,
    "text": "It takes in nothing and it produces p things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.182,
    "end": 2151.749,
    "text": "That is, produces, well, I guess this is a bidirectional thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.829,
    "end": 2158.161,
    "text": "So it sort of is a morphism from a trivial object into p.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.613,
    "end": 2162.225,
    "text": " And it produces P outputs and takes P inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.245,
    "end": 2163.83,
    "text": "And then the policy is like it's dual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.87,
    "end": 2169.147,
    "text": "So it takes in P inputs and it produces what the generative model expects as output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.612,
    "end": 2184.709,
    "text": " And then, as I may have mentioned, no, I didn't mention yet, that this, as I said before, at least in the case of just a single system, just on P, the hom from Y to P is just the same as P, so that's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.789,
    "end": 2189.695,
    "text": "This captures what I was saying before about generative models on an interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.696,
    "end": 2199.387,
    "text": "And then the controller is the model from P to Y. That means it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.244,
    "end": 2218.573,
    "text": " doesn't sort of it produces a sort of closed system when you compose it with p and that is that is to capture this picture that i drew before where you have like um a box which is the genetic model which is open and then this controller which sort of closes it off and that's encoded in this sort of formality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2222.485,
    "end": 2229.211,
    "text": " Okay, and so now we've got this definition of a controller of a generative model as like being dual to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.711,
    "end": 2234.275,
    "text": "We can sort of unwind or decompress what that means mathematically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.315,
    "end": 2240.2,
    "text": "So the home polynomial from P to Y has this form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.28,
    "end": 2244.844,
    "text": "It's just something that you can work through if you write down that expression and figure out what it means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.705,
    "end": 2252.391,
    "text": "The outputs or configurations of this polynomial are what are known as sections of P.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.962,
    "end": 2255.952,
    "text": " So a section of this P",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.286,
    "end": 2266.497,
    "text": " taken as a bundle is a way of going from the outputs and for each output giving an input that matches the corresponding configuration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.597,
    "end": 2271.522,
    "text": "So it's just a way of making this diagram commute, as we would say in category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2271.842,
    "end": 2280.431,
    "text": "That is to say, OK, we're in an output or a configuration, and we say, OK, well, I need to provide an input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.791,
    "end": 2281.772,
    "text": "And yes, that's nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.273,
    "end": 2285.196,
    "text": "It matches what configuration I'm in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.176,
    "end": 2290.923,
    "text": " And we think of this as like being the data that the world supplies to the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.983,
    "end": 2298.973,
    "text": "So the system or like we think of the system as producing output, the environment takes those outputs and then turns them into inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.993,
    "end": 2301.196,
    "text": "And so that's exactly what these sections do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.878,
    "end": 2307.724,
    "text": "So those sections are the things that are outputted by this policy part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.856,
    "end": 2314.328,
    "text": " And then the inputs to the policy part are the outputs produced by the P system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.348,
    "end": 2315.791,
    "text": "And so, as I say, it's exactly dual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.891,
    "end": 2322.203,
    "text": "So the outputs are the things that the inputs that P needs and the inputs are the things that P produces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.824,
    "end": 2331.761,
    "text": " And so we can unravel this in the case of this monomial interface, which is going to give us what we get in classical active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.763,
    "end": 2337.793,
    "text": "The output path of one of these systems is going to do action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.953,
    "end": 2340.678,
    "text": "So it has a little state space, which I just called R here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.58,
    "end": 2344.225,
    "text": "It takes an observation, and it produces an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.15,
    "end": 2350.739,
    "text": " And this is exactly what the sort of action selection process and active inference does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.759,
    "end": 2357.088,
    "text": "It takes a state and an observation that produces an action that is to be taken in the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.609,
    "end": 2365.802,
    "text": "And it also has this part which does state inference, or you might see it called the recognition model, or it computes the Bayesian posterior over the states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.202,
    "end": 2369.908,
    "text": "So we're in a state, and we have an observation, and then we get a new state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.07,
    "end": 2385.37,
    "text": " So these sort of four things, these two parts of the policy system and then the transition model and the likelihood in the generative model are basically all of what an active inference system is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.492,
    "end": 2388.535,
    "text": "You might include the prior in that as well, I suppose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.176,
    "end": 2395.064,
    "text": "And so that means that we've got all the data of an active inference system in this very neat little package.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.084,
    "end": 2397.988,
    "text": "It's a generative model and it's dual, and that's kind of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.116,
    "end": 2403.622,
    "text": " There are obviously some ways you can extend this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.662,
    "end": 2405.985,
    "text": "That's not something I'm doing in this paper or in this talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.425,
    "end": 2413.134,
    "text": "But basically, you can do things like consider trajectories over actions or continuous time models or do lots of other things like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.615,
    "end": 2415.637,
    "text": "But I'm going to try to keep it as simple as I can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.657,
    "end": 2419.302,
    "text": "I know I've introduced a lot of mathematical detail so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.543,
    "end": 2436.514,
    "text": " And then Okay, so, then there are three further generalizations that kind of prop up pretty immediately from this that I think are quite important, and I want to just introduce to you all, and the first of them is that now we've got this home structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.148,
    "end": 2446.959,
    "text": " and this nice two category, we can think about, as I've indicated already, think about hierarchical deep systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.359,
    "end": 2451.124,
    "text": "And that really corresponds to nesting small systems in bigger systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.704,
    "end": 2460.595,
    "text": "And that formally means going from generative models with trivial inner boundary to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.148,
    "end": 2488.557,
    "text": " generation models which have a sort of non-trivial inner boundary and now unfortunately I've swapped my direction of my home so it goes from Q to P um the story still holds I've just changed P and Q round um and I'll say in a moment like how this unwinds so you can get a sense of what it does and then we do the same to the policy it just does the same thing in the opposite direction now it's a system from P to Q",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.937,
    "end": 2494.044,
    "text": " But they're still dual, so the intuitions are still good, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.288,
    "end": 2497.249,
    "text": "That's one thing we can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.29,
    "end": 2514.038,
    "text": "This produces a sort of bicategory, a two category, or what ultimately becomes a double category, where the arrows are pairs of a system and a controller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.435,
    "end": 2527.593,
    "text": " And so the next thing we can do to this is to think about how do we model in a sort of rigorous way the changes of model, changes of interface that I introduced at the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.655,
    "end": 2543.738,
    "text": "That corresponds to adding yet another dimension to this structure, and that formally encodes changes of model as extra morphisms categorically, and that makes them kind of accessible to this formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.376,
    "end": 2552.533,
    "text": " Not something that I'm going to talk about today, because I've introduced enough stuff here just to sort of whet your appetite, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2554.177,
    "end": 2560.63,
    "text": "But in this formalism, even in this sort of just two-dimensional setting,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2561.572,
    "end": 2577.976,
    "text": " Because it's quite general, because it says that active inference is really made up of two key ingredients, a system and a controller, it allows us to ask precisely how active inference relates to other theories of agency or other notions of system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.457,
    "end": 2585.587,
    "text": "And of course, lots of people have thought about the relationship between active inference and other accounts like reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.648,
    "end": 2589.132,
    "text": "But I think this framework allows us to make those",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.314,
    "end": 2611.018,
    "text": " relationships very very precise indeed and to say okay well you there is say one might hope uh a particular like possibly universal way of mapping any reinforcement learning system into an active inference system in a compositional way so that you could do it for the parts and also for the like complex system and you get something that makes sense",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.517,
    "end": 2628.906,
    "text": " um and possibly one could go and I think it's quite likely that one could also go in the other direction and there would be nice sort of we might expect like nice formal results like these two processes were adjoint or something like that um but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.325,
    "end": 2656.328,
    "text": " I'd like to highlight at this point that active inference, I think, in this setting is really not just one theory of agency, but really it's a whole family of theories of agency parameterized by things like whether or not you take continuous time or discrete time systems, because those, of course, give you different systems theories, or whether you do planning by sophisticated inference or inductive inference or just one time step, or whether you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2657.725,
    "end": 2665.234,
    "text": " or whether you think about like multiple time steps or whether you take the expected free energy or the free energy of the expected future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.274,
    "end": 2670.701,
    "text": "So there are all these different variations and they give you like different like notions of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.741,
    "end": 2674.346,
    "text": "And so probably different theories of agency in this sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.347,
    "end": 2687.682,
    "text": "And I think that's important for like making sense of the whole active inference landscape and in particular the sort of landscape of theories of agency itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.898,
    "end": 2697.171,
    "text": " because it means that we can have a nice rigorous map of all of these things and connect one thing into another quite nicely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.372,
    "end": 2705.743,
    "text": "Again, I'm not going to say very much about this, but I just wanted to flag it up that that's something that you get out of making precise these structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.406,
    "end": 2714.715,
    "text": "So I mentioned that I wanted to highlight how this captures deep or hierarchical active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2715.995,
    "end": 2720.963,
    "text": " And this happens in, I think, quite a natural way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.123,
    "end": 2726.051,
    "text": "I mean, I've introduced an awful lot of formalism here, but once you get used to it, I think it works okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.954,
    "end": 2740.213,
    "text": "But hierarchical active inference just corresponds to a sequence of composite arrows in this two category whose arrows are made up of, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.7,
    "end": 2770.099,
    "text": " generative model and uh controller actually is upside down but doesn't matter um so in this setting again as i've mentioned the monomial interfaces correspond to the kind of normal marker blankets that are just made up of a set of observations and a set of actions but we get this hierarchical structure in the one cells of this two category and if we think of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.484,
    "end": 2778.38,
    "text": " the sort of composition in this two category is basically by nesting, then I sort of draw it schematically like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.001,
    "end": 2787.498,
    "text": "I'm indexing the higher levels of the sort of interior levels of the system as higher in this context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.518,
    "end": 2792.728,
    "text": "So i plus 1 is kind of more inside the system than i.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.62,
    "end": 2799.168,
    "text": " Often that corresponds to a higher level of explanation in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.869,
    "end": 2810.644,
    "text": "But because there's this duality between the generative model and the controller or the policy part, I don't like to say high level or low level because it gets confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.804,
    "end": 2823.542,
    "text": "I prefer to think about how deep you are inside your agent or how close you are to the exterior world when I'm talking about the direction of this kind of hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.826,
    "end": 2827.052,
    "text": " And so to the left, we go sort of more interior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.072,
    "end": 2828.675,
    "text": "To the right, we go more exterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.995,
    "end": 2831.781,
    "text": "And these arrows point in the exterior direction like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.702,
    "end": 2837.471,
    "text": "And so a sort of hierarchical active inference system goes from interior to exterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.912,
    "end": 2845.886,
    "text": "It's an arrow of this kind that unwinds to the following data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.926,
    "end": 2847.91,
    "text": "It's a state f.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2848.666,
    "end": 2856.358,
    "text": " The likelihood that is parameterized by the state and the interior belief about observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.919,
    "end": 2866.034,
    "text": "So which you could think of as like high level in some context observations, and it produces a prediction about the more exterior observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2866.635,
    "end": 2870.421,
    "text": "There's a prior on the.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.401,
    "end": 2893.607,
    "text": " in more interior actions which again you could possibly think of as a high level that this is parameterized by the or conditioned on the state and the and the sort of interior observations and the exterior um uh some more exterior actions um or the system's belief about the more exterior actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2894.043,
    "end": 2900.415,
    "text": " And then a transition model, which, again, depends on the actions taken at this kind of exterior level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.956,
    "end": 2903.942,
    "text": "In this case, this is the high level actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.463,
    "end": 2908.491,
    "text": "And it gives us a new state on the basis of the old state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.416,
    "end": 2912.2,
    "text": " And then there's this other part, which is dual, which is the controller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.24,
    "end": 2920.594,
    "text": "So the control here, I've written the state space is like beliefs over the generative model state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.215,
    "end": 2925.401,
    "text": "So that says it takes, it has this, again, these three parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.581,
    "end": 2935.457,
    "text": "So one is like a generative process, which takes the, in the sort of exterior observations, the signals which impinge on the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.64,
    "end": 2955.167,
    "text": " the sort of outer mark of blanket and translates them onto the inner mark of blankets so it goes in the other direction like this um there's a sort of policy part which does action selection so it takes in a belief over the state space and um like a high level or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.316,
    "end": 2973.915,
    "text": " more interior belief about over the actions and it produces um what we could think of as more exterior uh choice of action so that could be like passing down a sort of high level motor signal um into like low level sequence of like muscle contractions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.895,
    "end": 2987.194,
    "text": " Because I think of the sort of closer to the exterior systems as like the ones being made of lots of, say, cells, rather than the interior model of myself as just a body with arms that move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.676,
    "end": 2993.724,
    "text": "And then finally, there's this component which does Bayesian inference over the states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.804,
    "end": 3002.316,
    "text": "It takes in a state and an exterior observation, that is the signals which they impinge on my retina, and it updates the internal state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.684,
    "end": 3007.75,
    "text": " that's you know the part that does like um you know that gives you your posterior overstates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.928,
    "end": 3010.009,
    "text": " This is a lot of data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.31,
    "end": 3033.682,
    "text": "In the literature, it sometimes comes out in a slightly less or maybe slightly more familiar way or a slightly less detailed way where you don't have the interior observations, which I think was like sort of beliefs about high level patches of information, like the object rather than the sort of individual like retinal ganglion data or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.203,
    "end": 3038.749,
    "text": "And if you imagine not having these OIs, OI plus ones,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3039.91,
    "end": 3068.888,
    "text": " in this model then you wouldn't have like this generative process and you would only have a likelihood which takes a state to an observation but you still get this like hierarchical action selection process so it just takes like high level action like high level beliefs about sort of actions like I'm moving my arm into sort of lower level sort of signals that I pass to my muscles but I think it's nice to allow for this hierarchy in the opposite direction on the observations as well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.842,
    "end": 3083.788,
    "text": " Okay, so the final thing I want to mention is that the categorical systems theory lets us talk about, lets us use categorical logic for talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3084.578,
    "end": 3101.895,
    "text": " goals and behaviors of systems and formally it's quite easy to say what we need to do that it's not something that i've done because actually there are a lot of details but formally like it's relatively simple all you need is the ability to define what's known as the vibration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.415,
    "end": 3107.081,
    "text": " And a vibration is just like a collection of things indexed by the other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3107.121,
    "end": 3113.889,
    "text": "So again, this index category thing notion that I introduced at the beginning is basically equivalent to vibrations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.489,
    "end": 3123.58,
    "text": "But the idea is now that over each system we have a vibration of predicates of logical statements about those systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.998,
    "end": 3152.993,
    "text": " um that it's indexed by the systems and the systems are indexed by interfaces and it's compatible with all the changes of system and changes of interface and things like that um but one notion one sort of simple idea of like logical structure or predicate you might attach to systems is just notion of um goal for a system so these priors on the state space um and I haven't elaborated this um but you know once you've got this we can kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.766,
    "end": 3173.023,
    "text": " use the structures of category theory to do things like define quantifiers or logical connectives and to build up statements about goals out of sort of more primitive statements and compare systems goals and to say possibly things like oh now if i've got a bunch of systems connected together",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.83,
    "end": 3180.177,
    "text": " Maybe they work together to achieve their goal, possibly by some process of consensus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.938,
    "end": 3184.262,
    "text": "This allows us to talk about that kind of thing in a mathematically rigorous way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.862,
    "end": 3189.347,
    "text": "Or now we've got this formal logic to talk about the goals of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.708,
    "end": 3202.302,
    "text": "Can we use this to talk about notions of safety or to guarantee that the goals will be achieved within certain bounds or that they won't try to do this thing or this other thing, which we don't like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.872,
    "end": 3209.101,
    "text": " I think this is important, again, as I've mentioned at the beginning, for thinking about safe artificial systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.544,
    "end": 3211.785,
    "text": "That's all I wanted to talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.106,
    "end": 3212.687,
    "text": "It was a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3213.448,
    "end": 3216.112,
    "text": "I think we can go back and elaborate on any of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.773,
    "end": 3220.859,
    "text": "And I'm sure we'll come back to it in the future as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3221.84,
    "end": 3222.822,
    "text": "Thank you so much for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.882,
    "end": 3227.629,
    "text": "I hope it wasn't too bamboozling, but I'm always willing to answer questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.649,
    "end": 3230.854,
    "text": "And if people have more questions, please feel free to get in touch afterwards as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.091,
    "end": 3261.043,
    "text": " thank you toby wow okay yeah while people are asking some questions in live chat which i'll read to you could you reiterate how does what you refer to as classic active inference with markov blanket bayesian graphical formalism how does that overall literature relate to what you discussed today in terms of applied category theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.019,
    "end": 3262.38,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.54,
    "end": 3262.861,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.881,
    "end": 3273.483,
    "text": "So I think the very concise way of putting it, let me see if I can go back to a slide where it's relatively or not too intimidating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.824,
    "end": 3277.311,
    "text": "The concise way of putting it is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3278.371,
    "end": 3308.192,
    "text": " the systems in active inference that i like classical that we're more familiar with heretofore are basically like sub theory or a sub category of this whole structure that is spanned we would say in mathematics by these monomial interfaces these are the ones that don't have this like complicated state dependence on the actions they just have a space of possible observations and a space of actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.577,
    "end": 3333.741,
    "text": " um and in particular if you don't think about like these hierarchical or deep systems then it's relatively simple to see that those systems that those kind of generative models are captured by this formalism um because you get uh you know on over one of these monomials the monomial represents the markov blanket um the uh coefficient here is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.058,
    "end": 3352.101,
    "text": " observations the exponent is the actions um we have a state space we have a prior we have a likelihood and we have a transition model and that's kind of the whole deal with a generated model um the the sort of policy part the thing that i call the controller",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.127,
    "end": 3354.049,
    "text": " Excuse me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3355.212,
    "end": 3359.683,
    "text": "It kind of remains, like I said, it's the same as dual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.763,
    "end": 3360.505,
    "text": "It does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.705,
    "end": 3362.69,
    "text": "Let's see if I can go back to the slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.151,
    "end": 3365.196,
    "text": "It does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.323,
    "end": 3381.165,
    "text": " Gareth J. yeah it does action selection I planning and it does base and inference I produces the posterior here is this like a placeholder usually this least in the story that I told him the paper, this would be like police overstate the here means distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.687,
    "end": 3385.852,
    "text": "Gareth J. So this is distributions overstate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.056,
    "end": 3395.065,
    "text": "Gareth J. it's just a way of like packaging all of that up into a kind of nice compositional framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.513,
    "end": 3423.398,
    "text": " so that we can because you see a lot of you know if you look at complicated hierarchical active inference pictures they often have like really complicated structure but actually these structures typically have like some kind of common repeating elements that in principle should just be able to be boxed up and repeated and plugged in in a nice way that is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.563,
    "end": 3451.174,
    "text": " mathematically sound and reusable and kind of uh you know i like category theory because it's a kind of lingua franca and and it means that you don't have like small variations in formalism like what does message passing mean well it means lots of different things lots of different people um in this setting you have you can be very precise about like what your theory of agency is um what the notion of markov blanket is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3451.475,
    "end": 3462.614,
    "text": " One of the things I often find a bit tricky about the active inference literature is the notion of Markov blanket is quite, it's kind of intuitively quite easy to graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.056,
    "end": 3467.121,
    "text": "But in this kind of dynamical setting,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.877,
    "end": 3475.605,
    "text": " It doesn't quite correspond to the notion of marker blanket that originally came out of statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.226,
    "end": 3497.867,
    "text": "Unless you do some kind of maneuvers that unwind your dynamics into a big graphical model and draw certain boxes around some repeating elements, then you can say that the marker blanket of the system is the parents, children, co-parents, like you would say in statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.775,
    "end": 3505.609,
    "text": " But it's kind of not really what the job of the Markov blanket is, not in active inference and not in statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.629,
    "end": 3506.851,
    "text": "They sort of play different roles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.911,
    "end": 3510.479,
    "text": "In active inference, the Markov blanket is the agent's interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.499,
    "end": 3514.607,
    "text": "It's like the boundary of the agent, how it interacts with the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.958,
    "end": 3517.142,
    "text": " And I think it's nice to be precise about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3517.202,
    "end": 3526.859,
    "text": "It's nice to say that when we say Markov blanket, we mean interface and our interfaces come together and they can connect up and they can produce bigger systems with interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3527.5,
    "end": 3534.533,
    "text": "And that has a particular grammar to it, which is not the same as the grammar of Markov blankets and statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.294,
    "end": 3539.582,
    "text": "It might be in certain cases, but if we want to talk about the sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3539.562,
    "end": 3563.578,
    "text": " um whole world of different kinds of dynamical systems from these discrete time ones that i was talking about to various different models of continuous time ones then it's it's not it's not so easy to make the connection back to market blanket and so i think to some people who come from statistics um this terminology can be a bit confusing and one of the things that comes out of this structured active inference is that it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.487,
    "end": 3593.127,
    "text": " says hey this is how we can be precise about this um it says okay well we have this notion of interface it can be whatever you want as long as it's you know it behaves like we think of as interface and i've just told you about one story of interfaces and and basically one story of systems like over the interface but categorical systems theory is very very general it lets you talk about lots of different kinds of interface lots of different kinds of systems and this is why i think that this story of structured active inference whilst it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.107,
    "end": 3612.938,
    "text": " captures the kinds of active inference systems that we're familiar with it's really a theory of the structure of agents generally and i think active inference wants to be that um and that's why i think that you know here we might want to expect that there's like traditional there's like um canonical ways of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.272,
    "end": 3638.132,
    "text": " relating other theories of agency to active inference or to a particular flavor of active inference and that we can make those mappings precise precise not just for an individual model or an individual system but for all systems of a particular kind um and and that's the kind of universality that I think we should be aiming for um I can explain what these arrows on this page mean but I don't you know I think you get the idea that like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.855,
    "end": 3643.853,
    "text": " this is to say if you've got an agent it's a system and a controller you can like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.17,
    "end": 3645.832,
    "text": " Forget the controller and you've just got a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.032,
    "end": 3657.546,
    "text": "Active inference is a way of saying, okay, given my system, I've got a story about how to attach controllers to it, how to do policy, how to do planning, how to do action selection, how to do state inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.967,
    "end": 3662.452,
    "text": "Active inference is a recipe to take a generative model and provide a controller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.833,
    "end": 3669.281,
    "text": "And reinforcement learning is a rest, or the variants of reinforcement learning are also recipes for doing something similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.282,
    "end": 3672.945,
    "text": "So it's a sort of mapping in the other direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3674.123,
    "end": 3685.604,
    "text": " So I think the thing to take away is that if you're just interested in simple models with one set of actions and one set of observations, then you don't have to worry about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.624,
    "end": 3694.039,
    "text": "But if you're interested in building big, complex models of big, complex systems like organizations, or if you're interested in talking about systems whose interfaces can be dependent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.019,
    "end": 3716.854,
    "text": " or whose like actions might depend on where they are or what they're doing or who can change their interfaces or who can come together to form organizations that themselves are like dynamical and changing then we need stronger mathematical tools for describing those systems and those processes and those kinds of agents and that's what this framework and that's what categorical systems theory gives us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.37,
    "end": 3718.831,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.171,
    "end": 3721.074,
    "text": "So many great points and things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.154,
    "end": 3724.459,
    "text": "I'll just highlight two pieces that I think really hit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.842,
    "end": 3735.396,
    "text": "You called it a particular grammar that knowingly or unknowingly plays on the particular partition, splitting things into particles and being that partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.416,
    "end": 3739.703,
    "text": "And this is also a grammar of particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.683,
    "end": 3764.172,
    "text": " it's a particular grammar like there are sentences that are syntactically or grammatically correct so that's this kind of like syntactic level of typing there are certain expressions within the active inference ontology or grammar that would be syntactically valid or not or would be examples of an instance or an existential claim or have these other kinds of statuses and then also there's this sort of conceptual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.759,
    "end": 3793.72,
    "text": " connection that is the semantics that separates from the strong typing of the syntax so it brings up a lot of linguistic and then also you said it's a recipe for how to do action and that is like if we were to do dynamical systems modeling of a predator prey system or of temperature in a room but then to bring in the upstairs control section can open up multiple possible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.7,
    "end": 3821.462,
    "text": " like cascading state space ramifications especially if you allow for the heading in and out of the nested system that opens up a lot of dependencies that at least need to be accounted for or just go with a special case where it's nothing other than just like a fixed situation which is kind of where the buck stops ultimately for any hyper hyper hyper prior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.809,
    "end": 3845.34,
    "text": " yeah i i like i like those reflections so i think um yeah there's a this like particles idea you know i tried to sort of capture in this very feeble way i'm not very good at drawing here like you've got this kind of nesting of systems um and i'm trying to capture that in this formalism um so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3847.025,
    "end": 3863.92,
    "text": " you could think of like these like outer the outer boundary as being like as i say your body's boundary or like the boundary of like a whole organization or society or something like that or ecosystem and then the the sort of outer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3863.9,
    "end": 3875.658,
    "text": " Like the job of the outer system is like to pass messages into the inner parts, which are like your organs or the sort of units of an organization or departments or something like that, or sort of lower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.858,
    "end": 3881.807,
    "text": "So we often think of a lower level, but like the more like smaller scale or more like interior systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3881.787,
    "end": 3909.094,
    "text": " um one thing that's not so easy is to talk about like the sort of birth and death of these things i haven't really thought much about like how systems are like created from others but i'm i'm trying to like get at least some framework for talking about like what it means to be one um before we talk about how to like split them up um you said some things about grammar um yes and i think it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.243,
    "end": 3918.896,
    "text": " I'm trying to use this very, in some sense, quite sparse mathematical grammar of category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3919.637,
    "end": 3924.924,
    "text": "But I'm trying to do so in a way that, as I say, is quite general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.004,
    "end": 3930.071,
    "text": "And it ends up being inherently a bit alien.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.132,
    "end": 3938.963,
    "text": "But I think the thing you gain from that is this ability to talk about lots of different kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3939.55,
    "end": 3951.33,
    "text": " And hopefully, this is just the beginning of this project, that we get tools and stories for how to express things in this kind of language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3952.251,
    "end": 3957.32,
    "text": "It's, I think, most suited for trying to understand complex systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.662,
    "end": 3964.191,
    "text": "So as I say, I think if you're happy with just normal active inference, then it's probably fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.673,
    "end": 3965.995,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.358,
    "end": 3971.734,
    "text": "And also I'm wearing an appropriate embroidered onion shirt on the birth and death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.372,
    "end": 3988.328,
    "text": " even though from each nucleus's or cores perspective, it is like being at the center of a bull's eye from where it is, taking another view might look more like a chocolate chip cookie or like multiple nested organs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.348,
    "end": 3995.376,
    "text": "So it's not that it's like just a bull's eye, even though that's just the two layers, that's just the motif of nesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.416,
    "end": 3999.78,
    "text": "And then when you described how the systems can be put side by side,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.76,
    "end": 4024.317,
    "text": " then you could have a situation where it's like the cookie has two chocolate chips and then the next time step there's a third one but it's disconnected so it's the island and then another kind of actor comes in and changes the wiring secondarily so one thing i wanted to i haven't really talked about at all but one thing i want to be able to talk about and it's kind of related to this question of like when the system's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.904,
    "end": 4052.987,
    "text": " dissolve into other systems or how can we see things as like uh you know a chocolate chip cookie or a bullseye or something like this um or you know how do we you know or a group of trees or a forest or something um you know this is this this thing it reduces systems and you know it's category theory so it turns systems into arrows um but really this structure like wants to be what's known as a double category so here we would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4053.322,
    "end": 4056.168,
    "text": " the arrows would be like the changes of interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4056.99,
    "end": 4061.982,
    "text": "And then we would maybe have like some other structure down here which represents another system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.623,
    "end": 4066.993,
    "text": "And then we have like what are known as squares.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4067.21,
    "end": 4080.725,
    "text": " And these squares would represent how we could see this system up here as a composite or as a different kind of system, how we could see the forest as trees or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.666,
    "end": 4086.811,
    "text": "So it allows us to represent these kinds of dissolving or these kinds of changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4086.831,
    "end": 4092.998,
    "text": "I haven't explained in detail how this works, but it's a step towards that kind of process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.957,
    "end": 4116.943,
    "text": " cool and then of course all the great juxtapositions with more topologically stable systems uh neural networks and then more like the ant nest mates okay i'll ask a question from the live chat math for wisdom wrote i wonder if it is possible to interpret it in the opposite way that the policy is the consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4119.32,
    "end": 4125.206,
    "text": " So in that speculation, what led you to see or identify one with the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.508,
    "end": 4135.176,
    "text": "Yeah, because really, I always find that the generative model encapsulates the world as I perceive it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.236,
    "end": 4137.819,
    "text": "There's nothing really that I can do to change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.519,
    "end": 4142.623,
    "text": "So the generative model is a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4143.664,
    "end": 4143.885,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4143.905,
    "end": 4147.268,
    "text": "So there's one peculiarity about this, which is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4149.627,
    "end": 4177.542,
    "text": " the key ingredient is like a system whose outputs are observations and that seems a bit weird sometimes to me and it may seem weird to people who are used to active inference where you could think of the outputs of an agent should surely be the actions but the the degenerative model i.e the the agent's beliefs about the world is a dynamical system which outputs observations so the agent receives",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4178.146,
    "end": 4182.533,
    "text": " And so that seems like the wrong way around, but it is just how the mathematics requires it to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.034,
    "end": 4203.586,
    "text": "And so this thing being so like crucial in the structure says to me that like, this is like the sort of, this is, you know, when we see, you know, active inference texts, it's often like S given O and M. So it's like conditioned on a particular kind of model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4203.686,
    "end": 4206.01,
    "text": "This gamma is M.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4206.496,
    "end": 4211.067,
    "text": " And this M doesn't typically change in active inference unless it's by some process of evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.187,
    "end": 4213.432,
    "text": "For an individual agent, this model is fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.512,
    "end": 4223.475,
    "text": "And this thing represents everything that I see, and it represents how I expect the world to change given the actions I take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.455,
    "end": 4226.52,
    "text": " And it is, in some sense, the agent's world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.02,
    "end": 4234.852,
    "text": "In active inference, the agent can't access what the real world is like, only has the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4235.273,
    "end": 4238.337,
    "text": "And so that's why I think this is like my world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.357,
    "end": 4241.582,
    "text": "This is like my conscious experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4241.883,
    "end": 4267.485,
    "text": " so what actions i take i mean maybe so maybe this includes some self-model and i think you know i'm doing planning or i think i'm you know behaving in a way that's reasoned but actually i'm just acting on instinct according to these subconscious processes i mean i don't know much about consciousness science but i think that that kind of story is possible and so this stuff seems to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4268.022,
    "end": 4280.922,
    "text": " the things that I don't necessarily directly experience in the same way that I directly experience my visual signals, but they are the things that make me like me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.322,
    "end": 4286.25,
    "text": "They are the things that provide my input to the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4286.23,
    "end": 4315.258,
    "text": " and again you know that's all like dynamics and it's maybe stuff that i observe but maybe i only observe it because it forms like an interior part of this model which might have some complex structure of the kind that i was talking about um so that's why i thought of it that way around um and of course like you know maybe there is some deliberative planning process or like you know some internal like reasoning that goes on in my conscious experience and i do have an inner monologue and often it does seem like that so i think there is some like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4315.863,
    "end": 4324.897,
    "text": " interplay between these, but possibly I think that stuff is borne out by having some complex structure in this rather than in these things that I think of as subconscious processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.379,
    "end": 4326.463,
    "text": "I don't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4327.844,
    "end": 4338.774,
    "text": " I don't experience my own Bayesian inference processes, except in the cases that they go wrong, or I have some illusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.956,
    "end": 4348.362,
    "text": "Sometimes I'm in a building that's particularly symmetrical, and I go out of a lift, and I go into one place, and I'm on the wrong side, and it all feels really weird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4348.803,
    "end": 4351.565,
    "text": "But that's not the same kind of construct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.585,
    "end": 4353.427,
    "text": "That's kind of an unusual experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4354.007,
    "end": 4355.809,
    "text": "Anyway, that's my feeling there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4356.582,
    "end": 4380.868,
    "text": " what an unusual experience I'll read from math wisdom he wrote I think that makes sense and now I understand the distinction better the generative model creates beliefs the policy creates actions but our actions are faded we are only free to choose our beliefs so our Consciousness has to do with the beliefs we take our will did I understand the distinction correctly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4382.468,
    "end": 4383.109,
    "text": " I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.209,
    "end": 4386.454,
    "text": "I think that sounds like a good good way of putting it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.474,
    "end": 4391.482,
    "text": "I mean, this is this is really just my basically this is like my answer philosophizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.502,
    "end": 4391.943,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.963,
    "end": 4396.21,
    "text": "I mean, it would be nice if this matched like, what people think is actually going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.31,
    "end": 4399.515,
    "text": "But it's just what the sort of mathematics seem to be saying to me at least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4401.993,
    "end": 4415.417,
    "text": " towards the applied side, what kinds of programming languages or approaches or open source software or methods can people use to start exploring this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4417.5,
    "end": 4419.323,
    "text": "That is a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.464,
    "end": 4423.671,
    "text": "And you know what, at the moment, that doesn't have a great answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4424.012,
    "end": 4425.334,
    "text": "The best answer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4426.377,
    "end": 4454.477,
    "text": " um for now is that i mean at least for like modeling is that in julia um the guys at the topos institute have been producing a collection of packages in the sort of milieu of their project algebraic julia which is all about representing categorical structures and um doing compositional modeling in in julia um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4455.402,
    "end": 4469.445,
    "text": " But Julia itself is not necessarily well suited to describing things, describing the world in this particular kind of compositional way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4470.226,
    "end": 4472.049,
    "text": "It has its nice compositional features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.129,
    "end": 4482.726,
    "text": "But basically, in Algebraic Julia, they've written a little sub-language in Julia itself that encodes these categorical structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4483.55,
    "end": 4502.385,
    "text": " one of the things that's quite nice about category theory is that it's very like you know it's about composition so it's very modular and it gives you a lot of things that you can change um i'll let me go back to where i talked about um systems theory right at the very beginning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4502.365,
    "end": 4503.227,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4503.247,
    "end": 4509.22,
    "text": "So, you know, I just write down this arrow and maps from like my category of interfaces to the category of categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4509.801,
    "end": 4521.387,
    "text": "And in principle, I could just, this should be like a little program which takes in which, or I just like, right, I provide it with a polynomial and it gives me back this other data structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4521.367,
    "end": 4546.125,
    "text": " um this category of systems um and then i should yeah i could i should be able to talk about morphisms between these things and i could be a map like this or make like changes to this and have my computer automatically do it um but that's just not possible with any kind of computational tools that we have right now um and i often feel that it should be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.342,
    "end": 4557.503,
    "text": " possible to do this in a way that's not necessarily, like, tied to a single programming language, like, like, algebraic Julia is to Julia, there are also like, dependently type programming languages for like proof of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.523,
    "end": 4560.008,
    "text": "But if you write in those, then you're stuck in that world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.469,
    "end": 4563.895,
    "text": "One of the things that's nice about like, the World Wide Web is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.972,
    "end": 4572.784,
    "text": " These days, you can write into lots of languages, and they get compiled to WebAssembly, and we can interact in a sort of language-agnostic way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4572.844,
    "end": 4579.234,
    "text": "And this mathematics should be language-agnostic, but we don't have any languages or tools to talk about it yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4580.216,
    "end": 4581.458,
    "text": "It's something that I think should change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.959,
    "end": 4587.267,
    "text": "People who are interested in changing it should talk to the top of people or talk to me, and I would like to see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4587.247,
    "end": 4590.936,
    "text": " I would like to see tools which are really nicely compositional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.976,
    "end": 4594.766,
    "text": "And people, as I say, the top of people that worked on it, they're building other things in Rust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.51,
    "end": 4600.159,
    "text": "Those are the best answers I know of for now, but they're not like optimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4601.422,
    "end": 4601.843,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.103,
    "end": 4605.167,
    "text": "Well, it's an optimal agenda, so that's very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.387,
    "end": 4617.061,
    "text": "And to be able to connect even potentially in the coming months between the algebraic Julia and rxinferred.jl could already offer some cool opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.201,
    "end": 4619.905,
    "text": "Yes, I think that would be a great project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.626,
    "end": 4621.827,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.308,
    "end": 4639.478,
    "text": " Over the last years, like working on this from your dissertation, which we discussed in the live stream 54 series, all the other fun and learnings that we've had, how have you seen like the process of going about that recipe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.458,
    "end": 4668.503,
    "text": " evolve from like the chapter six in the 2020 textbook how do you feel like as more and more of the applied category theory developments are formalized and then also like operationalized how is that trajectory of like what it looks like to apply active inference yeah i think it's it's been very interesting and very exciting i would say for a long time i i was also like quite i guess relatively confused about things um in some way and this is a thing that this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.854,
    "end": 4687.842,
    "text": " um something that i haven't yet been able to resolve uh and and i'm sure some people know how it could be resolved um but i'm just not yet one of them which is that active inference has come out of the sort of free energy principle world where the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4688.75,
    "end": 4712.209,
    "text": " idea is that actions are selected in like the same kind of way that you do perceptual inference by like minimizing surprise or free energy um but the sort of formal yeah so the formal structure of uh like pure perceptual inference is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4712.982,
    "end": 4731.582,
    "text": " it has a similar feeling right so it has something that goes from like effectively like inside to outside and then something that like goes back this is like the thing that does prediction or and then this is the thing that like does you know inference um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.587,
    "end": 4742.137,
    "text": " And so the structure of these two things, by no surprise, obviously, has this similar bidirectional feel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.539,
    "end": 4744.626,
    "text": "But I haven't yet shown that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.18,
    "end": 4763.88,
    "text": " this action selection process is exactly of the same type as basic inference for perception and I would like it to be it's it's kind of frustrating to me that so I thought for a long time how do I get action when I was writing my thesis how do I get action into this um and that's what this project really has been about it's like getting action into the story finally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.86,
    "end": 4767.504,
    "text": " But the relationship between them isn't as neat as I would like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4767.744,
    "end": 4778.936,
    "text": "And so if anybody wants to talk about that, I'm always interested in trying to show that action selection really is a kind of surprise minimization or approximate inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.596,
    "end": 4782.94,
    "text": "So far, it's only kind of vaguely in the structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4782.98,
    "end": 4790.948,
    "text": "And this reminds me of something that I wanted to say in response to your remarks when I just finished, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4792.126,
    "end": 4815.4,
    "text": " that i've said here roughly like the data of an active inference there's like a hierarchical active inference system it has these components it's got like a likelihood model a transition model uh you know policy thing a state inference thing and you know maybe it's got this like generative process part and this action prior part as well um but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4815.886,
    "end": 4836.291,
    "text": " this is all just structure this is structured active inference this is all just about structure none of this yet is about like how you actually choose this likelihood or how do you actually do like action selection or how do you actually do state inference um the stuff that i was doing in the work that i was doing in my thesis was about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4836.271,
    "end": 4847.496,
    "text": " various different ways that we actually do inference like particularly um inference in the brain using the variational inference under the laplace approximation um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4848.353,
    "end": 4873.247,
    "text": " but what one what well like what i want at least is to say that active inference or a particular flavor of active inference is like in some sense universal and that means that there is like a canonical choice for a given system so like we assume that somebody comes along and gives you the data of your generative model it could be you daniel or it could be like evolution science or something like that and then it says okay well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.632,
    "end": 4899.505,
    "text": " active inference says there's a canonical way of choosing actions that is like as optimal as you can be and there's a canonical way of doing inference that is as optimal as you can be and this story that I've told doesn't is agnostic to that um I'm you know a lot of people have spent time saying here are proposals um this framework although being agnostic allows you to state like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.839,
    "end": 4902.483,
    "text": " what are known in category theory as universal properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4902.563,
    "end": 4910.797,
    "text": "And so those are ways of saying that this is, in some sense, canonical or optimal in some mathematically precise way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4910.837,
    "end": 4919.612,
    "text": "And it would be nice to have those stories about the universality of active inference, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4919.632,
    "end": 4925.982,
    "text": "the ways of spelling out these functions, to be expressed in that language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4926.974,
    "end": 4929.767,
    "text": " So yeah, that's my answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4929.787,
    "end": 4930.269,
    "text": "Two answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.711,
    "end": 4935.432,
    "text": "One was about this annoying thing with inference and here about the universality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.39,
    "end": 4960.812,
    "text": " yeah there's so much to go into and you mentioned like dual a lot and the interface can be seen it's like two onions where you could peel off the interface and associate it with one but that would be a symmetry break because you could also see it as being peeled off with the other because it's an interface and this gets into like systems engineering what what is the interface and uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.192,
    "end": 4984.858,
    "text": " it's very interesting topic so i'll see if anyone else has any final questions like what are your next steps on the research how do you see it being applied and continued okay right so my next steps are really to produce a longer or more detailed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.142,
    "end": 4988.487,
    "text": " paper about this than the abstract that is available at the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4989.308,
    "end": 4999.122,
    "text": "In particular, the abstract that's available at the moment, it doesn't really spell out some of this stuff in particularly nice detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5000.444,
    "end": 5009.057,
    "text": "To keep things as simple as I could, I didn't really explain how you can have this kind of mode-dependent transition model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5009.037,
    "end": 5027.434,
    "text": " as as that that is stochastic as well as having uh likelihoods that are stochastic for technical reasons it's a lot easier if you just have the outputs of your systems be deterministic this notation right like some with a sampling is is not something that is um I I think um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5028.308,
    "end": 5029.67,
    "text": " canonical or widely known.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5029.71,
    "end": 5030.852,
    "text": "So I'd have to spell that out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5030.872,
    "end": 5033.335,
    "text": "So there are lots of like mathematical details, but that's like the first thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.996,
    "end": 5045.153,
    "text": "And the second thing I think is to get people using this framework, actually talking about building complex systems or actually building tools for building complex systems using it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5045.133,
    "end": 5067.158,
    "text": " um and relating those to you know the the tools that people already use for doing that kind of thing like um pine dp or just like you said daniel rx and um it would be great to like actually turn this into something that people can use rather than just a mathematical theory i like this although it's kind of um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5067.897,
    "end": 5074.428,
    "text": " Often people think it's quite an alien language because it's unfamiliar, but it is in some ways quite ergonomic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5074.468,
    "end": 5081.7,
    "text": "It is quite demanding because to prove that something is an index category, you have to check all of these annoying conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5081.8,
    "end": 5084.404,
    "text": "And by God, they are often really, really annoying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5085.059,
    "end": 5095.373,
    "text": " I would love, as a test case for this, to build an artificial proof assistant or system that can help me do these checks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5095.833,
    "end": 5103.143,
    "text": "Because as I said, doing policies like action selection is very much like choosing a series of morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.684,
    "end": 5107.91,
    "text": "And it's well known in mathematics that proof is also choosing a series of morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.93,
    "end": 5113.497,
    "text": "So I'm pretty sure that we can use this for doing things like proof in a way that's nicer than large language models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5113.477,
    "end": 5122.929,
    "text": " So once we've got tools, I want to actually start applying them to things, complicated structured models that are probably beyond the systems that we have right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5124.411,
    "end": 5126.494,
    "text": "Okay, the Toby signal has gone out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.834,
    "end": 5130.399,
    "text": "I'll ask one more question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5130.419,
    "end": 5138.509,
    "text": "Math for Wisdom wrote, Toby, it sounds like you want to set up a free functor, so that suggests considering the adjoint functor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.81,
    "end": 5140.232,
    "text": "What is it that you want to forget?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5140.833,
    "end": 5142.775,
    "text": "If you could define a functor...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5143.025,
    "end": 5151.739,
    "text": " what he wants to forget, then mathematically that could yield the functor that freely optimally constructs the canonical way to choose the action or do the inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.244,
    "end": 5155.526,
    "text": "Yeah, what do I want to forget?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5155.546,
    "end": 5159.312,
    "text": "In some sense, what I want to forget is, like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5160.001,
    "end": 5163.665,
    "text": " all the stuff that I might have learned that confuses me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5165.387,
    "end": 5172.294,
    "text": "But the thing is, it's very hard to distinguish the stuff that is confusing from the stuff that is not confusing until you've done all the work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5172.675,
    "end": 5179.062,
    "text": "So it may be the case that you have to construct that adjoint in order to see that you've got the forgetful funct in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5179.983,
    "end": 5182.125,
    "text": "And that's, unfortunately, I think the situation that I'm in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5182.686,
    "end": 5188.472,
    "text": "A lot of this process, I think, has really been about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.756,
    "end": 5207.153,
    "text": " figuring out the essence of these systems like in before it was like approximate inference in the brain and here it's like the essence sort of the structure of active inference really distilling it down into something quite abstract",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5208.23,
    "end": 5230.343,
    "text": " And really, just to say something about forgetful functions, this arrow here that goes from agents, the category of agents, which has these bidirectional gelatin model policy things as its morphisms, and just goes down to systems, this is a forgetful function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5230.724,
    "end": 5233.748,
    "text": "It forgets the controller, the thing that is the policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5233.913,
    "end": 5263.043,
    "text": " and um possibly hopefully the the way to see active inference is universal is to say that it's like um adjoint in a particular way or at least it has like at least it is a section we would say of this thing um so yeah it's true what i'm trying to do is find out what those adjoints are um but it's it's hard to know what to forget until you've forgotten it and then it's gone",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5265.925,
    "end": 5292.996,
    "text": " don't know what you got till it's gone then there's the reconstructed pretty much the reconstructed trace and our niche is becoming increasingly capable from a perception and action standpoint which is bringing up so many fascinating topics so do you have any final comments not today i'm sure there'll be other opportunities down there i hope so at least",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5293.988,
    "end": 5294.429,
    "text": " I do too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5294.449,
    "end": 5295.43,
    "text": "It's been a pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.45,
    "end": 5295.951,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.231,
    "end": 5296.872,
    "text": "Thank you, Toby.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.912,
    "end": 5298.535,
    "text": "This was an awesome presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5298.595,
    "end": 5304.082,
    "text": "It's like big structural evolution and development in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5304.323,
    "end": 5318.443,
    "text": "And so there's so many pieces for people to pick up and work in all ways, developing like the background needed to get to some of these cliffs and then the better structures to jump off them with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5319.537,
    "end": 5324.767,
    "text": " Yeah, please, everybody, get in touch if you have questions or projects in mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5324.787,
    "end": 5325.729,
    "text": "I'm always interested to hear them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5326.511,
    "end": 5335.588,
    "text": "Cool, and I hope that we can reactivate some category theory act-inf in the RxInfer project or just in some other standalone project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5335.649,
    "end": 5336.37,
    "text": "I'm sure it'll happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5336.45,
    "end": 5337.632,
    "text": "So thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5337.733,
    "end": 5337.933,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5338.795,
    "end": 5339.336,
    "text": "Peace, Toby.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5339.416,
    "end": 5341.24,
    "text": "Thanks, everybody, in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5341.26,
    "end": 5342.001,
    "text": "Cheers.",
    "speaker": "SPEAKER_00"
  }
]