[
  {
    "start": 3.17,
    "end": 3.49,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3.851,
    "end": 4.412,
    "text": "Greetings, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.432,
    "end": 5.193,
    "text": "Thanks for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.233,
    "end": 13.325,
    "text": "It is August 15th, and we're in our final discussion, recorded discussion for cohort three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.345,
    "end": 19.415,
    "text": "Next week, we'll have a kind of unrecorded discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.975,
    "end": 25.564,
    "text": "Also, this will be the day of the symposium, so a very auspicious day to have been concluded upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.746,
    "end": 30.051,
    "text": "But today we're going to talk about 10 and probably anything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.293,
    "end": 31.573,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.422,
    "end": 40.089,
    "text": " Alia and Neil want to leave with anything or and or we can go to Esmail's question first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.237,
    "end": 54.388,
    "text": "I quickly put in the last three questions, but we can I think we can get through those so we can start with Esmail's.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.215,
    "end": 66.876,
    "text": " All right, I'll just read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.637,
    "end": 70.401,
    "text": "Then happy to hear anyone's thoughts or more details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.421,
    "end": 70.581,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.142,
    "end": 74.146,
    "text": "Since I believe in Occam's razor, I denied the meaning of awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.706,
    "end": 78.832,
    "text": "My suggestion is accessible cognition and inaccessible cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.733,
    "end": 88.064,
    "text": "It looks like we have an operating system and implicit memory that's not available, such as the procedural memory and emotional memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.865,
    "end": 92.29,
    "text": "I have some doubts about the rest of the words like consciousness and awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.957,
    "end": 101.031,
    "text": " And this is about the question, the opening quotation of the chapter, beginning of the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.752,
    "end": 104.097,
    "text": "In general, we are at least aware of what our minds do best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.886,
    "end": 109.808,
    "text": "Neil or Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.958,
    "end": 116.1,
    "text": "The way that touches on my",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.452,
    "end": 121.918,
    "text": " my last question, which was what is sentient about active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 123.099,
    "end": 128.985,
    "text": "It's put in the chapter title, what I've suggested as a teaser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.606,
    "end": 131.428,
    "text": "The chapter's really just summarising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.112,
    "end": 142.219,
    "text": "It doesn't really say anything about consciousness, I don't think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.942,
    "end": 145.783,
    "text": "Well, Carla's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.725,
    "end": 161.259,
    "text": " or seems to be getting more involved in discussions of consciousness, but I think he always maintains a distance between that and works with people who are concerned with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.419,
    "end": 172.75,
    "text": "But it's more something where active inference is a framework for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.236,
    "end": 185.03,
    "text": " Well, to help people who are looking at sentence and consciousness, but doesn't really say anything specifically about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.632,
    "end": 188.314,
    "text": "And that's how it seems to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.306,
    "end": 199.767,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.97,
    "end": 204.512,
    "text": " Ali, you want to add anything on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.076,
    "end": 207.576,
    "text": "Well, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.777,
    "end": 226.322,
    "text": "As far as I know, sentience in active inference literature is used in a rather technical sense in which sentient beings are just... They're the beings that are responsive to the external stimuli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 226.883,
    "end": 228.285,
    "text": "So that's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.822,
    "end": 230.043,
    "text": " as simple as it gets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.904,
    "end": 241.395,
    "text": "Uh, and, uh, because of its simplicity, uh, it, uh, encompasses a whole array of things as being sentient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.415,
    "end": 253.767,
    "text": "And, uh, it's not necessarily, uh, restricted to biological sentience or, uh, I don't know, uh, any thing akin to, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 254.27,
    "end": 258.418,
    "text": " to the level of human intelligence or human sentience and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 258.498,
    "end": 277.273,
    "text": "So it can basically be applied to include artificial sentience and everything, even virtual sentience, such as, I don't know, the kind of thing that's just been implemented algorithmically in software and stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 277.591,
    "end": 284.762,
    "text": " It was a subject of a rather heated debate a few months ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.782,
    "end": 301.928,
    "text": "I mean, the meaning of the sentience is used in active inference literature, but in all honesty, it's not a novel use either because the same very definition of sentience that's used in active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 301.908,
    "end": 309.581,
    "text": " is almost exactly the same as one of the definitions from Oxford English Dictionary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.601,
    "end": 313.207,
    "text": "So it's not as controversial as it seems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.908,
    "end": 324.085,
    "text": "But about the other terms, such as awareness and consciousness, well, I don't believe we have any sort of consensus around",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 324.436,
    "end": 327.381,
    "text": " those words yet in active inference literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.401,
    "end": 348.199,
    "text": "Although, in recent papers around MUM or MUM model of active inference, Maxwell and others are trying to converge a consensus on the word on the notion of consciousness in terms of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 365.189,
    "end": 382.187,
    "text": " Yeah, what great topics, and also how cool with Chapter 10, published about a year and a half ago, maybe written in the months leading up to one and a half years ago, how there are certain similarities and continuations of the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.207,
    "end": 382.307,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.714,
    "end": 392.277,
    "text": "Neil, I really like the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.003,
    "end": 403.106,
    "text": " the point about how active inference stays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.548,
    "end": 408.223,
    "text": "It's unopinionated to the extent that it's composable as a describing system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.975,
    "end": 435.983,
    "text": " those properties are kind of like con convex concave and there's a lot to say probably about why certain uh expectations are around certain kinds of x of accounts scientific accounts or just certain kinds of rhetorical accounts like why that why some are some way and some are not that's the that's the active inference for the social sciences um but that's the whole thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.683,
    "end": 467.539,
    "text": " having the descriptive framework cartography compositional cognitive cartography as per the category theory work and and that whole area especially coming into play and the mechanics and the dynamics it's like newtonian mechanics whatever you say about it within the system it doesn't have a preference for something moving left or right or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.519,
    "end": 488.025,
    "text": " up or down or something like that that's just a bizarre feature to bake into a measurement framework so when we look at act emphasis it really is presented in this textbook whether as a behavioral researcher like the figure 9.2 metabasian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.22,
    "end": 517.455,
    "text": " So whether we approach it from this kind of like classical behavioral researcher or just researchers perspective, or we approach it from the constructive perspective with chapter six and all of that, from six or from nine, science and engineering, eventually, maybe it'll come to be seen as an account of the cartography.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.735,
    "end": 523.207,
    "text": " So, hence that divergence with how the book lands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.227,
    "end": 524.49,
    "text": "Of course, this isn't apologetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.55,
    "end": 526.796,
    "text": "It's not to say that there's like a perfect text or anything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.638,
    "end": 529.283,
    "text": "But I think that's kind of the area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.383,
    "end": 531.508,
    "text": "I know it's a bunch of random thoughts, but it's chapter 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.29,
    "end": 535.579,
    "text": "These are the funny things about the book that we only really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.386,
    "end": 551.273,
    "text": " come into relation with when we really stay in the game and and compare how it actually was so we can look at some specific parts of 10 with the kinds of perspectives that that people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.738,
    "end": 562.311,
    "text": " mobilized today based upon, for example, only in the last few days, different experimental studies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.653,
    "end": 564.775,
    "text": "I'll bring in one link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.135,
    "end": 569.601,
    "text": "Just as an example, of course, only for educational use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.584,
    "end": 572.565,
    "text": "This LinkedIn post.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.449,
    "end": 577.212,
    "text": "Friston's AI law is proven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.773,
    "end": 579.555,
    "text": "FEP explains how neurons learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.096,
    "end": 604.378,
    "text": " anonymized to protect the innocent um for instance or everyone's slash no one's ai law proven is explains how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.037,
    "end": 623.231,
    "text": " And if you think about this in light of how we've been thinking about then and now, how does this new artifact from today seem to you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.877,
    "end": 628.818,
    "text": "Yes, Ali.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.221,
    "end": 638.01,
    "text": "Well, actually, I haven't read the article in its entirety, but from what I've seen,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.172,
    "end": 668.892,
    "text": " It's not fundamentally different from the previous work done in establishing a kind of empirical basis for active inference, but I'm not sure why it gained so much attention now, because to my mind, it's just a continuation of the previous work done by the same group of authors in establishing these kinds of empirical basis for active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 669.327,
    "end": 692.924,
    "text": " I can understand that it can seem as a kind of culmination of this trajectory of this line of research, but I'm not sure if there's something fundamentally new or, I don't know, unprecedented explored in this recent paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 694.486,
    "end": 697.731,
    "text": "It's a kind of, I mean,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 698.285,
    "end": 703.552,
    "text": " as I said, a culmination of all the previous efforts done in this area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 704.353,
    "end": 712.142,
    "text": "But on the other hand, of course, because it's published in Nature, it would attract lots of media attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 712.503,
    "end": 727.161,
    "text": "And as we've seen in the past few days on Twitter or, I don't know, X or anything, it's kind of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 727.647,
    "end": 752.794,
    "text": " You know, I'm not saying it's kind of, it's reached the level of hyperbole or something, but again, I'm not sure if it's quite beneficiary for active inference literature, if these kinds of, I mean, this kind of news",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 753.061,
    "end": 755.904,
    "text": " gets out of proportion and, uh, delivers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.805,
    "end": 760.409,
    "text": "I mean, it, it wouldn't be able to deliver as much as it promises.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 761.33,
    "end": 772.523,
    "text": "Uh, so, uh, as a case in point that Denise holds, uh, image here seems to me a little bit out of proportion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 773.544,
    "end": 782.815,
    "text": "I don't know what you think, but, um, maybe it's just my personal opinion that it's always better to be, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.655,
    "end": 790.509,
    "text": " to keep some restraint about these things and let everything loose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.194,
    "end": 799.707,
    "text": "Because it can have dire consequences for any future",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.923,
    "end": 811.056,
    "text": " research if it doesn't get what it promises or it doesn't deliver what it promises or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.257,
    "end": 817.404,
    "text": "So that's just my personal opinion on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 817.424,
    "end": 818.245,
    "text": "Excellent, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.447,
    "end": 821.029,
    "text": "Very measured, very diplomatic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.95,
    "end": 822.23,
    "text": "Neil?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.073,
    "end": 828.057,
    "text": "Yeah, I'm only just looking at the article now and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.112,
    "end": 834.058,
    "text": " Yeah, you got anything to add?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 834.078,
    "end": 845.714,
    "text": "I'll just bring in one other cultural artifact that, like, back in the game, I just remember being like, again, everything, everyone's base optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.734,
    "end": 848.498,
    "text": "So it's, I'm not saying I would have done anything differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.518,
    "end": 849.82,
    "text": "I'm not saying anything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.92,
    "end": 855.748,
    "text": "I just want to point to these historical image meme and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.361,
    "end": 866.214,
    "text": " This was the year that the alias interview with Martin Fortier and Carl had been, well, all you need is the title.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.556,
    "end": 868.758,
    "text": "But what else a funny thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.8,
    "end": 874.948,
    "text": "I just thought, okay, I know that it's, the article is not ever defined by the headline, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.71,
    "end": 877.633,
    "text": "Genius neuroscientists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.653,
    "end": 879.376,
    "text": "So, okay, speculative, but singular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.436,
    "end": 883.322,
    "text": "And then the generality of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.939,
    "end": 910.575,
    "text": " connected to the requirement to understand a specific mind which i think's the same um cognitive associativity between like nate that's a whole markov blanket laplace approximation natoni mechanics like that we always talk about so that's my first take is just like okay well yeah he may work here or there but um also stanford doesn't say that it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.939,
    "end": 936.141,
    "text": " gordon's law of collective behavior but also there's a lot of different norms around communication and another adjacency to kind of explore too based upon how we're talking about actinth like to say the least as at least instrumental and realist but also as i again um all of you have brought up in previous discussions like there's so many other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.121,
    "end": 959.665,
    "text": " uh perspectives interpretation so if a statistical paper came out some gene expression study from 1992 or some uh height blood pressure risk related study Pearson's regression law is proven linear regression explains how something happens",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.636,
    "end": 965.74,
    "text": " That's also playing into this kind of like scientific positivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.921,
    "end": 971.606,
    "text": "Again, not necessarily the place for the whole falsificationism of science disproves, doesn't prove.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.187,
    "end": 977.011,
    "text": "But to see, here's the, what does science do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.052,
    "end": 979.373,
    "text": "How is science related to law?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.775,
    "end": 981.856,
    "text": "Whose ideas are whom's?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.457,
    "end": 985.299,
    "text": "What acronyms do you already have to know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.339,
    "end": 991.305,
    "text": "An account of a natural process legitimizing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.804,
    "end": 1000.738,
    "text": " or endorsing even applications of some similar technical method in a different setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.505,
    "end": 1012.399,
    "text": "A lot of rich image meme and media fun ahead of us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.674,
    "end": 1026.456,
    "text": " and just throwing in memes the lk99 i i don't even know but what if uh someone's like this is a uh you know room temperature super cognitive process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.355,
    "end": 1039.708,
    "text": " Actually, LK99 was exactly what I had in mind when I talked about promising something that can be delivered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.51,
    "end": 1041.65,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.351,
    "end": 1043.873,
    "text": "Again, there's so much more to say on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.214,
    "end": 1047.698,
    "text": "Just the complex consequences of different regimes of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.719,
    "end": 1053.465,
    "text": "It's so, so much more complex than good or bad or for whom or over what time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.887,
    "end": 1058.772,
    "text": "And surfing the 100-foot wave...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.752,
    "end": 1068.927,
    "text": " with popularization and also connecting people, like just to be explicit, to come to the textbook group and to volunteer, be an intern at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1070.589,
    "end": 1078.52,
    "text": "Then there's an actionable path from going from like being enthralled by a podcast to working in that tradition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.58,
    "end": 1084.569,
    "text": "So it's all happening in the ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.631,
    "end": 1086.632,
    "text": "And we're just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.709,
    "end": 1094.64,
    "text": " seeing it how we see it from the few of us who are here just in this slash any given moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.674,
    "end": 1105.819,
    "text": "All right, Neil, which one of your questions do you think is most relevant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.512,
    "end": 1115.422,
    "text": " Perhaps the most controversial one is how important is the theory of free energy minimisation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1115.903,
    "end": 1117.786,
    "text": "So we could do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.209,
    "end": 1122.935,
    "text": "Really, this is a question of qualitative versus quantitative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1125.119,
    "end": 1128.325,
    "text": "The notion of free energy is very quantitative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.346,
    "end": 1134.996,
    "text": "But how essential is it...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1136.258,
    "end": 1143.232,
    "text": " It's a way of formalising and computing something so useful from an engineering perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.234,
    "end": 1148.563,
    "text": "But isn't it just enough to say, well, the brain is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.657,
    "end": 1170.535,
    "text": " A load of neurons in the brains are working in a self-organising fashion with some, to use Feynman's phrase, a ratchet and pull mechanism to always be, or to be moving gradually towards a better solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.515,
    "end": 1187.73,
    "text": " So then we have this quantity-free energy that's incomputable, effectively, that we can say, well, that's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.71,
    "end": 1211.862,
    "text": " a macroscopic um quantity but it's it's it doesn't get used anything in any way um as as it does in some machine learning algorithms it's uh so i think i say it's purely epiphenomenal it doesn't it doesn't actually do anything other than well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.107,
    "end": 1216.451,
    "text": " to help understand what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.494,
    "end": 1237.157,
    "text": "So how important is that whole quantitative side of things to all of the qualitative aspects of active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.485,
    "end": 1275.396,
    "text": " so implicit is is my my thought that it isn't uh it isn't essential yeah this is a very interesting question it's a very JF cloudier type point like how different can it be than outside in variational bays",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.798,
    "end": 1287.01,
    "text": " contrasted with JF's constructed Lego symbolic implementation with no equations, no variational updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.29,
    "end": 1290.333,
    "text": "So I think that's a really important area to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.413,
    "end": 1291.354,
    "text": "Ali, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.918,
    "end": 1303.847,
    "text": "Well, actually, looking at active inference framework, I mean, superficially, we can...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.131,
    "end": 1306.716,
    "text": " we can see lots of similarities and even",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.118,
    "end": 1321.859,
    "text": " I don't know, probably some identical conceptual components with some other frameworks such as predictive processing and predictive coding and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1322.64,
    "end": 1334.577,
    "text": "But in my opinion, the main difference of active inference, one of the main difference of active inference from other related frameworks is exactly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1334.894,
    "end": 1337.737,
    "text": " what FEP enables active inference to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.797,
    "end": 1346.004,
    "text": "Namely, it puts the optimization of surprise as the main character of the whole scenario.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1346.584,
    "end": 1364.04,
    "text": "So you see, this is the novel perspective of active inference as compared to all the other frameworks, because of course, in all the other perspectives, we have the notions of, I don't know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1364.392,
    "end": 1379.61,
    "text": " anticipating actions and so on and basing some decision making to basing the decision making on the prediction and anticipate the anticipation of actions and also perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1380.231,
    "end": 1390.483,
    "text": "But I mean, the way FEP reframes this whole scenario, and as I said, puts the surprise optimization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.902,
    "end": 1397.952,
    "text": " to the forefront as the main character, makes it much more elegant on one hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.613,
    "end": 1404.101,
    "text": "And on the other, it makes it much more broader than all the other frameworks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.121,
    "end": 1412.573,
    "text": "Because we know that predictive coding and predictive processing, they're mainly restricted to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1412.62,
    "end": 1417.528,
    "text": " biological intelligence or biological, I don't know, cognition and whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1418.209,
    "end": 1433.633,
    "text": "But we know from at least 2019 that the same mathematical technology can be applied to a whole range, a whole array of ontological entities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1433.95,
    "end": 1441.657,
    "text": " and it's not fundamentally restricted to biological sentience or intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1442.338,
    "end": 1454.268,
    "text": "So this is the key reframing and the key novel perspective that FEP provides to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.288,
    "end": 1463.957,
    "text": "And if you look at it, I mean, these kinds of fundamental reframings",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1464.207,
    "end": 1469.762,
    "text": " and somehow pivoting the whole structure of scientific research",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.13,
    "end": 1483.763,
    "text": " theory based on just a single reframing of an essential component is something that can be witnessed throughout the whole history of science time and time again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1484.284,
    "end": 1499.378,
    "text": "And some of the most profound insights that's been gained throughout the entire history of modern science, they've been gained from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1499.358,
    "end": 1514.036,
    "text": " this exact mechanism of changing the perspective based on some redefinition and some reconceptualization of the established facts and established theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.597,
    "end": 1523.728,
    "text": "So in that sense, active inference and its underlying FEP",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.839,
    "end": 1535.857,
    "text": " to my opinion, can be seen as, I mean, it's comparable to all of these quote-unquote revolutionary scientific theories in that regard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1543.269,
    "end": 1543.93,
    "text": "Bravo, Lee.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.01,
    "end": 1544.451,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.713,
    "end": 1546.894,
    "text": "Great chapter 10-ism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.998,
    "end": 1550.34,
    "text": "Super, super well said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.312,
    "end": 1564.415,
    "text": " I think this helps differentiate us again while we're in chapter 10, which is essentially doing this exact work, wrapping up and connecting non-technically without figures, just connecting the dots, 10.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.357,
    "end": 1569.905,
    "text": "It also connects us to the cybernetics side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.925,
    "end": 1574.995,
    "text": "It's non-contentious that cybernetics systems can be modeled input-output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.975,
    "end": 1604.593,
    "text": " it's also non-contentious to do multi-agent simulation and then coming from whether just a pure pragmatic perspective in a finite world or increasingly from the holographic approach and the chris fields physics is information processing physics of boundaries information processing and thermodynamics and boundaries also kind of converging on a multi-agent thermo informational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.573,
    "end": 1606.537,
    "text": " input output framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.9,
    "end": 1615.796,
    "text": "And when we're talking pedagogically, sometimes it could be like, well, it's like input output, but you could have like just an oscillator, like just a sine wave or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.417,
    "end": 1622.329,
    "text": "Now, also, I'm sure the sine wave can be understood as doing the path release action, all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.17,
    "end": 1626.737,
    "text": " That is the generality of the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.757,
    "end": 1644.57,
    "text": "And it really does pivot or have a fulcrum, as you described, Ali, as the actual centering of surprisal in principle, in literally in principle, and in fact slash practice slash deed, the tractable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.922,
    "end": 1657.504,
    "text": " bounded, probably approximately correct, bounded rationality, in this situation, variational Bayesian mechanics, but quantum hardware software could be used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.226,
    "end": 1666.761,
    "text": "Surely other kinds of computational computations can be used, but the centering of surprisal in principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.741,
    "end": 1677.138,
    "text": " with the bounded approximation of surprisal, with all of the work of the bounded surprisal being bounded surprisal about a given model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.959,
    "end": 1684.711,
    "text": "Can't talk generally about the L2 norm for some cohort of linear regressions you haven't named yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.991,
    "end": 1687.515,
    "text": "That's just not enough information to say further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.617,
    "end": 1693.525,
    "text": "So the theory takes an essential normative approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.905,
    "end": 1705.337,
    "text": " focus on surprisal minimization and therefore bridging to the practice with a tractable, optimizable balance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.718,
    "end": 1710.262,
    "text": " So no contention with other cybernetics frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.083,
    "end": 1713.807,
    "text": "They want to explain observables as a loss function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.827,
    "end": 1714.407,
    "text": "That's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.427,
    "end": 1717.131,
    "text": "Perceptual control theory, RL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.551,
    "end": 1722.117,
    "text": "They want to have structured or unstructured or fixed or dynamic cognitive architectures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.378,
    "end": 1725.0,
    "text": "Also all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.06,
    "end": 1732.489,
    "text": "They want to include action and sense-making and logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.553,
    "end": 1737.821,
    "text": " use a variational autoencoder or a variational Bayesian modeling imperative specifically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.841,
    "end": 1741.667,
    "text": "That's an interesting gray zone question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.747,
    "end": 1743.109,
    "text": "Is that implicit FEP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.03,
    "end": 1749.178,
    "text": "If it's literally already providing a particular partitioned example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.867,
    "end": 1752.81,
    "text": " That would be very interesting, dark FEP literature search.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.911,
    "end": 1763.52,
    "text": "But it's actually those works, which arguably are used every day in terms of statistics, algorithms, by reframing the scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.1,
    "end": 1771.327,
    "text": "It's like, hey, we don't have to reduce uncertainty slash bound uncertainty slash maximize model evidence on the reward function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.748,
    "end": 1776.752,
    "text": "Turn the surprisal bounding on itself purely statistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.774,
    "end": 1786.564,
    "text": " That doesn't mean it's going to be perfect because first there's the information computation bounds, Chris Fields, Wolfram, all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1788.486,
    "end": 1796.756,
    "text": "And then just practically your implementation is going to be like, just realistically put together by you and however you actually put it together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.098,
    "end": 1802.824,
    "text": "So are you talking about in principle, like exploring blueprints for buildings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.542,
    "end": 1828.626,
    "text": " discussing very broadly maybe even usefully over broad possible buildings in principle without even wondering if they can be built or anything like that or are we really in the game talking about motor disorders in this context of this situation very very different waters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.125,
    "end": 1847.425,
    "text": " FEP and ACT-INF though, it can be assured as far as we believe that there is a fundamental relationship that seemingly we learn more about, brings in more pieces because it's a pretty common",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.48,
    "end": 1876.787,
    "text": " useful as well as converged upon forest utility already enabling a lot of the shorter term work to be scholarly and of course all pending etc etc etc but that's as ali has pointed out as they call it the structure of scientific revolutions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.079,
    "end": 1884.752,
    "text": " And so in that way, that's an interesting and provocative area to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.743,
    "end": 1890.004,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.251,
    "end": 1897.02,
    "text": "Also on a related point and getting back to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1897.355,
    "end": 1904.971,
    "text": " the previous discussion we had about the nature of consciousness, sentience, awareness, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1905.873,
    "end": 1915.013,
    "text": "So, Philip Paul has this recent book called The Book of Minds, which is a 500-page tome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1915.835,
    "end": 1916.055,
    "text": "But",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.288,
    "end": 1920.555,
    "text": " He recently gave a talk to the Royal Institution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.575,
    "end": 1925.885,
    "text": "It's titled, let me see, it's What is a Mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.866,
    "end": 1938.246,
    "text": "So in this talk, he concentrates on just one chapter of this whole book, namely the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.226,
    "end": 1944.061,
    "text": " the space of possible minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1944.642,
    "end": 1948.472,
    "text": "So more often than not, we think of all of these,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.431,
    "end": 1961.474,
    "text": " concepts related to mind, such as intelligence, agency, sentience, and so on, as a kind of one-dimensional spectrum, one-dimensional continuum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1961.494,
    "end": 1969.549,
    "text": "But Philip Ball here shows that it would probably be more...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.204,
    "end": 1977.895,
    "text": " I mean, uh, conducive to further, uh, development, uh, the development of further, uh, future theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1978.536,
    "end": 1993.519,
    "text": "If we conceive, uh, of a kind of multidimensional space of possible minds, uh, which can have, um, uh, the access such as agency experience, intelligence, and consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1994.14,
    "end": 1995.722,
    "text": "And, uh, it, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.462,
    "end": 2000.477,
    "text": " it draws a kind of multidimensional space such as this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2001.099,
    "end": 2004.953,
    "text": "And I was thinking active inference can actually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2005.878,
    "end": 2031.845,
    "text": " provide sufficient tools to traverse this whole space of possible minds if one tries to put all of these different axes related to one of the key trade-offs that unfolds through the central equations of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.865,
    "end": 2033.927,
    "text": "So basically,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2034.177,
    "end": 2058.936,
    "text": " I was thinking that probably or perhaps the central equations of active inference can be used as a kind of mathematical tool to traverse this whole possible by using all the trade-offs that we've seen throughout the whole book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2058.916,
    "end": 2064.402,
    "text": " such as explore-exploit phenomena or other kinds of dilemmas that we've seen before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2065.043,
    "end": 2083.422,
    "text": "So yeah, I just wanted to share this connection with you because I believe there can be some potential interesting connections between these two theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2085.241,
    "end": 2086.002,
    "text": " That's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.402,
    "end": 2088.465,
    "text": "Another kind of recent connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.485,
    "end": 2094.531,
    "text": "I was just listening to a little of this machine learning street talk with Stephen Wolfram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.272,
    "end": 2099.237,
    "text": "And he starts talking about, yes, the Rulliad and all the other work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.257,
    "end": 2102.34,
    "text": "And it's really also impressive how much he condenses it and how much they progressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.501,
    "end": 2107.766,
    "text": "And then he's like talking about a physics of the observer and a framework for observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2107.806,
    "end": 2108.667,
    "text": "And I was just like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.553,
    "end": 2118.448,
    "text": " That's where we need to kind of like direct timestamps, clear ontologically structured rhetoric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.574,
    "end": 2126.725,
    "text": "I mean, we're in the farmer's market phase still overall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.827,
    "end": 2131.093,
    "text": "And how far away is it really from...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.693,
    "end": 2151.495,
    "text": " processing and analyzing on one branch, processing and analyzing speech to develop appropriate paths and wayfinding and guiding and all of that, even if it's Stephen Wolfram, giving him the most informative on-ramps, just like we would for anyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.475,
    "end": 2176.048,
    "text": " on the computational side and also to neil's point focus with what's the qualitative side and the true cognitive the phenomenological side the social side and i think that's one reason why um with with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.028,
    "end": 2188.267,
    "text": " scholarly work like that of Mel Andrews and Mal and others that integrates discussion around model building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.287,
    "end": 2198.442,
    "text": "It also draws upon the pragmatic and the abductive and the semiotic and a lot of other strongly process oriented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.462,
    "end": 2204.331,
    "text": "We talk about process ontologies, all these different features",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.728,
    "end": 2222.556,
    "text": " uh being woven in at the very least compatibly but compatibly which is to say open-endedly articulated in principle that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.679,
    "end": 2227.223,
    "text": " Of course, we're just having discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.263,
    "end": 2228.906,
    "text": "Who knows what's over under confidence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.926,
    "end": 2231.791,
    "text": "I'm just saying how it strikes me at this moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.292,
    "end": 2249.32,
    "text": "We wouldn't really want a better imperative based upon what we understand, at least what I personally understand, than something along those lines that sets the stage for multi-perspectival modeling of diverse intelligences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.523,
    "end": 2273.383,
    "text": " setting that composability it's like if it doesn't have composability and the unopinionated uh kind of nature collab as the collaborative project that's what we want collaborative project essential project critical infrastructure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.549,
    "end": 2294.612,
    "text": " specific project ryan smith used a stomach uh electrode to test this hypothesis about the vagus nerve and the role of this like neuropeptide and this muscle uh pattern then we're we're in the standard scientific expanded scientific space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2295.098,
    "end": 2300.085,
    "text": " In the process theory space, chapter six, chapter nine, did you look at the whole system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.146,
    "end": 2301.988,
    "text": "Did you consider systematic factors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.068,
    "end": 2304.071,
    "text": "What trade-offs did you make as modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.092,
    "end": 2307.657,
    "text": "Is the process and pipeline reproducible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.737,
    "end": 2309.74,
    "text": "Do we have the code like in chapter nine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.461,
    "end": 2314.407,
    "text": "Can you make a figure about the experiment just like connected to the figures in the textbook?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.77,
    "end": 2319.314,
    "text": " like reviewer type functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.655,
    "end": 2327.822,
    "text": "But as we often bring up, reviewers are not going into whether L2 norm or L1 norm was the statistically appropriate choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.904,
    "end": 2337.212,
    "text": "I know in ethology, many times we just said, we looked at this other paper, or just this is a commonly used approach for this statistical technique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.717,
    "end": 2341.997,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.036,
    "end": 2352.89,
    "text": " putting a lot of weight and focus on the last mile and the specifics, which is obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.733,
    "end": 2362.005,
    "text": "Like Pearson's not brought out every time somebody does or doesn't use an R squared to mobilize an argument or make a decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2363.126,
    "end": 2364.489,
    "text": "That's so many levels away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.949,
    "end": 2369.096,
    "text": "Einstein's not brought out except in jest when the planes are late.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.078,
    "end": 2370.398,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.761,
    "end": 2400.773,
    "text": " lot of lot of um morphological and behavioral development but one of the key practices um one thing that wolfram was saying was like there are certain things about this or that that have to be the case like he was talking about our continuous time perception even though it's the hypergraph like the discretized hypergraph at the lower level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.753,
    "end": 2428.701,
    "text": " with that kind of like averages over all the computations i believe um something like that um and then like we're orders magnitude larger and slower we average out we coarse grain talked about that then the theory of the observer and he's like yeah there might be like other things about communication or about observation or systems that also like must be the case so i think there's kind of like in terms of the anthropic principle slash anthropic fallacy um it's almost like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.263,
    "end": 2437.054,
    "text": " I believe that we will through chapter 10 and beyond like, Hey, how many careers do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.861,
    "end": 2440.044,
    "text": " Like this is not just hot takes on a podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.645,
    "end": 2457.107,
    "text": "These are many, many careers in many, many directions of many, many academic departments, a lot of research programs, startups, a lot of funding cycles around what is or isn't plausible, AI winter, all the implications, causes and consequences of cybernetics research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.349,
    "end": 2466.72,
    "text": "It's like, this is the umbrella that is on the table connected only to other accounts and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.152,
    "end": 2471.838,
    "text": " So barring things that we learn on a week by week basis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.581,
    "end": 2480.533,
    "text": "So at least scale the pragmatic value to how relevant it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.553,
    "end": 2488.627,
    "text": "And then calibrate your epistemic scaler to what and how you do and don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.228,
    "end": 2492.353,
    "text": "Like we all do and don't know and only speak from our own experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.227,
    "end": 2505.133,
    "text": " We can have a cognitive modeling analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.936,
    "end": 2513.245,
    "text": "What happens when somebody who is not to pick on any field or any topic or anything like that, someone who's like, oh, I love that citation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.387,
    "end": 2515.829,
    "text": "Or like, that's my job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.232,
    "end": 2520.396,
    "text": "Or like, I know that really well, or my dissertation was in that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.517,
    "end": 2525.985,
    "text": "What happens in the moment of contextualization and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.213,
    "end": 2549.443,
    "text": " not to get too meta, but again, whether it's artisanal farmer's market status and just like, well, anecdotally, people who are doing psychiatric work or who are interested in like, for example, chronic pain, as like several of our very committed colleagues are, like they prefer this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.607,
    "end": 2557.677,
    "text": "That can be approached like kind of naively or expertly, qualitatively and or quantitatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.525,
    "end": 2567.438,
    "text": " So we're in the end of this cohort of three of the textbook group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.684,
    "end": 2573.228,
    "text": "So what is it really about the textbook group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.855,
    "end": 2583.327,
    "text": "How do we really want to think about its role in the ecosystem, like impact on people's learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.522,
    "end": 2590.637,
    "text": " production of different materials for different consumptions and publishings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.03,
    "end": 2597.333,
    "text": "What do any of you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.474,
    "end": 2630.23,
    "text": " just to give one other random take, just kind of unstructured thinking about it is like, I was thinking of walking down the aisle at a bookstore and there's different frameworks catching or vying for attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.091,
    "end": 2644.87,
    "text": "And I know it sounds obvious that it has to be differentiated, but pointing out that there's differentiation on multiple axes as a consequence of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.048,
    "end": 2651.738,
    "text": " It sounds wild or weird or however you want to see it at first, but the minimization of surprise as a central phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.601,
    "end": 2670.03,
    "text": "And that simple starting positionality or stance, along with some other core memes that I think needs to be worked out and understood the relationship to, like embodied all this other stuff, that rolls downhill differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.04,
    "end": 2696.17,
    "text": " helps you rethink differently see a lot of phenomena maybe theoretical transdisciplinary synthesis is not your um trajectory in life that's totally chill obvious it doesn't need to be said but just to be clear that this is in that the just the the where and the when and the how and the who in relationship to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.288,
    "end": 2722.798,
    "text": " the um actual which we saw uh at least the the movie poster for earlier in our discussion uh and also one of the points is uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.044,
    "end": 2741.293,
    "text": " You see, given the rapid development of active inference literature since the publication of this book, I believe it might not be a terribly bad idea if, beginning from the next cohort,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2741.813,
    "end": 2753.249,
    "text": " we somehow begin to incorporate more actively some of the findings of recent literature into the discussions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2753.329,
    "end": 2770.993,
    "text": "Because, I mean, with this pace of development that Active Imprints is experiencing right now, it might sound a bit grandiose, but I think it's not unlike the situation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2771.024,
    "end": 2775.851,
    "text": " that quantum physics experienced in the early 20th century.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.451,
    "end": 2800.204,
    "text": "So as we know from the history of quantum physics, almost every year and even every few months, radically new understanding of quantum theory appeared, which fundamentally shaped what we now know as quantum physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2800.184,
    "end": 2826.917,
    "text": " And I believe Active Inference kind of taken a similar trajectory, because with, of course, not all of the papers that's been published since the publication of this book, but some of the groundbreaking papers that really shifted our understanding of what Active Inference is all about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2827.319,
    "end": 2844.639,
    "text": " and somehow refined the more vague concepts that we still see in this book and try to make them more precise and make it more coherent with the rest of the theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2845.3,
    "end": 2851.167,
    "text": "So, yeah, as I said, in my opinion, it might not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.619,
    "end": 2863.655,
    "text": " be a bad idea to look at some of these developments beginning from the next cohort.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2863.675,
    "end": 2864.576,
    "text": "Thanks a lot, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.596,
    "end": 2864.876,
    "text": "Neil?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.723,
    "end": 2874.329,
    "text": "As the discipline grows with any new area, it grows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.349,
    "end": 2881.238,
    "text": "It gets beyond the point where any individual can keep track of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.277,
    "end": 2909.807,
    "text": " I was wondering, maybe the Active Inference Institute is effectively doing this already, but I'm just imagining if there was an annual report, let's say the Institute produced an annual report providing an overview of what happened, the significant developments in the last year,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.091,
    "end": 2923.037,
    "text": " So that's, you were talking earlier about, there's so many different ways in that it touches on that people might",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.502,
    "end": 2929.692,
    "text": " well, have some involvement to do with active influence, but they only know this tiny area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.714,
    "end": 2942.798,
    "text": "How do you get them to have some bigger perspective where there's education such as this book, but how do you enable them to carry on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.229,
    "end": 2964.938,
    "text": " maintaining that because they can't be reading thousands of journal papers a year just on active inference when that might actually only be a relatively small part of their wider research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.243,
    "end": 2973.51,
    "text": "Whereas the Institute should be able to provide some open",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.739,
    "end": 2988.918,
    "text": " It's not just thinking a review of some say this, some say that, but some sort of bigger perspective on what's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.559,
    "end": 3002.637,
    "text": "So like a whole load of new publications were in this direction, say social sciences and that, to help people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3006.397,
    "end": 3006.818,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.978,
    "end": 3008.5,
    "text": "These are such good comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.6,
    "end": 3009.342,
    "text": "I really agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.382,
    "end": 3017.174,
    "text": "Ali and I, and now actually kind of like pseudo templated a little bit like a research roundup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.194,
    "end": 3018.215,
    "text": "So it's a seed project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.235,
    "end": 3021.28,
    "text": "That's just one possible mechanism, not to jump to a solution or anything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.3,
    "end": 3023.724,
    "text": "But like, I also totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.804,
    "end": 3028.371,
    "text": "Like, yeah, we fixed some errata and typos and we aggregated some people's input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.549,
    "end": 3049.549,
    "text": " that's that's local refinement and it's adding value and so on but then okay now jonathan and ali have pdfs on this equation that equation and it's like and then you have sanjeev's work as all of you know and uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.761,
    "end": 3052.864,
    "text": " The annotation work is infinite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.984,
    "end": 3057.009,
    "text": "And I think we've in some ways laid out what certain paths look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.089,
    "end": 3067.442,
    "text": "Like for example, using the ontology seriously, annotating equations with the verbal descriptions, getting all the figures, boxes, tables, eventually even paragraphs into tabular form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.264,
    "end": 3072.509,
    "text": "Like we have the massively collaborative possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3072.549,
    "end": 3078.456,
    "text": "And that's not to say they're even being underused at all by human and or non-human agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.275,
    "end": 3083.021,
    "text": " It's just part of a co-creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.883,
    "end": 3093.966,
    "text": "So it's not about just like single dimensional perspectives on consciousness or anything like that are limited, if not worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.248,
    "end": 3100.039,
    "text": "Multiple projects should speak to the bigger perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.019,
    "end": 3103.424,
    "text": " I think there's the important observational role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.205,
    "end": 3107.89,
    "text": "Like, here's how surprise was used in this paper at this time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.91,
    "end": 3121.268,
    "text": "I associate that with a kind of trust finder architecture, like rhetorical assertion, not to get too technical, but different expressions are made in the ecosystem, ingressed and or intentionally expressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.248,
    "end": 3137.62,
    "text": " And we have different strategies and approaches and projects that are anticipatory and maintenance-oriented and historical to improve our sensemaking skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.418,
    "end": 3152.816,
    "text": " there's some interns who are doing such amazing work and that's only the fraction, some fraction of people who are not just in their own way and in their own game, which is everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.618,
    "end": 3162.45,
    "text": "So like what we're, what we can really do, I'm happy to have these fundamental conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.973,
    "end": 3169.8,
    "text": "I just, we're not going to be able to enumerate or evaluate or anything like that, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.936,
    "end": 3195.13,
    "text": " par something you know keeping the par flame alive maybe with a discussion changing the time ollie and i will have completed our background videos and then we can kind of assess like here's the roles um here's the first versions of the background materials",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.185,
    "end": 3200.49,
    "text": " go through it at these, you know, small groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.51,
    "end": 3206.978,
    "text": "So there could be a lot of decentralized ways to continue that, or at least just low preparation ways for different facilitators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.18,
    "end": 3211.765,
    "text": "And then maybe we need cohort two of Chris Fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.967,
    "end": 3218.294,
    "text": "Maybe we need a special integration units and projects like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.354,
    "end": 3226.365,
    "text": "Just having a reading group, follow Avel in social sciences and follow Chris in the, you're going to be intersecting and, and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.628,
    "end": 3231.335,
    "text": " engaging and still on the fractal wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.719,
    "end": 3236.104,
    "text": "And we're always going to be only using the systems that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.146,
    "end": 3241.113,
    "text": "Can't be waiting for future tools, but we will use them as they arrive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.299,
    "end": 3250.21,
    "text": "And just supporting the sustainability of that for the ecosystem is our focus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.323,
    "end": 3258.664,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.726,
    "end": 3262.953,
    "text": "Another thought, just as we're in kind of last minutes of 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.973,
    "end": 3265.499,
    "text": "So it's like all this theoretical scope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.18,
    "end": 3275.32,
    "text": "Yeah, it could just be another node in the same space, but the claim is kind of like it generalizes a lot of them, relates a lot of them formally, maybe even envelops all of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.3,
    "end": 3283.167,
    "text": " at least socio-technically, if not even way, way, way deeper and broader and everything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.187,
    "end": 3290.693,
    "text": "So it's like, however much theory scope you think this covers, maybe you're super familiar with literature, every single citation, you're like, oh yeah, you know exactly why it's there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.313,
    "end": 3298.539,
    "text": "Then this argument is poised to your adjacency because this is the perspective of the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.0,
    "end": 3305.205,
    "text": "Or if you're not super familiar with these areas, it may be sufficient just to understand them as being like broad topics of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.185,
    "end": 3308.63,
    "text": " if not addressing important systems in the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.31,
    "end": 3325.472,
    "text": "But when we really think about these as being the major threads of accounts and statistics for cognitive behavioral systems, it's not like there's some other secret 11th theory that's just being censored in the citation literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.452,
    "end": 3331.453,
    "text": " I mean, I'd leave it to a meta-analysis to say more, but nobody reads this and says, wow, you're ignoring like this entire massive thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.015,
    "end": 3338.196,
    "text": "Yeah, maybe go into more detail on adaptive resonance theory or go into more detail on this on one given area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.564,
    "end": 3355.461,
    "text": " But when the broad threads are represented and the arguments are made formally in text based upon an implicit first principle, the scope and the relevance of the learning has to be this theoretical scope and the consequences on systems of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.882,
    "end": 3365.01,
    "text": "Doesn't mean that it has to be overwhelming in the moment, but people bring up real things in the textbook group and it is about real things because education is about real things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.197,
    "end": 3373.944,
    "text": " I would like to hear any of your all's thoughts on chapter 10 now as we close cohort three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.786,
    "end": 3392.989,
    "text": "Don't worry, authors will get the final word, not us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.05,
    "end": 3548.831,
    "text": " Any thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3570.022,
    "end": 3594.207,
    "text": " so many great comments and i know it's only the tip of the iceberg of what was like said or maybe it was never even said and then of course what it said is only the iceberg with with what is thought but it's so funny it was right back there with the sentience with the 11th round of the sentience debate and it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.76,
    "end": 3626.944,
    "text": " is it over promising but it's a it's a different system of interest it's not the same thing as learning like learning epistemic value that's why it's sometimes fun just to learn about things for their epistemic value there's parts that we know has pragmatic value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.73,
    "end": 3631.574,
    "text": " There's parts that we know have epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.098,
    "end": 3641.867,
    "text": "What other imperative are you acting and inferring under?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.394,
    "end": 3657.387,
    "text": "And then one route that Ali highlighted very articulately earlier was the central character, main character energy for surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.801,
    "end": 3675.564,
    "text": " And a kind of close in that nexus is the qualitative, but formal, potentially qualitative compositional about existence, existentials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.667,
    "end": 3683.695,
    "text": "And that ties it to homeostasis and all of that, ties it to observation and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.784,
    "end": 3693.734,
    "text": " It opens up another degree of freedom, the axle constant, Mobius strip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.677,
    "end": 3697.379,
    "text": "It's not about da-da-da.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.419,
    "end": 3698.48,
    "text": "It's about how you got there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.862,
    "end": 3703.767,
    "text": "Like this describes systems with persistence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3705.409,
    "end": 3706.23,
    "text": "Do you have a better descriptor?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.272,
    "end": 3712.298,
    "text": "But that doesn't mean that constructing it is a guarantee of future persistence, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.43,
    "end": 3716.92,
    "text": " Past returns does not guarantee future returns or whatever they say there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.867,
    "end": 3726.743,
    "text": "But you may be able to say certain things, but the existentialism is a natural fit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.917,
    "end": 3743.138,
    "text": " In information landscapes, because it kind of blurs, it doesn't actually blur, but it conceptually integrates the measurement and the existential on a kind of common footing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.9,
    "end": 3751.009,
    "text": "Super general analytical representations, the exact same kind from like variational physics, mechanics, information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.558,
    "end": 3778.515,
    "text": " quantum, category theory, dynamic systems, all their notation, special case, all the math that people are using to describe systems of interest, compositionality, recognition of new underlying special case phenomena, just as Buckminster Fuller always pointed to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3780.098,
    "end": 3804.368,
    "text": " recognition of special case phenomena upon generalization also related to the revolution model that ali mentioned and that is the thing you just have a particular partition but then you have them fitting an l2 norm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.153,
    "end": 3809.777,
    "text": " which is not unlike what a structural equation model is actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.458,
    "end": 3812.74,
    "text": "And structural equation modeling is used in SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.301,
    "end": 3823.492,
    "text": "And I'm sure there's all kinds of different variants and stuff, but it's like, that's like a kind of massively linear parametric can include time series, just like all the Sarima methods and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.532,
    "end": 3831.761,
    "text": "So a lot of the same ability to describe like changing causal relationships, little known fact existed in SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.022,
    "end": 3834.844,
    "text": "So a lot of the practice is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.499,
    "end": 3840.806,
    "text": " in principle, was totally, totally addressed by SPM textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.59,
    "end": 3851.26,
    "text": "Various modules became increasingly recognized, centrality of action, the pragmatic turn in neuroscience, all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.003,
    "end": 3859.971,
    "text": "Those recognitions were either articulations that were not understood to have already existed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3860.153,
    "end": 3882.482,
    "text": " like the idea that you could just extend the kind of Coleman filter, like predictive processing algorithm arising in video compression, and then just like pop action in and get active inference with all of these even immediately apparent philosophical implications for people who are studying those topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.88,
    "end": 3907.542,
    "text": " and the maintenance of the key feature with the physics-based first principles singular imperative so recognitions of articulations that that um suggested also profitable and fruitful directions important critiques and and re-understandings and developments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.522,
    "end": 3916.972,
    "text": " Not just related to notation, for example, generative model and generative process, which as we've discussed more recently, is not the way that it's often being discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.992,
    "end": 3919.134,
    "text": "So does that lead to an entire secondary discussion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.174,
    "end": 3924.479,
    "text": "Or do we just continue forward mostly with such and such?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.66,
    "end": 3926.782,
    "text": "But the particular partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.723,
    "end": 3936.111,
    "text": "And over the last years, the refinement of so many different aspects, such that we're basically...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3936.091,
    "end": 3961.795,
    "text": " like preparing to scramble not really how to even synthesize hence the ultra descriptive deflationary ontology and assertion-based architecture that we hope is going to bring in a lot of diverse ways of knowing and remodeling and sense making and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.277,
    "end": 3990.178,
    "text": " will be a lot of different angles and overlaps like what if there's a statistics professor who just feels a certain way about this how does that situate them in relationship to the theoretical apparatus as understood by any other given person or by any other group of other people so how to really retain the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.15,
    "end": 3999.021,
    "text": " singular focus amidst all the specifics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.064,
    "end": 4011.881,
    "text": "It's comforting to expect and prefer that we have the framework that is on the path towards that composability, extensibility, et cetera, et cetera, all the phenomena that we discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.468,
    "end": 4019.473,
    "text": "And what's the other aspect to it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.39,
    "end": 4026.995,
    "text": " And the textbook's not life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.015,
    "end": 4034.683,
    "text": "So how to emphasize that too and really integrate it in people's living and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.787,
    "end": 4040.45,
    "text": "Make it what it can be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4044.634,
    "end": 4050.0,
    "text": "So we could definitely think a lot and no specific dates for cohorts are set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.634,
    "end": 4053.557,
    "text": " But maybe, you know, who knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.778,
    "end": 4060.108,
    "text": "Social sciences cohort two, Chris Fields cohort two, PAR.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4065.677,
    "end": 4073.13,
    "text": "It's people's attention slash nestmate level contributions that actually embody those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.151,
    "end": 4076.916,
    "text": "And so after the acclimation of like the kind of woe,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.364,
    "end": 4082.468,
    "text": " there's still so much work and there will continue to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.27,
    "end": 4093.019,
    "text": "So it's been a total honor to Neil, Ali and Esmail and everybody else who contributed totally to this cohort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4094.301,
    "end": 4096.283,
    "text": "Any last comments on cohort three?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.911,
    "end": 4106.093,
    "text": "Fascinating journey as always.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4109.363,
    "end": 4116.491,
    "text": " The summary chapter will always do that, throwing everything there is in front of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.691,
    "end": 4122.237,
    "text": "But yeah, there is so much to the whole, to the subject, isn't there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4122.678,
    "end": 4124.6,
    "text": "Brought in from so many different places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.246,
    "end": 4130.887,
    "text": "It really is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.992,
    "end": 4138.375,
    "text": "Yeah, it's been great listening to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4140.548,
    "end": 4170.454,
    "text": " yep we've all learned a lot it's been a very great end so i guess next week the the day of the symposium i mean we can discuss more but we'll see what we may want to do or how we want to proceed in the coming um cohorts so thanks again see you all next time bye thanks everyone thanks bye",
    "speaker": "SPEAKER_00"
  }
]