[
  {
    "start": 8.683,
    "end": 12.806,
    "text": " Hello, this is Act and Flap guest stream number 21.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 13.486,
    "end": 22.893,
    "text": "It's April 21st, 2022, and we're here with Shannon Proch, and Shannon will be giving a talk, Coordination Dynamics of Multi-Agent Interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.514,
    "end": 31.159,
    "text": "The talk will happen for maybe around an hour, and then there'll be time for Q&A, so feel free to ask any questions in the chat during.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.639,
    "end": 36.563,
    "text": "So off to you, Shannon, looking forward to this talk, and thanks again for joining on Act and Flap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.542,
    "end": 38.942,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.982,
    "end": 40.824,
    "text": "Thanks so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.364,
    "end": 42.005,
    "text": "So I'm Shannon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.185,
    "end": 44.746,
    "text": "Daniel's already given you the title of our talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.687,
    "end": 50.531,
    "text": "And I'm coming to you from the University of California in Merced, where I'm a PhD candidate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.311,
    "end": 53.192,
    "text": "And I'll actually be defending this summer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.373,
    "end": 67.943,
    "text": "So maybe the next time you hear from me, I'll be talking to you from Augustana University, where I will be starting a tenure track professor position later this fall as an assistant professor of psychology and neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.694,
    "end": 71.374,
    "text": " Oh, applause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.475,
    "end": 71.815,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.075,
    "end": 73.756,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.376,
    "end": 76.618,
    "text": "So that said, I'm not going to talk to you about neuroscience today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.858,
    "end": 79.78,
    "text": "I'm going to talk to you a little bit about the behavior of crowds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.74,
    "end": 85.883,
    "text": "And I stole this roadmap idea from previous active inference lab sessions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.024,
    "end": 89.726,
    "text": "And this is kind of outlining where we'll be going today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.515,
    "end": 96.398,
    "text": " So first, the first thing we're gonna do is really dig into a little bit of theory and data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.259,
    "end": 104.783,
    "text": "I'm gonna give a bit of a brief introduction to multi-agent interaction and what kind of human behavior I'm interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.803,
    "end": 108.125,
    "text": "And I'm gonna walk through a couple of ways that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.313,
    "end": 122.076,
    "text": " Active inference folks might be interested in crowd dynamics and behavior, but primarily I'm gonna be focusing on dynamical systems theory and the notion of synergies and the tools that come along with these concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.456,
    "end": 139.24,
    "text": "And then finally, I'm going to show you a model system where we apply these tools to a system of coupled metronomes before I look at some empirical data from real world interaction of musical performance and also of crowds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.034,
    "end": 141.154,
    "text": " cheering at a basketball game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.915,
    "end": 145.416,
    "text": "So first, what is multi-agent interaction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.517,
    "end": 150.538,
    "text": "This is simply an interaction that's happening between two or more agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.978,
    "end": 152.279,
    "text": "In our case, we're looking at people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.939,
    "end": 156.421,
    "text": "And each of these people, they'll have their own personal goals and behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.021,
    "end": 163.123,
    "text": "But their individual behaviors are influenced in some way by interacting with other agents in their shared environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.164,
    "end": 166.865,
    "text": "And I want to talk about two forms of multi-agent coordination today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.699,
    "end": 171.203,
    "text": " And the best way to introduce this is through a short thought experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.445,
    "end": 177.01,
    "text": "So I'll just have you imagine the sounds of a crowded coffee shop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.751,
    "end": 180.875,
    "text": "Consider how individuals in that coffee shop might be interacting with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.795,
    "end": 189.619,
    "text": " There might be some small groups, there might be pairs, but mostly it's many individuals engaging in small temporary interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.14,
    "end": 195.683,
    "text": "And these individuals aren't coordinating with every other individual in some sort of cohesive coffee shop group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.243,
    "end": 200.045,
    "text": "They're just a jumble of individual individuals who are cohabiting a shared space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.482,
    "end": 205.405,
    "text": " Now instead, imagine the audience on the floor of a rock concert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.986,
    "end": 208.768,
    "text": "They're cheering or singing along with the artists on the stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.649,
    "end": 216.474,
    "text": "And alternatively, imagine the fan section at your favorite sporting event emerging into a synchronous chant or a course of resounding boos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.335,
    "end": 220.717,
    "text": "Imagine how individuals in these large crowds might be interacting with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.698,
    "end": 228.804,
    "text": "As they cheer, sing, chant, or boo, they're all sharing in similar behavioral states, engaging in similar actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.414,
    "end": 233.975,
    "text": " They're likely sharing similar physiological states like breathing rates and neural states as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.215,
    "end": 237.316,
    "text": "These crowds are changing together in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.656,
    "end": 241.476,
    "text": "They're behaving and they're coordinating like one large interdependent group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.377,
    "end": 252.558,
    "text": "And you could refer to these as shared acoustic spaces, and they include various levels of interaction from dyads, pairs of individuals, or larger and larger groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.899,
    "end": 255.059,
    "text": "And I might even call these acoustic social worlds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.343,
    "end": 264.506,
    "text": " The acoustic signal that's generated by these crowds, it carries some information about their behavioral dynamics that were employed in creating that signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.746,
    "end": 278.631,
    "text": "And the sounds these crowd makes carry some sort of information about the status of that crowd, either as an incidental collection of lots of individual coffee goers or an integrated and coordinated crowd, like a crowd of concert goers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.205,
    "end": 285.786,
    "text": " And there are, of course, many important factors at play when we're evaluating these acoustic social worlds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.347,
    "end": 293.288,
    "text": "And we're trying to decide whether that crowd is acting as one integrated multi-agent system rather than a collection of independent agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.109,
    "end": 295.769,
    "text": "And these include the social context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.089,
    "end": 298.69,
    "text": "A coffee shop is different than a concert arena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.55,
    "end": 307.732,
    "text": "The development of pattern cultural practices in these different contexts and different scripts surrounding what events happen and when these events happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.433,
    "end": 311.518,
    "text": " and differing regimes of shared attention between each of these agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.619,
    "end": 315.483,
    "text": "And these are things you've talked about in the active inference lab before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.503,
    "end": 323.756,
    "text": "And basically this is all a rather long-winded way of saying that we expect coffee shop behavior in a coffee shop and concert behavior in a concert arena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.174,
    "end": 331.278,
    "text": " If I were going to talk to you in the language of active inference, I might talk to you today about Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.998,
    "end": 340.624,
    "text": "And we might talk about this statistical boundary that might be behind a pair of interacting individuals around a pair of interacting individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.204,
    "end": 346.991,
    "text": " separating their internal states of this interaction with the rest of the interactions happening in a coffee shop crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.851,
    "end": 360.665,
    "text": "And I might talk about how the statistical boundary expands as we start to engage or interact with larger groups of people from three to four to maybe 100 people or more if we're in a large group interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.704,
    "end": 381.429,
    "text": " And while this can be a really useful way to model multi-agent interaction, to talk about a suite of nested Markov blankets, we quickly run into questions of how a researcher chooses where to draw a Markov blanket at any given system, or where to draw each nested Markov blanket in a given system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.049,
    "end": 385.57,
    "text": "And this is a topic that you've discussed a lot in the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.79,
    "end": 390.491,
    "text": "You've spent some time talking with Jelle Bruneberg and colleagues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.481,
    "end": 404.208,
    "text": " after their recent BBS article commentaries and how there might be differences from me as a researcher applying some sort of Markov blanket around a system versus the actual agents interacting in that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.489,
    "end": 412.973,
    "text": "But I just mentioned this idea of Markov blankets to situate the topic for the audience of these interactive inference lab live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.352,
    "end": 422.595,
    "text": " As far as measuring the emergence of an integrated interacting crowd, this is an empirical question that I'm asking rather than a modeling question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 423.616,
    "end": 425.356,
    "text": "And I'm not a mathematician or a modeler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.816,
    "end": 434.72,
    "text": "So for this question about groups of interacting people, I found empirical tools from dynamical systems theory and with the concept of interpersonal synergies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.42,
    "end": 437.021,
    "text": "So that's what I'm gonna introduce to you guys next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.442,
    "end": 439.723,
    "text": " So dynamical systems theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.423,
    "end": 444.204,
    "text": "This considers a trajectory of behavior of a system over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.125,
    "end": 452.188,
    "text": "And the concept of synergies arises from the field of motor control as a solution to the degrees of freedom problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.728,
    "end": 464.093,
    "text": "So essentially, the degrees of freedom problem is that fine and precise control of every degree of freedom in a motor movement would be computationally intractable for the nervous system to solve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.033,
    "end": 468.655,
    "text": " And what you see here is a miner hammering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.675,
    "end": 471.577,
    "text": "And you see these light patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.617,
    "end": 475.659,
    "text": "This is really sort of the earliest sort of motion capture that we had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.679,
    "end": 479.722,
    "text": "And we're seeing the trajectory of his arm hammering here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.822,
    "end": 489.087,
    "text": "And you can see that even though the hammer is hitting the same place every time, you'll have to trust me that it's hitting the same place every time, his arm is taking a slightly different trajectory to get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.707,
    "end": 492.249,
    "text": "But it generally covers this one swinging behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.302,
    "end": 507.21,
    "text": " And that's because the muscles in his arm here are self-organizing into coupled and locally constrained degrees of freedom, forming temporary soft assemblies of motor function that's enabling this flexible movement and coordination here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.371,
    "end": 517.737,
    "text": "Put another way, synergies are identified by their functional specificity, dimensional compression, and reciprocal compensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.498,
    "end": 518.958,
    "text": "What are those?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.639,
    "end": 530.527,
    "text": " Well, the need to perform a specific function, like hammering that anvil, that functional specificity temporarily shapes the coordination of several components into one system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.607,
    "end": 535.11,
    "text": "That's dimensional compression, in which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.817,
    "end": 544.564,
    "text": " External and internal perturbations are flexibly dealt with via compensatory adjustments of the components, reciprocal compensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.624,
    "end": 548.366,
    "text": "So each muscle in his arm is compensating for the activity of the other muscle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.067,
    "end": 555.812,
    "text": "And if he was bumped slightly, there would be compensation from other muscles to ensure that anvil hits its location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.185,
    "end": 563.128,
    "text": " And this is all done in order to preserve the functionality of the whole system for as long as it's needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.808,
    "end": 576.614,
    "text": "And that last comment for as long as it's needed, that gets to the notion of soft assembly, where any of these units in this picture here might be functionally coupled just for as long as you need to perform that task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.914,
    "end": 586.379,
    "text": "So if we're talking about a group of people, this group of people might form some sort of complex system just while they're interacting for that meeting, while they're at that concert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.929,
    "end": 589.73,
    "text": " until they disperse and are ready to move on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.971,
    "end": 603.555,
    "text": "We can differentiate mere coordination, which might happen between two people as a result of engaging with the same stimulus and similar patterns of actions from a true interpersonal synergy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.715,
    "end": 616.279,
    "text": "And you see here, we might see the same patterns of movement if we have two individuals who are maybe just listening to the same set of music, but if these individuals are interacting with each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.84,
    "end": 625.124,
    "text": " where the action of one person and the action of the second person is constraining each other, then this is where an interpersonal synergy happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.244,
    "end": 634.368,
    "text": "And these synergies are the result of these micro scale structures of a system giving rise to macro scale dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 635.669,
    "end": 642.272,
    "text": "When a synergy develops, we no longer need to describe the independent dynamics of each micro scale structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.015,
    "end": 656.384,
    "text": " We can instead describe the behavior of this single interaction dominant system, which consists of complementary actions from each person's motor activity as it pertains to their role in this softly sampled complex system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.405,
    "end": 664.609,
    "text": "And you might even notice some similarities here between these graphics and a graphic we might draw of nested Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.13,
    "end": 672.795,
    "text": "And these might very well be two sides of the same coin, just two perspectives with a very similar conceptual landscape here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.547,
    "end": 681.71,
    "text": " And there's a variety of methods for studying the coordination dynamics that underlie interpersonal coordination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.75,
    "end": 689.254,
    "text": "For example, we might ask two people to sit next to each other and swing pendulums or to rock in rocking chairs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.154,
    "end": 700.059,
    "text": "And we can measure how these individuals intentionally or unintentionally synchronize their behavior as each individual's action becomes coupled to their partner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.88,
    "end": 705.562,
    "text": "Or we can ask musicians to play together in a musical ensemble or a duet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.443,
    "end": 713.768,
    "text": " And we can measure how these quartets or duets move together in time, forming these loosely coupled interpersonal synergies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.089,
    "end": 725.616,
    "text": "But in each of these interactions, a motor or acoustic behavioral output of each interacting individual was measured and analyzed for meaningful correlations between these individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.737,
    "end": 732.781,
    "text": "So importantly in these experiments here, it has been possible to obtain clear measurements of individual behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.928,
    "end": 742.65,
    "text": " in order to correlate the behavior of these individuals and examine the emergent coordination dynamics of multi-agent interaction and social self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.291,
    "end": 748.792,
    "text": "But what happens when we have this massive crowd of people?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.812,
    "end": 758.594,
    "text": "When we measure the interpersonal synergies that form in such a large crowd, how does a group of people move between novel and habitual patterns of coordination?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.281,
    "end": 764.463,
    "text": " How does a multi-agent system navigate transitions between chaos and stability?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.163,
    "end": 767.464,
    "text": "And let's make it a little bit trickier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.044,
    "end": 774.706,
    "text": "The real world is messy and measurement is difficult and a naturalistic social interaction and a very large crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.106,
    "end": 778.247,
    "text": "I probably can't measure the behavior of every single individual person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 779.079,
    "end": 781.52,
    "text": " I probably can't give everyone an individual microphone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.86,
    "end": 784.6,
    "text": "I probably can't track each person's individual brain states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.18,
    "end": 792.762,
    "text": "And I might not even have access to a camera, let alone a set of motion capture cameras and hundreds of markers to track everyone's head and limb movements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.022,
    "end": 798.263,
    "text": "So let's come back to the crowds we imagined at the start of this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.483,
    "end": 806.685,
    "text": "When you're imagining this coffee shop crowd and the crowd at the rock concert, you might have also been imagining how these crowds sounded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.198,
    "end": 822.027,
    "text": " So the difference between this disjointed noise you might hear at the coffee shop and this altogether coordinated stinging maybe at a rock concert, it's trivially easy for you or I to identify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.208,
    "end": 837.239,
    "text": "An uncoordinated group of independent individuals happening to coexist in a shared space versus a coordinated group of interdependent group members in a crowd, we can simply hear that these two groups of people sound different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.143,
    "end": 849.448,
    "text": " Similarly, we can simply hear when we ourselves are engaged and participating as a collective sort of agent while we're interacting with a large group of people or in a very large musical ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.789,
    "end": 856.572,
    "text": "So I'm taking that idea and I think we can measure the sounds that a crowd makes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.852,
    "end": 865.056,
    "text": "And with a well-placed microphone or a few microphones, we can generate a single audio recording of the sounds that an interacting group makes over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.363,
    "end": 872.286,
    "text": " And I know that a human can make inferences about the interactions and the acoustic social world of a crowd just by listening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.366,
    "end": 885.912,
    "text": "So similarly, I want to know if this dynamical systems toolkit that I have can allow us to make inferences about the behavior of an entire complex system based on this one acoustic measurement that we have access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.313,
    "end": 892.255,
    "text": "So for the next little while, I'm going to walk through a bit of theory and then a toy example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.382,
    "end": 900.927,
    "text": " until I eventually end this talk with data from real live multi-agent groups that we're analyzing with tools from dynamical systems theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.929,
    "end": 913.055,
    "text": "So one of our most simple complex dynamical systems is a metronome or a pendulum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.815,
    "end": 916.237,
    "text": "So Christopher Huygens first discovered",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.22,
    "end": 926.787,
    "text": " this activity of two pendulums from pendulum clocks will be related to each other when these clocks are hanging from a shared surface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.307,
    "end": 931.35,
    "text": "And what he found was that these pendulums would swing in anti-synchrony with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.37,
    "end": 939.557,
    "text": "And since then, in 1600s or so, there's been lots of research on pendulums and on coupled metronomes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.728,
    "end": 954.042,
    "text": " And if we put these metronomes, a timekeeping device for making music on a shared platform, and maybe that platform rotates like this, you'll see each of these metronomes come into synchrony with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.044,
    "end": 956.305,
    "text": "These are just static pictures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.685,
    "end": 962.632,
    "text": "So to really help you visualize this and hear this, I'm recruiting a little bit of help from the Mythbusters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.742,
    "end": 971.063,
    "text": " The Mythbuster's on YouTube, so hopefully it is free and uncopyrighted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.484,
    "end": 977.425,
    "text": "And I'm just going to skip ahead here to partway into their episode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.445,
    "end": 983.187,
    "text": "Friction and momentum as I can so that only the metronome is having the effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 983.667,
    "end": 984.427,
    "text": "Now let's try two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 985.267,
    "end": 989.308,
    "text": "Adam doubles his trouble with two metronomes set to the same tick mark.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 990.048,
    "end": 991.749,
    "text": "Look at the movement on this platform.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 992.938,
    "end": 995.579,
    "text": " And after two minutes, the shimmy takes over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 997.299,
    "end": 998.119,
    "text": "Stay with it, boys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 999.279,
    "end": 999.679,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.76,
    "end": 1001.04,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.12,
    "end": 1002.06,
    "text": "It's totally working.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1004.64,
    "end": 1007.021,
    "text": "It just took them a little while to find each other's rhythm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1010.642,
    "end": 1011.182,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1012.482,
    "end": 1013.082,
    "text": "I have an idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1013.102,
    "end": 1016.443,
    "text": "If I stop the platform, they should drop out of phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.444,
    "end": 1021.944,
    "text": "There it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1024.687,
    "end": 1028.649,
    "text": " the moving platform is totally, totally critical to this experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1030.43,
    "end": 1030.65,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.112,
    "end": 1039.456,
    "text": "All right, so that's Adam Savage there with two metronomes, one on earth, why does this matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.476,
    "end": 1046.86,
    "text": "Well, what he's done is replicated the findings of that centuries old experiment that was originally conducted with pendulums on a clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.401,
    "end": 1053.584,
    "text": "And he noted that this moving platform here is what's totally, totally critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.67,
    "end": 1059.653,
    "text": " But what I want you to also think of is that you heard these metronomes slowly coming into phase with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.214,
    "end": 1068.54,
    "text": "They were becoming interdependent on each other's behavior because they are connected by this coupling mechanism here, this shared platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.56,
    "end": 1074.063,
    "text": "And as Adam correctly notes, this moving platform is totally, totally critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.484,
    "end": 1080.648,
    "text": "And in fact, when you saw him stop the platform, the metronomes were no longer coupled and their behavior no longer affects the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.769,
    "end": 1087.213,
    "text": " This platform here can take many forms as long as it is freely flowing and responsive to the metronome's movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.214,
    "end": 1095.179,
    "text": "And for the metronomes, this platform is the essential coupling mechanism for this emergent of coordinated acoustic behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.1,
    "end": 1099.402,
    "text": "In humans, this coordination doesn't have to be a physical platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.223,
    "end": 1107.649,
    "text": "In fact, I argue that it is the interaction itself which serves as a coupling mechanism for multi-agent human behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.746,
    "end": 1112.748,
    "text": " And we're going to spend just a little bit more time with metronomes before I get onto real human groups here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.13,
    "end": 1124.855,
    "text": "So when you have many metronomes on a shared platform, you can have more than two, they're going to transition from uncoordinated random phase to coordinated synchronous phase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.235,
    "end": 1130.598,
    "text": "And what you're going to hear next is the acoustic output of 32 metronomes on a freely moving platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.238,
    "end": 1137.302,
    "text": "And I'm going to justify to you two things that we can identify emergent coordinated behaviors in acoustic data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.26,
    "end": 1148.074,
    "text": " And what all I'm going to justify what state space reconstruction is and how this tool from dynamical systems can help us to analyze that acoustic data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.116,
    "end": 1153.142,
    "text": "So I'm going to start at the beginning with each of the metronomes in random phase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.052,
    "end": 1179.334,
    "text": " And this really takes a bit of a time, so we don't have to listen to that for so long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.354,
    "end": 1180.134,
    "text": "I'm going to skip ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.361,
    "end": 1196.983,
    "text": "So what you heard was 32 metronomes all ticking at their own tempo at their natural period.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.403,
    "end": 1199.104,
    "text": "It sounded like a bunch of random noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.025,
    "end": 1203.967,
    "text": "But this platform, again, served as a coupling mechanism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.114,
    "end": 1207.976,
    "text": " And synchronization between the metronomes emerge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.156,
    "end": 1211.339,
    "text": "So they begin to sound like one group ticking together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.919,
    "end": 1217.643,
    "text": "And this is an example of the type of data we'll be investigating for the emergence of coordination and acoustic signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.704,
    "end": 1220.045,
    "text": "So keep these metronomes in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.065,
    "end": 1223.688,
    "text": "No, don't play the metronomes again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.889,
    "end": 1227.851,
    "text": "The platform is serving as a coupling mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.351,
    "end": 1230.893,
    "text": "As synchronization emerges, they begin to sound like one group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.882,
    "end": 1235.666,
    "text": " So we're going to visit some theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.706,
    "end": 1239.835,
    "text": "I'm going to introduce you to Totkin's theorem and phase space reconstruction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.018,
    "end": 1243.003,
    "text": "So if we take one time series from a system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.547,
    "end": 1245.729,
    "text": " This is the Lorenz system here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.749,
    "end": 1249.451,
    "text": "It's defined by a set of three differential equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.652,
    "end": 1257.757,
    "text": "But what you need to know is that we can reconstruct the behavior of this system as a whole by measuring only one of its parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.617,
    "end": 1265.522,
    "text": "This is accomplished by embedding delayed copies of a single time series into multiple dimensions on some delay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.843,
    "end": 1268.424,
    "text": "So here's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.309,
    "end": 1271.79,
    "text": " one of these time series extracted from the Lorenz system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.23,
    "end": 1276.992,
    "text": "And we delay that time series to make another time series, delay once more to make a third time series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.632,
    "end": 1283.874,
    "text": "We take these three dimensions and we use them to reconstruct a projection of the Lorenz system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.434,
    "end": 1286.535,
    "text": "And this is phase space reconstruction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.615,
    "end": 1292.977,
    "text": "And you can see that it maintains the topography or the same shape as the original Lorenz system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.837,
    "end": 1308.849,
    "text": " In the case of our acoustic data, I'm going to take a time series of that sound, that acoustic signal, and I'm going to follow these steps here to reconstruct the behavior of those metronomes over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.451,
    "end": 1318.838,
    "text": "And once we've completed this face-to-face reconstruction, I'm going to visualize the behavior of our reconstructed system by generating what we call recurrence plots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.827,
    "end": 1325.528,
    "text": " This is done by plotting recurrent points from the reconstructed phase space within some radius that we set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.529,
    "end": 1331.91,
    "text": "And we can evaluate the structures in these recurrence plots using recurrence quantification analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.47,
    "end": 1336.351,
    "text": "So on the right here, you're seeing a few examples of different time series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.291,
    "end": 1339.551,
    "text": "And you're seeing the reconstructed phase space here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.332,
    "end": 1346.413,
    "text": "And on the bottom, you're seeing the recurrence plot that we generate from these reconstructed phase space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.642,
    "end": 1352.323,
    "text": " So one of the simplest measures that we can glean from recurrence plot is the rate that states recur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.763,
    "end": 1354.924,
    "text": "And this is called recurrence rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1358.445,
    "end": 1362.946,
    "text": "And on the left here, we're seeing a time series of a simple sine wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.526,
    "end": 1367.327,
    "text": "And when we reconstruct it, we end up seeing something a bit like an oval or a circle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.427,
    "end": 1375.769,
    "text": "And when we plot a point on our recurrence spot here, every time our system revisits a space on the circle here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.048,
    "end": 1380.37,
    "text": " So in the sine waves recurrence plot, we're seeing these diagonal lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.95,
    "end": 1388.815,
    "text": "These diagonal lines are reflecting deterministic behavior and they track how similar sequences of values change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.595,
    "end": 1392.177,
    "text": "So this sine wave here, it's reliably deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.237,
    "end": 1395.439,
    "text": "If it starts here, it's going to go here next, then it's going to go there next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.499,
    "end": 1399.061,
    "text": "And that gives us these long recurrence values here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.761,
    "end": 1404.344,
    "text": "And as you probably expect, this measure is called determinism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.665,
    "end": 1406.145,
    "text": "In the middle,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.738,
    "end": 1408.539,
    "text": " we see uncorrelated white noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.579,
    "end": 1412.422,
    "text": "And you can see the signal already looks much more random than our sine wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1413.603,
    "end": 1419.106,
    "text": "And when we reconstruct it in phase space, I don't really see a shape here that we can get much out of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.287,
    "end": 1423.709,
    "text": "And underneath, you see our recurrence plot, and it looks similarly random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.729,
    "end": 1425.971,
    "text": "You could think of it like white noise on your television even.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.292,
    "end": 1431.635,
    "text": "Finally, on the right, we see a time series extracted from speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.195,
    "end": 1434.717,
    "text": "It's a little bit deterministic, like our sine wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.057,
    "end": 1436.398,
    "text": "If it goes up, it's going to come down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.467,
    "end": 1439.269,
    "text": " But it's also drifting a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.589,
    "end": 1449.016,
    "text": "And you can see if we reconstruct that face space instead of a simple oval, we're seeing a sort of transient signal here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.177,
    "end": 1458.404,
    "text": "And in the recurrent spot, we're also going to be seeing variation in length in these diagonals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.184,
    "end": 1464.649,
    "text": "And finally, recurrent spots can contain these vertical structures that you don't see here in addition to diagonals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.496,
    "end": 1468.457,
    "text": " And these are indications of periods of stability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.877,
    "end": 1470.678,
    "text": "We measure these with a value called laminarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.399,
    "end": 1473.64,
    "text": "And laminarity, you can contrast it with determinism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.22,
    "end": 1480.503,
    "text": "It measures how a signal is organized in terms of similar absolute values that are stable over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.523,
    "end": 1485.486,
    "text": "And this is one representation of recurrent spots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.367,
    "end": 1492.63,
    "text": "It takes a little bit of time to get comfortable with what a recurrent spot is, so I just have a different visualization to show you a little bit of the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.874,
    "end": 1500.001,
    "text": " So these are the same set of RQA measures that we take from our system and plot on recurrence plots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.102,
    "end": 1503.365,
    "text": "This is demonstrating recurrence rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.445,
    "end": 1508.851,
    "text": "It's just the percentage of recurrent points that we see on this recurrent plot over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.431,
    "end": 1512.295,
    "text": "And it represents patterns of behavior that repeat over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.636,
    "end": 1514.237,
    "text": "Determinism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.918,
    "end": 1523.97,
    "text": " It's the percentage of points that fall in a diagonal at any time, and it represents behaviors that belongs to a longer sequence of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.152,
    "end": 1530.459,
    "text": "Entropy, this is the variability in lengths of these diagonal lines down here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.795,
    "end": 1534.596,
    "text": " And it represents the amount of disorder that there might be in these sequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.216,
    "end": 1539.538,
    "text": "Finally, laminarity here are the percentage of points that fall on a vertical line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.078,
    "end": 1543.779,
    "text": "And this represents clusters of behavior that might repeat for a length of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.079,
    "end": 1549.281,
    "text": "Like when a system revisits a period of behavior, leaves and returns to that behavioral state again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.821,
    "end": 1552.722,
    "text": "All right, so it's a lot of theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.742,
    "end": 1555.883,
    "text": "I need to bring you back to the metronome so we know what's going on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.727,
    "end": 1560.448,
    "text": " So what you see here, this is a picture of our uncoordinated metronomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.528,
    "end": 1562.629,
    "text": "They're moving in all sorts of directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.709,
    "end": 1564.669,
    "text": "And finally our coordinated metronomes at the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.79,
    "end": 1573.472,
    "text": "And I took a 30 second acoustic signal from each set of behaviors here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.787,
    "end": 1581.472,
    "text": " And on the right, I have signals from this uncoordinated metronome and the recurrence plot we generated from them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.113,
    "end": 1586.456,
    "text": "And you can see this first recurrence plot, it resembles that kind of uncorrelated white noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.957,
    "end": 1588.178,
    "text": "I don't see a lot of structure here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.292,
    "end": 1595.817,
    "text": " And then in our time series for the coordinated metronomes, you start to see some periodicities kind of in this signal here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.418,
    "end": 1605.685,
    "text": "And you see a lot more of these laminar structures down here in the bottom, these vertical structures, which indicate these periods of stable states in this group metronome behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.236,
    "end": 1612.602,
    "text": " I could break that down even smaller and I could look at five seconds of sound and we see the same structures emerging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.342,
    "end": 1621.791,
    "text": "You can also see a bit more clearly the spikes that occur in the coordinated metronomes that correlate with these vertical structures than we did in the last plot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.592,
    "end": 1623.372,
    "text": " So this is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.752,
    "end": 1624.553,
    "text": "Now you're experts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.593,
    "end": 1631.074,
    "text": "You've learned everything you need to know to evaluate the emergence of coordination when we measure it from a global acoustic signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.354,
    "end": 1634.935,
    "text": "And you know how to visualize it in a recurrence plot and how to interpret that plot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.495,
    "end": 1637.596,
    "text": "So we're going to apply all of this to human data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.636,
    "end": 1645.158,
    "text": "And I want to remember for the metronomes, this platform is the essential coupling mechanism for the emergence of coordinated behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.237,
    "end": 1649.66,
    "text": " For humans, the interaction is totally, totally critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.48,
    "end": 1654.824,
    "text": "So say me and my colleague Marlee Reeves from the Applied Mathematics Department here at UC Merced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.765,
    "end": 1657.106,
    "text": "So we don't need a shared platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.666,
    "end": 1663.25,
    "text": "Instead, we just need to interact with other human beings in order to couple our multi-agent human behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.913,
    "end": 1669.736,
    "text": "So now that we've got this far, I promised you some empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.578,
    "end": 1681.584,
    "text": " And I'm gonna tell you about multi-agent interaction first in a specific musical ensemble performing a specific musical work, and then in the crowds at a basketball game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.964,
    "end": 1691.949,
    "text": "So first our musical ensemble here, they're performing a work called Welcome to the Imagination World by Tasuki Shimizu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.379,
    "end": 1698.743,
    "text": " And this group of musicians, they're performing this piece that was composed to do something interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1698.943,
    "end": 1703.686,
    "text": "So the composer wrote the first few minutes of this musical piece to be completely random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.327,
    "end": 1706.428,
    "text": "In music theory terms, we call this aleatorque.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.769,
    "end": 1712.613,
    "text": "It's when some element of the music is left up to chance or to whatever the performers decide to play in that moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.734,
    "end": 1716.656,
    "text": "So the start of this piece sounds a little bit like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.317,
    "end": 1750.899,
    "text": " Okay, that flute gets a little loud for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.039,
    "end": 1756.003,
    "text": "So this is not the musicians warming up on stage, this is the actual music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.823,
    "end": 1760.146,
    "text": "The musicians themselves are instructed not to interact with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.158,
    "end": 1768.784,
    "text": " And you can see this is kind of hard for musicians because you do hear musicians sort of taking turns starting each musical line a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.545,
    "end": 1772.027,
    "text": "And it's a little bit hard to play completely random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.067,
    "end": 1779.553,
    "text": "You hear some folks playing scales up and down, but in general, this is supposed to sound random and they're not supposed to be coordinated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.275,
    "end": 1786.979,
    "text": "And after a few minutes, the musical score actually directs the musicians to begin coordinating with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.6,
    "end": 1790.162,
    "text": "And when this happens, I'll show you what that sounds like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.48,
    "end": 1803.72,
    "text": " so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1840.116,
    "end": 1841.818,
    "text": " I'm gonna stop it right before it gets exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.019,
    "end": 1848.263,
    "text": "So once they've been coordinating with each other, they begin to sound like one interacting musical ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.244,
    "end": 1855.83,
    "text": "So this musical interaction is serving as the coupling mechanism and the coordination between the musicians",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.372,
    "end": 1860.212,
    "text": " arises and they begin to sound like one interacting ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.97,
    "end": 1868.631,
    "text": " Now we're not seeing emergent or spontaneous interaction in this particular musical composition and this performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.251,
    "end": 1874.092,
    "text": "The musicians are told by the musical score precisely when to begin coordinating their actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.992,
    "end": 1883.914,
    "text": "And in this particular performance, the divide between uncoordinated and joint music making is made even more apparent by a theatrical trick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.234,
    "end": 1890.555,
    "text": "The lights turn on and then the conductor arrives on stage just as the musicians began to play together as one ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.195,
    "end": 1900.402,
    "text": " But I'm using this as a model system because I know the behavior they're supposed to be engaged in, and I know that there's going to be a transition from uncoordinated to coordinated behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.422,
    "end": 1903.604,
    "text": "So I can use that knowledge to ask the questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.424,
    "end": 1915.632,
    "text": "Are there any differences in nonlinear recurrence dynamics measured by RQA between the uncoordinated acoustic behavior and the coordinated behavior of this musical ensemble?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.075,
    "end": 1919.175,
    "text": "And.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.768,
    "end": 1922.329,
    "text": " Spoiler alert, there absolutely are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.589,
    "end": 1929.471,
    "text": "So at the top, you're seeing the first and last 30 seconds of that first piece, that first part of the performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.331,
    "end": 1937.353,
    "text": "On the bottom, you're seeing the first and last 30 seconds of the second part of the performance once the musicians have become coordinated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.654,
    "end": 1945.916,
    "text": "And we can see that the acoustic behavior from these musicians in the coordinated section of the music is more structured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.296,
    "end": 1948.497,
    "text": "We see these bursty vertical lines here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.66,
    "end": 1956.823,
    "text": " where you have these stretches of connected stretches of sound for periods of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.643,
    "end": 1968.868,
    "text": "Again, we can look even closer at five-second samples, and we can see the same vertical structures in the coordinated but not the uncoordinated sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.528,
    "end": 1971.829,
    "text": "If I take just these little blocks here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.24,
    "end": 1979.984,
    "text": " zoom in to five seconds, we see a little bit more structure here and a little bit less or a little bit noisier structure here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.245,
    "end": 1983.166,
    "text": "These are just for visualizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.307,
    "end": 1988.99,
    "text": "This is not actually the five second snippet here, but it works for getting the idea across.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.691,
    "end": 1991.452,
    "text": "Okay, so cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.552,
    "end": 1997.416,
    "text": "I see these structures in the recurrence plot, but is it really more structured when musicians are coordinated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.477,
    "end": 2002.339,
    "text": "We can do some statistics and we can visualize our data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.272,
    "end": 2004.973,
    "text": " in another way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.013,
    "end": 2009.22,
    "text": "So these are distributions of all of those measures that we extracted from the recurrence plot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.137,
    "end": 2015.181,
    "text": " And you can see coordinated sections in blue, uncoordinated sections in red.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.201,
    "end": 2024.929,
    "text": "And we're seeing that when the musicians begin interacting with each other as a coordinated musical ensemble, recurrence and stability measures increased overall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.089,
    "end": 2034.156,
    "text": "So we have higher, also more variable RQA measures when they're coordinated, and we see lower and less variable RQA measures when they're uncoordinated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2034.176,
    "end": 2037.559,
    "text": "And we can see this even a little more clearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.459,
    "end": 2042.543,
    "text": " if we can plot those same measures over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.703,
    "end": 2054.993,
    "text": "And the blue and purple lines here are representing uncoordinated section of the piece, orange and green is represented, sorry, blue and purple is coordinated, orange and green is uncoordinated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.391,
    "end": 2067.176,
    "text": " And we can see that over time when the musicians are coordinated and acting like one interacting ensemble, they're able to explore a greater variety of recurrence dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.356,
    "end": 2072.658,
    "text": "They're able to explore more behavioral states than when they're uncoordinated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.678,
    "end": 2077.64,
    "text": "And we see all of these measures, no matter what they are, hovering around a small subset of dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.841,
    "end": 2078.941,
    "text": "Now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.465,
    "end": 2082.066,
    "text": " You would be forgiven if you are skeptical of these results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.686,
    "end": 2085.827,
    "text": "After all, the entire musical performance is over eight minutes long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.267,
    "end": 2091.708,
    "text": "Maybe I simply chose the most uncoordinated sections and the most uncoordinated sections of the song.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.688,
    "end": 2094.189,
    "text": "And you'd be smart to have this worry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.269,
    "end": 2096.049,
    "text": "Our peer reviewers shared the same worry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.67,
    "end": 2098.21,
    "text": "So we graphed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.905,
    "end": 2101.567,
    "text": " the time series of RQA metrics for the entire piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.247,
    "end": 2111.152,
    "text": "And it's pretty clear, even if you don't know what these values are, that there's some difference in all of these top pink and blue kind of graphs and these bottom orange and green type of graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.353,
    "end": 2125.28,
    "text": "We're seeing this same greater variability, greater values and more variability in each of these RQA metrics when the musicians are coordinated than when they are performing as a bunch of individuals on stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.967,
    "end": 2144.981,
    "text": " And the takeaway here is that these musicians, when they're interacting together as a musical ensemble, they're able to explore a greater variety of acoustic behavior when they formed a single complex system, an interpersonal synergy, than when they were acting as a lot of individuals on stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.521,
    "end": 2151.726,
    "text": "And we were able to use these nonlinear statistical methods from dynamical systems theory to measure that change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.514,
    "end": 2156.276,
    "text": " Cool, so that's a musical ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.297,
    "end": 2160.099,
    "text": "I'm using it as a model system because we know what the behavior should be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.2,
    "end": 2168.927,
    "text": "Can I measure this from a different kind of system, one that doesn't have a script dictating the behavior of what's going on on the stage?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.528,
    "end": 2176.794,
    "text": "So to do that, I look at data recorded from the student section of a BYU basketball game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.015,
    "end": 2178.335,
    "text": "And this data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.555,
    "end": 2185.778,
    "text": " was collected by Butler and colleagues and labeled by many hardworking undergraduate students.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.319,
    "end": 2194.743,
    "text": "And we have basically recordings from the crowd that are labeled based on what kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.693,
    "end": 2197.754,
    "text": " Crowd sounds they're making whether they're cheering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.774,
    "end": 2223.081,
    "text": "This is like a loud positive crowd book vocalization vocalization Whether they're applauding so this is mostly clapping but can include some vocalization Distraction noise when you're trying to distract someone from a free throw mainly positive chants, so this is the fans chanting their their BYU Cougars chant or defense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.492,
    "end": 2227.555,
    "text": " Negative chanting, it's when they're angry rather than cheering positively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.076,
    "end": 2229.057,
    "text": "Singing and then silence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.479,
    "end": 2235.265,
    "text": "So we're taking this data and we're going to ask a similar question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.665,
    "end": 2242.214,
    "text": "So we don't have a clear transition from uncoordinated to coordinated behavior, but we do have all of these different types of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.234,
    "end": 2254.744,
    "text": " So we're going to ask, is there a relationship between nonlinear recurrence dynamics measured by RQA and these different categories of acoustic behavior at the crowd at this basketball game?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.465,
    "end": 2256.766,
    "text": "And we follow the same process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.486,
    "end": 2262.911,
    "text": "We extract acoustic signals and we cut them up into five second samples here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.493,
    "end": 2266.875,
    "text": "And we use these signals to generate recurrence plots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.97,
    "end": 2272.073,
    "text": " And we take the measures from that recurrent spot to see if there's anything different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.593,
    "end": 2275.214,
    "text": "And I'm going to show you just two recurrent spot on the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.234,
    "end": 2280.017,
    "text": "I'm going to show you a plot from positive chanting and from distraction noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.961,
    "end": 2287.181,
    "text": "So here's distraction noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.002,
    "end": 2289.042,
    "text": "It looks like white noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.163,
    "end": 2291.424,
    "text": "It looks like what you would see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.105,
    "end": 2293.166,
    "text": " on your television screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.186,
    "end": 2297.048,
    "text": "And when I show you positive chant, there's clearly a striking difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.268,
    "end": 2304.692,
    "text": "There's almost no structure in this distraction noise here, but there are very clear laminar bursts of activity represented in these vertical lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.828,
    "end": 2313.378,
    "text": " And in fact, these two plots look very similar to our unsynchronized and synchronized metronomes way back from the middle of this talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.019,
    "end": 2315.441,
    "text": "And intuitively, this makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.082,
    "end": 2320.067,
    "text": "If you're trying to distract someone during a free throw, you're making all sorts of random sounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.107,
    "end": 2321.789,
    "text": "You might be shaking your keys around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.829,
    "end": 2323.532,
    "text": "People are stomping on the stands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.092,
    "end": 2333.274,
    "text": " But if you're cheering your team on, trying to motivate them to score more points, or if you're mounting a strong defense, you're going to be working together, shouting whatever your chant is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.414,
    "end": 2335.495,
    "text": "Go team, go defense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.955,
    "end": 2339.036,
    "text": "And it's going to occur in a very rhythmic metronomic faction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.716,
    "end": 2346.838,
    "text": "And we can compare how all of these distributions of our QA metrics look between each different kind of crowd noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.698,
    "end": 2350.999,
    "text": "And you can see there's quite a lot of overlap, but there's also some difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.769,
    "end": 2364.011,
    "text": " So positive and negative chat seem to be a bit similar to each other in every category, which makes sense because whether they're chanting in a positive or negative energy, it's still this rhythmic, isochronous behavior that's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.352,
    "end": 2372.613,
    "text": "Distraction noise, cheer, and applause, on the other hand, all seem pretty similar to each other, no matter where we look at them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.873,
    "end": 2378.374,
    "text": "And then finally, all the way on the lowest scale is angry noise here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.394,
    "end": 2379.794,
    "text": "And one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.547,
    "end": 2385.37,
    "text": " thing to note is we had very few samples of angry noise here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.85,
    "end": 2388.492,
    "text": "So that could be why we're seeing a few of these differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.672,
    "end": 2392.775,
    "text": "And if we had more samples, maybe angry noise would look a bit more like distraction noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.756,
    "end": 2398.279,
    "text": "So visually, we can see there are differences in these RQA metrics for all of these crowd sounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.26,
    "end": 2403.083,
    "text": "And we don't want to just do visuals, so we can do some statistics here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2404.192,
    "end": 2412.975,
    "text": " This is just another visualization of our estimated marginal means showing pairwise comparisons between every crowd sound category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.615,
    "end": 2417.456,
    "text": "And it's a graphical representation of the estimated marginal means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.976,
    "end": 2426.539,
    "text": "If these red lines overlap, that means there are not significant differences between, for instance, distraction noise, cheer and applause here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.259,
    "end": 2429.42,
    "text": "Positive and negative chant do look different, however.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.683,
    "end": 2431.243,
    "text": " Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.864,
    "end": 2434.265,
    "text": "And then angry noise is far out by itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.846,
    "end": 2441.208,
    "text": "So knowing this, I mentioned very briefly earlier, I have a colleague in the applied mathematics department.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.889,
    "end": 2451.234,
    "text": "And one thing she's interested in is whether we can give a machine learning algorithm some of these RQA metrics to tell the difference between these different crowd sounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.248,
    "end": 2461.254,
    "text": " Um, the researchers at BYU have done this with traditional sound metrics, spectral analysis, captural analysis, and we're doing it with our RQA metrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.534,
    "end": 2465.557,
    "text": "So we're focused more on the rhythmic content rather than pitch or spectral content of the sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.577,
    "end": 2469.539,
    "text": "And she's, um, is doing this in two ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.939,
    "end": 2477.004,
    "text": "Uh, so one is training a neural network with image classification, um, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.859,
    "end": 2495.386,
    "text": " What I'm going to show you a few results from is a random forest that is using these recurrent features as input and doing some feature vector classification using decision trees and doing some stuff that if you ask me questions about, I will not know the answer because I'm not the mathematician in this context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.566,
    "end": 2498.047,
    "text": "But once she's trained that algorithm,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.091,
    "end": 2503.397,
    "text": " it can actually learn the differences between these crowd sounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.437,
    "end": 2508.185,
    "text": "If these are dark blue along the diagonal, that means that it categorized cheer very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.525,
    "end": 2510.649,
    "text": "If they're light blue, that means there was some confusion here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.669,
    "end": 2512.272,
    "text": "If we remember,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.787,
    "end": 2520.15,
    "text": " through one of the previous graphs, applause, distraction, noise, all kind of look similar to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.45,
    "end": 2531.555,
    "text": "So if we sort of smoosh those into one distraction category, put applause and cheer together and put positive and negative chance here, we get even better classification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.675,
    "end": 2534.056,
    "text": "And this part is something we're still working on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.076,
    "end": 2537.918,
    "text": "Hopefully we will be ready to submit it in a paper kind of soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.619,
    "end": 2544.041,
    "text": "But now that we're ending on this really complex point, what have we learned?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.118,
    "end": 2551.625,
    "text": " First, we took a quick dive into dynamical systems theory and the notion of interpersonal synergies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.286,
    "end": 2559.235,
    "text": "I told you that interpersonal synergies form when a functional coupling emerges between the behavior of two or more individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.936,
    "end": 2564.262,
    "text": "This kind of synergy can arise when individuals begin to coordinate and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.75,
    "end": 2567.152,
    "text": " as an integrated multi-agent group of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.152,
    "end": 2579.299,
    "text": "But measuring this emergence of coordination in large groups of people is difficult, even if we can intuitively hear the difference between a coffee shop crowd and a crowd at a concert or sporting event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.2,
    "end": 2587.544,
    "text": "Without individual signals from each person in this interacting group, it's very hard for scientists to measure when the coordination occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.405,
    "end": 2591.227,
    "text": "But if we can hear this difference, then maybe we can measure it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.315,
    "end": 2599.979,
    "text": " So we practiced with a toy model, a pair of coupled metronomes transitioning from uncoordinated to coordinated activity, unsynchronized to synchronized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.62,
    "end": 2610.225,
    "text": "And then we applied these same nonlinear statistical analysis techniques from dynamical systems to measure uncoordinated and coordinated behavior in a musical ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.169,
    "end": 2618.29,
    "text": "Transitioned once too far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.167,
    "end": 2624.189,
    "text": " Ah, my musical ensemble is behind our graphs here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.209,
    "end": 2625.13,
    "text": "Apologies about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.21,
    "end": 2626.331,
    "text": "I can come back to this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.592,
    "end": 2632.456,
    "text": "So when we want to learn something about social behavior, music provides a good model system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.036,
    "end": 2638.2,
    "text": "You know roughly and can manipulate what roles each member of the musical group is performing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.681,
    "end": 2648.148,
    "text": "And sometimes you even have the aid of a musical script like we did to be able to carefully measure the coordination dynamics that emerge in this joint music making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.244,
    "end": 2663.952,
    "text": " These same intentional interdependencies which arise from a group of musicians co-creating music together can also emerge as the result of local interaction between individuals in large interaction groups of people, like crowds at a basketball game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.013,
    "end": 2676.919,
    "text": "And we investigated that by measuring the different crowd sounds that these fans made and the different acoustic behavioral dynamics we could observe in each of these crowd sounds with fans at a BYU basketball game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.473,
    "end": 2690.784,
    "text": " And all of this work was not done just by me, but also my colleague, Marley Reeves in the Applied Mathematics Department, my advisor, Ramesh Balasubramaniam, and also our colleagues, Chris Kello and Michael Spivey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2691.465,
    "end": 2692.646,
    "text": "So that's all I got.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.986,
    "end": 2694.828,
    "text": "Thank you so much for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.848,
    "end": 2703.776,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.437,
    "end": 2704.757,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.239,
    "end": 2714.12,
    "text": " You can unshare and I'll ask some questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.18,
    "end": 2717.341,
    "text": "And if anyone in the live chat has questions, they can also ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.701,
    "end": 2719.261,
    "text": "Sounds great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.301,
    "end": 2720.621,
    "text": "Are you going back to the slide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.341,
    "end": 2722.542,
    "text": "I was going to go back to the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.622,
    "end": 2724.402,
    "text": "I also cannot find the unshare button.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.744,
    "end": 2731.644,
    "text": "Ah, it's fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.344,
    "end": 2735.225,
    "text": "It's the same as the share button, but yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.665,
    "end": 2736.925,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.045,
    "end": 2737.105,
    "text": "Oh."
  },
  {
    "start": 2744.679,
    "end": 2765.508,
    "text": " all right well a lot of very interesting research and really appreciate the care into kind of speaking it very concisely and clearly so just if i could give one takeaway that i thought was really fascinating so you in the fusaroli 2014 quotation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.509,
    "end": 2782.467,
    "text": " you talked about how there was like synergy and about the continuum and the spaces that are uncoordinated versus increasingly coordinated from the sheet music, which is one type to the emergent coordination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.208,
    "end": 2783.589,
    "text": "And then, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.619,
    "end": 2800.73,
    "text": " I thought that was an interesting way to open up coordination, not in a framework of either strong versus weak emergence, but rather within a directly measurable dynamical systems perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2801.351,
    "end": 2812.12,
    "text": "And then at the end to do the machine learning and be able to train a model on the recurrence statistics and then identify the system, it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.901,
    "end": 2823.864,
    "text": " there's information about the system state as identified by experts, which is what that labeling task was about, that's retained like just in the coordination pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.904,
    "end": 2832.306,
    "text": "And so there's something about the patterns across systems that can be generalized that captures also important information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.046,
    "end": 2838.587,
    "text": "And that's an intuition that I think people often bring up when talking about dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2839.207,
    "end": 2841.788,
    "text": "But I really thought it was made clear with how you presented it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.588,
    "end": 2843.288,
    "text": " Yeah, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.568,
    "end": 2847.189,
    "text": "I'm glad that I got across those kind of message I was trying to share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.57,
    "end": 2854.471,
    "text": "One place to maybe start is this soft assembly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.591,
    "end": 2857.692,
    "text": "So where does this soft assembly come into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.752,
    "end": 2862.853,
    "text": "And I guess just what does it mean in human teams or communication?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.374,
    "end": 2865.314,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.474,
    "end": 2871.916,
    "text": "So this notion of soft assembly, let me think of something that's not soft, something that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.12,
    "end": 2880.662,
    "text": " Oh, I don't have an opposite example to soft assembly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.782,
    "end": 2881.562,
    "text": "So if you take like a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.417,
    "end": 2892.184,
    "text": " a tool, like, I don't know, a wrench, it only can move in one way, the parts of the wrench or the parts of a set of pliers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.204,
    "end": 2893.204,
    "text": "They're not softly assembled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.445,
    "end": 2897.848,
    "text": "They're always attached and they're always going to perform that function, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.669,
    "end": 2906.636,
    "text": "But if we think about lots of kind of systems, if we think about human systems, if we think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.315,
    "end": 2918.907,
    "text": " ant colonies, or if we think about anything where an individual member of that system could leave if it wanted to, or could leave when they're not interacting, that's what we would call a softly assembled system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.12,
    "end": 2927.641,
    "text": " And a group of humans, the example that I was thinking of was any group of humans that comes together for some amount of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.681,
    "end": 2936.963,
    "text": "If we're talking about musicians on stage, they're together and they function as a string quartet or as an orchestra, so long as they're on stage and performing together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.583,
    "end": 2940.384,
    "text": "But then they can pack their instruments up and they can go home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.924,
    "end": 2948.025,
    "text": "So there's not a strong bond or like a strong physical mechanical connection that's forcing their interaction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.028,
    "end": 2949.729,
    "text": " to occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.549,
    "end": 2953.531,
    "text": "It's just happening during that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.593,
    "end": 2959.476,
    "text": "Because you also connected that to the transient motor chains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.996,
    "end": 2964.019,
    "text": "And so that was pretty interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.141,
    "end": 2968.463,
    "text": "Again, anyone who's watching live can ask a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.503,
    "end": 2971.805,
    "text": "Otherwise, I'll just keep on asking about a few points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.086,
    "end": 2977.17,
    "text": "So you use the metronome as a example of synchronization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.561,
    "end": 2988.767,
    "text": " but also there's listening to repetitive music, whether it's like electronic music that's repetitive or other kinds of music, binaural beats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.128,
    "end": 3001.175,
    "text": "So what is this repetition listening nature and what kind of makes us select a given level of repetition to desire?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.195,
    "end": 3007.319,
    "text": "How do we think about that in terms of how you presented it with the recurrence here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.612,
    "end": 3011.019,
    "text": " Yeah, so there's two things that I would think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.159,
    "end": 3016.835,
    "text": "So first you mentioned binaural beats and we wanna listen to these very repetitive musical patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.423,
    "end": 3025.787,
    "text": " And so there's two ways that our brains might be interpreting rhythmic patterns in music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.547,
    "end": 3033.191,
    "text": "One notion that is probably very amenable to the active inference lab and what you talk about is predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.631,
    "end": 3039.474,
    "text": "And the idea that we have these hierarchical predictions that are happening in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.534,
    "end": 3047.238,
    "text": "So when we perceive this low level stimulus, this rhythmic input, we're constantly predicting when the next input is gonna arrive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.496,
    "end": 3051.037,
    "text": " And we're only passing up areas when our prediction is wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.518,
    "end": 3057.141,
    "text": "And isochronous, these very rhythmic beats, are really easy to predict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.136,
    "end": 3060.737,
    "text": " But there's another option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3061.257,
    "end": 3063.137,
    "text": "It could be that we're not doing any prediction at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.557,
    "end": 3070.299,
    "text": "And we just have these inherent oscillations, these natural frequencies of oscillations in our brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.119,
    "end": 3083.003,
    "text": "And when we hear a rhythmic pattern that is similar enough, we naturally entrain to that beat or that rhythm drives this oscillatory behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.043,
    "end": 3087.444,
    "text": "And so you have this emergent entrainment and no predictions necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.473,
    "end": 3089.454,
    "text": " And you could be in either camp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.454,
    "end": 3096.479,
    "text": "I alternate between being a firmly predictive coding camp and being a entrainment camp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.08,
    "end": 3117.615,
    "text": "But this, either way, what seems to be really important in this activity is activity of your motor system and your ability for your motor system, which is really good at making periodic movements like moving, walking, the ability of the motor system to help the auditory system to communicate with the auditory system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.862,
    "end": 3124.066,
    "text": " in predicting when the next beat occurs or in training to the beat of a sound like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.086,
    "end": 3127.528,
    "text": "And that's with binaural beats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.888,
    "end": 3135.753,
    "text": "The second thing that I would bring up is we like these binaural beats, maybe they're relaxing for some people, but we're listening to music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.294,
    "end": 3138.135,
    "text": "There's a phenomenon called musical groove.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.564,
    "end": 3142.625,
    "text": " And this is when it's very scientific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.645,
    "end": 3144.265,
    "text": "No, it is actually the scientific term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.305,
    "end": 3146.946,
    "text": "Peter Janata in 2012 coined this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.266,
    "end": 3155.569,
    "text": "And it's when the rhythm of the music is just complicated enough that it makes us want to move to music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.649,
    "end": 3159.67,
    "text": "So it's just in that sweet spot where it's predictable, but not quite predictable enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.75,
    "end": 3164.751,
    "text": "And it engages our motor system instead of just passively engaging it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.471,
    "end": 3167.332,
    "text": "It actually makes us move to the beat of the music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.152,
    "end": 3174.318,
    "text": " This might be because when we move, when we tap our foot, when we dance, we're better able to predict when the next beat happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.649,
    "end": 3203.816,
    "text": " thanks the the groove uh again jargon so apologies it it reminds me of the zone of proximal development and kind of what does it mean if there was a build up and too much tension being built like a ramping but then there's for example um when there's quarter notes for two measures and then eighths and then sixteenths and then it's like when it goes even faster and then it it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.056,
    "end": 3218.648,
    "text": " it's like a meme with making it more exciting because it's reflecting a cultural and potentially related to biology like our priors on increasing rate of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3220.803,
    "end": 3223.926,
    "text": " the sound is like meaning something because it can't go on forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.966,
    "end": 3226.049,
    "text": "So then something is exciting or something's changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.63,
    "end": 3230.074,
    "text": "So then that's very interesting about how our, like what is quiet?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.154,
    "end": 3230.854,
    "text": "What is loud?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.935,
    "end": 3231.896,
    "text": "What do those represent?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3231.956,
    "end": 3237.542,
    "text": "And what are the priors of the musical experience that becoming cultured in different ways?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3238.78,
    "end": 3253.651,
    "text": " So yeah, maybe how does it help us think about different preferences amongst individuals in the kind of music that they want to play or engage in or listen to or how they want to engage with that music?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.592,
    "end": 3259.215,
    "text": "Yeah, so much content in what you just said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.035,
    "end": 3266.116,
    "text": " So one is this notion of anticipation when the rhythm keeps getting faster and faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.496,
    "end": 3284.459,
    "text": "And there's a whole book by Leonard Meyer about how music is correlated with emotions and how there's this idea that a composer is playing with these periods of tension and release.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.999,
    "end": 3289.28,
    "text": "So whether that tension is from buildup of rhythmic events, and we usually expect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.738,
    "end": 3301.57,
    "text": " the faster rhythm gets, maybe it's associated with a certain activity in the music, or we expect it to slow down after it's gotten faster for so long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.511,
    "end": 3309.118,
    "text": "Or you're thinking about when the beat drops in a piece of electronic music, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.183,
    "end": 3323.75,
    "text": " We can play with the rhythm or we can play with the musical pitch and we might have a certain set of chords that usually lead up to a certain resolution and we can trick everyone in the audience if we play a different chord instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.391,
    "end": 3330.534,
    "text": "But you mentioned this kind of idea of different individuals liking different kinds of music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.198,
    "end": 3333.259,
    "text": " and this zone of proximal development too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.02,
    "end": 3342.866,
    "text": "So this is really getting into how the music that we're exposed to shapes the expectations that we're going to have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.127,
    "end": 3352.213,
    "text": "So if you grew up hearing Western music, if you are trained in Western classical music, you have certain expectations of what rhythms are allowed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.414,
    "end": 3357.536,
    "text": " of what kind of melodic or harmonic progression is gonna happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.416,
    "end": 3367.239,
    "text": "But when you hear a different kind of music, it might not even register to you as music the first time you hear it until you learn about it, until you learn about the music of that culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.18,
    "end": 3372.041,
    "text": "Even if it's music within your own culture, say you listen to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.772,
    "end": 3397.518,
    "text": " hard rock for the first time or like like heavy metal for the first time it might just sound like noise until you're exposed to it enough or if you study the patterns of of how that music um moves in time it's like the plastic learning phase which is always continuing but especially during early developmental phases uh it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.827,
    "end": 3410.454,
    "text": " patching on to patterns and rhythms and whether the four beat measure or different pitches and rhythms are familiar or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.494,
    "end": 3413.696,
    "text": "That's very interesting area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3413.896,
    "end": 3422.061,
    "text": "So how would one model that and or where do you see active inference in this discussion and what you've discussed here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.892,
    "end": 3426.374,
    "text": " Yeah, so there's been predictive coding approaches at modeling this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.334,
    "end": 3432.056,
    "text": "Also the information dynamics of music is one model that comes to mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.157,
    "end": 3442.081,
    "text": "Or if you think of any of these AI music generators, Google has an AI that plays music like Bach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.561,
    "end": 3445.563,
    "text": "Actually that might not be Google, but there is an AI that plays music like Bach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.723,
    "end": 3447.504,
    "text": "Google has...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.578,
    "end": 3453.019,
    "text": " different music AIs that you can actually interact with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.18,
    "end": 3468.366,
    "text": "And what you do here is you turn all of the music into symbols for the computer, and you're gonna encode what the pitch is, you're gonna encode what the rhythm is in a set of however many different numbers you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.468,
    "end": 3478.775,
    "text": " And then you can kind of take measures of maybe the Shannon entropy of how likely you are to expect this note knowing that that note has played.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.795,
    "end": 3489.564,
    "text": "And if you've only trained this AI on Bach chorales maybe, then you know the notes are mostly gonna be quarter notes, maybe half notes, maybe an eighth note here or there and some whole notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.004,
    "end": 3493.827,
    "text": "So you already are constrained with the type, the length of note that you're gonna hear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.768,
    "end": 3498.91,
    "text": " And Bach chorales follow a similar pattern every single chorale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.65,
    "end": 3517.977,
    "text": "So you know the probability of you hearing the tonic chord at this point in time and not hearing a major second or hearing a certain step at this point in time because you've mapped out all of those probabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.741,
    "end": 3522.802,
    "text": " And lots of people do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.962,
    "end": 3531.789,
    "text": "I don't do that kind of AI or modeling work with musical scores myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.674,
    "end": 3544.98,
    "text": "So they're creating musical scores with what imperative or for what end?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.081,
    "end": 3548.182,
    "text": "That's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.202,
    "end": 3548.242,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3551.65,
    "end": 3559.675,
    "text": " I've actually worked with a co-author who submitted a manuscript, and that's kind of one of the questions we ask waiting on reviews back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.756,
    "end": 3563.918,
    "text": "But we're looking at all of these different kind of music-making AIs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.68,
    "end": 3568.822,
    "text": "And we're coming at the question from another angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.862,
    "end": 3577.448,
    "text": "We're kind of asking whether they can make music and whether it's good music and what's missing if they can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.753,
    "end": 3588.037,
    "text": " And that's because when we're talking about humans and why humans make music, a lot of it comes down to the social interaction that music allows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.098,
    "end": 3591.639,
    "text": "So music seems to facilitate social bonding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.54,
    "end": 3604.707,
    "text": "If I am drumming in time with you, even if I'm walking in time with you, but if I'm doing something in time with you, whether it's drumming or tapping or making music, I probably will like you more after that event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.604,
    "end": 3613.307,
    "text": " And it's also a tool that we use parents to infants to soothe them if you think about lullabies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.507,
    "end": 3618.449,
    "text": "And there's a lot about music that seems to be rooted in social bonding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.87,
    "end": 3623.132,
    "text": "And music also activates reward systems in our brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.652,
    "end": 3629.135,
    "text": "So we get a dopamine rush when we get to that peak experience in music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3631.25,
    "end": 3640.235,
    "text": " There's some recent work, and I can't remember who put it out, that if you listen to music, you're getting similar activation as if you had engaged in exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.095,
    "end": 3642.476,
    "text": "We use music in therapy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3643.337,
    "end": 3647.419,
    "text": "Music is connected to a lot of survival and social bonding functions for humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.559,
    "end": 3650.401,
    "text": "But why doesn't AI make music?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.302,
    "end": 3655.203,
    "text": "The AI doesn't need to bond with another AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3657.642,
    "end": 3664.808,
    "text": " Maybe they're getting reward in terms of like a value function that we've programmed into the AI to say like, oh good, that was a good musical line that you made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.828,
    "end": 3666.409,
    "text": "Now do it again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.429,
    "end": 3669.232,
    "text": "But like what motivation do they have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.892,
    "end": 3675.557,
    "text": "There's also no connection to any sort of like interoceptive states or physiological states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.797,
    "end": 3682.783,
    "text": "If we think about listening to music before we go to the gym, we listen to music to hype us up and get us pumped and it's raising our blood pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.803,
    "end": 3683.524,
    "text": "It's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.286,
    "end": 3696.845,
    "text": " getting us our body prepared to do the activity we want to do and at night we might listen to calming soothing music lower blood pressure lower breathing rate to prepare to go to sleep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.856,
    "end": 3707.722,
    "text": " What drive does a computer have to sort of maintain these different sort of homeostatic needs at different times of the day or different times of your life compared to a human?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.143,
    "end": 3709.103,
    "text": "It's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.123,
    "end": 3714.287,
    "text": "I don't know if the people who are making AI music are always asking that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.307,
    "end": 3716.988,
    "text": "But have you ever heard of Holly Herndon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.008,
    "end": 3717.049,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.369,
    "end": 3719.91,
    "text": "So she is a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.802,
    "end": 3727.004,
    "text": " electronic music creator who's created a music AI in this space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.384,
    "end": 3731.766,
    "text": "And her notion was to take this idea of, of cultural learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.947,
    "end": 3749.875,
    "text": "And if you could think of the zone of proximal development, but she has, she's trained her, her AI baby with voices of a lot of different people and exposed to a lot of like basically a culture in order for it to generate some sort of music from what she makes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.935,
    "end": 3751.876,
    "text": "And she has some really interesting art in that space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.313,
    "end": 3757.955,
    "text": " It's a little bit like the tree falling in the forest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.035,
    "end": 3759.235,
    "text": "Is it a noise or a sound?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.255,
    "end": 3760.316,
    "text": "Does someone have to listen to it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3760.496,
    "end": 3771.563,
    "text": "If you have a bunch of auto-generated songs in a genre, but no human experienced writing them, no one experienced listening to them, it's like, did it ever happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.224,
    "end": 3774.705,
    "text": "That's quite an interesting idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3774.785,
    "end": 3780.188,
    "text": "And it's also, it's a cross media issue with generated text and image.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.049,
    "end": 3781.509,
    "text": "And yeah,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.81,
    "end": 3788.852,
    "text": " That also makes me think about a John Cage quote talking about music and duration and time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3789.112,
    "end": 3792.814,
    "text": "So maybe, what do you think about music and time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.854,
    "end": 3794.775,
    "text": "Music and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.795,
    "end": 3801.237,
    "text": "So stereotypically, whenever we think of John Cage, think of that four minutes and 33 seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.037,
    "end": 3805.939,
    "text": "He sits in front of the piano, starts a timer, and is just silent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.66,
    "end": 3811.441,
    "text": "There's Mariusz Kozak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.352,
    "end": 3823.901,
    "text": " if I'm remembering right, actually writes about music and time and the idea that music is deeply linked to movement in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.921,
    "end": 3834.569,
    "text": "And it's sort of a way to express movement in time through not just the auditory lens, but also through dance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3834.609,
    "end": 3837.351,
    "text": "So like thinking of dance, it's a form of music as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.371,
    "end": 3838.632,
    "text": "And seeing how...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3840.46,
    "end": 3846.063,
    "text": " Not only something like auditory music, but dance is prevalent in every culture in the globe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3846.723,
    "end": 3856.728,
    "text": "And I think there's something important to the notion of time and maybe music as the choreographing of movement through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.892,
    "end": 3864.997,
    "text": " Because if we think about, you mentioned generated language or images, these are static pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.458,
    "end": 3872.003,
    "text": "You can look around the scene or you can read the text, but music has to happen in the temporal domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.063,
    "end": 3875.105,
    "text": "You have to listen to it over a period of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.485,
    "end": 3878.588,
    "text": "Once a note is played, it's gone after that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.028,
    "end": 3884.532,
    "text": "Or once you've enacted a particular dance, it's gone after that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.133,
    "end": 3901.643,
    "text": " And I don't know, I don't have like a nice way to wrap that up about why time's important, but it's definitely an important feature of music and of dance that you're not gonna find in other art forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.043,
    "end": 3906.366,
    "text": "You might find, you could think of it in a narrative, has to happen over time because you're reading it over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.648,
    "end": 3913.471,
    "text": "And that's part of why, so in my neuroscience work, I study how we perceive musical rhythm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.827,
    "end": 3922.07,
    "text": " So if we perturb the time that a musical rhythm is happening, how does our brain cope with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.23,
    "end": 3939.097,
    "text": "Or if we perturb part of the brain that is thought to be involved with timing perception, so this ability to hear beats that are happening in a certain phase or to hear certain rhythms, if we perturb that system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.529,
    "end": 3945.173,
    "text": " Are we going to impair how people perceive the rhythm in that piece of music?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.194,
    "end": 3948.877,
    "text": "And these are questions I'm asking, questions a lot of people are asking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.897,
    "end": 3954.682,
    "text": "It's a very bright landscape right now for that kind of question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.324,
    "end": 3966.153,
    "text": "That's really interesting about bringing the action in and maybe even moving music outside or a little bit beyond just the auditory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.438,
    "end": 3988.855,
    "text": " because then that might open up auditory experiences that aren't music and musical experiences that have a large component um through time but they're not necessarily auditory now so one other thing thinking about the the development of auditory preferences and expectations or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3990.865,
    "end": 4019.324,
    "text": " probably a long time in human history the sounds and the music that one heard was local and like performed if not interactive and then there was a pretty short period of time of like top 40 records cds and then now there's the ability to listen to a huge number of music as well as listen to a small selection many times and uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.388,
    "end": 4044.513,
    "text": " what is that doing to our auditory cognition or or even more broadly that i can listen to the same song with 50 different versions in a row versus that just not being plausible not even so long ago yeah that's an interesting question i haven't thought a lot about it but um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.632,
    "end": 4054.198,
    "text": " I'm basically just tracking from music in the home to everybody's hearing everything, the same thing on the radio, to now we have Spotify and the internet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4054.898,
    "end": 4057.02,
    "text": "And it's probably a question that's not just about music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.06,
    "end": 4058.021,
    "text": "It's also about media.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.041,
    "end": 4065.706,
    "text": "We went from only getting our media or our news from people that we locally interacted with to everybody sitting for the same fireside chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.226,
    "end": 4070.369,
    "text": "So now everybody's in their different bubble for whatever media they're consuming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.352,
    "end": 4094.363,
    "text": " And it's interesting, I know there's been some work, for instance, Mike Hove has looked at how the bass sounds in music have gotten lower over time, lower and louder, which has some impact on how we feel musical groove since the bass is usually where the rhythm sits in pop music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.504,
    "end": 4097.345,
    "text": "But yeah, so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.144,
    "end": 4102.186,
    "text": " what is it doing to like our brains and like our perception of music?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.867,
    "end": 4104.687,
    "text": "That's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.328,
    "end": 4111.972,
    "text": "And you mentioned memes earlier, which made me think of TikTok.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.512,
    "end": 4113.813,
    "text": "And so this like new way of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.23,
    "end": 4116.491,
    "text": " proliferating sounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.311,
    "end": 4130.616,
    "text": "And if you've ever spent very much time on TikTok, there'll be like one sound that everybody's making a dance to, or one sound that people are just playing over the top of the video of their dogs running around, because that sounds popular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4130.636,
    "end": 4134.018,
    "text": "And then when you hear it on the radio,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.14,
    "end": 4142.524,
    "text": " it's a little bit jarring because you only know this like 15 second snippet or however long a TikTok is from that TikTok video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.584,
    "end": 4156.731,
    "text": "And then you realize this is a real song, like a real work of art that somebody made before it became a TikTok meme, which is just pure like personal anecdote, but it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4157.191,
    "end": 4159.833,
    "text": "So if we're getting insulated by like the media we consume,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.115,
    "end": 4164.579,
    "text": " Are we also getting insulated by the type of music we consume?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.839,
    "end": 4171.486,
    "text": "Like, are we less able to appreciate other types of music because I'm listening to the same song in a lot of different renditions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.167,
    "end": 4178.894,
    "text": "Or are we like broadening our musical consumption because I'm able to access music from all over the globe at the click of a button?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4179.755,
    "end": 4180.917,
    "text": "It's probably a little bit of both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.203,
    "end": 4210.348,
    "text": " yeah it's like the space of the action opens up when when there's so many affordances in our niche to select from yet also quite curated and presented in a certain way that just on aggregate probably still does drive people to have shared action and so then like it's literally the platform playing that role of the metronome coupling interaction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.948,
    "end": 4212.929,
    "text": " That's interesting that you bring that up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.829,
    "end": 4218.111,
    "text": "And also, so if we come to this, music is the strive for social bonding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.571,
    "end": 4221.612,
    "text": "And we've just been in this global pandemic, or we still are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4222.433,
    "end": 4227.314,
    "text": "But for many people, we were on various stages of lockdowns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4229.375,
    "end": 4230.877,
    "text": " Live music was not happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.097,
    "end": 4234.659,
    "text": "Choir or musical ensemble rehearsals were not happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.679,
    "end": 4240.423,
    "text": "And you saw this drive to continue to do something like make music together online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4240.723,
    "end": 4245.347,
    "text": "And one of these drives was SheShanties became really popular on TikTok.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.537,
    "end": 4255.16,
    "text": " And it's not something that people were doing together at the same time, because we have this delay that's happening over audio visual communication like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.641,
    "end": 4257.141,
    "text": "It works well when we're taking turns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.201,
    "end": 4259.362,
    "text": "It's harder for trying to synchronize and sing together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.382,
    "end": 4266.445,
    "text": "So TikTok allowed someone to record a sea shanty, and then the next person adds their voice to that recording.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.509,
    "end": 4269.931,
    "text": " and they record their song singing the sea shanty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4270.431,
    "end": 4284.662,
    "text": "And then the next person does the same thing and you end up with these compilations, not compilations, but these like ensemble performances of a song that people would sing when they're off on ships at sea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.703,
    "end": 4291.668,
    "text": "And they're feeling, they're like having this social bond with the people that they're out at sea with the whole time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.708,
    "end": 4296.531,
    "text": "And now it's our song that we're singing through the internet as a way to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4297.657,
    "end": 4301.298,
    "text": " feel like we're having some sort of social bonding and interacting and engaging with people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.598,
    "end": 4312.922,
    "text": "And you saw that on TikTok, you also saw that with celebrities trying to sing when they all gathered together to sing Imagine, we can argue about whether that went well or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.702,
    "end": 4324.105,
    "text": "Or when we saw, basically there was kind of an explosion of different types of online music interaction to try to replace this local,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4325.717,
    "end": 4344.448,
    "text": " interaction of going to a concert and seeing someone on stage around a group of people that you're interacting with together or going to perform or rehearse or jam with your friends in your garage and trying to find digital avenues for the same social role that music traditionally plays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.351,
    "end": 4350.112,
    "text": "Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4352.974,
    "end": 4355.315,
    "text": "And how will it change going forward?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.19,
    "end": 4365.855,
    "text": " Some people may find very immersive sensory experiences to be powerful for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4365.915,
    "end": 4367.416,
    "text": "Maybe that's a scalable approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.456,
    "end": 4368.116,
    "text": "Maybe it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.757,
    "end": 4369.577,
    "text": "Maybe that's a good thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.617,
    "end": 4370.338,
    "text": "Maybe it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4372.339,
    "end": 4374.38,
    "text": "So one other part was like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.967,
    "end": 4390.816,
    "text": " when you were contrasting the musical study that you presented first with the basketball, you mentioned that that environment was unscripted or in contrast to sheet music or like a spoken dialogue that was scripted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.957,
    "end": 4399.341,
    "text": "And then in one sense it is unscripted, but then as per the paper on active inference and scripts,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.64,
    "end": 4403.181,
    "text": " it's more like the strong and the weak scripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4403.221,
    "end": 4411.303,
    "text": "Like the basketball is a scripted environment in the cultural norm, weak script sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4411.803,
    "end": 4429.529,
    "text": "So yes, it doesn't have the stage directions, but you know, are there not signs helping identify where people with a given ticket should sit and signals and lights and sounds that also provide a lot of cues that are gonna be totally specific, like the seventh inning stretch in baseball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4430.697,
    "end": 4431.678,
    "text": " Why stretch then?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4432.358,
    "end": 4456.23,
    "text": "But then that's part of where the embodiment of even watching the game and participating in it gets to be why it's the phenomena of entertainment and why it's something that people spend their life supporting directly and indirectly and practicing for and why this isn't just like a neural entrainment, binaural beat hack or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4457.711,
    "end": 4470.016,
    "text": " Yeah, so if I got the same experience being at a basketball game, sitting in the student section that I got from sitting on my couch and watching the basketball game at home, then you would imagine nobody pays to go to basketball games.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4470.056,
    "end": 4472.217,
    "text": "And we all sit on our couch and watch them at home, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.522,
    "end": 4477.264,
    "text": " But we spend lots of money to go to basketball games or whatever sporting events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.884,
    "end": 4479.265,
    "text": "We have student sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.225,
    "end": 4482.467,
    "text": "We wear the colors of our sports team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.947,
    "end": 4488.129,
    "text": "So we're already signaling to people that, you know, I'm wearing this outfit, so I'm a BYU fan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4488.61,
    "end": 4492.091,
    "text": "I'm wearing this other outfit, so I'm a, I don't know, basketball teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.371,
    "end": 4493.272,
    "text": "I was going to name another one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.772,
    "end": 4494.853,
    "text": "I'm that kind of fan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4494.873,
    "end": 4499.875,
    "text": "So that's already signifying a kind of script where I know, oh, yeah, you're a friend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4499.895,
    "end": 4501.276,
    "text": "We're going to cheer at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.932,
    "end": 4508.196,
    "text": " And then the game has rules and the game has good things to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.236,
    "end": 4511.538,
    "text": "If my team scores a point, my response is going to be to cheer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4511.798,
    "end": 4514.6,
    "text": "If the other team scores a point, I'm going to be upset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.7,
    "end": 4520.503,
    "text": "So there's already a relationship where the game is driving the behavior in the stands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.584,
    "end": 4529.749,
    "text": "And then you have the interactions of the people next to you, the people you can see next to you and in front of you, the people who you can hear also behind you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.769,
    "end": 4529.829,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.759,
    "end": 4538.066,
    "text": " there are certain cheers that might be scripted just like that musical ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.146,
    "end": 4547.417,
    "text": "So if there's a certain idiosyncratic chant that I make that's associated with this team and this mascot, we all know this chant, we've learned it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.41,
    "end": 4550.191,
    "text": " Maybe it was written down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.811,
    "end": 4555.312,
    "text": "Maybe it's being broadcast on the big screen above the game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.972,
    "end": 4562.814,
    "text": "Maybe there's cheerleaders or a band who's leading a certain cheer and you're engaging it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.394,
    "end": 4572.417,
    "text": "So even though it's less scripted in a way than this musical ensemble in the sense that it's not written on a piece of paper that every person's looking at,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.314,
    "end": 4585.232,
    "text": " They're all aware of the social scripts that are involved in a basketball game experience and a basketball game experience with that team or with that student section that you're sitting in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.863,
    "end": 4589.826,
    "text": " So you're absolutely right that there's scripts like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.886,
    "end": 4593.609,
    "text": "And I think any interaction you get to, there's gonna be some kind of script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.629,
    "end": 4596.171,
    "text": "There's not gonna be something that's pure interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4596.731,
    "end": 4598.753,
    "text": "Nobody's interacting just on vibes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.575,
    "end": 4613.786,
    "text": "There's some social script based on where the people are, based on what context they're in, whether they know each other ahead of time, whether there's some external signal like clothing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4614.958,
    "end": 4643.761,
    "text": " um or you look like me or you don't look like me and that's all going to change the dynamics it might make certain forms of interactions occur more easily it might make certain kinds of interactions dissipate more easily which interestingly is something that we're still studying with metronomes um so metronomes don't only move into synchrony if you have two interacting metronomes they might actually cancel each other out um or they might",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.619,
    "end": 4650.662,
    "text": " exhibit other like coming in and out of synchronous dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4650.802,
    "end": 4662.97,
    "text": "And if we are still learning how to understand that in that physical system where there's physical properties that we can change and measure that are really simple, just moving back and forth in a certain period.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.733,
    "end": 4675.955,
    "text": " is that much more complicated when we're looking at humans who we seem to have some sort of free will and we can behave according to some social rules that we know about, or we could behave completely contrary to those rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.763,
    "end": 4703.808,
    "text": " awesome point that the model system like you brought up helps us confirm just our statistics like before the linear model gets brought out in one setting try it on the piece of graph paper and so this is like the graph paper for thinking about semantic or narrative coordination but one wouldn't want to be in a non-observable territory with kind of flying blind that way um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4706.469,
    "end": 4731.818,
    "text": " And also, I think the examples with the game and the context coordinating behavior to different ends, it made me think about where there's fans from different teams in the same setting versus sections that are separated, and then there's the parents at the game, and maybe the intention is just to support people in their play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.618,
    "end": 4734.36,
    "text": " versus like a professional sports.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.4,
    "end": 4736.982,
    "text": "And then there's like people who are there for pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4737.462,
    "end": 4738.503,
    "text": "They have literal money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4739.104,
    "end": 4749.793,
    "text": "Other people have like identity currency on the line and like feeling like one's city has a good baseball team and all these very complex things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.853,
    "end": 4751.034,
    "text": "And so it's kind of just cool",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.133,
    "end": 4771.882,
    "text": " to have a model that maybe can blanket off some of that complexity, but also just recognize the real data that you're getting from these systems, which is sometimes, as you pointed out, down to a single microphone, which has many advantages over visual observation or like sensor tracking or anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4772.482,
    "end": 4774.643,
    "text": "And that's what we're observing from the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.323,
    "end": 4780.986,
    "text": "And then there's our process of doing analysis on that signal, because that's actually what the system is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4781.846,
    "end": 4810.24,
    "text": " provide these measurements so it kind of does tie in active inference and how we're modeling these complex settings without getting lost in how many possible ways they can be cool do you have any other like things you'd like to add or any other points you want to bring up um no i think this is really great i really appreciated the discussion you brought",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.135,
    "end": 4818.786,
    "text": " We covered a lot more than just interacting groups of people running from brains to music AIs back again to people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.806,
    "end": 4819.647,
    "text": "It was really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.308,
    "end": 4820.589,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4820.829,
    "end": 4822.311,
    "text": "Thank you very much for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.371,
    "end": 4823.453,
    "text": "So see you anytime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4824.494,
    "end": 4824.855,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4824.915,
    "end": 4825.456,
    "text": "Sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.496,
    "end": 4825.796,
    "text": "See you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.957,
    "end": 4826.157,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]