[
  {
    "start": 8.285,
    "end": 9.065,
    "text": " Hello everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9.645,
    "end": 12.506,
    "text": "It's April 25th, 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 13.207,
    "end": 24.351,
    "text": "We're here with Adam Saffron and today we're going to be having a guest stream, the radically embodied conscious cybernetic Bayesian brain from free energy to free will and back again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 24.851,
    "end": 28.092,
    "text": "So Adam, thanks a ton for joining on this day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 28.452,
    "end": 32.253,
    "text": "Really looking forward to your presentations and thanks again, Adam, take it away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 37.008,
    "end": 41.351,
    "text": " Thank you for inviting me and letting me come to talk with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.652,
    "end": 55.861,
    "text": "I'll present some ideas from a recent manuscript in entropy called The Radically Embodied Conscious Cybernetic Bayesian Brain, From Free Energy to Free Will and Back Again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.419,
    "end": 61.48,
    "text": " After that, looking forward to discussing some of the ideas with all of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 61.96,
    "end": 66.102,
    "text": "And hopefully this is the beginning of an ongoing conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.982,
    "end": 81.888,
    "text": "So what I tried to do with this manuscript was basically marry good old fashioned cognitive science with a more an activist perspective, trying to find a middle way between these ways of viewing of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.988,
    "end": 85.27,
    "text": "And this is the view that I've come to over a number of years, where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 86.37,
    "end": 96.692,
    "text": " The idea being that embodiment, at this point, it's not news that the mind is embodied, but the claim is that it is very, very embodied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.072,
    "end": 98.493,
    "text": "Some would say radically embodied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.273,
    "end": 109.675,
    "text": "I'm not sure if that made the most sense to use that term because the term radical with respect to embodiment is usually pointing to a perspective or radical inactivism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.615,
    "end": 134.814,
    "text": " that avoids talking about representations or models and instead is saying you know what's really going on is these couplings with the world and maybe you could say there's like an implicit information processing or intelligence even that might be objected to but these talk of representations and symbols and models from cognitive science um that's those are not real things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.805,
    "end": 148.774,
    "text": " And so this paper goes through a perspective in which basically we do have representations and models, and we also have these sort of inactive couplings with the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 149.574,
    "end": 164.384,
    "text": "And I say it's radical in that nearly every mental process you would care to talk about, the way you have to understand it according to this view would be first and fundamentally and foremost in terms of its embodied character.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.689,
    "end": 169.872,
    "text": " So before I move on, is everything coming across clearly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 172.273,
    "end": 173.614,
    "text": "Okay, sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.674,
    "end": 183.06,
    "text": "Yeah, I did disable my video because due to some incredible consequences of different situations, I'm using a hotspot, but it's all good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 186.682,
    "end": 189.444,
    "text": "Okay, you're on the run.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.464,
    "end": 190.244,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.174,
    "end": 195.626,
    "text": " uh... so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.014,
    "end": 208.216,
    "text": " To review a little background, I mean, a lot of this people who were watching this were familiar with, but I'll review some background on predictive processing and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.537,
    "end": 212.957,
    "text": "Maybe some of what I'll present is a somewhat heterodox view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.358,
    "end": 215.938,
    "text": "That's also something to discuss.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.958,
    "end": 226.04,
    "text": "So a basic account of predictive coding, you have these deep pyramidal neurons, and you have these superficial pyramidal neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.96,
    "end": 235.125,
    "text": " where they're deep with respect to cortex as having this layered structure, roughly six layers with some variations on the theme depending on where you look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.705,
    "end": 243.13,
    "text": "And the idea is that the cortex as a whole is engaging in what's sometimes called hierarchical or what's often called",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.55,
    "end": 261.803,
    "text": " hierarchical predictive coding or potentially predictive processing because there might be some assumptions with saying predictive coding that not everyone would sign up for, such as that you are only suppressing and explaining away information as opposed to sometimes enhancing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.743,
    "end": 265.805,
    "text": " And there's other nuances that could make people object to saying predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.646,
    "end": 275.811,
    "text": "Instead of getting into those weeds, the idea would be that you have this hierarchy of beliefs, implicit and neuronal organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 276.572,
    "end": 283.536,
    "text": "The nature of these beliefs, and this gets into these debates about representation and inactivism, but this idea that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.612,
    "end": 293.074,
    "text": " You could say there's an implicit belief at each neuron and set of neurons about what they expect, what patterns they expect to encounter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.634,
    "end": 312.179,
    "text": "And according to this predictive processing view, through their activity, they're trying to predict this incoming activity and suppress it or explain it away to minimize overall activity, and that you only update these beliefs where you got it wrong via a prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.819,
    "end": 315.741,
    "text": " And this is under certain assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.781,
    "end": 329.109,
    "text": "If you have a good model and events in the world are relatively slow relative to your internal signaling units, you can have substantial energetic savings for an organ of about 2% of your body mass and 20% of your metabolism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.85,
    "end": 333.372,
    "text": "Seems like the kind of thing natural selection would do, and there's some decent evidence for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.833,
    "end": 353.422,
    "text": " So the basics of neural architecture here for Cortex is viewing it as a predictive processing hierarchy or a heterarchy, and that each of your modalities would be a different belief hierarchy, and they would all come together and exchange their information for a joint belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 354.122,
    "end": 366.036,
    "text": " across all your modalities in terms of what you think should be in your sensorium as it moves through the world, whether it's the world you're in right now or some sort of counterfactual world in the present or future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 367.237,
    "end": 368.999,
    "text": "So that's predictive processing in a nutshell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 371.062,
    "end": 373.204,
    "text": "And so in this account, the goal was to use",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.08,
    "end": 382.107,
    "text": " predictive processing to try to get into the micro mechanics of goal oriented behavior and agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.767,
    "end": 392.717,
    "text": "And so what I suggested is that the work has been done within active inference on this sort of imaginative planning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.257,
    "end": 420.292,
    "text": " pursuing of goals, the work to refer to would be sophisticated inference or sophisticated affective inference, which is thinking about basically planning into the future as this tree search of possibilities where you're going on different branches of these possibilities and then picking the ones either in imagination or in reality that would correspond to you, minimizing your prediction error the best or realizing value the best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.673,
    "end": 426.035,
    "text": " this exploration of a tree of possibilities and going down different branches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.896,
    "end": 429.377,
    "text": "And so this would be, I suppose, a particular flavor of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.978,
    "end": 444.587,
    "text": "And the idea being that a lot of what would be pulling along this stream of consciousness of imaginings would be this iterative comparison between sensed and imagined states or between various goal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.367,
    "end": 449.81,
    "text": " So here I have this comic book that a friend helped me make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 450.41,
    "end": 453.272,
    "text": "And I have multiple comics throughout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.292,
    "end": 468.162,
    "text": "I tend to view comics as being really highly expressive in a way that I think we should probably use them more in terms of being able to capture the joints and experience space with sufficient richness and detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.202,
    "end": 474.847,
    "text": "And there could even be something like comic book-esque about the stream of experience, which could be part of the reason that they're so effective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.447,
    "end": 491.82,
    "text": " But to return to this comic or a modal frame sequence as I sometimes call it, you see in the bottom here this is the actual pose of the agent and up top what's going through the mind's eye whether we're talking about an imagination or a perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.46,
    "end": 497.905,
    "text": "And so here it's just a simple contrasting of what you're perceiving in each given moment and then what you're imagining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.945,
    "end": 500.367,
    "text": "So you're sitting, you want tea,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.343,
    "end": 504.165,
    "text": " You then look and you say, I am not drinking tea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.185,
    "end": 506.346,
    "text": "I am at my computer, and there is a laptop in front of me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.406,
    "end": 510.888,
    "text": "You look down, and you're imagining having tea in your cup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.108,
    "end": 513.11,
    "text": "But then you look, and no, there is indeed no tea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.77,
    "end": 515.531,
    "text": "And then you imagine a next step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 515.571,
    "end": 518.472,
    "text": "And so what's happening here is you're doing this contrast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.653,
    "end": 522.355,
    "text": "And what I propose is that in contrasting between these states,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.303,
    "end": 547.711,
    "text": " they're arranging they're basically setting up prediction errors for each other where what doesn't match would potentially get you a natural prioritization of what features are unaligned and then from those you use that to retrieve some sort of relevant affordance to help you bridge this gap between your imagination and reality and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 548.231,
    "end": 567.998,
    "text": " And there's a lot of devils in details of the ways this could work, but that some sort of iterative contrasting of goal states and a goal hierarchy where it's like you might have an ultimate goal, but to achieve that goal, you have to now go and think of what are all of the sub steps and the sub goals that would be needed to actually get the tea in my hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.918,
    "end": 573.76,
    "text": "You're going to have to ambulate to the kitchen, make the tea, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.62,
    "end": 589.411,
    "text": " And as you're going back and forth at some place, some point, you either have a plan that's compelling enough or the next action is close enough to your present pose that you just find yourself launching into action, sometimes accompanied by a feeling of having decided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.891,
    "end": 591.633,
    "text": "Sometimes you just find yourself moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 592.253,
    "end": 608.88,
    "text": " But that's the basic account here, that the stream of consciousness is being pulled along in this goal-oriented fashion, this value-driven fashion, sometimes more freely wandering, but usually there's an interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.341,
    "end": 618.165,
    "text": "And as an active inference in predictive processing, your preferences or your attracting states, the attractors that you'll find them as a system, which you're attracted to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.065,
    "end": 620.185,
    "text": " takes the form of predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.285,
    "end": 644.573,
    "text": "And so the things in your mind that you're imagining that they become the goal state, they become the state of the world that you prefer, in that instance, or in general, if it's a regular kind of imagining, and this now becomes the attracting state that your system self organizes, and you engage in action selection of different kinds to minimize that difference between what you're imagining, and what you are estimating for the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.255,
    "end": 660.624,
    "text": " So I go into some discussion of neural architecture and different aspects that might be more or less relevant for different of this kind of action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.644,
    "end": 666.347,
    "text": "I probably should have just thrown this on top of a picture of a brain, but I didn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.828,
    "end": 669.069,
    "text": "But in some ways, it might be a good thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.549,
    "end": 675.293,
    "text": "And I wonder whether this account of having a dual tier system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.033,
    "end": 681.578,
    "text": " Something like a system 1 and a system 2 is a broader story than just brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.118,
    "end": 686.202,
    "text": "And so I have written out here, like, here would be neural substrates of what would enable you to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.842,
    "end": 689.565,
    "text": "But well, it could be across brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.585,
    "end": 694.809,
    "text": "You might have similar processes happening within, let's say, like an insect nervous system by different means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.869,
    "end": 698.072,
    "text": "Like instead of the basal ganglia, you might be using the mushroom bodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.413,
    "end": 708.737,
    "text": " If we're talking about an ant colony, for instance, it's possible you have a different attracting states of the colony where some are taking this role of a higher-level controller and a lower-level controller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.338,
    "end": 721.183,
    "text": "But the basic idea here is that you have an upper-level controller that's capable of aggregating information across different... So you have this lower-level process in this control hierarchy where the lower level is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.943,
    "end": 724.245,
    "text": " taking care of your immediate couplings with the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.725,
    "end": 727.547,
    "text": "This would be the more inactive portion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.668,
    "end": 743.058,
    "text": "If we're talking about the brain, it would be something like loosely assembled constellation of cortical reactive dispositions, maybe orchestrated by the cerebellar system, of what would be called amortized inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.078,
    "end": 745.86,
    "text": "And it would be largely unconscious and automatic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.821,
    "end": 749.643,
    "text": "Phenomenologists would talk about just things being",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.744,
    "end": 754.525,
    "text": " ready at hand, as opposed to being present to hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 755.065,
    "end": 758.587,
    "text": "You're just effortless engagement and effortless mastery with the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.307,
    "end": 763.068,
    "text": "But on top of this, you have a slower process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.108,
    "end": 775.993,
    "text": "In this case, I'm saying it's more involving conscious processing, something more system two-like, to use Kahneman's language, where it's involved in more deliberate, potentially effortful modes of cognition,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 776.593,
    "end": 784.259,
    "text": " which would be a higher level of control over this faster, smooth coupling system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.219,
    "end": 788.982,
    "text": "So go into some details of neural architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.203,
    "end": 800.31,
    "text": "Potentially, this might be just what you need for a lot of active inferential agents, something like this across whether or not we're talking about neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 800.33,
    "end": 803.633,
    "text": "This might be a broader story for active inferential agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.464,
    "end": 811.226,
    "text": " So to return to the example of making tea, go into it some.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.246,
    "end": 816.448,
    "text": "We're saying that we're back to the mouse brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.589,
    "end": 825.332,
    "text": "Here in the brain, areas associated with mental imagery, maybe even physical and computational substrates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.605,
    "end": 837.899,
    "text": " mental imagery phenomenality itself, but like the Protonius, for instance, involved in imagination have heavily implicated multiple reasons to think why this would be the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.939,
    "end": 841.664,
    "text": "But I have this little Cartesian theater here with the different imaginings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.691,
    "end": 866.689,
    "text": " And down below, the idea is you are iterating through different imaginings largely via large-scale orchestration by the hippocampal complex and its capacities to couple with the rest of the cortex to guide these high-level attracting states where some portions of which would be your experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.489,
    "end": 877.755,
    "text": " And so the reason you would bring up the hippocampus in here is it seems to be a specialized subsystem for sequential predictive modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.755,
    "end": 880.096,
    "text": "You could say that for cortex as a whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 880.156,
    "end": 884.559,
    "text": "Technically, hippocampus is a kind of cortex, arcade cortex, old vintage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.119,
    "end": 894.664,
    "text": "But that basically, so Damasio will talk about this in terms of a convergence-divergence zone, where many things will funnel in and then funnel back with high centrality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.445,
    "end": 897.225,
    "text": " I forget his name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.385,
    "end": 900.747,
    "text": "He's at Waterloo, the spawn architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.447,
    "end": 903.548,
    "text": "But he'll talk about semantic pointers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.948,
    "end": 914.152,
    "text": "But there's different ways of viewing the high centrality of hippocampus as it basically will predict this trajectory of the overall organism through space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.872,
    "end": 925.136,
    "text": "You can both encode memories, what was happening in my storium, whether in reality or imagination, at each point as I was moving through space and time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.372,
    "end": 930.735,
    "text": " And you could also use it for replay, including in counterfactual circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.815,
    "end": 934.818,
    "text": "And so I have some diagrams here of the neural systems involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.998,
    "end": 939.0,
    "text": "And right here, you'd have the, I think that's good for now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.12,
    "end": 942.863,
    "text": "So anyone wants to know more details about that later, we could.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.682,
    "end": 953.447,
    "text": " So to return to trying to go more phenomenological, so these modal frame sequences are comics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.827,
    "end": 969.556,
    "text": "Ultimately, what I'm trying to build up to is a sufficiently detailed account of neural architecture and a sufficiently detailed account of phenomenology so that we can basically talk about something as highfalutin as free will and have some purchase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.283,
    "end": 980.033,
    "text": " So in this complex modal frame sequence, you have that up top and imagining row.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.593,
    "end": 982.435,
    "text": "Below that you have what's actually in your perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.336,
    "end": 987.401,
    "text": "Below that you have your pose and your proprioceptive inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.981,
    "end": 989.963,
    "text": "And then below that you have your interoceptive inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.796,
    "end": 1007.937,
    "text": " So as you're stepping through, the stream of consciousness is evolving through space and time, encoded or orchestrated by the hippocampal system at this high, potentially most integrative high level of action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.922,
    "end": 1023.693,
    "text": " you are having different wounds in your body corresponding to the interoceptive concomitants of, or the interoceptive aspects of what it means to be in different situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.713,
    "end": 1038.565,
    "text": "So for instance, like a hunger situation here, you're getting prediction error, interoceptive prediction error that would be roughly vaguely localized here as like a cool sensation around your gut and mouth or thirst or hunger, something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.225,
    "end": 1065.45,
    "text": " And now as you're going into movement, you might have here like you're still having this interoceptive code of hot and cold states, pleasant and unpleasant, but it's kind of getting infused into other modalities where your proprioception, some of the phenomenology of like feeling like an urge in your body, it's one of the claims I make is that you have this kind of quasi-synesthetic cross-mapping between interoceptive signals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.81,
    "end": 1070.891,
    "text": " and the proprioceptive and exteroceptive associates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.172,
    "end": 1084.095,
    "text": "Part of the reason I claim this and say that this is both part of the phenomenology of will and maybe part of the mechanism also is that interoceptive signals are poorly localizable in space and time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.115,
    "end": 1086.916,
    "text": "They tend to have pretty low resolution for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1088.196,
    "end": 1091.357,
    "text": "And so they drift free from their sources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.477,
    "end": 1094.298,
    "text": "And that's a kind of anomalous inference, but an adaptively anomalous inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.199,
    "end": 1103.773,
    "text": " they may get infused into the relevant effector and sensor systems and objects in the worlds for which they would be relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.553,
    "end": 1110.594,
    "text": " I make a lot of different claims in this work from a number of years of study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.995,
    "end": 1113.455,
    "text": "A lot of it can be taken a la carte.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.495,
    "end": 1116.416,
    "text": "You can find some things to be more compelling, some things to be less compelling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.256,
    "end": 1119.957,
    "text": "But I do think you get a whole that's greater than the sum of its parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.017,
    "end": 1122.378,
    "text": "But it can also be taken in a piecemeal fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.418,
    "end": 1128.419,
    "text": "So you might not be particularly compelled by this account of interception as being synesthetic in nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.501,
    "end": 1139.587,
    "text": " Nothing really, not too much will ride on that, but not too much of what will follow will ride on that, but it could end up being important so I'm putting it in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.708,
    "end": 1141.088,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.291,
    "end": 1149.755,
    "text": " And so across all of this, this is happening within a perspective of computational neurophenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.396,
    "end": 1153.318,
    "text": "As Anil Seth calls it, or I call it Marian neurophenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1153.698,
    "end": 1163.364,
    "text": "And the reason I call it Marian is specifically his account of multiple levels of analysis, which I guess supervene on each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1163.384,
    "end": 1168.488,
    "text": "And you can do two things because things have these multiple levels that they can be engaged with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.348,
    "end": 1179.837,
    "text": " You can either engage with them a la carte because of, let's say, for instance, you want to do cognitive science, but you have no idea how the brain works, and for many years we haven't, and there's a lot of mystery still.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.258,
    "end": 1184.561,
    "text": "You can kind of bracket, like, here's this big set of unknowns, but it's at a different level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.822,
    "end": 1189.405,
    "text": "But working at this other level, we can obtain knowledge, even though we might be ignorant at these other levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.206,
    "end": 1193.368,
    "text": " And that would be functionalism and cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.408,
    "end": 1214.159,
    "text": "But for me, what's more exciting about this actually, this Marian stack, is the capacity not for independence but interdependence and mutual constraints, using the implementation level or the mechanistic level as a constraint of what's a likely set of algorithms, using a likely set of algorithms to test hypotheses on the implementation level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1215.3,
    "end": 1226.649,
    "text": " using what you think the in things like neuropsychiatric literature to constrain and the neuroimaging literature to constrain algorithm and thereby implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.689,
    "end": 1236.156,
    "text": "So the idea of what excites me is like filling in this crossword puzzle, leveraging constraints, and then cross-referencing them with phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.237,
    "end": 1256.085,
    "text": " I'm using basically machine learning as a version principle and typically going to the races of this idea that a lot of cortex could be understood in terms of particle predictive problem, but also evoking some additional machine learning principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.245,
    "end": 1258.406,
    "text": "But that's the overall scope of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.538,
    "end": 1271.99,
    "text": " in terms of all the body parts and faces, this is part of the radical embodiment idea, is that instead of the cortex being this grab bag of associations with areas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.022,
    "end": 1275.102,
    "text": " What does that mean and why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.963,
    "end": 1286.426,
    "text": "The idea is that once you really place it front and center as a cybernetic controller for an embodied embedded agent, once you place embodiment front and center, a lot of it becomes .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.106,
    "end": 1294.328,
    "text": "So for instance, if they like, OK, there's something like right around here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1294.368,
    "end": 1295.028,
    "text": "So something like .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.452,
    "end": 1306.697,
    "text": " But then you're like, wait a second, that's not too many steps removed from where the ears first pipe in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.817,
    "end": 1308.138,
    "text": "So the idea that something like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.226,
    "end": 1326.476,
    "text": " You know, going from phonemes or going from sound patterns undifferentiated to phonemes and steps, it ends up making cortex dysfunctions, in my opinion, a lot more applicable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.076,
    "end": 1331.479,
    "text": "It becomes somewhat like location, location, location, and location relative to the modalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.499,
    "end": 1333.04,
    "text": "It ends up explaining a lot of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.14,
    "end": 1334.341,
    "text": "A similar story for Broca's area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.201,
    "end": 1340.342,
    "text": " What a coincidence that it's a hop, skip, and a jump away from what might move your mouth bits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.283,
    "end": 1343.423,
    "text": "There's doubles in details here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.443,
    "end": 1345.664,
    "text": "I don't want to be glib and underestimate the complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.704,
    "end": 1353.026,
    "text": "But the claim is that actually once you place embodiment in the center, an elegance kind of falls out and becomes a lot easier to keep track of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.506,
    "end": 1362.488,
    "text": "If you're thinking of cortex as this control, cybernetic control hierarchy over to basically help a body move through the world and model the world as it moves through it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.15,
    "end": 1366.534,
    "text": " So we are ready, I think, to get to free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.757,
    "end": 1377.15,
    "text": "And so taking these modal frame sequences, and here is doing one for this experience of standing to make tea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.156,
    "end": 1382.22,
    "text": " and then taking that model and then porting it to a Lebet experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.24,
    "end": 1384.381,
    "text": "So what is a Lebet paradigm?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.222,
    "end": 1387.584,
    "text": "So some people say Lebet, some people say Lebet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.125,
    "end": 1394.23,
    "text": "I think Lebet said Lebet, but I'll continue to say Lebet because it's more common, and I just will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.871,
    "end": 1405.118,
    "text": "But the idea is that you're there and you want to see, do people or don't they have something like meaningful conscious control over their actions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.879,
    "end": 1410.883,
    "text": " And so the idea is, okay, let's strip this down and take the most insignificant of all actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.903,
    "end": 1415.527,
    "text": "It's like, well, surely we need to have control there if we're going to say we have control anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.147,
    "end": 1420.811,
    "text": "And so the decision to just move your hand based on feeling like you want to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.513,
    "end": 1426.236,
    "text": "And this coming from basically it's endogenous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.276,
    "end": 1431.48,
    "text": "It's not being decided from without, but you doing something based on something internal to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.941,
    "end": 1446.543,
    "text": " And what was found with the Labette studies, or Labet, is that you get this ramping activity preceding the decision to move your hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.946,
    "end": 1450.287,
    "text": " You have this clock, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1450.947,
    "end": 1454.029,
    "text": "And it's a big clock that you're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1454.509,
    "end": 1457.35,
    "text": "And it might be a dot or a big hand moving in a circle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.011,
    "end": 1465.154,
    "text": "And the reason that you have this is basically so that you can estimate the time when it was that you said, I will move my hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.334,
    "end": 1466.155,
    "text": "When did you decide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.176,
    "end": 1470.579,
    "text": " And you then say, OK, when you made that decision, what were you looking at?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.659,
    "end": 1474.321,
    "text": "Where was this dot as it moved around in a circle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.762,
    "end": 1481.767,
    "text": "And this can get you very fine resolution, sub-second resolution, because if it's a big clock, then the dot will be moving slowly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.787,
    "end": 1482.808,
    "text": "And you can say, OK, it was right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.471,
    "end": 1492.739,
    "text": " But what's observed is that you're getting this ramping activity with this predictive of the action called the readiness potential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.54,
    "end": 1503.528,
    "text": "And it will peak a good 200 milliseconds before you reporting, it varies, but it'll peak substantially before you saying, I've decided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.369,
    "end": 1504.689,
    "text": "And so if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.905,
    "end": 1519.143,
    "text": " And so the claim is, well, if this potential has predictive information of your action and is the cause of your action, and it's happening prior to your conscious decision, your decision cannot be the thing that caused the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.403,
    "end": 1531.846,
    "text": " There's a problem right away with this in that with ERP methods, you're actually averaging over many, many trials to get these waveforms because you're measuring from the outside of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.206,
    "end": 1538.048,
    "text": "It's like trying to detect events inside a stadium while measuring, like listening to the roar of the crowd on the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.088,
    "end": 1540.129,
    "text": "And you're limited in what you can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1540.169,
    "end": 1543.93,
    "text": "So you have to average together a lot of different episodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.25,
    "end": 1546.45,
    "text": "And then you get these event-related potentials or ERPs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.371,
    "end": 1567.523,
    "text": " so you get predictive information from this of when people moved but the idea that a readiness potential is causal or deterministic in some fashion there's some debate about that whether you can infer that um i'm going to say that the readiness potential is in fact reflecting a causal process um and it's reflecting a conscious causal process even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.343,
    "end": 1591.926,
    "text": " that is contributing to the action um upstream of um the decision itself where the decision could have some more you know depends on i don't know if there's one account but it could have some epiphenomenal aspects to it and that the decision is not necessarily um the thing it's it's not the only uh difference maker there but the idea is that this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.63,
    "end": 1601.978,
    "text": " is a function of mental imagery where you are imagining will and won't move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1602.119,
    "end": 1607.945,
    "text": "And as you're rehearsing, moving your hand, you're having different things associated with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.766,
    "end": 1614.272,
    "text": "And that building up of that recurring, a building up of activity in these body maps",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.461,
    "end": 1643.799,
    "text": " whether we're talking about getting ready to actually change your proprioceptive pose as you're imagining, starting to move closer to a threshold where you're going to get robust enough activity that is actually going to drive your muscles and your affector systems, or building up activity in your interoceptive modalities, like your insular and cingulate hierarchies and maybe their synesthetically cross-couplings with other modalities, that that building up of a feeling of urge is itself consciousness leading to the stream",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.699,
    "end": 1646.201,
    "text": " the causal stream of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.903,
    "end": 1658.074,
    "text": "So that I would say, so yeah, the, and then on top of all the different imaginings would be orchestrated by the capital system would be the basic model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1659.195,
    "end": 1665.923,
    "text": "So currently, and so, and, and,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.594,
    "end": 1694.155,
    "text": " So currently, I am working on expanding this to seeing what different states of consciousness, the ways in which they could impact these sorts of phenomena in terms of changing your awareness of this rehearsal process or changing one of the primary things of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.969,
    "end": 1702.254,
    "text": " So and also whether differences in the mechanisms of agency could potentially contribute to the phenomenology of psychedelics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.434,
    "end": 1703.335,
    "text": "I'll try to explain what I mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.656,
    "end": 1708.359,
    "text": "So here would be someone relatively unaltered, engaging in mental rehearsal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.379,
    "end": 1710.58,
    "text": "Their mind's sort of wandering off to nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.62,
    "end": 1711.441,
    "text": "They're seeing a tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.861,
    "end": 1712.762,
    "text": "Here's imagination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1712.962,
    "end": 1713.783,
    "text": "Here's perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.083,
    "end": 1715.844,
    "text": "Here, more vivid than imagination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.864,
    "end": 1719.547,
    "text": "And they're just sort of imagining things, imagining, will I move?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.587,
    "end": 1720.187,
    "text": "Won't I move?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.668,
    "end": 1721.649,
    "text": "And then at a certain point,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.61,
    "end": 1727.331,
    "text": " imagination becomes vivid enough that they can really see it happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.051,
    "end": 1743.954,
    "text": "And at a certain point of vividness of imaginings as a function of this rehearsal of will I move, won't I move, you get enough buildup of whether we're on the implementation level or mechanistic level, we might talk about recurrent activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.474,
    "end": 1748.075,
    "text": "In terms of active inference on the functional level, we might talk about model evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.716,
    "end": 1761.524,
    "text": " But at a certain point, you cross a certain threshold, leading to model selection of you altering your proprioceptive pose and this becoming a self-fulfilling prophecy through active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.065,
    "end": 1774.514,
    "text": "You then minimize the prediction error between your imagination, I am moving, and the action through reflex arcs, the way that basically motor control is thought to work in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.592,
    "end": 1776.553,
    "text": " and predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.193,
    "end": 1784.2,
    "text": "So the psychedelic angle would be, as someone is dosing with these compounds, their imagination becomes more vivid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.0,
    "end": 1792.547,
    "text": "And they might show stronger ramping at first and maybe greater awareness of these patterns of mental stimulation leading up to the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.608,
    "end": 1797.992,
    "text": "It might get stronger still as you dose more and more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.874,
    "end": 1808.339,
    "text": " Also greater coupling between interoceptive and proprioceptive modalities, increasing the gain on this positive feedback between mental imagery and feelings of urge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.939,
    "end": 1818.126,
    "text": "And so in a way, this would be an enhancement of the willing aspect of agency as you move up this dose response curve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.626,
    "end": 1823.99,
    "text": "But then you get to a certain level and you start to get into this psychedelic regime where your thought becomes highly creative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.77,
    "end": 1828.931,
    "text": " And then your directed willing might start to go down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1829.911,
    "end": 1838.214,
    "text": "Potentially, the idea is you might find other things competing for your awareness, different creative possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.234,
    "end": 1844.815,
    "text": "So you're now imagining nature very vividly, and this is competing with you rehearsing, will I move or won't I move?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.016,
    "end": 1851.437,
    "text": "And less predicting I'm about to move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.454,
    "end": 1868.201,
    "text": " And as you come up with the dose, these inferences, you directing a certain move might become less and less.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1868.381,
    "end": 1878.867,
    "text": "Extremely high doses, you might get a compromise of these mechanisms of agency, of this conjoining of your interoceptive and your proprioceptive predictions of your basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.026,
    "end": 1886.971,
    "text": " of your stream of consciousness being pulled along by value-driven policy selection via sophisticated affective inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.652,
    "end": 1892.855,
    "text": "So I think the reverse direction is this in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.782,
    "end": 1910.834,
    "text": " this paradigm potentially informing psychedelics could be that one source of hallucinations or delusions or atypical altered consciousness and cognition would be that if you take the basic micro mechanics of agency,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.581,
    "end": 1914.002,
    "text": " And you compromise that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.042,
    "end": 1926.908,
    "text": "So as you're beginning to somewhat imagine an action, but it's not well integrated into some causal unfolding, you could come to this anomalous inferences about what's causing these basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.042,
    "end": 1948.444,
    "text": " The different endogenous activity in your brain, the different events that could lead to motor actions, if these aren't being integrated into a self-consistent, coherent causal unfolding, one of the ways that you could try to make sense of this would be a confabulation of something like a hallucination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.464,
    "end": 1949.385,
    "text": "And so this could potentially",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.006,
    "end": 1962.413,
    "text": " also explain some of psychedelic phenomenology and potentially clinical neuropsychiatric phenomenology with things like schizophrenia as potentially being a function of disrupted agency mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.993,
    "end": 1965.334,
    "text": "So that's currently the area of focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.035,
    "end": 1973.479,
    "text": "And a preprint just came out on that called On the Degrees of Freedom Worth Having.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.423,
    "end": 1999.22,
    "text": " psychedelics as a window for understanding and expanding uh free will I believe that's what I called it and so that would be a little bit um also apologies if there's any strange stream hiccups but could you maybe unpack what the alien or extraterrestrial was doing and how does the confabulation relate to a narrative understanding of action",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2002.347,
    "end": 2010.489,
    "text": " So in this one, so we're starting out just imagining your hand moving or imagining being in nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.509,
    "end": 2013.951,
    "text": "And then same here as the dose goes up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.691,
    "end": 2020.753,
    "text": "And it goes up, and you might start to get some more intense interoceptive sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.413,
    "end": 2031.016,
    "text": "The 5-HT2A receptors, which heavily mediate the effects of classic psychedelics, they're highly expressed in the interior insula, the top of the interoceptive hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.808,
    "end": 2035.792,
    "text": " And so you keep going up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.493,
    "end": 2038.175,
    "text": "The sensations become more intense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2038.515,
    "end": 2040.277,
    "text": "Imagination becomes closer to reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.619,
    "end": 2046.205,
    "text": "And so here, what I'm calling the heroic dose and this extreme dose regimes,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.246,
    "end": 2070.569,
    "text": " you're starting to get for instance like your ownership of the actions are starting to get undermined so here i'm depicting like you find your hand moving but you're not accounting for your willing of the move being the thing you're not saying oh i was rehearsing it and it felt this way and that was part of the causal stream into action you just found yourself moving and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2071.129,
    "end": 2083.414,
    "text": " And so one way you could make sense of this or confabulate around this here is a hand, like it's a feeling of the hand pushing down on your hand from without, just an example of a potential confabulation or hallucination someone might have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.255,
    "end": 2092.498,
    "text": "And this one here, it's expanded, and it's basically someone, it's not even your hand anymore pressing it, but an alien's pressing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.518,
    "end": 2100.122,
    "text": "It's just an example of, for instance, so psychedelics, the classic psychedelics will act on these 5-HT2A receptors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.862,
    "end": 2107.645,
    "text": " They are heavily expressed on these deep pyramidal neurons of cortex's six layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.365,
    "end": 2112.927,
    "text": "The layer five, well, basically, they're big neurons that loop with the thalamus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.667,
    "end": 2121.871,
    "text": "And they let you form these broad synchronous complexes, which in predictive processing are thought to encode your beliefs, some subset of which would be your experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.748,
    "end": 2129.433,
    "text": " And so if you increase the gain on these, the idea is that you might have enhanced perceptual vividness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.153,
    "end": 2141.261,
    "text": "But because, though, you've done a radical alteration of multiple kinds to the normal regime of processing in your mind, the normal ways you would model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.282,
    "end": 2148.609,
    "text": " even though you're experiencing things intensely, this would potentially be of an atypical variety of experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.109,
    "end": 2155.676,
    "text": "And so here is the intense perception, apperception of the alien.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.297,
    "end": 2157.378,
    "text": "It's a counterfactual alien.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.438,
    "end": 2158.319,
    "text": "It's not actually an alien.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.737,
    "end": 2163.418,
    "text": " That would be an example of an anomalous inference you might make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.838,
    "end": 2172.983,
    "text": "And it has some relation to what's happening and the fact that maybe there was some motor rehearsal going on, but you're not able to keep track of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.363,
    "end": 2183.948,
    "text": "And here, you're actually having phenomenal consciousness in each of these moments, but you don't have conscious access unless in these iterative moments of experience",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.748,
    "end": 2191.613,
    "text": " you can somehow get callbacks where things can be contextualized within some sort of causal unfolding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.094,
    "end": 2212.328,
    "text": "The claim would be that basically this would be a way of separating out phenomenal consciousness from conscious access, that there's things that can happen as you're generating these quail states as estimates of what's happening of system world, system world, system world, specifically your sensorium as you think it is based on your current engagement or in counterfactual circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.149,
    "end": 2220.213,
    "text": " and that that's the stream of consciousness, but that not all of the frames of experience are accessible or rememberable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.833,
    "end": 2225.816,
    "text": "And so in this case here, maybe there was some rehearsal, but you're not keeping track of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.396,
    "end": 2233.961,
    "text": "And then the best causal account you were able to come up with was that an alien made you do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.541,
    "end": 2240.124,
    "text": "And you might have even forgotten that this was you, or maybe you do remember it, but would need probably some more contextualization or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.464,
    "end": 2240.904,
    "text": "It's unclear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.365,
    "end": 2267.394,
    "text": " So that would be the basic idea is that psychedelics would be increasing consciousness level or the vividness of your experience, but potentially undermining the coherence in terms of causal unfoldings or your usual priors by which you structure the world in the spirit of Robin Carr at Harris and Carl Friston's Rebus model, which I'm currently discussing in the context of a broader framework that I call Albus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.995,
    "end": 2271.316,
    "text": "But yeah, I don't know, did that help at all or?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.375,
    "end": 2273.336,
    "text": " Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2274.217,
    "end": 2280.544,
    "text": "It also reminded me of what you said about the different levels and their interdependence and mutual constraints.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2281.125,
    "end": 2288.132,
    "text": "So it's like a sound is heard and potentially in one state of consciousness or mind or brain, it's 98% likely to be one thing and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2290.962,
    "end": 2292.982,
    "text": " option B and C are 1% likelihood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2293.122,
    "end": 2307.325,
    "text": "And so it just goes forward with as if option A, like as if I'm in control, but then some things might happen where like that 1% chance that it is an alien gets accepted and sort of passed forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2308.306,
    "end": 2314.447,
    "text": "And then that might lead to the experience through the generative model of something that like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2316.815,
    "end": 2333.327,
    "text": " was a distributional so it's like a change in quantitative distributions that leads to a qualitative change at increasingly higher and categorical and semantic experiential layers beautifully said",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2337.785,
    "end": 2340.467,
    "text": " And it would depend on your cultural priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.988,
    "end": 2345.271,
    "text": "So whether you would call this a relaxed belief or a strengthened belief, I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.512,
    "end": 2349.755,
    "text": "But for instance, you might not be seeing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.497,
    "end": 2359.103,
    "text": "An indigenous people of South America, for instance, they might not see an alien.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.143,
    "end": 2365.729,
    "text": "It might be related to something having to do with their spirituality and whatever available myths you have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.593,
    "end": 2371.917,
    "text": " would then go into basically this interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2372.277,
    "end": 2391.035,
    "text": "Your best guess, which is always wrong, sometimes useful, but your best guess of what's going on will be different depending on what they would call the set and the setting, but also where the setting is the broader cultural, the set and setting are also broader to the culture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.294,
    "end": 2397.016,
    "text": " Not everyone will come to the inference of aliens, probably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.618,
    "end": 2404.301,
    "text": "And actually, that's been shown, that hallucinations are culturally specific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.663,
    "end": 2417.15,
    "text": "Yeah, with which kinds of extraterrestrial morphologies are seen in relationship to which are prevalent in the media and the stories of a given region.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2418.451,
    "end": 2420.432,
    "text": "I don't know all the details, but one can imagine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2422.247,
    "end": 2432.43,
    "text": " like not everyone i mean like you could like say like um uh maybe there is something about like gray aliens which is like a little more archetypal i don't know if i'd say this but like uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.596,
    "end": 2447.985,
    "text": " If you look at the eigendimensions, like morphological variation, what's relevant to us, you're just exaggerating many of the dimensions that would be relevant for us engaging in intersubjective modeling or modeling of ourselves, even for the sake of control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.005,
    "end": 2451.207,
    "text": "So bigger hands might be important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.588,
    "end": 2456.89,
    "text": "Where is attentional inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2457.29,
    "end": 2458.471,
    "text": "Where is this person attending to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.491,
    "end": 2459.412,
    "text": "Where am I attending to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.892,
    "end": 2461.533,
    "text": "So you want to know the heads and the eyes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.593,
    "end": 2462.614,
    "text": "That's going to be really crucial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.034,
    "end": 2471.356,
    "text": " That's a far out story, but there could be aspects that aren't just through the medium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.656,
    "end": 2474.637,
    "text": "It's super interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2475.497,
    "end": 2489.38,
    "text": "And yeah, not to go into alien stream mode, but thinking about a large headed archetype with very large dark eyes and the long fingers like you're kind of hinting at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.2,
    "end": 2492.522,
    "text": " It's like, it's all pupil.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2493.162,
    "end": 2494.864,
    "text": "It's all cortex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2495.584,
    "end": 2499.688,
    "text": "It doesn't have the strength, but it has a lot of nimbleness with its hands and with its body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2500.348,
    "end": 2504.892,
    "text": "And so like, that's like one archetype of cognitive action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2504.912,
    "end": 2506.813,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2507.053,
    "end": 2510.416,
    "text": "And then what, maybe there's a blob and a shadow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2510.456,
    "end": 2515.24,
    "text": "There's like these different archetypes, different little characters in this comic book of cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2519.793,
    "end": 2543.291,
    "text": " that different from a child's um affordances too right like they're not they're not capable of like moving things around much but it's like their intentional actions are mostly like hand-eye coordination of like that's their purchase on the world that's their grip but you know for all this you know so this is the current like focus is how might psychedelics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.324,
    "end": 2553.529,
    "text": " inform our understanding of the micromechanics of agency and how might the micromechanics of agency inform our understanding of what psychedelics are doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2553.549,
    "end": 2564.434,
    "text": "That's currently one of the things I'm focusing on and about to do some experiments on at the Center for Psychedelic and Consciousness Science I'm working at at Hopkins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2566.746,
    "end": 2577.735,
    "text": " fundamentally and upstream of this, the idea is that these studies, which purportedly show that there's no free will, they show no such thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.851,
    "end": 2596.224,
    "text": " It's very ambiguous what they're showing, and I believe if you do an active inferential handling of them, you'll actually see that there are several ways in which consciousness is contributing to causal streams leading to action, which would be having some of the varieties of free will worth having.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.265,
    "end": 2598.106,
    "text": "Is it arbitrary?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.826,
    "end": 2617.947,
    "text": " uh degrees of free will no uh are there some varieties of free will worth having that we don't have like can you just like fly all of a sudden that'd be nice that'd be worthwhile we can't do that either but if you want your beliefs and desires to be able to meaningfully said to be be able to be said to be uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.687,
    "end": 2626.13,
    "text": " meaningful, efficient core screenings, maybe even maximally efficient core screenings of what is happening, I think we do have that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.71,
    "end": 2630.752,
    "text": "And I think you can find this even within these Libet paradigms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.292,
    "end": 2643.116,
    "text": "If you didn't, I think you still could have many of the varieties of free will worth having because many people have criticized and saying, oh, just moving your hand without a reason, that's not really agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2643.136,
    "end": 2644.257,
    "text": "That's not what we want from free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2644.297,
    "end": 2646.138,
    "text": "We want meaningful decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2648.464,
    "end": 2663.003,
    "text": " Sure, but I think even though for these studies, which people often will trot out and say, look, my brain made me do it, even then, I don't think it follows that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.744,
    "end": 2669.947,
    "text": " They show that our consciousness is epiphenomenal through and through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.967,
    "end": 2679.552,
    "text": "And I think active inference basically shows some of the particular ways that consciousness is indeed causal, even in these circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.072,
    "end": 2681.293,
    "text": "And I think that's a very big deal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.313,
    "end": 2688.656,
    "text": "I don't know how well it's surviving the replication crisis, but there's plenty of studies showing that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.197,
    "end": 2695.922,
    "text": " some undesirable consequences of people not believing in their own free will or their own agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2696.803,
    "end": 2704.871,
    "text": "Whether or not that works, I think there is a kind of this face valid account of this and that like, kind of like Dumbo's magic feather.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.211,
    "end": 2712.638,
    "text": "So like, you know, this elephant, I'm taking this from Dan Dennett from his book, Freedom of Olives, but this elephant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.019,
    "end": 2717.121,
    "text": " has a feather that the crows told him will help him fly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2717.141,
    "end": 2720.684,
    "text": "And he had his big ears, and he used them to fly when he had the feather.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2720.704,
    "end": 2722.145,
    "text": "But it was because he believed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.126,
    "end": 2731.112,
    "text": "Whether or not believing in free will gives you free will, not believing you're a meaningful cause, that becomes true just by believing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.328,
    "end": 2754.222,
    "text": " So I think it's quite dangerous to take basically something where we have something precious, something that basically would empower us to pursue our values, and to say, based on the several studies and using the authority of science, telling people that they are not meaningful causes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.362,
    "end": 2755.623,
    "text": "I think that's extremely pernicious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.383,
    "end": 2785.841,
    "text": " um and i think active inference can there's already great work being done like within like the neurophilosophy of free will pushing back against this and i think active inference can help uh showing people what are the meaningful degrees of freedom that they have um and how can they be preserved and expanded wow very interesting do you have any more slides to go through or may i ask some questions uh no more slides uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.425,
    "end": 2794.008,
    "text": " Okay, so those who are watching live, please feel free to ask a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2794.168,
    "end": 2801.774,
    "text": "Otherwise, I want to pick up near the beginning when you spoke about finding oneself in a stream of action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2802.875,
    "end": 2807.399,
    "text": "So what is happening when we find ourself in a stream of action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2809.025,
    "end": 2814.426,
    "text": " And I want to hear what you have to say and then take this to some questions about memory and free will.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2814.846,
    "end": 2819.047,
    "text": "But when we are suddenly aware, like, whoa, I'm on a run.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2819.167,
    "end": 2824.448,
    "text": "I mean, I guess I did make prior decisions about deciding and so on, but like, whoa, now my leg is moving forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2830.709,
    "end": 2835.55,
    "text": "So the... I imagine this varies a good amount, like as a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.752,
    "end": 2841.373,
    "text": " ter and intra individual difference variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.433,
    "end": 2845.595,
    "text": "So both between and within people, you're going to get a good amount of variance on this, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.255,
    "end": 2852.698,
    "text": "But the way Heidegger described it in terms of this difference between describing like hammering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.259,
    "end": 2860.742,
    "text": "And when you're a skilled craftsperson, the hammer is in your hand and it is ready at hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.022,
    "end": 2862.803,
    "text": "And your mind could be elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.883,
    "end": 2864.384,
    "text": "Or people might have the phenomenology of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.524,
    "end": 2874.731,
    "text": " on a run or on a drive, you might just find yourself home, you can listen to an audio book, you'll barely know you're just you have this effortless mastery of the task set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2875.472,
    "end": 2880.416,
    "text": "And it's only when something goes wrong that things are brought into awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.317,
    "end": 2881.757,
    "text": "And so the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2884.517,
    "end": 2890.862,
    "text": " It's only, and so then you get this motion between, so here's the hammer just in your hand, ready at hand to present to hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.623,
    "end": 2892.684,
    "text": "And now it's in the foreground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.704,
    "end": 2896.086,
    "text": "It was initially in this unconscious or semi-conscious background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.527,
    "end": 2910.398,
    "text": "And so like if someone's running, like for instance, they could largely be in a similar state of effortless mastery, especially because, you know, just natural pendulum motion gets you like a lot of the control that combined with some spinal pattern generators, you know, it's, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.658,
    "end": 2930.435,
    "text": " little other tweaks it's like you barely need to do anything once you once you've been trained up but let's say you're trail running and or let's say you run and then you step on something the idea would be that this violation of your expectations would cause basically prediction error",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.075,
    "end": 2934.276,
    "text": " And that this prediction error, the thing that was different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.496,
    "end": 2934.756,
    "text": "So, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.776,
    "end": 2955.402,
    "text": "So within predictive processing, part of one of this marriage between category and phenomenology where things just become unconscious and you only become conscious when you're something's wrong, you might, while being careful not to conflate levels of analysis, you could get a good amount of this just from predictive processing with a dual tier architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.002,
    "end": 2956.602,
    "text": "Like if,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.501,
    "end": 2960.602,
    "text": " Basically, you're really well trained up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.062,
    "end": 2962.063,
    "text": "You can explain things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.543,
    "end": 2974.467,
    "text": "You can basically handle things just with these efficient, unconscious couplings, unconscious inference, and a bunch of reflex arcs being skillfully deployed, doing most of the things you need to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.207,
    "end": 2979.808,
    "text": "And whether you want to call this modeling or not, it would be a matter of choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.848,
    "end": 2980.729,
    "text": "I would call it modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.729,
    "end": 2983.97,
    "text": "But you wouldn't need to become aware of it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.81,
    "end": 2985.951,
    "text": " unless something was wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.991,
    "end": 2989.132,
    "text": "And so then the idea is this lower down, it's not handled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.152,
    "end": 2990.012,
    "text": "You don't predict it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.032,
    "end": 2991.473,
    "text": "You don't explain away the prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.933,
    "end": 3010.541,
    "text": "It makes its way deeper into the brain, into the... It becomes more broadly... The deeper portion is, of course, it's... ...more explicit modeling and conscious modeling... ...processing challenges...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.728,
    "end": 3027.795,
    "text": " will be greater, more capable of accessing these richly connected sub networks, which could support basically this larger scale integrative simulation, some aspect of which would be your experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.836,
    "end": 3030.437,
    "text": "I don't know if that got it at all, but.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.297,
    "end": 3032.458,
    "text": " Yeah, awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3032.739,
    "end": 3040.628,
    "text": "So we're driving back towards free will, because I really liked how you approached it in this conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3041.128,
    "end": 3047.015,
    "text": "So I want to think about three concepts, memory, free will, and experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3048.985,
    "end": 3051.246,
    "text": " what are their Venn diagrams?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3051.446,
    "end": 3060.11,
    "text": "Like, can we, uh, of things that we remember, did we have free will for them or not more or less than expected for things that we experienced?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3060.19,
    "end": 3061.81,
    "text": "Do we remember them more or not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.99,
    "end": 3067.053,
    "text": "Could there be something that you didn't experience, but you remember and had free will on and so on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3067.193,
    "end": 3071.174,
    "text": "Like how our memory free will and experience bound together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3071.194,
    "end": 3076.697,
    "text": "That's a fantastic question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.017,
    "end": 3077.257,
    "text": "I don't,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.945,
    "end": 3082.568,
    "text": " So what's coming to mind, that's a whole other conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.608,
    "end": 3084.409,
    "text": "But what was coming to mind for me at the moment is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.053,
    "end": 3099.279,
    "text": " There's a partial definitional aspect of a connection between free will and experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.339,
    "end": 3102.02,
    "text": "So people want different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.06,
    "end": 3103.401,
    "text": "I wouldn't call free will one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.042,
    "end": 3107.584,
    "text": "In fact, I actually think there's a certain wisdom in just the language of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.044,
    "end": 3114.549,
    "text": "People want both the willing, they want the agency, and they want the degrees of freedom in terms of they want to be able to pivot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.305,
    "end": 3124.177,
    "text": " They want to be able to have what they do be a function of their past and being constrained by their memories and their meanings from the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.698,
    "end": 3131.988,
    "text": "But they also want to be able to break free, whether in the face of something new or just encountering something new or to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.972,
    "end": 3140.554,
    "text": " And so having that freedom for exploration is also going to be a part of agency, both within a context and across time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.175,
    "end": 3147.937,
    "text": "But the memory is going to be important because without the memory, that's the constraint based on values, based on you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.263,
    "end": 3161.396,
    "text": " You know, there's many aspects of the self, for instance, some of the most essential ones and maybe some of the gold standards of free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.416,
    "end": 3170.426,
    "text": "It's like this interface of like, you both want things and you want that you want them, where the wanting that you want is based on this integrative and like narrative type self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.227,
    "end": 3191.296,
    "text": " so that would be a way in which memory would very strongly like where free will would be a function both of experience that you want your experience your consciousness and your experience to be part of the causal stream leading to action part of your your valuing your affective inference you want that to be influencing both across time and in the moment um and so the experience would be essential like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.05,
    "end": 3198.392,
    "text": " It's not clear that many, like Dennett has argued that free will and consciousness must always be handled together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.572,
    "end": 3204.954,
    "text": "But without memory, you also though, it's not you either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.974,
    "end": 3210.936,
    "text": "I think there's an interesting thing though, in terms of like you're alluding to like basically connections between causation and memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.936,
    "end": 3218.598,
    "text": " And I believe we are better capable of remembering things when we can take them up into a causal unfolding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3219.038,
    "end": 3227.421,
    "text": "This basically affords a representation with more of a sparse structure of salience, of this led to this led to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.861,
    "end": 3233.703,
    "text": "And then you hold that causal graph in your mind as basically the core of your generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.003,
    "end": 3238.205,
    "text": "And it seems to be a highly efficient way of remembering things is to come up with a causal account of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3238.965,
    "end": 3253.456,
    "text": " And so if something is a product of your agency in a way that is automatically structuring things in this causal fashion, and so there should be a connection between having agency and free will in a circumstance and being better able to remember things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.057,
    "end": 3263.024,
    "text": "I don't know if that's the case, but it seems like some things from education theory suggest, like with respect to active learning, but I can see that going a lot of different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.629,
    "end": 3266.65,
    "text": " So that's a deep question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3266.69,
    "end": 3268.091,
    "text": "And that's what came to mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3268.191,
    "end": 3270.093,
    "text": "But what do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.394,
    "end": 3271.615,
    "text": "Wow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3271.695,
    "end": 3284.066,
    "text": "Well, the last piece you brought up about the sparsity, kind of the sharpness on the sparsity of the causal story, and then things that have a sharp...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3285.771,
    "end": 3307.596,
    "text": " and a sparse causal architecture as experienced with our very limited working memory they're like pre-digested and therefore very apt to be able to leave certain kinds of traces and then maybe something could leave a trace that didn't have a perceived sparse causal architecture in the moment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3308.573,
    "end": 3327.129,
    "text": " But that might be an example of a memory that's hard to recall or that might be cleaned up in post-production and may be very susceptible to being influenced because subsequent updates could try to draw attention to part of that uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3328.07,
    "end": 3333.015,
    "text": "And if there was just a loose memory of many things happening at a scene,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3334.272,
    "end": 3339.614,
    "text": " asking even a question about part of it could start to sharpen that aspect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3340.414,
    "end": 3356.5,
    "text": "And, um, so it's, it's an interesting question and also kind of like the questions, like what if you had some sort of suffering, but you didn't remember it or in between moments or when you were sleeping, you were having some sort of negative experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3358.843,
    "end": 3364.264,
    "text": " So just, I mean, what is happening with the mind and the brain?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3365.185,
    "end": 3376.467,
    "text": "The brain seems to be continuous, but then we have these more flashes and discreteness and shifting of mental attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3381.309,
    "end": 3382.969,
    "text": "Go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3384.069,
    "end": 3385.65,
    "text": "I just like the way you're describing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3385.69,
    "end": 3385.83,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.382,
    "end": 3395.289,
    "text": " I feel like it's a really good case in point of the answer to do we or don't we have free will should always be what do you mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.39,
    "end": 3403.677,
    "text": "And the answer is always the way you're showing these different processes could either go together synergistically or come apart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.439,
    "end": 3405.719,
    "text": "It's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.44,
    "end": 3409.404,
    "text": " How many meaningful degrees of freedom do we have in what circumstances?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.484,
    "end": 3415.532,
    "text": "Or in what senses do we have how much of which of the varieties of free will that we want in different circumstances?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.592,
    "end": 3418.115,
    "text": "So it's like the answer is there or isn't there free will?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.203,
    "end": 3424.084,
    "text": " it seems like like much more interesting is getting into the details and useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.644,
    "end": 3435.247,
    "text": "It's like getting into the details you're talking about right now with like the different ways that memory and experience and choice can all go together or not both within and across time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3435.828,
    "end": 3436.648,
    "text": "Like that's,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3438.323,
    "end": 3461.449,
    "text": " then that answer is like that i guess you could say that's like that's the real problem of free will and then that um interesting yeah like um that when the experiment of pushing the button is presented as being about the exertion of decision making in the moment rather than the um memory or the recalling of something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3462.813,
    "end": 3470.993,
    "text": " that might've been different in the moments, those are quite different settings and it could be a total different neurophysiology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3473.408,
    "end": 3481.79,
    "text": " And also what you said about how this sort of tension between having a connection to the past and the constraints that it provides, but also the ability to choose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3481.93,
    "end": 3485.991,
    "text": "And I guess that's what's explored in these varieties papers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3486.271,
    "end": 3495.974,
    "text": "So I wanted to not just ask, like, what are the varieties, but just specifically asking about the similarities and differences with bodily action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3497.005,
    "end": 3517.56,
    "text": " What are the varieties of free will we might have with respect to bodily action, like the so-called voluntary and involuntary bodily processes, and then mental action, where in active inference, we can model regimes of attention and metacognition and thought as like action policies on mental states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3518.121,
    "end": 3522.004,
    "text": "So what kinds of free will are out there for the body?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3523.792,
    "end": 3530.676,
    "text": " And what does that say about what might be a cognitive degree of freedom or not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3530.736,
    "end": 3532.578,
    "text": "Like, you know, just choosing what we want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3544.325,
    "end": 3549.929,
    "text": "So in terms of like body actions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.307,
    "end": 3564.076,
    "text": " If we're dealing with something highly rehearsed, then it seems like that could be an example or something where it's like ..",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3569.87,
    "end": 3577.754,
    "text": " you can model that, the predictive processing, like the hammer strike, and the loop is closed before it ever even enters the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3578.114,
    "end": 3585.938,
    "text": "It's in the CNS and the reflex arc, but it doesn't perhaps even make it up top before your body moves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.958,
    "end": 3587.539,
    "text": "That's just after the fact that you're aware of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.479,
    "end": 3590.56,
    "text": "But then if you're doing something like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.206,
    "end": 3605.475,
    "text": " And so then at this other extreme of abstraction, you might have something like planning, reaching a distal goal where there's many steps involved, and you need to come to some sort of sequence of the steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.156,
    "end": 3609.579,
    "text": "And along the way, actually, I don't know if that would be the extreme, but that would be...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.665,
    "end": 3613.265,
    "text": " there's certain things that have to happen to some orders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.325,
    "end": 3618.548,
    "text": "At the extreme of abstraction, it might be something like going to grad school, something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.888,
    "end": 3620.329,
    "text": "Too real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.349,
    "end": 3621.169,
    "text": "Getting a new job.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.93,
    "end": 3625.111,
    "text": "Ouch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3625.512,
    "end": 3632.235,
    "text": "That itself, there's a lot of things that have to happen before other things, a lot of dependencies, and a lot of multiple realizability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3632.715,
    "end": 3634.456,
    "text": "There's always multiple realizability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.516,
    "end": 3635.917,
    "text": "I go to reach for this glass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.937,
    "end": 3637.398,
    "text": "I could have reached for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.498,
    "end": 3639.359,
    "text": "I could have done a weird thing and gone like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.839,
    "end": 3642.901,
    "text": " I could have pinky out, pinky in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.701,
    "end": 3644.722,
    "text": "I prefer pinky out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3645.822,
    "end": 3647.543,
    "text": "But there's all sorts of things that could have done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3647.583,
    "end": 3648.684,
    "text": "There is multiple realizable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3648.724,
    "end": 3655.868,
    "text": "But the multiple realizability of something like going to college, going to grad school, that's even more so the number of ways you can go into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3656.488,
    "end": 3665.654,
    "text": "And then I guess I'm thinking in this middle regime of something that's still very clearly motoric, but would be novel in that fine-grained motor control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3665.714,
    "end": 3669.096,
    "text": "I'm learning for the first time, and I'm doing a tea ceremony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3669.856,
    "end": 3675.359,
    "text": " or I'm learning calligraphy, or I'm just learning to knit or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.0,
    "end": 3684.605,
    "text": "There, it's the fine-grained things are now being monitored as present at hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.125,
    "end": 3693.23,
    "text": "And you actually need to use your sophisticated inference machinery to help scaffold this basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3695.391,
    "end": 3701.717,
    "text": " the acquisition of skilled motor abilities, the capacity for skilled motor performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3702.618,
    "end": 3713.568,
    "text": "But I would also, I think, suggest that the whole way through, it's always built experience once it's being co-opted or controlled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3713.648,
    "end": 3718.913,
    "text": "And its controllability is always modal in a motoric fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3722.174,
    "end": 3728.739,
    "text": " claims I make in this paper, turns out that it's called premotor theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.219,
    "end": 3742.569,
    "text": "But that basically, through partial expression of a motor command or a motor prediction, the inference copy from that, the associated sensations, can be used as a means of top-down attentional selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3742.589,
    "end": 3746.692,
    "text": "It could be used as a means of attending to memory in terms of working memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.793,
    "end": 3749.734,
    "text": "Basically, you can use these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3751.512,
    "end": 3764.359,
    "text": " partially expressed motor predictions, not enough to actually cross threshold, but use them to basically as a source of control over dynamics of where your awareness is going and what's going in or out of your awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3765.079,
    "end": 3767.58,
    "text": "And the claim I make is actually that this is exhaustive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3767.68,
    "end": 3773.403,
    "text": "Like this is the only like lever you have is basically whatever is built off of a control hierarchy off of skeletal muscle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.923,
    "end": 3774.704,
    "text": "It's a claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3776.105,
    "end": 3780.487,
    "text": "But the idea would be like, even though I'm talking about something as abstract as,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.098,
    "end": 3789.817,
    "text": " going to college or grad school, there's still going to be some, it has to cash out as static and modal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3791.985,
    "end": 3796.926,
    "text": " You're seeing yourself in the different contexts, even for the abstracts, like justice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.487,
    "end": 3803.848,
    "text": "You still, to experience it, it's still going to have some sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.808,
    "end": 3806.028,
    "text": "Here's justice's scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3806.148,
    "end": 3807.069,
    "text": "Here's the courtroom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.589,
    "end": 3811.89,
    "text": "Here's seeing this memory from your past where there is an injustice or justice was served.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.39,
    "end": 3816.251,
    "text": "Here's you feeling this uneasiness or this righteousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.112,
    "end": 3824.558,
    "text": " So the idea, I would claim, is that any kind of control on any level will always cash out motorically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.339,
    "end": 3832.847,
    "text": "But there are meaningful differences in terms of whether you're engaging in something which is involving these immediate fast feedback loops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.887,
    "end": 3835.389,
    "text": "It might be multiply realizable, but less so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.97,
    "end": 3840.334,
    "text": "Or something which the affordance structure is more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.215,
    "end": 3856.573,
    "text": " being played out in terms of your capacity to control it and relate to it in terms of these even more multiply realizable high level plans of all the things, situations you might be in that would be related to achieving high level goals or abstract goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.217,
    "end": 3859.977,
    "text": "I don't know if that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3860.751,
    "end": 3865.074,
    "text": " Well, one thought on that is it's like a jigsaw puzzle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3865.874,
    "end": 3868.696,
    "text": "So there's only one way to assemble it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3869.356,
    "end": 3877.361,
    "text": "And it's kind of like there's therefore this bundle of trajectories of different realizations of how one is going to assemble it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3877.802,
    "end": 3881.744,
    "text": "Like there's sort of what happens on the table, all the combinatorics of the way to assemble it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3882.144,
    "end": 3887.507,
    "text": "And then there's like all of the real life combinatorics about how many minutes am I going to spend playing this jigsaw?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3887.547,
    "end": 3889.709,
    "text": "And then I'm going to go get up and do other stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3890.209,
    "end": 3914.598,
    "text": " and so the multiple realization of the jigsaw where it does all kind of come back to being completed is one thing and then yeah you brought up how when things are even the outcomes are unknown or there's multiple realizations those are where we start to maybe think about hierarchical nesting of models like we've been discussing in the slam paper and also",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3915.655,
    "end": 3938.348,
    "text": " the vivid imagining of different future states what is the regime of attention that might for somebody who wants to be an athlete help them make practicing and being on that path like more natural so what what how specific and what modalities that's kind of what it made me think of but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3939.768,
    "end": 3943.191,
    "text": " I kind of want to keep on going on this mental action route.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3943.752,
    "end": 3947.895,
    "text": "Has there been anything like a mental or a cognitive Libe experiment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3948.156,
    "end": 3953.86,
    "text": "Like where the instructions would be like, take a couple of breaths and just, you know, get up and walk around or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3953.94,
    "end": 3967.212,
    "text": "Just take a couple of breaths and then identify the moment on the clock when you chose to think about X. A pure mental on mental assessment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3972.213,
    "end": 3978.58,
    "text": " So, before I forget,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3980.64,
    "end": 4004.606,
    "text": " Just before I forget, I actually think what you're just mentioning, the optimal intentional engagement for something like a sport or some performance, actually, I think that's a key example of through skilled mental action or not, through the skillfulness of your mental actions, having more or less freedom where, for instance, if you're choking, for instance, you do it wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4007.199,
    "end": 4009.46,
    "text": " Jun Tani has a good paper on choking and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.98,
    "end": 4024.804,
    "text": "And so if you get that wrong, that would be like your free will being undermined by your mental action not being well calibrated in terms of where you're positioning your attentional selection for optimal grip or optimal engagement with what you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.167,
    "end": 4044.973,
    "text": " In terms of this more purely mental action libette, there's different versions of it that have been run, some of which I think would get a little bit more to that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4047.085,
    "end": 4057.815,
    "text": " And kind of what you described in terms of has one paper called Decisions that Matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.396,
    "end": 4061.398,
    "text": "And so basically, it would be choosing between charities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.999,
    "end": 4068.565,
    "text": "And in this charity choice, you actually don't see the same type of ramping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.125,
    "end": 4071.367,
    "text": "And I think this supports, to some degree,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.26,
    "end": 4089.737,
    "text": " the model I'm suggesting, and that if this ramping is a buildup of basically activity in your action-oriented body maps, cross-coupling with your interoceptive body maps, and this feeling of urge and mental stimulation, it makes sense that you would have that for something like pressing a button.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4090.297,
    "end": 4095.823,
    "text": "But if it's something like which charity I'm going to donate to, you might not get that same kind of tight coupling and feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.323,
    "end": 4098.144,
    "text": " And so I think that's some evidence in support of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4098.204,
    "end": 4106.527,
    "text": "But I think the particular thing you brought up, there's these and this is a direction I'm beginning to look into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.067,
    "end": 4116.431,
    "text": "There's these closely related waveforms to the readiness potential, the event related negativity and the SPN",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4120.245,
    "end": 4121.506,
    "text": " stimulus preceding negativity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4122.066,
    "end": 4130.452,
    "text": "And I believe some of them would be, for instance, preparing for information that's coming and then acting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.772,
    "end": 4134.615,
    "text": "I think that would be the ERN or the SPN, the stimulus preceding negativity is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4136.221,
    "end": 4142.59,
    "text": " You're preparing to receive information that's possibly salient, but there's no action required.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4143.291,
    "end": 4150.662,
    "text": "So I think that might be potentially, you could think of all these things though, and actively as having, they look,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4151.563,
    "end": 4153.264,
    "text": " very similar electrophysiologically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.744,
    "end": 4173.616,
    "text": "And I would suggest that they are all fundamentally similar and that what they're using, whether we're talking about patterns of attentional selection or specifically orchestrating mental simulation to act or not in terms of an overt action, that in all these cases, it is grounded in the modalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.696,
    "end": 4180.48,
    "text": "And this is basically understood implementationally as recurrent activity in different places of the control hierarchy over body maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.471,
    "end": 4189.473,
    "text": " Or in terms of algorithmically and functionally, an accumulation of model evidence for shifting your proprioceptive pose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4189.493,
    "end": 4193.335,
    "text": "That would be for an overt action, but for a documental action, similar story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.775,
    "end": 4201.557,
    "text": "But if the model evidence, I guess, would be a slightly different model, but it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4203.686,
    "end": 4224.831,
    "text": " if what you're imagining is your own, you're imagining your body being in a different state that would allow you to orient differently, to bias your sensors differently, to move your attention around differently, to do different precision weighting, but you don't imagine it vividly enough that it will actually drive your spinal reflex arcs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.952,
    "end": 4230.973,
    "text": "But that this would be what you would use even for potential purely mental acts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.772,
    "end": 4236.955,
    "text": " it would still be co-opting a control hierarchy off of skeletal muscle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4237.215,
    "end": 4245.92,
    "text": "And the reason I focus on skeletal muscle is because it's designed to have basically large gross actions with low latency, and it's controllable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.5,
    "end": 4255.366,
    "text": "And the conditions for fine-grained control are realized because you can actually direct your sensors using your effectors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.066,
    "end": 4263.489,
    "text": " with a large-scale meaningful outcome that can be causally modeled and tracked and controlled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.09,
    "end": 4281.938,
    "text": "And so then the idea is that basically, Vygotsky first expressed an idea like this, I think, with respect to thought as inner speech, where first you learn how to speak, and then through partially expressing your speech, you learn how to co-opt this process for a stream of thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4283.199,
    "end": 4283.899,
    "text": " as inner speech.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4283.919,
    "end": 4290.163,
    "text": "Whether you want to say that that exhausts thinking is a whole other thing, but inner speech would be a significant part of thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4290.183,
    "end": 4309.697,
    "text": "So the idea is this is all intentional mental operations, whether we're talking about shifting around basically the fine-grained adjustment of an overt skilled motor act or guiding your mental action with respect to attention and mental imagery and imaginings, that in each case",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4311.678,
    "end": 4334.205,
    "text": " you have the initial affordance structure, the initial control levers established via these overtly expressed behaviors and couplings of the world, which then later, by partially expressing them, gives you something you can repurpose for things like imaginative planning or covert detention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4335.646,
    "end": 4339.027,
    "text": "Or I would argue, any intentionally influenced mental process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.032,
    "end": 4368.616,
    "text": " maybe ultimately uh have its origins in this co-opting of motor control bold claim okay so what could be systems yes go ahead i just said could be wrong not financial advice not not extraterrestrial advice hardly even active advice",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4370.404,
    "end": 4371.847,
    "text": " It's very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4372.668,
    "end": 4382.366,
    "text": "What systems rise to this capacity and does their embodiment matter more?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4383.297,
    "end": 4388.321,
    "text": " So there are insects with tremendously reduced central nervous systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4389.482,
    "end": 4401.33,
    "text": "One could imagine a computational system that can engage in counterfactuals, but its only affordance or embodiment is one Morse code receiver or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4401.891,
    "end": 4407.735,
    "text": "So what systems have this capacity and why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4411.5,
    "end": 4427.32,
    "text": " Um, so I definitely don't know the boundaries, but if I were to shoot from the hip on this, the idea would be the handling would still be of this computational neuro phenomenology or Mario phenomenology, but instead of drawing brains,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.421,
    "end": 4450.216,
    "text": " we would draw a different nervous system or whatever the signaling information processing system is, we would still give it this kind of handling where there would be a mechanism, there would be a function, there would be some intermediate algorithmic mapping across these levels, and then you connect this to phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4450.696,
    "end": 4451.217,
    "text": "And so if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4451.897,
    "end": 4460.546,
    "text": " In this phenomenology, you're having basically goal states being represented, and the representation of these goal states is part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4461.688,
    "end": 4467.834,
    "text": "At that level, you're also able to get an account of the guidance of action selection to bring them about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4468.395,
    "end": 4471.899,
    "text": "Then you could say that you have degrees of freedom in that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.499,
    "end": 4473.58,
    "text": "So if we're talking about something like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4474.201,
    "end": 4483.464,
    "text": " And insects, you actually sent me a really interesting paper recently about dual systems thinking broadly construed, including for insects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4484.024,
    "end": 4499.589,
    "text": "And it seems like you would need at least a two-tier hierarchy where this upper level can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.592,
    "end": 4522.141,
    "text": " break free of immediate engagements with the sensorium and where this lower level would allow for your couplings with the world and the orchestration of overt action selection uh in terms of actually like sensory motor coupling to the world and then a process which can basically um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.776,
    "end": 4530.239,
    "text": " on top of that hierarchically higher that could infer these state transitions, but without them being expressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4531.139,
    "end": 4538.262,
    "text": "And if you have that, then you could do the types of counterfactual processing that you would need for planning and constructing causal models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4539.971,
    "end": 4545.573,
    "text": " It seems possible that insects might be able to do this in terms of, for instance, like in that paper you sent recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4548.313,
    "end": 4555.455,
    "text": "So the central complex has a lot of these properties of the hippocampal system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.255,
    "end": 4562.637,
    "text": "It's kind of like it has properties of the hippocampal system and the thalamus at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.417,
    "end": 4570.799,
    "text": " And it's giving you the salience map used for both orienting and moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4571.579,
    "end": 4580.562,
    "text": "But you also get these mushroom bodies, which are like the stratum, which would be basically helping with moment-to-moment action selection, biasing it in a value-driven direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.262,
    "end": 4583.323,
    "text": "And so in this paper, you're getting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4587.353,
    "end": 4595.44,
    "text": " dual systems for control, one which seems to be more immediate and reactive, and the other seems to be governed by slower processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.081,
    "end": 4599.084,
    "text": "And so it's possible that something like this could give you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4601.946,
    "end": 4623.281,
    "text": " ability to do sweeps of possibilities of counterfactual inference where you basically take the beginning of expressing the motor command and so the insects thinking i'm a locomote in that direction um i i don't know the evidence well enough to know if this is the case but um it could be and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4624.783,
    "end": 4629.124,
    "text": " So for a rodent, you'll see these sweeps in the hippocampus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4629.204,
    "end": 4629.885,
    "text": "There's a maze.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.545,
    "end": 4634.126,
    "text": "And you'll see predictive of whether the mouse goes left or right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.666,
    "end": 4637.247,
    "text": "You'll see these place fields representing different points in space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.847,
    "end": 4641.048,
    "text": "And in anticipation of this, you'll see these sweeps ahead of activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4641.648,
    "end": 4645.969,
    "text": "And then where the sweep is most robust, that will be the branch that the animal will go down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4645.989,
    "end": 4647.27,
    "text": "It will go down that set of places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4648.07,
    "end": 4669.081,
    "text": " in theory you could do a similar thing by other means uh maybe with some homology even in the insect nervous system maybe you can even do it in an ant colony if you're getting like an inner attractor capable of aggregating across all these different um finer grain couplings and engaging in control but so basically whatever has",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.743,
    "end": 4698.684,
    "text": " or I can't say, I'm not gonna say sufficient, but the claim I'll make for necessity would be some sort of dual tier architecture where the lower level gives you the couplings with the world and the upper level gives you counterfactual affordance and integration across these lower level potentially segregated coupling processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.574,
    "end": 4701.236,
    "text": " Something like that could do it for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4701.277,
    "end": 4703.56,
    "text": "And so could insects do it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4703.68,
    "end": 4705.282,
    "text": "No, potentially, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.483,
    "end": 4708.066,
    "text": "Could the insect colony do it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4708.507,
    "end": 4708.787,
    "text": "Maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.448,
    "end": 4715.477,
    "text": "The thing where I would place a potential constraint is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4717.0,
    "end": 4730.964,
    "text": " It seems like we might need an architecture to have properties where it could signal fast enough where these inferences of quickly enough that it can stay on top of its evolving action perception cycles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4731.424,
    "end": 4742.568,
    "text": "So in terms of its surfing uncertainty, it's moving through the world as couplings, the architecture, whether we're talking about a brain or some set of signaling across multiple individuals in like a hive mind,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4743.79,
    "end": 4762.542,
    "text": " We want it, I think, to be fast enough to have the estimates correspond to this sparse causal graph, what Benji would call, I think, independently controllable factors of the world, and not have a causal world model where you are an agent within it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.562,
    "end": 4768.926,
    "text": "But it seems like you would need to have the ability to model independently controllable factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4769.547,
    "end": 4772.509,
    "text": "And so you need a signaling system that's fast enough",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4773.387,
    "end": 4774.107,
    "text": " to pull this off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4774.547,
    "end": 4785.351,
    "text": "And so some sort of small world network architecture would be likely required, where you have a combination of local modularity, but then synergy through having some central hub.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.971,
    "end": 4800.876,
    "text": "And so if this could be pulled off by the hive mind, and if this can orchestrate the overall swarm to do things quickly enough to basically have purchase, have the right grips on the world, that it can both inform and be informed by its action perception cycles,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.676,
    "end": 4807.799,
    "text": " then you could have an agency architecture, which by some dimensions we might describe in terms of free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.76,
    "end": 4811.62,
    "text": "That dodged the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.801,
    "end": 4816.842,
    "text": "Before I respond, what about just the computational one?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4817.363,
    "end": 4825.186,
    "text": "What if it was a computational one and it was instantiating a digital twin, a limited or comprehensive digital twin of itself?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4829.753,
    "end": 4837.655,
    "text": " I mean, I personally think the... I feel like an integrated information theorist would say absolutely not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.795,
    "end": 4845.016,
    "text": "Some people within active inference communities would say no, it has to be physically realized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4845.657,
    "end": 4850.878,
    "text": "But I think something like a digital twin or some sort of emulation, the important thing for me is that the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4852.458,
    "end": 4859.784,
    "text": " there is a set of dependencies of effective connectivity that could be involving virtual processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4860.385,
    "end": 4879.501,
    "text": "And that if you trace out the patterns of effective connectivity of kinds, not necessarily made of matter, that if that is entailing the modeling of a system and its relationships with the world, and where within that system world model, it has this kind of agentic affordance,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.103,
    "end": 4881.863,
    "text": " For me, that counts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.943,
    "end": 4883.565,
    "text": "But a lot of people would disagree on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4883.605,
    "end": 4889.669,
    "text": "But for me, I think you're trying to find the maximally explanatory core screening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.95,
    "end": 4895.054,
    "text": "And sometimes that might be found at the level of the virtual machine and not in terms of the physical realization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4895.454,
    "end": 4897.295,
    "text": "And then that's actually the most meaningful cause.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4897.396,
    "end": 4900.258,
    "text": "And then if you trace it out there, that's where you would look for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4900.278,
    "end": 4903.58,
    "text": "And so that could be in a digital twin or emulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4903.901,
    "end": 4905.182,
    "text": "But a lot of people would disagree with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.909,
    "end": 4913.272,
    "text": " So when you were talking about applying this to the colony level, I thought about like the foraging behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4913.312,
    "end": 4916.533,
    "text": "That's like reaching out of the ground and grabbing a seed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4916.974,
    "end": 4919.795,
    "text": "And so that's like the enacted foraging trip.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4920.515,
    "end": 4927.719,
    "text": "And then is there a counterfactual, I could be foraging or we could be foraging at some different scale",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4928.579,
    "end": 4950.23,
    "text": " underground uh on the other side of the markov blanket of the nest entrance and then what if somebody were going to be tracking the the elevation of a forager and they'd be like well they go up and down in the nest but on the times where they make that decision to forage they always go up 200 milliseconds before foraging",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4951.109,
    "end": 4954.791,
    "text": " It's like, well, yeah, that's where the nest entrance is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4955.511,
    "end": 4967.216,
    "text": "So without going into whether they have will or not, it's like, it's some kind of cognitive motor integration when the person hits the button.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4968.256,
    "end": 4980.041,
    "text": "So then the way that you frame this as being like not a trivial artifact, in fact, an interesting outcome of aggregation of ERPs across trials",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4981.485,
    "end": 4988.848,
    "text": " It's like, how couldn't there be a coherent preamble?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4988.868,
    "end": 4995.011,
    "text": "Now, I guess if we're 30 seconds long, that would be a different setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4995.732,
    "end": 5007.377,
    "text": "But then when we connect it to the specific mechanisms that do have to come together in order for there to be a coherent motor action,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5009.477,
    "end": 5029.635,
    "text": " it's it's quite an interesting view and I wonder how those who have um interpreted it in a very different way feel have you spoken or asked to anyone who has a very clear and um different interpretation of what this potential means",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5032.245,
    "end": 5041.528,
    "text": " I've been discussing it some with, or I forget, I've been discussing some with, or a good amount with Uri Mose and Aaron Scherger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.548,
    "end": 5050.531,
    "text": "Aaron Scherger has, he has multiple views, but some of them do disagree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5051.071,
    "end": 5059.314,
    "text": "And so one of them is you, in theory, because you're averaging across multiple trials, there is an interpretation of readiness potentials as artifactual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.777,
    "end": 5068.18,
    "text": " And it's possible that sometimes you are dealing with an artifact of measurement, and this is an open question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5068.961,
    "end": 5075.724,
    "text": "But he's also, for instance, he's testing out the mental simulation view also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5077.144,
    "end": 5085.451,
    "text": " Another interesting hypothesis he has is actually some of the evidence accumulation is actually fast feedback loops with muscle spindles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5085.991,
    "end": 5091.936,
    "text": "And actually, you're getting basically the urge, actually, a lot of it is actually in the body itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.696,
    "end": 5096.7,
    "text": "But one interesting thing before I forget is that these, like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.821,
    "end": 5100.442,
    "text": " build up and then threshold crossing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5101.263,
    "end": 5104.905,
    "text": "I believe this you'll see across all nervous systems where you get action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.486,
    "end": 5112.15,
    "text": "And I would wonder whether this similarly to me saying like, you know, this isn't just like a brain story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5113.551,
    "end": 5114.231,
    "text": "Might we see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5115.572,
    "end": 5117.773,
    "text": " basically something like this, if we're looking at them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5117.994,
    "end": 5122.136,
    "text": "I think in your active input paper, you talk about stigmergic coherence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5122.716,
    "end": 5138.646,
    "text": "But through some sort of like, forgive me if I'm butchering it, but some sort of measure of that kind, you might see something like generalized action potentials for large scale changes in switching modes of the hive mind of the colony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5139.246,
    "end": 5144.089,
    "text": "And while I'm just speculating, I actually also, in terms of multistage hierarchies,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.43,
    "end": 5153.795,
    "text": " I actually wonder whether the brains, like for instance, the resting state networks of the brain, maybe not like, there's different granularities and parcellations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5153.855,
    "end": 5156.396,
    "text": "It can be as much as 17 or more if you wanted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5156.436,
    "end": 5163.481,
    "text": "But there are some solutions that are like maybe, so seven networks are most well-known, but there's also like five network solutions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5164.461,
    "end": 5175.428,
    "text": " And I'm wondering if there are actually universality classes for active inferential agents, that you'll actually get something like homolog of different resting state networks in their patterns of effective connectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5176.209,
    "end": 5183.273,
    "text": "So generalized resting state networks, generalized empirical phenomena to like things like readiness potentials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5184.654,
    "end": 5189.898,
    "text": "Very speculative, but I think we might.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.077,
    "end": 5218.673,
    "text": " a few interesting things that makes me think of and uh are we making cognitive science a creation in our own image if we talk about the generalized hippocampus and the general and so to what extent are we or can we must we generalize from our own action perception loop is uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5220.503,
    "end": 5246.222,
    "text": " putting another umbrella which the human mind is just a realization of and say well the cognitive domain is bigger than the human brain because it includes the brain body and the extended niche but also includes non-human systems like if we want a cognitive science that includes a thermometer or something like that like a thermostat is that a is that a cope",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5247.95,
    "end": 5255.692,
    "text": " Because actually, that is still the water that that model swims in is still human and cognitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5256.492,
    "end": 5258.492,
    "text": "Like, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5258.812,
    "end": 5261.453,
    "text": "But these are interesting pieces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5261.553,
    "end": 5266.374,
    "text": "I mean, it seems like, seems like surely what you're describing has to be the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5266.574,
    "end": 5275.016,
    "text": "And it's like, and that's like a both a good thing and a bad thing where it's like, we need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5275.691,
    "end": 5279.773,
    "text": " to be able to draw on an analogy with something we understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5281.834,
    "end": 5293.059,
    "text": "We're usually making sense of things in terms of other things, and so our own experience as this base domain, in order to give us some purchase, can we do it without it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5293.079,
    "end": 5295.58,
    "text": "You could say first principles thinking, but which first principles?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5297.421,
    "end": 5300.903,
    "text": "But then there's all of the baggage that could come.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5300.923,
    "end": 5301.463,
    "text": "It seems like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5305.106,
    "end": 5306.507,
    "text": " we can't avoid doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5307.248,
    "end": 5311.491,
    "text": "Maybe we could, but I don't know if we'd want to, but then like, we really need to be careful to track the disanalogies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5312.531,
    "end": 5317.995,
    "text": "Like if we're saying generalized to the campus, like, okay, wait, wait, wait, what are the disanalogies here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5318.015,
    "end": 5325.981,
    "text": "What are the proper unique properties that are present in the target domain and not the base domain of like the map, the analogical mapping you're doing or vice versa?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5328.062,
    "end": 5328.322,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5328.362,
    "end": 5330.043,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5330.084,
    "end": 5331.344,
    "text": "That's fraught what you're describing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5332.265,
    "end": 5332.505,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5333.366,
    "end": 5333.466,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5335.646,
    "end": 5357.936,
    "text": " well I think a kind of closing area just one point that I want to pick up on I thought it was really powerful what you said about really the social consequences and the personal consequences of interpretation of neurosciences and in some ways even science communication around empirical results like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5359.315,
    "end": 5383.524,
    "text": " the idea that we could opt out to free will and that in a world where there's limited degrees of freedom you might be coerced into thinking you had free will or not but if there's any glimmer of free will it can be used to deny and deceive itself so that puts research in this area",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5384.807,
    "end": 5391.691,
    "text": " in a different reflexive position than research on other systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5391.891,
    "end": 5403.657,
    "text": "So I guess just how do we move forward here while drawing on the specifics and being respectful of basically the past and the present and the future?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5403.677,
    "end": 5411.822,
    "text": "I mean, for me, I definitely have a lot of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5413.326,
    "end": 5432.083,
    "text": " uh, sold a soul in the game and that like, this is actually maybe the biggest thing that a couple of things, but this might've been one of the biggest things that got me into cognitive science was a very long extended, um, freak out about free will when I was younger, where it was just, I couldn't see how anything could be mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5432.323,
    "end": 5434.125,
    "text": "I couldn't see how anything could be meaningful without it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.145,
    "end": 5438.409,
    "text": "Um, I don't know if I still believe that exactly, but, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5440.383,
    "end": 5449.972,
    "text": " For me, it was very difficult to not believe that there were this sort of all or nothing thinking about free will and then going with the nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5452.254,
    "end": 5455.277,
    "text": "Dennett actually rescued me from that with Freedom Evolves, his book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5455.417,
    "end": 5462.964,
    "text": "But there was a long time where it seriously bothered me and it had real negative consequences on my life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5465.262,
    "end": 5494.524,
    "text": " the and i'm not alone in this i've talked to others and they also feel that way and um part of the way this is coming up in the present work with um psychedelics actually is um so there's this study with um i'm preparing for with creative professionals who are suffering from burnout and one thing i'm wondering in terms of like people can get burnt out from you know multiple reasons but to the extent that this is continuous with burnout is continuous with uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5495.998,
    "end": 5507.593,
    "text": " depression or feeling like you don't have agency in context where you want to have agency or feeling like you don't have adequate control of something where it really matters that you do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5509.895,
    "end": 5511.456,
    "text": " that seems like a good recipe for burnout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5511.476,
    "end": 5524.026,
    "text": "And it seems also like a decent model for some forms of depression, where if you view yourself as not being able to be a cause in the world, if you're not able to meaningfully work towards your values, that could be very distressing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5524.046,
    "end": 5529.29,
    "text": "I mean, it could also be a state of like a quasi-Buddhistic, like blissful surrender.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5529.99,
    "end": 5534.254,
    "text": "But there's a question, are we flirting with nihilism there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5534.314,
    "end": 5534.874,
    "text": "There's a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5535.675,
    "end": 5536.576,
    "text": "And the other question is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5538.43,
    "end": 5549.459,
    "text": " Is it even legitimate, though, to be an eliminativist on the self and on volition, and then just to say, it's okay, you're not real, your volition isn't real anyways, don't worry about it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.959,
    "end": 5551.921,
    "text": "Was that even a legitimate intellectual move to begin with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.941,
    "end": 5552.721,
    "text": "I would argue it wasn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5554.863,
    "end": 5559.947,
    "text": "So yeah, I think this is the stakes here for people's sense of themselves changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5561.007,
    "end": 5562.048,
    "text": " I believe they really matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5562.308,
    "end": 5568.574,
    "text": "And I believe they have both social and clinical and social consequences, existential consequences for people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5570.014,
    "end": 5581.403,
    "text": " And I'm glad that there's this growing community of people in the neurophilosophy of free will who have been doing a really great job pushing against some of these, I believe, excessively inflationary views.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5583.144,
    "end": 5594.474,
    "text": "And I believe that active inference might be a really valuable contribution to these efforts in terms of providing formal models and models that can go across this Marian neurophenomenological stack",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5595.354,
    "end": 5610.439,
    "text": " or computational neurophenomenological setup and actually address these phenomena in enough detail where not only can we feel meaningfully satisfied where we understand our own agency, but we could intervene, and hopefully for the better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5612.54,
    "end": 5615.121,
    "text": "Yeah, just some last thoughts on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5615.161,
    "end": 5617.542,
    "text": "That's very powerful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5618.042,
    "end": 5623.184,
    "text": "And the mutual constraints and the interdependencies of the different levels,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5625.197,
    "end": 5647.229,
    "text": " it may come down to someone's genetic sequence of a receptor or some kind of binding affinity with a molecule, but then it could also be integrated in kind of a full stack way with talk or action or changes to the niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5647.849,
    "end": 5651.091,
    "text": "So it gives like a full stack yes and way that's not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5653.365,
    "end": 5655.507,
    "text": " I think a dead end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5655.567,
    "end": 5657.508,
    "text": "It's more like a starting state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5657.548,
    "end": 5667.774,
    "text": "Like if the computer weren't working and then there was like the hardware and there's a software, but then moving beyond just that type of analogy, just very,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5669.281,
    "end": 5675.666,
    "text": " powerful about burnout and about the different cognitive ways that we might get there and get into it and get out of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5676.366,
    "end": 5682.67,
    "text": "And so it's like stoicism or whatever, plus preferences, because it's not just the neutral stance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5682.791,
    "end": 5684.632,
    "text": "It's not just a descriptive stance on burnout.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5684.672,
    "end": 5686.373,
    "text": "There's like a preference there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5686.693,
    "end": 5690.236,
    "text": "So Adam, if you have any other thoughts, please feel free.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5690.256,
    "end": 5696.04,
    "text": "I guess a quick thought is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5699.401,
    "end": 5721.348,
    "text": " is if we're looking and this is like to follow up on the um comment or something like these somewhat buddhistic eliminativist framings of um agency and i said like are they even legitimate uh i'm gonna argue um no they're not uh and specifically um if we're thinking of something like modeling the self",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5722.028,
    "end": 5744.133,
    "text": " through time as a high level controller, if you engage in some sort of practice, whether it's discipline meditation for a long period of times, or you've taken like a very high dose of psychedelics, and you've basically collapsed the depth of your, the temporal depth and counterfactual richness of your generative modeling, you will not find yourself there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5744.473,
    "end": 5745.093,
    "text": "You will be gone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5745.453,
    "end": 5747.094,
    "text": "There will be no like you to talk about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5747.114,
    "end": 5748.494,
    "text": "You might call this something like ego depth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5749.448,
    "end": 5756.295,
    "text": " But then to say that there never was a you process to begin with, I believe that is actually illegitimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5756.335,
    "end": 5762.881,
    "text": "You've basically used a search strategy that a priori should not have been able to find the self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5763.622,
    "end": 5767.005,
    "text": "And then using that search strategy, you then concluded it didn't exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5767.606,
    "end": 5770.148,
    "text": "And I think that just doesn't work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5770.849,
    "end": 5772.831,
    "text": "So in this case,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5774.557,
    "end": 5782.901,
    "text": " you know, to quote Dennett again, uh, you know, individuals, their narratives, their persons, you know, they're real patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5783.822,
    "end": 5793.926,
    "text": "And, um, but they're also, there's a reflexiveness to it where their own belief and their own reality is an important part of their causal significance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.468,
    "end": 5796.768,
    "text": "And so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5798.562,
    "end": 5809.253,
    "text": " I think it would be good to have some nice debates with different members of the active inference community who are more deflationary on things like selves, self-processes, and agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5809.273,
    "end": 5816.52,
    "text": "Because ultimately, I think this is a thing where it's going to be like, well, we should be respectful in disagreements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5818.022,
    "end": 5820.144,
    "text": "I think it really matters we get it right to the extent we can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5823.595,
    "end": 5826.339,
    "text": " Thank you, Adam, for the excellent presentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5826.499,
    "end": 5830.165,
    "text": "Apologies for any internet glitches that might have happened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5831.386,
    "end": 5834.631,
    "text": "We are a strange loop and this has been a strange live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5837.675,
    "end": 5838.717,
    "text": "Always good talking to you, Daniel.",
    "speaker": "SPEAKER_00"
  }
]