[
  {
    "start": 1.55,
    "end": 2.131,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3.132,
    "end": 8.438,
    "text": "Welcome to the Active Inference PAR et al textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.439,
    "end": 11.121,
    "text": "Welcome to cohort three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.161,
    "end": 15.766,
    "text": "Our journey begins here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.067,
    "end": 20.051,
    "text": "It is January 25th, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 21.652,
    "end": 25.797,
    "text": "And this is an onboarding and overview meeting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 26.538,
    "end": 30.342,
    "text": "So as with all meetings, it is being recorded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.49,
    "end": 35.235,
    "text": " We know that no single meeting time will accommodate every single person's schedule every time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.736,
    "end": 38.479,
    "text": "So live meetings of this type are recorded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.079,
    "end": 47.468,
    "text": "And then later in this day, like 10 hours from now or something, there's the office hours, optional as everything is in Discord.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.469,
    "end": 54.095,
    "text": "And these meetings are recorded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.115,
    "end": 55.036,
    "text": "They'll be available here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.156,
    "end": 60.362,
    "text": "So for example, you can see from cohort two, there will be like a link for the video recording.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.097,
    "end": 66.804,
    "text": " This first meeting is onboarding and overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 67.726,
    "end": 85.995,
    "text": "So the first part is going to be going over the textbook group and the structure of the coda, which I know looks large, but it is possible to focus in and steward the parts that you're interested in and not the parts that you're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 86.127,
    "end": 94.839,
    "text": " So I'm gonna give an overview of the structure of the textbook group in terms of synchronous and asynchronous participation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.78,
    "end": 103.731,
    "text": "And in the Zoom chat, please feel free to ask any questions you want just so that we can address them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.771,
    "end": 112.523,
    "text": "The goal here is to reduce your uncertainty, increase your confidence around participating,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.655,
    "end": 123.689,
    "text": " There are so many ways to participate and we wanna welcome and accommodate and encourage everyone coming from totally different learning preferences and backgrounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 124.63,
    "end": 133.561,
    "text": "So I'm starting on the very top left of our Coda and the link has been put in the chat and also note that I'm using dark mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 134.142,
    "end": 139.168,
    "text": "So Coda might look like that, but I'm using it in dark mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.342,
    "end": 143.484,
    "text": " Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.565,
    "end": 154.094,
    "text": "Many people here in this room right now I know have been fundamental and with us for years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.375,
    "end": 157.157,
    "text": "Others, this might be one of your first times joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.818,
    "end": 158.939,
    "text": "That's all great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 159.74,
    "end": 160.981,
    "text": "And I'll put this link in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.362,
    "end": 167.327,
    "text": "The textbook group is one of many activities that are ongoing at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.627,
    "end": 170.37,
    "text": "So here we are in the Pardal textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.671,
    "end": 177.3,
    "text": " And there's other education and research oriented activities that you can explore and find out more about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.121,
    "end": 186.231,
    "text": "But for now, we're going to be focused on the textbook group and we'll reach out to other sources and places as we need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.292,
    "end": 189.235,
    "text": "The textbook itself is open source.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.036,
    "end": 195.463,
    "text": "We are talking about the textbook from 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.865,
    "end": 199.308,
    "text": " the Active Inference textbook by Parr, Pizzulo, and Friston.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.249,
    "end": 203.713,
    "text": "And it's an open source textbook, which is awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.733,
    "end": 209.038,
    "text": "That allows us to, facilitates us, of course, working in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.078,
    "end": 212.502,
    "text": "And also it allows you to download the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.042,
    "end": 214.804,
    "text": "So you can download the PDF right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.864,
    "end": 222.632,
    "text": "And I know there's some other efforts that some of you have started involving, like making it a living textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 224.688,
    "end": 249.193,
    "text": " directory page and you can hide and show the sidebar sorry one second the directory page has information on different sections of the coda and what you can find there live meeting page summarizes when our live meetings are happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.511,
    "end": 275.62,
    "text": " and we're specifically in cohort three so here we are uh this list is just auto populated from the names that people have put so let us know if you want anything to be changed just active inference gmail.com and also this is a field that you can edit if you want to add your desired contact information it wasn't added for anyone but if you want to put",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.203,
    "end": 302.434,
    "text": " contact me on this way at this time or if you're interested in that like you can add that here for connecting within the cohort and then there's that cohort 3 live meetings page that has the date and time of all of our meetings and that's where the video recordings are going to be placed as well broadly today we're here to go on an overview take any introductory thoughts and questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.545,
    "end": 332.134,
    "text": " also hear from each other like what are we excited to learn and what is going to motivate us in this optional but extremely exciting and useful quest that we're on then we will have two weeks per chapter the chapters are not super long so two weeks is a good amount of time to give reading and or listening to it a chance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.308,
    "end": 362.02,
    "text": " take notes and we'll talk more about what that can look like and be but on the uh meeting for a given chapter we're going to focus on that chapter and sometimes again we'll reach into other resources but we're gonna focus our attention on the focal chapter and then to a slightly lesser extent other parts of the textbook because people might have a question that like oh that's going to come up in chapter seven or that's going to come up in chapter three and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 362.911,
    "end": 376.363,
    "text": " this textbook is not the only star in the constellation of emerging active inference literature and so there's going to be many times where we'll reference like other papers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 376.512,
    "end": 398.976,
    "text": " other programs and especially we'll reference a lot of the live streams the several hundred paper oriented and model oriented live streams that we've done at the institute and so many of the critical papers and researchers we've highlighted in these streams so it's like a really awesome resource",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.462,
    "end": 413.844,
    "text": " Okay, as for onboarding and participation, so these are all evolving documents and in an evolving Open Science Creative Commons space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.166,
    "end": 420.694,
    "text": "So with our participation in synchronous and asynchronous,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.927,
    "end": 443.205,
    "text": " institute affordances like this zoom room and this coda we're agreeing and abiding by rules of general respect and also of the um like open source status of what we're collaborating on here and we are students in the textbook group",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.253,
    "end": 445.337,
    "text": " We're focused on learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.038,
    "end": 454.592,
    "text": "It's going to lead many of us towards project ideas and collaborations, which we're also very excited to facilitate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.397,
    "end": 463.928,
    "text": "We expect and prefer and hope you to be an engaged learner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.127,
    "end": 493.982,
    "text": " though there may be multiple types and levels of novelty or frictions so communicate early communicate often let us know how we can improve things for you there's a lot of opportunities and bandwidth to help you literally specifically with what you want so make it known and hopefully with this very capable and diverse group we can make it happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 494.806,
    "end": 497.169,
    "text": " We've also included some students' practices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.01,
    "end": 508.405,
    "text": "You can just click these sections away if you're not needing them or not interested in them in a moment, but students' practices, like what is it to really learn active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.525,
    "end": 510.768,
    "text": "What are we really doing from a verb perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.449,
    "end": 520.662,
    "text": "And so here are some suggestions and some options ranging from annotating, writing, systematic reading,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.367,
    "end": 529.936,
    "text": " having leisure time, making programming constructions, adding questions, adding ideas and insights, adding projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.956,
    "end": 532.758,
    "text": "There's many ways that we can participate and be involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.798,
    "end": 541.187,
    "text": "And if you're finding something that's exciting and engaging for you, and you feel like it's adding value to your active inference learning, let's add it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.967,
    "end": 544.49,
    "text": "Other learners may be interested in it too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.331,
    "end": 549.535,
    "text": "So that's overall what participation is like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.667,
    "end": 554.893,
    "text": " This is the pace or the rhythm that we'll be following in the sessions that are weekly at this time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.454,
    "end": 562.763,
    "text": "We're gonna get in the next three months through the first half of the book, which is like a lot of the conceptual and theoretical underpinnings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.404,
    "end": 569.171,
    "text": "And then the second half of the book is about a recipe for modeling itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 569.571,
    "end": 576.72,
    "text": "So you can see like cohort two, who meets actually an hour before this, if you ever wanna join, you're welcome to, same link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.7,
    "end": 600.514,
    "text": " from september to november 22 we went through chapter one through five and now we're going through chapter six or ten and so we'll do something similar like from may to august we'll go through chapters six through ten again everybody can join everything go through multiple times in the beginning or however it's going to work out in your life and practice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.595,
    "end": 608.121,
    "text": " But we're going to be having this pace with the recorded video meetings going through chapters one through five in the coming months.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.222,
    "end": 613.446,
    "text": "And then if that is all you have bandwidth for, that's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.507,
    "end": 620.552,
    "text": "However, to engage with the material on your own time is really where the learning is going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.272,
    "end": 627.858,
    "text": "And some of your edits and contributions on your own time will be in this coda as well, in sections that we'll look at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.358,
    "end": 630.4,
    "text": "Others will be in your own documents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.86,
    "end": 661.517,
    "text": " so join when you can watch the video recordings when you can comment early comment often let us know how we can help and improve things so let's go into first just any general questions on this and then we'll go into like the textbook itself and how we use coda around the textbook all right in the textbook section itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.079,
    "end": 687.387,
    "text": " this textbook is the first active inference textbook and it's the first version of the first active inference textbook there's a lot of other uh critical work like vital work as well as skeptical work and carl friston who's one of the central researchers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.586,
    "end": 704.059,
    "text": " in this field, and Pollard and Pizzullo, two younger researchers who have worked with Friston, have created this first version of a first textbook published at the end of March 2022, so about eight months ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.912,
    "end": 723.859,
    "text": " It's a big moment for our field, and you here are all some of the very first to be going through this textbook, which is positioned, as Fristin has said, towards a master's student in computational neuropsychiatry looking to apply this to their own research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.58,
    "end": 727.144,
    "text": "That may literally describe some of you,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.124,
    "end": 747.428,
    "text": " others may have quite a different context doesn't mean it's going to be um not fit for you in fact it's been exciting to see how many different backgrounds and people have resonated with this textbook and with of course all the related work so this is like um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.745,
    "end": 771.762,
    "text": " flag in the ground for active inference but also this isn't a one-stop shop so anywhere that you're like i wish they would have explained this or what is the meaning of that like that is what we're doing in this group importantly this textbook doesn't have any questions there's no assessment or basic comprehension questions and that is also a huge aspect of what our work is here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.062,
    "end": 777.196,
    "text": " So, to go through just some of these pages and how we use the coda.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.5,
    "end": 781.448,
    "text": "There are some equations in this book you might have noticed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.457,
    "end": 792.851,
    "text": " How do we plan to understand and work with these equations, recognizing everyone's different capacities and preferences for equations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.512,
    "end": 799.42,
    "text": "Well, one thing that we do is for every equation, and this work has been done by previous cohorts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.64,
    "end": 805.108,
    "text": "So now we're in the improve phase, not the first construction phase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.129,
    "end": 810.675,
    "text": "For every equation, we have a screenshot,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.655,
    "end": 835.718,
    "text": " and a verbal description so anywhere in the coda someone can be like i'm curious about equation at 2.5 mouse over it what is it oh okay okay equation 2.5 cool whoa what but what is it what does it mean oh the variational free energy is etc so here's the natural language description of these equations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 838.583,
    "end": 840.185,
    "text": " I'm just muting people who are making little noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.345,
    "end": 840.625,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.166,
    "end": 857.982,
    "text": "So you'll gain familiarity with Coda and how everything looks, but when you see a canvas that you can pop out, you can find a natural language description and it's not there for every single one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 858.342,
    "end": 865.789,
    "text": "So these are like the exact kind of contributions that people can make that have extremely high leverage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.575,
    "end": 884.755,
    "text": " Anywhere that you can add a description or add comments or notes, add it in LaTeX, those are like the kinds of local improvements that in our group context with like 30 plus future cohorts of us here can be like actually transformational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.216,
    "end": 889.741,
    "text": "I mean, equation 2.5 is one of the essential equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.162,
    "end": 893.205,
    "text": "How can we come to understand it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.225,
    "end": 894.406,
    "text": "Well, we can have discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.446,
    "end": 895.928,
    "text": "We can ask questions on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.684,
    "end": 902.573,
    "text": " We can do like what Jakob had previously done, like show how the lines of the equation are related to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.614,
    "end": 915.034,
    "text": "So there's an incredible amount of work that we can do around improving the equations and Coda facilitates us using every row as something that can be referred to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.915,
    "end": 916.536,
    "text": "So that's equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 917.317,
    "end": 918.439,
    "text": "We have figures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.841,
    "end": 941.541,
    "text": " also every figure has been brought in not everything is fully tagged or fully described but figure 2.2 oh there it is so we can use it and refer reference to it as like something stable and as something that we can ask questions about and so on boxes and tables all of those have been brought in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.825,
    "end": 970.161,
    "text": " In the code page, this may or may not be relevant for the first half of the book for you, depending on where you're at with code, but we have a lot of Active Inference code implementations, and we can go more into this as people want to, but there are a lot of code-based implementations, especially in Python, but also in MATLAB and other languages for people who want to see code",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.664,
    "end": 997.532,
    "text": " what it looks like in a program form and something that we'll come back to again and again it's just always a Nexus to develop is we're going to be talking about math natural language graphical visualizations and art programming philosophy like we're going to have a lot of different things coming together there's no single path within active inference or two active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.845,
    "end": 1003.511,
    "text": " People have different backgrounds and familiarities with different areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.312,
    "end": 1011.621,
    "text": "And so maybe for one person, it's like the philosophical implications that are exciting for you, and then you'll come to see the programming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.041,
    "end": 1020.692,
    "text": "Maybe somebody else sees the programming adjacency, and then they'll come to be excited about the philosophy or about how to visualize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.712,
    "end": 1024.617,
    "text": "So we'll be moving across those domains, and...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1025.39,
    "end": 1044.377,
    "text": " yes there is a facet of daunting scope we're here in a new context and this is an opportunity to learn the way that we want to learn and that is learning actively",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.623,
    "end": 1066.686,
    "text": " in chapters notes and questions um we have like some sections that if you want to zoom in on a specific chapter so here's like the table of contents and then here's the fine scale table of contents with the sections um so somebody can say like i'm talking about section at 1.4.2",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.611,
    "end": 1075.003,
    "text": " Again, maybe that's like relevant and you want to do that, but we do reference different sections and then that makes it, oh, okay, that's what this section is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.063,
    "end": 1076.866,
    "text": "Here's what page it's on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.807,
    "end": 1086.021,
    "text": "Within a given chapter, like chapter one, there is a subset of questions that have been asked on chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.122,
    "end": 1090.428,
    "text": "And then also there's just other discourse on these pages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.67,
    "end": 1094.935,
    "text": "And so we have those for all the chapters and for the appendices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.282,
    "end": 1097.824,
    "text": " That's the textbook section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.565,
    "end": 1110.381,
    "text": "It's primarily just focused on stripping out and reformatting the material of the textbook so that it can be referenced and enriched to this extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.102,
    "end": 1116.289,
    "text": "Like everywhere that equation 2.5 is used, it's augmented by what we've added to this table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.85,
    "end": 1120.855,
    "text": "So mark once, use many times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.594,
    "end": 1130.426,
    "text": " In the discourse on the textbook, this is like really where the creativity and the generativity of our cohorts is going to shine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.048,
    "end": 1139.918,
    "text": "We want to facilitate active learning and a huge element of active learning is this question based perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.719,
    "end": 1143.103,
    "text": "So here's an overall questions table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.044,
    "end": 1150.993,
    "text": "And also there's a filter view that will only be for our cohort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.56,
    "end": 1158.447,
    "text": " Um, I believe someone has already added a bunch of questions for chapter one, which is awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1159.449,
    "end": 1167.739,
    "text": "Um, like the questions are shown on the left and you can just add by hitting enter and just adding a new question down here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.44,
    "end": 1171.023,
    "text": "And then also you can pop up the answers in discourse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.545,
    "end": 1179.714,
    "text": "So here it, and also I'm using control and plus or minus or control and scroll to make Coda bigger or smaller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1179.774,
    "end": 1181.016,
    "text": "That can be quite useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.877,
    "end": 1182.077,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.656,
    "end": 1198.564,
    "text": " these questions that people have asked range from basic and testing comprehension of even very yes or no or multiple choice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.152,
    "end": 1219.799,
    "text": " all the way to really the kind of connections and relationships that are the substance of having fluency and comprehensive understanding of active inference on through speculative philosophy questions and open areas of research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.221,
    "end": 1227.589,
    "text": "If each one of us here added like one question per week,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.193,
    "end": 1241.155,
    "text": " and refined zero or a few questions of discourse, we would have a truly transformationally different active inference learning environment worldwide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.956,
    "end": 1244.38,
    "text": "And I don't think that's an overstatement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.461,
    "end": 1251.23,
    "text": " There are not many groups working on this textbook, especially in this collaborative capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1252.212,
    "end": 1258.32,
    "text": "The textbook doesn't have any questions associated with it, and we're very close with the authors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.762,
    "end": 1270.317,
    "text": "We're going to have opportunities to use what we're developing here broadly and play a role in the future of active inference education.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1270.448,
    "end": 1288.474,
    "text": " that's one of the most important reasons why adding questions and refining questions is so critical like we've all heard oh if you have the question and X number of other people in this room or lecture might as well that is is and will be happening globally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.635,
    "end": 1299.868,
    "text": " When we use the active inference ontology, which I'll come to after showing the other sections, we also can leverage our questions in the discourse on them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1300.749,
    "end": 1310.361,
    "text": "And in the live meetings, what we will tend to do is focus on questions that haven't been addressed yet that have been upvoted as interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.932,
    "end": 1338.897,
    "text": " like we'll just pop it open and let people share and we'll all open up this and we'll start taking down some thoughts and questions and we're just like getting it on the page being active making contributions it doesn't need to be unified or consistent in the initial framing but these are the kinds of things that are going to help people in their synchronous and asynchronous active learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.315,
    "end": 1360.902,
    "text": " this textbook and even beyond because a lot of these questions are of course more general ideas and insights is like if you just want to lock in an idea or an insight you had and just crystallize that so that others can see that oh chapter one i was like oh here's what this means",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.248,
    "end": 1365.255,
    "text": " Might be shocking for some, might be incomprehensible for some, it's all good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.315,
    "end": 1370.507,
    "text": "Just when you add it in here, it becomes part of our collective space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.389,
    "end": 1376.882,
    "text": "So I highlight questions a lot because that is one of the most important ways that we can,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.655,
    "end": 1383.102,
    "text": " increment our understanding and go from that like moment of friction or uncertainty, like what does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.142,
    "end": 1384.223,
    "text": "Or why doesn't they define this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.263,
    "end": 1385.445,
    "text": "Or what is this equation doing here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.485,
    "end": 1386.286,
    "text": "Or what does that figure mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1386.306,
    "end": 1394.976,
    "text": "It's like in that moment of not understanding, make the choice to write down the question and our group will have an exponential capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.517,
    "end": 1404.388,
    "text": "But if everybody just wonders about it and nobody writes a question or augments the question, then it's gonna be like, we're all moving ahead linearly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.917,
    "end": 1434.342,
    "text": " the math learning group so um this is active to the extent that people want it to be it was a suggestion and uh brought forward by some of the participants in the first cohort and in this little subsection which again put it aside if you don't want to we really wanted to focus on the foundational understanding of the math that's one of the stickiest parts of this field",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.081,
    "end": 1438.946,
    "text": " And it is also fundamental.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1439.567,
    "end": 1446.777,
    "text": "Like the relationship between surprise, uncertainty, and hidden states, that relationship isn't a poem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.238,
    "end": 1459.455,
    "text": "It's beautiful, but also there is mathematics that underlies these topics and we want it to be accessible and rigorous for all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.216,
    "end": 1464.582,
    "text": "So in this section, which again, if somebody wants to like steward this math learning group,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.697,
    "end": 1488.173,
    "text": " and bring together basic resources on matrix algebra on stochastic systems on calculus or wants to write summaries like some have done that come through the um sections those are super useful Yana any thoughts on being stuck or not having questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.958,
    "end": 1519.29,
    "text": " it's not required to ask questions so if the expression that you have in response to the material is not question oriented if it doesn't pose itself as a question it's all good or as a question every time it's all good and so what is it that affords the emergence of questions whatever it is when it emerges feel free to capture it if it emerges as something different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.439,
    "end": 1537.684,
    "text": " or even something ineffable or non-active in that moment it's also all good add any other comments or feel free to add things but like number one imperative is to stay in the game stay engaged",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.453,
    "end": 1564.279,
    "text": " and if we live to play another day we advance our knowledge of active inference and just for like a little context this is something that would be taught in a graduate school optional seminar for some of you that might literally describe you but for those who are stepping into something that from a legacy perspective isn't what they would be stepping into like they're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.525,
    "end": 1580.091,
    "text": " least i personally but i also hope more broadly that the bravery of that could be understood in project ideas uh participants have added various project ideas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.746,
    "end": 1596.006,
    "text": " So contact these people or like add your own ideas, anything from doing audio book recordings to specific modeling, different educational possibilities, mathematical derivations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.186,
    "end": 1604.998,
    "text": "So improving like on one hand the rigor while we're also working on the other hand with accessibility, keeping those integrated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.991,
    "end": 1623.882,
    "text": " resources it may become relevant and ali contributed this initial table it may become relevant to refer to other resources so you'll find a lot of other materials here and in future textbook groups there's like a feedback form",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.486,
    "end": 1628.371,
    "text": " which we'll update at the end so that we can give our feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.431,
    "end": 1643.011,
    "text": "And then also like, if you want to share the link for people who want to join future cohorts and also just add like other feedback, like what can a voluntary global textbook group be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.193,
    "end": 1647.277,
    "text": "How can we learn and apply active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.198,
    "end": 1650.802,
    "text": "Those are some of our questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.983,
    "end": 1653.345,
    "text": "Errata,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.507,
    "end": 1683.973,
    "text": " are a few little typos and not just like conceptual uncertainties but what appear to be typos in the book and also i'll note that on 17 utc on february 27th thomas parr will be joining for live stream first author of the textbook so in the next month we will like highlight certain questions that we want to surface when thomas joins it'll be like in a zoom just like this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.067,
    "end": 1686.708,
    "text": " Of course it'll be recorded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.923,
    "end": 1699.318,
    "text": " Also, if anybody wants to join, we can talk about this in the coming weeks, but this is really awesome and unique opportunity to ask Thomas directly certain questions that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.739,
    "end": 1700.46,
    "text": "So that should be awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.061,
    "end": 1708.89,
    "text": "Okay, last section, and then we'll go into more open group discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.052,
    "end": 1715.158,
    "text": "This active inference tables section has a few tables",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.594,
    "end": 1737.079,
    "text": " uh that are going to be very useful this is the active inference ontology the active inference ontology is a a central project since the earliest days of active institute and one can see a little bit more about it at this public site but there's also more to it um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.24,
    "end": 1766.188,
    "text": " the ontology at this point consists of definitions and translations for a reduced set of 74 core terms and a slightly broader list of supplemental terms terms that are maybe not vital like as prerequisites for understanding active but they're things that we might mention like when we're learning and this is again the public ontology site so here we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.388,
    "end": 1793.914,
    "text": " natural language definitions for different terms just like a dictionary uses natural language terms to describe other natural language terms that's what we're doing in the active ontology and just like being fluent in a language means that you can recognize and use the language understand what the entities and the terms are the topics and how they're related and why",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.164,
    "end": 1821.792,
    "text": " this is a set of terms where if one is fluent in perceiving and acting upon them one has fluidity in active inference also the ontology has translations so we have translations into um spanish portuguese french italian czech russian hebrew persian chinese japanese um limited in hindi and turkish",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.767,
    "end": 1852.183,
    "text": " if you want to improve one of these ontology language translations or you want to add another language that is like an incredible service because let's think back to that equation 2.5 when we see this blue text these are ontology terms so the natural language definition can pop up and when we want to type something we can do like at generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.724,
    "end": 1881.529,
    "text": " we can then translate into other languages very effectively and have integrity across representations and languages including mathematics and non-mathematics but also different natural languages so the ontology is how we're taking a systems engineering approach to learning and applying active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.712,
    "end": 1887.773,
    "text": " as this incipient ecosystem of learning and application is really truly just beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.124,
    "end": 1892.791,
    "text": " We want it to center accessibility and rigor from the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1893.492,
    "end": 1901.263,
    "text": "And people are going to use the ontology in different ways, but having it as a resource is already been vital.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.303,
    "end": 1917.186,
    "text": "And for those who see this as like a possible way to work, as a way to make improvements to, for example, translations and definitions, it's a big option.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.077,
    "end": 1944.523,
    "text": " and we have a table here so that we can reference it throughout because as you'll see like questions use where possible ontology tags we're talking about minimizing surprise now there still is a lot of complexity around what supply surprise is but like this is a starting point this is like something clickable and interactable that we can always go deeper into um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.056,
    "end": 1973.852,
    "text": " last tables then we'll go into the question section so here's the live streams table um or you can use the link here here are the um uh 200 plus live streams that we've done i'll just highlight like live streams are paper oriented so we've done 53 papers so here you'll find a huge number of relevant papers and if you could look up like eco",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.22,
    "end": 1976.847,
    "text": " Okay, here's some discussions on ecology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.194,
    "end": 1980.838,
    "text": "Livestream are paper oriented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.139,
    "end": 1985.631,
    "text": "Guest streams include a broad range of guests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.337,
    "end": 1988.739,
    "text": " in Act-Inf and adjacent areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.839,
    "end": 1994.224,
    "text": "And always, please feel free to suggest anyone or make an introduction if you want to see something highlighted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.985,
    "end": 2004.374,
    "text": "Model streams focus on models and applications of Active Inference, like for example, the Python implementation of PyMDP, which we'll talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.414,
    "end": 2010.86,
    "text": "And then down on the bottom, you'll see the Parp, Azula, Frist, and Textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.88,
    "end": 2012.802,
    "text": "And here you'll see Cohort 1's videos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.922,
    "end": 2015.905,
    "text": "So if you just feel like watching Cohort 1's videos,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.885,
    "end": 2042.331,
    "text": " then you can see like here's their playlist going through um and here's just all the students with their optional contact information so again just to close the section and then the last 20 minutes we'll have anything we want to ask or discuss um so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.817,
    "end": 2046.742,
    "text": " Overview provides some information on Act-Inf.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.883,
    "end": 2050.626,
    "text": "Textbook group has information on our live meetings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.447,
    "end": 2061.319,
    "text": "Textbook is mainly oriented around focusing discussion on a given chapter and on the contents of the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.339,
    "end": 2065.644,
    "text": "In discourse, we have questions, ideas, and insights, and project ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.546,
    "end": 2069.449,
    "text": "These are some places to make contributions to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.712,
    "end": 2073.836,
    "text": " And then active inference tables just hold some reference tables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.737,
    "end": 2075.438,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.458,
    "end": 2082.728,
    "text": "I'll look at the questions in the chat and then anyone who wants to raise their hand or add something else in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.748,
    "end": 2083.73,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.75,
    "end": 2088.556,
    "text": "If I plan to engage asynchronously and have questions on a chapter ahead of the cohort three schedule, where should I ask them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2089.437,
    "end": 2090.058,
    "text": "Great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.579,
    "end": 2093.563,
    "text": "So you can ask them also in the questions table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2096.328,
    "end": 2097.43,
    "text": " Here's cohort three questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2098.251,
    "end": 2099.132,
    "text": "So they're all here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.813,
    "end": 2103.979,
    "text": "If you have a question on chapter three, four, five, just add it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.822,
    "end": 2107.925,
    "text": "We'll get to it when we will get to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2109.287,
    "end": 2110.149,
    "text": "Hope that addresses it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.169,
    "end": 2114.134,
    "text": "But you're not limited to asking only what we're going to discuss that week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2114.735,
    "end": 2117.88,
    "text": "If you have something on chapter three, just add it right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2120.982,
    "end": 2123.064,
    "text": " Thanks, Everett, for answering it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.084,
    "end": 2126.847,
    "text": "I was concerned the question wouldn't promote discussion until the group made it to that chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2126.907,
    "end": 2140.839,
    "text": "It can if we're not hyper only focusing on only the text of the chapter, but that is the group regime of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.959,
    "end": 2145.723,
    "text": "So it will facilitate discussion when people do get there on their own time or in the group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.564,
    "end": 2150.247,
    "text": "And you say, I plan to implement some of the active principles rather soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.783,
    "end": 2163.576,
    "text": " By being here, we are already all implementing the principles and anywhere that you can make your contribution, like we're all going to be exploring and whittling away at this forest in our own paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.137,
    "end": 2168.721,
    "text": "So just add it and it'll come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.442,
    "end": 2170.183,
    "text": "Hope that addresses it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.543,
    "end": 2171.684,
    "text": "Lucas, and then anyone else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.126,
    "end": 2173.867,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.887,
    "end": 2176.85,
    "text": "I know you mentioned something about listening to the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.11,
    "end": 2179.052,
    "text": "I did take a look at it and it looks like there's a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.403,
    "end": 2188.613,
    "text": " mathematical equations and graphs, like, would you say that in order to have the best experience, it should be a physical copy to read rather than to listen to an audible or something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.636,
    "end": 2191.797,
    "text": "Great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.037,
    "end": 2196.022,
    "text": "Few ways to talk about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.142,
    "end": 2208.516,
    "text": "Like the audio version of the first chapter was very easy introduction in the first chapter, which is what I made because they didn't have equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.167,
    "end": 2234.537,
    "text": " the natural language descriptions of the equations one can imagine will be vital for the audiobook because one can then say okay equation 2.5 and then read the equation like this we don't exactly have that yet and like depending on how deeply one wants to go into the math",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2235.496,
    "end": 2260.913,
    "text": " like the zeroth level is like they just put math here there's some other section here carrying on the next level might be just like okay this is about free energy on some things what are the things well okay you can go one level deeper okay what is that function or what is that functional okay one level deeper so we're all like you can go down the rabbit hole your whole life on two plus two",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.665,
    "end": 2290.545,
    "text": " and on the other side you can dance with equations like this even if you don't have a formal mathematical background we're not generating these equations we're not par or at all we're just understanding what to some extent they put and then we ask questions about like what the role is of these equations and how they're used and everything like that so listening maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.302,
    "end": 2314.491,
    "text": " a good experience but share your your experience if if um you found listening to it to be like useful or found something lacking I'd like to find a way to articulate mathematical equations audibly yeah thank you like that is exactly what this is about and that can't be done in an in even any automated way like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.445,
    "end": 2317.827,
    "text": " And it's not the only way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.847,
    "end": 2322.654,
    "text": "So if someone has another idea about how to audibilize equations, that's also very cool and creative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.315,
    "end": 2334.713,
    "text": "But also for those who feel like they have the capacity to just take a first stab and you can select the text and then just write a comment, I'm not sure, that's all good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.814,
    "end": 2344.748,
    "text": "But it's an example of how one contribution can leverage people in other language communities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.099,
    "end": 2347.207,
    "text": " who are in different stages of learning and applying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.997,
    "end": 2353.489,
    "text": "Anyone else feel free to like raise your hand or just go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.93,
    "end": 2396.335,
    "text": " so while people are typing any questions or thinking if they want to raise their hand um two weeks per chapter each time we have a discussion we'll go to that page and we'll we'll first assess if we have any questions that people like want to discuss and then um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.821,
    "end": 2424.111,
    "text": " often in the first discussion or at the end of the previous of the second discussion of the previous section we'll have kind of just like a look ahead where we look at what the section is um i'll give a quick um overview on the structure of the textbook so this could be seen at chapter notes and questions or it can be seen in the table of contents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.209,
    "end": 2426.973,
    "text": " The book is separated into two parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.034,
    "end": 2432.94,
    "text": "In the next three months, in this cohort three, we're going to be focusing on the first five chapters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.342,
    "end": 2436.765,
    "text": "The first chapter is an overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.865,
    "end": 2444.395,
    "text": "It's non-technical, has a lot of conceptual materials, but there are no equations or formalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.881,
    "end": 2463.345,
    "text": " chapters two and three describe the low road and the high road to active inference it's a framing that we will all come to know and love the low road is kind of like the how in terms of using the mechanics of bayesian statistics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.629,
    "end": 2490.261,
    "text": " and the high road is like the ultimate why this is like the imperative of persistence and the free energy principle and the two roads meet in the middle with active inference which is using bayesian statistics to model and implement that persistence imperative from the free energy principle all roads lead to active that's chapters two and three",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.916,
    "end": 2505.499,
    "text": " Chapter 4, having described the two roads to active inference, is the heart of active inference, which is about modeling, and it's about this specific type of model called a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.306,
    "end": 2522.965,
    "text": " generative model is like the heart or the kernel of active inference and we'll get there chapter five then turns to one of the areas where active inference has been most characterized and studied which is in mammalian neurobiology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.333,
    "end": 2548.902,
    "text": " and chapter five goes through a few neural systems of mammals and talks about active inference modeling in those settings and then provides a table that has citations to many other places that active inference has been applied so that's the conceptual half of the book is overview what's the big picture what's the positioning what are we talking about with act inf",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.232,
    "end": 2551.914,
    "text": " What are the two roads to get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.415,
    "end": 2554.997,
    "text": "Or what two roads meet in ACT-INF?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.539,
    "end": 2560.123,
    "text": "What is the heart of ACT-INF in terms of generative modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.824,
    "end": 2566.951,
    "text": "And then what is one of the most critical areas that ACT-INF has been applied, which is mammalian neurobiology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2568.012,
    "end": 2578.905,
    "text": "The second half, which is gonna be starting in a few months for this cohort, or people can show up one hour earlier and check in with cohort two, who's working on the second half now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.83,
    "end": 2586.998,
    "text": " The second half starts with a informal recipe for designing active inference models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.659,
    "end": 2592.925,
    "text": "Kind of like a step-by-step, but it's like a process or a recipe for this kind of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.167,
    "end": 2596.349,
    "text": "So like, we're going to be like, where's the modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.369,
    "end": 2596.89,
    "text": "Where's the modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.91,
    "end": 2600.294,
    "text": "It's like, it's coming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.314,
    "end": 2601.916,
    "text": "And it's now for people who want to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.297,
    "end": 2608.183,
    "text": "Then chapter seven and eight describe a few different important subtypes of generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.362,
    "end": 2619.954,
    "text": " Chapter nine describes using data in generative modeling and chapter 10 is kind of like the opposite of chapter one or the other end of the bookshelf.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.094,
    "end": 2623.077,
    "text": "It's like summarizing and giving an overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.318,
    "end": 2637.833,
    "text": "There are some appendices that may be of value to you, but you may dive into those as they're referenced in the text or no worries if not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.753,
    "end": 2646.119,
    "text": " So that's kind of the broad picture and the pacing that we're going to go through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.846,
    "end": 2654.248,
    "text": "Kate, thanks for the awesome question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.268,
    "end": 2662.836,
    "text": "Yes, if anyone has Python resources, putting them into code or resources could be awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.417,
    "end": 2667.381,
    "text": "Here's a bunch of implementations that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.445,
    "end": 2688.711,
    "text": " and in the recent um pyMDP stream i'll put this link in the chat this in the video description here's a google colab notebook that doesn't need any tuning you can just run this in your browser",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.248,
    "end": 2692.432,
    "text": " And it is doing active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.672,
    "end": 2702.925,
    "text": "So if you want help with understanding the Python basics and the syntax of Python, I'm sure many people can share resources about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.465,
    "end": 2711.255,
    "text": "But this notebook is awesome for actually working through it and playing with different parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2712.456,
    "end": 2718.664,
    "text": "And in the first half of the textbook, we're building a lot of the conceptual and formal understanding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.779,
    "end": 2743.167,
    "text": " so that when we're in the programming we'll understand what these matrices are and there isn't just one path maybe somebody wants to just work through this and then come to the formalisms later or work on the philosophy and then come to the math it's like there's just a million paths so as long as we're in the game and active we're making it happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.694,
    "end": 2757.622,
    "text": " Okay, any other thoughts or questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.39,
    "end": 2770.374,
    "text": "Okay, just again, raise your hand or put it in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.914,
    "end": 2772.856,
    "text": "Let's just do a little tiny look ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.378,
    "end": 2776.78,
    "text": "Next two weeks, we're going to be discussing chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.541,
    "end": 2778.722,
    "text": "The preface says,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.107,
    "end": 2780.909,
    "text": " is written by Carl Friston.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.87,
    "end": 2791.503,
    "text": "It's just two pages long, and it includes this absolutely endearing confession that Carl was not allowed to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.663,
    "end": 2795.087,
    "text": "It was not an affordance for Carl to write this textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.55,
    "end": 2802.897,
    "text": "Those who know may be familiar that his writing style is very erudite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2803.658,
    "end": 2807.022,
    "text": "And so the book...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.339,
    "end": 2821.534,
    "text": " was not the desired style so that's just very nice by carl um but the preface doesn't really um have any big um pieces chapter one is the overview",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2822.138,
    "end": 2841.092,
    "text": " um yes thanks for those like all different time zones coming through um hopefully like the office hours at the different time the recordings and of course like if you want to suggest another time that you could commit to it may be possible to also add that um but also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.81,
    "end": 2868.683,
    "text": " synchronous activities are totally optional and one's own reading or listening contributions are primarily on their own time chapter one is an overview it's introducing the main questions that active inference is going to seek to address that is the target that they are painting for this textbook is active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.051,
    "end": 2895.362,
    "text": " as a unified principle for mind brain and behavior um and how can organisms persist amidst environmental exchange that question is the heart of section 1.2 and we see a really simplified version of an action perception loop that we're going to be focusing on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.367,
    "end": 2924.286,
    "text": " agent world generative model agent generative process world niche doesn't only apply to mammals and continents it turns out that this formalization of perception cognition action and impact is going to be immensely transferable and composable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2927.675,
    "end": 2955.066,
    "text": " active inference is sometimes described as a first principles perspective and it'll be awesome to hear more discussions on like what people think that means but one way to think about it is like this is kind of a first principles approach in terms of a how with base statistics and this is like a first principles why in terms of persistence as an imperative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.623,
    "end": 2986.858,
    "text": " there's the introduction of two attitudes towards science neats and scruffies neats are seeking unification scruffies embrace heterogeneity and so do we want to have a unique biological model let's have a journal for every synapse let's have a a different university for every single follicle like at some point we have um composition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.024,
    "end": 3012.171,
    "text": " and harmonization not homogenization of the diversity of biology and so that neat scruffy dialectic guides a lot of these discussions about particulars and generals the structure of the book there's two parts to the book these are aimed at readers who want to understand active inference first part that's us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.758,
    "end": 3015.426,
    "text": " and those who seek to use it for their own research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.607,
    "end": 3017.733,
    "text": "Second part, also that is us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.458,
    "end": 3020.261,
    "text": "We will get through both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.926,
    "end": 3025.637,
    "text": "The first part is gonna introduce it conceptually and formally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.41,
    "end": 3029.854,
    "text": " It's going to refer to some other alternate theories of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3030.836,
    "end": 3045.614,
    "text": "And so just to plant the seed, when people are asking questions or even skepticisms or critiques of active inference, you can ask yourself or them, is this like a critique of modeling in general?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3046.295,
    "end": 3050.501,
    "text": "Like would any usage of any model fall victim to that criticism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.502,
    "end": 3052.764,
    "text": "Which doesn't mean it's not valid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.784,
    "end": 3056.248,
    "text": "It just means that it's like an immensely far ranging critique.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.701,
    "end": 3081.46,
    "text": " or is there a unique critique that is being made of what we're actually learning here and it's not always immediately clear the goal of the first part is to provide a comprehensive formal and self-contained introduction to active inference its main constructs and implications for the study of brain and cognition well we'll see if it is comprehensive formal and self-contained",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.317,
    "end": 3098.79,
    "text": " and where we have questions we can ask where we want to add we can add it's just the first version of the first textbook that's been in the niche for eight months and we can be part of that feedback loop and make it happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.749,
    "end": 3124.744,
    "text": " part one active inference in theory that's the first five chapters this is going to give some overviews on like key terms that are going to come into play why are we talking about surprise why are we talking about adaptive control why are we talking about the action perception Loop here's that figure the two roads to active inference High Road starting on the top right free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3127.137,
    "end": 3128.8,
    "text": " Low road, starting on the bottom left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.201,
    "end": 3129.722,
    "text": "Bayes' theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.928,
    "end": 3136.455,
    "text": "Description of the high road and low road, which are going to be chapters 2 and 3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.337,
    "end": 3138.178,
    "text": "Chapters 2 and 3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3139.301,
    "end": 3139.762,
    "text": "Chapter 2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3140.182,
    "end": 3140.623,
    "text": "Low road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.224,
    "end": 3141.745,
    "text": "Chapter 3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.266,
    "end": 3142.647,
    "text": "High road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.352,
    "end": 3145.813,
    "text": "Chapter 4.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.833,
    "end": 3146.715,
    "text": "High road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.78,
    "end": 3167.657,
    "text": " active inference formally that's where we're going to get to the generative model what is the generative model what is generative modeling that is the heart of active inference like the linear model is at the heart of linear modeling and the generative model is going to be at the heart of active inference modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.747,
    "end": 3198.707,
    "text": " and then chapter five is going to move from the generative model in the abstract to a setting where generative models have been applied at this point the most densely in literature which is mammalian neuroscience here are some of the key differences between active and alternate frameworks the unity of perception and action in terms of a shared imperative to minimize free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.594,
    "end": 3230.449,
    "text": " the accommodation of planning and policy selection censoring sensory data diverse cognitive operations attention memory anticipation conceptualized as inference over generative models consistent with the bayesian brain hypothesis perception and learning as active processes action as goal oriented",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3231.357,
    "end": 3258.04,
    "text": " which has many deep roots in cybernetics and the biological plausibility of different constructs part two active inference in practice check out that but we're not going to focus on it immediately and 1.5 this chapter is just summarizing the first half of this book and the second half",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.239,
    "end": 3284.517,
    "text": " previewing the perspective that will be unpacked the books divided into two parts understand and use they hope it will persuade readers that active inference offers not only a unifying principle under which to understand behavior but also a tractable approach to studying action and perception in autonomous systems so it's about 14 pages long",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.893,
    "end": 3314.638,
    "text": " we have two weeks to discuss it so we'll be able to surface many reflections and sensitivities that people are having to chapter one that concludes our first meeting um following this meeting the recording will be posted in like as a unlisted YouTube video here and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3315.715,
    "end": 3340.035,
    "text": " actually immediately following this meeting over in the discord which i'll copy the link in we're just gonna hang out and just have education open hours so it's gonna it's kind of convenient if you want to continue just the discussion on the textbook or learning or education so thank you all for joining",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.775,
    "end": 3345.704,
    "text": " I will close the recording and looking forward to seeing you next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.918,
    "end": 3348.26,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3348.541,
    "end": 3349.165,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]