[
  {
    "start": 11.681,
    "end": 35.654,
    "text": " hello everyone this is the active inference live stream i'm daniel friedman today it is december 30th 2020 it is active live active inference live stream 12.0 and this is uh hopefully going to be a recap on 2020 and a look to 2021 it is a doubly auspicious episode number because the digits of 012.0",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.055,
    "end": 64.831,
    "text": " rearranged to 2021 and also the clock is striking midnight so there's no paper 12. we'll start with paper 13 next year welcome to the active inference lab everyone we are an experiment in online team communication learning and practice related to active inference you can find us at our website twitter email youtube or keybase team and username",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.967,
    "end": 71.83,
    "text": " This is a recorded and an archived live stream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.07,
    "end": 76.112,
    "text": "You can say something in the live chat or you can leave a comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.794,
    "end": 81.195,
    "text": "All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.875,
    "end": 89.9,
    "text": "And as far as video etiquette for live streams, mute if there's noise in the background, raise your hand so we can hear it from everyone, and we'll use respectful speech behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.868,
    "end": 96.614,
    "text": " Today in Active Inference Livestream 12.0, the goal is really to close out 2020 and look to 2021 for all that that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.147,
    "end": 106.23,
    "text": " Of course, just like all the dot zeros, it's a context and an introduction to some ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.33,
    "end": 108.19,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.091,
    "end": 114.053,
    "text": "The punchline is that 2020 hindsight, looking back on it, is 2020 foresight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.594,
    "end": 115.554,
    "text": "And that's all we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.854,
    "end": 121.757,
    "text": "So let's figure out how to make the best of our 2020 hindsight so that we can have 2020 foresight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.238,
    "end": 125.419,
    "text": "Here are the sections of today's video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.616,
    "end": 137.664,
    "text": " First, we're going to talk about what the Active Inference Lab is becoming in terms of what did happen for each of the three projects in 2020 and what will happen for each of the three projects in 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.656,
    "end": 163.633,
    "text": " Then we'll go through each of the active inference live streams, a single slide per number, one through 11, and just recap one figure from each of the papers, because it's a good way to just look at all the different topics we've heard about and remember how many interesting perspectives and especially beginner's perspectives we heard along the way, because we're all learning here and we all learned so much this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.892,
    "end": 170.793,
    "text": " Then I'll raise up a few great points of feedback that were raised by the community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.394,
    "end": 175.054,
    "text": "And we always welcome people to leave comments and suggestions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.315,
    "end": 178.115,
    "text": "And if they want to be anonymous, they can let that be known.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.795,
    "end": 185.137,
    "text": "Or otherwise, we're just really looking to rise up what people are saying and wanting to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.497,
    "end": 187.677,
    "text": "And then let's just figure out how we can make those things happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.778,
    "end": 189.658,
    "text": "And they're both really good suggestions we'll talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.779,
    "end": 197.748,
    "text": " Then there'll be more just sort of a grab bag at the end with some perspectives on 2020 and 21 moving forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.469,
    "end": 202.635,
    "text": "So in the upcoming year, there will be a lot to expect and work on together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.716,
    "end": 207.101,
    "text": "Be sure to get in touch if you want to participate or get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.177,
    "end": 221.91,
    "text": " So for today's roadmap, instead of the sections of a paper, because there are no sections for this paper, we're going to be inferring back on 2020 and we're going to be actively moving into 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 222.33,
    "end": 227.235,
    "text": "So whenever you're listening to this, certainly it's either at the same time or later than me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.776,
    "end": 232.34,
    "text": "And that means that you're in 2021 or later or about to be rolling into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.76,
    "end": 236.822,
    "text": " So how can we look to the past, the present, and the future?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.302,
    "end": 240.224,
    "text": "How can we understand where we've been to understand where we're going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.944,
    "end": 250.009,
    "text": "In this example with the background picture of the rearview mirror of a car, it's like you're driving the car forward, but you need to know what's behind you, you need to know what's around you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.389,
    "end": 252.77,
    "text": "So all of these things are important, spatially, temporally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.711,
    "end": 257.093,
    "text": "Starting with the part about the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.531,
    "end": 278.204,
    "text": " This was really something awesome that emerged during 2020 with the special help and collaboration and really was a true colony effort by Alex, Yvonne, Sasha, RJ, and just several other people who really made it happen this year with Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.284,
    "end": 279.685,
    "text": "So big appreciation to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.386,
    "end": 287.05,
    "text": "And with the more people we've had participating and increased focus on formal structures,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.652,
    "end": 293.38,
    "text": " values of transparency, accessibility, inclusion, et cetera, we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.356,
    "end": 296.777,
    "text": " resulted in the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.797,
    "end": 305.56,
    "text": "So not something that any of us thought we would be involved in at the beginning of 2020, but again, a year that changed so many things for so many people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.221,
    "end": 318.886,
    "text": "So if you go to activeinference.org, you'll see this page, which contains information on the bottom about how to contact our group through our shared Markov blanket of these identities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.287,
    "end": 322.368,
    "text": "And so these are gonna be always like organizationally held",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.532,
    "end": 325.574,
    "text": " identities online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.394,
    "end": 330.719,
    "text": "Then you'll also see, at least for the time being, this call for collaboration for 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.64,
    "end": 341.17,
    "text": "So that's a form that we put out an open call for collaboration in three areas that we're about to be talking about, which are in the domains of education, communication, and tooling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.653,
    "end": 362.672,
    "text": " so far on that call we've had a good number of rsvps so we're really happy that people are excited about it and we're open to not just participation but input on how to organize and make it in line with how we want to see a decentralized research community be and how to how to how to have a good active inference community",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.42,
    "end": 373.63,
    "text": " So the three areas of project that we're going to recap 2020 on and then look to 2021 on are education, communication, and tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.051,
    "end": 382.44,
    "text": "And this is just from the copy screenshot of the letter that is the URL on the right side, which is the one that's on the website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.52,
    "end": 384.202,
    "text": "So that's where to see this information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 385.097,
    "end": 401.952,
    "text": " Okay, the first project is education, and it was said as, our cornerstone project for 2021 is a community developed open source active inference book of knowledge, or an AIBOK, and educational courses as a result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.473,
    "end": 407.217,
    "text": "This project will entail ontological, so ontologies related to structuring knowledge,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.657,
    "end": 427.701,
    "text": " methodological that's processes and ways of learning and doing research and methods for various areas and pedagogical related teaching research and development let's go a little bit into that because i actually did not know about the book of knowledge approach before i met alex and ivan and their systems engineering perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.38,
    "end": 440.666,
    "text": " This is a graphic that Alex provided of the Systems Engineering Book of Knowledge, or CBOK, and the scope of this area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.566,
    "end": 449.831,
    "text": "And suffice to say that the systems engineering people have a really unique approach that fuses the multi-scale approach,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.331,
    "end": 459.016,
    "text": " that helps us deal with complex systems with an engineering focus on defining interfaces and standards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.496,
    "end": 469.201,
    "text": "And they took a very standards-driven yet flexible approach, as far as I can tell, though I'm less familiar than they are, in structuring their educational material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.702,
    "end": 475.165,
    "text": "And so we can see kind of around the edge, we have various things that are peripheral",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.005,
    "end": 479.289,
    "text": " skills, I believe, related to the core competencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.79,
    "end": 482.513,
    "text": "So for example, on the left side, people, competency, knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.873,
    "end": 483.454,
    "text": "So that's critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.894,
    "end": 492.624,
    "text": "And even though you're going to be in this area training somebody in systems engineering, it's also critical that they have people competency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.845,
    "end": 495.107,
    "text": "So not just social workers need that skill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.267,
    "end": 496.248,
    "text": "Everyone needs these skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.889,
    "end": 500.351,
    "text": " operational environment knowledge on the right side, that could almost pertain to anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.771,
    "end": 505.073,
    "text": "And then in the middle, there's these core domains of the curriculum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.653,
    "end": 509.755,
    "text": "And this curriculum facilitates easy onboarding, easy referencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.255,
    "end": 517.779,
    "text": "People can point to a specific document, a specific web link, and just say, in this section, this was what the way it was said was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.539,
    "end": 523.302,
    "text": "And that includes the foundations, the introduction foundations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.142,
    "end": 530.387,
    "text": " the applications, management, enabling factors, related disciplines, and implementations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.867,
    "end": 533.109,
    "text": "So perhaps you can see where we're going with Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.07,
    "end": 537.172,
    "text": "Here is SEPOK in their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.232,
    "end": 542.256,
    "text": "And this is the part that I think is built out to an extent that's broader than merely just a curriculum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.316,
    "end": 547.821,
    "text": "So the previous slide, this one, contains information about the way that they structured their curriculum as far as I see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.861,
    "end": 550.403,
    "text": "But I have not taken these courses in the way that Alex and Yvonne have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.806,
    "end": 560.229,
    "text": " Where it gets really interesting and unique as far as a transferable structure is this SEBOK in the environment plot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.049,
    "end": 565.191,
    "text": "So here we have the community, which includes multiple types of stakeholders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.391,
    "end": 570.033,
    "text": "It includes academics as well as non-academics, just like many other research communities do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.246,
    "end": 573.487,
    "text": " Within the community, there are professional societies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.048,
    "end": 588.637,
    "text": "Professional societies have structured relationships using ontologies with specific types of other things, such as certification programs, competency models, workforce development initiatives, so getting people involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.917,
    "end": 594.321,
    "text": "We could also imagine a participation or a just public outreach or public communication initiative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.341,
    "end": 600.285,
    "text": "So there's all kinds of initiatives that can be related with an organizational ontology to our community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.925,
    "end": 603.447,
    "text": " And then we can also think about even products.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.547,
    "end": 609.753,
    "text": "Maybe there's an open source robotics or an open source simulation framework that our groups develop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.113,
    "end": 613.156,
    "text": "So we're going to have formal relationships within the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.197,
    "end": 622.404,
    "text": "The S-E-B-O-K is part of a developed ecosystem, not just of a curriculum that they're offering, but also certifications and professional societies, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.141,
    "end": 629.923,
    "text": " Good active inference have a community that is participatory, so focused on people being active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.624,
    "end": 637.907,
    "text": "It's also professional, even though we recognize there's people from wide variety of career stages, we want to keep it professional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.387,
    "end": 647.011,
    "text": "We want to be transdisciplinary, which means diving into the specifics where we need them, but not worrying about what the delineation is between disciplines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.169,
    "end": 659.676,
    "text": " and also have an aspect of modern organization like this clearly has, as well as recognizing the global and cross-sector practices that are going to come to intersect in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.316,
    "end": 667.321,
    "text": "Already, it's seen as a meeting of two different perspectives when subfields of one area come to meet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.061,
    "end": 692.852,
    "text": " and in this domain we're talking about philosophy and we're talking about mathematics and so sometimes there's uh some fundamental issues that rise up so how do we deal with these truly fundamental issues that we often bump into as individuals or groups well we all we also can uh get around those or at least structure around them to structure space to hold those debates within within a more built-out ecosystem like this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.737,
    "end": 698.558,
    "text": " And that can make us have healthy norms and visions for our community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.459,
    "end": 703.04,
    "text": "So of course, join us to help because it has to be enacted, it has to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.62,
    "end": 705.42,
    "text": "So join if you're interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.3,
    "end": 716.123,
    "text": "Second project, we will continue the weekly Active Inference livestream, this being an example of, as an accessible and participatory space for learning about Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.803,
    "end": 722.065,
    "text": "We are also developing new formats here, such as seminar, presentation, dialogue, working group, and short video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.294,
    "end": 725.815,
    "text": " So here's the communications project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.296,
    "end": 734.34,
    "text": "So in 2020, we had on our YouTube channel, we had 27 or so participatory live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.86,
    "end": 737.462,
    "text": "There were dozens of really great participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.982,
    "end": 739.623,
    "text": "So that was very special.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.051,
    "end": 749.695,
    "text": " Over the course of the year, we made many improvements in the technicalities of the project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.135,
    "end": 759.94,
    "text": "So early in the project at the very beginning, we were just using Jitsi and then live streaming directly from Jitsi, which is a variable strength connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.321,
    "end": 763.182,
    "text": "And now I'm utilizing OBS software.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.282,
    "end": 768.605,
    "text": "So figured out what kind of parameters work there and hopefully that's resulted in a better experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.185,
    "end": 777.874,
    "text": " But beyond the technical purely part, there's also been an emerging practice for how can we engage in accessible live streams and we don't have the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.575,
    "end": 784.421,
    "text": "And we think that there's so much more space to improve on and want to hear people's feedback for but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.002,
    "end": 806.344,
    "text": " we develop things like checklists for participants so that they can run through and understand uh hopefully how to be prepared for being on a live stream and that's facilitated hopefully some discussions that otherwise couldn't have happened without that type of gentle norming and at this link you can learn more about our 2021 plants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.587,
    "end": 816.036,
    "text": " So for 2021, for the Active Inference live stream, we're going to be doing it every single Tuesday from 7 to 9 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.657,
    "end": 820.522,
    "text": "Pacific time, whatever it is, PST for now, but that will change, so Pacific time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.582,
    "end": 846.375,
    "text": " and for the uh or maybe we'll see about that i guess we'll think about it uh for the schedule and participation instructions just go to this link and of course just let us know if you want to participate in any way in 2021 through this means or any other or if you want to have a special event or something that we could do on this stream channel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.415,
    "end": 863.335,
    "text": " if you go to that link on the left side you'll see this spreadsheet here's the current state of it up till the middle of april where we have the authors of the papers will all be on at least once and on the top are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.136,
    "end": 876.968,
    "text": " the steps you need to take if you want to participate, as well as on the top right, two awesome resources by Jared and Baron that are like hubs or repositories of information about Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.988,
    "end": 881.632,
    "text": "So if anyone has suggestions, they can also suggest something that should go up there on the top right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.033,
    "end": 887.417,
    "text": "So we want this to be a good landing page for people to just go to this short link,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.058,
    "end": 891.245,
    "text": " comes to this spreadsheet, here's the curriculum, here's the year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.305,
    "end": 894.692,
    "text": "If you want three months out, you want to read a paper that's interesting, let us know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.092,
    "end": 898.54,
    "text": "If you want to suggest a paper, we can also do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.831,
    "end": 909.333,
    "text": " Here's the last area of the Active Inference Lab for 2021 and 2020, is the third project, which is tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.094,
    "end": 922.357,
    "text": "So this says, following our work on active inference in online teams, we will continue development on tooling such as knowledge management systems, collaborative research models, simulation of digital workspaces, and onboarding tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.571,
    "end": 930.177,
    "text": " Here's a figure from the paper that Team Calm co-authored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.058,
    "end": 934.903,
    "text": "So Alex, Yvonne, Sasha, RJ, and myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.683,
    "end": 940.969,
    "text": "And this figure is showing the online team in sort of a flow chart,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.75,
    "end": 965.449,
    "text": " layout that's reflecting the specific kinds of actions that connect specific kinds of actors and it's basically uncontentious that the team members are communicating with a certain database or with various databases and through these internet backbone intermediaries they're communicating or having specific types of defined communication and that can also communicate to external databases",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.443,
    "end": 987.402,
    "text": " And our question that was guiding us was, could we think about those computational actions as basically going through a Markov blanket slash influencing things across Markov blankets, however we want to think about that, passing through shared niches of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.442,
    "end": 993.227,
    "text": "There's a lot of ways that the Active Inference Framework to us made us wonder about the online context specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.146,
    "end": 1005.669,
    "text": " And this paper, which explored a few other ideas about the kinds of technologies that would enable active inference for online teams instead of just the kinds of tools that we have now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.45,
    "end": 1012.552,
    "text": "Also, this was just one of the other figures that showed the shared world, our informational niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.572,
    "end": 1014.913,
    "text": "That's like the chat room that both people are in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.293,
    "end": 1016.273,
    "text": "That's their shared niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.453,
    "end": 1019.014,
    "text": "And then they can send and receive from that chat room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.474,
    "end": 1021.816,
    "text": " and that plays into their model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.136,
    "end": 1029.822,
    "text": "It updates their priors on some aspects of their generative model that leads to policy changes, which reflected in changes in action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.544,
    "end": 1039.751,
    "text": "Here's where we want to go from that paper in September to something that could be more of a minimum viable usable for 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.791,
    "end": 1043.894,
    "text": "As we head there and as we build this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.988,
    "end": 1055.75,
    "text": " tooling out, we want to first and foremost, keep the individual in mind, the human as the user.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.73,
    "end": 1061.712,
    "text": "And we currently have a bunch of people who've RSVP'd to work on this project three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.212,
    "end": 1064.552,
    "text": "So I don't have any of the details on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.593,
    "end": 1066.153,
    "text": "We're going to basically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.633,
    "end": 1086.054,
    "text": " co-create that during january and beyond but here's just some of the questions and then other scales of analysis that we can build upon hopefully so they're more just like open-ended uh things that maybe the team three will be keeping in mind and i hope that we also add to this list of questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.84,
    "end": 1092.184,
    "text": " So one question is about how digital user interfaces can shape and design regimes of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.685,
    "end": 1101.311,
    "text": "So we talked about cultural regimes of attention, individual regimes of attention from the oculomotor to the rumination, the strange attractors of thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.172,
    "end": 1110.438,
    "text": "And are we going to have the basins of our attraction drawn to the newsfeed or are the basins of our attraction going to be drawn towards deep work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.939,
    "end": 1111.78,
    "text": "That's a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.18,
    "end": 1116.003,
    "text": "And are we going to design the niche to facilitate individuals to choose?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.683,
    "end": 1123.467,
    "text": " How can tools be useful and intuitive for all kinds of people and purposes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.088,
    "end": 1130.712,
    "text": "And that's really important because people use the internet in so many different ways and there's so many kinds of people using the internet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.073,
    "end": 1137.458,
    "text": "So especially if we want to be developing powerful tools, we want to make sure that they're meeting people where they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.72,
    "end": 1145.144,
    "text": " Another level of analysis to start broadening beyond the individual person is at the relationship and the team level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.624,
    "end": 1167.877,
    "text": "So there's a lot of questions about how could online teams and projects be innovative, productive, and resilient in ways that were defined potentially within the active inference framework, for example, controlled novelty search, or the ability to discover innovative solutions on rough landscapes or on landscapes with very infrequent rewards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.918,
    "end": 1183.569,
    "text": " Another question is about even just given the current software operating environment today, how could active inference on the backend using just purely analytical frameworks lead to useful, tractable, and meaningful analytics for teams?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.249,
    "end": 1193.937,
    "text": "For example, have an underlying generative model of teammate states instead of just doing descriptive statistics and saying, here's the distribution of how many messages these people sent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.457,
    "end": 1207.205,
    "text": " You could use some other type of latent state modeling to think about those emissions from those peoples as actors and as agents, whatever you want to draw the Markov blanket around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.305,
    "end": 1213.529,
    "text": "You could even do that for individuals for which you don't see all of their emitted states for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.21,
    "end": 1216.611,
    "text": "And that could be helpful in the team context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.792,
    "end": 1222.695,
    "text": "And then the last level would be at the communities and the ecosystems of communities of practice level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.628,
    "end": 1229.154,
    "text": " A big question is how can online communities be welcoming, accessible, inclusive and trusting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.354,
    "end": 1240.248,
    "text": "We want to have high trust online settings and hopefully have the hard like cryptographic and soft like people interfaces that allow that to thrive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.249,
    "end": 1263.768,
    "text": " And how can we have healthy norms for facilitation, mental health, communication in our active inference community, but also in other communities and share the emerging practices that work across communities while also understanding that just like different things are going to work for different people, different norms are going to work for different communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.868,
    "end": 1269.533,
    "text": "So it's not that one approach has to catch on with anyone except for the people who like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.11,
    "end": 1280.356,
    "text": " And always coming back to the question of how Active Inference might be able to inform the way that we design these multi-scale digital ecosystems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.337,
    "end": 1283.378,
    "text": "Okay, so those were the three projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.099,
    "end": 1287.461,
    "text": "And if they sound interesting, you should sign up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.101,
    "end": 1293.565,
    "text": "And if it's past 2021, then check back and there'll be another form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.485,
    "end": 1296.507,
    "text": "Now we're going to go one figure per year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.367,
    "end": 1318.858,
    "text": " one through 11 of the Active Inference live streams, kind of just to recap where we've been, to remember the kinds of debates that we raised, the tensions and the integrations that occurred throughout this year, just to juxtapose it, get some of our latent connections reactivated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.718,
    "end": 1344.757,
    "text": " first active inference live stream paper was narrative as active inference the an integrative account of the functions of narratives and this stemmed really from our initial curiosity as a group about how narratives might be understood from an active inference context because we all understood less than about the formalisms underlying it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.018,
    "end": 1349.842,
    "text": " to wherever we were at, we were at an earlier point in our understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.983,
    "end": 1360.611,
    "text": "And the part that was drawing us in as a team was about teams and narratives and about how narratives for teams relate to how they commute, communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.752,
    "end": 1362.733,
    "text": "So cause and effect with a narrative in the team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.574,
    "end": 1369.139,
    "text": "And the figure that captured it for us was that in the online case,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.04,
    "end": 1374.222,
    "text": " The epistemic resources and salience cues are formally defined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.542,
    "end": 1380.124,
    "text": "So if you're talking about two people who have an edge via a text messaging thread, it's formally defined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.164,
    "end": 1382.585,
    "text": "You know 100% of when each message was sent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.705,
    "end": 1384.725,
    "text": "Maybe you can read every message if you're one of the two people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.166,
    "end": 1385.826,
    "text": "Hopefully no one else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.182,
    "end": 1395.027,
    "text": " Or if you're someone else, maybe you can even at least see the patterns of their communication, the timing of them or the timing and the length or some other attribute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.627,
    "end": 1402.952,
    "text": "But the point is that in a digital system, it's formally defined so that you can completely capture, it's like a formal state machine in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.852,
    "end": 1410.897,
    "text": " In real world settings, it's very difficult to capture the nuances of the situation in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.197,
    "end": 1415.14,
    "text": "That doesn't mean you can't classify behavior with a 99% or 100% accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.721,
    "end": 1424.967,
    "text": "It just means that there's still aspects of the system that are just empirically reduced in dimensionality because you're making measurements on a real world system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.307,
    "end": 1427.809,
    "text": "Whereas the internet system, it's like it's its own digital twin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.909,
    "end": 1429.29,
    "text": "It's already the digital thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.61,
    "end": 1431.212,
    "text": "So it's way easier to formally model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.912,
    "end": 1442.089,
    "text": " And what interested us was just the way that individuals who could have shared or divergent narratives, who even knows how to calculate that, how do you calculate narratives and measure them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.177,
    "end": 1462.876,
    "text": " they would be involved in a sense action active inference loop as would their colleagues and teammates and then their teammates that could be anonymous commenters in a forum or a comment thread it could be your professional colleague who is on a active inference lab project with you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.053,
    "end": 1467.375,
    "text": " And these shared resources, how could those be in cause and effect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.556,
    "end": 1482.226,
    "text": "And how could this interface be designed so that it shapes the kinds of regimes of attention and deliverables under the right timeline, under the right budget, in line with values, helping everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.426,
    "end": 1489.391,
    "text": "These are the kinds of things that could be designed through the regimes of attention, which are none other than the focus of the team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.011,
    "end": 1502.869,
    "text": " The second paper was, is the free energy principle a formal theory of semantics, meaning from variational density dynamics to neural and phenotypic representations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.891,
    "end": 1517.686,
    "text": " Here, Maxwell really helped us understand, as always, some of the finer points, philosophy intersecting with math of this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.547,
    "end": 1522.331,
    "text": "And this is a summary figure from the end, part one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.232,
    "end": 1540.487,
    "text": " and it relates to the connections between different ideas that come into play or fall under the umbrella or scope of free energy principle slash active inference broadly and the key node is on the left side this computational dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.207,
    "end": 1563.695,
    "text": " so it's not quite computationalism like everything is a computer uh it doesn't have to have that kind of a computationalist overtone it's just a realist or pragmatic understanding that we are going to use computers to model the dynamics which are the changes through time of these things we could also have like an experiential dynamics a psychodynamics to be sure but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.376,
    "end": 1595.096,
    "text": " any kind of computational model is computational dynamics so this is like saying we're going to be able to phrase it with math and computer programs so not too much of a pill to swallow there but it uh starts getting interesting with uh the integrations of some classical and non-classical attributes of computation so starting on the top mathematical functionalities are implicit in computational dynamics computers are based upon equations equations and computers are deeply related",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.737,
    "end": 1614.039,
    "text": " And the way that that bears upon the specific framework that they're talking about here, which is the variational density dynamics, is that there's a mathematical function which describes the free energy functional, that's a function, relative to a generative model of a few different things, things that we're going to be describing soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.336,
    "end": 1618.478,
    "text": " The second node on the middle is the specific algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.759,
    "end": 1622.061,
    "text": "Again, shouldn't be surprising, algorithms are computational in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.381,
    "end": 1631.988,
    "text": "The way that that gets implemented in active inference is via this gradient descent on the variational free energy function, functional, and then that goes back to the mathematical function in the first node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.649,
    "end": 1637.552,
    "text": "Okay, now the middle node in the middle, representational structure, ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.013,
    "end": 1640.394,
    "text": "That's the structure of how things are in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.297,
    "end": 1646.061,
    "text": " So then that plays out in active inference with this idea of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.762,
    "end": 1652.626,
    "text": "So let's just say that my internal state is the estimate of whether it's sunny or not sunny outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.167,
    "end": 1655.389,
    "text": "So there's many ways that the sky can be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.429,
    "end": 1661.574,
    "text": "There's many shades of moonlight and sunlight, and it could have many, many degrees of statistical measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.054,
    "end": 1668.78,
    "text": "But the internal state for me, as somebody who cares only about whether it's sunny or not, is a two-state categorical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.5,
    "end": 1687.521,
    "text": " so organisms embody the statistical regularities of their niche but they don't need to have every single degree of freedom the whole point is that they are a coarse graining or a dimensionality reduction of that niche otherwise they would be this one to one that's the map that covers itself so the internal states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.539,
    "end": 1690.221,
    "text": " are a representational structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.502,
    "end": 1703.177,
    "text": "We're gonna get into representationalism in a later paper, but they are a representational structure at the very least in the statistician or in the investigator's analysis of the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.078,
    "end": 1706.321,
    "text": "Okay, fourth note, computational processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.648,
    "end": 1736.689,
    "text": " seems that that's under the computational dynamics and that's where active inference comes into play which is the computation of this active inference uh loop as sort of a structural computation that's played out on bayesian nets or message passing or other kinds of graphs these forny factor graphs things that would be great to have uh colleagues who know more mathematics come onto the stream let's have a special",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.429,
    "end": 1761.472,
    "text": " presentation or discussion on some of those mathematical or computational formalisms the final one and this is where i think an entry point lies for many is this ecological component now that's formalized on the bottom right under this model as the dual information geometry which is this interface that's defined by the organism at its boundary is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.193,
    "end": 1789.841,
    "text": " some type of blankets some type of isolation there's various ways i think we can think about it and it's clear that the markov blanket concept people are discussing and generalizing and critiquing every day so let's figure that out another day i say suffice to think that for some systems especially locally it's the interface that defines uh the inner interactions between these two sides",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.481,
    "end": 1811.735,
    "text": " so formally that's reflected as dual information geometry but qualitatively that's where the inactivism and so many other parts of the relational part of active inference come into play in paper three a world unto itself human communication is active inference uh jared joined that was very memorable and here was a figure that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1812.628,
    "end": 1840.006,
    "text": " kind of like many other things we return to similar figures again and again but this one brought us back to this core loop internal states and external states then sense and action these are the four states now here's the blanket goes down the middle that's why the metaphor of a quote blanket like a fabric blanket or i don't know what kind of blanket",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.867,
    "end": 1855.7,
    "text": " And whether it's that as a metaphor or the tapestry or whether you just want to think about it purely without any words, just in terms of the exact computational influences in the model, that's where the debate lies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.521,
    "end": 1862.846,
    "text": "And then the symmetry that was described on the previous slide, the dual symmetry, is that the internal and the external...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.727,
    "end": 1888.247,
    "text": " are ultimately just following the same computational structure it's sort of like how you could have uh experimental group a and experimental group b but you could have called them the other letter that doesn't mean you could have switched which one got the drug and which one got the placebo but you could have called it the other letter so there's a symmetry with the labeling though there's not a symmetry with the treatment and so this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.812,
    "end": 1915.284,
    "text": " four state model is just something to be returned to again and again what are the states what are the connections between the states and then leave space for the unknown is there something that transcends this ask if there's another connection if there is it can be added in but if there isn't this is a parsimonious descriptor and it allows us to do this fractal nesting and a few other things another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.533,
    "end": 1941.065,
    "text": " part of this figure was going one layer into depth onto how each of these states were defined and how each conveyed specific aspects of what the system was doing in terms of a drawing on various frameworks using terms from Bayesian statistics, other times using terms from information theory and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1942.375,
    "end": 1951.244,
    "text": " Sensation, we can just map them really quickly, is the sensation is trying to minimize the agents bound on surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.816,
    "end": 1955.338,
    "text": " Sensations play into internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.418,
    "end": 1963.364,
    "text": "So here's the photons, the eye is seeking the, is trying to bound surprise on the visual world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.105,
    "end": 1982.399,
    "text": "The internal states are optimizing the agents bound on surprise, which is basically saying, given the input, the upward flowing input, how can we tighten our expectations through state updating and optimal policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.211,
    "end": 2009.942,
    "text": " that leads to agent action to minimize the agents bound on surprise so that's why sensation and action both have the same goal of bounding surprise that's the theme bounding surprise as defined by what surprise is from this internal state model perspective and then the niche is also optimizing the niches bound on surprise now i think that uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.593,
    "end": 2029.266,
    "text": " this symmetry is the dual information geometry but it remains to be seen a little bit how that would play out in a real niche i think it'd be an awesome modeling project or a discussion about how we could think about what it means that the niche is bounding its surprise",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.966,
    "end": 2034.729,
    "text": " Does that mean it returns to attracting sets of nitrogen concentration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.31,
    "end": 2043.235,
    "text": "So it's almost like if the biological community goes to a certain concentration in a certain community variable, then there's a drawback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.656,
    "end": 2044.937,
    "text": "What does that exactly mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.657,
    "end": 2047.899,
    "text": "There's a lot of these kind of Gaia-related papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.939,
    "end": 2049.74,
    "text": "Maybe that could be related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.496,
    "end": 2052.998,
    "text": " But this paper was about communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.318,
    "end": 2069.655,
    "text": "And so we went from the narrative sort of down a level, but also up a level thinking about the turn-taking and about the way that communication encodes meaning and conveys meaning and about culture and about the way that culture structures the meanings interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.882,
    "end": 2081.85,
    "text": " The fourth paper brought us more directly to culture itself, and that was the paper Cultural Affordances, Scaffolding Local Worlds Through Shared Intentionality and Regimes of Attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.93,
    "end": 2085.393,
    "text": "So that's when we got into the regimes of attention mindset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.633,
    "end": 2087.375,
    "text": "That was on our regime of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.175,
    "end": 2091.158,
    "text": "And this was sort of one of the latter figures of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.339,
    "end": 2096.861,
    "text": " and it conveys this idea of regimes of attention quite well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.761,
    "end": 2115.889,
    "text": "So it's sort of a schematic for a generalized computational process, one that the authors posit may be plausible given neuroarchitectures in people and also potentially implementable amidst a family of other ways that it could be implemented in computer systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.129,
    "end": 2130.339,
    "text": " And this relates to the bottom-up and top-down processing, and it also relates to the Bayesian brain, multi-level Bayesian brain and multi-level Bayesian modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.079,
    "end": 2132.38,
    "text": "Here's how it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.941,
    "end": 2139.845,
    "text": "The green nodes, and this isn't maybe a colorblind visual, but the right and green nodes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.846,
    "end": 2146.211,
    "text": " are passing predictions to computational units on this left side of the column.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.771,
    "end": 2151.255,
    "text": "The computational units on the left side of the column pass their prediction errors up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.136,
    "end": 2158.481,
    "text": "So this would be the bottom-most level of this layout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.581,
    "end": 2159.622,
    "text": "It could be side to side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.642,
    "end": 2161.144,
    "text": "You could use in and out metaphors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.164,
    "end": 2162.505,
    "text": "There's other ways to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.545,
    "end": 2164.487,
    "text": "They're not always like a totem pole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.307,
    "end": 2168.07,
    "text": "It can be a heterarchy, but in this one, it's just laid out like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.531,
    "end": 2183.036,
    "text": " And it reflects how the retinal cells, let's think, passes to the next link in the chain, the predictions that it's going to give to the next computational unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.697,
    "end": 2190.079,
    "text": "And then the errors, the expectation, which is the deviation from the prediction from the higher up node is passed up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.139,
    "end": 2196.442,
    "text": "So it's saying if it ends up that this is passing the exact same prediction of the light hitting it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.342,
    "end": 2219.298,
    "text": " this one's getting the exact same prediction then it doesn't pass any differential so that's predictive processing where basically the downward cascading prediction towards the sensory cue is kind of canceling out expectations but residuals or errors propagate upwards and upwards and upwards through these abstraction hierarchies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.279,
    "end": 2239.495,
    "text": " to the highest level in this computational framework again i don't know if there are other or future frameworks the top most level passes this yellow area arrow which is the modulation of attention so that attention arrow goes from the highest uh prediction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.084,
    "end": 2262.029,
    "text": " not yeah the highest most prediction in air coupled unit and passes it to this blue node which is weighting the precision of different kinds of evidence different levels of the hierarchy so let's just say we have the visual level and then we have a cultural level the cultural level says all cars are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.362,
    "end": 2277.101,
    "text": " red and then you see driving really fast a car and maybe if you would have been uh not in such a strong cultural context of thinking that cars were red you would have seen it as orange",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.22,
    "end": 2288.048,
    "text": " There's all kinds of ways that our priors can interact with and ultimately structure the sensory cues that we receive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.149,
    "end": 2300.939,
    "text": "And so this model captures that modulation of attention to either a cultural narrative, let's say at a higher level of abstraction or a more sensory narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.268,
    "end": 2328.083,
    "text": " And that modulation, that precision weighting, which could be performed by changing parameters in a computational model, or, for example, releasing a neurotransmitter like dopamine into a certain area of the brain or type of synapse, all these neuromodulators, other kinds of non-neurotransmitter neuromodulators, may, over different timescales, differentially weight different levels of this computational hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.109,
    "end": 2353.144,
    "text": " that can be considered the regime of attention because the regime of attention may hyper focus on small things it may due to precision weighting leading uh to changes in state estimators or like the relative salience of different attributes or the plausibility of different futures people's regimes of attentions may be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.645,
    "end": 2358.366,
    "text": " making them suffer or maybe dysfunctional for society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.946,
    "end": 2365.427,
    "text": "So different regimes of attention may be things that people want to pursue or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.147,
    "end": 2370.108,
    "text": "And that was what this question of designing regimes of attention was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.628,
    "end": 2373.028,
    "text": "So there has to be a regime of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.048,
    "end": 2374.149,
    "text": "What is it going to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.529,
    "end": 2375.069,
    "text": "What shapes it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.829,
    "end": 2381.65,
    "text": "The fifth paper we read was Multiscale Integration Beyond Internalism and Externalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2382.882,
    "end": 2397.535,
    "text": " and this was a great paper as really they all are and it was about this philosophical debate between internalism and externalism which are sort of like two extremes on a continuum or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.743,
    "end": 2422.056,
    "text": " you can think of it probably different ways just like any other philosophy debate but to put it simply the internalists highlighted the role of the internal processes that is internal to the organism let's say such as things that happened in the brain and they highlight the importance of those things such things that happen in the brain things that happen in the cell things that are in the genome these internal and usually smaller things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.112,
    "end": 2450.995,
    "text": " versus the externalists who tend to highlight the functional roles of external things which tend to be bigger things like social groups or city structures or civilizational level forces these broader level things so it's a little bit like the reductionism to holism debate but it's kind of framed in an internal to external of a blanket debate because everything is nested there's not really any debate about that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.936,
    "end": 2458.578,
    "text": " It's a great observation to make, but really it's the starting point, which is why models like this are so exciting because things are nested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.958,
    "end": 2459.619,
    "text": "We know that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.919,
    "end": 2464.9,
    "text": "The only way that things wouldn't be nested would be if somehow there was a bigger thing inside of a smaller thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.46,
    "end": 2474.343,
    "text": "But that would be definitionally impossible in the spatial world, not in some other dimension maybe, but in the spatial world, it can't happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.763,
    "end": 2479.665,
    "text": "So in the kinds of systems that we want to model, if not many, many more than that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.365,
    "end": 2481.746,
    "text": " it seems to hold, is nesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.966,
    "end": 2485.488,
    "text": "So these kinds of models take that nesting seriously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.208,
    "end": 2490.41,
    "text": "They say, look, we're not going to be able to simulate down to the lowest level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.43,
    "end": 2491.311,
    "text": "That's not even helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.571,
    "end": 2505.158,
    "text": "For example, doing a protein simulation of the vibrating atoms can only be simulated for a couple of seconds, milliseconds of time, and it's usually at very high computational cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.638,
    "end": 2508.96,
    "text": " So it's not even like you can go to every protein level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.0,
    "end": 2510.101,
    "text": "Sometimes you can coarse grain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.982,
    "end": 2513.203,
    "text": "We can cheat every once in a while, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.704,
    "end": 2515.865,
    "text": "So how do we do that correctly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.505,
    "end": 2526.912,
    "text": "And they use this idea of multi-scale nested Markov blankets to get at a way in which we could perform multi-scale integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.533,
    "end": 2532.816,
    "text": "And by doing so, integrate across internalist and externalist perspectives on systems function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.557,
    "end": 2535.238,
    "text": "And so the way that this works is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.319,
    "end": 2538.901,
    "text": " there is a Markov blanket around hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.742,
    "end": 2547.269,
    "text": "And this Markov blanket or any other kind of blanket or metaphor you want to use, it's a hexagon here, has incoming variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.629,
    "end": 2550.472,
    "text": "Those are the sense states and outgoing variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.732,
    "end": 2554.415,
    "text": "Those are the action states or dependencies or relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.396,
    "end": 2561.397,
    "text": " And it can be coarse-grained no matter how much complexity is inside of here in the hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.177,
    "end": 2565.618,
    "text": "I might want to have a two-state model, friendly or foe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.158,
    "end": 2567.778,
    "text": "Or I might want to have a 50-state model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.259,
    "end": 2572.039,
    "text": "Which percentile of this is it with respect to this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.439,
    "end": 2574.28,
    "text": "Or I might want to have a 5,000-state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.68,
    "end": 2580.601,
    "text": "That's a question about the mapping between the observer and this system because we're not saying that we're knowing that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.181,
    "end": 2600.466,
    "text": " system we're calling them hidden states because we want to be clear that we're choosing which attributes to model latently within this because all we can observe are which sense data are being projected and which action states are being emitted now because of this coarse graining",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.423,
    "end": 2617.053,
    "text": " It's possible to perform some mathematics, let's hear from the authors and other colleagues who know more on this, to think about that as a particle within an ensemble at a larger level of similar things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.913,
    "end": 2630.846,
    "text": " So here is an ant and it's getting inputs, chemo sensation through the antennas detecting the chemicals, mechanoreceptors on its body with the hairs detecting interactions, all these different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.447,
    "end": 2640.616,
    "text": "And then internal states that are in the ants, reflected by the way that it processes these input streams of sensory cues,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.497,
    "end": 2655.525,
    "text": " resulting in the updating of action states where its body is how its glands are secreting different kinds of things so that's at the single nest mate level but the nest mate is in a colony of other nest mates and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.585,
    "end": 2672.926,
    "text": " depending on how evolution shapes it, not to get too off onto another topic, that's the level where one could expect to see rivalrous versus non-adversarial dynamics is where and how selection is shaping across this multi-scale system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.398,
    "end": 2699.916,
    "text": " this paper was really great and again maxwell just really um good insights these are good foundational papers and i think they set the stage well for talking about multi-scale systems in paper six we went a little bit deeper still into this two density idea this idea that uh the paper was a tale of two densities active inference is an active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.014,
    "end": 2730.011,
    "text": " and it relates to these two densities that are being passed across the blanket through the holograph whatever it is these two densities q and p uh action and perception everything here that's what embodies the relational insight and inactivism and ecological psychology everything that fundamental relational perspective is related to passing these two functions across an interface",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.919,
    "end": 2734.901,
    "text": " That's the simplest way to think of an interface, what goes from side A to B and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.541,
    "end": 2739.883,
    "text": "That is what defines the minimal interface, just like computers with APIs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.944,
    "end": 2743.005,
    "text": "So what are these two densities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.525,
    "end": 2752.669,
    "text": "Because in what they actually are is the secret of how to move beyond internalism and externalism as per the previous paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.85,
    "end": 2756.391,
    "text": "And this paper laid out a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.951,
    "end": 2782.06,
    "text": " flow chart for how variables are related and implemented from a structural mathematical perspective in a way that shows us how, because active inference is inactive, as suggested in the title, it relates the two densities, action and perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.58,
    "end": 2786.462,
    "text": "So the claim is because active inference is enacted,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.503,
    "end": 2812.683,
    "text": " it builds upon the philosophical framework of inactivism and therefore integrates sense and perception action and sense just like those inactivists ecological psychologists just like they have been what they have been working on with the sense action integration this mathematical structure captures the way that those two densities here across the interface are linked",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.74,
    "end": 2835.605,
    "text": " So because active inference is enacted and it includes action in the loop as part of the causal structure of the model and part of the fundamental way that this is laid out at a systems level, it builds upon the inactive insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.785,
    "end": 2840.886,
    "text": "So interesting paper and this graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.15,
    "end": 2867.331,
    "text": " is something that we'll return to in another later paper but it related how free energy expected free energy relates to policy selection policies have predicted influence on the b matrix which is an estimate of how hidden states of the world change through time those states result in observed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.809,
    "end": 2895.918,
    "text": " uh sensory outcomes through time and those observed sensory outcomes through time map on to the way that the other side of the system is going to change through time here's its b matrix as it changes on the other side of the interface and the energy minimization of that let's just say niche in this case it enacts its own policy little pi and little pi",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.358,
    "end": 2906.122,
    "text": " ends up influencing how the policy of the top agent influences its estimates of the hidden states of the world updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.602,
    "end": 2907.543,
    "text": "So that's the feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.003,
    "end": 2919.328,
    "text": "And the claim is that this is an activism specified formally, or one way to specify it formally, because it ties action and perception together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.528,
    "end": 2925.611,
    "text": "So maybe it's simple, maybe it's not, but it's an interesting thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.584,
    "end": 2953.754,
    "text": " the seventh paper was variational ecology and the physics of sentient systems and this was another great paper so on the left even though i believe there was a claim that maxwell like walked it back we can remember or listen to where he said that but just schematically or heuristically it's just describing how systems that exist over longer periods of time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.801,
    "end": 2977.653,
    "text": " also can exist over larger spatial scales so this has to do with order emerging from lower level activity and there are things that propagate at the subcellular level like a secondary messenger a calcium wave but then over larger and larger time scales and spatial patterns there is higher and higher orders of function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.433,
    "end": 2983.717,
    "text": " higher and higher levels of reduction of uncertainty by understanding the underlying generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.598,
    "end": 2987.84,
    "text": "And then on the bottom here are Tinbergen's four questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.841,
    "end": 2991.123,
    "text": "Maybe they could be laid out in that arrangement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.243,
    "end": 2992.044,
    "text": "It doesn't really matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2992.084,
    "end": 3005.894,
    "text": "They're really more of a two by two grid, but we talked about that in seven and it's a great framework and it builds on the 2018 paper answering Schrodinger's question by Ramsted et al, which was really a great one too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.675,
    "end": 3007.615,
    "text": "And then on the right side,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.536,
    "end": 3036.882,
    "text": " is sort of a building upon the multi-scale insight from paper five and it shows these particles being linked in a way i'm not exactly sure with the math let's hear from the authors or anyone else but what it looks like from the coloration is that there's that same multi-scale insight but there is also the organization of agents that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.59,
    "end": 3056.651,
    "text": " may want to organize into a higher level of organization and then that coordinates their action in a different way and another way to say it would be like collective behavior and individuals of similar or different kinds but at the very least interacting markov blankets that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.452,
    "end": 3078.833,
    "text": " enact organizational schemes so people who wouldn't have talked within a comment thread they're arguing that's like an organization that wouldn't have existed unless there were that markov blanket interface unless there was that shared niche so this doesn't have to be all hexagonal and crystalline this could be very chaotic and online",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.319,
    "end": 3085.261,
    "text": " Paper eight was really a great one and thanks Blue for suggesting it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.221,
    "end": 3089.602,
    "text": "It was called scaling active inference as an archive paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.302,
    "end": 3099.085,
    "text": "And Alec really helped through email and also on the discussion itself with clarifying several aspects of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.066,
    "end": 3103.367,
    "text": "And this summary figure captures the results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3103.447,
    "end": 3107.648,
    "text": "So let's go through the results and then talk about maybe how the model did what it did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.308,
    "end": 3109.189,
    "text": "And the task,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.989,
    "end": 3113.555,
    "text": " that these results are based upon is the mountain car task, which is on the top left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.197,
    "end": 3121.249,
    "text": "And this mountain car is trying, is rewarded when it reaches this flag, and it's not rewarded when it's not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.271,
    "end": 3122.451,
    "text": "And it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3123.459,
    "end": 3141.458,
    "text": " has the affordance of either having the engine push forward or push in reverse but it doesn't have enough horsepower or whatever to just drive up this hill so it has to rock back and forth many many times in order to ever get enough momentum to reach the top of the hill",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.998,
    "end": 3165.87,
    "text": " The issue is that because none of these states are rewarding, as it starts exploring the local space of policies it can enact, like let's do three seconds forward, or let's do always forward, or let's do forward and then backwards alternating for 10 seconds, so then in 20 seconds, whatever state space it starts exploring with these alternative reinforcement learning algorithms,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.81,
    "end": 3192.416,
    "text": " it turns out that that local state space of policy keeps it relatively in the bottom dwelling of this basin and that's because these reinforcement learning algorithms kind of require reward they need that sugar along the way to start learning by example and they can over learn on initial example successes that's also an issue but they do need some help along the way to find some success",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.596,
    "end": 3215.281,
    "text": " um and both of these algorithms the be epsilon greedy a little bit better so than just the straightforward for reward learner uh they both uh managed to uh not explore a full range of the locations because yeah they're sort of dwelling in this like bottom zone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.164,
    "end": 3226.572,
    "text": " Active Inference model, on the other hand, which, as we've also been discussing, takes sort of a different approach to this explore-exploit trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.553,
    "end": 3233.037,
    "text": "It was able to explore a broader range of positions and a broader set of velocities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.077,
    "end": 3237.66,
    "text": "So it was just accelerating faster to the bottom, and then it was able to get up further onto the other side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.321,
    "end": 3240.582,
    "text": "And there was great discussions there about...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.599,
    "end": 3245.36,
    "text": " the novelty driven versus the exploit driven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3245.741,
    "end": 3250.502,
    "text": "And there was also another figure that had to do with a different set of tasks that was also pretty informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.162,
    "end": 3262.827,
    "text": "But this model was helpful to go through and it just really highlighted the value to our group of being really specific about what the models were doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.887,
    "end": 3268.969,
    "text": "And also I think a lot of those who didn't have that much experience with the machine learning were able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.385,
    "end": 3286.452,
    "text": " get a peek into the state of the art of machine learning it's a paper on archive and it's being discussed by machine learning people and see what these algorithms were and were weren't being tested on what they did or didn't include and so that insight was just helpful as always",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.167,
    "end": 3293.475,
    "text": " Number nine was the Projective Consciousness Model and Phenomenal Selfhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3293.775,
    "end": 3300.047,
    "text": "That was a fun sequence and two of the authors visited for one of the streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.258,
    "end": 3318.947,
    "text": " and it related to the intersection of a few different topics which were just to pick the most key ones were projective geometries and cybernetics and integrating them under free energy principle with active inference as a process theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.827,
    "end": 3340.822,
    "text": " so the projective geometry idea is that there's different geometrical spaces just like you could have a flat piece of paper flat plane or you could have a sphere or you could have a torus or different kinds of geometries on different types of surfaces you can have different projections amidst those different types of geometries",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.542,
    "end": 3350.614,
    "text": " Some of those projections are two dimensional, like the one on your screen, and your brain does generative state modeling to infer depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.275,
    "end": 3359.205,
    "text": "Others are actually three dimensional, but there's a few aspects of this projective geometry that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.127,
    "end": 3379.317,
    "text": " equate or correlate very strongly with, in their mind, what were the fundamental features of our conscious awareness, which is that it has a non-arbitrary origin that appears to be somewhere in the visual field and that objects that are far look far and objects that are close look close.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.253,
    "end": 3381.093,
    "text": " You know, who knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.193,
    "end": 3394.957,
    "text": "And they tie the functional attributes to consciousness on one half to the projective geometry features as they're differentiated from Euclidean features geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.537,
    "end": 3399.578,
    "text": "And then on the other half of the functional features, the goal-seeking components were tied to the cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.538,
    "end": 3427.684,
    "text": " and so the cybernetic or goal seeking or recalibrating systems approach learning single loop double loop triple loop learning whatever it is that humans are doing that cybernetics approach also constitutes some of the features functionally of consciousness this figure conveyed how if you have a two-dimensional projection that doesn't have any perspective cues",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3428.655,
    "end": 3449.227,
    "text": " then it's an undecidable inference there's two equally good solutions to whether this almost hints at being a cube but can oscillate between whether it's a cube facing top down or which way it's facing depending on how you see it so one thing to consider is people's priors on wire cubes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.907,
    "end": 3471.195,
    "text": " makes them see a cube in this projection because it's just a two-dimensional projection so that's the first thing is that we unpack these line drawings into contextualized especially if it says which way do you see the cube facing it biases you to think that you're going to see a cube instead of like a logo for a company or something like that and which still could be a cube",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.236,
    "end": 3496.149,
    "text": " then once you're on the cube wavelength it kind of oscillates or maybe it doesn't depending on different people uh which way it's facing and that's because the two-dimensional projection is not telling you which side you're on but when you're in a room it doesn't seem that way and it feels like uh you're in a room and you know that you're in a rectangular room even if the angles look off",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.849,
    "end": 3502.536,
    "text": " And so they relate that to the goal seeking cybernetic nature and the projective geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.777,
    "end": 3507.503,
    "text": "And it was a great and really educational discussion with the authors as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3509.105,
    "end": 3509.646,
    "text": "The 10th paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.443,
    "end": 3532.879,
    "text": " And the graph that I referenced earlier that we would come back to is the variational approach to scripts, which was a great sequence of discussions as well, because we had this kind of a mathematical figure, but it was really a paper that cited and drew heavily on the social sciences and on the social scripts concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.499,
    "end": 3558.98,
    "text": " and shout out to mau for coming on and for um yes you asked would you be open to talking about a colloquium i would just put the details and i'll do it and in this paper uh it started with a review of the literature on the different ways that this scripts concept had been used and it compared it along two primary axes which is strong versus weak and internal versus external",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.54,
    "end": 3578.848,
    "text": " And so strong versus weak was related to whether it was a very deterministic understanding of a script, like a very ritualistic or stereotyped performance, versus a very weak script, something that was more probabilistic or potentially not predestined in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.869,
    "end": 3580.889,
    "text": "That's the strong-weak axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.249,
    "end": 3587.012,
    "text": "Then the internal-external axis, which was related to the Beyond Internalism and Externalism paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.118,
    "end": 3593.722,
    "text": " was talking about whether there was a prioritization of internal factors or external factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.922,
    "end": 3601.747,
    "text": "So for example, when talking about human behavior, and this reminds me a lot of the book of Professor Longino, Studying Human Behavior,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3603.468,
    "end": 3631.465,
    "text": " about aggression and sexuality and about how different schools of thought and different kinds of biologists different philosophers and scientists different people believed that we could prioritize the genetic causes versus the physiological versus the childhood the psychological versus the social so broader or structural factors and her book is just a phenomenal look at that so that's extremely recommended but in this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.506,
    "end": 3655.921,
    "text": " script paper those two dimensions of script strong weak and internal external were integrated through this common skeleton scaffold so this is how the script framework is going to be partitioned just qualitatively but eventually in some places quantitatively in a way where there'll be situations where internalist causal chains are relevant",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.661,
    "end": 3681.2,
    "text": " where externalists supporting causal chains are relevant like there's times where a bird just hits the windshield that's an external cause that's not an internal cause you didn't cause that on your windshield but there's times where car injuries might be because of something like that happens to a neuron and then that leads the person to change their driving behavior and hurt their car so there's so many different ways where you would want to be talking about the person driving their car",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.94,
    "end": 3685.203,
    "text": " and not get caught up in this internal external strong weak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.563,
    "end": 3691.768,
    "text": "We want to have a model that is all over the map on those two dimensions with a common and comparable framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.769,
    "end": 3698.453,
    "text": "And this is just something that we return to again and again, which is that there's time moving from left to right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.493,
    "end": 3699.694,
    "text": "So time step one, two, three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.195,
    "end": 3704.658,
    "text": "And at each time step, there is observations that are coming from the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.938,
    "end": 3709.182,
    "text": "So that's like photons hitting the retina or things touching the mechanoreceptors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.682,
    "end": 3709.962,
    "text": "And then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.703,
    "end": 3716.987,
    "text": " The organism, in this case, or whatever the system of interest is, is doing a state estimate on those observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.627,
    "end": 3728.234,
    "text": "And the state estimate is like a hidden state of the world that is being confirmed or supported or not through a single or a multi-chain, multi-scale mapping from these observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.634,
    "end": 3734.438,
    "text": "So that's why once you're an adult and you have object permanence, even when you cover up your visual field or your blink,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.998,
    "end": 3741.644,
    "text": " you can still have a understanding of where objects are because you're doing an underlying generative model with a state estimate of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.405,
    "end": 3746.429,
    "text": "A is the matrix that maps state estimates of the world to observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.31,
    "end": 3752.655,
    "text": "D are the predictions of initial conditions, and that plays into your initial state estimate in modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.09,
    "end": 3757.951,
    "text": " The B matrix is a prediction of how states in the world change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.451,
    "end": 3761.152,
    "text": "And of course that can be conditional on other features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.092,
    "end": 3771.675,
    "text": "The B matrix, which is able to be the same through time in a very simple model or could evolve through time is influenced by policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.435,
    "end": 3783.944,
    "text": " And so the example that comes to mind is always like, if I take the policy of exercising every day, that's going to change the probability of my state estimate for health moving from here to here to here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.425,
    "end": 3787.627,
    "text": "So our policies change how the states of the world change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.388,
    "end": 3815.798,
    "text": " so instead of thinking of policies as just connected directly to states of the world changing you know you can't just grab the gdp and just yank it down but you could enact a policy that would result in the hidden states changing in a certain way and you don't need to specify every single way that that happens down to the protein vibrating because your model is a coarse graining of course it is how are policies selected this is where the control theory and the cybernetic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.738,
    "end": 3826.206,
    "text": " side quantitatively comes from, and the social script side, this is sort of where the social pressure versus individual preferences stories come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.488,
    "end": 3843.821,
    "text": "This G is the expected free energy, and it's the expected free energy minimization that leads to policy selection as given the niche and my understanding of it, what is the most likely course of action for me as that kind of agent to engage in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.745,
    "end": 3850.752,
    "text": " And there's a lot of other natural language ways to say it, but in the end, it's about the specifics of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3851.293,
    "end": 3856.979,
    "text": "And here's just a wireframe model, but it would always come down to the specifics of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.86,
    "end": 3864.748,
    "text": "And this paper was just, I remember, a fun discussion because we talked about a lot of real world examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.709,
    "end": 3867.33,
    "text": " of where scripts come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.69,
    "end": 3883.78,
    "text": "So a lot of people had interesting perspectives there and also about how Active Inference and its understanding or its framing of narrative and syntax and semantics could relate to online communities or real-world communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.681,
    "end": 3889.504,
    "text": "Paper 11, which was just these last couple of days and weeks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.976,
    "end": 3910.354,
    "text": " was sophisticated affective inference simulating anticipatory affective dynamics of imagining future events and this was actually a figure from one of its supporting citations but it was brought up in the 11 discussions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.665,
    "end": 3922.546,
    "text": " and it shows this nesting of models that we just discussed on the previous slide with the states and observations policies affecting how states change free energy influencing that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3924.758,
    "end": 3929.179,
    "text": " we see the same structure with a little bit level, one more level of detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.02,
    "end": 3939.402,
    "text": "So here we have the initial state, we have the state, how it changes through time with the B matrix and the A matrix, which is the mapping between the states and the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.023,
    "end": 3945.904,
    "text": "There's pi, the policy, which is being connected and influencing how states change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.024,
    "end": 3947.205,
    "text": "So that's this bottom part here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.274,
    "end": 3951.098,
    "text": " Here's G, and that's how it was laid out here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3951.638,
    "end": 3955.644,
    "text": "Now we have G, but we're going to add a few more auxiliary variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.365,
    "end": 3960.39,
    "text": "So the first auxiliary variable here is C, which is the preference vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.951,
    "end": 3965.797,
    "text": "So the preference vector is truly an inextricable piece of this whole",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.698,
    "end": 3989.788,
    "text": " thinking so not like other statistical methods which sometimes can remove one from their preferences by making certain types of things ranked implicitly by certain features like their abundance or other aspects the preference vectors whether stated or realized or or idealized are an integral part of these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.15,
    "end": 4010.789,
    "text": " uh equations because how policy is selected is about preference it is also related to e which is the prior of affordances for policy so that's related to these ideas we talked about like the um field of affordances and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.617,
    "end": 4026.825,
    "text": " the skilled intentionality framework and the entire umwelt and ecological psychological angle that is so nicely introduced by Axel Constant, Jelle Brunneberg and others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.725,
    "end": 4046.237,
    "text": " this field of affordances is like the priors over what action is possible so if all of a sudden some i heard some noise and that makes the likelihood of some generative model like there's some type of thing happening outside of my door in my office changes the likelihood of that from one in a million to one in five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.997,
    "end": 4074.293,
    "text": " and then i start thinking about policy well policy thinking should be reflected by awaiting in what is possible it shouldn't be like i should be sitting here thinking about teleporting out of my office because it's not a policy i can engage in so that's down weighted we can think of and so the ways that policies are selected is through the free energy minimization or its expect the minimization of its expectation as it relates to the prior and the field of affordances and the preferences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4075.481,
    "end": 4082.966,
    "text": " This free energy minimization is mediated by a prior and a posterior over precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.647,
    "end": 4090.651,
    "text": "And so the prior and the posterior over precision, beta and gamma, are both related to precision, but it has a prior and a posterior component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.771,
    "end": 4092.713,
    "text": "So that means that it's getting updated through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.133,
    "end": 4097.096,
    "text": "So this precision parameter is being updated through time as precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.796,
    "end": 4101.098,
    "text": " Things change as observations come in, as actions are performed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.679,
    "end": 4107.663,
    "text": "And it relates to how confident the organism is in its model of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.103,
    "end": 4119.011,
    "text": "So that's why this M4 is called the generative model of implicit metacognition, because it's a confidence estimator, which could be delusional or it could be adaptive or some other adjective in the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.074,
    "end": 4149.355,
    "text": " the organisms uh model which is a phenotypic congruent as in i am that kind of agent model of actions that has to do with the way that hidden states of the world are reflected in observed states so if you believe that you are a certain type of agent but seeing something different in the observations then that is going to lead to a discongruity and an imprecision in this total stack as it moves through time so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.526,
    "end": 4153.468,
    "text": " Cool, that was the 11 papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.268,
    "end": 4155.269,
    "text": "Here we are in 12.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4157.77,
    "end": 4165.414,
    "text": "12, which doesn't have a paper, I put a clock because again, it strikes midnight and only once on 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4166.235,
    "end": 4169.917,
    "text": "And here at Active Inference Lab, we learn around the clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.537,
    "end": 4171.638,
    "text": "What does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.298,
    "end": 4176.981,
    "text": "That means we aim to include people across areas and time zones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4178.622,
    "end": 4180.884,
    "text": " And we provide shared structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4181.384,
    "end": 4185.327,
    "text": "Shared structure is the enabling architecture for meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4186.207,
    "end": 4188.389,
    "text": "Shared structure is what helps us synchronize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.989,
    "end": 4191.931,
    "text": "It really helps us with our shared sense-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.072,
    "end": 4196.514,
    "text": "And we return to attracting sets of ideas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4197.495,
    "end": 4221.046,
    "text": " and other kinds of attracting sets again and again and uh i'm gonna just look into the live chat and somebody with the uh initials a s wrote hi it's my first time here i've read about carl friston and the free energy principle what are the resources that i need to get into to get involved this is a great question and i uh appreciate it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.986,
    "end": 4227.788,
    "text": " it is an attracting set that we should always be returning to, which is how can we get involved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.868,
    "end": 4228.909,
    "text": "How can we participate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4229.249,
    "end": 4234.511,
    "text": "And then on the other side of the blanket, how can we make it easier to participate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.691,
    "end": 4238.953,
    "text": "So the answer to that question is go to ActiveInference.org",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4240.453,
    "end": 4255.099,
    "text": " and there hopefully you will find starting resources on how to learn more about this area so one resource is this live stream and the curriculum of papers that we discuss and then um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4256.52,
    "end": 4273.699,
    "text": " in the upcoming year we're going to be hopefully developing more types of educational resources and if you go to the 2021 podcast uh you know live stream calendar spreadsheet that i showed earlier the the short link",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.541,
    "end": 4282.906,
    "text": " you'll see on the top right, two resources that was of Baron and Jared that contain a ton of resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.466,
    "end": 4292.172,
    "text": "So another thing that I would highlight here is that if you're really curious about this, just stay in touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.532,
    "end": 4299.657,
    "text": "So get a Keybase username and join our team or whatever platform we're using in the future or email us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.737,
    "end": 4302.059,
    "text": "But just, if you're curious about something,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.3,
    "end": 4320.482,
    "text": " email us or put it in a comment in a in a thread and we'll develop better platforms for curating and connecting people on these questions but stay involved and curious and in the community and read the articles at whatever level you feel comfortable with them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4321.443,
    "end": 4345.283,
    "text": " and it will always be helpful to have somebody to read them with and a group to read them with whether it's on a live stream or whether it's not on a live stream whether it's just on email and um if you don't know what to read next or what video to watch next you should just ask the question like hey i'm really into this and that i know about this but i'm curious about that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.304,
    "end": 4348.205,
    "text": " Can anyone recommend me a paper to read?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.525,
    "end": 4358.091,
    "text": "Or I don't know if I could read a whole scientific paper right now, but can anyone recommend me an article about this or any other kind of request?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.111,
    "end": 4368.257,
    "text": "So I'd say that's the best way to get involved is ActiveInference.org will always be the most updated thing, and we're going to make that a lot more informative in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.197,
    "end": 4372.639,
    "text": "And you can read through things that we've discussed on this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4374.682,
    "end": 4390.57,
    "text": " active inference live stream and then really just be socially communicative and ask people just through private email to us or to anyone or just a public comment, especially if you think it's a question that other people might have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4392.772,
    "end": 4395.155,
    "text": " If that answers your question, please let me know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.295,
    "end": 4397.357,
    "text": "Otherwise, anyone else is free to ask questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.158,
    "end": 4405.027,
    "text": "Here's two pieces of feedback from the community that were sent in the days leading up to preparing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.948,
    "end": 4407.75,
    "text": "And I'll start with the top one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4409.592,
    "end": 4410.413,
    "text": "Sarah Mona wrote...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.42,
    "end": 4415.861,
    "text": " I just want to see a kind of toy model with a number of relatable variables that are tenable and tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.161,
    "end": 4424.743,
    "text": "One of the challenges I have with understanding this stuff is it seems like you find out what the variables are through the model and then find out there's a gazillion of them and it's hard to trace how things converge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.343,
    "end": 4432.685,
    "text": "Maybe I'm wrong or this is too naive of a wish, but I want to be able to step through Python matrices to see how the model changes at each stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4433.345,
    "end": 4435.286,
    "text": " Yes, good point, good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4435.406,
    "end": 4450.656,
    "text": "So it points to a need for interactive notebooks and other kinds of technology that allow us to very granularly play with and see and explore these models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.216,
    "end": 4456.099,
    "text": "It's one thing to see it graphically laid out in a figure as we had in some of these previous slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.539,
    "end": 4461.623,
    "text": "It's a whole nother thing, as you put it, for those variables to converge on a functional state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4462.483,
    "end": 4464.263,
    "text": " So that's a great point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.044,
    "end": 4471.085,
    "text": "And also the tractable and tenable would be cool because then people could apply it to different kinds of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4471.445,
    "end": 4475.186,
    "text": "So we wouldn't want this notebook to be full of esoteric code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.566,
    "end": 4477.366,
    "text": "It should be well commented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.406,
    "end": 4483.488,
    "text": "Could it be in multiple languages, multiple computer languages, or could it be in multiple natural languages with the commenting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4483.848,
    "end": 4486.948,
    "text": "Could it cross-render in a way that helps people learn?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.988,
    "end": 4489.449,
    "text": "Could we collab on the code?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.069,
    "end": 4512.089,
    "text": " we want to be able to make that experience helpful because again it's not just what to read it's also how to be communicating and being the kind of person who's coming to understand it and everyone's going to be learning the math forever i mean you could get your phd on a sub sub sub math area so we're talking about multiple areas of math so no one's going to be that deep in the game",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.649,
    "end": 4514.23,
    "text": " So it's about the community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.71,
    "end": 4520.154,
    "text": "So that's the cool thing is just you'll come to understand what you're interested in doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.274,
    "end": 4522.535,
    "text": "Is it applying it to your area?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.235,
    "end": 4529.519,
    "text": "Is it just looking at what kinds of projects people are interested in for the RCPs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.539,
    "end": 4535.162,
    "text": "It includes youth education, theory crafting, entrepreneurship, study groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4535.322,
    "end": 4540.765,
    "text": "So there's a lot of things that people are interested in doing to say nothing of robotics and other deliverables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.286,
    "end": 4541.386,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.92,
    "end": 4549.523,
    "text": " I hope that a common resource is the kind of computational clarity that Ceremone is getting at, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.723,
    "end": 4550.244,
    "text": "So thanks for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.884,
    "end": 4552.865,
    "text": "Mao wrote that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.025,
    "end": 4570.213,
    "text": " it would be nice to see adapted implementations and cross-disciplinary lingua franca, which is great because that's like the French language, the French tongue, yet it's an English communication ostensibly, but it just means common speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.694,
    "end": 4574.755,
    "text": "And that is part of the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.075,
    "end": 4577.296,
    "text": "And it's fun to cross languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.836,
    "end": 4580.378,
    "text": "How do we have the right trade-off",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.252,
    "end": 4607.75,
    "text": " with accessible but specific language as well as non-violent communication and very accessible and intercultural norms so it's not just about the rigor and the precision in language because you can go down that rabbit hole and not come out just like you can go down the other side of caring about how the words are strictly perceived by an infinite set of possible external actors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.51,
    "end": 4612.52,
    "text": " somewhere in the middle is productive research that's also going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4613.564,
    "end": 4616.785,
    "text": " really productive for hopefully a wide variety of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.405,
    "end": 4627.288,
    "text": "And it's a good piece of feedback because one of the lingua francas, if you will, is practice and adapted implementations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4627.808,
    "end": 4641.132,
    "text": "So the cross-disciplinarity, the interfaces between the different disciplines are not just the undergraduate majors in the university and having the biologists, the mathematicians, and the social scientists come together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.832,
    "end": 4652.618,
    "text": " It's also about understanding theory and practice and understanding how people who want to be interacting with active inference from so many different perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.838,
    "end": 4661.843,
    "text": "So just like there's biology education of all kinds and could and should be more adult education in all these different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4662.603,
    "end": 4689.503,
    "text": " active inference hopefully will be something that's a lifelong learning journey and i think especially with some of these um things that people wrote in the rsps with the youth education i'm just really excited to understand what that could look like too because we could all use youth education and um uh as wrote thanks that was helpful i'll try following thank you cool so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4691.181,
    "end": 4693.162,
    "text": " Now onto just the random section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4693.962,
    "end": 4701.905,
    "text": "Something, I can't remember where I heard it, but it was this idea of mirrors and windows and two kinds of interfaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.986,
    "end": 4708.908,
    "text": "And the window is one that you look through and the mirror reflects us bizarrely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.349,
    "end": 4709.529,
    "text": "Now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.653,
    "end": 4714.574,
    "text": " What we see is a generative model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.815,
    "end": 4721.418,
    "text": "So first off, how weird is it that our generative model of the world can either make a surface transparent or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.018,
    "end": 4726.16,
    "text": "I mean, shouldn't you be able to imagine what's on the other side of a wall?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4726.34,
    "end": 4738.286,
    "text": "So maybe that's what looking through things is sometimes in the visual dimension or not when different levels of precision in different parts of the world peer through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4738.886,
    "end": 4739.767,
    "text": "So there's so much...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.922,
    "end": 4742.203,
    "text": " that that could relate to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.084,
    "end": 4749.671,
    "text": "But another way that this relates is in the discussion, I think in 9, with this transparent concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4750.853,
    "end": 4762.585,
    "text": "The transparent concept, the water we swim in, is the things that are so fundamental that they don't seem like they're up for debate or distinction, which is the whole nuance of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.306,
    "end": 4790.567,
    "text": " zen koan and of this consciousness studies area is that it's it's the very subtle and potentially even ineffable aspects of consciousness that are its fundamental attributes and potentially the most fundamental attributes are those which are not directly experienced at least under normal consciousness so there's this distinction between the window which is the concept is it's us seeing things from the outside in but um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4791.187,
    "end": 4818.888,
    "text": " it's almost like your eye is radiating outwards from the generative model distribution perspective as opposed to the mirror which reflects us but it reflects us potentially bizarrely reflected up down left right who knows all kinds of bizarre reflections in the echo chamber and then that made me think about the two common sayings um that uh if you're in a glass house don't throw stones",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.034,
    "end": 4824.598,
    "text": " And then the second one was a hall of mirrors, which is being in a diluted state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.059,
    "end": 4842.075,
    "text": "So it's funny that the common wisdom around these two kinds of interfaces for the glass, well, they're both glass, but for the window, it's saying if you live a transparent life, you shouldn't commit aggressions or transgressions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.041,
    "end": 4864.799,
    "text": " and then on the other hand so if your interfaces are too transparent you have to live increasingly responsibly on the other hand if you live in a hall of mirrors it doesn't say don't throw stones you're just in a delusion any stone you throw would actually potentially even draw you out of the illusion by disrupting some of the feedback mechanisms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.7,
    "end": 4878.537,
    "text": " So pretty interesting and just 2020 on the close video, just really time to look back and look at the self, look into the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.078,
    "end": 4881.981,
    "text": "These are always critical things, but they're taking on special relevance now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.423,
    "end": 4883.844,
    "text": "Just one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.669,
    "end": 4913.766,
    "text": " little foray into the synergetic realm and this is drawing on some of the dissertation and work by Dr. Cheryl Clark on the social synergetics site and I just happened to be reading this and I found this figure and I just was already planning to do the clock with the 12 and so I just thought it looked like the clock and so it would be cool to go there and uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.229,
    "end": 4919.251,
    "text": " I wonder if active inference can be related to synergetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4919.351,
    "end": 4920.893,
    "text": "So what is synergetics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.234,
    "end": 4929.179,
    "text": "Really, there's so much to say here, but synergetics contains elements of a few different areas of mathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4930.02,
    "end": 4933.763,
    "text": "And I started with this quote, unity is plural and at minimum too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.923,
    "end": 4940.328,
    "text": "There's many kind of classic quotes of synergetics, which is developed primarily by Buckminster Fuller, no longer here physically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4941.128,
    "end": 4941.609,
    "text": "And, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.907,
    "end": 4947.908,
    "text": " it really reminds one that the basis of this way of thinking is relational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4948.488,
    "end": 4957.25,
    "text": "So that relational stance, which is shared with active inference at a very kernel level, is going to be implemented in a couple of different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.85,
    "end": 4967.252,
    "text": "So in synergetics, the key pillars are related to the areas that we would consider geometry, topology, or graph theory, or network science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4967.992,
    "end": 4978.476,
    "text": " It's also related to vectors and dynamic systems, as well as structural modeling, which was developed by Buckminster Fuller through the engineering practice of tensegrity, tensegrity modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.496,
    "end": 4988.72,
    "text": "But there's a few other interesting and important pieces of synergetics, and one of them is that the tetrahedra is the minimal system, not the acute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.72,
    "end": 4993.882,
    "text": " And the tetrahedral's focus pervades several different domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4994.142,
    "end": 5000.425,
    "text": "One of them is that there's a focus on the 60 degree angle as being primary rather than the 90 degree angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.025,
    "end": 5005.087,
    "text": "So the tetrahedra is the minimal system and this plays out in a million different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.927,
    "end": 5013.691,
    "text": "But the tetrahedra on the screen relates to Plato's triad and it shows on the right side this triangle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.531,
    "end": 5043.306,
    "text": " triad of the true uh the good and the beautiful truth beauty and symmetry any three you want relate them however you like and then the tetrahedral addition of the self so this is the perspective this is the relational component and quite interesting to think about some of the grand transformations that are occurring at this time in world history from the perspective of synergetics and the introduction of the self into this triad",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.48,
    "end": 5046.621,
    "text": " and other tetrahedra can be imagined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.442,
    "end": 5050.843,
    "text": "Crystals, buildings, social relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5052.524,
    "end": 5058.447,
    "text": "What really makes me curious is that in active inference on the coarsest grain, there are also four states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.547,
    "end": 5059.928,
    "text": "That's that four state model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5060.408,
    "end": 5067.772,
    "text": "And those are the two kinds of external and internal states, and then the sense in action states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.752,
    "end": 5072.893,
    "text": " So there's a unity in those internal and external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5072.913,
    "end": 5075.854,
    "text": "That's unity as plural at minimum two, internal and external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5076.634,
    "end": 5077.954,
    "text": "And then there's the interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.355,
    "end": 5080.495,
    "text": "And then the next level out is four, not three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.955,
    "end": 5082.276,
    "text": "The interface is not one part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5082.316,
    "end": 5083.376,
    "text": "The interface is two parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5083.836,
    "end": 5087.457,
    "text": "So you go from unity as plural and at minimum two, internal and external states,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.237,
    "end": 5109.289,
    "text": " to the triangle which is stable but as a modeling concept but doesn't have space enclosure it's not a minimal system the minimal real specified system is the tetrahedron is the four state active inference model so from a totally different perspective non-geometric perspective but intriguingly using information geometry",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.362,
    "end": 5123.762,
    "text": " fep free energy principle has converged to somewhat of a synergetic perspective on how unity is plural and how the minimal system is potentially a purely relational tetrahedra so that is quite interesting big if true",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.362,
    "end": 5133.905,
    "text": " Also from her dissertation, this figure of a tetrahedra relates how qualitative concepts can be captured within synergetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5134.865,
    "end": 5142.227,
    "text": "So here, the edges of the tetrahedra or the vertices are vision reflected by a mission statement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5143.348,
    "end": 5149.089,
    "text": "Tools, hopefully the mission statement is something that we will write together as a lab and as a community with feedback as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5150.07,
    "end": 5153.451,
    "text": "On the right side, tools and resources, that's one of our projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.764,
    "end": 5160.148,
    "text": " And hopefully the tools that we build will be for ourself and for everybody, and the resources that we make will be for everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.509,
    "end": 5161.61,
    "text": "So that's education as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5161.79,
    "end": 5163.051,
    "text": "Everything is tools and resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.051,
    "end": 5175.42,
    "text": "On the left side, design and the action plan, to be bringing people together successfully, we're gonna be needing to co-create, co-design, and then enact our action plan, shared joint action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.881,
    "end": 5181.565,
    "text": "It doesn't mean that everyone's gonna do the same thing, but we are going to co-create and enact together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.466,
    "end": 5185.329,
    "text": " And then on the bottom, evaluation and supervision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5186.309,
    "end": 5199.621,
    "text": "And this kind of mentorship, peer mentorship, whatever it happens to be considered as or called, facilitation is how we're going to make sure that this whole tetrahedra is coherent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5202.441,
    "end": 5208.026,
    "text": " Another feature of synergetics and tensegrity is this focus on both tension and compression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5208.186,
    "end": 5214.112,
    "text": "And so the idea that Bucky had was that the buildings on Earth, they require gravity to pull them down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5214.312,
    "end": 5217.735,
    "text": "Like the building I'm in, if it was on its side, it would just crumple from its own mass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.276,
    "end": 5220.999,
    "text": "And so they require gravity in order to hold them down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5221.579,
    "end": 5232.727,
    "text": " Whereas if you're going to be shooting something to a different planet or landing it from a high altitude, you need it to be able to be kind of self-supporting from any gravitational influences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5233.227,
    "end": 5240.932,
    "text": "And so these kinds of tensegrity structures are with both compressive and tensile elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5240.992,
    "end": 5243.674,
    "text": "So like ropes that are connected to rods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5244.194,
    "end": 5250.459,
    "text": "And if you just look up tensegrity sculpture or tensegrity robot, you'll see a ton of cool robots and other stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5251.96,
    "end": 5257.063,
    "text": " And the big question is, could we connect it with Active Inference and the FEP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5257.664,
    "end": 5269.411,
    "text": "And here are some people, Amy Edmondson, Kirby Earner, Kurt McNamara, the 10 Security Wiki, SNAC, the CJ, apparently all the groups that he does, everyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.871,
    "end": 5271.312,
    "text": "I don't know all of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5271.812,
    "end": 5279.797,
    "text": "These are just some that I know or have learned a ton from, but there's so much that could be explored here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5281.226,
    "end": 5295.611,
    "text": " The question that we return to just so many times in this year and will return to again is, what does free energy principle and active inference say about the relationship between an agent and the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.798,
    "end": 5317.602,
    "text": " And that has come to be understood in these discussions as the relationship between the different parts of a multi-scale system, between the psychology of being in social settings, online teams, computational things that are communicating with each other, all these different ways that we talked about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.942,
    "end": 5324.865,
    "text": " how the agent and the world interact in all the different systems that we would want to understand what this means in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.265,
    "end": 5339.99,
    "text": "I mean, it's a general question and let's continue to think about these big attractor set questions that will help us just always come back to the basics and always focus on making it the most applicable, most comprehensible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5341.252,
    "end": 5369.575,
    "text": " and just to combine that clock and the clock striking midnight with actin 12.0 and the kairos so the greek language has these two words for time related to time chronos being the chronometer being the time that's broken down into quantifiable pieces even taken to the extreme of metric time by some you know 10 hours per day 10 minutes per hour 10 seconds per minute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.509,
    "end": 5373.413,
    "text": " And then in contrast, there's this kairos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.074,
    "end": 5386.532,
    "text": "And these two frameworks for time are so related, but they're related in this way that syntax and semantics are kind of that scaffolding and meaning are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.393,
    "end": 5403.843,
    "text": " and it's not a formal mapping as always these are just hastily prepared discussions just some thoughts but um as we build active inference in the computational direction and implementational with internet structures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.164,
    "end": 5417.531,
    "text": " and also build in the accessibility dimension and the communication and the education and cross-disciplinary thinking as brought up by the great community feedback and so many other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5418.604,
    "end": 5437.03,
    "text": " we we never um want to stray away from the meaning discussions and that is uh something we'll learn along the way how it plays out but i'm just curious how that will play out so i can suffice to say that and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.031,
    "end": 5465.944,
    "text": " wow i mean i don't have anything prepared from a writing perspective i'm not going to add any more any notes just 2020 was a big year and a lot remains to be said and i hope that everybody can have a safe and healthy life and i just want to keep this about active inference so i really just don't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.257,
    "end": 5492.076,
    "text": " want to uh predict or review it just feels like a time that we're all moving through in a really unique way so i just hope everyone's well and just may the gradient descent be with us all and one also last note on 2020 is um during this year my colleague martin passed away he's here and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5493.789,
    "end": 5507.302,
    "text": " He was an incredible person, and he co-founded this group, Alias, that I'm a part of, which is a research group on consciousness, and he was a co-editor on this book, Metacognitive Diversity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5507.322,
    "end": 5513.528,
    "text": "He was a French scholar, did a lot of field work in the Amazon and other areas, and he",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5515.038,
    "end": 5534.344,
    "text": " um in 2018 in the alias bulletin we uh martin and i interviewed carl friston about free energy principle and uh so martin was really even though his background was in humanities and uh anthropology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5535.771,
    "end": 5546.197,
    "text": " he learned so much about neuroscience and multi-scale biology and the free energy principle and just made it come alive and was such um a cognizant thinker so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5555.697,
    "end": 5555.937,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5557.218,
    "end": 5558.799,
    "text": "Thanks for participating, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5559.44,
    "end": 5561.261,
    "text": "It was a good stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5561.281,
    "end": 5562.261,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.022,
    "end": 5563.963,
    "text": "RIP Martin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5564.423,
    "end": 5567.085,
    "text": "Sorry, everyone, but it was a loss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5567.665,
    "end": 5572.468,
    "text": "So... Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5573.569,
    "end": 5575.55,
    "text": "Just intense stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5576.211,
    "end": 5577.892,
    "text": "Everybody lost people, you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.032,
    "end": 5579.973,
    "text": "So... Anyways...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5581.087,
    "end": 5581.967,
    "text": " Good times, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5582.147,
    "end": 5584.268,
    "text": "Thanks for being along for the ride.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.129,
    "end": 5591.031,
    "text": "And I think we'll have a lot to do and work on in 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5591.071,
    "end": 5599.674,
    "text": "I hope we can build from what's happening now and build towards something that's just better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5599.894,
    "end": 5605.516,
    "text": "I know there's a better way and it's going to be really important that we get there and find it together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5606.757,
    "end": 5606.897,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5608.325,
    "end": 5608.866,
    "text": " Thanks again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5609.247,
    "end": 5610.65,
    "text": "Just stay in touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5611.572,
    "end": 5612.394,
    "text": "Get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5613.737,
    "end": 5614.639,
    "text": "RIP Martin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5615.42,
    "end": 5616.763,
    "text": "Long live Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5617.485,
    "end": 5617.986,
    "text": "Peace, everyone.",
    "speaker": "SPEAKER_00"
  }
]