[
  {
    "start": 7.079,
    "end": 34.912,
    "text": " hello and welcome it is september 12 2023 we're here in the active inference for the social sciences course at the active inference institute and having a discussion section on semiotics and semantics here with lorena zaganza we're going to be having a fun discussion i hope if you're watching live please feel free to write any questions in the live chat if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.036,
    "end": 61.113,
    "text": " thought about joining and you weren't sure it's not too late otherwise we're gonna pick up on some key points from the lecture and on the topic and see where we go so lorena welcome back and however you want to begin let's go from there okay hello thank you daniel um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.347,
    "end": 75.958,
    "text": " So let's try to recap a little bit where we left off during the lecture, just to remind us where we were.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 76.098,
    "end": 89.069,
    "text": "Like my point, what I was trying to articulate was the idea of what does it mean to talk about formal semantics in a way that is not really",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 91.181,
    "end": 119.651,
    "text": " loaded because it's an interesting thought like to have a semantic semantics that is actually only formal right in principle it would be relative to meaningful uh to meaning right in in the notion that active inference is trying to cash it out",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 124.162,
    "end": 133.25,
    "text": " it's more like an idea or a way of modeling how we deal with meaningful situations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 134.831,
    "end": 147.781,
    "text": "And to understand that in a more interesting, more embodied, and more concrete way, I was suggesting that we could use biosemiotics as...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 154.912,
    "end": 166.028,
    "text": " As a model and as a theory for living creatures, like language users to navigate the realm of symbols.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 168.798,
    "end": 192.576,
    "text": " and gave one example, which came from James Koch, which is the European forestry that comes with a practice, understanding this scientific understanding of forests as a practice that allows us to refer to meaningful",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 194.352,
    "end": 202.81,
    "text": " meaningful things in the environment in terms of what is valuable what's interesting and what is not and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 205.62,
    "end": 229.888,
    "text": " what interestingly what is more important also from what becomes valuable it is what is cropped out from the meaningful perspective so things nature uh parts of nature becomes left out or understood as something that is not desirable and you just understand",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 232.014,
    "end": 253.492,
    "text": " what you don't want in your articulating principle as weeds or something that you should get rid of in respect to what is more desirable in terms of crops and how you understand nature in a more commoditized way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 260.313,
    "end": 266.131,
    "text": " And I find like this example from Scott kind of very, very elucidating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 270.334,
    "end": 281.379,
    "text": " In the book, he's talking about states, how we articulate life around one specific notion of state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 282.12,
    "end": 292.585,
    "text": "But in this specific example, he has the idea of one official observer, and this official observer establishes a principle of meaning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 293.866,
    "end": 298.148,
    "text": "In a way, you have to have a handle of nature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 299.423,
    "end": 314.143,
    "text": " And that also articulates how villages and how practices around agriculture and how people relate to each other within these practices gets organized.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 318.445,
    "end": 345.471,
    "text": " specifically for uh one interesting point that he makes that is to appreciate the constriction of that is like a vision that notices not what within the meaningful crops but which is left outside the field of vision and i bring that specifically to understand how",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 347.871,
    "end": 374.478,
    "text": " the free unity principle can or could be connected to a generalized synchronization over time in relation to those symbols and those practices in terms of niche construction and how those how this niche construction brings along with the symbolic use of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 376.634,
    "end": 378.715,
    "text": " language predictive value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 386.576,
    "end": 386.996,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.456,
    "end": 394.258,
    "text": "Bryn, want to bring up any thoughts on that or any other pieces or I'm happy to add a comment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.36,
    "end": 405.52,
    "text": "Bryn?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 411.235,
    "end": 411.555,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.916,
    "end": 413.677,
    "text": "Guess not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.398,
    "end": 415.078,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.981,
    "end": 418.801,
    "text": "A lot to say there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.402,
    "end": 422.164,
    "text": "There was a little bit of a double play with what is cropped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.724,
    "end": 431.051,
    "text": "On one hand, what is cropped is the industrial crop that is being prepared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.552,
    "end": 436.455,
    "text": "And then the other side of that coin is what is cropped out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.378,
    "end": 443.987,
    "text": " And what we crop in is the part that we're paying attention to, and we can't pay attention to everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.448,
    "end": 447.112,
    "text": "So it's like two sides of the same coin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.593,
    "end": 453.361,
    "text": "What we pay attention to, what we include in attention in our cognitive awareness system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.999,
    "end": 479.63,
    "text": " leaves the shadow which is what we exclude and um that could be like the weeds or the other ecosystem services so by highlighting the meaning or one dimension of meaning or one stance on meaning that only it's like a seesaw that becomes salient to the extent that something else must be de-prioritized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.489,
    "end": 483.812,
    "text": " So that's how we accentuate these distributions of meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.793,
    "end": 493.1,
    "text": "And what do we get from active inference and free energy principle beyond, for example, what's provided in seeing like a state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.801,
    "end": 500.086,
    "text": "I think there's a lot we could say on that, but one piece is we get a process theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 501.235,
    "end": 510.919,
    "text": " a real procedural approach to how different systems come to do sense-making and cognition and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.559,
    "end": 529.807,
    "text": "So just describing the lay of the land or the history of forestry in Europe or any other state of affairs in the world, merely describing it may not even help us determine what's going to happen a short time later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.546,
    "end": 535.151,
    "text": " let alone a long time later or what might happen in a very different ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.972,
    "end": 551.028,
    "text": "Whereas if we understand the processes of sense-making and decision-making that different kinds of cognitive agents do, certainly humans, also though states as cognitive entities, which is what seeing like a state or thinking like a state entails,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.009,
    "end": 557.713,
    "text": " we get a process-based view on what otherwise might be merely descriptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.094,
    "end": 567.781,
    "text": "And along with that process-based view, we gain an increased ability to make unique explanations, predictions, accounts, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.803,
    "end": 572.424,
    "text": "Yeah, we can.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 572.724,
    "end": 573.865,
    "text": "We can also understand it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 579.275,
    "end": 591.141,
    "text": " in a different perspective in terms of realizing what becomes sensitized and what becomes desensitized along the process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 591.181,
    "end": 598.425,
    "text": "So you can possibly model that using this kind of tools and understanding how that happens over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 599.225,
    "end": 606.99,
    "text": "I don't know how much in terms of prediction of things that were not foreseen in these descriptions we can",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 608.13,
    "end": 635.994,
    "text": " we can achieve in fact you can achieve some some level for sure but like that system should be decide how how that delivers a very all-encompassing prediction in this kind in these cases they don't believe it can right I don't think that's the purpose as well but we can at least have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 637.423,
    "end": 662.281,
    "text": " Which might not be as positive as we want, but I think we can gain some understanding in this process of being more sensitive or less sensitive to specific primes and how these organizational principles, how powerful they become over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 666.204,
    "end": 666.444,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.967,
    "end": 673.249,
    "text": " I'll read some comments in the chat and then Lorena or Brynn, feel free to just give any thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.889,
    "end": 685.173,
    "text": "Upcycle Club wrote, hello, biomimicry can enhance biosemiotics by showing us how nature solves problems and creates beauty through signs and codes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.093,
    "end": 689.994,
    "text": "And by encouraging us to apply these principles to our own creations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.555,
    "end": 692.735,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 694.926,
    "end": 702.53,
    "text": " The idea of coding is an interesting idea, but to talk about codes, I don't think we can.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 703.19,
    "end": 704.231,
    "text": "That's my take, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 704.331,
    "end": 705.431,
    "text": "I don't understand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 706.472,
    "end": 718.878,
    "text": "We haven't coded any type of principles within our cognitive ability, biologically speaking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 720.376,
    "end": 728.98,
    "text": " However, you can understand these encodings in terms of becoming more or less sensitive over time to environmental cues.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 731.001,
    "end": 735.544,
    "text": "As the example in terms of, I use the example of forestry, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 736.444,
    "end": 743.248,
    "text": "So in that specific case, this, what becomes more,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 744.677,
    "end": 773.446,
    "text": " what you become more sensitive and the more you organize your life or social life is organized around specific principles then you can make sense of these relational stories uh in instead of just leveraging one full uh difficult to explain notion of encoding in terms of social cognition because it will be hard to explain",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 775.12,
    "end": 777.801,
    "text": " how the brain will be encoding these specific symbols.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 778.361,
    "end": 784.823,
    "text": "But they can be cached out in the environment relationally, in terms of those organizational principles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 786.704,
    "end": 801.649,
    "text": "And then you have this idea of biomimicry, like these reiterations and how that comes along to explain what this mimic or this meme will be then.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 802.742,
    "end": 805.646,
    "text": " but it's not so straightforward, I think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 807.928,
    "end": 811.953,
    "text": "Well, certainly decompiling the source code of nature",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.183,
    "end": 839.495,
    "text": " is somewhere between challenging and misguided or impossible but that notion of a code script for biology has animated discussions of life going back to for example schrodinger's what is life he basically says there's two aspects of living systems there's their organizational capacity their negantropic capacity and then there's their code script",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.055,
    "end": 856.825,
    "text": " their aperiodic crystalline informational repository and then another place that coding comes up a little bit less in the source code space is predictive coding and that's in a way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.952,
    "end": 865.039,
    "text": " highly compatible with active inference, and gives a deflationary account on how the semiotics are encoded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.939,
    "end": 881.574,
    "text": "Rather than saying, well, this is what this variable in the source code means, or this is what this codes for, or here's a code switch, predictive coding is like saying, we're not even gonna touch the semantics of what the sign is itself,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.174,
    "end": 895.216,
    "text": " we're just going to hypothesize that the way that information about the sign is transferred is through this maximum information signaling approach called predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.856,
    "end": 908.258,
    "text": "Because predictive coding arose out of video compression algorithms and only at the end of the 90s was found to be increasingly relevant for neural circuitry and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.998,
    "end": 911.899,
    "text": "So it's another example of where like a process-based",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.536,
    "end": 941.46,
    "text": " approach ends up deflating or reframing the otherwise semantically loaded question it's like switching out the question of like where we're going to be with how we're going to get there and instead of only focusing on the meaning of the signs first off as if the meaning of the signs could be discussed outside of their",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.987,
    "end": 966.622,
    "text": " implementation and then even if we could figure out what the signs were we would then just turn around and want to know how they were transmitted and so predictive coding or predictive processing in a way short circuits that or inverse it by first looking to explain how information is transmitted that could support semiotics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.902,
    "end": 988.264,
    "text": " then in the context of biological systems we naturally have biosemiotics yeah i i would ask the question when you talk about information being transmitted right what that actually means and i think that's a very very big topic and a very large discussion in terms of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 989.832,
    "end": 1017.038,
    "text": " uh information information theory when specifically applying that into um biological systems I think there are some interesting people working on information that makes the case that Shannon has a point and he's really interested not in the cement in the semantics or in the meaning or anything else he's kind of interested in the problem of transmission and when you talk about transmission",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1019.224,
    "end": 1044.514,
    "text": " it's worth to ask what is being transmitted exactly in the terms of of signals even if you're capturing specific patterns and you think that the partner is this thing that will be transmitted in that sense but that would be a worse um i was asking question to understand like the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1046.021,
    "end": 1051.464,
    "text": " this notion of what is actually being transmitted in that sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1051.924,
    "end": 1068.514,
    "text": "This information theory is focusing on this notion of the problem of transmission and then all the concepts that come along to explain that in terms of uncertainty or noise and everything that impacts this transmission of processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1071.096,
    "end": 1071.216,
    "text": "And",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1074.87,
    "end": 1081.852,
    "text": " If you're saying, like, we're transmitting information in this sense, it is breaking this semantic code apart.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1081.892,
    "end": 1085.513,
    "text": "Yes, it is, because, like, the problem is not focused on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1086.073,
    "end": 1092.054,
    "text": "It's focusing on the specific correlations that we have, that we call it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1092.694,
    "end": 1099.816,
    "text": "They are mentioning as information and how these correlations are an issue from the get-go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1101.209,
    "end": 1107.49,
    "text": " from what is being picked up in one side being correlated to what comes into the other side.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1108.771,
    "end": 1111.691,
    "text": "How do you lose or gain more information in that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1113.292,
    "end": 1127.535,
    "text": "But the deeper question here is, how can you say that you are actually gaining or losing that information because you are defining this correlation that could be transmitted or not?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1128.916,
    "end": 1130.037,
    "text": " from the get-go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1130.297,
    "end": 1135.801,
    "text": "If you don't have that, you don't have anything being actually communicated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1138.263,
    "end": 1155.855,
    "text": "So with that in mind, you can explain these concepts in terms of function, and then there's a bunch of theories that navigate this sense of signaling that is specifically only functional.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1156.375,
    "end": 1158.437,
    "text": "And then predictive coding tries to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1162.83,
    "end": 1164.551,
    "text": " try to push that a little further, maybe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1164.571,
    "end": 1175.375,
    "text": "But then you have to explain in a deep sense how this information is being actually transmitted and processed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1175.535,
    "end": 1180.476,
    "text": "And I don't think that is really, really as obvious and as clear as we think it is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1184.798,
    "end": 1187.459,
    "text": "Specifically, when we're talking about this biological",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1189.008,
    "end": 1217.72,
    "text": " way of nature navigating this process this signaling we have to talk about see because declaration if it's defined i've been issue like from the beginning you can only have this kind of transmission for someone specific that can be able to understand that in the other side right well certainly whether we're talking about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1218.985,
    "end": 1246.167,
    "text": " a chemical pheromone that requires some type of receptor or something more ephemeral like language that requires more of a semantic reference frame there's no receiving the message without the sender it's like they're kind of the two sides of the phone call um i'll ask a question from the chat love evolve rep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.148,
    "end": 1253.652,
    "text": " How about cultural encoding and principles in contrast to organizational?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1255.293,
    "end": 1265.739,
    "text": "So how do we think about cultural meaning and is that similar or different than organizational?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.909,
    "end": 1296.409,
    "text": " that's that's a good point right i think if you take very seriously the example from the uh the forestry as a practice then then i think it has to be organizational in that sense the meaning navigates this organizational practice this organizational story that that impacts",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1298.044,
    "end": 1307.412,
    "text": " not only communication between agents, but also how the environment will be interpreted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1308.793,
    "end": 1323.965,
    "text": "So in this sense, it will be transmitted and repeated over time because it has a history and cannot ignore the history of these practices being pushed further and replicated through generations, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1330.316,
    "end": 1358.031,
    "text": " the way like the villages will be organized in terms of that specific practice for instance can be understood in a meaningful and cultural way that organizes life in virtue of some specific principles that sensitizes our agents towards specific directions",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1360.874,
    "end": 1375.778,
    "text": " And I think... I don't know if you get my point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1375.998,
    "end": 1389.381,
    "text": "For instance, you can talk about... If you think about archaeological findings and how",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1391.432,
    "end": 1406.96,
    "text": " archaeological descriptions of specific villages and how they navigate mapping out these archaeological sites.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1407.44,
    "end": 1418.206,
    "text": "They usually know exactly, if you have some kind of history already from these communities, how that city would be likely to be organized.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1419.059,
    "end": 1421.2,
    "text": " First off, where is the water?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1421.641,
    "end": 1434.689,
    "text": "And if the water is in certain directions, probably there will be certain kinds of relationships with housing and communal housings, and where they're going to place their dead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1435.65,
    "end": 1443.815,
    "text": "In relation to this kind of specific organizational principle, the water is here, so plantations will be not so far away from that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1445.751,
    "end": 1468.359,
    "text": " the city organizes like the village organized a little bit in this sense and that builds up cultural practices at least archaeologically can be explained as such i thought of something similar um organization being the logistical or the operational",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1469.682,
    "end": 1496.179,
    "text": " structural aspects so those would be the roads that connect the forestry outposts or the circulatory system that connects the different organs of organization and then the culture is a cause and a consequence of organization organization is the enabling conditions for culture to arise okay so given this road network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.594,
    "end": 1499.134,
    "text": " What cultures arise?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.774,
    "end": 1502.455,
    "text": "How similar or different are they convergently?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.515,
    "end": 1507.856,
    "text": "What are their practices or their narratives that are shared amongst these different outposts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.156,
    "end": 1524.319,
    "text": "Or in the bodily example, okay, given the organization of the organs, literally the organizing process or principle, then what biosemiotics can arise with glucose and insulin and glucagon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.339,
    "end": 1547.738,
    "text": " and what culturally can arise maybe even in terms of the generative model of encultured agents as a function of organization and then what do those encultured agents do to the extent that they can modify organization and so these kinds of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.622,
    "end": 1575.446,
    "text": " unrolling cause and consequence relationships can be hard to disentangle because there's not like a clean single starting point that can be separated out or because it unfolds historically it's not exactly a reaction in a test tube",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.475,
    "end": 1584.317,
    "text": " So how does Active Inference give us an entry point into thinking about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.418,
    "end": 1597.501,
    "text": "Yeah, that's one interesting thing about Active Inference that you don't really need an origin point, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1597.541,
    "end": 1602.903,
    "text": "You can start modeling and start understanding it at any given point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1603.675,
    "end": 1608.479,
    "text": " and build up from that story and see how it unfolds over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1608.499,
    "end": 1620.628,
    "text": "I think that's the most beautiful idea that you define your parameters and then you see from that parameters that can be arbitrarily defined and you can navigate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1621.092,
    "end": 1639.506,
    "text": " engage how things change within those parameters in the generative model right when you when you have your like dynamical systems for instance you have your state space they have some specific range of defining parameters that set",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1641.142,
    "end": 1665.582,
    "text": " uh the limits of that possible states that you're going to navigate and if you use this notion that these two densities brings about in terms of bayesian modeling you can use this these kinds of tools to understand how from that specific parameters updates why what we",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1666.36,
    "end": 1690.665,
    "text": " narrate in active inference as if belief updating can change over time in these terms that's a very nice point it reminds me of bruno latour's actor network theory or ants which kind of advocates a similar approach to what you described which is like enter anywhere open-mindedly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.704,
    "end": 1704.414,
    "text": " because in an iterated modeling or iterated analysis setting, the first proposal or the first trace detected, we know that's not the whole picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.715,
    "end": 1708.258,
    "text": "There may not be a whole or only picture, so we need to enter and iterate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.838,
    "end": 1710.579,
    "text": "And then with active inference specifically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.584,
    "end": 1721.713,
    "text": " because of the compositionality that we get within a layer, collective behavior, and then also the kind of nesting smaller things inside of bigger things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.487,
    "end": 1730.791,
    "text": " We can always build something and then we can go, oh, wow, it's like there's a lot of top-down influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.392,
    "end": 1737.495,
    "text": "Maybe there's a higher order factor or slower factor or a contextual factor we should consider.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.196,
    "end": 1749.783,
    "text": "Or, oh, we were abstracting across these smaller things inside, but for a later day or if relevant, we can dive in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.983,
    "end": 1751.584,
    "text": "And so then...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.337,
    "end": 1761.001,
    "text": " It allows a light hold or a grasp on the proposed generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.342,
    "end": 1763.123,
    "text": "Obviously, it's map, not territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.883,
    "end": 1775.93,
    "text": "But even beyond that, we always know that we can expand laterally and across scales starting from anywhere in an iterated way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.043,
    "end": 1793.312,
    "text": " modeling process without our first or even 11th model being proposed as like the accounts of some complex cultural phenomena, which we're always going to only ever have our own perspectives on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.873,
    "end": 1802.557,
    "text": "Yeah, I think you don't really find that in being so all encompassing, like you have one model that will model them all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1803.445,
    "end": 1809.328,
    "text": " you can navigate those models in these more instrumental terms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1810.529,
    "end": 1827.958,
    "text": "It raises different questions when you put things like that in terms of the ontology of models and models and theories and sciences, but they can be also described as tools for grasping and describing phenomena.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1834.184,
    "end": 1841.286,
    "text": " in a more non-committal way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1843.126,
    "end": 1861.251,
    "text": "How much that smuggles in philosophical or more ontological problems, it is still, I think, under debate, but it is still a tool to bring insights",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1862.284,
    "end": 1887.681,
    "text": " to think about specific cultural collective phenomena, which is not, it's complicated to, because I think what I'm getting at, I'm kind of like going back and forth, but when you talk about social sciences and modeling, usually you have like ways of modeling agents or ways of modeling collectives and active influences trying to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1889.264,
    "end": 1898.349,
    "text": " to come up with a modeling in which you can understand agency and collectives within the same modeling schema.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1899.749,
    "end": 1910.675,
    "text": "And I think specifically for these cases, if you're interested in understanding types of cultural phenomena among language users and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1913.275,
    "end": 1931.202,
    "text": " in specific contexts, you can at least partially understand or gain some insight in this agent-collective relationship that is a little bit more interesting than we have found so far in the social sciences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1931.902,
    "end": 1939.105,
    "text": "Because you can have specific understandings of means, but then where is the agency in that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1939.925,
    "end": 1941.706,
    "text": "You lose a little bit of agency.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1943.455,
    "end": 1969.877,
    "text": " When you're trying to understand only agents, then you don't know how that kind of scales up because Active Inference tries and offers these scale-free modeling tools that facilitate this conversion into agents and collectives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1971.55,
    "end": 1983.539,
    "text": " I would be interested in asking you, actually, how do you navigate that when you talk about social phenomena in ants or termites?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1988.082,
    "end": 1999.59,
    "text": "Because then, yeah, you have very specific coding demarcations, I guess, for these social environments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2003.154,
    "end": 2005.415,
    "text": " Yeah, it's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.595,
    "end": 2023.882,
    "text": "It's also, whether it's open wounds or a dirty closet that's just shut, there's actually a lot of ambiguity and unresolved tension around, well, is the ant colony social?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.002,
    "end": 2025.543,
    "text": "Are they social insects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.414,
    "end": 2030.275,
    "text": " that reifies the nestmate as the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.475,
    "end": 2033.175,
    "text": "And then what they're doing is like when we hang out and talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.995,
    "end": 2037.956,
    "text": "So reifying the nestmate as individual makes the colony social.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.556,
    "end": 2051.079,
    "text": "But if the colony is individual, then what nestmates are doing with each other is not social any more than we would describe the liver and the kidney as having like a social single cellular interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.099,
    "end": 2052.499,
    "text": "But we know that would be missing the point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.625,
    "end": 2064.467,
    "text": " And so there definitely is a tension with some of these evolutionary lineages, like ants being monophyletically obligate eusocial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.227,
    "end": 2069.348,
    "text": "All and only ants are eusocial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.388,
    "end": 2070.648,
    "text": "They all live in the colonies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.688,
    "end": 2072.988,
    "text": "There's no free-living nestmate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.668,
    "end": 2082.71,
    "text": "Whereas other parts of the evolutionary tree, there are life histories that do look a little bit more like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.835,
    "end": 2109.554,
    "text": " social collaboration that can then dissolve and so knowing what level of lock-in makes something social when are we socializing and what level of lock-in goes beyond social and it kind of like makes when the blanket is so strong around the social that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.686,
    "end": 2118.132,
    "text": " like for multicellularity, that it's kind of losing the social feature again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.193,
    "end": 2130.882,
    "text": "Because if we just use social to mean the connective tissue or the kind of lubricant or the spaces between everything, then it means nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.123,
    "end": 2139.569,
    "text": "So a real tension is what space does the social account for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.941,
    "end": 2169.95,
    "text": " and is this going to be a concept with a lot of creep looking well it's a social relationship between the roots of the tree and the fungus and it's a social relationship amongst the molecules in the test tube is that too broad of a social conception are there downsides or are there trade-offs associated with a broader social concept",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.323,
    "end": 2173.385,
    "text": " Do we dilute what the social means?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.785,
    "end": 2182.651,
    "text": "And then on the other side, might we exclude phenomena that could importantly be considered social?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.313,
    "end": 2185.153,
    "text": "Well, that's not social.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.173,
    "end": 2186.534,
    "text": "They're just talking on a train.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.275,
    "end": 2188.776,
    "text": "It's like, well, that's the other side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.096,
    "end": 2199.284,
    "text": "If we were to have carving out encounters that we do want to include as social, and is there a true social?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.646,
    "end": 2206.611,
    "text": " Does active inference help us sidestep or at least negotiate this territory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.393,
    "end": 2226.108,
    "text": "Because we could develop a generative model or an ecosystem of shared intelligence with one person and two Internet of Things devices and a bird and a metronome and just say we made what we made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.918,
    "end": 2235.663,
    "text": " and then leave it as a second order interpretation, whether that is a social setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.626,
    "end": 2242.388,
    "text": "I mean, I think you, you are pointing out like how",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2243.573,
    "end": 2267.732,
    "text": " at the granularity of those scales right if you have a model that one-to-one to everything that you already have it's probably not interesting and not informative because you cannot like define those limits of what you're trying to understand and in the other hand when you do that when you define those limits if you're too narrow or you're gonna live out",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2268.732,
    "end": 2270.753,
    "text": " you're gonna idealize also in a way, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2270.793,
    "end": 2274.555,
    "text": "And leave out many other parts of the system that you're interested in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2275.976,
    "end": 2295.767,
    "text": "But if you don't do that, if you don't make this decision when modeling anything, then how you can have any access to the phenomenon, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2296.781,
    "end": 2305.583,
    "text": " And to connect this to the forestry, so in the forestry example, the Deserata was lumber.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.434,
    "end": 2315.541,
    "text": " Now, that may have been a very narrowly scoped desire, but it's a relevant thing to want this resource.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.242,
    "end": 2333.535,
    "text": "And then industrialization, science as a process, professionalization, those allow the description and the handling and ultimately the kind of top-down legibility and control, thinking like a forestry company.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.535,
    "end": 2334.676,
    "text": "Now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.535,
    "end": 2359.217,
    "text": " with respect to the social sciences by analogy to forestry science so now we're entering an era of increased legibility and control of social systems and human natural capital and attention as a resource trust as a resource in a way is being cropped",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.016,
    "end": 2366.639,
    "text": " analogous to produce the content of lumber, but now there are social contents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.679,
    "end": 2390.272,
    "text": "So as the social goes from being just only simply the water we swim in, not something that's even compared counterfactually to alternative cultural possibilities per se, but falls under the scope of the professional management like forestry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.046,
    "end": 2419.836,
    "text": " then that's when this discussion of well what's the lumber and what is the weeds that are being pruned and what ecosystem services when we pay attention to certain parts of human social culture and when we seek to make more of this kind of lumber what else does that come along with and what decisions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.389,
    "end": 2428.227,
    "text": " come into play and that comes along when you see the process",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2458.519,
    "end": 2476.568,
    "text": " Or Instagram, I don't know, Twitter after what happened to Twitter, but, um, but yeah, in terms of attention, uh, pruning, you do have that very effectively already happening already.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2476.588,
    "end": 2487.113,
    "text": "You can see how that happens efficiently in the world, in elections, for instance, it can be very, very easily manipulated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2487.694,
    "end": 2512.271,
    "text": " we saw what happened in elections for instance in brazil or in the us and well all over uh you navigate a system of uh attention organization that selects in only what he thinks that you're interested in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2515.242,
    "end": 2529.77,
    "text": " And the effect of that in terms of decision-making and in terms of trust, in terms of diversity of discourse, we have seen that it can be devastating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2531.911,
    "end": 2540.076,
    "text": "So the question would be like, how can you make this a little bit, how can you use active inference and these tools that we have?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2541.61,
    "end": 2567.471,
    "text": " to make this kind of technology a little bit more inclusive without being super disruptive is it even like a possibility i i really don't know i think it's an ethical problem that we have when we talk about social systems and these principles of attention exclusion leaving things out",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2576.513,
    "end": 2578.455,
    "text": " A lot to say on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.976,
    "end": 2598.514,
    "text": "With modeling and interpolating and models, whether it's large language model type or linear regression type, it is able to interpolate, to put data points within an enclosure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.927,
    "end": 2622.416,
    "text": " what has already been described and bayesian statistics and other types of prediction algorithms are not immune to that either if we have some prior distribution belief we believe it's possible for it to be between 20 and 30 degrees outside then when we get data inside of our bounds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.204,
    "end": 2652.375,
    "text": " we can converge and that actually tightens our beliefs not always a bad thing of course and then outside of the scope of the possible those data are just seen as noise and they may not even be integrated so then that can lead to a reinforcing process not necessarily an adaptive one either where information that's confirmatory is used to ratchet and increase precision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.43,
    "end": 2659.352,
    "text": " And then information that is not confirmatory is discarded as not useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.773,
    "end": 2673.297,
    "text": "In this case, it doesn't even enter the landscape of attention of the user.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2673.317,
    "end": 2679.639,
    "text": "What I was thinking",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2683.351,
    "end": 2710.511,
    "text": " in relation to this idea of forestry is because we have now organizational principles that are faster and more populated with information and attention grabbing kinds of prompts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2712.768,
    "end": 2733.17,
    "text": " we transformed the same, we transformed the same principle into a harder to grasp",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2734.363,
    "end": 2760.696,
    "text": " process it's it's hard it becomes more complex it becomes harder to describe this the process of understanding that in terms of forestry is kind of way more grounded when you apply that socially to this kind of environment that you we're talking uh like internet or just highly uh volatile uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2764.456,
    "end": 2772.262,
    "text": " and virtual, in principle, environments, it becomes much harder to assess what is being pruned out or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2772.903,
    "end": 2773.643,
    "text": "You just don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2773.984,
    "end": 2782.29,
    "text": "It makes it more clear that there is a process of pruning and you have no control of what is being taken out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2783.351,
    "end": 2789.877,
    "text": "You have no idea what's being left away from your perspective of attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2792.952,
    "end": 2803.576,
    "text": " So to this topic of intended or unintended semantic pruning, I think this has helped me identify a tension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.716,
    "end": 2820.122,
    "text": "If we want to talk about the semantics or semiotics, biosemantics, whatever we want to call it, of the letter E in relationship to letter A, we're looking for an account that might convey letterness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2821.024,
    "end": 2842.387,
    "text": " but we're generalized above enos or anus so in some ways we've erased or abstractly generalized away from the particulars of the sign's meaning by taking a semiotic perspective and so it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.663,
    "end": 2870.299,
    "text": " We got into the game to have a semantic account of biological phenomena or of any phenomena for a biological entity, yet this process, in a sense, distances us from the particulars that actually do grant it that meaning in the actuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.087,
    "end": 2877.212,
    "text": " Like if we walk into a sacred space and it's like, oh, well that is just doing that over there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.252,
    "end": 2878.934,
    "text": "And this architecture is doing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.774,
    "end": 2882.717,
    "text": "And because of the layout, people must use the room this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.859,
    "end": 2899.311,
    "text": "That's removed from the actual meaning, which is the cause and consequence with the organization and culture that we discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.916,
    "end": 2907.16,
    "text": " But that prima facie account doesn't generalize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.12,
    "end": 2920.648,
    "text": "Yet any generalization that we make so that we can talk about multiple places or multiple letters on a common accounting framework is going to remove those particularities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.03,
    "end": 2929.113,
    "text": "So it's a very challenging catch-22 whether we want to really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.532,
    "end": 2949.493,
    "text": " account for the n equals one and maybe even live and act and play and work in the n equals one versus develop something that might be satisfying and cut and dry but it's always going to be on the sidelines with respect to what it actually means",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.617,
    "end": 2977.645,
    "text": " what do you mean like is i don't understand what you what are you getting at like is it you mean like it's generalized or not generalized it i didn't get that like when we have a general when we generalize when we ask what words mean what what words mean beyond any given word we've lost touch with what any given word means",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.503,
    "end": 2984.824,
    "text": " but words are what they actually mean in a situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.665,
    "end": 3007.711,
    "text": "So it's just in this scientific approach to meaning, semiotics and semantics, we have these two tensions or a tension to reconcile between actually giving an account of the meaningfulness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.21,
    "end": 3033.692,
    "text": " of the specific thing versus taking a more scientific approach which would be gathering a group of similar things and finding their shared attributes which out of necessity must abstract must crop out features that are are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.09,
    "end": 3039.773,
    "text": " empirically or anecdotally taken to not matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.354,
    "end": 3048.599,
    "text": "Like we abstract, whether it was a Monday or Tuesday that we did the experiments, we just combine all of our replicates together when we do the scientific analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.59,
    "end": 3078.699,
    "text": " you mean you mean if you generalize the practice you lose what you being if you generalize it too much you lose everything that's meaningful to you in terms of like for you formalize it and then you have no yeah you you have an empty semantics you have a semantics with no meaning that can only be meaningful in terms of how you apply that in terms of specific practices",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3079.266,
    "end": 3079.446,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.486,
    "end": 3085.892,
    "text": "It's like, I have a framework for, you know, the formal meaning of letters within words, within sentences, within paragraphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.972,
    "end": 3091.476,
    "text": "And then it's like, well, but now what's your next N equals one word that you're actually going to bring?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.138,
    "end": 3106.389,
    "text": "It's not just about building some abstract scaffold for bigger and bigger boulders of meaning at some point through our embodied thought and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.777,
    "end": 3111.879,
    "text": " in our experience, it is gonna come down into the particulars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.74,
    "end": 3122.044,
    "text": "And it doesn't immediately seem clear that simply generalizing further brings us there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.146,
    "end": 3130.549,
    "text": "Yeah, I particularly don't, I don't really believe you can have that kind of generalization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3130.589,
    "end": 3135.192,
    "text": "I think we attempt to build whatever",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3136.411,
    "end": 3148.913,
    "text": " What I see that's the interesting aspect of the formal thematics, you try to build this more general understanding that's just formalizes to model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3149.253,
    "end": 3155.995,
    "text": "But for that to be meaningful, it has to be embedded in a way of practicing it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3156.115,
    "end": 3163.396,
    "text": "Like in a forestry practice, you have to be embedded in a cultural environment in which that can be actually",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3164.974,
    "end": 3190.364,
    "text": " uh observed in terms of what happens when a generative model is being updated or not is that what you mean because otherwise i don't really understand how it becomes too yeah it becomes too formal it becomes too abstract in terms of some i would not understand what that is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3196.042,
    "end": 3222.704,
    "text": " i'll think of a little more um brian or tj do you want to add any thoughts or questions hey yeah sorry i i think like i don't have a lot of context i've been like following some of the discussion but not attended a lot of these calls i'm like it's all good yeah um yeah i don't know uh i think um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.929,
    "end": 3253.808,
    "text": " Yeah, I'm in general just sort of interested in trying to understand the relationship between yeah, like sorts of like constructionist epistemologies and yeah, like generative models and active inference style stuff and how active inference style like, yeah, what are the philosophical commitments that active inference involves with respect to knowledge and epistemology and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3254.52,
    "end": 3266.989,
    "text": " there's a sense in which like rational choice models often assume a certain sort of like, um, objectivity to beliefs and then desires are where most of the degrees of freedom lie or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3267.87,
    "end": 3282.261,
    "text": "Um, whereas there's a lot of like issue, like there's a lot of things that come up once you start talking about reflexivities where concepts themselves become self-fulfilling prophecies, uh, what you believe about what your beliefs about society,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3282.99,
    "end": 3284.711,
    "text": " ends up shaping the society itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.751,
    "end": 3291.477,
    "text": "So there's a sense in which there's this co-dependence between the object of knowledge and knowledge about that object itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3291.697,
    "end": 3304.466,
    "text": "And I think, yeah, I'm sort of interested in how the active entrance ways of thinking about this offers what perspectives on those questions and stuff like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.707,
    "end": 3304.947,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.569,
    "end": 3307.989,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.269,
    "end": 3309.71,
    "text": "Great questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.312,
    "end": 3311.532,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3312.56,
    "end": 3340.948,
    "text": " So when you talk about the object of knowledge and the knowledge itself and active inference, I think you can think of in terms of this, well, there's a few ways to think about that, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3344.073,
    "end": 3360.022,
    "text": " uh the knowledge itself it has to come epistemically from where your agent is actually embedded and situated specifically in active inference it's embodied it kind of needs to have a model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3361.768,
    "end": 3376.921,
    "text": " the model is modeling a body, it's modeling a body that is in the world and it's all the time situated, it's never disconnected to its environment and the history of that environment, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3377.721,
    "end": 3379.663,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3381.584,
    "end": 3388.17,
    "text": "But if you think, if you push that to the object of that knowledge, I don't know how different,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3396.312,
    "end": 3401.334,
    "text": " How can you differentiate that so sharply when you talk about active inference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3403.234,
    "end": 3417.298,
    "text": "Because if you think of, in terms of a generative model, what will be updated is updated from a prior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3418.154,
    "end": 3425.019,
    "text": " that is always directed in this body, in this situated realm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3426.48,
    "end": 3445.935,
    "text": "So they sort of conflate, as I see, maybe I'm mistaken, but they sort of conflate in how you're going to update your generative model, which will be at the same time, what you know and the object of this knowledge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3447.463,
    "end": 3452.045,
    "text": " So I, sorry, if I can just like, uh, raise a question to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3452.545,
    "end": 3452.745,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3452.825,
    "end": 3476.114,
    "text": "So I think like, I think that there is a sense in which like, with respect to something that in epistemology would be called self-knowledge, there is, there is a question here that the, the active inference agent has this model of that is like situated in the body or like in, in it's like, um, like structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.986,
    "end": 3479.047,
    "text": " and is also modeling that structure itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3479.207,
    "end": 3491.092,
    "text": "And there is this issue of where the belief is not unidirectionally dependent on the object sort of a thing, but has this feedback loop thing, comes up there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3491.832,
    "end": 3503.997,
    "text": "But there's another way in which I think where this sort of thing comes, where even if the object is outside of the body of the knowledge, I think that could still come up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3504.017,
    "end": 3505.918,
    "text": "So for instance, if I...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3506.856,
    "end": 3535.694,
    "text": " if an active inference agent lives in a society of other active inference agents where currently all of them defect on Prisoner's Dilemma, but maybe on further reflection they would want to... Again, I don't know what further reflection would mean in the active inference sense, but I'm just saying in the intuitive sense, what would it mean for them to go from one fixed point to another fixed point where they're all cooperating or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3536.354,
    "end": 3537.554,
    "text": " or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3537.774,
    "end": 3562.801,
    "text": "And that, I think, is not clear to me, like how that shift can happen in active inference, where it's not just purely using the empirical information to keep running the middle of your free energy equation, but also recognizing the contingencies",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3563.786,
    "end": 3570.511,
    "text": " and then identifying those contingencies to make something like shifts from one state to another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3570.971,
    "end": 3580.578,
    "text": "Like, if I model that the society is a cruel space, and if everyone models the society as a cruel space, then we will end up creating a society that is a cruel space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3581.278,
    "end": 3591.205,
    "text": "But if only we could recognize that our belief or our model that society is a cruel space is a contingent belief, and we could all somehow negotiate or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3591.809,
    "end": 3619.308,
    "text": " communicate and shift to a different belief about what society is and society is a kind place then we will end up creating that kinder society or something and that sort of like a belief about the thing that society is it's not entirely within the agent like it's sort of it it it has a weird intersubjective character so it's not entirely outside of the agent either",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.807,
    "end": 3623.95,
    "text": " But it's not entirely internal to the agent either or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.111,
    "end": 3625.391,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3625.711,
    "end": 3626.952,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3628.513,
    "end": 3629.354,
    "text": "You can think of that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3629.434,
    "end": 3630.895,
    "text": "You're talking about active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3631.015,
    "end": 3633.877,
    "text": "Action comes first, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3634.438,
    "end": 3640.823,
    "text": "You don't have the knowledge inside your head waiting for you to push that out of the way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3641.123,
    "end": 3642.584,
    "text": "Action has to come first.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3643.084,
    "end": 3643.525,
    "text": "So if you...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3645.618,
    "end": 3652.081,
    "text": " If you take that as a principle, an organizing principle, it depends on the contingency of your actions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3652.481,
    "end": 3660.185,
    "text": "The possibilities might be limited by your situated condition, but they are limited.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3660.605,
    "end": 3661.586,
    "text": "It doesn't mean that you don't have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3662.944,
    "end": 3667.965,
    "text": " a range of options from that state space in which you can navigate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3668.025,
    "end": 3676.327,
    "text": "So you can navigate it for the good or for the bad, but it starts with the action perception loop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3676.387,
    "end": 3677.587,
    "text": "It starts with the action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3677.607,
    "end": 3682.928,
    "text": "I'll add a few other pieces on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.948,
    "end": 3684.829,
    "text": "TJ, very good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.949,
    "end": 3691.23,
    "text": "When we see the pragmatic component of action as self-fulfilling,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.058,
    "end": 3716.543,
    "text": " epistemic component of action having to do with gaining knowledge and the salience of information but the pragmatic component is about bringing our observations into alignment with our preferences and then you identified two related settings one of them is like pure intra subjectivity like i expect myself or i find myself or i habitually think about x",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.463,
    "end": 3724.209,
    "text": " Well, that's kind of a trivial self-fulfillment because thinking about something is its own fulfillment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.23,
    "end": 3734.719,
    "text": "And then when we're in this second person or social space, we can agree on little performance art or on a game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.72,
    "end": 3748.248,
    "text": " And games give evidence to that, that when people are able to perform communication or message passing such that new expectations or preferences are set,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.79,
    "end": 3759.618,
    "text": " whether more top-down-like, more seeing like a state, or more laterally, more like collective behavior, then those regimes can be embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.439,
    "end": 3768.465,
    "text": "And then you brought up a very important point about the awareness of the contingencies or awarenesses of adjacent possibles or of counterfactuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3769.326,
    "end": 3782.15,
    "text": " So the body might be, we could model its morphology as doing some computation, but that doesn't mean that the morphology has an awareness or can explore a counterfactual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.17,
    "end": 3787.352,
    "text": "Like bodies are not always exploring every counterfactual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.607,
    "end": 3803.89,
    "text": " um because skin is in the game but again mentally it's very cheap and easy to consider counterfactuals and situational awareness of social settings especially if it can be not understood but communicated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.265,
    "end": 3808.447,
    "text": " opens up a space where we're all playing prisoner's dilemma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.467,
    "end": 3818.233,
    "text": "Now there's parameterizations of multi-agent prisoner's dilemma where tragically we just all defect all day and never learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.154,
    "end": 3824.017,
    "text": "There's also parameterizations where you just start all cooperating and never defect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.943,
    "end": 3852.265,
    "text": " and then the interesting settings are where there might be like phase transitions or where a perturbation moves the system from one attractor into another attractor so there's just a lot of richness and that's the work of building generative models in that iterated modeling process to unpack and refine and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.527,
    "end": 3856.689,
    "text": " Active Inference isn't going to have a stance on the Prisoner's Dilemma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.63,
    "end": 3866.737,
    "text": "We can use Active Inference to describe the Prisoner's Dilemma, but Active Inference isn't going to come down on literally even a little 2x2 game theory matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.557,
    "end": 3882.268,
    "text": "So we can then extrapolate that Active Inference is not going to come down with an opinion on something significantly more rich and real than a 2x2 game theory matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.564,
    "end": 3892.326,
    "text": " And so that work is what people enact in applying active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.586,
    "end": 3897.946,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3898.247,
    "end": 3912.449,
    "text": "And I think my question is something like, but insofar as humans try to constantly improve their social games, how can we model that sort of approach?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3912.901,
    "end": 3923.907,
    "text": " prior or your actions or policies, uh, that enables that sort of like progressive, um, um, improvement or something?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3925.428,
    "end": 3931.651,
    "text": "Well, you can, we're assuming that we're trying to improve, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3931.691,
    "end": 3936.254,
    "text": "We, we, we don't know that, but you can model them as improving, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3937.113,
    "end": 3943.576,
    "text": " Like following Daniel's lead, you were talking about this specific games and contingencies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3943.596,
    "end": 3959.122,
    "text": "They, they, they, they, this, this transitions from one state to another specifically, if you're talking about this modeling of social actors and talking about several actors, if your model involves several of them will not be really linear, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3959.142,
    "end": 3963.224,
    "text": "You don't have like a easy, smooth transition of improvement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3963.904,
    "end": 3965.625,
    "text": "You can capture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3966.681,
    "end": 3983.374,
    "text": " over time as modeling, how they might tend to go towards a direction and understand that as improvement, but that takes specific iterations that will not be fully linear, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3984.437,
    "end": 3996.66,
    "text": " specifically if you want to understand error and improvement instead of trial and error, but trial and adding up into this error, like error improvement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3998.021,
    "end": 4005.143,
    "text": "But when you're modeling specifically with dynamical systems, for instance, you're not going to see a full linear story.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4005.843,
    "end": 4013.005,
    "text": "And I don't think you're going to see that if you're modeling using active inference and multiple agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4016.611,
    "end": 4041.839,
    "text": " i'll add one piece there so how can we go about modeling multi-scale social goals so we could think about you know different citizens in a region and they the modeler is going to choose what knowledge to realize in the generative model like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.274,
    "end": 4046.056,
    "text": " what you put into the calculator, it's going to calculate upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.716,
    "end": 4062.025,
    "text": "Now, this happens to be a elaborate stochastic method, but if we only tell people, yeah, there's just your personal income, optimize for that, your preference is to have that be higher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.606,
    "end": 4065.067,
    "text": "Well, then the simulation is gonna unfold a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4065.828,
    "end": 4072.552,
    "text": "If we say, well, there's your personal financial income, and then there's your city, and then there's your region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.917,
    "end": 4100.966,
    "text": " then that opens up through through different um mechanisms you know maybe an individual goes flat or neutral on the personal in service of a larger win at a higher level well now what if the modeler says it's not just about the financial income now we're also going to have this secondary criterion well now different agents could attend differently to those two different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.374,
    "end": 4103.595,
    "text": " outcome variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.855,
    "end": 4110.157,
    "text": "And maybe there's one simulation where 50% only care about this and 50% care about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4110.517,
    "end": 4112.378,
    "text": "And it works perfect, or doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.159,
    "end": 4126.463,
    "text": "It's like a broad surveying, you know, or Lego set or, or grammar, or, or active inference ontology for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4128.24,
    "end": 4153.188,
    "text": " scoping very broadly and very inclusively but all the work is in the real simulation developments and sweeping because very little could be said about a game theory game if you didn't know what the parameters were in the matrix",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.384,
    "end": 4178.313,
    "text": " wouldn't know whether this prisoner's dilemma was going to be like an always cooperate or which agents with which strategies would or wouldn't cooperate if you don't know what the matrix looks like so before the values have kind of been filled in it's just like actually describing the adjacencies and the counterfactuals and the contingencies of our scientific model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.984,
    "end": 4184.806,
    "text": " but that's still prior to having the model in hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.907,
    "end": 4193.771,
    "text": "And the model, you know, so now we're looking at that tree in the European forest and it's like, well, if I had this tool, then I could cut it down this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.831,
    "end": 4196.292,
    "text": "If I had this tool, I could cut it down this way, or I could wait.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.432,
    "end": 4203.636,
    "text": "It's like, that's alternative actions about that tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.617,
    "end": 4206.038,
    "text": "Now in the social science setting,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.202,
    "end": 4214.327,
    "text": " discussion of different scientific methodologies are like counterfactuals about that social tree",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.872,
    "end": 4247.453,
    "text": " Yeah, and specifically if you're navigating these kinds of game theoretical models, if that's what you're interested in, you can even define in terms of prisoner's dilemma, for instance, specific values to see what happens when everybody",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4250.734,
    "end": 4280.229,
    "text": " deflects and in how frequent and modulate those frequencies in terms of specific uh in multiple iterations how how how are you gonna build up the weight or the tendency of deflecting again if your neighbor deflected once and deflected twice or three times or and see how that will accommodate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4282.153,
    "end": 4288.295,
    "text": " over time, how many times this agent will change its behavior until it stops changing the behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4289.956,
    "end": 4304.161,
    "text": "But you don't really... That again, you might use a Bayesian understanding, a Bayesian model for that, but it's not necessarily explained.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4311.152,
    "end": 4314.334,
    "text": " It does not necessarily explain the action fully.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4314.354,
    "end": 4317.175,
    "text": "I mean, socially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4318.596,
    "end": 4321.418,
    "text": "You're modeling only the interest of that specific actor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4321.438,
    "end": 4329.683,
    "text": "I have a slightly meta question, if I can ask both of you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4329.703,
    "end": 4332.984,
    "text": "I'm not sure how these calls usually go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4334.306,
    "end": 4337.827,
    "text": " I'm curious, what are your interests in active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4337.867,
    "end": 4340.728,
    "text": "What do you think, like, what brings you to active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4340.788,
    "end": 4347.65,
    "text": "And, like, what do you think active inference adds to our theoretical understanding and in what ways or something?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.67,
    "end": 4351.011,
    "text": "All right, Nick, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4354.172,
    "end": 4360.914,
    "text": "Well, I think I was trying to touch upon that before and how we can...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4362.453,
    "end": 4377.46,
    "text": " If you're navigating, for instance, behavior in terms of game theory, this kind of modeling, if you're talking about like trust games, for instance, you're going to understand how these duadic interactions evolve over time, specifically over interactions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4378.34,
    "end": 4384.743,
    "text": "But you don't have an account of change because you have very limited options of actions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4385.984,
    "end": 4386.124,
    "text": "And",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4388.382,
    "end": 4417.383,
    "text": " You don't have an account also on scales, and I think active inference tries to add a little bit an account on how you can scale that and how you can add more parameters into the game and see how they evolve with a more clear understanding, with a richer understanding that, for instance, when you talk about specific interactions in game theory,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4419.983,
    "end": 4426.427,
    "text": " So that's one aspect that active influence kind of contributes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4427.028,
    "end": 4439.916,
    "text": "Another point is because we have this parameterization that is specifically in terms of belief updating and also in terms of dynamics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4442.267,
    "end": 4461.498,
    "text": " We are always talking about agents that will be situated and embodied and have a very specific synchronization with the environment all the time, because when you talk about active inference, the action comes always first.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4462.179,
    "end": 4465.881,
    "text": "So you try to have a less reductive model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4469.887,
    "end": 4473.049,
    "text": " model cultural agents and collective action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4473.65,
    "end": 4475.171,
    "text": "I think that's kind of desirable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4475.491,
    "end": 4476.552,
    "text": "That's what you're looking for.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4478.793,
    "end": 4480.274,
    "text": "Is it also your area of interest?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4481.335,
    "end": 4481.635,
    "text": "Sorry?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4482.296,
    "end": 4483.797,
    "text": "Is it also your area of interest?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4487.92,
    "end": 4490.101,
    "text": "Mine or is that Lorena's area of interest?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.121,
    "end": 4490.622,
    "text": "Lorena's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4492.443,
    "end": 4492.963,
    "text": "What do you mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4494.004,
    "end": 4494.604,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4494.624,
    "end": 4496.346,
    "text": "My question was also what brings you to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4497.648,
    "end": 4508.112,
    "text": " active inference, and I think you answered a lot of ways in which active inference adds theoretical value, but I wasn't sure if that was also your subjective interest or motivation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4508.332,
    "end": 4509.412,
    "text": "It's my subjective interest.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4510.112,
    "end": 4513.033,
    "text": "Yeah, I'm curious to see how that pans out, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4513.614,
    "end": 4523.237,
    "text": "I'm interested in how that helps us to think of this type of phenomena.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4524.477,
    "end": 4526.018,
    "text": "And I'm very interested in how",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4526.926,
    "end": 4530.909,
    "text": " this relationship from agents to collectives and back again work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4531.269,
    "end": 4545.459,
    "text": "And I think it might give us some, well, it gives us some very insightful way of modeling these relationships.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4549.662,
    "end": 4555.887,
    "text": "And navigating is as you want because this feature of being scale-free is kind of helpful in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4557.335,
    "end": 4566.709,
    "text": " to looking things you can you can define your uh mark of blanket in terms of are you interested right and see what happens",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4572.025,
    "end": 4599.145,
    "text": " don't know yeah i'll i'll just give a few thoughts even though also surely some of these thoughts are are scattered um you asked dj what does active inference add to our theoretical accounts of the social it does many things in in my view and that's what makes it so valuable epistemically and pragmatically it gives us the expressivity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.58,
    "end": 4605.544,
    "text": " within a scale to describe collective behavior and across scales to describe nested systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.124,
    "end": 4607.925,
    "text": "So that brings continuity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.979,
    "end": 4632.072,
    "text": " to discussions of the social with broader discussions of the biological ecological computational physical and so on so that's a multi-scale transdisciplinary element active inference provides us with legible first principles which can either be taken instrumentally as just heuristics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.608,
    "end": 4642.896,
    "text": " And also in certain situations can be viewed empirically as justifiable first principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.637,
    "end": 4654.387,
    "text": "And then from those legible first principles, which are not English specific, they're already in a space that has a lot more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.659,
    "end": 4683.998,
    "text": " possibility and promise than for example a mere enumeration of important adjectives or nouns we can develop lists of important adjectives and nouns when we have a broader cognitive modeling framework and so this methodological turn then supports just a tremendous diversity of thought and work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4685.808,
    "end": 4700.074,
    "text": " instead of asking us to kind of go through the eye of the needle and get on board with this one ranking of features and then try to apply it more broadly, that's like an overfit before the cart situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4700.734,
    "end": 4714.4,
    "text": "With Act-Inf, we can expand the methodological discussion, connect it to theoretical physics and mathematics in ways that really haven't been seen before, and then that opens up more than it closes down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.476,
    "end": 4743.312,
    "text": " it brings up more questions than it resolves in and of itself but it opens the questions that can be resolved like what generative model can i make that will keep the temperature in this building livable but active inference isn't going to have a stance on what you should do for that building so we need to in a way take a step in the methodological direction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4744.997,
    "end": 4752.479,
    "text": " which I see as moving towards active inference to enable a million steps in different directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4757.621,
    "end": 4759.001,
    "text": "I have a bunch of questions here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4760.902,
    "end": 4764.443,
    "text": "I think one is probably just a reference question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4765.423,
    "end": 4772.906,
    "text": "The three topics that I'll say, if you guys have any papers or articles on those things, I would love to like get a reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4773.666,
    "end": 4774.046,
    "text": "One is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4776.01,
    "end": 4787.819,
    "text": " In what ways can we model a collection or an aggregation of active inference agents as a super agent or active inference super agent or something?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4788.419,
    "end": 4795.365,
    "text": "And how does this decomposition and aggregation flexibility work in different contexts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4795.485,
    "end": 4803.671,
    "text": "If there's work that tries to either make informal commentary or formal modeling either ways,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.454,
    "end": 4805.755,
    "text": " I would love to see that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4805.975,
    "end": 4817.422,
    "text": "Secondly, just on the first check out the previous section of this course on collective behavior, where I reviewed many such works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.342,
    "end": 4818.582,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4818.682,
    "end": 4819.003,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4819.023,
    "end": 4819.983,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4820.283,
    "end": 4821.264,
    "text": "Is it on the same notion?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4822.287,
    "end": 4824.228,
    "text": " Is it linked from the same notion thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4824.388,
    "end": 4828.751,
    "text": "All in the same places and in the same playlist with this course, same syllabus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.131,
    "end": 4829.331,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.672,
    "end": 4829.992,
    "text": "Got it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4830.312,
    "end": 4830.572,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4831.993,
    "end": 4851.185,
    "text": "The second is, is there an active inference account of, say, markets or economic interaction wherein your prices act as some sorts of information signals and can use active inference to then talk about aggregation in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4852.239,
    "end": 4853.78,
    "text": " of market entities or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4854.34,
    "end": 4857.101,
    "text": "I'm guessing this would also be covered in the same list.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4857.641,
    "end": 4867.744,
    "text": "Indeed, people have explored cognitive economics and people are working on it, but that doesn't mean it's a done deal, theoretically, or especially in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.484,
    "end": 4869.904,
    "text": "So, keep going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4871.185,
    "end": 4874.406,
    "text": "It's quite experimental still, but there are a bunch of people working on that, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4875.746,
    "end": 4880.448,
    "text": "I don't remember any specific paper right now, but I can look it up and...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4882.503,
    "end": 4898.73,
    "text": " forward to you but yeah yeah it would be great uh i can drop my email address here yeah sure uh the third is probably more trickier than both of these which is is there an active entrance account of natural language um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4901.021,
    "end": 4922.223,
    "text": " yes thankfully colleagues like elliot murphy and others have explored specifically the linguistic aspects of natural speech i think lorena's lecture and area of focus generalizes a bit beyond specific",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.484,
    "end": 4942.478,
    "text": " natural language because we're talking about semiotics and semantics in a more intermodal sense however yes there's been limited work from a computational linguistics and neurobiology perspective on speech okay so then uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4948.772,
    "end": 4956.415,
    "text": " Okay, so you said something like first principles stuff when you're making a commentary on what active inference brings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4957.415,
    "end": 4960.537,
    "text": "I'm still often struggling, what is active inference offering?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4960.597,
    "end": 4962.938,
    "text": "And I try to encounter different things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4963.058,
    "end": 4971.181,
    "text": "I think I enjoy a lot of philosophical questions that the conversation opens up, but I'm still very ambivalent about the theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4972.781,
    "end": 4974.422,
    "text": "And when I read this new book,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4975.468,
    "end": 4979.871,
    "text": " which Friston has not written, but is a co-author.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4979.951,
    "end": 4982.833,
    "text": "I don't remember what's the name of the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4986.016,
    "end": 4987.197,
    "text": "Yeah, I don't exactly remember.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4987.217,
    "end": 5001.809,
    "text": "There's a book, right, which is supposedly supposed to be the canon, and Friston is a co-author, but in the preface he says... So that's the 2022 Parr, Friston, Pizzulo textbook?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5001.969,
    "end": 5002.469,
    "text": "Right, Parr.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.27,
    "end": 5003.61,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5005.037,
    "end": 5012.422,
    "text": " I wouldn't quite say it's the canon since it's a short book, but certainly it is a landmark moment for the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5013.903,
    "end": 5014.203,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5014.363,
    "end": 5027.971,
    "text": "And when I read that, the one thing that bothered me was it brings up the Helmer's free energy thing, but it sort of argues it by fiat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5028.291,
    "end": 5030.893,
    "text": "Like, okay, this is a simple principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5031.033,
    "end": 5032.434,
    "text": "It can model a lot of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5033.106,
    "end": 5037.95,
    "text": " But that doesn't tell me why I should trust it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5038.27,
    "end": 5040.852,
    "text": "What is the reason to act?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5041.013,
    "end": 5044.195,
    "text": "Why does this principle lead to cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5046.297,
    "end": 5057.046,
    "text": "Sure, you've posited a very simple principle and then said, hey, look, this simple principle can explain so many things, but it can also explain things that don't look like cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5057.326,
    "end": 5060.969,
    "text": "I'm not sure there's an",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5061.491,
    "end": 5068.394,
    "text": " I got an account of why that principle works or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5068.414,
    "end": 5071.176,
    "text": "Lorena, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.256,
    "end": 5072.837,
    "text": "I'll think of some other ways to say it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.297,
    "end": 5079.34,
    "text": "Yeah, you can think of modeling by construction and modeling by first principles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5079.7,
    "end": 5088.884,
    "text": "And if modeling by first principles, you have some limitations in which you cannot fully explain some things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5091.383,
    "end": 5108.538,
    "text": " the virtue of the model and how the first principle organizes everything that comes along with the model usually might be sufficient or might be a useful tool to help you explain that phenomenon based on the first principle that you were bringing along.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5109.759,
    "end": 5114.223,
    "text": "And that's one part of answering this question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5114.283,
    "end": 5117.906,
    "text": "I think it might be a big question for the field.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5120.071,
    "end": 5124.125,
    "text": " Yeah, here's some short little threads on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.526,
    "end": 5152.153,
    "text": " yeah we can describe maladaptive cognitive systems or adaptive cognitive systems whether something's adaptive or not is always in relationship to its niche like the foraging algorithm that works in the desert doesn't necessarily work in the rainforest so these systems are not like intrinsically adaptive or not we want to have natural language that allows sentences that are valid and invalid",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5152.953,
    "end": 5167.653,
    "text": " and have different kinds of semantics so again this is just an expressivity framework that enables people to build cognitive models of high reliability or important settings or you could make something that looks just like a beautiful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5168.314,
    "end": 5190.193,
    "text": " circuit board and not even worry about what the outcome is so so yeah for sure you can describe all kinds of systems that would be like um having a uh less than functional methodological system if we said well we're doing a linear regression framework but we only want positive regressions it's like well no at the methodological level we want it to be able to do any slope",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5190.894,
    "end": 5217.65,
    "text": " so here in the cognitive modeling setting we want more expressivity so that we can actually construct the ones that we're interested in and then how does this really do cognition how is it that a first principles like surprise minimization or the bounding of surprise through free energy how can that really cover so many cognitive phenomena",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5219.124,
    "end": 5228.932,
    "text": " That's the question and the play, but how is it that Newton's laws of motion can describe so many objects being dropped off a tower?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5230.973,
    "end": 5237.938,
    "text": "How is it that Bayesian mechanics can describe so many different priors being updated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5239.28,
    "end": 5246.145,
    "text": "And so by understanding cognitive paths as paths of least action, which is the free energy principle,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.751,
    "end": 5256.916,
    "text": " a wide variety of models become of a of a similar kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5258.437,
    "end": 5268.903,
    "text": "Now, whether that's useful to a given person in a given setting, like if you make an active inference model of your business, it doesn't mean you're going to succeed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.343,
    "end": 5272.865,
    "text": "If you make a self driving car with active inference, it doesn't mean it's gonna work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5273.845,
    "end": 5276.107,
    "text": "This isn't a guarantee of success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5277.68,
    "end": 5306.503,
    "text": " it's a method that can be utilized and we know that the method reaches different kinds of modeling outcomes and supports subsequent perspectives and models from where it reaches but we can't a priori limit where the method reaches to like only the successful ones or only biological systems then we wouldn't even have the expressivity to talk about cognitive ecosystems with synthetic intelligences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5310.205,
    "end": 5323.548,
    "text": " And when you're talking about cognition also, we can use this kind of first principles to model aspects of cognition, but you might not necessarily think that cognition is all encompassing like that everywhere, all the same.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5324.148,
    "end": 5330.77,
    "text": "But you can use that to model specific things that you're interested in, in cognitive behavior, like adaptivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5331.29,
    "end": 5335.951,
    "text": "Does it give me any insight to understand what is adaptive behavior, for instance?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5337.205,
    "end": 5339.466,
    "text": " And which kind of insights do I get?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5339.726,
    "end": 5340.766,
    "text": "Are they interesting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5340.826,
    "end": 5341.446,
    "text": "Are they useful?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5341.687,
    "end": 5346.848,
    "text": "So that's what the availability that this kind of model bring along.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5347.448,
    "end": 5357.552,
    "text": "So you don't have to believe in the whole story, but it gives you a lot of leverage to ask questions and what kind of questions you will be asking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5362.053,
    "end": 5363.334,
    "text": "Okay, so let's say that like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5364.393,
    "end": 5391.45,
    "text": " like active inference and free energy allows me to talk about systems but does it give also give me vocabulary to then classify those systems in terms of let's say adaptivity would be one property but like there could be other properties in terms of like how much how rich the world model is or stuff like that or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5392.233,
    "end": 5393.113,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5393.553,
    "end": 5401.036,
    "text": "If you have a portfolio of generative models, you could summarize them according to the TJ statistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5401.756,
    "end": 5404.157,
    "text": "You could summarize them according to the number of nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5404.557,
    "end": 5411.1,
    "text": "You could put them into a common environment or different environments and summarize their activity in any number of ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5412.18,
    "end": 5419.903,
    "text": "But we can't talk about a ranking or a summarization of a portfolio of generative models that's not in hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5420.885,
    "end": 5424.168,
    "text": " This is a framework that lets us build those diverse generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5425.249,
    "end": 5439.02,
    "text": "And then in a very open-ended way, do model comparison, model selection, model adequacy, all the kinds of complex systems, engineering methods that we want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5441.722,
    "end": 5450.389,
    "text": "And also I would ask you, where do you see a peer or a comparison first principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5452.146,
    "end": 5460.912,
    "text": " Active inference has legible first principles, which are reflected in the active inference ontology and expressions using it, which can be represented in natural language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5461.153,
    "end": 5462.353,
    "text": "So that's the talking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5462.934,
    "end": 5465.416,
    "text": "But it's not only represented in natural language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5466.937,
    "end": 5470.399,
    "text": "Other frameworks have other first principles that may or may not be legible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5471.38,
    "end": 5476.964,
    "text": "And people may choose different paths to go down for whichever number of reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.984,
    "end": 5477.244,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.655,
    "end": 5500.702,
    "text": " well you can compare them right models like they have the virtue you can compare them and see which one gives you the best insight that you're looking for well so yeah i think like something that i could compare to active inference is like say the bayesian utility maximization thing and which has a different ontology",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5501.383,
    "end": 5502.784,
    "text": " I'm not a fan of that either.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5503.044,
    "end": 5512.869,
    "text": "I'll just note that Bayesian utility maximization is a special case of free energy where there's no epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5513.889,
    "end": 5515.57,
    "text": "All you have is pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5515.69,
    "end": 5520.233,
    "text": "And so a special diminished case... Not necessarily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.273,
    "end": 5526.436,
    "text": "You have value of information and you have explore-exploit trade-offs in Bayesian utility maximization as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5526.476,
    "end": 5526.936,
    "text": "Like you...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5529.556,
    "end": 5537.282,
    "text": " If you load into your utility function, if you can beg the question and load epistem into pragma, you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.422,
    "end": 5538.542,
    "text": "Then all you need is pragma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.063,
    "end": 5545.928,
    "text": "But in expected free energy, we have epistemic and pragmatic value, which is what enables us this expressivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5546.528,
    "end": 5547.969,
    "text": "But I think we're aligned on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5551.155,
    "end": 5551.415,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5551.435,
    "end": 5580.543,
    "text": "I think I'm somewhat also slightly confused because in the Bayesian utility, between the languages, comparing the languages as such, in the Bayesian utility maximization, the exploration parts that are prioritized based on your ex-ante estimation on the value of information, whereas I'm not sure that holds true for the active inference model as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5581.124,
    "end": 5592.585,
    "text": " that the epistemic exploration is prioritized or valued in terms of the same pragmatic thing as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5594.413,
    "end": 5600.577,
    "text": " I think you'll have a lot to explore and learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5600.757,
    "end": 5607.101,
    "text": "You can make a model that is 80-20 or 20-80 or 100-0 between epistemic and pragmatic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5607.641,
    "end": 5616.847,
    "text": "There's nothing we can say across generative models about whether active inference prioritizes epistem or not because you can make a model that's 100% or zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5616.887,
    "end": 5618.068,
    "text": "Sorry, I meant more like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5622.136,
    "end": 5628.538,
    "text": " Does active inference allow us to talk about systems that the Bayesian utility maximization doesn't allow us to talk about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5629.359,
    "end": 5632.42,
    "text": "I'm talking particularly about expressive power of the language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5633.26,
    "end": 5639.523,
    "text": "Are there things that the Bayesian utility maximization can talk about that active inference cannot?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5639.543,
    "end": 5642.804,
    "text": "Are there things that active inference can talk about that Bayesian utility maximization cannot?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5643.284,
    "end": 5644.084,
    "text": "Two short answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5644.384,
    "end": 5645.125,
    "text": "One short answer is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.207,
    "end": 5669.5,
    "text": " utility maximization must cram epistemic value into pragmatic value we gain more expressivity when we can articulate out pragmatic value which is the alignment of preferences with observations from epistemic value which is information gain so that's a huge articulation and the second thing is when you're in a anything maximization framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.1,
    "end": 5671.44,
    "text": " when you're in a utility function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5671.52,
    "end": 5675.401,
    "text": "Now, again, begging the question how you constructed this function that you're trying to maximize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5676.062,
    "end": 5687.885,
    "text": "When you're in a maximization framework, we have a well-known set of approaches for finding local and global maxima using optimization or maximization frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5689.085,
    "end": 5695.487,
    "text": "What Active Inference uniquely provides is it describes the path that that cognitive thing takes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5696.673,
    "end": 5701.499,
    "text": " as a path of least action that minimizes surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5702.32,
    "end": 5706.765,
    "text": "So instead of climbing to the top of the hill, are we on a foothill or are we on the biggest hill?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.506,
    "end": 5712.431,
    "text": "We're like a ball rolling to the bottom of the hill, finding the least surprising path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5712.972,
    "end": 5717.257,
    "text": "Now that least surprising path can still include novelty and information gain,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5718.629,
    "end": 5735.159,
    "text": " But it turns out to be a lot more tractable and connected with statistical physics and quantum mechanics when we talk about the path of least action, ball rolling down the hill, rather than this sort of question bag on top of a mountain climbing adventure Bayesian utility approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5739.122,
    "end": 5741.243,
    "text": "But it's up to each person to feel how they want to feel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5743.686,
    "end": 5750.634,
    "text": " And I think it's a little bit what's in the book as well when you take the low and the high road for free energy principle, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5751.935,
    "end": 5764.809,
    "text": "Because how much you want to have your utility maximization function being disconnected to the pragma, to the action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5767.418,
    "end": 5771.84,
    "text": " Because when you're modeling behavior, it will be hard to do that independently.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5771.98,
    "end": 5774.501,
    "text": "You have way more assumptions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5774.561,
    "end": 5782.004,
    "text": "You are committing to a greater level of assumptions for your utility function if you don't do that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5785.226,
    "end": 5791.088,
    "text": "Because it's the pragma with the action first that pragmatizes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5791.489,
    "end": 5796.711,
    "text": "You have reasons to describe, have reasons to believe why that information gain works the way that it does.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5798.713,
    "end": 5802.354,
    "text": " You can leverage some explanations on that without it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5804.614,
    "end": 5806.275,
    "text": "You have a model that has more assumptions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5806.415,
    "end": 5812.716,
    "text": "And I think if you have a model with less assumptions, it's always healthier, let's say so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5815.316,
    "end": 5822.198,
    "text": "Yeah, so I think that does talk about the comparative analysis of the expressivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5822.258,
    "end": 5828.119,
    "text": "But I would also say as a meta point that I'm not happy with either of those languages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5828.766,
    "end": 5835.5,
    "text": " I'm like, I'm suspect that both of those languages claim certain ontological assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5835.56,
    "end": 5836.923,
    "text": "And I'm like always suspicious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5837.104,
    "end": 5840.03,
    "text": "But wait, but like, where are these ontological assumptions coming from?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5841.587,
    "end": 5867.673,
    "text": " a few other points we tap into an absolutely meaningful nexus of statistical methods and message passing schemes with active inference if you can state something in the active inference ontology and construct a generative model then message passing algorithms can be deployed that contractively compute that model so that's absolutely non-trivial",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5868.556,
    "end": 5872.519,
    "text": " Otherwise, it's possible just to get wrapped up in some analytical formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5873.339,
    "end": 5880.243,
    "text": "But then once you want to do that on a 4K video, now you're on square zero with the computer engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5880.323,
    "end": 5881.584,
    "text": "This is not that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5882.465,
    "end": 5891.55,
    "text": "And then I will respond to your meta point with a meta point, which is when we've enumerated the alternatives, the one that we like best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5892.251,
    "end": 5893.572,
    "text": "Personally, I feel happy with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5894.012,
    "end": 5896.754,
    "text": "I'm also open to new alternatives arising, but being...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5897.828,
    "end": 5920.141,
    "text": " unhappy when all things considered is in play why what bothers you it's specifically on the ontology of uh the active influence yeah like i i i think like i'm still looking for",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5922.105,
    "end": 5950.129,
    "text": " i i don't know what exactly i'm looking for but i'm i feel dissatisfied with the account given for why helmo's free energy uh least action thing like is the central thing here or something like why does it work like why does this principle yeah there's a lot of funny answers i could give there yeah that that delta that discrepancy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5952.401,
    "end": 5960.624,
    "text": " That's curiosity and that's the space of the open and that's learning and that's your unique contribution to make and that's everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5961.304,
    "end": 5965.006,
    "text": "So that's not just a thorn in your shoe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5965.826,
    "end": 5970.348,
    "text": "That's like our experience of action amidst uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5971.874,
    "end": 5973.737,
    "text": " which is the water we're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5974.818,
    "end": 5986.875,
    "text": "And so whether we take a higher order narrative perspective on that discrepancy being dissatisfying or that discrepancy being satisfying, I think it's pretty good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5986.895,
    "end": 5988.737,
    "text": "I just need to minimize my surprise there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5989.639,
    "end": 5992.721,
    "text": " Yeah, and you can choose to minimize your surprise through your attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5993.602,
    "end": 5997.684,
    "text": "You can choose to minimize surprise at a higher narrative order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5998.085,
    "end": 6005.69,
    "text": "Like, I'm satisfied and complacent that I don't understand number theory, but I use numbers to count objects around me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6006.77,
    "end": 6012.194,
    "text": "So that discrepancy in understanding, knowing that there's a thousand years of research that could be done on numbers...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.621,
    "end": 6019.982,
    "text": " it doesn't unsettle me, but for someone else that might be unsettling and that might lead them to ruminate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6020.342,
    "end": 6022.523,
    "text": "It also might lead them to do a PhD in number theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6023.203,
    "end": 6031.705,
    "text": "So just different paths for different individuals and contexts, but there's always so many technical and meta levels with active, huh?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6033.645,
    "end": 6035.745,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6035.785,
    "end": 6043.227,
    "text": "So I don't want to like keep you guys over time, but I would ask one last reference based thing, which is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6044.547,
    "end": 6050.572,
    "text": " Are there active inference accounts of seeing a state phenomena in any literature?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6050.592,
    "end": 6054.676,
    "text": "I think I heard you mention it once, so I was like, yeah, I like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6056.777,
    "end": 6067.847,
    "text": "Yeah, check out Livestream 33 series, but also this course that we're literally actually enacting in with Avel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6069.179,
    "end": 6098.671,
    "text": " is where these accounts come to roost and where we're creating a space to develop it and it's not a cathedral for us just to spectate at today but if you want to make an active inference generative model of whatever social setting when you have the model in hand a lot of your questions will be sidestepped okay where is the 33 thing that you mentioned",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6099.372,
    "end": 6122.324,
    "text": " if you go to the page with all of our institute live streams and look in the live stream series like the paper discussions in the 33 series there's a dot zero video with background and context and then we have a dot one and a dot two conversation with the authors but avel who's also the course coordinator for this course and kairos research",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6123.024,
    "end": 6134.836,
    "text": " Like, Evel's and colleagues' work has heavily built on the seeing like a state, thinking like a state, optimal grasp, all these different topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6138.58,
    "end": 6140.962,
    "text": "Yeah, I'm on your YouTube channel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6141.022,
    "end": 6143.544,
    "text": "I'm slightly finding it hard to find the thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6143.565,
    "end": 6143.605,
    "text": "Um...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6146.32,
    "end": 6156.543,
    "text": " If you look up livestream 033.0 or if you go to in the video description of any video where it says all live streams here, go there and search for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6156.563,
    "end": 6160.625,
    "text": "But you'll find it and you can always email us or get in contact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6160.665,
    "end": 6161.025,
    "text": "But yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6162.305,
    "end": 6167.347,
    "text": "And I think a newspaper like Thinking Like a State also can help you a lot to understand how...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6168.641,
    "end": 6175.829,
    "text": " how active inference modeling is useful for the social sciences in comparison to other types of modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6176.269,
    "end": 6178.372,
    "text": "He makes a comprehensive description.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6179.112,
    "end": 6179.693,
    "text": "Interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6181.735,
    "end": 6182.416,
    "text": "Great, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6183.657,
    "end": 6188.362,
    "text": "And this is our first iteration on this course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6188.422,
    "end": 6190.224,
    "text": "We are going to continue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6191.445,
    "end": 6207.01,
    "text": " bringing new information to the table and supporting individuals who want to build generative models around this area, whether it's part of an internship program or part of a course credit or different kinds of programs that we'll be able to develop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6208.471,
    "end": 6211.272,
    "text": "But this is the real thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6212.032,
    "end": 6215.233,
    "text": "And we're able to work with people who want to think and do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6215.253,
    "end": 6217.574,
    "text": "Makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6219.662,
    "end": 6219.982,
    "text": " Indeed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6220.002,
    "end": 6221.483,
    "text": "Any closing thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6221.904,
    "end": 6224.606,
    "text": "TJ, then I will go, and then Lorena with the last word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6227.208,
    "end": 6228.168,
    "text": "No, this was great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6228.288,
    "end": 6229.529,
    "text": "Thanks for the conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.411,
    "end": 6231.731,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.771,
    "end": 6236.595,
    "text": "Well, thank you for Brandon, TJ for joining, Lorena for the lecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6236.615,
    "end": 6239.036,
    "text": "This was a fun discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6239.076,
    "end": 6248.483,
    "text": "We never really know where or how it's going to go, but I'm glad that we could cover so many of these topics and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6249.636,
    "end": 6255.158,
    "text": " probably raise more questions and footholds than door slams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6255.258,
    "end": 6256.218,
    "text": "So thank you again, Lorena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6257.618,
    "end": 6260.239,
    "text": "Yeah, thank you for inviting me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6260.339,
    "end": 6265.82,
    "text": "And I think active inference holds a lot of space for experimenting as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6265.86,
    "end": 6272.222,
    "text": "Some things you try to see if they make sense and if they're going to hold up and open new questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6272.802,
    "end": 6278.904,
    "text": "And that might be an interesting aspect of the framework itself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6282.008,
    "end": 6282.648,
    "text": " Thank you, everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6282.829,
    "end": 6285.35,
    "text": "Thank you, everybody, for the great live chat comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6285.591,
    "end": 6286.972,
    "text": "There's a lot there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6286.992,
    "end": 6288.132,
    "text": "I couldn't read it all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6288.473,
    "end": 6289.634,
    "text": "So until next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6290.654,
    "end": 6290.854,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]