[
  {
    "start": 2.275,
    "end": 2.616,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3.96,
    "end": 4.662,
    "text": "Welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4.682,
    "end": 5.484,
    "text": "Thanks for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.051,
    "end": 11.08,
    "text": "We're in cohort five in the first discussion of chapter nine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.349,
    "end": 16.335,
    "text": "In terms of the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.484,
    "end": 28.002,
    "text": " We made our way through the epistemic first half, the recipe for making a generative model in chapter six, then the discrete and the continuous time generative models in seven and eight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.022,
    "end": 32.309,
    "text": "Now we get to chapter nine, which is the data-driven component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.05,
    "end": 44.128,
    "text": "So pretty much up to this point, everything has been like, you think of it conceptually, you create the model, and then it generates synthetic data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 45.155,
    "end": 50.042,
    "text": " that's using a generative model in the direction that's usually called generative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.062,
    "end": 51.204,
    "text": "It's generating data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.905,
    "end": 59.236,
    "text": "The other direction of use for an active inference model or statistical model is as a recognition model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.837,
    "end": 67.469,
    "text": "So that's taking in empirical data and then fitting parameters that recognize the patterns in the empirical data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.23,
    "end": 71.635,
    "text": "So chapter nine highlights that kind of back and forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.475,
    "end": 82.348,
    "text": " about designing generative models that take in data that's being emitted by empirical experiments, like behavioral experiments in lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.089,
    "end": 85.071,
    "text": "So that's what chapter nine is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 86.913,
    "end": 96.245,
    "text": "You, if you want to ask the question that you had first, and then we can like jump in there, explore empirical data, look at some PyMDP and empirical code, just see what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.366,
    "end": 99.85,
    "text": "But what was your question before we begin?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.462,
    "end": 105.265,
    "text": " Oh, I have no specific question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 105.406,
    "end": 110.552,
    "text": "It's just I noticed a lot of people have commented on that paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 110.612,
    "end": 118.041,
    "text": "So I suspect it's something completely new direction in the field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 118.882,
    "end": 121.765,
    "text": "So yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 121.785,
    "end": 129.735,
    "text": "So could you comment on the main point of this paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 131.268,
    "end": 131.649,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.19,
    "end": 132.41,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.431,
    "end": 132.691,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.912,
    "end": 137.702,
    "text": "So this was the paper path integrals, particular kinds and strange things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.644,
    "end": 151.572,
    "text": "It was first uploaded to archive in 2022, and then it was submitted to this journal called Physics of Life Reviews.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.94,
    "end": 157.147,
    "text": " So Physics of Life Reviews has a very interesting scope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.988,
    "end": 166.6,
    "text": "If you look at the structure of this journal, they publish like regular research as well as comments on research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 166.66,
    "end": 173.509,
    "text": "And so during the process of this paper being like kind of undergoing peer review from the archive version,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.974,
    "end": 186.267,
    "text": " They also, once they get to basically the final version, they solicit from a pretty broad and open community these short comment papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.707,
    "end": 192.174,
    "text": "So like Ali and I wrote a paper commenting on this, just like a two-page paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.834,
    "end": 197.78,
    "text": "Those comment papers are not peer-reviewed exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.02,
    "end": 201.184,
    "text": "They're more like editorially overviewed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.502,
    "end": 223.155,
    "text": " um so i mean we see many many names that we know because it's kind of like an easy and fun way to be part of a bigger discussion get a citation pump up the citations to the target paper um so that's kind of the the meta um on this okay so as for the contents itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.54,
    "end": 251.505,
    "text": " um it is not entirely new it builds on especially the 2019 first in work free energy principle for a particular physics um to connect it to the textbook all throughout the 2022 textbook like we're talking about the continuous time and the discrete time models so um let's look at figure 4.3",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.692,
    "end": 261.261,
    "text": " So in the discrete time setting, we have a transition operator that basically jumps you forward a discrete time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.603,
    "end": 270.633,
    "text": "In the continuous time setting, the way that we've been discussing it in the textbook is in terms of the Taylor series approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.174,
    "end": 279.045,
    "text": "So starting with a point, evaluating at the point, then taking the first derivative around the point, and then the second derivative around the point, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.545,
    "end": 282.91,
    "text": "So that is in a continuous setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 283.312,
    "end": 288.782,
    "text": " That idea of like doing active inference in a continuous setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.15,
    "end": 315.765,
    "text": " is is generalized and formalized by framing the free energy principle not just in terms of the transition probabilities in a discrete model not just in terms of the taylor series approximation or the generalized state space of continuous time model but actually in a path integral formation so that's kind of like there's like a thread",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.505,
    "end": 322.552,
    "text": " that's like the likeliest thing to happen, that's the path of least action, like the baseball doing a parabola.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.572,
    "end": 331.742,
    "text": "Like whether you knew about it right at the beginning with the initial conditions or whether you had tracked the whole baseball, it's like it does do a parabola.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 331.762,
    "end": 333.484,
    "text": "That's classical movement, but still.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.045,
    "end": 345.718,
    "text": "And then it's kind of like there's like a sheath around that trace with paths that the baseball could have taken that are just exponentially less and less likely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.817,
    "end": 352.969,
    "text": " Like it could have hit just a bunch of molecules in a certain way at this one point and kind of diverted off course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 352.989,
    "end": 359.08,
    "text": "But because the baseball is very large relative to air molecules, it follows like a classical trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.502,
    "end": 369.057,
    "text": "So the first thing they do is they kind of reconsolidate the free energy principle in terms of half integrals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.577,
    "end": 376.427,
    "text": " which can then be like dropped back down into the continuous time that we talk about in the textbook or the discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.108,
    "end": 386.041,
    "text": "But like, especially with maybe the ways that they're taking it even further, like the path integral is kind of like the richest formalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.562,
    "end": 395.635,
    "text": "Like if you go back to the variational calculus origins with Richard Feynman, they have to do with path integrals for particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.222,
    "end": 404.75,
    "text": " So it's kind of like coming full circle in a way, because the Feynman diagram was developed in the setting of those exact questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.791,
    "end": 409.754,
    "text": "Now they're applying it to cognitive particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.575,
    "end": 415.019,
    "text": "And then, so that's one, that's kind of like the consolidation of the formalism component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 416.22,
    "end": 425.368,
    "text": "And then the second major contribution, and this is also the piece I think that Ollie and I focused on in our commentary, is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.973,
    "end": 436.808,
    "text": " Previously, people had always talked about, well, active inference can apply from kind of simpler inert systems to simpler active systems all the way on through complex systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.729,
    "end": 449.906,
    "text": "And people had introduced this notion of mirror versus active inference for something that a mirror active inference system is something you could model as doing active inference, but it might be kind of simple or boring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.966,
    "end": 453.01,
    "text": "Like, yeah, you could model that rock as...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.99,
    "end": 482.693,
    "text": " flying but choosing not to fly but you've kind of brought out a big apparatus to model something that's not moving and so here with this figure and the discussion they brought a lot more clarity to these kind of classifications systems that don't evidence active states in an interesting way to a given observer not to say they don't right map and territory then systems that have activity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 482.791,
    "end": 487.017,
    "text": " but the activity is kind of classical or conservative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.538,
    "end": 489.942,
    "text": "I don't know if a bacterium is really the right image here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.242,
    "end": 495.871,
    "text": "I think something like a pendulum might be clearer because bacteria can also have rich behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.911,
    "end": 503.783,
    "text": "All the way on through what they want to highlight here, which is like a metacognitive or a strange particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 503.823,
    "end": 510.233,
    "text": "And that's also what Lars and Lancelot highlighted in their comment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.905,
    "end": 518.234,
    "text": " was about the Bayesian mechanics, not just across the partition, but okay, do the partition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.774,
    "end": 525.802,
    "text": "And now in the internal states, partition those again, as if those internal states have metacognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.765,
    "end": 539.038,
    "text": "So it was a big paper for consolidating the formalism and for clarifying some of the different scopes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.625,
    "end": 544.145,
    "text": " I see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 549.11,
    "end": 549.391,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.099,
    "end": 563.164,
    "text": "So it's one of the top down approach to look at active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 568.929,
    "end": 570.411,
    "text": "Yeah, I think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 570.431,
    "end": 570.831,
    "text": "I mean,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.38,
    "end": 575.144,
    "text": " It doesn't start from modeling a particular system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.285,
    "end": 579.71,
    "text": "It starts from more axiomatic considerations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.293,
    "end": 594.709,
    "text": "So in that kind of like physics based free energy principle side, whereas like active inference isn't mentioned in the abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.052,
    "end": 622.738,
    "text": " so it's like path integral formulation of the free energy principle systems that do that are active inference systems but here they're highlighting that that High Road formulation you see there might be other pieces too and I think I mean the commentaries are I haven't read them all but they're probably",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.439,
    "end": 639.072,
    "text": " People always do funny titles that suggest what they're about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 641.314,
    "end": 643.277,
    "text": "So maybe we can review them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.24,
    "end": 650.245,
    "text": "But in terms of getting diverse comments,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.473,
    "end": 679.725,
    "text": " on a major piece of work this format which physics of life reviews does and a few other journals is really useful and like carl and others have used it multiple times well um we can look at any part of nine look at any questions also i have um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.667,
    "end": 683.071,
    "text": " by MDP up in cursor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.456,
    "end": 697.096,
    "text": "So we could explore with language slash code models, like how you incorporate empirical data with the generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.022,
    "end": 701.865,
    "text": "Depends on whatever people want to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 713.32,
    "end": 738.147,
    "text": " i think looking at codes would be great okay okay okay um okay we'll we'll see what we can do without um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.97,
    "end": 750.711,
    "text": " I, I didn't like prepare anything specific, so we might have to debug a little bit or have a little fun, but, um, let's, uh, see, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.398,
    "end": 762.733,
    "text": "Um, just, just for context, PMDP documentation and the, uh, package itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.353,
    "end": 791.573,
    "text": " infractively slash py mdp so this i just cloned in that repo so everything that's in the github i just pulled that in um okay so what do we want to look at or make a model of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.257,
    "end": 802.623,
    "text": " Or is there an empirical data set that we want to connect it to or type of empirical data that we want to connect it to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.452,
    "end": 813.594,
    "text": "I have nothing specific in mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 821.062,
    "end": 825.306,
    "text": "Let's do a discrete time model of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 826.67,
    "end": 853.403,
    "text": " We could try to recapitulate one of the examples in the textbook, like the listening to music from chapter seven, or if there's some other like structure or type of data or kind of action selection that people want to explore, we might be able to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.374,
    "end": 856.416,
    "text": " Music is great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 857.458,
    "end": 857.719,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.743,
    "end": 859.983,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.146,
    "end": 877.078,
    "text": "Here, just, just, um, there's a lot of ways to, um, go, go into this, but, um, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.718,
    "end": 897.099,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.501,
    "end": 906.175,
    "text": "Let's start with, um, let's just, if this all runs, then it'll be good to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.107,
    "end": 914.249,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.269,
    "end": 916.153,
    "text": "So agent agent demo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.954,
    "end": 921.021,
    "text": "So let's just see where, where it is in the documents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.041,
    "end": 921.342,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.868,
    "end": 934.332,
    "text": " I just want to find one that already has some visualizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.335,
    "end": 953.241,
    "text": "And then we can see how it's built and how we can modify it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.064,
    "end": 955.365,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.106,
    "end": 956.747,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.767,
    "end": 958.129,
    "text": "Maybe the teammates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.632,
    "end": 967.061,
    "text": " Let's look at the TMAs and go through it and then see where the empirical data come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.081,
    "end": 975.811,
    "text": "But then we could... It doesn't have to be a spatial model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.011,
    "end": 983.619,
    "text": "Maybe we can see if it's possible or what would need to happen to modify the TMAs to be more like a music example or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.321,
    "end": 987.103,
    "text": "I mean, this is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.214,
    "end": 996.104,
    "text": " In chapter nine, when they overview, here are the key figures, then we'll go to the code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.705,
    "end": 1000.69,
    "text": "First, it's taking everything that was looked at before with a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.451,
    "end": 1005.176,
    "text": "And it's saying like, okay, we were making a map of the rat in the T maze.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1006.378,
    "end": 1012.646,
    "text": "Now let's zoom out to having the laboratory that encloses that rat in a T maze.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.707,
    "end": 1018.153,
    "text": "So we're choosing experimental stimuli and passing them to the rat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.471,
    "end": 1022.238,
    "text": " Those are given the label O because they're observations for the subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.721,
    "end": 1029.652,
    "text": "And then the actions of the subject are our observations in the lab setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.454,
    "end": 1038.109,
    "text": "So this kind of, you can have another layer outside of the laboratory too, but this is just with focus on the system of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.469,
    "end": 1041.475,
    "text": "This is like what the cognitive model is enclosed in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.742,
    "end": 1055.545,
    "text": " 9.2 shows kind of the process of like kind of what you need to get for empirical results in a paper where you have a team ace, build a POMDP, which we'll look at the code in a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.547,
    "end": 1063.378,
    "text": "Then chapter nine is, which I don't think will exist in the code so that we can try building that part out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.05,
    "end": 1086.312,
    "text": " um you go from empirical data and you kind of invert the model to run it backwards so that then you could test like five different rats and look at the statistics of how they differ five different treatments of of a drug okay so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.37,
    "end": 1119.69,
    "text": " first just to kind of play with cursor i just said explain this notebook so right now for coding in active inference it's like literally the most exciting it's ever been because of tools like this way way beyond most people's coding potential",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.907,
    "end": 1129.339,
    "text": " in a moment, certainly far beyond mind is the ability to actually use cursor and other tools to have a conversation with the material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.359,
    "end": 1144.299,
    "text": "So there's a lot of questions that people might be like kind of having burning inside of them or like wanting to ask another person that are very possible to just ask through language models of the code itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.319,
    "end": 1147.163,
    "text": "Here is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1147.868,
    "end": 1156.496,
    "text": " importing the kind of general packages that are needed, and then specifically importing the pieces of PI MDP that are needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.457,
    "end": 1158.078,
    "text": "That's imports.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.0,
    "end": 1163.303,
    "text": "Um, here's the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1163.684,
    "end": 1168.368,
    "text": "The environment is going to be like where the game or the setting is defined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.389,
    "end": 1171.852,
    "text": "We're, we're in the discrete time setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.155,
    "end": 1175.395,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.45,
    "end": 1199.762,
    "text": " interestingly it's it's not 100 like when when the setting is like right arm wins it still is 98 and two so there's a little stochasticity even when the the context is like it you know when when the it's on the left arm of the right arm um maybe that's just to keep keep it kind of a little bit more interesting and noisy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.21,
    "end": 1217.448,
    "text": " Um, just if you, if you want to highlight the kind of auction of its uncertainty, then, you know, you could just change this to one and zero, but, but, um, keeping it this way highlights the uncertainty part and here they call a teammates environment function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.218,
    "end": 1227.96,
    "text": "Searching the code base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.002,
    "end": 1248.555,
    "text": " describing what this teammates environment call makes, but it stores what's needed for the teammates and puts it into environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.396,
    "end": 1252.619,
    "text": "That method is in another file.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.104,
    "end": 1257.385,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.467,
    "end": 1263.972,
    "text": "Here's gonna be the hidden state to outcome mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.492,
    "end": 1270.482,
    "text": " That's the, quote, collection of probabilistic relationships called the A matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1270.502,
    "end": 1273.046,
    "text": "This is the mapping between hidden state and observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.91,
    "end": 1279.256,
    "text": "That's a likelihood function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1280.998,
    "end": 1291.495,
    "text": "And here, there's, we can say, output the A",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.942,
    "end": 1304.871,
    "text": " And it will provide us, but, but this is basically showing, um, there's no reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.534,
    "end": 1307.794,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1308.035,
    "end": 1308.455,
    "text": "Reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.376,
    "end": 1317.125,
    "text": "And, uh, uh, there's, there's the, the null state, like with respect to whether you're observing, getting the food or not, let's just call it food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.806,
    "end": 1320.309,
    "text": "Um, but let's just call it reward because they call it reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.09,
    "end": 1321.33,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.795,
    "end": 1328.522,
    "text": " The top row, the columns represent the locations that you could be in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.483,
    "end": 1332.427,
    "text": "The top row represents not tasting anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.428,
    "end": 1337.934,
    "text": "The middle row represents tasting the reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.954,
    "end": 1345.123,
    "text": "And then the bottom row represents tasting like the opposite of the reward, like the other arm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.525,
    "end": 1352.333,
    "text": " So this is saying like the starting and the queue location, hidden states map on to not tasting anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.353,
    "end": 1358.08,
    "text": "The right maps on to tasting the reward, hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.801,
    "end": 1363.426,
    "text": "And then the left arm in this case maps on to tasting the opposite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.491,
    "end": 1368.252,
    "text": "The queue mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.772,
    "end": 1371.195,
    "text": "So we were in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.293,
    "end": 1392.998,
    "text": " slice one of the a so the first kind of type of a matrix that comes into play is the one between location and taste there's also a second a which is going to be just a two by two and this represents the mapping between the observed q in the bottom of the teammates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.48,
    "end": 1396.782,
    "text": " and what context you're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1397.423,
    "end": 1408.615,
    "text": "So in this setting, it's kind of like an honest Q saying, if the Q is saying that you're in the left better context, it's accurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.536,
    "end": 1420.808,
    "text": "But you could flip that to make like a deceptive Q. So that defines the two components of the A matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.172,
    "end": 1430.625,
    "text": " Now we're gonna just go through literally A, B, C, D. B is the transition dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.308,
    "end": 1439.799,
    "text": "So here they start with kind of the simpler B, which is gonna be the transition dynamics of what context you're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.36,
    "end": 1448.533,
    "text": "So this one corresponds to the smaller two by two A. This is saying when you're in left better context",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.458,
    "end": 1472.58,
    "text": " as a true hidden state that stays that way whereas if it was like a situation where the context was shifting between time steps within a trial you would have an off diagonal now those are uncontrollable Dynamics now they're going to get to controllable transition Dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.965,
    "end": 1485.59,
    "text": " This is really the key piece in active inference, because when all we have is the downstairs part, this is just a partially observable Markov process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.531,
    "end": 1491.381,
    "text": "That's just the A matrix and the B matrix being inferred, but there's no policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.363,
    "end": 1495.108,
    "text": "So to get into the policy selection,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.135,
    "end": 1506.288,
    "text": " that is equivalent to making B not just a singular transition matrix, but B has like multiple files or slices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.269,
    "end": 1520.106,
    "text": "And then pi selects, choosing a policy, choosing an affordance is equivalent to selecting which B matrix is gonna be applied to the continuation of the hidden state transition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.907,
    "end": 1524.792,
    "text": "So it's called controllable because there's a policy selection possibility",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.497,
    "end": 1528.503,
    "text": " for choosing which slice of B is applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.884,
    "end": 1535.458,
    "text": "Whereas if you were just like listening to a song, then you could infer the B matrix, but you wouldn't be able to choose the B matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.286,
    "end": 1544.417,
    "text": "It's sometimes unintuitive, the structure of these variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.819,
    "end": 1550.324,
    "text": " But again, through printing them and asking, you can get pretty far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.465,
    "end": 1554.469,
    "text": "And they're formulaically laid out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.229,
    "end": 1568.723,
    "text": "And also a lot of development effort, like in the open and the closed source spaces, has to do with making the specification of generative models overall, and especially the B matrix, a little bit more intuitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.283,
    "end": 1572.126,
    "text": "So that it can be like, make it so that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.321,
    "end": 1602.619,
    "text": " this action does that at this point you kind of have to look at the matrix and and encode how that works so here this is like we're looking at the um controllable components of those two modalities so we can't control the context left or right better but we can control location so we're going from hidden state to hidden state at the next time step there's four locations going to mapping to the four locations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.443,
    "end": 1613.995,
    "text": " In this case, because the center is reachable from all locations, you can choose to move to the center from anywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.378,
    "end": 1622.524,
    "text": "Similarly, they're just laying out these movement options.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.665,
    "end": 1625.227,
    "text": "So those are the slices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.607,
    "end": 1632.555,
    "text": "These slice one, two, and three on B, those are the affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.771,
    "end": 1640.557,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.577,
    "end": 1650.112,
    "text": "They copy in, they copy in the variables, they kind of defined them just by themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.194,
    "end": 1656.062,
    "text": "And now they're going to copy them into this underscore GM format.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.354,
    "end": 1674.155,
    "text": " It's not necessary that the generative models of radical representation of the generative process at this point, we were just defining a and B like the vertical a and B. But we've just copied them in to be the eight part of the agent's generative model, but it doesn't have to be that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.536,
    "end": 1684.089,
    "text": "You could have the generative model of the agents having a different structure than the structure of like the map and the game, but that's just wouldn't take more code and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.711,
    "end": 1685.931,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.582,
    "end": 1690.847,
    "text": " Now they're going to continue with the agent class.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.929,
    "end": 1698.257,
    "text": "PyMDP is like the major method is the agent class.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.998,
    "end": 1708.611,
    "text": "PyMDP is built to get to being able to build the discrete time agents as fast as possible, essentially, and make easy methods for calling that once it's there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.827,
    "end": 1725.029,
    "text": " So we're defining just zero is the controllable index because here B zero, the first B zero indexed is the controllable one, but then the uncontrollable one, it was B one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.77,
    "end": 1728.294,
    "text": "So the second type of B tensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.495,
    "end": 1734.362,
    "text": "This is just telling as we work towards building the agent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.443,
    "end": 1758.679,
    "text": " that zero is the one that's under control whereas if it believed they could control the context at the at the very best case you'd be wasting computational resources on computing that um here the agent is defined in terms of just the a the b and um the control indices",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1760.279,
    "end": 1764.126,
    "text": " Now it gets defaults for everything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.146,
    "end": 1766.691,
    "text": "And those are going to be kind of like investigated a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.455,
    "end": 1774.106,
    "text": "It starts out with a flat prior for the hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.126,
    "end": 1778.875,
    "text": "It starts out with a flat, so it doesn't know where it is in the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.817,
    "end": 1783.063,
    "text": "It has an equal belief across the four possibilities of locations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.545,
    "end": 1788.369,
    "text": " And that's plotting D0 corresponding to location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.389,
    "end": 1790.111,
    "text": "That's the controllable index.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.291,
    "end": 1794.235,
    "text": "So D0 corresponds to the prior on hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.756,
    "end": 1797.098,
    "text": "B0 corresponds to transitions of hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.539,
    "end": 1801.043,
    "text": "A0 corresponds to hidden state and observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.463,
    "end": 1805.227,
    "text": "And then the context is that second modality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.168,
    "end": 1811.194,
    "text": "And so here it has an even prior on which context it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.615,
    "end": 1814.417,
    "text": "Then they modify it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.836,
    "end": 1836.625,
    "text": " so that it has a precise and accurate belief one hot just means a variable with a one in one location and then the rest of them are zeros so they've modified that to now um look like a strong belief that it's in the zeroth position um okay now they get to see so after having done this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.807,
    "end": 1842.293,
    "text": " they will have defined A, B, C, and D. Then that will have basically constructed the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1842.914,
    "end": 1849.181,
    "text": "So they're going to go to that reward modality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.364,
    "end": 1859.092,
    "text": "There's some interesting discussion about like, how do you actually connect up like an observation to be incentivizing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.415,
    "end": 1866.24,
    "text": "And here's the C preference variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.756,
    "end": 1874.927,
    "text": " Okay, that was it defining the teammates ABCD of the agents here's the active inference loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1885.964,
    "end": 1886.144,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.927,
    "end": 1889.089,
    "text": "let's do something like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.387,
    "end": 1916.757,
    "text": " doesn't always work on the one shot, but a shocking percentage of the time it does fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.233,
    "end": 1928.934,
    "text": "It literally did it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.296,
    "end": 1931.057,
    "text": "It literally did it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.432,
    "end": 1943.894,
    "text": " So here's three or here's four times steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.914,
    "end": 1944.174,
    "text": "That's funny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.195,
    "end": 1946.156,
    "text": "You know, it's the half time steps obviously don't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.176,
    "end": 1969.077,
    "text": "So here it's, um, these plots represent that active inference simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.537,
    "end": 1993.531,
    "text": " So it's like, that's always, what's super interesting is defining the agent, like the kind of scaffold or the template of the agent is really just the beginning, because then there's a ton of methods to describe, like to visualize the outputs of the agent and to sweep across different parameter combinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.597,
    "end": 1997.697,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.904,
    "end": 2013.279,
    "text": " They're kind of now plotting, um, they're kind of inspecting the beliefs, plotting the updated beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.061,
    "end": 2021.708,
    "text": "And then earlier I was just, I didn't really make any, but just started to visualize a few things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.728,
    "end": 2021.908,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2024.211,
    "end": 2025.372,
    "text": "Let's copy this again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.904,
    "end": 2060.096,
    "text": " So here we'll do the, the chapter nine thing and bring in empirical data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.32,
    "end": 2072.62,
    "text": "So it's just some, some it's doing a few, just minor, um, just formatting, but these lines are not being changed, but green means it's adding in line red.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.64,
    "end": 2073.482,
    "text": "It's leading you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.762,
    "end": 2094.154,
    "text": " yeah uh i want to ask about the gpt4 does it actually read the paper and the documentation why does it understand yeah good good question like in this case um well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2094.37,
    "end": 2109.233,
    "text": " First off, if, if you were just using like the chat interface for GPT or like whatever cloud three, et cetera, um, you could just copy in code and then say like, improve this script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.334,
    "end": 2115.482,
    "text": "And then it would, you know, based upon the statistics of all the code it had seen, it would update that script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.265,
    "end": 2122.453,
    "text": "Purser takes that a lot further because, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2124.509,
    "end": 2129.197,
    "text": " it does code base indexing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.217,
    "end": 2137.893,
    "text": "So when you type in a prompt to GPT, first, it tokenizes your input, converts the words into tokens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.534,
    "end": 2144.745,
    "text": "Then those tokens are calculated in terms of their embeddings in the semantic spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.367,
    "end": 2153.799,
    "text": " then like that embedding can be used to then generate more things in that semantic neighborhood shortly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.442,
    "end": 2162.532,
    "text": "The cheap part of using a transformal model is actually going from the tokens to the embeddings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.338,
    "end": 2167.983,
    "text": " Whereas going from the embeddings to generating new synthetic material is costly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.503,
    "end": 2171.046,
    "text": "And then obviously fine tuning it and training it is even more costly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2171.847,
    "end": 2179.235,
    "text": "So what cursor does is in the folder that you're in, it, it indexes the code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.616,
    "end": 2184.24,
    "text": "So it runs all the code through the first part to embed it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2185.021,
    "end": 2191.287,
    "text": "And then when you do a request, it like, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.78,
    "end": 2203.282,
    "text": " So control enter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.624,
    "end": 2212.415,
    "text": "So here it's scanning across, here GPT is going to be tokenizing and then checking the embeddings of this prompt I wrote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.496,
    "end": 2220.386,
    "text": "Then it uses basically what's called retrieval augmented generation, RAG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.806,
    "end": 2231.601,
    "text": "You might be using that in some other variants to find which sections in the code itself actually have relevant information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.032,
    "end": 2259.259,
    "text": " terms of having a similar embedding so like if you had pdfs of a bunch of different disciplines and then you said well like what reacts with methane and then it would look for where methane had been introduced or methane is similar to butane if that if there was a paper that said methane is like butane then it would to a lesser extent draw on papers that talked about butane so this is not co-pilot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.307,
    "end": 2264.352,
    "text": " No, you can use co-pilot as well in this setting, but this is cursor.sh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.273,
    "end": 2266.114,
    "text": "Cursor.sh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.474,
    "end": 2266.814,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.834,
    "end": 2267.255,
    "text": "Got it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.275,
    "end": 2267.976,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.996,
    "end": 2268.156,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.176,
    "end": 2269.257,
    "text": "It's a VS code fork.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.518,
    "end": 2278.366,
    "text": "And, and, and even if you've been away from it for like a few days, you should download a new version of it because like the changing is very rapid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.707,
    "end": 2283.531,
    "text": "Um, so, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.551,
    "end": 2285.533,
    "text": "Let's, let's see how well this did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.399,
    "end": 2292.625,
    "text": " Here's what it wrote for visualizing a teammates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.552,
    "end": 2303.319,
    "text": "So it's like, it didn't output anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.339,
    "end": 2304.361,
    "text": "I'm not seeing anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.09,
    "end": 2313.293,
    "text": "So there's the side chat mode",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.522,
    "end": 2326.225,
    "text": " Where you can chat with the code base and then there's kind of this in line editing mode and there's also a kind of a tab auto complete mode that's more like the co pilot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.409,
    "end": 2330.052,
    "text": "But this in line version.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.695,
    "end": 2333.138,
    "text": "Is it like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.798,
    "end": 2364.75,
    "text": " There's probably so many in its training data set, so many simple code examples, like just checking if there's a folder like this kind of logic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.572,
    "end": 2367.353,
    "text": "Accept the changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.342,
    "end": 2374.903,
    "text": "Let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2394.982,
    "end": 2395.964,
    "text": " teammates too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.03,
    "end": 2478.787,
    "text": " So that's kind of the danger sometimes to an extent is like, it's really easy sometimes to like be spinning your wheels with, with code that can be like kind of overwhelming and look relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.947,
    "end": 2487.578,
    "text": "And the code might not be like bad by itself, but then like you start stacking all this code and then like the maintenance and interpretability costs can be very high.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.953,
    "end": 2524.298,
    "text": " Like it's fun also just like, this is where we're at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.318,
    "end": 2529.645,
    "text": "I mean, this is the chapter nine, you know, this is kind of where we're at as we continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2529.806,
    "end": 2535.033,
    "text": "And other people continue to first off ask GPT about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.475,
    "end": 2540.161,
    "text": "And it includes more and more recent checkpoints in its training.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.661,
    "end": 2546.49,
    "text": "And of course, web enabled search like perplexity and all this, like it gets better at doing active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.191,
    "end": 2550.876,
    "text": "A second huge piece is gonna be, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.611,
    "end": 2579.952,
    "text": " more and more actual examples of active inference code especially for like higher reliability settings it's cool that there are pi mdp demos at the same time like i know that the community has more than just a couple notebooks but they're not in the pi mdp repo so then the cursor only has a couple of examples to go off of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.282,
    "end": 2605.533,
    "text": " So adding more working examples, updated language models with internet access and better code scoping, fine tuning language models on transcripts from the active inference journal, from like our live streams and model streams and the textbook group, questions that people ask getting folded back in to fine tuning and to RAG and model scope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2606.334,
    "end": 2608.437,
    "text": "If we pulled in the active inference journal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2610.053,
    "end": 2635.065,
    "text": " transcripts for all the live streams then we could say something like um make it into continuous time and then maybe in several discussions somebody said like well what's the difference between discrete and continuous time and then that was addressed and then it could go off of those questions to actually inform it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.282,
    "end": 2641.291,
    "text": " So, especially for a field like active inference, where it's like, this is the domain expertise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2642.233,
    "end": 2645.558,
    "text": "So that being invoked will help a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.705,
    "end": 2658.859,
    "text": "But just for doing things like improve and generalize and professionalize this code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.737,
    "end": 2671.158,
    "text": " So to pulling data from active journal, does it require fine tuning?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2671.178,
    "end": 2673.704,
    "text": "Like, we're not totally set up to do it today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.286,
    "end": 2680.02,
    "text": "But yeah, in principle, you could pull in the GitHub repository for the active inference journal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.523,
    "end": 2686.069,
    "text": " And then it would have the transcripts in the plain text, but there might be a bunch of redundant stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.089,
    "end": 2690.194,
    "text": "Like we might have four different versions of the plain text or different translations or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.234,
    "end": 2700.346,
    "text": "But yeah, we could, we would prepare a kind of rendering flag, like output a single version of every transcript with no time steps and have that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2702.168,
    "end": 2707.594,
    "text": "And then, and, and also have papers and more code examples and all of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.118,
    "end": 2719.011,
    "text": " So like even just playing around with where it's at helps calibrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.071,
    "end": 2726.764,
    "text": "Um, we can say generate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.008,
    "end": 2778.418,
    "text": " So with these kinds of functions, like here, this is not, it's not outputting the data exactly like we need it to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2798.463,
    "end": 2812.465,
    "text": " So even just playing with these, like it's, it's really some of the most and fastest fun I've ever had using active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.485,
    "end": 2815.73,
    "text": "Because let's say, yeah, go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.75,
    "end": 2823.222,
    "text": "Uh, so as long as I don't, uh, exceed the context length, I can just pulling whatever repo I want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2825.243,
    "end": 2829.449,
    "text": " Actually, you can pull in repos that are way beyond the context length.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.469,
    "end": 2831.111,
    "text": "So let's just say that the context length was 100.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.332,
    "end": 2833.114,
    "text": "Just make it simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.415,
    "end": 2836.299,
    "text": "And you pulled in a repository that was 1,000.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.561,
    "end": 2843.389,
    "text": "So the first thing that would happen is the 1,000 lines of code would be embedded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.409,
    "end": 2846.033,
    "text": "That's the syncing of the embeddings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.854,
    "end": 2852.382,
    "text": "Then let's just say you did a prompt of length 20.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.817,
    "end": 2856.463,
    "text": " So you've used up 20 of the hundred of the context window with your prompt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.404,
    "end": 2861.511,
    "text": "Then that is going to get embedded in dispatch to cursor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.272,
    "end": 2871.848,
    "text": "And then cursor is going to do its best to fill the other 80 of the context window with the most relevant 80 from the code base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.868,
    "end": 2877.998,
    "text": "That's this part where it's scanning the code base and then pulling in the context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.041,
    "end": 2887.555,
    "text": " So then the final execution from cursor is your 20 prompt plus the 80 most relevant that rag obtains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.019,
    "end": 2904.964,
    "text": "So it may pull in like misleading examples, but to the extent that the macros and the patterns do exist in the code base, it's basically effective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2906.699,
    "end": 2912.488,
    "text": " then the less that what you're asking for exists in the code base, the less, of course, it can rely on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.149,
    "end": 2917.355,
    "text": "And so then the more it's just relying on the overall statistics of the language model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.9,
    "end": 2935.963,
    "text": "Another thing is that Cursor, you can set... I don't know where it moved the setting to, but you can force it to call...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.078,
    "end": 2965.157,
    "text": " another you can force it to call a different endpoint for the language model so then you can use like jan.ai or lmstudio.ai or another one to have a local language model so then cursor is dispatching to a local language model and these are also including code enabled and so on so it's like kind of interesting because it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.998,
    "end": 2981.466,
    "text": " It's not the math of active inference, but as that gets brought in, and then for the equations, like we already have every equation in the latex form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.572,
    "end": 2988.9,
    "text": "So this is highly readable by the models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.775,
    "end": 2998.263,
    "text": " Many can also look at images too, but what it's going to do when it gets an image is basically OCR and try to revert it to LaTeX anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.923,
    "end": 3000.685,
    "text": "So it's enormously costly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.586,
    "end": 3018.381,
    "text": "So there could be some repos, like maybe the textbook group repo, that just have like all the equations in LaTeX or the whole text in plain text stripped of some, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.58,
    "end": 3021.764,
    "text": " just spaces and kind of cleaned up a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.026,
    "end": 3031.136,
    "text": "And then those kinds of plain text files can be brought in with one line in Git.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.599,
    "end": 3044.132,
    "text": "And then you functionally would have the textbook material because it's not only looking at code when it's doing its scoping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.175,
    "end": 3048.659,
    "text": " Like here, it looked into just plain text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.247,
    "end": 3066.222,
    "text": "So, you know, long-lived digital stigmergy, contributions and questions that people make really do matter, even if they're a starting place for being improved and corrected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.783,
    "end": 3076.144,
    "text": " It, it really, it really does have compounding effects on the total active ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.769,
    "end": 3083.974,
    "text": " Like we could have a function to generate synthetic TMAs data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3084.835,
    "end": 3087.938,
    "text": "So that might be one step would be, okay, we made the TMAs generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.739,
    "end": 3091.001,
    "text": "Now let's make a generate synthetic data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.021,
    "end": 3099.531,
    "text": "And then let's do chapter nine, kind of get this pairing between the generated synthetic data and the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.551,
    "end": 3107.7,
    "text": "Then you build another function to go from video data to the same format as the synthetic data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.423,
    "end": 3115.173,
    "text": " But you already established that that synthetic data format was able to be parametrically useful for the GM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3116.515,
    "end": 3120.441,
    "text": "And you could have already developed the visualization, sweeping, other methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.843,
    "end": 3130.937,
    "text": "So it can be quite a large code base and you can write like thousands of lines in a day because it just spills out these functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.62,
    "end": 3154.431,
    "text": " So I think a lot of the previous discussions in chapter nine and the textbook, like they're, they're either philosophical or analytical, I mean, or both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.672,
    "end": 3163.58,
    "text": "And, um, yet the applying is very much like computer engineering and statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.744,
    "end": 3172.45,
    "text": "And as the models and the programs get better, like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.628,
    "end": 3176.772,
    "text": " In six months, I think a lot of these will be even better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.964,
    "end": 3185.985,
    "text": "One more question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3189.89,
    "end": 3196.479,
    "text": "Agent-based modeling, I wonder if that's a field suitable for active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3198.843,
    "end": 3199.143,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.684,
    "end": 3202.808,
    "text": "I mean, that's why PyMDP, the central type, is the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.661,
    "end": 3209.606,
    "text": " Active inference is agent-based modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3209.646,
    "end": 3221.719,
    "text": "Agent-based modeling, whether you do it at NetLogo or any other kind, has always had the kind of incoming perceptual and outgoing action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.381,
    "end": 3232.491,
    "text": "So that kind of cybernetic framing of single and multi-agents ecosystems of shared intelligence is not new to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.348,
    "end": 3241.62,
    "text": " Really the essential piece is that that entire generative model of the agent is being understood in a unified way, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.161,
    "end": 3244.244,
    "text": "Memory, attention, et cetera, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3244.284,
    "end": 3256.562,
    "text": "All the diverse cognitive phenomena are being approached in a unified manner and with a unified loss or fitting function, free energy, under the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.886,
    "end": 3263.052,
    "text": "But you'll find other agent-based models that have a perception and action component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3268.313,
    "end": 3278.908,
    "text": " If I just look at NetLogo, it's not explicitly done in the language of active inference, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3279.228,
    "end": 3279.468,
    "text": "Correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.488,
    "end": 3286.618,
    "text": "I wonder if there is value to be added if you bring the active inference discipline into that field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3288.721,
    "end": 3290.423,
    "text": "Yes, certainly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.445,
    "end": 3291.705,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3292.445,
    "end": 3292.745,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3293.186,
    "end": 3298.591,
    "text": "Like going to the classic net logo simulations, rewriting them to be more active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.611,
    "end": 3303.536,
    "text": "And like, it's a two way street people in net logo then can compare active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.556,
    "end": 3309.222,
    "text": "You can make, um, portfolios or models that have active and non active agents in net logo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3310.884,
    "end": 3314.448,
    "text": "And then it's instead of like, oh, well you need to learn this like other software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3315.128,
    "end": 3318.672,
    "text": "It just brings active inference into whatever software is being used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3318.692,
    "end": 3321.675,
    "text": "And it might be like as simple as just using a different loss function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.372,
    "end": 3327.397,
    "text": " So my, oh, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.417,
    "end": 3328.458,
    "text": "Yeah, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3328.478,
    "end": 3329.78,
    "text": "Okay, I just finished my question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3330.021,
    "end": 3333.166,
    "text": "I wonder if that's a good topic for a master thesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3338.654,
    "end": 3339.536,
    "text": "I think it could be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.736,
    "end": 3347.308,
    "text": "I mean, like in terms of the implementations we have, I've never seen a net logo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.25,
    "end": 3354.333,
    "text": " So it could be interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.954,
    "end": 3360.101,
    "text": "You know, something else that my advisor works on is mutant agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.242,
    "end": 3366.77,
    "text": "And I haven't really seen anything in the literature so far on active inference about mutation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.974,
    "end": 3371.336,
    "text": "Like between generations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.157,
    "end": 3372.638,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.153,
    "end": 3375.956,
    "text": " Yeah, that could be really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.996,
    "end": 3387.993,
    "text": "Like just lock in the schema and the understanding for the teammates and then do lifetime where it does a hundred team mazes and that's the fitness function and then have recombination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.013,
    "end": 3397.647,
    "text": "I mean, I, I, I don't, I'm not set up to run that net logo exactly right now, but this looks like net logo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.685,
    "end": 3405.647,
    "text": " So this just gets super far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.649,
    "end": 3413.637,
    "text": "This gets like past 80% in a few minutes in terms of getting somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.44,
    "end": 3429.878,
    "text": "So that's mega exciting for, for a lot of reasons, but I mean, sorry, did, did Jeff, what, uh, did Jeff mention mutation agents?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.4,
    "end": 3431.7,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3434.448,
    "end": 3462.936,
    "text": " is there a paper somewhere yes i can link it give me a second cool but yeah fun um fun times interesting chapter nine um discussions one interesting meta repo would be if we made a repo that just i mean like literally i may do this tomorrow just brings in all these other repos",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.085,
    "end": 3469.896,
    "text": " But then at that point it might start like pulling context from like across repositories and it's not useful again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.916,
    "end": 3486.602,
    "text": "So there's a lot of meta programming work and documentation that will make it more accessible and useful and, and, and vastly more unexplored than explored.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.569,
    "end": 3490.729,
    "text": "I see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3491.536,
    "end": 3492.137,
    "text": " There's the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3492.737,
    "end": 3493.018,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.638,
    "end": 3496.481,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3496.501,
    "end": 3500.285,
    "text": "Sometimes I like just clicking through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3500.325,
    "end": 3507.273,
    "text": "Okay, so it's on the screen for two frames for a tenth of a second or half a second or whatever it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3509.135,
    "end": 3513.62,
    "text": "Future screenshotters will do better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3519.586,
    "end": 3519.846,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.227,
    "end": 3520.547,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.948,
    "end": 3548.205,
    "text": " that was the first discussion on chapter nine yep susan uh yeah yeah my brain's yeah going 100 miles a minute and so the the existing models that's in there are um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3549.265,
    "end": 3561.785,
    "text": " Where would you say the level of sophistication... What would be the next level of sophistication that's not there yet?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3562.866,
    "end": 3563.748,
    "text": "In PyMDP?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.369,
    "end": 3574.665,
    "text": "Yeah, in terms of the artifacts that are there now in terms of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3575.877,
    "end": 3579.522,
    "text": " Barbara Kirby, Go you get going up into levels of abstraction, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3580.083,
    "end": 3581.665,
    "text": "Barbara Kirby, modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3582.086,
    "end": 3584.529,
    "text": "Barbara Kirby, agents negotiating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3585.37,
    "end": 3591.559,
    "text": "Barbara Kirby, You know which i'm assuming you know we're not even close to there yet but.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3591.579,
    "end": 3592.16,
    "text": "Barbara Kirby, But.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3594.223,
    "end": 3603.336,
    "text": "Barbara Kirby, So beyond the the rat in the maze, what do you, what do you see will be the next step in evolution of the models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3604.042,
    "end": 3613.303,
    "text": " Yeah, like, currently the main pyMdp package only has these several documentations and simple examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.326,
    "end": 3620.059,
    "text": "Like, I know there's a thousand x more work not in the repo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.039,
    "end": 3627.416,
    "text": " So I would like to see the next consolidating step to be many, many diverse, successful, simple examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3628.479,
    "end": 3632.127,
    "text": "And then the introduction of motifs like metacognition and other things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3632.629,
    "end": 3635.415,
    "text": "And then that provides like the palettes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.395,
    "end": 3639.123,
    "text": " to be recomposed into these more composite simulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.744,
    "end": 3641.167,
    "text": "So we're in the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.528,
    "end": 3642.33,
    "text": "It's all happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.051,
    "end": 3647.862,
    "text": "And saying and asking and writing is more than enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3647.982,
    "end": 3650.447,
    "text": "So thank you all for this fun time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.048,
    "end": 3651.61,
    "text": "See you next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.173,
    "end": 3654.055,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3654.115,
    "end": 3655.598,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  }
]