[
  {
    "start": 3.136,
    "end": 3.737,
    "text": " All right, welcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3.857,
    "end": 4.918,
    "text": "Thanks everyone for joining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5.378,
    "end": 14.446,
    "text": "This is the final recorded session on the first half of cohort four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 14.706,
    "end": 16.908,
    "text": "It's August 22nd, 2023.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 16.928,
    "end": 22.313,
    "text": "And we are going to discuss chapter five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 22.853,
    "end": 32.822,
    "text": "So before we look at what we might have ahead of us from questions or anything else, does anyone want to make any general comments on five?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 75.479,
    "end": 80.678,
    "text": " I'm just, anyone can give a thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.549,
    "end": 86.299,
    "text": "Just since we're on chapter five in the neurobiology,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 88.203,
    "end": 115.105,
    "text": " we talked I think a little bit in the chapter 10 closing discussion for cohort three about some of the topics like what is empirical evidence or what does any experimental setting have to do with free energy principle active inference and and we reflect a little bit on this recent paper that like with isomura at all that like broke through kind of another level",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 116.502,
    "end": 128.707,
    "text": " not necessarily even from a epistemic perspective oh I guess in terms of people's awareness it was epistemic in that sense then I was thinking about this was in 2018.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 128.767,
    "end": 137.886,
    "text": "I mean it's the same title",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 145.763,
    "end": 148.147,
    "text": " I know that the work has proceeded a lot since then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 148.247,
    "end": 171.906,
    "text": "So that's not to say they rehash the same, but in some ways, because there is a difference between map and territory between like models of X and X in a way there's like this eternal",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 173.658,
    "end": 203.445,
    "text": " gap that just continues to swallow up experimental results um much to the chagrin of people who think that just one more experiment is gonna gonna bridge or map the gap and that's kind of like what some of us are told as graduate students a lot of graduate school has to do with like creating a data set and people get into the zone of thinking that that one data set is going to be addressing a question even a narrow one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 204.455,
    "end": 208.681,
    "text": " And of course, like if it's not helpful, then let's not waste our resources to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 210.144,
    "end": 218.717,
    "text": "But at the same time, people were, um, saying that the relationship between gene expression and behavior was resolved in the nineties.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 219.618,
    "end": 221.641,
    "text": "And it's the same language that comes out today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 221.701,
    "end": 233.179,
    "text": "And then even in this kind of fractal free energy way, it's like, what were we looking for in the Petri dish again, Ali?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 236.517,
    "end": 261.782,
    "text": " Yeah, that was exactly what I was going to say, because in fact, I would love to see in newer editions of the textbook to see some of the new directions in what some people call radical biology to be incorporated much more than we see currently in the textbook, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.201,
    "end": 288.478,
    "text": " actually, the works of scientists such as Michael Levin, and even before that, I mean, Varela, Montana, and Capra, they show some radically new approaches to see biology and even life itself through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.712,
    "end": 296.531,
    "text": " I mean, the conceptions of autopoiesis and allopoiesis and other related terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.413,
    "end": 300.139,
    "text": "But I believe that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.389,
    "end": 320.077,
    "text": " Closer incorporation of these concepts into the textbook can help to see the bigger picture, which connects Bayesian mechanics as an overarching theory of every quote-unquote thing to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.397,
    "end": 329.67,
    "text": "Because the way it stands now, and in particular the way Chapter 5 stands now, there seems...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.005,
    "end": 343.925,
    "text": " quite a big gap between what Bayesian mechanics represents as a theory of everything and its neurobiological representation or I don't know, neurobiological evidence or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.686,
    "end": 357.784,
    "text": "But if there was, I mean, more material on these new directions of radical biology, I believe these gaps can begin to be,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 357.764,
    "end": 374.946,
    "text": " filled and the bigger picture can finally emerge as a kind of continuous picture without any significant and possibly confusing gaps in between.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.3,
    "end": 388.424,
    "text": " Anyone else want to give a thought on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.672,
    "end": 403.937,
    "text": "Just one speculation here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.25,
    "end": 423.732,
    "text": " The map territory theory practice the sort of dualistic dialectic is well no questions like what does math have to do with biology and what does statistics have to do with something like a system of interest so um that's kind of the classic um.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.652,
    "end": 449.027,
    "text": " we're dealing with another theoretical distinction within the domain of theory we're making a distinction not not um a uh homogenization but a distinction between the more theoretical physics axiomatic view",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 450.07,
    "end": 461.369,
    "text": " And the lens or tradition or method or approach or process theory described by active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 461.389,
    "end": 469.142,
    "text": "That level of, um, disentanglement of kind of like the platonic core",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.012,
    "end": 500.614,
    "text": " from the more manifest models in theory but theory in practice and that's like exactly where active sits so i think in the live chat for the symposium session duvid and i were kind of going back and forth and his contention was like well active inference has been like really um useful in the machine learning and artificial intelligence space but it hasn't it hasn't made any contributions to neuroscience",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 500.594,
    "end": 526.804,
    "text": " and then I mean there's so many angles to take on that point but like one is um is that it hasn't made many contributions relative to what you think another theory has done or is it it hasn't made enough contributions relative to what your preferences for what it could have done by this time are that that's um one angle but then the other angle that kind of presented itself was like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 528.083,
    "end": 555.643,
    "text": " like are we looking for experimental validation of the free energy principle or are we looking for people who want to apply active inference and that's the experimental validation I mean what if it was experimental validation of sum of squares linear aggression on electronic health care record data be like talk about a non-sequitur",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 557.108,
    "end": 586.474,
    "text": " decade after decade experimental validation of linear regression on rainfall and tree growth data how many decades before you just say we used a linear regression and if you think we could have used it better than tell us how or if you have another model other than a regression let's see it but that mobilizes the discussion in like a very radical way Ali",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.323,
    "end": 615.212,
    "text": " I guess I also don't think that active inference or FEP can be considered as a kind of niche theoretical thinking anymore, because recently, more and more often, I come across some articles or books that don't mention active inference or FEP at all, or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.597,
    "end": 626.147,
    "text": " I don't know any work related to active inference, but the ideas presented in these works are very, very similar to what active inference, to active inference as assertions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.608,
    "end": 630.619,
    "text": "So it looks like there's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 635.088,
    "end": 640.216,
    "text": " The box and active inference or FEP fits right into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.236,
    "end": 653.215,
    "text": "I mean, it's a theory that is proposed, I mean, at the right time and for the right audience, I believe, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.819,
    "end": 683.792,
    "text": " if it were proposed it was proposed about i don't know three decades ago uh maybe uh or probably it could go to into oblivion without um people being aware of any of its significance at all but as i say said it seems like the present time is kind of fertile for these kinds of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 684.481,
    "end": 699.683,
    "text": " not radical, but a bit out of the box thinking that can potentially help to reshape our understanding of life in its broader sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.764,
    "end": 711.079,
    "text": "So yeah, again, its current status seems to me like it's beginning to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.633,
    "end": 741.555,
    "text": " uh mainstream or at least if the early phases of a mainstream theory is truly evident from some recent work in this area yeah and it's so fun to see the memes and the narrative sharpen like when i was just walking around a few minutes ago i was thinking okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.974,
    "end": 771.407,
    "text": " reward maximization or precision optimization on getting more reward same thing but also surprise bounding is more general than reward but you could make a pure reward model we see that in in the textbook so it's like what's your first principle reward surprise bounding or something else or nothing or you haven't thought about it it's all it's all fine",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 771.556,
    "end": 792.737,
    "text": " but which one of them is it or you or do you want to pop out a level and even have like a different way of approaching the question so it's not like presenting a closed box it's like a more dynamical frame",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 794.202,
    "end": 822.657,
    "text": " which is largely potentially even overwhelmingly congruent with simply modern statistical physics and again then do you want to say well i have an alternate statistical physics branch or i have higher visions for what statistical physics could do than what it is doing it's like congratulations then you're a researcher now it still may be decades or never until you make a contribution",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 822.788,
    "end": 849.555,
    "text": " But that's exactly the path of a researcher, seeing an area and then thinking that it can go beyond and like, well, I don't have that alternative proposal for niche construction yet, but I want to be in the game to be there to recognize when it does happen, or I want to make something happen eventually, but merely waiting at the starting line",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 850.632,
    "end": 857.243,
    "text": " comparing frameworks to on described alternatives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.231,
    "end": 868.0,
    "text": "We barely even have the vocabulary to describe some of these conversational patterns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 871.608,
    "end": 898.864,
    "text": " and now we have more flexibility to like pop out and pull back to the meta science but again it's like okay so are you saying we can't use math to use to do in the context of neuroscience and some people may hold that perspective and that may be the conversation to have at that time but once the um or or somebody may think that the engineering tools like Burt brought this up many times in the symposium",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 899.907,
    "end": 929.138,
    "text": " that machine learning benefits greatly from decades of development on toolboxes and uh in in his section he was like yeah this is like the optimistic positive message is within months to years and Carl also alluded to it in the round table like we will have closer to push button Solutions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 932.577,
    "end": 950.054,
    "text": " So I think that really contextualizes a lot of what we're doing and learning when a lot of these formalities are going to get just like simply baked in and people will be engaging at more applied layers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 954.638,
    "end": 962.466,
    "text": "But all in the context of chapter five, where a variety of empirical data are being brought into play",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 962.952,
    "end": 971.81,
    "text": " We're talking about real anatomy, talking about real reflexes, neurotransmitters, real design patterns in the nervous system in the body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 971.83,
    "end": 981.67,
    "text": "So does anyone want to give a thought or ask any chapter five related questions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1002.507,
    "end": 1005.576,
    "text": " All right, let's just see if we can just see what comes through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.538,
    "end": 1007.561,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.344,
    "end": 1013.94,
    "text": "Schematic in figure five one shows layer five of the cortex projects to spinal pyramidal neurons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1014.0,
    "end": 1015.504,
    "text": "This can be interpreted as a prediction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1026.352,
    "end": 1030.598,
    "text": " spinal motor neuron and spinal pyramidal neurons are sometimes used interchangeably.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.839,
    "end": 1032.14,
    "text": "SP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1032.841,
    "end": 1033.101,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1041.492,
    "end": 1045.337,
    "text": "Anyone have a preference for which one of these questions to jump into?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.377,
    "end": 1055.751,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1056.592,
    "end": 1086.379,
    "text": " would be curious about the the question regarding how do habits and goals interact um i found this chapter interesting in part just because the introduction of habits or like the e variable i suppose yeah well let's start with what is the goal we're gonna have to reach outside of the active inference ontology to bring it in because we don't need goals",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.515,
    "end": 1094.862,
    "text": " Although at the same time, the term is used prolificately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1101.67,
    "end": 1102.892,
    "text": "Let's see how it's used in five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1105.655,
    "end": 1107.637,
    "text": "This is a mixed, mixed dialect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1114.866,
    "end": 1117.75,
    "text": "E and G are habitual and goal-directed drives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1121.83,
    "end": 1142.64,
    "text": " that's a very interesting sense of goal like in the um football soccer setting the goal is like a fixed external objective like a milestone but a culminating milestone",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1144.882,
    "end": 1152.331,
    "text": " But how is it being used here if by goal we mean something that G sharpens?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1153.974,
    "end": 1157.298,
    "text": "Well, in that case, well, first let's look at what E does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1158.079,
    "end": 1162.685,
    "text": "E is the prior on policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.705,
    "end": 1174.72,
    "text": "So it reflects before the observation comes in, before updating has happened, what are the prior probabilities of certain actions being taken?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.016,
    "end": 1183.007,
    "text": " And then that observation may not influence E. So E kind of gets passed through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1183.047,
    "end": 1188.977,
    "text": "And we see that in the basal ganglia, second example in the chapter, or it gets sharpened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1190.098,
    "end": 1201.737,
    "text": "So if we see expected free energy minimization as being goal directed, certainly it's not sufficient to say that goals are pragmatic only.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1203.539,
    "end": 1216.236,
    "text": " Because if we take everything that G encompasses, like that better policies as evaluated by G are more goal directed and inferior policies are less goal directed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1216.256,
    "end": 1232.719,
    "text": "Then up in the category of more goal aligned, like let's just say the two most goal directed policies, they may radically differ in their composition because one may be heavily loaded on pragmatic value",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1233.003,
    "end": 1260.462,
    "text": " homeostasis bringing observations into alignment with preferences and all that and the other policy might have a good expected free energy because of its high epistemic value and so it seems like at least just locally here though probably elsewhere in the book they're talking about goals in just this kind of broader cybernetic goal-oriented sense here we see the goal is like the process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1260.745,
    "end": 1282.585,
    "text": " And the goal is this imperative, or maybe there's other ways to read it too, but it's kind of like G is it's like, if you were trying to drive somewhere, there's like a location you're, you're trying to get there with a location and a time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1283.766,
    "end": 1286.509,
    "text": "You could, you could also think about that as precision in space and time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.57,
    "end": 1287.85,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.669,
    "end": 1292.854,
    "text": " which decisions are gonna be more goal oriented?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1293.295,
    "end": 1303.972,
    "text": "Well, if the goal is just the location on the soccer pitch, then the most goal oriented policy is the one that's like locally or globally taking you closest to the location on the soccer field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1305.294,
    "end": 1315.451,
    "text": "So that's a situation where like, you're like, yeah, there's time, but really like, let's just pursue the space or location as fast as possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1315.511,
    "end": 1316.993,
    "text": "We'll get there when we get there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1318.829,
    "end": 1336.649,
    "text": " But then if you say, well, we're going to hold up both of these features in this driving example, the space and the time, but in G, the epistemic and pragmatic, and we're going to say, well, actually the joint optimization of those two is what we're going to call our goal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1341.294,
    "end": 1342.896,
    "text": "That's a little different sense of goal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.955,
    "end": 1361.796,
    "text": " But it is used here and it's specifically used to talk about how habits and goals differ, namely where habits are reflecting the prior probability on taking different actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1363.959,
    "end": 1365.762,
    "text": "Kind of the pass through model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1367.227,
    "end": 1386.417,
    "text": " where observations don't influence what actions are likely to be taken though still actions may be taken at in equal frequencies whereas goal orientation means an increasing role for expected free energy in sharpening that policy prior into policy posterior Ali",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1392.286,
    "end": 1392.788,
    "text": " Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.632,
    "end": 1399.215,
    "text": "Well, yeah, another relevant remark here is about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.079,
    "end": 1400.44,
    "text": "You see,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.993,
    "end": 1430.123,
    "text": " There is this kind of teleophobia among biologists, and they usually try to avoid using the word purpose instead of goal, because they believe that although biological agency implies a kind of goal-directed autonomy, it doesn't necessarily require for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.103,
    "end": 1441.556,
    "text": " those agents to have any kind of purposiveness, as Dennett would argue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.996,
    "end": 1457.393,
    "text": "But the problem here, I mean, distinguishing between these two concepts is a kind of, I mean, as I said, it probably emerges from this teleophobia",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.71,
    "end": 1479.055,
    "text": " among biologists because any talk of purposiveness can be seen as provoking teleology, which is something that scientific culture has been very averse from many centuries ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1480.237,
    "end": 1483.06,
    "text": "But if we somehow",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.04,
    "end": 1499.732,
    "text": " Nadeem Goussous- define goals or purposes as a kind of mechanistic lawfulness to apparently purposive behavior, then this dilemma between these two concepts would probably be resolved, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1500.235,
    "end": 1506.646,
    "text": " In this case, we have basically defined a goal in terms of purposiveness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.926,
    "end": 1513.276,
    "text": "So they're not actually separate terms and they co-constitute each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.28,
    "end": 1518.565,
    "text": "Of course, the same kind of phobia",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.152,
    "end": 1549.159,
    "text": " was evident uh probably uh much more um it was a bit more prominent a couple of decades ago but it was also evident uh in the for for the concept of function but but it seems like this phobia has been diminished in recent years but nevertheless this teleophobic refusal to accept",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.139,
    "end": 1556.334,
    "text": " purposes as real factors in biology still remains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.414,
    "end": 1568.278,
    "text": "But active inference and some of these recent progresses in biology, as I said, works of Michael Levin and others,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.68,
    "end": 1585.726,
    "text": " are ways to somehow dismantle this dichotomy and this teleophobia and, as David Krakar would call, to see complex systems as a kind of teleonomic matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.387,
    "end": 1595.16,
    "text": "So it doesn't necessarily something that would require us to think about any, I don't know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.338,
    "end": 1613.865,
    "text": " Supernatural or supernatural entities or transcendental entities to get into the picture we can talk about purely naturalistic and mechanistic teleology as well, using these goals and purposes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.888,
    "end": 1618.212,
    "text": "In this kind of interrelated terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.352,
    "end": 1621.513,
    "text": " Yeah, great comments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1621.593,
    "end": 1643.274,
    "text": "One more piece on that from like the so-called argument by design, which has actually played a very interesting role arising most famously in the watchmaker analogy, which is like you're walking on, putting aside the big meta, which is like, what is the utility of any thought experiment or any like little narrative walkway that somebody provides you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.875,
    "end": 1646.477,
    "text": "It just is like, if you look at a watch,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1646.795,
    "end": 1670.423,
    "text": " you're going to infer intention of a creator and so then the argument sometimes plays out like we'll look at all the small bones in the ear or look at the way that the retina is um then the design argument became actually one of the design and engineering became some of the key pieces of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1670.403,
    "end": 1691.23,
    "text": " modern evolutionary synthesis in evolutionary biology but as ali alludes to there always was this kind of teleophobia as mike levin calls it sometimes or just like this awkwardness around like well are we going to appeal to just all functions just as they are so that's like a sort of like functional teleology just or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1691.21,
    "end": 1720.98,
    "text": " or does one go the kind of tayhart de chardin omega point bobby azarian angle like that is the account and where the radical biology in a way speaks that or cuts the knot is like the the hidden fallacy in the watchmaker um fuss is like it tries to transfer the analogy of a top-down function",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1721.618,
    "end": 1751.541,
    "text": " bestowment whereas if we have self-creating or co-creating or embedded arisal then we can say yeah like the circadian circuit arose through evolution and development as a bottom-up self-created in relation mechanism for just that telling time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1752.061,
    "end": 1779.199,
    "text": " So at the level of linguistic core screening, it makes sense to say that the circadian clock keeps time, just speaking super broadly here, like a watch keeps time, but there's a critical difference, which is that the watch was like an engineering artifact as the top-down projection of a cognitive system, whereas some kind of like internal organic representational system like a circadian clock keeps",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1779.466,
    "end": 1809.0,
    "text": " is actually like a bottom-up construction so like there just isn't an issue with describing or understanding goals and it's just an english word anyway once we really start to get into the specifics with agency and habit a lot of this may just dissipate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1814.38,
    "end": 1841.164,
    "text": " and then the more recent multi-scale formalizations the habits can include like like the phylogenetic scale or the habit could refer to just what has passed through a moment to moment in the organism's life or you could imagine this as being like a intergenerational transfer and a habit or a a developmental tendency for a habit is also able to be inherited",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1846.409,
    "end": 1850.255,
    "text": " Andrew, any thoughts on that or wherever anyone else wants to go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.528,
    "end": 1864.676,
    "text": "No, I don't have any deeper thoughts on that, I suppose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1865.517,
    "end": 1874.29,
    "text": "I guess I'm more interested in the sort of computational aspect of it as far as message passing goes rather than, I mean, I find all of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1874.843,
    "end": 1883.816,
    "text": " The kind of the more abstract philosophical side of discussing what goals are very interesting and in certain ways very important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1885.318,
    "end": 1887.801,
    "text": "When putting together a framework, but I guess here it's just.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1889.183,
    "end": 1902.302,
    "text": "I just found it interesting like Oh, now we have habits, in addition to G, which I previously considered to be like just expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1902.873,
    "end": 1928.982,
    "text": " but maybe I have my terminology mixed up here is this G not the same as um oh you're totally right and I think that's just it's a little um coincidental alliteration and G never stands for goals it's just a total typographical spandrel so then the question becomes what is the goal concept broad enough to encompass what it is that G does",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1931.476,
    "end": 1936.403,
    "text": " And that's clearly not the same thing as just like the mile marker on the side of the road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1942.333,
    "end": 1951.967,
    "text": "But then a little bit more on the computational side, E primes the pump for the procedure that G does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1953.489,
    "end": 1955.813,
    "text": "Like the shape of the variable E",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1957.97,
    "end": 1980.94,
    "text": " is the same shape that gets taken into g the cells in the in the variable e are what get sharpened by g as it iterates through every policy and calculates its expected free energy so e and g um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.287,
    "end": 1988.978,
    "text": " they both are engaging with this policy variable, which is just a list of all the possible policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1989.058,
    "end": 1995.328,
    "text": "So all the affordances basically raised to the power of how many time steps that you want to play it out for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.368,
    "end": 1998.473,
    "text": "And, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2000.242,
    "end": 2030.164,
    "text": " g sharpens what e provides or modifies what e provides and the gamma the temperature parameter on on decision making um here associated with dopamine neuromodulation is modulating that trade-off between the the e pass forward",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2032.169,
    "end": 2061.248,
    "text": " in the indirect pathway there's kind of type one and then the um policy updating driven by g sure no thanks for kind of giving more explanation on that it's um so i i find that very interesting then because at some point in here it refers to like um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.628,
    "end": 2067.714,
    "text": " I'm sorry, I can't find it immediately, but the use of the word context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.775,
    "end": 2076.023,
    "text": "So it's as if E. So those are your priors over policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.083,
    "end": 2079.747,
    "text": "And so you're lacking something like context of the given.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2079.767,
    "end": 2089.378,
    "text": "The agent is lacking context in a given moment, I suppose, such that one might rely upon",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.578,
    "end": 2119.247,
    "text": " their habits to deal with the scenario whereas g is in fact taking into account not only e but context in the sense of oh uh the agent is taking in observations um it's computing expected free energy um it i guess i'm just putting everything together as far as i understand it so it's e prime you start with e you enter into some context with a variety of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2119.75,
    "end": 2144.222,
    "text": " observations or otherwise from there you begin to compute g and then from there you can start to actually score potential policies to be taken with some of them deemed to be more minimizing of free energy given the context and so on versus e which seems to be more or less static through the whole computation does all that track",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2145.4,
    "end": 2164.27,
    "text": " yeah great points so definitely when you set it up you could make it so that e is fixed or that you can make it so that e counts like earns that's one simple learning technique but but it's a great connection with context so like let's just say that we are um playing cards and then it's like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2164.773,
    "end": 2191.911,
    "text": " main idea is we have beliefs about how we act in particular context you know i we're playing um 21 blackjack and i stay 80 of time just habitually so the two cars are dealt face down habit is before the context is recognized or uh paying no attention to context you take the the 80 stay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2192.38,
    "end": 2199.51,
    "text": " And then context, we could translate as basically like the sensory observations and the ensuing sense-making.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2200.471,
    "end": 2213.909,
    "text": "So now you look at the cards and then you're going to sharpen through G. Again, that doesn't even mean it's better than playing on reflex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2213.949,
    "end": 2215.671,
    "text": "It doesn't mean it's better than playing 50-50.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2215.691,
    "end": 2216.513,
    "text": "It doesn't mean you're going to win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2216.533,
    "end": 2222.1,
    "text": "It doesn't mean like all these like kind of outcome-oriented possibilities in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2222.806,
    "end": 2249.488,
    "text": " but it is the case like if one lets the card that they saw influence their decision making we would model that as the generative model using expected free energy based policy evaluation planning as inference even if it's just one time step planning that's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2250.532,
    "end": 2259.967,
    "text": " how we understand the situation where a person who stays 80% of the time looks at the cards and makes a decision that differs from that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2263.973,
    "end": 2265.535,
    "text": "Or it could be who else is at the table.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2266.517,
    "end": 2278.075,
    "text": "And then, so then they wanna make a certain move, not because it aligns their pragmatic value with winning the pot, but that it gains them information",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.477,
    "end": 2304.602,
    "text": " about who they're playing with in their strategies which speaks to this kind of thinking through other minds topic and also just the need to build specific generative models because how can we talk about what is an expected free energy minimizing decision in the context of a of a blackjack game unless you've delineated like what is even being considered",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2307.029,
    "end": 2313.597,
    "text": " But now think about how far people go beyond the blockjack game, talking about what does and doesn't reduce expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2327.355,
    "end": 2328.376,
    "text": "Thanks again for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2328.937,
    "end": 2330.058,
    "text": "That was very clarifying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2330.098,
    "end": 2336.867,
    "text": "And so suddenly the phrase is model-free versus model-based.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.252,
    "end": 2366.972,
    "text": " systems in this context makes a lot more sense yeah model free just kind of flailing but that may be an effective flail and it may be an effective way to go or model based is where you get more explicit structuring um okay this one's a freebie popcorn in the chat or however what other neural systems are interesting to model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2370.395,
    "end": 2372.459,
    "text": " other than the three that are in chapter five?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2379.311,
    "end": 2386.885,
    "text": "What's another mammalian neural region or non mammalian system that would be fun to model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2397.293,
    "end": 2404.805,
    "text": " Actually, I would very love to see active inference applied for modeling emotion circuitry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.107,
    "end": 2421.411,
    "text": "And in fact, it's an ongoing project of mine, but it proves much more complicated than I previously imagined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.37,
    "end": 2442.336,
    "text": " Well, some preliminary works have been done by people like Ryan Smith and others, but there still needs, I mean, lots of work for this kind of modeling to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.43,
    "end": 2450.803,
    "text": " to be as mature and sophisticated as some other areas that active inferences has been applied to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.625,
    "end": 2467.733,
    "text": "But for me personally, it's a really interesting prospect to see how modeling emotions and even modeling emotion itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.742,
    "end": 2491.257,
    "text": " using active inference terminology and concepts would reveal some deep mysteries about emotion and its relation to cognition and other mental faculties so yeah that's one area of interest",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.27,
    "end": 2505.347,
    "text": " cool a few things that um Dr Anna Lemke said today in the round table that that stuck with me one was like about this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2508.348,
    "end": 2538.355,
    "text": " co-presentation i won't even call it attention or a paradox between accepting higher power and taking agency in one's own life which she related to her like context in the psychiatry and addiction setting and then also it came up later like um with precision and uh monitoring and the increasing ability for monitoring of our biometrics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2538.335,
    "end": 2566.249,
    "text": " um and like just the bigger picture on how like maybe knowing your heart rate at all times maybe it spirals off in all these different ways like now you have too much precision on heart rate you're paying too much attention to it or um there was just a lot of interesting pieces there and then also there was a discussion about like limitations of the brain as a predictive system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.444,
    "end": 2589.52,
    "text": " or of modeling the brain as a predictive system and yet again another place where action comes in to like save the day slash slam dunk because it's like well yeah when it's a prediction about what you're about to do it's only a prediction for so long and then it happens",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2591.423,
    "end": 2602.837,
    "text": " So it's like a lot of these like prediction, like they're often implicitly in this kind of like archaic dark room setting, like where actions can't be taken.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2602.897,
    "end": 2606.401,
    "text": "And it's just a perceptual question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2607.723,
    "end": 2620.198,
    "text": "But we know that perception plays, action plays a role in perception itself through the eye saccade and through the example at the beginning of the textbook, where like you can't determine the texture of a fabric without moving your fingers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2623.486,
    "end": 2650.388,
    "text": " so it's like well it's not demeaning to say that it's predictive when it gets implemented a split second later but all but so much of the predictive discussion focuses just on like on like you know predictive analytics predictive forecasting what's going to be the most popular song next year",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.308,
    "end": 2656.198,
    "text": " And that's a very removed way of considering the role of action and inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2657.681,
    "end": 2659.385,
    "text": "But yeah, a lot of neural systems to model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2665.28,
    "end": 2666.503,
    "text": "Okay, just kind of a related question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2667.887,
    "end": 2670.132,
    "text": "What point does... Oh, Ali, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2673.47,
    "end": 2688.005,
    "text": " Yeah, I just wanted to make maybe a sideway remarks, but there's even this recent trend toward the probabilistic aesthetic theory of art.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.586,
    "end": 2693.13,
    "text": "So, and especially as applied to avant-garde or contemporary art.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2693.15,
    "end": 2695.773,
    "text": "So, and they call it predictive arts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2696.774,
    "end": 2700.658,
    "text": "So one pioneer in this area is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.925,
    "end": 2710.3,
    "text": " Konrad Wojnowski, who also has an upcoming book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.001,
    "end": 2715.128,
    "text": "I think it will be published in February 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2715.628,
    "end": 2723.541,
    "text": "But yeah, as you said, these kinds of probabilistic modes of sensing and making sense of reality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.977,
    "end": 2733.582,
    "text": " because it started to be applied to even aesthetics and I mean, contemporary art criticism as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.211,
    "end": 2760.717,
    "text": " well yeah i remember this this paper this was what i was in the um the the buy it based on the title phase of my graduate school access to free printing and i just remember thinking this was like the funniest and boldest title because it's like several sentences and it has all these weird illusions in it but um this uh and i think active",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2762.57,
    "end": 2792.172,
    "text": " goes beyond it but on the left side here is the time scales like from like the the 100 millisecond you know visual region this and that and the shorter term memory and okay we're at an exhibit so there's the context window of like what we've seen from the exhibition and then it even expands out to like let's see how slow it gets in the very slowest very very slow like lifelong Mastery I think or something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2794.075,
    "end": 2808.861,
    "text": " transformation 60 plus seconds but then but but then the transformative capacity and and and uh burt talked about in the symposium with like the need for longer term",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2809.735,
    "end": 2834.443,
    "text": " lower resolution estimates and how a key engineering question right now is being able to adjust basically the computational resources allocated to different kinds of estimates so I gave an example of like if you're going to drive three quarters of the way around a roundabout you don't need to know like what centimeter it's going to be at",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2834.845,
    "end": 2862.743,
    "text": " just want to know what lane you're going to be in but the next centimeter might matter for the next centimeter and so being able to like dynamically tune or develop hierarchical structures or other kinds of inference uh architectures where we're getting a lot of like bang for the buck because we're using our cpu cycles and other resources but ultimately attention and trust on like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2862.892,
    "end": 2868.223,
    "text": " We're not calculating 12 decimal points for something that could have just been left at one and vice versa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2877.742,
    "end": 2880.006,
    "text": "Where does reasoning sit in five, five?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2906.935,
    "end": 2928.623,
    "text": " I think it depends what you define reasoning as but looks like in some previous discussions we've talked about like reasoning as unconscious inference and just depends on what is meant by reasoning is it any kind of reckoning or is this specifically like a consciously aware one but that's that's a good question is FEP applicable to any system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2934.188,
    "end": 2934.649,
    "text": " Let's vote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.909,
    "end": 2936.091,
    "text": "The perennial question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.694,
    "end": 2939.656,
    "text": "Okay, I'm going to flip a coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2940.216,
    "end": 2940.937,
    "text": "I'm going to flip a coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2940.998,
    "end": 2942.159,
    "text": "This is going to be a real coin flip.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2942.179,
    "end": 2944.803,
    "text": "I'm going to use the real entropy of my room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2948.949,
    "end": 2951.993,
    "text": "It was not a coin with heads or tails, so it was not a conclusive answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2953.235,
    "end": 2957.581,
    "text": "But I hope that in future discussions we can figure out more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.345,
    "end": 2962.828,
    "text": "Generalist tools to interact with Bayesian mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2965.373,
    "end": 2986.487,
    "text": " I think I remember this question being asked and who asked it and the mechanisms in the brain at the, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2987.733,
    "end": 3017.622,
    "text": " on this topic actually the uh the first presentation in the symposium by andre bastos this was very much like like welcome to the neuroscience conference like not not not grandstanding at all with a theoretical connection just like this is how it's being visually processed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3018.108,
    "end": 3020.351,
    "text": " Here's how we're doing more and more measurements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3020.571,
    "end": 3022.533,
    "text": "Here's how theory is guiding our experiments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3031.184,
    "end": 3041.516,
    "text": "And it did come up to this like multi-band alpha, beta, and then the gamma, like the differential, which we talked about, I think in one or two times ago, differential frequencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3044.72,
    "end": 3047.203,
    "text": "Well, cohort three,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3049.478,
    "end": 3078.928,
    "text": " um sorry daniel there was this question i think the one down the last one you talked about about uh is there any alternative representation for something like that yeah are there alternative visualizations that better i so i think we have an additional answer to this question now uh because of chantal's work and string diagrams so oh great point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.938,
    "end": 3086.016,
    "text": " Yeah, I believe Jana made this image.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3086.857,
    "end": 3095.566,
    "text": " And then I know that Bert Berkers has done a ton of work in like alternative visual and, and tactile metaphors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3096.167,
    "end": 3098.99,
    "text": "And then on the more formal side, you're absolutely right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3099.05,
    "end": 3106.698,
    "text": "That the strain diagram may even, or some of the representations that Sanjeev is developing in the fundamentals work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3106.718,
    "end": 3110.001,
    "text": "Certainly we're seeing things that are like familiar, but also different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3111.383,
    "end": 3115.547,
    "text": "So great works cohort four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3116.084,
    "end": 3118.967,
    "text": " That's our final recorded discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3120.108,
    "end": 3124.332,
    "text": "Next week, we'll have feedback and talk a little bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3124.372,
    "end": 3135.922,
    "text": "Then we'll take a few weeks off and get the gang back together for cohort four, part two, and for cohort five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3136.683,
    "end": 3140.727,
    "text": "And we'll talk more next week about the timing for everything and see what works for people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3141.067,
    "end": 3142.969,
    "text": "So thank you all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3144.265,
    "end": 3144.853,
    "text": " Till next time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.076,
    "end": 3145.684,
    "text": "Thanks everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3146.637,
    "end": 3147.508,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  }
]