[
  {
    "start": 3.828,
    "end": 28.603,
    "text": " okay it's September 14th 24 or 16th like my clock was looking weird um we're entering chapter nine for cohort six um do either of you want to type or ask any topics you want to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 32.482,
    "end": 55.08,
    "text": " cover explore for nine otherwise we can look through the chapter i was actually about to i'm sorry go okay good i was actually going to ask if we could just like run through the chapter because this was the first chapter that i was like oh man we are jumping into creating this model uh could we just run through uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.921,
    "end": 71.905,
    "text": " one time into going through like what was the data and what was the model that we were actually applying as well as just going through the loop of the gear i'm sorry i've lost the figure it doesn't really matter for that last part yeah got it okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.062,
    "end": 77.387,
    "text": " Pulling back, I think going over the chapter is the first thing that we'll do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 77.427,
    "end": 80.091,
    "text": "Then there's the questions and some notes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 80.852,
    "end": 85.279,
    "text": "And then there's also looking at software, just speaking generally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 85.319,
    "end": 88.283,
    "text": "Maybe we can do that in one or two weeks from now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 89.084,
    "end": 96.595,
    "text": "Looking at the JAX branch on PyMDP, looking at RxInfer, and looking at other empirical work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 96.856,
    "end": 99.66,
    "text": "Let's start with the chapter though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 99.8,
    "end": 99.9,
    "text": "Okay."
  },
  {
    "start": 100.555,
    "end": 125.803,
    "text": " second half of the book applying active inference coming fresh off of chapter six recipe chapter seven and eight giving the continuous and discrete time now getting to using the models that are created for data analysis that's kind of revealing that in all the previous chapters two three four um not five",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.783,
    "end": 149.142,
    "text": " but then seven and eight when talking about building a generative model it's to produce synthetic data like to run a simulation forward here now we're also or alternatively looking at a setting of having a certain structure of data and then seeking to recover latent parameters instead of specifying the latent parameters and then generating the synthetic observation like data",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 149.915,
    "end": 157.426,
    "text": " Our general goal is to recover the parameters of the generative model that system of interest uses to produce behavior, subjective model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 159.228,
    "end": 161.872,
    "text": "9.2, Metabasian methods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 161.892,
    "end": 165.036,
    "text": "This is really well summarized in figure 9.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 166.018,
    "end": 179.517,
    "text": "It's like zooming out a layer from figure 4.3, figure 7.3 type, POMDP, hashtag model stream 14.1,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 180.357,
    "end": 207.478,
    "text": " um umdp that we've been specifying talking about minimizing the variational free energy and so on zooming out saying okay not just the mouse and the teammates now considering the observations for the mouse are actions for the researcher and then conversely the output behaviors of the mouse are objective observations for the ethologist",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.522,
    "end": 214.077,
    "text": " Interesting how it's using the notation of like the subject centered view.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 214.782,
    "end": 244.738,
    "text": " because it's it's calling them oh where whereas you might also call them actions the researcher and then it's like it gives the the hint of the suggestion okay yeah you could make a policy if you wanted to do policy control variable um like another Pi sub scientist and then have that connect to O but otherwise we're just taking this as a given so we're just taking that as the input data for here and so that subjective model which does the forward",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 244.718,
    "end": 263.554,
    "text": " inference which is like um the kind of perception action loop that it's focused on that's happening with a given set of observations in an experimental context and outputting some behavior so this kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 264.378,
    "end": 277.813,
    "text": " showing okay the data like the input data here's the the information we knew on the which where we put the food in the tea maze and here's the actual sequence of moves that the mouse made",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 288.442,
    "end": 301.017,
    "text": " um brief little statistical interlude that starts to to Bridge back from this question of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 305.637,
    "end": 311.266,
    "text": " reducing uncertainty of the unknown parameters of interest, figuring out the subject's prior beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 311.607,
    "end": 313.81,
    "text": "It's like, we know where their eye saccades were.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 314.371,
    "end": 315.413,
    "text": "That's just empirical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 316.415,
    "end": 318.298,
    "text": "Or we know which things they bought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 318.558,
    "end": 319.6,
    "text": "That's just empirical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 319.88,
    "end": 330.818,
    "text": "But then to do belief modeling, cognitive modeling beyond just the pure behaviorist layer, then that is reducing uncertainty about these causal parameters of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 330.798,
    "end": 336.149,
    "text": " So how are those going to be analyzed from real finite data?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 338.173,
    "end": 339.937,
    "text": "They go into variational Laplace.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 340.277,
    "end": 346.41,
    "text": "This is something brought up in other textbooks, in the SPM textbook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 353.545,
    "end": 372.508,
    "text": " Okay, 9.3, 9.4 giving like two different ways, more of a classical statistically parametric, and then more of a empirical Bayesian approach to fitting a first kind of structural layer on these hidden belief distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 374.791,
    "end": 382.0,
    "text": "Variational Laplace centers a Gaussian in the log likelihood",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 382.199,
    "end": 393.269,
    "text": " Thomas Parr discusses this in 57.1 or 0.2, fits a Gaussian on the log likelihood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 393.309,
    "end": 402.117,
    "text": "So in the actual likelihood space, it doesn't have like a, or it's a parabola in the log space and then like it looks different in the non-log space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 402.678,
    "end": 411.666,
    "text": "But this just fits a central tendency on a belief distribution parametrically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 413.165,
    "end": 438.919,
    "text": " that that doesn't require any um that doesn't that fits a simple distribution to uh data parametric empirical base takes a slightly different approach which is like to kick start the estimation of the prior from the empirical overall distribution of the data or like a previous or related experiment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 442.696,
    "end": 446.662,
    "text": " Here's the instructions for doing the model-based analysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 446.922,
    "end": 452.391,
    "text": "So collect data first, or maybe the data are already collected, like it's a meta-analysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 454.754,
    "end": 463.948,
    "text": "So just like the previous figure, the data that are important here are like, you know, the input, which arm was the food on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 464.108,
    "end": 466.071,
    "text": "Which color was the strobe light?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 466.186,
    "end": 493.122,
    "text": " then the context of the experiment if if only to normalize out and say yeah actually the uh the digit in the in the minutes column has no correlation with this but it might be something just included formulate a pomdp model so that's as we saw here with taking the subjects",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 493.253,
    "end": 516.544,
    "text": " kind of first-person perspective on taking in observations and how it does its belief construction here's a map describing its belief construction representation and then um how that information becomes actionable and then we have just empirically the information on the temperature of the room and the the teammates",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 519.697,
    "end": 523.282,
    "text": " This information in the list is summarized in Figure 9-2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 523.642,
    "end": 528.489,
    "text": "So we had data collection, or we're reviewing some data that were already collected about the T-MACE.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 529.43,
    "end": 531.893,
    "text": "But we have the lab-type data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 532.574,
    "end": 539.002,
    "text": "Then we have Chapter 7.3 POMDP for the T-MACE.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 542.968,
    "end": 546.312,
    "text": "Three, specify likelihood function, Equation 9.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 550.105,
    "end": 579.707,
    "text": " action selected depend on the observations made we could look more about this but it kind of gets to the punch line of the and and it's kind of subtle with the bold and what and the bold being vector but the the policy that's selected is the the argument that's minimizing the variational free energy over all the policies so that's a like how um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 581.459,
    "end": 610.926,
    "text": " how decision making is going to be evaluated from the outside as if it's minimizing free energy as opposed to other approaches like as opposed to it maximizing reward this tells us how the model should be used to calculate a likelihood this typically calls a pmdp solver spm mdp vbx it's interesting these are like super oft referenced",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.437,
    "end": 642.145,
    "text": " scripts they're in matlab there are matlab engines that can call matlab if you have a real license from other languages so it can be really called within python um other options there's octave which is like an open source cousin of matlab oh well there's spm standalone which is actually matlab but it's just like a reduced kind of single s spm only um download",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 642.293,
    "end": 644.175,
    "text": " Then there's Octave and Patches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 645.457,
    "end": 652.625,
    "text": "I don't know how well the coverage is for patching certain things of SPM MATLAB into Octave.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 653.126,
    "end": 658.292,
    "text": "There's Julia SPM, which is an attempt to port over to Julia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 659.133,
    "end": 661.316,
    "text": "There's PyCall and JuliaCall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 661.756,
    "end": 664.96,
    "text": "So basically calling languages within each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 664.94,
    "end": 691.386,
    "text": " um and the getting these scripts which are kind of key central pillars of a lot of the inference across prior papers getting these scripts into um non-proprietary more easily callable um methods and implementations it's it's huge",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 694.235,
    "end": 699.3,
    "text": " Four, specify prior beliefs about the parameters in terms of expectations and precisions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 703.925,
    "end": 708.81,
    "text": "Here, setting a prior just to give an initial condition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 708.87,
    "end": 717.139,
    "text": "Again, that could be parametrically gleaned from data, or it could be empirically set like PEB.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 718.58,
    "end": 721.103,
    "text": "Inverting a model is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 723.158,
    "end": 751.174,
    "text": " using this rearrangement that's possible with bayes equation and using kind of algebra and separation from there to calculate what we're interested in which is like the belief the the the um distributions of subjective beliefs beliefs of the mouse in the teammates conditioned upon all the stuff that we're putting into the model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 752.538,
    "end": 764.364,
    "text": " Whereas the synthetic generative direction would be given the ad hoc specification of belief distributions, like what if it thought it was three times more likely?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 765.266,
    "end": 769.095,
    "text": "Then you could generate realistic trains of behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 770.003,
    "end": 793.317,
    "text": " you take those final behavioral data estimates and it's like, here's five days of the week we did the experiment and belief whether we calibrated or didn't calibrate, like whether it's just a fear score or it's calibrated or it's somehow normalized, like it's a percentile or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 793.497,
    "end": 797.783,
    "text": "And then this is like a figure, just normal figure from a paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 797.982,
    "end": 811.581,
    "text": " We had five different condition groups and their belief on this distribution, here it was seven plus or minus one, five plus or minus one, one plus or minus one, negative one plus or minus one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 812.242,
    "end": 813.864,
    "text": "And then you can just do a t-test.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 814.705,
    "end": 817.61,
    "text": "And then you put little stars, statistically different groups.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 820.013,
    "end": 825.12,
    "text": "That's the main outline for nine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 825.252,
    "end": 834.268,
    "text": " I think it'll be awesome to see fully worked cases, like if we can get a repo that has all of these steps labeled this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 834.308,
    "end": 837.794,
    "text": "The last piece is 9.6 gives a few examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 837.814,
    "end": 845.287,
    "text": "9.3 looks at iCicade in a continuous and in a discrete control setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 846.63,
    "end": 848.593,
    "text": "We could look to the paper if we wanted to look at that one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 850.632,
    "end": 858.204,
    "text": " Table 9.1 reviews many citations where these kinds of methods have been applied.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 860.508,
    "end": 861.129,
    "text": "That's the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 869.241,
    "end": 875.391,
    "text": "So it's interesting because nine is like, it's kind of like a Jimi Hendrix thing, if six were nine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.164,
    "end": 879.791,
    "text": " And then six is like the recipe for building the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 880.532,
    "end": 887.486,
    "text": "And then nine, starting, well, we still have to build it as per six.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 888.889,
    "end": 889.991,
    "text": "But it's another recipe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 891.333,
    "end": 893.177,
    "text": "But they don't call it a recipe here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 906.995,
    "end": 912.3,
    "text": " Any thought or what should we continue with?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 923.41,
    "end": 926.893,
    "text": "Whenever they introduced, I think it was the variational applause.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 927.013,
    "end": 927.894,
    "text": "I may be misremembering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 927.934,
    "end": 932.518,
    "text": "They casually brought up, oh, yeah, you don't really need to understand this, but this is predictive coding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 932.538,
    "end": 934.2,
    "text": "This is just the example we're using.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.822,
    "end": 947.555,
    "text": " If you don't mind, could you say a little bit about, if I'm remembering correctly, predictive coding, as well as in your experience, like what kind of models are being used right now in active inference in general?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 947.856,
    "end": 953.862,
    "text": "Is it all going to be like just taking about the same model and trying it through different things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 954.022,
    "end": 959.648,
    "text": "Are many different models used whenever you're actually building these experiments or is it just really, really diverse?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 962.902,
    "end": 964.666,
    "text": " Yeah, good questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 964.686,
    "end": 965.007,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 967.633,
    "end": 976.152,
    "text": "And then let's look at this page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1010.945,
    "end": 1011.667,
    "text": " Hmm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1011.807,
    "end": 1012.268,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1012.288,
    "end": 1012.869,
    "text": "2007 here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1012.889,
    "end": 1019.886,
    "text": "2007.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.126,
    "end": 1024.436,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1024.476,
    "end": 1029.207,
    "text": "First, let's see where it came up in this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1043.007,
    "end": 1059.953,
    "text": " okay this is totally pending pending pending just um seeing one um just kind of one take on it look octopus or others might be able to bring a lot more detail in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1061.738,
    "end": 1065.524,
    "text": " This is coming from the parametric statistic approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1066.505,
    "end": 1079.325,
    "text": "So kind of classical, pre-computational, at least pre-1900s, let's say, approaches to fitting distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.305,
    "end": 1094.526,
    "text": " Whereas once you can do parametric empirical Bayes or like sampling based methods, then there's this whole alternative branch of doing sampling to fit analytically intractable distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1095.227,
    "end": 1100.275,
    "text": "But if it's going to be like, well, how do you make it more analytically tractable?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1100.795,
    "end": 1109.127,
    "text": "That might be advantageous or simple, might be ineffective, but also it really does have certain advantages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.107,
    "end": 1136.818,
    "text": " if it if it if it totally mangles the underlying structure then again it wasn't adequate so this isn't to say that it's adequate for every distribution but if you do a sampling based approach then you have to also put a nice behaving continuous distribution over that or or choose to not do that because the sampling gives you a good shadow or kind of scatter if you do it well but it still doesn't have the kind of smoothness",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1137.068,
    "end": 1165.405,
    "text": " so it's kind of like if you want to get to the parametric why not go directly from um the data instead whereas now it's sometimes sampling is thought of as as an alternative approach but it doesn't really get to the same end point this is a incrementally like Matrix gradient based method",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1165.874,
    "end": 1183.005,
    "text": " to fit based upon the the gradients of um of a Gaussian or a parabola or something downward facing over log likelihood and Thomas part mentioned it more on the stream",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1192.52,
    "end": 1206.662,
    "text": " Possibly because it's working, again, whether it's, okay, maybe it is a Gaussian, fitting a Gaussian, but then the Gaussian is locally approximated with a quadratic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1206.682,
    "end": 1214.374,
    "text": "So then that keeps the approximation of the gradient possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1218.08,
    "end": 1219.202,
    "text": "This paper describes it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.422,
    "end": 1226.368,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1248.641,
    "end": 1249.763,
    "text": "That's just the preview.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1252.409,
    "end": 1277.877,
    "text": " but it seems like a lot for the preview okay so maybe for us to learn more about but it's a tractable way to use gradient information geometric gradients to incrementally optimize statistical models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1281.198,
    "end": 1309.078,
    "text": " being proposed existing kind of alternatively to a sampling based approach how is it actually being applied this is a great question like whenever I come across code or GitHub I try to bring in this table everyone everyone else can too as we build many more we'll think of better ways to organize it as as the number of examples gets way larger than this um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1309.514,
    "end": 1320.228,
    "text": " I mean, there's the whole RxInfer, RxEnvironments branch that's rapidly growing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1322.131,
    "end": 1329.58,
    "text": "And there's a lot of MATLAB and SPM ones that are not added in here, but there's that large branch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1329.6,
    "end": 1333.986,
    "text": "Those ones mostly...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1334.033,
    "end": 1363.99,
    "text": " call back to those spm vbx bays spm um mdp check except like all these kind of names so there it's like friston at all curated the functionality of those core utility files and then papers would use relatively simple generative models and then just know that if it was built a certain way that the um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1364.628,
    "end": 1386.957,
    "text": " generative and the data fitting directions would work so that's the kind of matlab um there's there's a long tail of languages like in the active inference package like rust go shell just like a bunch of random languages they're not super performant but it's enough to get started",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1387.966,
    "end": 1397.98,
    "text": " C++, haven't seen any presentations per se using it, but I think some on the more engineering side might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1398.0,
    "end": 1410.758,
    "text": "Of course, one of the major questions is like, well, this is what is known in open source research, but anything other than that, of course, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1412.201,
    "end": 1416.066,
    "text": "On the Python side, there's PyMDP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1416.552,
    "end": 1422.159,
    "text": " which is the main Python package.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1423.521,
    "end": 1437.098,
    "text": "It has a characteristic and lovable slash challenging file structure that can make it a little challenging to get the exact thing you want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1437.598,
    "end": 1445.428,
    "text": "However, there's a folder jacks, which is bringing in the kind of jacks, and there's more active work on this in the branches too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1445.527,
    "end": 1453.034,
    "text": " So there's a lot of work there kind of to the chapter nine theme of fitting from data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1453.055,
    "end": 1472.614,
    "text": "There's a lot of other Python work in model stream 14, which was shown briefly earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1474.045,
    "end": 1497.808,
    "text": " ran way said that deep dreamer he said that friston said deep dreamer it is basically active inference so i mean at least i think rand said this which makes sense because one of the collaborators was danger hafner so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1498.936,
    "end": 1504.326,
    "text": " I think if we kind of just return to the original, what are the applications of Act-Inf?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1505.989,
    "end": 1507.972,
    "text": "What methods are people using to apply it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1508.733,
    "end": 1513.883,
    "text": "There's the threads and the streams that can be followed from here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1513.923,
    "end": 1521.957,
    "text": "And then there's the parallel slash is it Act-Inf question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1522.021,
    "end": 1537.468,
    "text": " If you end up with a pragmatic and epistemic element to a RL or meta RL or POMDP type model, or something that can be described as such, I mean, has that not reached active inference from the low road by another way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1539.311,
    "end": 1539.912,
    "text": "What do you think?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1549.696,
    "end": 1578.977,
    "text": " i kind of wanted to ask you about that especially at the end of the live stream he was talking about how there's different spaces that you could use as well as a work that i've never heard of before by uh simone i think he said uh from the oxford lab and he was saying that you can think of the model in terms of of course the model itself where we're doing a gradient descent so we're actually going to be able to talk about gradients flowing in one direction we can also talk about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.273,
    "end": 1586.621,
    "text": " of the actual concept space of the model, like Shimon was talking with representation spaces, I think it was called.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.202,
    "end": 1596.173,
    "text": "And then there's also going to be the thing that we're learning about right now, which is designing the environment through the POMDP and then having the model learn from that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1596.614,
    "end": 1598.336,
    "text": "So there's going to be some environment space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1598.817,
    "end": 1602.221,
    "text": "There's going to be some belief space that the model uses to interact with the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1602.802,
    "end": 1607.648,
    "text": "And then there's also going to be the model itself, which is going to be in the space that back propagation is really natural.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1607.932,
    "end": 1620.109,
    "text": " I bring this up because in Figure 9.2, like we were looking at earlier, whenever we're actually looking at the model, we're thinking of it in the space of, oh, what are we looking to get out of it, which may not be the same space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.149,
    "end": 1633.888,
    "text": "It may be like the POMDP, like the environment space that the model is working with that we're designing is not the native space that the model is working in, which is going to be the belief space, which reminds me a lot of Markov blankets, which maybe that has nothing to do with anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1634.358,
    "end": 1656.703,
    "text": " but i thought that was going to be an interesting link and i wanted to get your thoughts on it the movement of spaces of the changing of spaces as you move through these squares yeah let's return to the question let me just copy out what this quote was because i mean this is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.733,
    "end": 1683.163,
    "text": " this is this is very interesting to it that ran well for those who have not seen it it's it's really an informative stream some of the most information density on um epistemic value pragmatic value connections with active inference and reinforcement learning um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1684.409,
    "end": 1692.518,
    "text": " A lot of people's view of Dreamer versus deep active inference, he mentioned that deep active inference has been used in essentially three ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1692.678,
    "end": 1698.465,
    "text": "One of them is when neural networks and other approaches are used.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1698.525,
    "end": 1704.932,
    "text": "That's also called amortized inference, but that's kind of like deep learning, but deep active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1704.952,
    "end": 1707.295,
    "text": "The other two are like temporal depth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1707.697,
    "end": 1730.16,
    "text": " like long Horizon of planning and then the third is hierarchical depth like um and then we talked about how also those can be flattened uh deep active inference is that many people have implemented is that dreamers so similar to active inference especially I can't remember if which version of dreamer and if it does use information to gain",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1731.524,
    "end": 1753.6,
    "text": " term in planning in a planning objective and if it does then you basically cannot tell whether there's any difference between dreamer and deep active inference um so in a sense even Carl Tristan has mentioned it sometimes that dreamer is basically some variations of an active inference agent what a truth drop",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1757.765,
    "end": 1781.275,
    "text": " here was the major approach of the paper which is the pomdp has an aboutness of uncertainty subjectively like the a matrix describes uncertainties associated with the mapping between observations and hidden states and then the b describes the possibly conditional mapping of states unfolding um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1781.862,
    "end": 1808.41,
    "text": " that whole picture though can be seen as an mdp because like if you're programming in pi mdp you're making a pomdp but for you the pomdp is a fully observable mdp so then there are certain things that you can say that are results that only exist subjectively for mdps like chess but not for pomdps",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1809.25,
    "end": 1817.511,
    "text": " But then as a modeler, you can say MDP-like things about POMDPs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1819.456,
    "end": 1825.993,
    "text": "And it turns out that the key thing that the agent's behavior has to follow along is the information gain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1834.327,
    "end": 1841.237,
    "text": " But it really just shows how different... And then I said something about FEP and the high road and low road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1841.698,
    "end": 1843.721,
    "text": "And then he's like, I'm kind of like a low road guy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1843.901,
    "end": 1847.707,
    "text": "I don't really have anything to say on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1847.727,
    "end": 1851.994,
    "text": "Which was just amazing and very humble and funny.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1853.636,
    "end": 1860.807,
    "text": "For how informed and how capable his presentation research is, that it's like...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1862.575,
    "end": 1885.056,
    "text": " it wasn't about fep he didn't really want to go there yet he was talking about the free energy functionals with like the highest degree of understanding so then that's just like wow free energy is on the low road",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1885.154,
    "end": 1889.481,
    "text": " That's the whole thing with energy-based learning, variational autoencoder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1889.501,
    "end": 1897.493,
    "text": "I mean, millions of people are using evidence lower bound in model fitting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1899.496,
    "end": 1911.634,
    "text": "As Ram pointed out, RL and meta RL and Deep Dreamer go on the low road to indistinguishable from active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1915.597,
    "end": 1919.177,
    "text": " So that really puts the low and the high road into context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1966.323,
    "end": 1967.224,
    "text": " Pretty interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.107,
    "end": 1990.508,
    "text": "Procedural method.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.872,
    "end": 2013.761,
    "text": " for, I mean, this is like live stream 42, but here with three light time layers, days, hours, minutes, and then using a procedural method to fill this in, as opposed to like doing this and then that one, and then just this, and then emitting just from here or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2014.963,
    "end": 2020.41,
    "text": "So, I mean, there's so many low road methods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2021.048,
    "end": 2045.149,
    "text": " every method is on the low road but but none of it is in competition with the high road like before we started zach and i were talking a little bit about the reward learning also and and um kind of like okay want to build the skyscraper taller",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2046.074,
    "end": 2073.077,
    "text": " it's just reward function it's taller and then in contrast it's sort of like um I want to reduce my uncertainty about looking from the 100th floor and then maybe you build um a 75 story and jump or you build a 200 and go to the 100th floor or something like that but then if there's like a um an equilibrium that can be reached when that preference is achieved it's just so interesting to see like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2074.34,
    "end": 2101.917,
    "text": " how those can yield this they could yield similar or different computational policies inferred to get there like there are situations where um the the the RL and the active agent would have indistinguishable behavior but and there's situations where they might have different behavior but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.078,
    "end": 2110.286,
    "text": " that would all be situational on literally just specifying, okay, what is the setting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.306,
    "end": 2110.967,
    "text": "What are the data?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2118.556,
    "end": 2128.748,
    "text": "Maybe certain generic things could be said like, well, for these kinds of environments, this kind of outperformance would be expected or this kind of asymmetry would be expected.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.829,
    "end": 2134.551,
    "text": " some more generic statements about kinds of environments where there'd be different kinds of competitiveness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2134.572,
    "end": 2138.788,
    "text": "But I mean, it still is just a basically empirical question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.92,
    "end": 2194.729,
    "text": " do you think biology is going to help us solve that empirical question because i remember whenever it was inside of the book that introduced the uh system one and system two uh thinking fast and slow that's what it was and oh i'm sorry inside of that they were talking about the example of i believe it was falcons uh that were in california",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.603,
    "end": 2203.676,
    "text": " And so whenever they were discussing it, they asked, what was the value that you would like to apply towards saving this many falcons?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2204.317,
    "end": 2210.267,
    "text": "And then what they did was either they introduced increasing the space or increasing the number of falcons that you would save.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2210.307,
    "end": 2214.754,
    "text": "And they asked, how much would you be willing to spend in order to donate to this cause?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2215.255,
    "end": 2217.999,
    "text": "And they started to vary the amount of difference that it would make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2218.68,
    "end": 2222.927,
    "text": "And they really showed that even our own belief systems are unintuitive to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2223.447,
    "end": 2243.228,
    "text": " of how we actually value things and how much we value that especially at different scales is not something that we would expect from ourselves do you think that we would be able to find an empirically good way to solve this strictly from how we function biologically or how any mammal might function inside of us",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2258.446,
    "end": 2259.687,
    "text": " Frank or Axel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.613,
    "end": 2266.034,
    "text": "Sorry, I just got in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.094,
    "end": 2268.037,
    "text": "I've been setting up, so I didn't catch it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.057,
    "end": 2268.637,
    "text": "Oh, it's all good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2271.02,
    "end": 2273.583,
    "text": "Zach, it's a great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2273.923,
    "end": 2282.933,
    "text": "And is slash how is active inference related to being a theory of inquiry along the lines of the pragmatists?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.353,
    "end": 2284.875,
    "text": "What can be...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2285.176,
    "end": 2313.883,
    "text": " empirically and theoretically said about empirical situations like laboratory behaviorism and also theory producing situations considered empirically i don't know though if even a very strong account there would be equivalent to the resolution of uncertainty or the account for the like the last mile",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2314.859,
    "end": 2330.465,
    "text": " So as to whether this RL or this ACT-INF model will do better on explaining this bacteria data set, that's like, to know that would be like to know, it's like the halting problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2331.426,
    "end": 2338.999,
    "text": "I mean, if you could just, it's like, it would be equivalent to knowing how a data would fit a model before doing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2340.141,
    "end": 2341.423,
    "text": "You can use heuristics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2342.635,
    "end": 2353.849,
    "text": " And those heuristics may be 100% right in certain settings, but that still wouldn't be like actually knowing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2357.213,
    "end": 2370.55,
    "text": "But then you could have certain, it'd be like, okay, for linear models or for transformer models, like adding another layer sometimes takes more train time, but it never does worse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2371.036,
    "end": 2394.175,
    "text": " then you could say certain things about two hypothetical architectures being applied to a data set or two models being applied but it's kind of like the bayesian model reduction question or like structure learning you could have a procedure for adding and pruning down latent accounts and and all these kinds of things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.416,
    "end": 2413.699,
    "text": " But if you already knew which model to apply before, then you might be coincidentally right with your prior, but you wouldn't have been right except by prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2415.907,
    "end": 2417.009,
    "text": " Okay, I see what you're saying now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.249,
    "end": 2427.446,
    "text": "I think I was anthropomorphizing too much because I was thinking of 9.2 and I was thinking that like, oh, the ideal situation would be to where you design a system that's like, oh, it works like I work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2427.927,
    "end": 2428.749,
    "text": "So that's where I was coming from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.789,
    "end": 2433.517,
    "text": "Interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2433.557,
    "end": 2439.687,
    "text": "I mean, because it could be like, it works like I think it works would be like, okay, this is a metronome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2440.443,
    "end": 2446.77,
    "text": " and just changing temperature didn't matter, turning the dial totally explained the frequency of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2447.971,
    "end": 2461.305,
    "text": "So it's like, there are situations where this box is, well, or this could be just an AND gate, or this could be just some other discrete or designed system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2462.146,
    "end": 2468.172,
    "text": "And then on the other side of that could do would be like, this is a person talking to another person",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2469.755,
    "end": 2473.981,
    "text": " And then but that is so that is that which one is like, it works like I work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2475.843,
    "end": 2484.595,
    "text": "Like seeing the world work as expected, or seeing the world work in a way that is open and surprising.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2491.084,
    "end": 2497.112,
    "text": "And I think these become such interesting questions as the technical, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2501.8,
    "end": 2524.905,
    "text": " as what the our our active computational niche is doing around us gets more active than like what is it that we're really doing but like opening I of course ironically doesn't have I don't think they release the technical information um it says you can read more on the technical research post",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2527.72,
    "end": 2552.715,
    "text": " log linear but kind of subtle log compute better evals on domain expertise better coding it's available in cursor 01 mini is doesn't cost any extra they hide the chains of thought",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2555.817,
    "end": 2571.312,
    "text": " But it's kind of like, but you don't even know whether what has happened, but it's doing, I mean, so then if it's doing, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2573.3,
    "end": 2594.177,
    "text": " kind of something between working memory transient um chain of thought with pruning planning and thought dreaming to plan planning to dream maybe using a uh energy-based method or an elbow and then like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.102,
    "end": 2619.287,
    "text": " also with with kind of a niche modification maybe chains of thoughts can read and write to each other or something like that there's just so many architectures people have proposed yeah axel",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.765,
    "end": 2623.948,
    "text": " Yeah, I just have a quick question here in the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.088,
    "end": 2626.17,
    "text": "I'm sorry I missed pretty much most of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.431,
    "end": 2628.073,
    "text": "I was in transport.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.113,
    "end": 2630.576,
    "text": "But I have a bit of a more technical question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.377,
    "end": 2635.822,
    "text": "I'm interested in the differences between RL and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.082,
    "end": 2641.128,
    "text": "And right now, I'm going through some of these PI MDP Colab notebooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.709,
    "end": 2649.358,
    "text": "And one of the first ones is a tutorial where you're setting up these different matrices for, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.338,
    "end": 2668.967,
    "text": " like a is your matrix that maps the states to observations and b is your belief matrix about the beliefs of what will happen if you carry out a certain action and so on and so forth and yeah i think if you open it maybe the solutions will already be there and you can see what i'm talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.673,
    "end": 2673.08,
    "text": " But in this example, of course, it's a simple one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.12,
    "end": 2675.985,
    "text": "It's unambiguous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.045,
    "end": 2685.403,
    "text": "So you start out with all of the matrices that you need to solve the problem, or at least that's how it seems to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.383,
    "end": 2690.171,
    "text": " And I'm kind of interested in how little you need to specify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.191,
    "end": 2697.103,
    "text": "When I first got interested in active inference, I was kind of attracted by the idea that you might not have to specify anything at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.123,
    "end": 2706.7,
    "text": "You would have an agent that learns how to carry out useful actions, not by having a reward function, but just by...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.68,
    "end": 2714.667,
    "text": " doing things that makes it able to control its environment better, which in the end will be things that perhaps are useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.047,
    "end": 2720.492,
    "text": "And I think my question is just, how little do you need to specify?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.532,
    "end": 2736.366,
    "text": "Is it possible to specify not even the agent's understanding of when it sees that it is in square one, it also will think that it should expect itself to be in square one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.004,
    "end": 2742.839,
    "text": " What is the least thing that I can specify in this setup and still get an agent that learns all of these things itself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.067,
    "end": 2746.387,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2746.548,
    "end": 2748.052,
    "text": "Great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2749.134,
    "end": 2754.287,
    "text": "Um, first part on RL.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2754.993,
    "end": 2784.19,
    "text": " and active i think check out this model stream 14 that we discussed a little bit because it was some of the most distilled and um experienced comparisons but then this question of like what is needed to be specified so um you're totally right that that um this is kind of like it's like a canon inference canon or reverse canon set up on rails",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2784.44,
    "end": 2806.903,
    "text": " with with a certain like it's kind of aimed on a certain axis already because it's like well how does it know it's in a teammates how does it know the the semiotics of how the queue at the bottom relates to um whether it's on the left or the right you know how does it know how to walk so it's like but that's where it becomes really important to clarify what are questions about the world",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2807.795,
    "end": 2809.638,
    "text": " What are questions about generative models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2810.539,
    "end": 2815.226,
    "text": "And then where are we developing generative models to address questions about the world?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.707,
    "end": 2817.57,
    "text": "And then those can go back and forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2818.051,
    "end": 2824.721,
    "text": "But it's like, if you wanted to study, well, how does the semiosis become associated between the Q and the T maze?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2825.262,
    "end": 2827.305,
    "text": "You could study that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2827.37,
    "end": 2829.555,
    "text": " with a degree of freedom around that relation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2830.578,
    "end": 2839.54,
    "text": "Or you could just say, we're assuming it's a perfectly trained rat that already 100% understands like the left and the right cues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.195,
    "end": 2865.645,
    "text": " those are generative models that are being constructed for different cases so depending on what is is wanting to be um gotten intuition for like in a toy model or what kinds of research questions are being addressed from it's like it'd be like downloading a genome and just like model it it's like but i mean to what end a 3d shape or like you know the regulatory network it's like well all of them it's like yeah but then that's just the whole project",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2865.625,
    "end": 2893.675,
    "text": " of the field or something that's that's not a specific research question to ask about so yes definitely and then when it comes down to in into this level it's like yeah so then but then what what about adding a fourth grid location or what how would it come down you know then then it has to change it so those are some of the rate limiting steps in the in implementing things like structure learning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2893.891,
    "end": 2923.594,
    "text": " in the models today which is like the dimensionality has all these repercussions or how does it how would it look how would it come to know that it could add a new affordance so can it be something very simple with a procedural approach to like changing the dimensionality and the number of slices on abcde and then could that like a procedure over abcde",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2924.468,
    "end": 2946.122,
    "text": " have the ability to learn in this or that way it's an open question to and then okay you could set it up but but then if you set it up in a computational environment that only has like multi-armed bandit slot machines i mean it's not gonna code in python so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2947.064,
    "end": 2963.166,
    "text": " then that gets into the niche specification either the computational niche for for training and learning and inference or more of the robotics route with the real world niche",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2964.732,
    "end": 2974.141,
    "text": " So yeah, I get what you're saying in terms of it's interesting how you might want to procedurally change your structure when you've already established it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.461,
    "end": 2978.105,
    "text": "But then let me ask, what if you have established the exact structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.165,
    "end": 2980.087,
    "text": "You live in this simple grid world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.447,
    "end": 2981.648,
    "text": "You can establish all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.028,
    "end": 2984.07,
    "text": "And perhaps there are certain things you can do in the grid world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.15,
    "end": 2989.936,
    "text": "Maybe you have to get keys in order to open doors, in order to go somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.156,
    "end": 2994.3,
    "text": "But there's no final reward in the goal position you want to go to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.28,
    "end": 3017.335,
    "text": " do you think an active inference agent because it's curious and because it wants to learn to understand its world will figure out how to do the actions which will end up getting it to be able to predict what's gonna like get the furthest in the world just because it uh has that incentive perhaps",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.26,
    "end": 3020.222,
    "text": " Okay, great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3020.843,
    "end": 3025.628,
    "text": "So we never really brought a model together, but we explored it, but it was 2021.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3025.788,
    "end": 3030.153,
    "text": "This was before like PyMDP and RSFER and all this, but it was like NetHack.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3030.173,
    "end": 3034.717,
    "text": "It's like this text-based explorer that's famously convoluted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3035.458,
    "end": 3041.905,
    "text": "But even just considering like, yeah, how do you do items as affordances, but then do every turn...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3041.885,
    "end": 3048.634,
    "text": " Are you going to do like this mega deep act info on like every possible spell that you could cast in every direction?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3049.636,
    "end": 3056.605,
    "text": "Or how are we even going to learn to know possibly things that even people haven't written down?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.268,
    "end": 3064.136,
    "text": "Like how two spells interact with the dragon only on the 13th level or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3064.156,
    "end": 3068.241,
    "text": "It's like, so this could be a very interesting setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3068.742,
    "end": 3071.706,
    "text": "Again, it's, it's, it's hardest in general, but it's,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3072.361,
    "end": 3088.8,
    "text": " the the reinforcement learning a reward approach let's just say that it's like um you know kind of this surrealist uh dream grid world with the keys and the doors and all this other stuff I mean there's the physiological sort of grounded layer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3088.983,
    "end": 3108.713,
    "text": " which like what makes more sense saying I'm rewarded by being at physiology or I expect to be at physiology and that's just where I satisfy so let's just say physiology can be equally well explained by active or by a reward term um then it's like well where do you go then with your reward",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3109.402,
    "end": 3137.198,
    "text": " then it's like if you set your reward arbitrary function on curiosity learning epistemic value then you're doing function approximation for epistemic value so then you've just created a sort of epistemic approximator rl agent there's nothing wrong with that it might be totally fine but um it's it's the low road side of a question that could be approached from a high road",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3137.33,
    "end": 3143.801,
    "text": " which would just be the epistemic value expected information gain, things that might be important for the NetHack challenge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3146.085,
    "end": 3153.398,
    "text": "But then how would you come to tune and adjust the epistemic and pragmatic balance on the fly?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3154.964,
    "end": 3164.141,
    "text": " It isn't that, you know, like, again, thinking about the RL and the ACT-IMP, it's like, let's just say there's a basketball hoop that's 20 feet tall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3164.903,
    "end": 3168.009,
    "text": "And someone's like, I prefer myself to be dunking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.229,
    "end": 3173.639,
    "text": "Or the reinforcement learning is just like, I want to jump higher and then I'll be able to dunk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3174.2,
    "end": 3177.647,
    "text": "But it's like, that doesn't mean it's possible to even do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3178.538,
    "end": 3201.66,
    "text": " but the reinforcement learner would train to jump up to 10 feet and then they would just stall and they just would be like you know I think I could do better or I'm at the best score I've ever gotten or something the active would just have a a would reach a Plateau of surprise like I'm why am I three bits surprised about my jumping when I expect to be doing a 20-foot Dunk",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3202.889,
    "end": 3209.098,
    "text": " But if it's an irresolvable situation, then it's been set up that it can't be done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3210.379,
    "end": 3224.459,
    "text": "Whereas if it was an achievable situation, then both of those would have a possibility to be able to dunk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3224.479,
    "end": 3232.39,
    "text": "But at least leaving the door open for the epistemic and having a stabilized open door",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3233.112,
    "end": 3257.5,
    "text": " that isn't just pragmatic because if you operationalize the epistemic value into pragmatic value okay we train the reinforcement learning on learning then we get back to these questions right that we're having at the very beginning like well then it would learn at cost to other variables oh no well then we'll learn to balance that okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3258.357,
    "end": 3268.283,
    "text": " But then you can just have this infinite like regress of reinforcement learning, but it still is in pragmatic value from the high road side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3273.562,
    "end": 3273.882,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.902,
    "end": 3277.407,
    "text": "I think I'm just having a hard time understanding exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.427,
    "end": 3288.602,
    "text": "There was this paper once about how you could teach agents to learn to ride a bike just by trying to maximize empowerment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.942,
    "end": 3296.532,
    "text": "So trying to make it so that these agents would not have a reward for having the bike upright, but would have a reward for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.512,
    "end": 3298.355,
    "text": " being able to do more things in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.495,
    "end": 3303.343,
    "text": "And since they had the bike upright, they could drive further and go more places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.423,
    "end": 3306.228,
    "text": "And because of that, they could do more things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.248,
    "end": 3313.66,
    "text": "And I'm wondering if the same kind of thing happens in active inference, where if you had an agent in a grid with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.64,
    "end": 3337.032,
    "text": " a place where a key comes out if it would just go up and see that a key comes every 10 seconds and think that that's nice and now it's learned that and there's no more surprise or if it would somehow be incentivized to say oh but what happens if i take this key and go down into the bottom of the maze where there's this door even though it didn't know anything about that that that would open anything or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.935,
    "end": 3363.12,
    "text": " yeah this um ali was there for this stream with tom ringstrom it's it's a it's a totally viable path um it's interesting also about the bellman equations which come up in the mdp solutions so treating an appeal mdp like an mdp",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3363.539,
    "end": 3386.965,
    "text": " which is a using Bellman optimality PDP MDP style on the agents PMDP um there might be situations where where expected free energy and optimal and empowerment are are like correlated or there might be um designable situations where they're differentiable",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3388.598,
    "end": 3411.94,
    "text": " I think one important note and it's kind of the separation between the equation 2.5 and 2.6 is like 2.5 variational free energy is not prospective this is just like a real-time existence check so this is more like a a through the flow of the present",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3413.202,
    "end": 3438.872,
    "text": " once you get into planning over expected Futures like there's expected free energy then there's free energy of the expected future f-e-e-f there then there's other approaches that have been proposed so I think there's a lot of constructions that highlight different parts of the future to say nothing of the of the procedural ways that you could like prune through Futures",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3440.506,
    "end": 3462.708,
    "text": " but there might be the heuristic of maximum occupancy or maximal empowerments or maximal time discounted reward for some agent or time discounted learning or like the amount of this or that within a certain timeframe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.41,
    "end": 3467.813,
    "text": "So I think there's a lot more ways to model the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3474.593,
    "end": 3475.234,
    "text": " Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.394,
    "end": 3476.976,
    "text": "Yeah, I'll definitely check out this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.818,
    "end": 3480.34,
    "text": "Yeah, this it's a great connection, though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3480.36,
    "end": 3499.285,
    "text": "And I think it's a similar, there might be other intrinsic motivators like, like, you know, would learning would wanting to learn a space equate to occupying it through time equate to empowerment in movement in that space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3501.61,
    "end": 3510.279,
    "text": " Again, you could imagine a space in an agent where those are all indistinguishable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3510.299,
    "end": 3518.467,
    "text": "But then they could have some other space where just like, oh, but the cells change at different rates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3518.587,
    "end": 3524.313,
    "text": "So if you are equally occupying the space, then you're not equally learning it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3525.735,
    "end": 3531.06,
    "text": "But then that's just getting into these more generic comparators.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3532.272,
    "end": 3545.507,
    "text": " But I mean, these are great questions, and these are all weaving together in a Chapter 9-esque way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3547.169,
    "end": 3561.486,
    "text": "As we think about generating data from Act-Inf models, fitting Act-Inf models to data, I mean, if we can...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3562.883,
    "end": 3580.227,
    "text": " share and borrow infrastructurally with Dreamer and all of these mainstream machine learning models and contextualize it from a high road and add new paths on the low road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3580.267,
    "end": 3584.233,
    "text": "Just a few memes away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3592.6,
    "end": 3592.942,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.927,
    "end": 3594.409,
    "text": "Thank you all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3595.816,
    "end": 3598.348,
    "text": "See you next time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3598.368,
    "end": 3598.911,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3600.7,
    "end": 3601.564,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  }
]