[
  {
    "start": 7.177,
    "end": 7.457,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.957,
    "end": 13.501,
    "text": "Hello, everyone, and welcome to ACT-INF Lab live stream number 24.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.901,
    "end": 31.452,
    "text": "Today is June 29th, 2021, and we're looking forward to this follow-up or jump-off discussion with some of the authors as well as other lab participants on this awesome paper, An Empirical Evaluation of Active Inference in Multi-Armed Bandits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.083,
    "end": 34.864,
    "text": " Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.605,
    "end": 41.229,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.949,
    "end": 44.991,
    "text": "You can find out more about us at the links on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.852,
    "end": 52.256,
    "text": "This is recorded in an archived livestream, so please provide us with feedback so that we can be improving on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.237,
    "end": 59.526,
    "text": " All backgrounds and perspectives are welcome here and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.686,
    "end": 70.881,
    "text": "It's great that there's so many on the call and I'm sure we'll have many questions and opportunities to raise our hand as well as for those in the live chat to ask questions whenever they feel like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.398,
    "end": 77.561,
    "text": " We're closing out June with this DOT 2 discussion on paper number 24.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.381,
    "end": 82.603,
    "text": "So last week we also spoke with Sarah and Dimitri and others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.663,
    "end": 83.984,
    "text": "That was very informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.224,
    "end": 85.585,
    "text": "And now we're in the DOT 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.665,
    "end": 91.528,
    "text": "We're able to take it to a few different places and raise up a few questions that were asked over the last week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.754,
    "end": 98.357,
    "text": " And the goal is really just to learn and discuss this paper and related topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.457,
    "end": 101.918,
    "text": "We have a few cool related areas that we're going to be going into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.179,
    "end": 106.44,
    "text": "So we can just begin with a introduction round.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.721,
    "end": 115.364,
    "text": "Each person can say hello or check in, say anything that they're thinking about today, and then pass it to somebody who hasn't spoken yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.005,
    "end": 121.287,
    "text": "So I'm Daniel, I'm a postdoc in California, and I'll pass it first to Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.188,
    "end": 126.049,
    "text": " Hi, I'm Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 126.469,
    "end": 132.975,
    "text": "I am an independent research consultant based out of New Mexico, and I will pass it to Ryan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 134.436,
    "end": 136.157,
    "text": "Hi, I'm Ryan Smith.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 136.418,
    "end": 139.841,
    "text": "I'm an investigator at the Laureate Institute for Brain Research.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 141.402,
    "end": 142.663,
    "text": "And I'll pass it to Sarah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 142.683,
    "end": 144.845,
    "text": "Hi, I'm Sarah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 144.865,
    "end": 150.73,
    "text": "I'm a postdoc at the Technical University in Dresden, and I'm looking forward to the discussions today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.291,
    "end": 152.932,
    "text": "And I pass on to Dimitri.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.1,
    "end": 155.601,
    "text": " Hi, everyone.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 155.841,
    "end": 161.166,
    "text": "I'm Dimitri Markovich, postdoc at Technical University of Dresden also, chair of neuroimaging.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 162.327,
    "end": 164.069,
    "text": "And I pass it to Dave.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 166.151,
    "end": 167.372,
    "text": "I can't keep talking, actually.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 167.873,
    "end": 168.073,
    "text": "No.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 168.233,
    "end": 170.575,
    "text": "I'm Dave Douglas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.616,
    "end": 175.36,
    "text": "My background's basic psych and cybernetic learning theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.802,
    "end": 178.964,
    "text": "And I'll pass this to Stephen, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.526,
    "end": 181.627,
    "text": " Hello, I'm Stephen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 181.667,
    "end": 183.048,
    "text": "I'm based in Toronto.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 183.188,
    "end": 190.715,
    "text": "I'm doing a practice-based PhD around social topographies and immersive experiences.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 191.375,
    "end": 195.198,
    "text": "And I think I'll pass it back to Daniel, if I'm not mistaken.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 195.979,
    "end": 196.159,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.6,
    "end": 196.84,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.02,
    "end": 199.722,
    "text": "Thanks for the cool intro round.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.007,
    "end": 206.189,
    "text": " So Sarah prepared this slide, which we just want to start off with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.97,
    "end": 208.71,
    "text": "So go for it, Sarah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.331,
    "end": 213.412,
    "text": "How does this set the intention and the mood for what we're going to be going into today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.713,
    "end": 217.574,
    "text": "Wait, how can I make it so that I see it big again?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 220.421,
    "end": 234.925,
    "text": " So after the discussion last week and also the questions we've got, we thought it would be a good idea to just make a short overview slide about what we understand as active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 236.065,
    "end": 245.847,
    "text": "And as cognitive neuroscientists, you said in the discussion before also, we are often or mainly interested in this action perception loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 246.51,
    "end": 251.434,
    "text": " that an agent or we as living agents are in with our environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 252.235,
    "end": 256.118,
    "text": "And that's what you see on the right in this loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.198,
    "end": 275.113,
    "text": "And on the left side, on the right, you see the environment that may have hidden states that are the states that you may know from Markov decision processes and reinforcement learning, but that may also be more abstract things that aren't observable to an agent like contexts,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 276.069,
    "end": 280.972,
    "text": " volatility parameters, anything that describes the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 281.573,
    "end": 284.495,
    "text": "And these hidden states may also evolve with time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 285.476,
    "end": 299.005,
    "text": "And then such an environment generates an observation that the agent then integrates together with its prior beliefs in order to infer the hidden states of the environment, which is what we call perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 299.725,
    "end": 304.869,
    "text": "Then you can use this information to plan ahead and select an action accordingly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.643,
    "end": 310.284,
    "text": " And in turn, the action may change the environment the agent is in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 311.104,
    "end": 324.008,
    "text": "And concretely, how the agent side of this works in active inference is so that you specify a probabilistic generative model that contains the hidden states,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 325.181,
    "end": 334.145,
    "text": " your a priori knowledge or your assumptions about how these hidden states relate to each other, which states may follow upon which states and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 334.745,
    "end": 337.646,
    "text": "It contains observation generation rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 338.546,
    "end": 346.269,
    "text": "It contains actions or policies, which in active inference are also treated as hidden variables that need to be inferred.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 346.989,
    "end": 350.891,
    "text": "And additionally, the generative model may contain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 352.108,
    "end": 359.111,
    "text": " its own parameters as a random variable so that they can be inferred and therewith learned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 360.592,
    "end": 366.335,
    "text": "Then you specify probability distribution of approximate beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 366.915,
    "end": 380.602,
    "text": "In theory, you could also solve the beliefs of the generative model analytically, but that becomes very computationally expensive really quickly or even analytically intractable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 381.249,
    "end": 387.65,
    "text": " So what you do instead is formulate these approximate beliefs, which are supposed to be of a simpler form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 388.351,
    "end": 406.374,
    "text": "And for example, in your approximate beliefs, you could assume that all hidden variables are independent random variables, which makes the beliefs very easy to calculate, but may not properly capture the temporal dynamics, for example, of your environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 408.015,
    "end": 408.375,
    "text": "And this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 410.205,
    "end": 413.988,
    "text": " Independence assumption is also called the mean field approximation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 414.469,
    "end": 422.676,
    "text": "But you could also say, no, with some hidden variables, it's very important that they are allowed to co-vary and be dependent on each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 422.696,
    "end": 430.582,
    "text": "And then you would have pairwise dependencies in these approximate beliefs, which is then called the beta approximation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.383,
    "end": 435.606,
    "text": "You may have different approximations for different variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.647,
    "end": 437.028,
    "text": "Some may vary together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 437.488,
    "end": 438.529,
    "text": "Others are independent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 440.728,
    "end": 446.151,
    "text": " Then you plug in the generative model and your approximate beliefs into the free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 447.112,
    "end": 451.615,
    "text": "And then you find your approximate beliefs at the minimum of this free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 452.295,
    "end": 466.123,
    "text": "And this way you can form beliefs about hidden states of the environment, which really can be anything, your location, volatility of the environment, the context you're in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 467.072,
    "end": 474.198,
    "text": " You infer beliefs about policies, which is a probability distribution over actions from which you can then choose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 475.038,
    "end": 483.325,
    "text": "And you can even form beliefs about parameters of the model and therewith update your knowledge of the model in each time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 485.266,
    "end": 490.11,
    "text": "And then in the end, you can use all this inferred knowledge to make actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 491.031,
    "end": 496.515,
    "text": "And yeah, we as cognitive neuroscientists are often interested in this whole loop",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 497.059,
    "end": 502.961,
    "text": " But what Dimitri showed last week is also that in principle, this can be really modular, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.721,
    "end": 519.746,
    "text": "So in our paper, for example, perception was the same for all different agents, whereas Dimitri then plugged in different action selection algorithms, one corresponding",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 520.492,
    "end": 525.914,
    "text": " to the expected free energy and active inference, but other well-known action selections algorithm too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 526.554,
    "end": 534.176,
    "text": "So yeah, you can really also play around with this framework and use its modular nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 534.456,
    "end": 544.719,
    "text": "You could, on the other hand, use the same action selection algorithm and compare different learning algorithms, which is something we're also often interested about in our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.119,
    "end": 548.52,
    "text": "And yeah, with that, that's it from me for now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 551.189,
    "end": 551.449,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.689,
    "end": 552.77,
    "text": "Very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.93,
    "end": 554.971,
    "text": "And anyone can raise their hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.131,
    "end": 559.593,
    "text": "But I think the part that spoke to me there was just that it's a framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.873,
    "end": 563.034,
    "text": "And so it's kind of like the framework of a desktop computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.094,
    "end": 566.756,
    "text": "You can take out the memory or change out the hard drive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.256,
    "end": 570.798,
    "text": "And so we can talk about changing the environmental dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.658,
    "end": 594.418,
    "text": " with respect to the hidden states and how they evolve through time we can talk about changing perception but we can also like lock in multiple of the components and then explore how different learning rules influence system behavior that's what we explored in this multi-armed bandit paper but it could be the same learning and policy selection rule but then a different perception rule",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.319,
    "end": 602.606,
    "text": " And then those might map onto very subtle differences in decision-making of agents that we care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.686,
    "end": 613.676,
    "text": "Like what's the difference between somebody who has blurry vision, but they know the language versus clear vision, but then they're semantically unsure about what the symbols are representing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.079,
    "end": 617.68,
    "text": "Yeah, Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.02,
    "end": 619.922,
    "text": "And then anyone else who raises their hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.806,
    "end": 625.689,
    "text": " Yeah, this is really interesting and helpful to see your thinking here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 625.709,
    "end": 650.348,
    "text": "I would just be curious how action states or, you know, the idea of different types of states alongside these hidden states, just how that you treat those in your thinking, because they could be kind of the action states that are imagined and the action states which are part of the kind of",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 651.389,
    "end": 680.257,
    "text": " external environment that you're somehow immersed in so in the end yes actions are also treated as hidden variables i think they are very separate from other from the hidden states for example because the space of actions determines what an agent can choose and you cannot choose a state in terms of other hidden variables i think so for example if i think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.323,
    "end": 687.808,
    "text": " location versus context, then in my head the generative model becomes a hierarchical model instantly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 689.068,
    "end": 708.802,
    "text": "And in the end, yeah, that's also what I meant when I said you plug in your a priori knowledge or your assumptions about the environment because different types of hidden states will have different relationships to each other and you really end up with a completely different generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.874,
    "end": 718.217,
    "text": " Just to follow up there, Sarah, you said that when location and context are differentiated, that it's a hierarchical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.297,
    "end": 721.498,
    "text": "So what does that look like on this layout?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.279,
    "end": 726.28,
    "text": "You mean in this figure here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.76,
    "end": 736.424,
    "text": "Like what's the setting where location and context are identical and so it's a non-hierarchical model versus a case where they are differentiated and then it is a hierarchical model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.538,
    "end": 756.889,
    "text": " So for example, if I want to model myself walking through my flat, that wouldn't be a hierarchical model, where just each location, maybe the different rooms count as states that I infer based upon the curtains I see, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 757.91,
    "end": 763.053,
    "text": "But then if I want to introduce another person's flat, then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 764.724,
    "end": 768.205,
    "text": " the transition dynamics may be different for their flat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 768.225,
    "end": 776.849,
    "text": "So for example, in my flat, I can go from the living room into the kitchen, but in my friend's flat, I cannot make the state transition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 777.489,
    "end": 793.615,
    "text": "And that's actually something I'm working with currently where an agent, like the underlying decision process is very similar, but an agent needs to infer which context he's in in order to then load the correct transition dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 796.331,
    "end": 809.045,
    "text": " That reminds me of the SPM textbook, how it talks about hidden states being just the state that a process is in that generates outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.246,
    "end": 816.693,
    "text": "So we have a clear distinction between the hidden states which aren't directly observed, but there is this hidden state like which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.745,
    "end": 842.201,
    "text": " flat min and then that is going to change the transition dynamics between the rooms but the observations are what are um coming to the agent and then also there's like learning which we don't have here but that would reflect the prior beliefs being updated through time what about this planning stage like what is happening in this planning module",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.877,
    "end": 847.198,
    "text": " That's a good question, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 847.258,
    "end": 850.361,
    "text": "Nowadays, so this figure is from my previous paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 850.761,
    "end": 856.827,
    "text": "Nowadays, I lump in perception and planning together because it's really not that easy separable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 859.029,
    "end": 866.256,
    "text": "So in this case, what I meant is perception is really inferring past up into the current hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.311,
    "end": 878.52,
    "text": " to which I had the observations that belong to each state, whereas planning is inferring future hidden states and future observations and potentially future rewards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 879.481,
    "end": 890.731,
    "text": "But in the end, it's all one model and it's a chain to go through the states, so the differentiation only makes medium sense, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.071,
    "end": 894.334,
    "text": "It's rather one inference problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.805,
    "end": 898.649,
    "text": " interesting things, Blue, than anyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.132,
    "end": 907.78,
    "text": "So just thinking about metacognition and where that might fit into this model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 911.425,
    "end": 913.027,
    "text": "Dimitri actually has some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 915.896,
    "end": 919.078,
    "text": " has published a paper on metacognition recently also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.158,
    "end": 921.579,
    "text": "So metacontrol actually, right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 922.439,
    "end": 935.706,
    "text": "But yeah, I mean, one can just see, one can stack multiple agents on top of each other and imagine as a kind of higher level agent controlling what the bottom level agent is doing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 936.766,
    "end": 940.388,
    "text": "And so this would be like, well, deep active inference models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 941.594,
    "end": 951.083,
    "text": " And in one of the recent papers, we're also exploring this in a kind of meta-control approach for describing cognitive control.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 952.684,
    "end": 959.571,
    "text": "So if there's some kind of downward causation, does that then inhibit what's going on at the lower agent level?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 959.591,
    "end": 961.312,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 961.332,
    "end": 966.137,
    "text": "So basically, you can see kind of actions on the higher level are",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 967.269,
    "end": 971.572,
    "text": " defining priors on the lower level and hence selecting the policy space.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 972.833,
    "end": 981.178,
    "text": "So what kind of your lower level agent can actually do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 983.06,
    "end": 995.388,
    "text": "This is now just kind of illustration of kind of separating maybe higher level cognition from the executive part, which is kind of moving arms or muscles on your body.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 997.948,
    "end": 1026.339,
    "text": " uh it's it's interesting about that like kind of like a virtual machine or a hypervisor that there's this like emulated agent you know what would my better self do that's a classic metacognition question and then also it was just interesting that you know blue you asked about metacognition and then dimitri you went right to meta control and so that really speaks to the way in which we're thinking about cognition as control",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.159,
    "end": 1049.53,
    "text": " and that's part of a control theoretic perspective which is that like the cognition planning as inference the cognition is about action selection but then one piece that differs potentially is inactive inference relative to just sort of the um way that control theory is often discussed is the insight of perceptual control theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.33,
    "end": 1056.614,
    "text": " which is that the planning as inference is being done in service of the expected observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.255,
    "end": 1061.938,
    "text": "And so we're planning and acting in order to control our perceptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.718,
    "end": 1065.52,
    "text": "And that's happening as part of this integrated loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.681,
    "end": 1072.264,
    "text": "So it's kind of cool that there's like this like good regulator theorem in terms of cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.784,
    "end": 1077.988,
    "text": "And then it is like there actually is an emulated regulator agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.049,
    "end": 1084.353,
    "text": " And then yeah, pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.433,
    "end": 1087.196,
    "text": "Where does that play in with like our thought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.396,
    "end": 1091.319,
    "text": "Does that I don't know, what does that relate to our actual experience of thought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.46,
    "end": 1094.963,
    "text": "Or does this happen all at the sub personal scale?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.308,
    "end": 1105.673,
    "text": "Well, I mean, that's how I knew it is it's really like a problem of separating different timescales.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1106.65,
    "end": 1110.431,
    "text": " And uncertainty associates it with different timescales.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1112.771,
    "end": 1119.013,
    "text": "What you can do now, for example, in the next couple of seconds is very different from what you can do in the next couple of months.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1120.433,
    "end": 1125.094,
    "text": "And potentially, your long-term goals and plans have an impact on what you're doing currently.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1126.515,
    "end": 1131.796,
    "text": "And there needs to be a way how to resolve this uncertainty on different levels of representation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1133.459,
    "end": 1145.502,
    "text": " And from active inference, one solution for that is just like you stack agents on top of each other, which just representing increasingly longer timescales.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1148.203,
    "end": 1148.763,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.664,
    "end": 1157.966,
    "text": "And I mean, as each agent, I mean, we can see it as a little, as something which is separated from",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1158.536,
    "end": 1162.777,
    "text": " an environment through the marker blanket, so basically through the actions and the observations it's making.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1163.397,
    "end": 1167.599,
    "text": "I mean, you can also separate your brain in multiple nested blankets, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1168.259,
    "end": 1175.921,
    "text": "Where one part of the brain just informs and sends information to other part and accepts signals as actions, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1178.142,
    "end": 1180.423,
    "text": "And I mean, we know this from experimental research.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1180.463,
    "end": 1188.205,
    "text": "Lots of this is hierarchically structured, so both temporal and spatial priorities.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1190.131,
    "end": 1192.673,
    "text": " Thanks, Dimitri, Stephen, and then anyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.416,
    "end": 1196.416,
    "text": "Yeah, would I be correct?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1197.097,
    "end": 1204.503,
    "text": "Between perception and planning, you've kind of got this more conscious belief awareness being sort of available.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1204.523,
    "end": 1216.334,
    "text": "And the prior beliefs, once you get from around the observations to perceptions, might be below consciousness in the sense that it might be part of the visual system or whatever.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1217.059,
    "end": 1227.075,
    "text": " And I was just wondering how you see that transition from below awareness to phenomenological consciousness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1228.388,
    "end": 1230.049,
    "text": " playing out with the types of models.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1230.149,
    "end": 1240.032,
    "text": "I know sometimes like Ryan Smith uses some semi-Markovian processes which start with some, you know, self-reports about beliefs.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1240.312,
    "end": 1248.014,
    "text": "So it's working at a level which is kind of building on top of the dynamics that might be going on in the kind of biology.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1248.234,
    "end": 1257.317,
    "text": "So I was just wondering how you see those different dynamics playing out and where you fit your models with some other models if they were sort of to play with each other.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1261.608,
    "end": 1268.773,
    "text": " If I may say so, I think this relates back to Dimitri's statement about the hierarchy of timescales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1269.774,
    "end": 1278.319,
    "text": "Because if it's like my conscious thought is on a slower timescale, for example, than my visual perception is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1279.42,
    "end": 1288.106,
    "text": "And I think my conscious thought is maybe rather responsible for the slower timescales",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.102,
    "end": 1305.335,
    "text": " where it helps me to narrate through the slow Markov decision process, whereas it would be not useful if I have to critically think about any inference I make on my retinal image, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1308.163,
    "end": 1324.069,
    "text": " it's interesting you said there that the conscious thought it narrates because first off we've talked about narrative and active inference but also just like you described how there was this hidden state of which flat i'm in and then that sets the transition probability of the rooms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.029,
    "end": 1345.348,
    "text": " maybe you have a narrative that sets up like which policies you're transitioning between like in baseball you know there's a story to the alternation of the innings and then it's like okay we're going to be enacting this policy because we're in this phase and so there's like a higher level narrative that helps connect when policy transitions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.309,
    "end": 1375.298,
    "text": " might be um plausible to be adaptive and then that is almost by definition at a slower time scale than the play-by-play because the play-by-play is going to be a lot more like motor control the eye cicading and then as you slow down you get slower transition dynamics that are more and more narrative in nature because they narrate like different phases of action but then the sub actions are very rapid",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.106,
    "end": 1381.667,
    "text": " I mean, in a sense, it also has to do with a level of abstraction, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1381.767,
    "end": 1386.008,
    "text": "If I see a leaf, it's just a leaf.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1386.748,
    "end": 1406.712,
    "text": "It has a very concrete meaning in terms of my physical environment, whereas my study program, for example, is something a lot more abstract that is a lot harder to grasp without abstract states that you maybe need a narrative for more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1412.245,
    "end": 1413.705,
    "text": " Ryan, and then anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.526,
    "end": 1433.572,
    "text": "Oh, I mean, I was just gonna say, I mean, you know, like, when we went through mine and Chris's paper on consciousness a couple months ago, or whatever, I mean, the question about how conscious, conscious processes relate to active inference, really any related kind of computational model is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1434.218,
    "end": 1441.743,
    "text": " is a complicated one in part because what consciousness, what the word consciousness is used to mean can be different in different contexts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1442.883,
    "end": 1455.091,
    "text": "You know, I don't personally think that, yeah, I mean, the question of what processes are conscious or unconscious in and of themselves doesn't really fall out directly from active inference, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1455.111,
    "end": 1458.533,
    "text": "All we're doing is modeling things at different timescales and their relationships to one another.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1458.553,
    "end": 1462.515,
    "text": "You know, I mean, in the model of, you know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1463.678,
    "end": 1492.454,
    "text": " visual consciousness of you know in that paper that we published a few months ago um you know the idea is very similar to what other people were saying you know which is this idea about different time scales um but but here i mean the idea the idea was something more like you have a particular level in a hierarchy that operates over a sufficiently long time scale that you can do the kind of goal directed things that consciousness allows including generating verbal reports which themselves are very kind of extended",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1493.32,
    "end": 1494.841,
    "text": " um, you know, integrative policies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1495.681,
    "end": 1503.043,
    "text": "Um, but that, um, you know, but that also requires that it integrates information from enough different low level sources, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1503.083,
    "end": 1503.644,
    "text": "To do that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1504.164,
    "end": 1519.809,
    "text": "Um, but beyond that, you know, talking about consciousness as itself, the slower timescale process can also, I think a little bit, um, sort of subtle, um, because what a lot of people being like consciousness, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1520.575,
    "end": 1527.198,
    "text": " you know, has to do with the kind of subjective character of the kind of like moment to moment, you know, phenomenological aspects of experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1527.718,
    "end": 1530.699,
    "text": "And that's clearly not happening on a slow time scale, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1530.759,
    "end": 1536.341,
    "text": "Like those, the moment to moment changes in conscious perceptual experience are fast.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1537.542,
    "end": 1547.906,
    "text": "You know, so what we're doing in this kind of higher narrative level that I think you're talking about is something about, you know, integrating evidence for those over time and, you know, using them to come up with",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1549.413,
    "end": 1554.315,
    "text": " certain sorts of longer timescale policies to infer certain sorts of longer timescale policies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1555.816,
    "end": 1576.203,
    "text": "And so the way that we've talked about it previously is just that you can have these sort of, depending on the precision of the interactions between the first and the second level in a model, if that precision is low, then the lower level can, to a certain extent, just kind of operate semi-autonomously.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1577.22,
    "end": 1584.882,
    "text": " In which case the higher level doesn't really need to have all that much influence or know that much about what's going on at the lower level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1585.822,
    "end": 1594.604,
    "text": "So you probably have as a kind of selection process where the precision gets turned up or down at different times and for different hidden states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1595.564,
    "end": 1606.307,
    "text": "So the second level can kind of selectively become aware of and start integrating evidence with respect to certain lower level processes, which simultaneously allows this kind of top-down control",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1606.747,
    "end": 1608.048,
    "text": " over those first-level processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1609.369,
    "end": 1625.177,
    "text": "You know, so with the perceptual phenomenology stuff, it's probably more about the moment-to-moment updates between lower-level perceptual processes and these higher-level solar timescale processes when the precision is sufficient for those updates to the second level to matter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1626.258,
    "end": 1634.903,
    "text": "But anyway, I mean, that's more long-winded than I meant it to be, but mainly just trying to point out that it's subtle and it means a lot and it depends a lot on what you mean by consciousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1635.461,
    "end": 1639.064,
    "text": " and it's not specific to active inference necessarily.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1641.286,
    "end": 1641.546,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.287,
    "end": 1642.847,
    "text": "Great.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1642.967,
    "end": 1653.637,
    "text": "I think the difficulty of talking about consciousness is I don't, I mean, we don't know what it is doing, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1653.677,
    "end": 1655.578,
    "text": "What kind of problem is consciousness solving?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1656.899,
    "end": 1662.124,
    "text": "What would be like a hyper-intelligent organism without the consciousness?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1664.215,
    "end": 1666.296,
    "text": " There are definitely a number of ideas in the literature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1666.376,
    "end": 1668.917,
    "text": "It's not like it's completely pinned down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1670.817,
    "end": 1677.5,
    "text": "There are things, for instance, requiring working memory maintenance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1677.58,
    "end": 1683.322,
    "text": "Extended working memory maintenance beyond a specific timescale looks like it can't happen unconsciously, at least in current experiments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1684.182,
    "end": 1684.743,
    "text": "Any kind of multi-step",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1686.44,
    "end": 1711.453,
    "text": " um mental processes like for instance like um you can get unconscious priming effects where people can do something like two plus two um but you can't then you but they can't unconsciously do two plus two minus four um right so anything that requires holding this kind of intermediate result in mind um to do a further operation on it is something that at least thus far nobody's able to do an experiment to um you know that people can do that unconsciously um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1714.553,
    "end": 1720.376,
    "text": " But would you then, Ryan, would you think that consciousness is like a zero-one state, I mean, from that perspective?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1720.556,
    "end": 1731.9,
    "text": "I mean, for example, Giulio Tononi kind of sees this as a continuum, like consciousness is really a continuum of states where you can just have higher levels and lower levels of consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1732.44,
    "end": 1738.002,
    "text": "Well, so again, I mean, this gets back to what you're using consciousness to mean, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1738.022,
    "end": 1742.644,
    "text": "So in consciousness research, there's a distinction between levels of consciousness and content of consciousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1743.902,
    "end": 1749.345,
    "text": " Now, content of consciousness, I think most people agree, is fairly binary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1749.945,
    "end": 1757.449,
    "text": "I'm actually not totally sure what the IIT crowd would say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1757.729,
    "end": 1764.533,
    "text": "I'd have to look back at some of the more recent stuff there, but in terms of neuroscience,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1765.796,
    "end": 1781.63,
    "text": " There's these very well characterized ignition events that are nonlinear, all or none sorts of processes where if something becomes conscious, you get this global nonlinear, just kind of broad activation widely across large scale networks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1782.21,
    "end": 1786.694,
    "text": "Whereas if you don't get it, you don't pass this ignition threshold, then you still get the local",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1787.315,
    "end": 1793.62,
    "text": " like perceptual, like local activation in like say visual cortex provision or whatever sensory cortex.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.021,
    "end": 1807.79,
    "text": "But you don't get, but it's just kind of linear and it doesn't kind of percolate up or pass a threshold to cause this large scale kind of more all or none kind of thing where the information becomes kind of broadly accessible throughout the rest of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1808.911,
    "end": 1813.134,
    "text": "So that aspect I think has a fairly binary character to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1813.966,
    "end": 1817.409,
    "text": " Um, that's different than this kind of levels of consciousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1818.21,
    "end": 1829.739,
    "text": "Um, if you look at something kind of like the being in a predisposition to represent conscious contents, um, which would kind of be like a continuum from say like coma to like alert awareness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1830.6,
    "end": 1842.75,
    "text": "Um, and that, that probably just has to do with kind of like the state of protocol processing that, um, allows for, uh, uh, the, the kind of dynamics that support this kind of all or none, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1843.829,
    "end": 1845.49,
    "text": " the stuff that allows for selective contents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1846.57,
    "end": 1852.513,
    "text": "But anyway, I mean, all of this is going pretty far afield from active inference in your guys' paper now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1852.773,
    "end": 1855.275,
    "text": "So I don't wanna detract it away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1856.355,
    "end": 1858.296,
    "text": "It's fun stuff and it's important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.456,
    "end": 1869.862,
    "text": "So we'll go to a more applied question and then following this kind of round on an applied question, we're going to go into a few",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.842,
    "end": 1879.225,
    "text": " code walk slash talk throughs, as well as learn a little bit about a few approximations and some of other work by Sarah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.865,
    "end": 1885.808,
    "text": "So Lars asked us a question on Twitter, which anyone is always welcome to do, and wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.508,
    "end": 1894.694,
    "text": " I would love to hear any thoughts on how this work on the multi-armed bandit might be related to real world problem spaces or applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.415,
    "end": 1903.921,
    "text": "How might active improvements in multi-armed bandit tasks translate to improving how some problems or decisions are currently solved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.96,
    "end": 1926.436,
    "text": " we talked a little bit about this in dot zero and dot one but I'll go to any of the authors for a first take and then everyone else is welcome to give any thoughts or like ask a follow-up question so when you present the work and somebody just goes to this kind of obvious applied active inference question what is your thought",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.971,
    "end": 1936.176,
    "text": " Well, I mean, as I said, multi-armed bandits are applied to a super wide range of real-world applications.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1936.736,
    "end": 1948.443,
    "text": "So I opened a survey on practical applications of multi-armed bandits and contextual bandits on Bonifof and Arish.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1949.504,
    "end": 1951.605,
    "text": "Yurina Arish and Jalel Bonifof.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1952.846,
    "end": 1955.548,
    "text": "So this is one of the recent surveys I found, 2019, on Archive.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1959.22,
    "end": 1964.162,
    "text": " And here they list, for example, a couple of domains where they are applied.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1964.262,
    "end": 1974.325,
    "text": "Healthcare, finance, dynamic pricing, recommender system, maximization, dialogue system, telecommunications, anomaly detection.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1976.126,
    "end": 1985.809,
    "text": "And just by looking from that, I would first try things out with active inference-based bandits in kind of non-stationary problems.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1987.333,
    "end": 1991.734,
    "text": " And this is, from what I see, dynamic pricing and recommender system.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1991.774,
    "end": 1994.895,
    "text": "They are kind of in this domain, quite obviously.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1996.835,
    "end": 2011.318,
    "text": "But one can also imagine that telecommunication systems would also be a non-stationary problem as kind of searching for the fastest routing path and similar, where different routes can change over time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2011.358,
    "end": 2014.859,
    "text": "And then you have constantly where to explore different channels",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2016.299,
    "end": 2019.642,
    "text": " for passing along the information more optimally.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2019.742,
    "end": 2031.97,
    "text": "And these are kind of practical domains where one could first try active inference-based bandits.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2034.792,
    "end": 2041.376,
    "text": "As I said, in non-stationary kind of problems, which is most of the other things I listed, this is a bit more difficult.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2041.616,
    "end": 2042.957,
    "text": "One would have to see if",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2044.505,
    "end": 2055.508,
    "text": " there is a way to deal with this kind of bad asymptotic behavior, basically, all our optimistic information search.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2055.528,
    "end": 2060.97,
    "text": "JOHN MUELLER\": Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.03,
    "end": 2063.351,
    "text": "Sarah, any thoughts on that, or anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.572,
    "end": 2067.812,
    "text": "Steven?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.073,
    "end": 2071.836,
    "text": " Could you just repeat that last bit?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2072.416,
    "end": 2077.102,
    "text": "You said something about isotropic behavior or some sort of type of behavior.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2077.122,
    "end": 2078.064,
    "text": "I didn't quite catch that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2078.144,
    "end": 2079.105,
    "text": "Asymptotic, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2079.125,
    "end": 2081.848,
    "text": "So this is like in stationary bandits.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2082.449,
    "end": 2088.216,
    "text": "People are interested in the asymptotic behavior after like infinite many actions, so to say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2089.558,
    "end": 2095.14,
    "text": " and how different algorithms scale there, whether they converge to a good solution or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2096.0,
    "end": 2100.382,
    "text": "And I mean, this is what we find in the stationary problems.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2100.462,
    "end": 2102.923,
    "text": "Active inference is too optimistic in a way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2103.143,
    "end": 2105.884,
    "text": "It converges to a solution too fast.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2107.084,
    "end": 2111.766,
    "text": "That's the way we define it, at least.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2111.866,
    "end": 2114.687,
    "text": "And that's why it doesn't have good asymptotic behavior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2114.767,
    "end": 2118.468,
    "text": "So if you would apply it to a stationary problem,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2119.255,
    "end": 2126.842,
    "text": " When you would like with high probability to find a good solution, I mean, active inference algorithm is not one to go for there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2128.604,
    "end": 2136.771,
    "text": "At least, again, we have some ideas how to change this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2136.831,
    "end": 2141.656,
    "text": "But I mean, just based on expected free energy, this is not something which behaves nicely.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2143.018,
    "end": 2148.96,
    "text": " So you almost have to do like a hack on it to keep bringing it back away from premature.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2149.781,
    "end": 2150.501,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2150.521,
    "end": 2157.184,
    "text": "It kind of just gets stuck prematurely into a solution which the agent believes it's a good one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2158.264,
    "end": 2161.726,
    "text": "And the reason for this one can see immediately just from this, from...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2163.14,
    "end": 2170.587,
    "text": " the term which drives the exploration, which is this expected information gain.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2172.189,
    "end": 2177.754,
    "text": "In reinforcement learning, this is called exploration bonus or something like this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2177.874,
    "end": 2179.996,
    "text": "And this doesn't increase with time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2181.077,
    "end": 2186.983,
    "text": "So in a way, all these previous algorithms, like upper confidence bound UCB,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2188.344,
    "end": 2192.206,
    "text": " The reinforcement learning-based algorithms, they have a bound which increases with time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2192.266,
    "end": 2197.448,
    "text": "So if you are not sampling from one arm, this bound becomes bigger.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2197.488,
    "end": 2201.31,
    "text": "So your algorithm is kind of forced to switch at some point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2202.43,
    "end": 2203.871,
    "text": "And this is not happening here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2203.971,
    "end": 2211.874,
    "text": "So either one will need a different generative model or a different way to introduce more randomness into the behavior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2213.41,
    "end": 2228.735,
    "text": " One aspect of, it was figure one or no, it was figure two in the paper was that on the top left there, that the variance across active inference agents was increasing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.096,
    "end": 2234.578,
    "text": "So it wasn't that like every instance was slightly degrading in performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.098,
    "end": 2238.259,
    "text": "It was actually that a small subset where you wrote there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.019,
    "end": 2244.703,
    "text": " a small percentage of the ensemble did not find the accurate solution and were overconfident in their estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.244,
    "end": 2260.575,
    "text": "So it does suggest a few ways in which maybe, you know, when the variance of a few parallel instances of active inference starts diverging, that could be like a warning sign that some of them are getting too confident too early.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.136,
    "end": 2263.878,
    "text": "And then also it was interesting how you explored that variation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.11,
    "end": 2276.376,
    "text": " the learning rate or Lambda through time and just kind of said that, okay, there's no simple answer here, but it's an area of future work for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.456,
    "end": 2289.823,
    "text": "Yeah, I mean, the problem with like parallel runs in practical applications, you don't have that, how do you say, that advantage in simulations, I can just run",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2290.922,
    "end": 2293.224,
    "text": " I mean, any number of simulations, just see how it behaves.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2293.764,
    "end": 2296.846,
    "text": "But in practice, when you're solving the problem, you just have one trajectory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2296.946,
    "end": 2308.955,
    "text": "And then you have to provide an insurance that this sample or this sequence of actions will behave better than random or better.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2309.395,
    "end": 2313.418,
    "text": "There is some probability to converge over a long run.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2313.638,
    "end": 2316.12,
    "text": "And this is something which you don't get with",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2319.572,
    "end": 2321.853,
    "text": " with active, infinite, and stationary problems, at least.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2322.093,
    "end": 2328.175,
    "text": "In non-stationary, we don't see this issue anymore because of basically the generative model itself.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2329.316,
    "end": 2340.76,
    "text": "Because the less you're exploring, the more your uncertainty rises on the arms which you haven't observed because the agent believes that things will change over time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2341.741,
    "end": 2347.143,
    "text": "Simply, this is also what helps it shift between arms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2348.12,
    "end": 2360.967,
    "text": " And it's also very efficient to kind of extract information from them because agent picks up really fast what kind of arms were not sampled and it is aligned with its beliefs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2363.738,
    "end": 2376.868,
    "text": " I wonder if this also might reflect the difference between optimizing the model for practical application in, I don't know, a computer simulation program and the way that organisms behave.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2377.269,
    "end": 2386.856,
    "text": "It may be that we prematurely shut off and let things become a habit, but that may have downsides.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2386.876,
    "end": 2391.32,
    "text": "It may be that organisms, just to minimize use of energy,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2392.403,
    "end": 2394.864,
    "text": " prematurely converge on something inaccurate.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2394.944,
    "end": 2401.526,
    "text": "And so maybe that's like gambling and that could, it could show a fragility at times.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2401.906,
    "end": 2404.647,
    "text": "So there's maybe two ways that it's being applied, you know?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2406.607,
    "end": 2406.787,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2406.807,
    "end": 2410.508,
    "text": "I mean, I would say that organisms are never exposed to a stationary environment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2410.528,
    "end": 2411.389,
    "text": "So, right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2411.449,
    "end": 2417.35,
    "text": "I mean, in a way, if you are not doing that, you are suboptimal because you are living in an environment that changes constantly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2418.231,
    "end": 2419.011,
    "text": "Right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2419.878,
    "end": 2429.964,
    "text": " So in a way, you can exploit this by now creating situations where, well, people behave weird and have gambling issues and stuff.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2430.765,
    "end": 2437.929,
    "text": "But I don't think that's kind of a disadvantage for what we evolved to do, actually.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2439.41,
    "end": 2441.271,
    "text": "For that, we are very good in doing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2441.291,
    "end": 2445.473,
    "text": "Finding good solutions reasonably fast.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2446.774,
    "end": 2447.715,
    "text": "Yeah, sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2447.735,
    "end": 2449.536,
    "text": "I was just curious, I mean, because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2450.029,
    "end": 2464.613,
    "text": " You know, I mean, this is something that, you know, like with some of our like empirical work we've run into, you know, so like when trying to model a like change point detection tasks, for example, um, using active inference where, um, yeah, like same thing, like the thing becomes too confident too quickly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2464.633,
    "end": 2474.735,
    "text": "Um, but I wondered, I mean, cause I mean, in, in a lot of other empirical work, like in neuroscience, especially like it's, it's pretty clear that people don't just kind of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2475.379,
    "end": 2482.746,
    "text": " learn and then unlearn the like reward probabilities or just whatever the kind of environmental statistics are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2483.267,
    "end": 2485.549,
    "text": "Like when there's like abrupt changes, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2485.669,
    "end": 2490.494,
    "text": "I mean, what people do is instead they infer that there's some new hidden cause, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2490.534,
    "end": 2491.835,
    "text": "There's some new latent context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2492.476,
    "end": 2499.903,
    "text": "And then under that new context, you basically just have really flat, low, you know, really, really small",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2500.458,
    "end": 2504.68,
    "text": " you know, like magnitude concentration parameters, and then you just build up, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2504.92,
    "end": 2507.722,
    "text": "Like your beliefs a new under that new context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2508.562,
    "end": 2521.609,
    "text": "Um, and so there's, there's like something, so there's like that kind of approach, which either would require having some, something hierarchical or having some kind of like additional hidden state factor that would correspond to context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2522.329,
    "end": 2522.61,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2522.77,
    "end": 2524.971,
    "text": "Um, you know, it seems like you could do it either of those ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2525.531,
    "end": 2527.092,
    "text": "Um, the, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2527.995,
    "end": 2536.118,
    "text": " And then the, the other thing to do would be to have some kind of like in the HPF, like in the hierarchical Gaussian filter where you have some kind of, uh, like dynamically adjusted learning rate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2537.038,
    "end": 2556.205,
    "text": "Um, you know, or, or really something more like, um, you know, so then like recently when we were updating, um, some of the, with our tutorial paper, um, you know, like after talking with Carl, um, you know, it seemed like it would be a good idea to also include this kind of like forgetting rate parameter, as opposed to just like the standard learning rate parameter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2556.837,
    "end": 2565.445,
    "text": " which is just kind of like a scalar parameter on the actual concentration parameters prior to adding on the new counts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2566.285,
    "end": 2579.197,
    "text": "And so you could, that's not dynamic, but at least it does prevent, it can act as kind of like something like an implicit prior on volatility that can prevent the thing from becoming too confident too quickly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2580.698,
    "end": 2582.079,
    "text": "But yeah, I guess I just,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2584.54,
    "end": 2600.872,
    "text": " I wondered if, you know, you guys had like thought about, or, you know, like played around at all with, with something like that, something like inferring, inferring new kind of like latent contexts, as opposed to just having to kind of like, you know, like the thing becoming too confident and having to spend a bunch of time overwriting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2601.333,
    "end": 2601.613,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2601.713,
    "end": 2605.216,
    "text": "It's a, you know, it's old, it's old beliefs, which happens way too slow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2605.236,
    "end": 2611.08,
    "text": "I mean, in the end, um, I, my current model,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2611.844,
    "end": 2622.97,
    "text": " It's actually based on such a hierarchical model as you described where my agent, instead of unlearning all the action-outcome contingencies, it opens up a new context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.831,
    "end": 2627.892,
    "text": "Have you inferred that the context changed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2628.973,
    "end": 2640.199,
    "text": "I think when we were looking for proper learning algorithms for the paper, we most definitely looked in contextual learning and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2641.3,
    "end": 2648.118,
    "text": " I think in the stationary case, there are no contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2648.579,
    "end": 2650.324,
    "text": "That's why we didn't introduce it there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2651.076,
    "end": 2659.862,
    "text": " And I think the SMILE algorithm we used for the non-stationary bandit also has a forgetting rate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2661.403,
    "end": 2673.071,
    "text": "Just like you say, a forgetting rate on the concentration parameters, which I think is another reason why this algorithm worked well in the non-stationary case or better than in the stationary case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2673.591,
    "end": 2679.415,
    "text": "And in theory, I think we also tried some version of this where we have both contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2681.044,
    "end": 2683.625,
    "text": " I'm not getting parameters, but yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2683.905,
    "end": 2698.227,
    "text": "In the end, then, for the randomly moving bandits, we had also thought about then having another layer to this hierarchical model that in person volatility to adjust the learning rate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2699.348,
    "end": 2704.389,
    "text": "And if you start that, your learning model becomes very abstract really quickly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2704.489,
    "end": 2707.409,
    "text": "Maybe it's overkill.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2707.549,
    "end": 2710.17,
    "text": "So I guess what I don't completely understand still is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2711.334,
    "end": 2723.104,
    "text": " Even in the stationary case, if, uh, if you're getting ready to switch really high, I mean that all this is going to happen is your, the actual like magnitude of your concentration parameters are never going to build up to too high of a value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2723.124,
    "end": 2723.344,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2723.864,
    "end": 2727.107,
    "text": "So like, does that not still help with the overconfidence issue?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2727.427,
    "end": 2728.208,
    "text": "I just sort of thought it would.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2730.719,
    "end": 2734.582,
    "text": " Well, we don't have a kind of forgetting parameter in non-stationary case.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2735.243,
    "end": 2741.788,
    "text": "At least this shuts off because assume agent believes it's in a stationary environment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2742.468,
    "end": 2751.695,
    "text": "Yeah, I guess you could still put an agent in a stationary environment, but it seems like it could be plausible that it has a kind of... Yeah, forgetting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2752.636,
    "end": 2754.457,
    "text": "Yeah, I agree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2754.497,
    "end": 2757.9,
    "text": "I mean, that's one way one could try out, right, to resolve the...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2759.458,
    "end": 2762.279,
    "text": " Uh, exploration from in stationary case, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2762.299,
    "end": 2765.619,
    "text": "Just simply, uh, giving agent to the wrong beliefs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2765.799,
    "end": 2779.882,
    "text": "So the things we use the same learning, the same Bayesian belief updating algorithm for all the different action selection methods that we compared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.962,
    "end": 2784.163,
    "text": "And then, um, it's a weird interplay between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.455,
    "end": 2795.989,
    "text": " The learning model that we chose for the stationary case and the action selection rule and I mean Thompson sampling which uses the same learning does not have this issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2796.991,
    "end": 2797.271,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2798.232,
    "end": 2800.736,
    "text": "And that I think is also interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2802.728,
    "end": 2810.193,
    "text": " So to the second part of the question, where how would that translate to improving how some problems our decisions are currently solved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.513,
    "end": 2811.474,
    "text": "I'm hearing a few things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.694,
    "end": 2818.018,
    "text": "We talked about speeding up computation relative to other approaches, but that's not a solved problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.118,
    "end": 2823.382,
    "text": "For example, if there's a 10 times speed up, but then you have to run 10 agents in parallel to get a good ensemble estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.942,
    "end": 2824.843,
    "text": " then it's a wash.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.204,
    "end": 2842.285,
    "text": "So potentially for speeding up just the computational requirements for certain challenges, a second would be that it might be possible to more rapidly lock in to dynamically changing regimes and to avoid some of the pathologies of model fitting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.266,
    "end": 2859.968,
    "text": " in multi-armed bandit contexts and then a third way that it could translate to improvements would be it might reveal some hidden similarities between these different problems and settings like we already know that they're somewhat similar because we can apply multi-armed bandit to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.569,
    "end": 2863.111,
    "text": " you know, health, finance, recommendation systems, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.451,
    "end": 2872.097,
    "text": "So we know that there's a lot of problems involving data that have similar enough structures such that a similar kind of general algorithm can be applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.598,
    "end": 2882.825,
    "text": "But then it could be interesting once we have them on the common grounding of active inference to say, actually, you know, the structure of the decision making is similar across these two settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.445,
    "end": 2889.448,
    "text": " or the telecommunications routing and the logistics routing are similar in this unexpected way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.788,
    "end": 2911.957,
    "text": "So maybe insights relating to what kinds of tweaks an agent could improve on their performance with, like what we're talking about here with the categorical hidden states or learning and forgetting tweaks, maybe some of those insights could be implemented in active inference and then more easily transferred across different domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.935,
    "end": 2919.579,
    "text": " So hope that conveyed some of our thoughts on this question to Lars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.739,
    "end": 2920.139,
    "text": "Anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.02,
    "end": 2921.16,
    "text": "Yes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2921.28,
    "end": 2928.204,
    "text": "I mean, one issue there is that in different domains, you will, in principle, have different generative models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2928.545,
    "end": 2935.329,
    "text": "I mean, although the problem is the same, multi-ambient, I mean, you will need different representation of the environment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2935.549,
    "end": 2938.371,
    "text": "And this is then where the challenge comes, potentially.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2941.625,
    "end": 2949.35,
    "text": " if you can represent it as a multi-embedded problem, you can choose different, whatever action selection algorithm you find towards best.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2949.55,
    "end": 2954.993,
    "text": "And in non-stationary situation, at least for what we investigated, this seems to work well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2955.054,
    "end": 2957.395,
    "text": "This doesn't mean necessarily that this generalizes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2958.136,
    "end": 2961.018,
    "text": "One will still have to try out different things just to make sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2962.238,
    "end": 2967.702,
    "text": "But in the end, the bigger challenge is like, okay, what is a good generative model for this dynamic problem which I have?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2969.958,
    "end": 2972.539,
    "text": " And one can go there with many different things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2973.119,
    "end": 2979.9,
    "text": "I mean, for example, what Ryan also mentioned, this kind of open-ended contextual learning.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2980.0,
    "end": 2987.082,
    "text": "I mean, one can represent simple in the environments where you don't know anything about what's going on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2987.142,
    "end": 2991.522,
    "text": "You can just do a non-parametric generative model, like Dirichlet process or Gaussian process.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2991.983,
    "end": 2993.743,
    "text": "And you just try to learn even what",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2994.998,
    "end": 3012.077,
    "text": " model itself should be awesome so let's go to this little sub discussion on sarah one of your previous papers and then we're gonna turn to some notebooks and walkthroughs of the bandit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.978,
    "end": 3035.171,
    "text": " project but hopefully this will be informative because first off belief propagation and message passing and these types of approximations are of interest to the lab in the community and also we're seeing a few faces that we can ascend active inference mountain on we have ryan with a matrix based matlab approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.891,
    "end": 3040.375,
    "text": " We will walk through in just a few minutes with a Python-based approach of the bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.715,
    "end": 3045.619,
    "text": "And then this is a slightly different approach based upon the Beth approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.899,
    "end": 3049.722,
    "text": "So Sarah, anything you'd like to describe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.762,
    "end": 3054.566,
    "text": "I'm sure this will be new to many people, so it will be helpful to convey what you were working on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.908,
    "end": 3057.348,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3058.589,
    "end": 3061.892,
    "text": "So in figure two, the upper one, what you see is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3062.947,
    "end": 3068.932,
    "text": " the generative model of a normal observable Markov decision process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3070.113,
    "end": 3075.577,
    "text": "Where in the upper row, the unfilled circuits are the hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3075.857,
    "end": 3078.86,
    "text": "Sorry, they were called S in the previous slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3079.72,
    "end": 3081.562,
    "text": "And below are the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.542,
    "end": 3091.97,
    "text": "And then the whole dynamics of which states follow upon each other is determined by the policy pi on the left side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3093.582,
    "end": 3110.114,
    "text": " And then what people often do is assume in this Q that we saw two slides before, the mean-field approximation, which means, basically, which means that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3111.305,
    "end": 3116.129,
    "text": " For example, here we have a bunch of hidden states, HT, HT plus one and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3117.11,
    "end": 3131.482,
    "text": "And then if you assume the mean field approximation, the approximate belief distribution would be just Q of HT times Q of HT plus one times and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3132.222,
    "end": 3138.428,
    "text": "And there with you create an implicitly, yeah, you essentially treat all the hidden states",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3139.278,
    "end": 3142.28,
    "text": " as independent in your approximate beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3143.241,
    "end": 3148.184,
    "text": "And then the dependencies will be averaged out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3149.225,
    "end": 3153.388,
    "text": "In figure three, you actually see the inverted model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3154.469,
    "end": 3159.232,
    "text": "And with M, you see the messages that are being passed in between nodes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3160.413,
    "end": 3163.235,
    "text": "So it doesn't matter what approximation you use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3163.295,
    "end": 3168.299,
    "text": "In the end, you can calculate your beliefs with some sort of message passing algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3171.843,
    "end": 3185.146,
    "text": " Except that now, if you chose a mean fit approximation and you estimate all hidden sets separately, what we found is that actually they may not fit very well to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3185.246,
    "end": 3195.668,
    "text": "So for example, when my agent predicted how it will go through the grid and a certain policy, it actually often predicted it will jump.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3197.435,
    "end": 3201.818,
    "text": " and go places that don't adhere to set transitions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3204.739,
    "end": 3209.342,
    "text": "And therewith, of course, leading to decreased goal reaching success.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3211.063,
    "end": 3225.372,
    "text": "And then instead of doing this mean sheet approximation, we assume the beta approximation, which instead of having QHT times QHT plus one and so on, you have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3226.169,
    "end": 3228.81,
    "text": " small pairs of joint distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3228.95,
    "end": 3238.313,
    "text": "So Q of HT and HT plus one times Q of HT plus one and HT plus two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3239.793,
    "end": 3254.138,
    "text": "And then doing the math, you can show that if you assume this type of approximation and you plug it into the free energy, you want to minimize the free energy, the belief propagation methods passing algorithm comes out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3256.047,
    "end": 3266.029,
    "text": " And so you can use the belief propagation message passing algorithm under the beta approximation to calculate beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.069,
    "end": 3269.49,
    "text": "And this is actually exact on graphs without loops.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3272.591,
    "end": 3280.213,
    "text": "And then you'll get a more appropriate joint representation in this case of temporarily dependent hidden variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3282.753,
    "end": 3285.294,
    "text": "But I mean, in the end, yeah, what I do nowadays that I also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.508,
    "end": 3292.53,
    "text": " I have a hierarchical model where now, for example, the parameters of the Markov decision process are context dependent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3293.531,
    "end": 3302.134,
    "text": "I look into my model and think which variables belong together, and then I apply the beta approximation in these parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3303.034,
    "end": 3314.638,
    "text": "But then some slower varying variables like the context, I just use the mean fit approximation because it varies differently anyways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3317.483,
    "end": 3319.585,
    "text": " Thanks for that breakdown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.526,
    "end": 3323.108,
    "text": "What is message passing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.128,
    "end": 3325.79,
    "text": "Like, who are the messages being passed between?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.51,
    "end": 3331.174,
    "text": "And does that reflect a variant on active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.795,
    "end": 3341.503,
    "text": "Or is it the same exact active inference model can be approximated or can be calculated through message passing or through other mechanisms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.013,
    "end": 3350.616,
    "text": " Correct me if I'm wrong, Dimitri, but I think in the end, all active inference agents do message passing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3351.297,
    "end": 3355.019,
    "text": "Depends on the approximation, which type of message passing algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3356.259,
    "end": 3363.083,
    "text": "So, yeah, and the beta approximation, it's belief propagation, message passing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3363.123,
    "end": 3367.245,
    "text": "I think there are equivalences to some product algorithm also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3367.966,
    "end": 3370.247,
    "text": "You just get different messages that maybe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3370.967,
    "end": 3372.167,
    "text": " better or worse, but okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3372.307,
    "end": 3375.048,
    "text": "What other messages essentially each note in the graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3375.068,
    "end": 3384.409,
    "text": "So each hidden variable since other hidden variables that it's connected to a message about which state it should be in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3384.63,
    "end": 3388.55,
    "text": "So HT would say, Hey, we're currently here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.751,
    "end": 3397.832,
    "text": "Then I think in the next day we should be there and then vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3398.853,
    "end": 3403.634,
    "text": " HGPAS1 can send a message back that says, hey, we want to be there next time, Seb.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3404.614,
    "end": 3405.654,
    "text": "Where should we be now?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3407.275,
    "end": 3415.616,
    "text": "And so, yeah, these variables essentially send each other messages on what they should be so that they are in agreement with each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3417.996,
    "end": 3427.758,
    "text": "And that's how you get essentially a probability distribution over what you think, which state you're in and will be in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3429.659,
    "end": 3432.881,
    "text": " Yet, Dimitri, any thoughts on message passing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.961,
    "end": 3439.225,
    "text": "Or where do you see message passing fitting into Bayesian statistics and a few other topics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.245,
    "end": 3445.389,
    "text": "DIMITRI LASCARISONI- I mean, as Sarah said, I mean, they would say all the algorithms are message passing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3445.529,
    "end": 3451.132,
    "text": "So when you talk about mean field approximation, this would be traditionally variational message passing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3451.413,
    "end": 3452.653,
    "text": "It's called the algorithm, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3454.074,
    "end": 3456.035,
    "text": "Here, this is like belief propagation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3458.129,
    "end": 3486.861,
    "text": " message passing algorithm based on marginal probabilities instead of in the variational message passing you have like expectations of the log of conditional probabilities right i mean this is kind of the differences what you're what you're getting and losing and i mean we have another paper with thomas parr and carl neuronal message passing using mean field beta and marginal approximations",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3487.759,
    "end": 3490.52,
    "text": " where we kind of contrast these different ways.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3490.54,
    "end": 3497.861,
    "text": "So who is interested in this topic can look into a bit unpacked discussion of similarities and differences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3499.501,
    "end": 3507.103,
    "text": "In practice, the difficulty with mean field approximation is, I mean, for dynamical problems, for dynamical decision-making, it's not really a good approximation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3507.123,
    "end": 3509.943,
    "text": "This is not something which one would use.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3510.043,
    "end": 3517.285,
    "text": "And implementation-wise in active inference, mean field approximation is not used on the dynamical level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3518.451,
    "end": 3522.255,
    "text": " What they are using in MATLAB, for example, is all this marginal approximation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3522.535,
    "end": 3527.419,
    "text": "It's still kind of gradient-based method, but it's computed slightly differently.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3531.582,
    "end": 3532.003,
    "text": "Sorry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3532.603,
    "end": 3533.324,
    "text": "Continue, continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.885,
    "end": 3537.287,
    "text": "Well, I just wanted to wrap up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3537.387,
    "end": 3543.433,
    "text": "Basically, the more complex problem it is, the more uncertainties you have on the state transitions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3544.304,
    "end": 3548.568,
    "text": " the more difficulties you will have with mean field and marginal approximation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3548.588,
    "end": 3559.357,
    "text": "Basically, the beta approximation is the only thing which kind of corresponds to actually exact inference in non-cyclic graphs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3559.578,
    "end": 3563.021,
    "text": "So basically, this is theoretical solution.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3563.061,
    "end": 3569.106,
    "text": "You know that you can be exact under specific conditions on the marginal.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3570.072,
    "end": 3580.983,
    "text": " There's a paper I can only warmly recommend by Yadidia and Weiss, I think in 2001, called Understanding Belief Propagation and Its Generalizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3581.703,
    "end": 3583.445,
    "text": "And I find it very didactic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3583.525,
    "end": 3584.246,
    "text": "It helped me a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3584.646,
    "end": 3593.475,
    "text": "And they explain in detail how variational inference is also connected to message passing algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3596.179,
    "end": 3610.486,
    "text": " So just to capture that one interesting thing you said there about the gradients, the gradient, it's sort of like your models in a given spot on the landscape, and then it checks the temperature and it goes in the direction of the gradient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.806,
    "end": 3616.348,
    "text": "So we've talked a lot about gradient based methods with the straight line versus the ISO contour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.009,
    "end": 3621.151,
    "text": "Message passing kind of breaks that down into a process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.511,
    "end": 3623.392,
    "text": "So at each click of the model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.542,
    "end": 3634.37,
    "text": " Messages are being passed back and forth to one another which is both computationally tractable it's also shown through some work of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.933,
    "end": 3649.858,
    "text": " the BIAS lab, Bert DeVries and others, that for specific categories of Bayesian graphs, that message passing algorithms are basically equivalent in the Forney factor graphs, the FFG, which we're gonna be learning about in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.338,
    "end": 3658.221,
    "text": "And also this topologically puts you more into touch with the predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.561,
    "end": 3661.482,
    "text": "For example, the messages that neurons are passing to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3662.102,
    "end": 3668.266,
    "text": " So it's one thing to say, well, it's as if the neurons are messaging to each other and that's doing a gradient descent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.907,
    "end": 3677.933,
    "text": "But it's another thing to actually saying we have a message passing scheme for modeling how these message passing agents do inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.874,
    "end": 3684.618,
    "text": "So there's a few points of contact there that I think are pretty important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.658,
    "end": 3688.1,
    "text": "And it's also interesting that you brought up that early paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.481,
    "end": 3689.661,
    "text": "So we'll check that one out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.182,
    "end": 3691.683,
    "text": "Steven, did you have a question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.427,
    "end": 3695.413,
    "text": " I think it's been sort of covered really.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3697.409,
    "end": 3724.012,
    "text": " cool area though so thanks sarah for um sharing that just one last question on this before we go to the um bandit codes and walkthrough like where do these approaches um are they converging and they're going to weave together more closely or is one of them like an umbrella over the other such that work will continue mainly under the generalized form",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.604,
    "end": 3744.794,
    "text": " where do these different approaches that we're talking about to implementing active inference where are they heading like is it is more development happening on the message passing approximation or on other modes of breaking down active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.445,
    "end": 3763.59,
    "text": " I'm not sure I have the overview of hundreds of papers to publish every month to say something like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3763.67,
    "end": 3772.133,
    "text": "As far as our motivation is here, we just want to have in different situations good enough inference approximations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3776.87,
    "end": 3789.096,
    "text": " In a way, for me, more important question is, what is a good representation of different tasks and environments to have rather than what is the best kind of inference algorithm to use?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3792.677,
    "end": 3804.463,
    "text": "Because especially if, I mean, depending, again, on the environment you're working on, but in dynamic context, it's difficult to get lots of advantage with just",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3805.828,
    "end": 3811.074,
    "text": " improving slightly on the inference performance.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3811.194,
    "end": 3815.318,
    "text": "Just because there's lots of uncertainty and things in any way change all the time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3815.639,
    "end": 3822.546,
    "text": "I mean, with this, we also kind of write for this multi-armbanded paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3822.586,
    "end": 3824.769,
    "text": "We tested lots of different algorithms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3826.236,
    "end": 3831.497,
    "text": " There is one of the notebooks in repository just kind of lists different things we've tried out.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3833.137,
    "end": 3841.779,
    "text": "But in the end, one doesn't see any reason why one algorithm would be specifically a way better than another.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3841.859,
    "end": 3842.959,
    "text": "It's just they're very similar.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3844.179,
    "end": 3845.579,
    "text": "Subtle differences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3846.96,
    "end": 3853.121,
    "text": "Great point that there's a lot of work on the comparability of different approximations and different algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.621,
    "end": 3854.161,
    "text": "But actually,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.515,
    "end": 3874.478,
    "text": " it might be more beneficial for a given application to focus more on how they're specifying the generative model and making sure that that really captures essential features of the environment, because it's like, okay, let's just roll with active inference and spend our attention on the generative process and the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.439,
    "end": 3900.092,
    "text": " rather than try to finesse potentially a a grossly inferior generative model with some better approximation there might be limited returns there so steven and then we'll go to looking at some of the bandit code yeah this is a kind of general question related to that is i often think about sort of didactic deontic q type um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.716,
    "end": 3927.686,
    "text": " sort of um ways of making inference um instead of um deductive thinking and such like and i'm wondering whether the message passing is is more present in those types of models because it's it's something that's been detected in the environment and decisions based on that are being made and you've got then you've got you kind of inductive where you're trying to narrow the gap",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3928.598,
    "end": 3940.303,
    "text": " between a goal and then you've got your abductive where you're trying to build something up and infer from like a landscape that you're trying to work out what is out there, so to speak.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3941.143,
    "end": 3942.724,
    "text": "And I'm wondering if...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3943.84,
    "end": 3960.222,
    "text": " This is correct in my thinking that the message passing is more used when you have like a particular deductive reasoning approach and inductive or abductive ones would be different.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3962.918,
    "end": 3986.179,
    "text": " interesting question about how those different modes and types of logic are connected to message passing one thought which might be on or off base is that we're thinking a lot about how variables in a model are like nodes and then there's edges connecting the nodes that reflect the relationship between those variables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.245,
    "end": 3996.152,
    "text": " And message passing is just one way to describe as a model updates through time, which information is being passed between the variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.052,
    "end": 4004.538,
    "text": "So it doesn't say anything about the mode of operation of an agent, which might be engaging in different kinds of logics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4004.878,
    "end": 4007.8,
    "text": "And I think that's a really excellent question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.82,
    "end": 4012.984,
    "text": "Like how do we break out of the known",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.594,
    "end": 4035.975,
    "text": " with respect to how our algorithms update and it does actually touch upon this mean field approximation for example if you think that all through all time past present and future that there's some stationarity of the hidden state then the mean field approximation will work but then if there's going to be a change in the state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.461,
    "end": 4062.727,
    "text": " then the mean field approximation is potentially going to give a misleading outcome but in any case message passing is just describing sort of the mechanics of how the model updates and which information between variables is connected but importantly which variables are not connected like the observation at a time point doesn't influence the observation at a different time point directly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.527,
    "end": 4067.768,
    "text": " but it could via a specified path of message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.809,
    "end": 4079.43,
    "text": "Let's look a little bit at the bandit code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.511,
    "end": 4088.512,
    "text": "So the links to the GitHub, Die Markov, you have the right name to work in the area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.532,
    "end": 4090.633,
    "text": "I do, yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4093.23,
    "end": 4095.352,
    "text": " So we have a few of these notebooks up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.574,
    "end": 4107.364,
    "text": "And is there, we can look at the overall notebooks folder or do you have a sense of which of the notebooks might be interesting to walk through?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.384,
    "end": 4110.947,
    "text": "I could go to a few or if you want to jump to a first one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.431,
    "end": 4118.232,
    "text": " I think just this first one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4118.312,
    "end": 4119.714,
    "text": "I think about this maybe.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4119.734,
    "end": 4121.655,
    "text": "Oh, go ahead.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4123.837,
    "end": 4125.178,
    "text": "Yeah, there are a couple of things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4125.998,
    "end": 4129.641,
    "text": "I mean, there are a couple of notebooks which are not immediately relevant for the paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4131.082,
    "end": 4136.966,
    "text": "So we can focus just on the things which are part of the paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4137.187,
    "end": 4144.112,
    "text": "Or I can just generally kind of talk also about these other things which were just process of thinking about the problem.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4145.467,
    "end": 4158.036,
    "text": " Okay, how about before we even, how do you as a researcher working on this area, keep that separate, like the paper specific developments, but then your overall developments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.496,
    "end": 4161.678,
    "text": "Do you find that you're on an overall development mood?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.179,
    "end": 4164.64,
    "text": "And then you dip into specifying a paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.841,
    "end": 4171.045,
    "text": "Or do you pursue the paper and find that you have more general insights while you're working through the problems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.83,
    "end": 4179.954,
    "text": " Well, I mean, I pursued the paper, but I mean, then, I mean, there are lots of branching paths on that way, in a way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4181.675,
    "end": 4185.237,
    "text": "You have to figure out what's potentially interesting, what's relevant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4186.778,
    "end": 4198.245,
    "text": "And so part of this code is just exploration, a bit of things, topics which were interesting for me, but which turned out not to be so important in the end, just maybe for some other paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4199.582,
    "end": 4207.724,
    "text": " And things which are just focusing exactly on the comparison of multi-armbanded algorithms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4207.844,
    "end": 4211.465,
    "text": "Discussing this part.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4211.545,
    "end": 4218.726,
    "text": "In a way, it's difficult to combine lots of potentially unrelated things into one paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4219.407,
    "end": 4221.527,
    "text": "One always has to make some favourites in the end.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4223.226,
    "end": 4236.962,
    "text": " I knew it would be a both type of question because it's something that researchers are often, you know, interested in general questions, but we need to deliver on specific research projects with a defined scope and conclusions as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.823,
    "end": 4241.187,
    "text": "So it's just cool to see that this repository holds a little bit of both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.669,
    "end": 4253.778,
    "text": " So for example, this notebook which you opened first, like expected free energy comparison, this was just my contemplation of just different ways you can define expected free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4255.38,
    "end": 4261.645,
    "text": "So typically, people will think about expected free energy in these terms of expectations of outcomes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4263.366,
    "end": 4270.332,
    "text": "But for example, other questions, OK, but why not computing in terms of expectations over states?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4271.96,
    "end": 4274.542,
    "text": " And there is a relation between these two, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4274.802,
    "end": 4276.463,
    "text": "One is an upper bound on another.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4276.624,
    "end": 4280.486,
    "text": "So basically, you see this last relation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4280.506,
    "end": 4283.849,
    "text": "There is s of pi, there is g of pi, and there is i of pi.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4285.47,
    "end": 4292.415,
    "text": "And basically, g of pi would be expected free energy in terms of expectations over latent states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4293.176,
    "end": 4297.178,
    "text": "So this first, and this is upper bound on what this would be like expected for me.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4300.034,
    "end": 4307.46,
    "text": " in equivalence to the free energy being the bound or marginal surprise, like log likelihood or surprising.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4310.102,
    "end": 4317.708,
    "text": "And then there is the I of pi, which is just KL divergence between posterior prior, which gives you then something else.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4319.189,
    "end": 4328.177,
    "text": "And one can also think, well, we can select policies or make decision-making algorithm based on this quantities and what happens when you use one over another.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4329.793,
    "end": 4334.823,
    "text": " So this is something which I was just testing out for myself.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4338.797,
    "end": 4340.518,
    "text": " I'm still not clear what to think about this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4340.558,
    "end": 4344.159,
    "text": "So that's why I don't have a paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4345.16,
    "end": 4347.461,
    "text": "This is very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.001,
    "end": 4351.123,
    "text": "It's all conditioned on policy with pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4351.983,
    "end": 4356.105,
    "text": "And then we're approaching it from the top and from the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4356.565,
    "end": 4361.787,
    "text": "And so the free energy is being sandwiched in between these other approximations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.028,
    "end": 4367.35,
    "text": "And then you wrote here that the minima of i and g of pi match.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4368.854,
    "end": 4370.495,
    "text": " but S is giving a different minima.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.555,
    "end": 4373.116,
    "text": "So what was curious about that to you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.316,
    "end": 4375.237,
    "text": "No, at least in this example, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4375.697,
    "end": 4383.922,
    "text": "So I just kind of build up simple example and one can see that optimal policy or like minima of these different quantities is different.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4384.742,
    "end": 4386.803,
    "text": "And one can also think probably of different examples.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4386.863,
    "end": 4390.065,
    "text": "Well, this will, I mean, this relation will not hold it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4390.085,
    "end": 4391.545,
    "text": "What I just wrote is a common there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4393.206,
    "end": 4395.728,
    "text": "But I mean, this is more like than practical question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4396.028,
    "end": 4398.569,
    "text": "So if you would then build an agent",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4399.645,
    "end": 4401.809,
    "text": " Which one of these quantities should you use?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4401.849,
    "end": 4413.628,
    "text": "They are all kind of effectively can be seen as expectation over future surprisal and having different bounds on that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4414.9,
    "end": 4416.981,
    "text": " expectation as an approximate quantity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4417.581,
    "end": 4431.086,
    "text": "So just the question is... And I also found in different problems, depending how I formulate problem, one of these algorithms works... Well, not algorithms, but objective functions, let's call them, works better.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4438.349,
    "end": 4443.351,
    "text": "So in this particular multi-ambedded task, which we explored, the g of pi is not",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4444.749,
    "end": 4448.252,
    "text": " So what should correspond to expected free energy?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4448.272,
    "end": 4451.475,
    "text": "This is not behaving that well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4451.655,
    "end": 4455.298,
    "text": "In a way, you don't get such a good performance.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4455.758,
    "end": 4461.843,
    "text": "But I can slightly change the task, and I can get better performance with G of pi or S of pi.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4461.863,
    "end": 4465.346,
    "text": "So as I said, I'm not sure what to think about this still.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4465.386,
    "end": 4470.03,
    "text": "So it's really like exploration of different things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4470.942,
    "end": 4475.243,
    "text": " We'll have you back on this topic when you're in a different phase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.263,
    "end": 4479.244,
    "text": "Do you want to look at inference algorithms comparison?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4479.264,
    "end": 4480.985,
    "text": "Well, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.025,
    "end": 4496.749,
    "text": "So inference algorithms, as I said, this notebook just lists some of the things which we consider in the literature when you think about this approximate inference problems in changing environments.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4497.429,
    "end": 4499.95,
    "text": "One can think of different ways how to solve this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4501.674,
    "end": 4518.743,
    "text": " What we used here is this representation, which comes from change point models as an approximation for the task, which is a good approximation for this kind of pitching bandits, which is what you're showing here, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4519.243,
    "end": 4521.944,
    "text": "For example, this is the question Blue had last week also.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4522.705,
    "end": 4531.149,
    "text": "So this would be how probability changes in switching bandits on one arm over time, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4532.149,
    "end": 4534.57,
    "text": " probability of generating one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4535.57,
    "end": 4536.69,
    "text": "Let's call this a reward.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4538.551,
    "end": 4540.351,
    "text": "This is what this plot is showing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4542.972,
    "end": 4550.493,
    "text": "And this is the switching concept that whenever a switch occurs, we are just sampling a new probability for each arm.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4550.573,
    "end": 4556.375,
    "text": "So this is this kind of setting with non-stationary difficulty.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4556.695,
    "end": 4561.356,
    "text": "So basically this difference between the best arm and second best, it varies over time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4562.888,
    "end": 4570.415,
    "text": " And then you have like a drifting dynamics for which just like the different generative approaches model would also be better.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4572.656,
    "end": 4579.322,
    "text": "But then one can also say, well, we can use any generative model for any of these problems and let's just see which does inference better.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4579.342,
    "end": 4581.104,
    "text": "Are there any differences there?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4581.584,
    "end": 4590.992,
    "text": "So can you just use different representations or different underlying environmental dynamics?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4592.52,
    "end": 4597.925,
    "text": " in a way, misspecified in the model, but still doing reasonably well in the inference part.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4598.045,
    "end": 4610.276,
    "text": "And when you look at the results, posterior expectations you get over time, different approaches lead to very similar results in the end.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4610.316,
    "end": 4611.477,
    "text": "So there is no strong",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4613.18,
    "end": 4615.422,
    "text": " advantage or disadvantage of one or another.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4616.003,
    "end": 4622.028,
    "text": "And that's the reason why we just picked the simplest thing, which kind of the most efficient, basically, algorithm.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4622.068,
    "end": 4626.912,
    "text": "Because then it's much easier to scale to more arms, more time steps, and things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4629.695,
    "end": 4631.917,
    "text": "OK, very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.017,
    "end": 4638.343,
    "text": "This is a pretty thorough walk through the hierarchical variational smile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.167,
    "end": 4639.808,
    "text": " Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4639.908,
    "end": 4649.455,
    "text": "It just describes the generative model, some of the steps one needs to take to get to the posteriors.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4652.537,
    "end": 4656.06,
    "text": "Then just implementation of the algorithm is unpacked there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4656.921,
    "end": 4667.869,
    "text": "But besides this, what we used in the paper, we also implemented some of other approaches, which are non-variational Asian inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4669.173,
    "end": 4697.937,
    "text": " uh which is seems to be quite good and i mean right on average it performs better it's like more optimal uh representation now this comes from i think also recent paper on multi-armed bandits um do you remember sarah the first daughter louis et al maybe or uh unfortunately not i would have to look well we are citing the paper anyway so but right uh um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4699.96,
    "end": 4701.161,
    "text": " But yeah, pretty recent paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4701.181,
    "end": 4702.541,
    "text": "MARIUSZ GASIEWSKI- Pretty recent paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4702.601,
    "end": 4706.143,
    "text": "And one can see that it does a slightly better job.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4706.203,
    "end": 4710.045,
    "text": "So that would be, I guess, this algorithm you're showing now.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4710.185,
    "end": 4710.365,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4711.886,
    "end": 4716.889,
    "text": "What are the lines representing the red, blue, green, and then the sort of flat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.909,
    "end": 4722.292,
    "text": "MARIUSZ GASIEWSKI- The green is just the posterior expectation over reward probability.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4722.352,
    "end": 4726.674,
    "text": "So the perfect algorithm should just match green with blue.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4729.013,
    "end": 4733.514,
    "text": " And the red is basically a change point inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4733.574,
    "end": 4739.316,
    "text": "So there's a posterior probability that the change occurred at this specific moment of time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4740.736,
    "end": 4744.237,
    "text": "And as you can see, this process is quite noisy in a way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4744.398,
    "end": 4753.04,
    "text": "You have lots of small errors in a way or slight jumps in places where change didn't necessarily occur.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4753.527,
    "end": 4780.26,
    "text": " know what what this reminds me of is um the blue is some hidden true price of an asset and then the green is like the markets tracking that price or value and then the red are like orders like buy and sell orders on the market that represent the underlying situation changing and it's like just uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4783.405,
    "end": 4785.086,
    "text": " Well, I mean, markets, yes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4785.346,
    "end": 4789.727,
    "text": "One can see markets as doing some kind of inference on the true value of the price.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4791.667,
    "end": 4793.888,
    "text": "This would be kind of a distributed inference problem.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4794.508,
    "end": 4794.728,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.848,
    "end": 4802.891,
    "text": "I mean, it's the whole no one knows the price of a pencil, but maybe the person making the eraser knows when the price of rubber changes a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.011,
    "end": 4806.912,
    "text": "But the colors are just a coincidence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4809.932,
    "end": 4810.852,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4811.072,
    "end": 4811.353,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4811.633,
    "end": 4813.874,
    "text": "And then here we see something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.195,
    "end": 4817.535,
    "text": "Yes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4817.875,
    "end": 4818.956,
    "text": "Here is this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4819.456,
    "end": 4825.998,
    "text": "If I remember correctly, this would be the hierarchical Gaussian filter applied to the same problem.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4826.699,
    "end": 4829.5,
    "text": "So this is work from Matisse et al, Chris Matisse.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4831.035,
    "end": 4837.839,
    "text": " He actually, in his first paper, he did apply to inferring the price of an asset over time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4838.139,
    "end": 4839.279,
    "text": "So when he introduced that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4839.92,
    "end": 4850.285,
    "text": "But it's found lots of applications in cognitive neuroscience and just understanding how people adjust to volatile environments.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4851.526,
    "end": 4855.488,
    "text": "So what we have here is that this kind of change probability is constant over time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4855.688,
    "end": 4859.53,
    "text": "But you can also think of the environment, the change probability itself changes over time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4860.418,
    "end": 4864.279,
    "text": " so that you need to kind of adjust to these changes also.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4867.68,
    "end": 4882.383,
    "text": "So that would be also kind of one straightforward extension of this multi-armed bending problem, different types of dynamics, and testing out then more complex generative models and approximations to deal with that problem.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4886.663,
    "end": 4892.448,
    "text": " We are just comparing now how this algorithm tracks the underlying price value in different environments.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4894.45,
    "end": 4897.212,
    "text": "I have a question about what action does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.833,
    "end": 4900.895,
    "text": "So here, the underlying generative process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4902.17,
    "end": 4905.493,
    "text": " is stochastic, but the actions don't change the process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4906.093,
    "end": 4910.777,
    "text": "Like choosing a different slot machine isn't changing the probability of slot machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.458,
    "end": 4927.49,
    "text": "So it's almost like a little bit more of a niche modification setting, or can it just be directly put into the model that certain actions actually change aspects of the underlying generative process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.311,
    "end": 4934.093,
    "text": " Or is that kind of a feedback between action and then future hidden states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4934.653,
    "end": 4937.874,
    "text": "Is that like another module that has to be constructed in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.215,
    "end": 4947.196,
    "text": "Well, for what we have implemented here, that would definitely need an extension, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4947.356,
    "end": 4955.899,
    "text": "So we kind of this is more than this general representation, which of also implementation of active inference, which, for example, is",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4956.795,
    "end": 4963.597,
    "text": " implemented in SPM, which then helps you deal with these more extended problems.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4964.477,
    "end": 4975.201,
    "text": "So here we really are working with the simplest algorithm just for having it very efficient and compact so that it can scale easily.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4977.441,
    "end": 4983.443,
    "text": "The more general you are in trying to capture many different problems, the more difficult you have with scaling.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4986.215,
    "end": 4989.377,
    "text": " It's like inference all the way up or all the way down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.397,
    "end": 5005.427,
    "text": "And it's a theme that we'll return to many times, which is that it's all good to track the absolute value of what you're interested in, but then the uncertainty on that, and then the uncertainty on your uncertainty about that can get you into this infinite recursion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.987,
    "end": 5013.592,
    "text": "So you just go quick and dirty and just have a simple idea of how variance and higher order uncertainties propagate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.312,
    "end": 5024.561,
    "text": " Or does one fully specify all the possible ways that uncertainty can exist across multiple levels, which can get to an explosion of the computational requirements really fast?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.544,
    "end": 5035.77,
    "text": "Well, I don't think that necessarily hierarchy is the issue.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5035.79,
    "end": 5040.514,
    "text": "But it's more right if you then start assuming that your actions change the state's",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5042.555,
    "end": 5047.378,
    "text": " state changes or transition matrices in this stuff, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5047.518,
    "end": 5051.64,
    "text": "So basically you're effectively with actions, you're modifying the state transition matrices.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5054.942,
    "end": 5066.088,
    "text": "Then this requires that, I mean, you also think about the planning problem and it's not any more simple action selection problem, but it's then becomes a planning problem.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5068.0,
    "end": 5072.305,
    "text": " And this makes things more complicated if you introduce such an environment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5072.845,
    "end": 5077.07,
    "text": "Because then it depends where you are at different moments of time in different states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5078.531,
    "end": 5089.942,
    "text": "Yes, because we've seen in the Markov decision processes that policy, pi, plugs into B, which is the transition matrix between hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5090.936,
    "end": 5106.745,
    "text": " so that's like actions changing the way in which hidden states are inferred to change through time whereas the one step decision making is um doesn't have to be done in that same uh way but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5108.724,
    "end": 5135.471,
    "text": " Yeah, I mean, I think also, I mean, at least original implementation in SPM, what is used, this doesn't scale so very well for this type of problems and different groups or people have started exploring like Monte Carlo research and other methods, which actually allow you to then figure out potentially best policy in a very complex, high dimensional problems.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5137.952,
    "end": 5146.978,
    "text": " But as long as you are in the domain of cognitive behavioral neuroscience, you can get away with this by just making your task reasonably simple.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5149.88,
    "end": 5150.66,
    "text": "You have this control.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5152.481,
    "end": 5170.492,
    "text": " Yes, but even as Ryan pointed out earlier that real humans, even when you control the experiment or you think that you're introducing a gradual change in a parameter, they might actually be cognitively doing a different type of inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.773,
    "end": 5173.754,
    "text": "No, humans are problematic.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5174.695,
    "end": 5175.235,
    "text": "I don't like them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5175.776,
    "end": 5176.256,
    "text": "Oh, humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5178.002,
    "end": 5179.403,
    "text": " We should do experiments with robots.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5180.623,
    "end": 5191.049,
    "text": "Well, maybe that will be the... I mean, we brought up the conversation, of course, logistics, planning, motor behavior, exploration, exploitation spatially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.489,
    "end": 5196.171,
    "text": "Those are things where maybe having a defined digital twin for some robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5196.651,
    "end": 5203.435,
    "text": "And then we go from in silico to robotics to starting to introduce the element of the human and the unknown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5205.925,
    "end": 5206.225,
    "text": " Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5208.966,
    "end": 5225.074,
    "text": "Sorry, I think in behavioral experiments, you always have this problem of just convincing yourself that the model you're using is something which reasonably well represents what humans are doing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5225.174,
    "end": 5229.096,
    "text": "And you can be quite certain that this is not what they're doing exactly right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5229.136,
    "end": 5232.418,
    "text": "This is just an approximation of all the complexity which we",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5234.148,
    "end": 5263.697,
    "text": " uh have in well our non-parametric representation of the role uh right and i mean kind of there is this issue right you can kind of get people to perform very well on the task through lots of training but then it's like okay is this really what i want to kind of experimentally whether like how can cubans learn to do this task well or i'm actually interested what people are doing when they are solving any task how they represent the environment",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5264.735,
    "end": 5270.477,
    "text": " state time representation, how is this incorporated in their decision model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5270.697,
    "end": 5284.001,
    "text": "And I think it's, I don't know how other people feel, maybe Ryan can comment on this, but for me, it's always a difficulty to deal with.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5284.121,
    "end": 5291.984,
    "text": "It's always uncertain whether you're doing the right thing, simply enforcing something, some task on people.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5294.298,
    "end": 5294.558,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.179,
    "end": 5295.599,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.639,
    "end": 5296.16,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5298.422,
    "end": 5313.154,
    "text": "Yeah, so talking about this, the problem with humans, but I'm interested in how the precision parameter, you talk about the precision parameter and it helps to determine whether someone's going to explore or exploit the context.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5313.635,
    "end": 5320.601,
    "text": "And I'm interested in how exploration can become a pragmatic tool",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5321.533,
    "end": 5327.123,
    "text": " this precision about the usefulness of something that's exploratory, i.e.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5327.423,
    "end": 5333.774,
    "text": "art or an experience of some sort, and how that meaningfulness in the future",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5334.858,
    "end": 5338.901,
    "text": " could offset a pragmatic gain in the near term.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5338.981,
    "end": 5346.348,
    "text": "So I'm interested in this, the way that precision fits in with that and sort of the evolution of that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5346.368,
    "end": 5352.373,
    "text": "And they even talk about that a bit with the affective charge with Caspar Hesp, i.e.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5352.813,
    "end": 5359.679,
    "text": "affective charge is how your precision about an expectation",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5361.107,
    "end": 5377.701,
    "text": " been violated or not you know it's not necessarily whether it's good or bad it's whether your your prediction of how well you could expect something to happen suddenly got violated and that amplifies everything um so i'm interested in that because i'm trying to create immersive experiences for",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5378.362,
    "end": 5379.703,
    "text": " theater and places like that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5380.203,
    "end": 5394.109,
    "text": "But I was just wondering what your thoughts about how that precision parameter fits in with that dynamic and how that could be extended or if there's other parameters that kind of can fit in there as well.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5403.553,
    "end": 5407.375,
    "text": "I'm not quite sure that I understand the question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5408.715,
    "end": 5420.819,
    "text": " Are you asking, is precision always relevant?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5421.359,
    "end": 5425.28,
    "text": "Yeah, can you stack the precision with the pragmatic, if that makes sense?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5425.3,
    "end": 5435.983,
    "text": "So say you've got low precision, but you have a high precision over the fact that exploring the low precision would be useful.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5436.872,
    "end": 5443.453,
    "text": " So the two things kind of stack on top of each other as being a sort of pragmatic epistemic game.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5444.353,
    "end": 5445.434,
    "text": "I can see that being the usual.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5445.474,
    "end": 5445.774,
    "text": "Yes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5446.114,
    "end": 5453.675,
    "text": "So, I mean, in this other paper on meta control, we are playing with it a bit differently.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5453.735,
    "end": 5462.357,
    "text": "So we are saying that you can kind of control your exploration tendencies if you learn over time the exploration is bad.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5464.592,
    "end": 5475.269,
    "text": " And this is kind of where this stacking of different levels of the hierarchy, like a higher level agent controlling the lower level comes in play.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5477.091,
    "end": 5495.272,
    "text": " Because simply if this higher level observes that over time the agent is not performing well, in a way it's not reaching the goals efficiently, then it kind of punishes exploration and learns just to be more exploitative in the specific settings.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5497.386,
    "end": 5498.488,
    "text": " And the other way around, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5498.508,
    "end": 5503.774,
    "text": "We can make kind of a setting where the exploration is beneficial always.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5504.635,
    "end": 5508.74,
    "text": "And then the agent learns to kind of behave in this way better.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5508.78,
    "end": 5515.909,
    "text": "So one can then assume in real situations, this is something which people learn, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5516.854,
    "end": 5527.696,
    "text": " So just if they observe that depending on what they do, they gain more or less, they will also adjust their tendencies and associate this with different contexts, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5529.596,
    "end": 5536.478,
    "text": "So you could have almost like, it's not just precision, you could have like another generative model managing those.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5537.818,
    "end": 5538.338,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5538.418,
    "end": 5543.079,
    "text": "I mean, you can just have another kind of higher level representation which controls",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5544.492,
    "end": 5567.949,
    "text": " uh priors or precisions on the lower level so right and basically inducing different behaviors through that to connect that to the um ostentative cues it's almost like if you had a a sound or a cue that said okay now we're in a brainstorming period okay now we're gonna drill down",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5569.361,
    "end": 5586.928,
    "text": " And by alternating between a brainstorming period and by drilling down, we're going to have the right kind of outcomes, but giving a cue for when one should be in a more exploratory mode versus potentially like more working with what is already known.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5587.768,
    "end": 5594.291,
    "text": "But this looks like an interesting paper, this meta control of exploration, exploitation dilemma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5598.078,
    "end": 5618.292,
    "text": " And also framing it in terms of the hierarchy of time scales, whereas often it's framed in terms of, I guess, just instantaneously what maneuver would be best, whether one is instantly preferring exploration or exploitation rather than through deep time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5622.816,
    "end": 5627.199,
    "text": "Usually the interaction with reviewers during that paper is what motivated this paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5629.327,
    "end": 5640.234,
    "text": " So that's like, OK, I really need something to just explain, unpack some of the similarities and differences between Active Inference and everything else around.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5640.254,
    "end": 5643.176,
    "text": "TINA WISDOMLENKO- Nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5644.497,
    "end": 5651.141,
    "text": "Well, if there's any other sort of closing thoughts, this has been an awesome set of discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5651.201,
    "end": 5656.044,
    "text": "I think we'll have a lot to think about, and hopefully people will work through these notebooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5657.335,
    "end": 5661.399,
    "text": " keep an eye out for when the final paper is published.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5662.22,
    "end": 5670.769,
    "text": "So you got this one fully published while the multi-armed bandit is still not ready.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.79,
    "end": 5674.373,
    "text": "ROMAIN PIQUOTIERI- It's still under review, so we are finished.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5675.054,
    "end": 5677.036,
    "text": "Yeah, hopefully soon.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5677.196,
    "end": 5679.179,
    "text": "It's the first revision around, currently.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5680.902,
    "end": 5685.424,
    "text": " Well, to anyone who's on here, any other thoughts or questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5685.524,
    "end": 5688.084,
    "text": "Or what do we take moving forward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.545,
    "end": 5696.907,
    "text": "I'm just thinking about different tabs I could be having a regime of attention on as the multi-armed bandit, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5697.368,
    "end": 5700.609,
    "text": "Do I check something I haven't checked in a while because I'm uncertain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.209,
    "end": 5703.79,
    "text": "Or should I pull back to my higher level and be like, you know what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5703.85,
    "end": 5706.971,
    "text": "It doesn't even matter if I'm uncertain about that tab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.711,
    "end": 5710.212,
    "text": "I should just stick on this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5715.56,
    "end": 5716.541,
    "text": " I'm sure there'll be some fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5716.561,
    "end": 5718.943,
    "text": "Yeah, Dimitri?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5720.064,
    "end": 5722.366,
    "text": "Well, I mean, it's a very general problem, as I said.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5722.426,
    "end": 5725.709,
    "text": "So most of the problems are multi-armed bandits.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5726.81,
    "end": 5727.911,
    "text": "It's not surprising, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5729.493,
    "end": 5729.733,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5731.078,
    "end": 5733.0,
    "text": " Sarah and Dimitri, thanks so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5733.02,
    "end": 5737.384,
    "text": "It was great to have your engagement from the dot zero on through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.404,
    "end": 5739.466,
    "text": "It really made it awesome for the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5740.087,
    "end": 5744.131,
    "text": "So thanks everyone for watching and until next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5744.151,
    "end": 5745.212,
    "text": "Thank you for having us here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5745.593,
    "end": 5745.993,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5746.774,
    "end": 5746.914,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5747.114,
    "end": 5747.995,
    "text": "Yeah, thanks very much.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5748.115,
    "end": 5748.696,
    "text": "Until next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5748.736,
    "end": 5748.936,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5749.737,
    "end": 5750.177,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5750.477,
    "end": 5750.678,
    "text": "Bye.",
    "speaker": "SPEAKER_06"
  }
]