[
  {
    "start": 8.575,
    "end": 27.954,
    "text": " hello everyone welcome to actin flab live stream number 24.0 today is June 16th 2021 and we're going to be talking about this paper in empirical evaluation of active inference in multi-armed bandits I'm Daniel and I'm here with blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.58,
    "end": 30.88,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.641,
    "end": 33.641,
    "text": "Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.382,
    "end": 40.725,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.245,
    "end": 43.706,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.546,
    "end": 50.529,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.49,
    "end": 56.412,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.935,
    "end": 66.36,
    "text": " Here at the short link, you'll find all of the live streams and different series that we do in the communications unit of ACT-INFLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.061,
    "end": 79.649,
    "text": "And today we're going to be contextualizing in the dot zero video for two upcoming discussions in the second half of June, 2021 on the 22nd and the 29th, when we have discussion 24.1 and 24.2 on this paper, and hopefully with the authors joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.466,
    "end": 104.367,
    "text": " Today in Act-Inf Livestream number 24.0, we're going to be trying to set some context and give an introduction to the following paper, An Empirical Evaluation of Active Inference in Multi-armed Bandits, by the authors listed here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.268,
    "end": 108.189,
    "text": " And the video is just an introduction to some of the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.949,
    "end": 111.09,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.31,
    "end": 113.991,
    "text": "It's kind of like a three-way intersection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.071,
    "end": 121.954,
    "text": "We have people who are maybe within the active inference community and looking to be exposed to some different areas like Bayesian statistics or machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.714,
    "end": 129.416,
    "text": " The second road is those who are coming from Bayesian statistics or machine learning approaches and curious about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.916,
    "end": 136.018,
    "text": "And then, of course, we hope that this will be exciting and interesting, even if you're unfamiliar with active inference or machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.458,
    "end": 142.36,
    "text": "We'll hopefully try to connect it to some broader questions in behavior and decision making more broadly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.121,
    "end": 147.302,
    "text": "We're going to walk through the aims and claims of the paper, the abstract and the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.274,
    "end": 161.36,
    "text": " covering a few big questions, and then we're going to go through all the figures and some of the key formalisms of the paper so that whether you read the paper or not, you'll hopefully be in a good spot to ask questions and learn more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.981,
    "end": 166.823,
    "text": "And of course, in the dot one and dot two, in the coming weeks, we'll be discussing this same paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.383,
    "end": 172.806,
    "text": "So save and submit your questions and let us know if you'd like to participate or contribute in any way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.299,
    "end": 182.104,
    "text": " Here we are on the paper itself, which has a screenshot of the cover on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.384,
    "end": 191.35,
    "text": "And I'll read the aims and claims, and then Blue, you can give a first thought on what you thought were kind of cool pieces about what they aimed for or claimed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.93,
    "end": 212.908,
    "text": " In this paper, we provided an empirical comparison between active inference, a Bayesian information theoretic framework, and two state-of-the-art machine learning algorithms, Bayesian Upper Confidence Bound, UCB, and optimistic Thompson sampling in stationary and non-stationary stochastic multi-armed bandits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.849,
    "end": 223.717,
    "text": " We introduced an approximate active inference algorithm for which our checks on the stationary bandit problem showed that its performance closely follows that of the exact version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.098,
    "end": 232.143,
    "text": "And hence, we derived an active inference algorithm that is efficient and easily scalable to high dimensional problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.623,
    "end": 236.446,
    "text": "So what was cool about that or what made you excited to make this .0?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.945,
    "end": 240.186,
    "text": " This paper was really awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 240.426,
    "end": 250.335,
    "text": "It shows how active inference can be used to solve problems that are sometimes computationally intractable and really pretty difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.816,
    "end": 257.702,
    "text": "So I think that the authors did a great job of deriving this active inference algorithm and proving that it's useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 259.123,
    "end": 259.504,
    "text": "Agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.844,
    "end": 264.848,
    "text": "And they did an awesome job bringing it analytically, like with equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.081,
    "end": 287.843,
    "text": " in line or at least being juxtaposed to other approaches in machine learning rather than appealing to a qualitative body of theory which is also great this is definitely one where the claims are specific and exact and that's what we'll be following up on so the abstract i'll read the first half and then you can go for the second half",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.164,
    "end": 303.095,
    "text": " A key feature of sequential decision-making under uncertainty is a need to balance between exploiting, choosing the best action according to the current knowledge, and exploring, obtaining information about values of other actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.895,
    "end": 315.945,
    "text": "The multi-armed bandit problem, a classical task that captures this trade-off, served as a vehicle in machine learning for developing bandit algorithms that proved to be useful in numerous industrial applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.128,
    "end": 331.776,
    "text": " The Active Inference Framework, an approach to sequential decision-making, recently developed in neuroscience for understanding human and animal behavior, is distinguished by its sophisticated strategy for resolving the exploration-exploitation trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.636,
    "end": 337.799,
    "text": "This makes Active Inference an exciting alternative to already established bandit algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.991,
    "end": 339.812,
    "text": " So it's kind of awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.092,
    "end": 340.933,
    "text": "First few words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.253,
    "end": 347.939,
    "text": "It's about sequential decision-making under uncertainty and the bandit task was made to explore that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.679,
    "end": 355.585,
    "text": "Machine learning has already gotten so much value out of pursuing algorithms for approaching this multi-armed bandit problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.266,
    "end": 363.715,
    "text": " And then enter active inference, which was developed to initially cover human and animal cases of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.735,
    "end": 366.458,
    "text": "But as we're seeing, it also goes beyond that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.139,
    "end": 372.566,
    "text": "And so that motivates studying active inference in the context of multi-armed bandit problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.766,
    "end": 374.128,
    "text": "So go for the second part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.879,
    "end": 387.232,
    "text": " Here we derive an efficient and scalable approximate active inference algorithm and compare it to two state-of-the-art bandit algorithms, Bayesian upper confidence bound and optimistic Thompson sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.852,
    "end": 393.298,
    "text": "This comparison is done on two types of bandit problems, a stationary and a dynamic switching bandit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 394.139,
    "end": 400.962,
    "text": " Our empirical evaluation shows that the active inference algorithm does not produce efficient long-term behavior in stationary bandits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 401.543,
    "end": 410.227,
    "text": "However, in the more challenging, switching bandit active inference performs substantially better than the two state-of-the-art bandit algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.067,
    "end": 422.781,
    "text": " The results open exciting venues for further research in theoretical and applied machine learning, as well as lend additional credibility to active inference as a general framework for studying human and animal behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 423.402,
    "end": 426.385,
    "text": "So this is really nice because it takes, like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 427.006,
    "end": 437.534,
    "text": " Active inference as an approximate way that humans deduce reason, balance this exploration, exploitation paradigm, and it programs that into the framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 437.974,
    "end": 444.879,
    "text": "So it just shows that, you know, it's getting closer, approximating human thinking in a machine more and more, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 446.038,
    "end": 451.281,
    "text": " Yes, and there's sort of a pair of pairs that we're going to return to a bunch of times in this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.721,
    "end": 458.945,
    "text": "The first is the two types of problems, the stationary and the dynamic bandit, which one of them is static, one of them is changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.065,
    "end": 460.266,
    "text": "We're going to talk more about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.766,
    "end": 467.17,
    "text": "And the other pair that comes up often is the Bayesian upper confidence bound and optimistic Thompson sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.87,
    "end": 469.091,
    "text": " We're also going to come back to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.431,
    "end": 471.972,
    "text": "So they're kind of doing a pair of pairs approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.733,
    "end": 475.354,
    "text": "And then the results are just really fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.394,
    "end": 482.759,
    "text": "And we're going to unpack that, that actually in the simpler case, we see that the active inference algorithm doesn't do perfectly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.379,
    "end": 487.341,
    "text": "But in this more challenging dynamic case, it does better than state of the art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.562,
    "end": 489.803,
    "text": "So what do you call something that goes beyond state of the art?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.715,
    "end": 493.936,
    "text": " Here's the roadmap for the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.537,
    "end": 507.824,
    "text": "And of course, as with these .Zero videos, if you're curious about how it was specifically stated in the paper, or you wanna dive in for more and you wanna see how they cited or how they built up a claim, you should go to the paper itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.064,
    "end": 509.465,
    "text": "This is just the roadmap for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.365,
    "end": 522.247,
    "text": " They start with an introduction of the multi-armed bandit and cover the two kinds of bandits that they explore, which is the stationary and switching versions, and talk about how you evaluate performance in different versions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.428,
    "end": 535.79,
    "text": "They then introduce the algorithms that they're going to utilize and talk about this variational smile approach, which we'll cover just a little bit of, but look forward to hearing from the authors about what it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.352,
    "end": 547.456,
    "text": " Then there's results for the pair of problems that they explore, stationary and switching bandits, and then have five figures, which will go through showing some results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.976,
    "end": 563.742,
    "text": "And hopefully even if the algorithms or the formalisms were a little bit hard to follow, the figures are really clear and they show how the algorithms perform through time and close with a discussion that hits on some awesome general points for the active inference and machine learning communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.52,
    "end": 567.643,
    "text": " Here are the keywords that were provided with the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.023,
    "end": 581.72,
    "text": "So as usual, we're going to use these keywords as jumping off, but also jumping in points for those who might be familiar with sequential decision-making, AKA life, but not be familiar with Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.401,
    "end": 589.925,
    "text": " And we're going to start from sequential decision-making and then go on to talk more broadly about Bayesian inference, multi-armed bandits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.265,
    "end": 593.187,
    "text": "So it's totally fine if you've never even heard of the bandit problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.907,
    "end": 608.375,
    "text": "Then we're going to talk about those two different algorithms that they're going to be exploring, upper confidence bound and Thompson sampling, and then see how they talked about active inference, which is going to be a really distinct way relative than a lot of approaches we've seen previously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.305,
    "end": 612.773,
    "text": " So let's go to sequential decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.415,
    "end": 614.779,
    "text": "Blue, what would you say about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.377,
    "end": 619.839,
    "text": " So sequential decision making is dependent on time, T, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 619.899,
    "end": 626.502,
    "text": "So at one time step, you have a state of the system, you perform an action, and that alters the system, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.542,
    "end": 633.245,
    "text": "So that at the second time step, the system is now in a new state, and then you have another decision to make about what you're going to do with the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.285,
    "end": 640.128,
    "text": "So this is like driving a vehicle, managing a stock portfolio, playing a game of chess, sequential policy decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.688,
    "end": 641.229,
    "text": "And so like, to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 641.869,
    "end": 644.791,
    "text": " kind of juxtapose what is a not sequential problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 645.191,
    "end": 647.912,
    "text": "So that'd be something like image classification is not sequential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 648.052,
    "end": 650.874,
    "text": "Like you can just classify all of the images parallel or at once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 651.394,
    "end": 655.236,
    "text": "The state of the system doesn't depend on how you classified the previous image.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 656.517,
    "end": 656.817,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.157,
    "end": 662.159,
    "text": "So definitely all kinds of organismal behavior in decision-making that happens in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.56,
    "end": 666.182,
    "text": "So think decisions, you're thinking usually sequential decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.239,
    "end": 669.802,
    "text": " especially when the decision influences the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.182,
    "end": 674.067,
    "text": "Those are all the kinds of problems that we're going to be talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.507,
    "end": 680.234,
    "text": "But also to even make it broader than that, some non-sequential problems can be framed sequentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.254,
    "end": 687.642,
    "text": "So let's just say that we had that classification problem where it's one blob, one big data set, and so there's no temporal sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.263,
    "end": 696.468,
    "text": " We might want an algorithm that treats it as if it were sequential so that we could just start reading in examples and then after 10, okay, got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.028,
    "end": 709.335,
    "text": "So then by looking at it as if it were a sequential problem and we were solving things through time, sometimes we can approach non-sequential problems that way because in the computer, it is gonna be sequential on the processor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.835,
    "end": 716.219,
    "text": "So it's for things that actually are sequential in the world or they're for things that we wanna act as if they're sequential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.822,
    "end": 725.626,
    "text": " One big tension that comes up with all kinds of modeling is the explore-exploit dilemma slash trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.446,
    "end": 729.808,
    "text": "And this is an awesome 2015 paper of Hills et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.508,
    "end": 734.891,
    "text": "Exploration versus Exploitation in Space, Mind, and Society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.093,
    "end": 757.659,
    "text": " it's pretty cool because it talks about multiple different domains here in the table one there's animal foraging visual search information search memory search searching and problem solving and social and group learning those are like all of our favorite topics blue and it gives just a little bit of a visual example how in different domains what does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.639,
    "end": 784.576,
    "text": " the archetype of exploration look like and what does the archetype of exploitation look like so some of these are very uh related to kind of a physical movement like patch foraging exploration moving to a different tree exploitation staying on the same tree but also visual focus exploration scanning around exploring exploitation having a fixed gaze and staring at something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.612,
    "end": 799.48,
    "text": " And then also we can think about even in word association, like memory, exploration is doing big jumps from different semantic neighborhoods, whereas exploitation might be like all the livestock animals or animals with the same letter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.62,
    "end": 805.304,
    "text": "There's different ways that you might exploit because there's different dimensions to the semantic landscape, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.024,
    "end": 810.987,
    "text": " there's still this trade-off between jumping far or staying relatively close in the neighborhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.487,
    "end": 813.088,
    "text": "So it's a big trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.188,
    "end": 815.069,
    "text": "It's studied in animal behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 815.489,
    "end": 817.95,
    "text": "It's studied in all kinds of decision-making tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.311,
    "end": 820.431,
    "text": "Anything to add on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.592,
    "end": 827.455,
    "text": "Only that I got to interact a lot with Peter Todd last summer, who's the second author on this paper, and it was so fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 828.683,
    "end": 833.286,
    "text": " Cool, and also Ian Cousine has done awesome collective behavior work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.827,
    "end": 846.196,
    "text": "So it's exciting to think about how these algorithms are able to apply to individual agents, but also maybe groups, and that's hinted at multiple times here, like role assignment and social connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.775,
    "end": 859.649,
    "text": " as we heard about in the abstract of the paper that we're discussing today they went right from sequential decision making under uncertainty to multi-armed bandit is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.948,
    "end": 887.92,
    "text": " way that we can study that and from the paper this is where we're introducing that that uh double problem the two problems are solving we consider two types of bandit problems in our empirical evaluation a stationary bandit as a classical machine learning problem and a switching bandit commonly used in neuroscience so we're going to go into more detail about how those are technically defined but let's just start with what are people getting at with multi-armed bandit why",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.781,
    "end": 890.709,
    "text": " Is it something that so many people have addressed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.991,
    "end": 906.382,
    "text": " This will make the presented results that they're doing here directly relevant, not only for the machine learning community, but also for learning and decision-making studies in neuroscience, which are often utilizing the active inference framework for a wide range of research questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.923,
    "end": 908.544,
    "text": "So there's all these different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.804,
    "end": 911.346,
    "text": "Here's a multi-armed bandit deciding which area to study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.806,
    "end": 916.13,
    "text": "Computer science, machine learning, economics, neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.69,
    "end": 921.214,
    "text": "These are all areas that the multi-armed bandit is like a bridge amongst.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.934,
    "end": 925.555,
    "text": " So now we're sitting active inference right at that nexus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.475,
    "end": 932.277,
    "text": "We've talked a lot about connecting computer science to behavior or connecting neuroscience to economics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.777,
    "end": 935.398,
    "text": "What if we could all meet at a common nexus?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.018,
    "end": 937.418,
    "text": "What if that were active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.018,
    "end": 939.859,
    "text": "These are the kind of fun things to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.087,
    "end": 946.909,
    "text": " But it's not just a nexus of conceptual connection, the multi-armed bandit and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.489,
    "end": 958.173,
    "text": "There's a lot of really specific use cases and a lot of the algorithms that power our experience online are actually trained and fit with multi-armed bandit problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.133,
    "end": 963.115,
    "text": "So here's a few fun examples that we came across while researching here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.386,
    "end": 972.152,
    "text": " On the top left is showing how you have a multi-armed bandit playing a role in music recommendations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.912,
    "end": 977.416,
    "text": "So it's like the arm, which arm is being chosen, that's the song.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.636,
    "end": 980.858,
    "text": "So it's thinking about it from the point of view of the music platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.379,
    "end": 982.54,
    "text": "It's sending a song.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.36,
    "end": 1006.935,
    "text": " then the target user which is the bandit machine here gives a payoff back to the algorithm thumbs up or thumbs down and then the algorithm sends you another song and then a payoff is given so it's sequential decision making and it's that same relationship that's shown graphically the goal is to maximize the sum of the ratings versus maximizing the sum of the payoffs in an abstract problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.856,
    "end": 1011.958,
    "text": " Here's an example of website A-B testing, testing versions of a website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.759,
    "end": 1024.885,
    "text": "So in the top, there's four versions of the website, and then they're each being allocated to a quarter of the users, and then each of the users are staying on the site for a certain amount of time or staying for different amount of times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.885,
    "end": 1032.53,
    "text": " In the standard A-B testing for the whole duration of your test, you keep that 1 fourth for each site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.271,
    "end": 1035.993,
    "text": "But in the multi-armed bandit, you start with a quarter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.533,
    "end": 1040.075,
    "text": "But then very rapidly, we see that this blue one starts performing better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.876,
    "end": 1067.132,
    "text": " and then we keep exploring and having some time allocated to these other colors but we see that the blue pretty steadily dominates and then that black line ends up staying higher so overall a higher number at the end of the epoch so you're sort of earning while learning because you're able to be making exploration while you're also exploiting and there's papers specifically on that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.032,
    "end": 1090.434,
    "text": " like Bayesian bandits in the context of online personalized recommendations any thoughts on that blue cool so these are yeah these are algorithms that are in use every single day and they power a lot of our experience and a lot of decision making support here's where we bring in some of the Bayesian algorithms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.647,
    "end": 1095.588,
    "text": " They're going to be using these two types of bandit problems, stationary and switching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.988,
    "end": 1098.148,
    "text": "And here's the second pair of terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.089,
    "end": 1105.81,
    "text": "They're going to be empirically comparing active inference to two other state of the art bandit algorithms from machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.25,
    "end": 1110.771,
    "text": "So those who are familiar with machine learning will have seen these two algorithms a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.471,
    "end": 1115.032,
    "text": "The first is an upper confidence bound algorithm, UCB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.152,
    "end": 1121.175,
    "text": " And the second is a variant of Thompson sampling called optimistic Thompson sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.075,
    "end": 1130.62,
    "text": "And then they note here, the two algorithms, the UCB and Thompson sampling, reach state-of-the-art performance on various stationary bandit problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.539,
    "end": 1139.241,
    "text": " Achieving regret, which is the difference between actual and optimal performance, we'll return to it soon, that's close to the best possible logarithmic regret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.262,
    "end": 1147.364,
    "text": "In Switching Bandits, learning is more complex, but once this is accounted for, both of the algorithms exhibit state-of-the-art performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.904,
    "end": 1153.786,
    "text": "You can never play perfectly, but you're approximating about as good as you can play with these algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.846,
    "end": 1159.748,
    "text": "What does that look like before we go into the technical details of what these algorithms are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1161.092,
    "end": 1171.778,
    "text": " So on the top left, we're gonna be thinking about, again, whether it's deciding which version of a website we wanna be presenting or which songs we wanna be presenting, or just keeping it kind of abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.599,
    "end": 1175.56,
    "text": "On the top left, we start with zero trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.72,
    "end": 1178.262,
    "text": "So this is before we have any information at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.122,
    "end": 1183.265,
    "text": "And then as trials occur and payoffs are observed,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.085,
    "end": 1192.03,
    "text": " and the trials count, count, count, count, count, after 28 trials, we've reached a very markedly different set of distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.991,
    "end": 1199.755,
    "text": "And so what this overall looks like is you show up at the casino and you don't know the payoff of any of the slot machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.375,
    "end": 1209.121,
    "text": "And then you're going to be choosing some policy, some way of approaching those slot machines and switching between them as needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.245,
    "end": 1238.165,
    "text": " some approach that's going to hopefully result with you getting the most money and so in this case it's sort of like as you get more and more information you're fine-tuning your estimate of what the distributions look like like we can see how the red distribution gets tuned as it gets tried more and more and similarly for the other distributions so that's kind of what this algorithm does is it starts with no specific bias towards a given slot machine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.985,
    "end": 1250.129,
    "text": " And then it tries to develop a strategy for staying with slot machines that are known about versus trying new ones or ones you haven't tried in a while in order to get the best possible outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.489,
    "end": 1254.691,
    "text": "And as you can imagine, if there's a static one, then it's an easier problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1255.231,
    "end": 1258.532,
    "text": "If it's dynamic, you have to keep the rate of change in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.893,
    "end": 1261.493,
    "text": "Any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.066,
    "end": 1264.067,
    "text": " Good, good explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.087,
    "end": 1272.551,
    "text": "Okay, so Bernoulli bandits are the class of bandits that they're going to constrain themselves to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.571,
    "end": 1279.195,
    "text": "So they say, we're constraining ourselves to a well-studied version of bandits, the so-called Bernoulli bandits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.114,
    "end": 1285.641,
    "text": " For Bernoulli bandits, choice outcomes are drawn from an arm-specific Bernoulli distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.441,
    "end": 1297.254,
    "text": "Bernoulli bandits together with Gaussian bandits are the most commonly studied variant of multi-armed bandit, both in theoretical and applied machine learning and experimental cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.089,
    "end": 1305.431,
    "text": " So you can fit any kind of distribution for the rewards underlying each of these slot machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.132,
    "end": 1313.774,
    "text": "But it turns out that if you use the Bernoulli distribution, the math works out nicely, which makes it easy to study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.974,
    "end": 1317.375,
    "text": "That's why there's been a lot of study in the Bernoulli and the Gaussian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.856,
    "end": 1324.658,
    "text": "So a Gaussian distribution reward would be like, okay, you get five with a certain bell curve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.603,
    "end": 1326.504,
    "text": " of how much you might win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.884,
    "end": 1336.829,
    "text": "Bernoulli is going to be a different shaped distribution, but just the idea is that you're going to be learning the parameters that describe the reward returned by that arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.65,
    "end": 1345.133,
    "text": "So it's just the subcategory or the function that underlies the reward payoff on these machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.773,
    "end": 1359.416,
    "text": " Let's talk about the two algorithms that they're gonna be discussing a lot, and then also where these algorithms come into play in terms of strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.696,
    "end": 1369.439,
    "text": "So again, you're sitting there at the slot machine at the casino, and how are you going to decide how to stay or leave a given machine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.92,
    "end": 1372.06,
    "text": "Stay in the casino though, that's where you wanna be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.381,
    "end": 1375.682,
    "text": "This is from a nice blog post from 2019.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.421,
    "end": 1380.522,
    "text": " Data scientists have developed several solutions to tackle this problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.082,
    "end": 1386.503,
    "text": "And the three most common algorithms are Epsilon Greedy, then Upper Confidence Bound and Thompson Sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.943,
    "end": 1396.206,
    "text": "So Epsilon Greedy is not given in this paper because it's not the best performing algorithm, but it's really a nice sort of starter algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.066,
    "end": 1400.787,
    "text": "It's the simplest algorithm to address the exploration exploitation trade-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.766,
    "end": 1407.748,
    "text": " Basically, during exploitation, the lever with the highest known payout is always pulled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.068,
    "end": 1413.95,
    "text": "So whatever the running best estimate of the top performing slot machine is, defaults there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.671,
    "end": 1426.835,
    "text": "However, from time to time, some random fraction epsilon with some fraction 5% of the time or 1% of the time, select another random arm to explore the other arms with an unknown payoff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.699,
    "end": 1435.227,
    "text": " So you're sticking with the one that has the highest point estimate, and then just some fraction of the time, you flip to a different one just to check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.128,
    "end": 1438.811,
    "text": "And then you update your estimate of how each of them are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.251,
    "end": 1440.532,
    "text": "So that's one strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.113,
    "end": 1443.395,
    "text": "Now here's two strategies that do better than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.916,
    "end": 1446.799,
    "text": "Those are the ones that we're going to be contrasting with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.191,
    "end": 1453.958,
    "text": " One of them is the upper confidence bound, which is sometimes referred to as optimism in the face of uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.358,
    "end": 1455.5,
    "text": "That sounds like active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.32,
    "end": 1462.968,
    "text": "It assumes that the unknown mean payoffs of each arm will be as high as possible based upon historical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.829,
    "end": 1480.489,
    "text": " so we don't know the payoff of each arm but we want to assume given what we've already gotten from the data which is as far as we can speculate we want to assume that it's as good as it could have been which is why we see the upper confidence bound on the top of this distribution and then thompson sampling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.704,
    "end": 1492.331,
    "text": " is fundamentally a Bayesian optimization technique with a core principle known as probability matching that can be summed up as play an arm according to its probability of being the best arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.191,
    "end": 1500.076,
    "text": "So in contrast with epsilon, which says just go with the one that you think is best, and then 10% of the time do something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.736,
    "end": 1510.442,
    "text": "Thompson sampling is like you kind of have a pie chart with a relative performance of different arms, and then you pick them based upon how big of a pie it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.443,
    "end": 1516.287,
    "text": " So you do rarely choose ones that don't have high payoffs just to sort of check in on them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.647,
    "end": 1521.11,
    "text": "But then if you check back on one and it does really well, then that slice of the pie starts growing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.811,
    "end": 1528.296,
    "text": "And then the whole point of training these algorithms is how fast should you be reweighting in the dynamic case, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.756,
    "end": 1539.044,
    "text": "So just laying it out like that is not the solution, but this is getting at a few ways, whether optimism in the face of uncertainty or this sort of conservative probability matching",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.744,
    "end": 1544.826,
    "text": " These are two ways that, as we've seen, are state of the art because they basically perform as well as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.386,
    "end": 1549.788,
    "text": "And so we're locking it down with upper confidence and a lower confidence bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.468,
    "end": 1552.949,
    "text": "It's a pretty nice choice of algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.71,
    "end": 1558.571,
    "text": "They're brought up as an instructional pair all over the machine learning educational space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.212,
    "end": 1563.674,
    "text": "So nice choice by the authors to juxtapose it so clearly to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.814,
    "end": 1567.235,
    "text": "So is Thompson sampling then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.677,
    "end": 1569.639,
    "text": " pessimism in the face of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.46,
    "end": 1571.74,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.041,
    "end": 1574.643,
    "text": "Things couldn't be better than they have been in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.264,
    "end": 1583.27,
    "text": "Let's go a little bit more into detail into the two different algorithms and then talk about regret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.571,
    "end": 1591.116,
    "text": "So here's from another blog post, Lillian Wang's blog, talking about bandit strategies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.253,
    "end": 1616.976,
    "text": " so again it's about explore and exploit even though active inference is going to help us reconceptualize of explore exploit which we can maybe get to at the end but we don't want to be exploring inefficiently because we're kind of spending our time playing on losing machines while we know that there's a better way to play so to avoid such inefficient exploration one approach is to do epsilon sampling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.737,
    "end": 1623.381,
    "text": " And then in the case of a static set of payoffs, you decrease that parameter epsilon in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.002,
    "end": 1625.643,
    "text": "So again, how fast should you decrease it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.423,
    "end": 1629.105,
    "text": "Still have to fit parameters, but that's just one approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.097,
    "end": 1649.298,
    "text": " The other approach to sort of prevent this inefficient exploration, so avoid pain, is to be optimistic about values that are optimistic about options with high uncertainty and thus prefer actions implicitly for which we haven't yet had a confidence value estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1649.458,
    "end": 1651.6,
    "text": "That's why this is optimism in the face of uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.521,
    "end": 1679.617,
    "text": " in other words we favor exploration of actions with a strong potential to have optimal value so that's exactly what the ucb upper confidence bound algorithm does is it measures it with an upper confidence bound so that the true value is always below that bound and then we are trying to push up the upper bound knowing that somewhere below it hopefully not too far is the true value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.05,
    "end": 1694.932,
    "text": " then the ucb algorithm does optimization with this arg max selecting the greediest action to maximize that upper confidence bound so as it's laid out in the blog basically you can do no exploration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.26,
    "end": 1699.565,
    "text": " That's just sort of pick the first one you sit down at, stay there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.306,
    "end": 1707.215,
    "text": "You can explore at random, that's epsilon greedy, or you can explore smartly with a preference for uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.896,
    "end": 1712.723,
    "text": "So we're just kind of building on that epsilon idea of sticking with the one that usually we like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.65,
    "end": 1729.191,
    "text": " then spending sometimes elsewhere how much time spending elsewhere and which ones should we choose well don't just go to any old machine if you're going to select somewhere elsewhere let's choose ones that still have a good probability of having a high expected payoff so that's ucb any comments on that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.455,
    "end": 1730.615,
    "text": " No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.276,
    "end": 1739.343,
    "text": "So in contrast, we have Thompson sampling from a nice slide deck from Agrawal at Columbia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.343,
    "end": 1742.085,
    "text": "And Thompson sampling goes back to 1933.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.186,
    "end": 1749.651,
    "text": "So like many other algorithms, the classical variants are pre-computational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.052,
    "end": 1751.833,
    "text": "Sometimes they're even just thought experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.894,
    "end": 1763.122,
    "text": " And in the slides, it's talked about how Thomson sampling, it's a natural and efficient heuristic that maintains belief about the effectiveness, which is the main reward of each arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.962,
    "end": 1767.765,
    "text": "We're going to be kind of tracking how well we think each arm is doing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.606,
    "end": 1771.308,
    "text": "And basically, the way it works is we're going to observe feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.108,
    "end": 1779.853,
    "text": " then update our beliefs about different arms in a Bayesian manner, and then pull arms with a posterior probability of being the best arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.573,
    "end": 1783.875,
    "text": "So not the same as choosing the arm that's most likely to be best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.555,
    "end": 1791.7,
    "text": "This is like, again, a pie chart that is the proportions of how well they're performing, and then we choose based upon that proportion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.72,
    "end": 1795.402,
    "text": "And the pseudocode looks like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.567,
    "end": 1807.596,
    "text": " We start, we initialize the model with a prior, as well as the family of distributions that our rewards are expected to be drawn from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.156,
    "end": 1812.46,
    "text": "So this is a Gaussian case, but this is where you could see a Bernoulli bandit come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1813.1,
    "end": 1816.022,
    "text": "And then the algorithm is as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.883,
    "end": 1840.024,
    "text": " first there's a sampling um of a mean with a estimate from the posterior for a given arm i then the arms are played according to the probability of them being the best arm the reward is observed and then everything is updated so it's like sample",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.997,
    "end": 1866.779,
    "text": " your posterior from your prediction then act then observe and update it's sort of like that closing time song you know every every every beginning comes from some other beginnings end and it's called a posterior in bayesian statistics you know prior gets updated the posterior but then that posterior is the prior for the next round so it's not like it's just a one round learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1867.62,
    "end": 1872.282,
    "text": " the posterior feeds back into the model, which is why we just talk about continual Bayesian updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.762,
    "end": 1877.484,
    "text": "So it's kind of like OODA, like observe, orient, decide, act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.785,
    "end": 1887.309,
    "text": "These kinds of action loops, which of course include active inference, is what makes these models really similar, or at least in the same neighborhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.889,
    "end": 1896.193,
    "text": "And then this paper that we're discussing brings them into alignment analytically with the equations and through simulation and juxtaposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.694,
    "end": 1899.275,
    "text": " That's what Thompson sampling is though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.555,
    "end": 1900.795,
    "text": "Any comments on Thompson?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.396,
    "end": 1907.637,
    "text": "Just how well it plays into this sequential decision-making process that we were talking about earlier, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1907.677,
    "end": 1910.798,
    "text": "So it's, you have a next time step and you update and you update and you update.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1911.218,
    "end": 1911.398,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.839,
    "end": 1919.061,
    "text": "So again, like even for those non-sequential tasks, like the image classification you brought up, you could sample from your big database",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.821,
    "end": 1945.94,
    "text": " then update your model and then once you're sampling and you're like i'm not really updating my model that much you might not need to look through the entire data set and so by framing that non-sequential problem sequentially you get big computational speed up and then of course for sequential decision making then you need an approach like this how about regret learning regrets i've had a few",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.52,
    "end": 1948.342,
    "text": " Haven't we all, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.665,
    "end": 1955.697,
    "text": "So I think you put this in here, the introduction to regret and reinforcement learning, which is a medium post, correct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1957.433,
    "end": 1959.775,
    "text": " So if you wanted to learn more about regret, you can check it out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1960.035,
    "end": 1967.742,
    "text": "But regret is just the difference between the optimal performance, how good you could do, and the actual performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1967.822,
    "end": 1975.569,
    "text": "And so you see in this little image here, you can see that the best policy is the red dotted line and then the choices that the agent makes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.789,
    "end": 1977.47,
    "text": "This is like the logarithmic equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1978.451,
    "end": 1979.852,
    "text": " performance, logarithmic regret.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1979.952,
    "end": 1982.394,
    "text": "And so they're converging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.454,
    "end": 1987.517,
    "text": "The idea is to converge with the best possible policy based on your previous decisions, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1987.737,
    "end": 1988.877,
    "text": "Exploring, exploiting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1988.897,
    "end": 1994.621,
    "text": "And then the authors here use regret when they're looking at the stationary bandits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.081,
    "end": 1996.882,
    "text": "They use regret as a measure of performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1997.343,
    "end": 2001.225,
    "text": "But then they use regret rate when they're looking at the switching bandits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2001.365,
    "end": 2002.666,
    "text": "And so regret rate is just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2003.246,
    "end": 2012.429,
    "text": " the regret over time and they used the rate they said it was had been illustrated to be a better estimator of this logarithmic regret in the dynamic case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2013.45,
    "end": 2013.75,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.59,
    "end": 2019.912,
    "text": "And the big idea of regret is looking back over your history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.612,
    "end": 2030.316,
    "text": "So either for all of history, that's cumulative regret, which applies really well to the stationary problem or recent history, which applies well to the dynamical case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.896,
    "end": 2038.44,
    "text": " Because if things are always changing, you're kind of more interested in how well you're doing recently rather than over all time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.48,
    "end": 2049.586,
    "text": "You don't want some fluctuations early on to be playing a role in your cumulative value because you don't want to fit your strategy now to reducing regret from a different epoch, which can happen if you don't do it this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.106,
    "end": 2057.69,
    "text": "So looking back over history again, whether all of history, cumulative regret for the fixed case or recent history for the dynamic case,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.79,
    "end": 2073.877,
    "text": " Update your strategy so that you would have minimized regret to zero by playing that strategy all along So, you know looking back at the Bitcoin price What strategy would have been hashtag no regrets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.678,
    "end": 2086.043,
    "text": "Those are the big questions or just in the last little window of time Given what I recently have found out How could I make my rate of regret gain as low as possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.024,
    "end": 2087.144,
    "text": "so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.211,
    "end": 2096.814,
    "text": " It's a way to look back and then optimistically think about how you could have performed by reducing regret to zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.154,
    "end": 2102.536,
    "text": "And we see this all the time in computer science, like maximizing something, you do it by minimizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.836,
    "end": 2111.72,
    "text": "Whether there's a negative thrown in there or whether there's a natural log thrown in there or whether it's one over something or it's just framed in an opposite way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.38,
    "end": 2116.842,
    "text": "A lot of times, if you know that you're bounded at zero, something can't go below zero, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.682,
    "end": 2118.943,
    "text": " you want to go as low as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.564,
    "end": 2129.873,
    "text": "Or if you want to maximize something, it's sometimes easier to do a one over the maximum and then try to get that number to zero rather than this unbounded maximization, like, okay, I'm at 5 million.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.893,
    "end": 2130.414,
    "text": "Should I stop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.114,
    "end": 2131.475,
    "text": "You don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.575,
    "end": 2134.277,
    "text": "Maybe that's nowhere even close because there's no highest number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.799,
    "end": 2139.622,
    "text": "So that's regret learning, and that's how they're going to be calculating their performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.304,
    "end": 2143.206,
    "text": "Let's get to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.212,
    "end": 2150.275,
    "text": " So one thing that you'll see on this slide right away is we're not seeing a sensory motor loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.936,
    "end": 2155.198,
    "text": "We're not seeing an agent in an environment with arrows and nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.338,
    "end": 2161.301,
    "text": "We're coming at active inference from this point of view of sequential decision-making under uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.54,
    "end": 2168.123,
    "text": " And so in this section, which has a great title, three, two, one, active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.844,
    "end": 2176.528,
    "text": "They write that the exploration exploitation trade-off can be formulated as an uncertainty reduction problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.605,
    "end": 2183.329,
    "text": " where choices aim to resolve expected and unexpected uncertainty about hidden properties of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.93,
    "end": 2186.451,
    "text": "So already we're seeing that active inference formalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.852,
    "end": 2193.216,
    "text": "There's hidden states in the environment which we don't directly have access to, but we get admitted outcomes from decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.497,
    "end": 2203.644,
    "text": "This leads to casting choice behavior and planning, aka planning as inference, as a probabilistic inference problem, as expressed by active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.591,
    "end": 2205.971,
    "text": " So action and inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.652,
    "end": 2213.394,
    "text": "Our inference is about what actions we're planning and about the hidden states of the world given the outcomes that we're receiving, sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.454,
    "end": 2221.516,
    "text": "Using this approach, different types of exploitative and exploratory behavior naturally emerge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.768,
    "end": 2230.174,
    "text": " In active inference, decision strategies, behavioral policies, are chosen based on a single optimization principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.794,
    "end": 2233.036,
    "text": "Or yesterday, I think it was a, what was it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.416,
    "end": 2236.398,
    "text": "A functional, a common functional footing or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.159,
    "end": 2243.144,
    "text": "The single optimization principle is minimizing expected surprisal about observed and future outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.804,
    "end": 2245.906,
    "text": "That is the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.466,
    "end": 2248.267,
    "text": "So it's kind of cool, like the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.048,
    "end": 2271.094,
    "text": " backwards looking approach is to minimize regret like how would i have performed best in given what i know about the past how does that change the way i act now and then free energy minimization expected free energy in the current and the future moments is like given the state of my model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.216,
    "end": 2276.279,
    "text": " for now and moving forward, how can I minimize expected free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.859,
    "end": 2279.22,
    "text": "Because regret is not anticipatory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.501,
    "end": 2283.763,
    "text": "Regret is only looking back at it, which is why it's really easy for training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.444,
    "end": 2286.365,
    "text": "And then here's something that's looking forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.705,
    "end": 2296.932,
    "text": "So it's kind of cool how like the current moment is this handoff between the retrospective regret learning and then the prospective free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.496,
    "end": 2300.323,
    "text": " That's how they frame active inference here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.664,
    "end": 2303.615,
    "text": "Any general comments or what do you think was kind of cool about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.921,
    "end": 2309.283,
    "text": " So I just am thinking back to Alex Shantz's paper that we did way back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.323,
    "end": 2310.343,
    "text": "I think that was number eight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.443,
    "end": 2328.772,
    "text": "But I still always go back to that when I'm looking at these computational frameworks, because he broke it up very nicely into the reward, the pragmatic value, which could be, in this case, the minimization of regret can be seen as the pragmatic value or the reward, and then the epistemic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2328.852,
    "end": 2330.772,
    "text": "So you have both of these things that play into",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2332.273,
    "end": 2336.414,
    "text": " giving the system, helping the agent update relevant to the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.574,
    "end": 2337.854,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.254,
    "end": 2340.635,
    "text": "And I'll look forward to hearing from the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.335,
    "end": 2347.157,
    "text": "Were they studying active inference and then approached Bayesian decision-making algorithms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.777,
    "end": 2354.438,
    "text": "Were they coming from a non-active inference computer science background and then found active inference as something that was exciting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.098,
    "end": 2357.479,
    "text": "How did they converge upon this approach?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.6,
    "end": 2365.621,
    "text": " Shortly after introducing active inference, they turned to an approximate active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.582,
    "end": 2377.405,
    "text": "And they described that as saying, active inference in its initial form was developed for small state spaces and toy problems without consideration for applications to typical machine learning problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.125,
    "end": 2384.447,
    "text": "So that's like when there's two decisions and sort of a two by two matrix and two outcomes in the world and two decisions you can make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.762,
    "end": 2389.784,
    "text": " This has recently changed and various scalable solutions have been proposed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.984,
    "end": 2392.565,
    "text": "I think one of these citations would be that Chance et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.406,
    "end": 2395.106,
    "text": "Scaling Active Inference, Actim Stream 8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.247,
    "end": 2402.23,
    "text": "In addition to complex sequential policy optimization that involves sophisticated deep tree searches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.97,
    "end": 2408.753,
    "text": "So that's sophisticated active inference with these tree rollouts followed by tree pruning approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.302,
    "end": 2420.87,
    "text": " Therefore, to make the active inference approach practical and scalable to the high dimensional bandit problems typically used in machine learning, we introduce here an approximate active inference algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.071,
    "end": 2427.415,
    "text": "Definitely will be cool to hear from the authors like, what exactly are we approximating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.276,
    "end": 2434.661,
    "text": "What else could be approximated and still have an active inference or what can't be approximated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.221,
    "end": 2438.864,
    "text": "But let's look at how and why they approximated active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.953,
    "end": 2441.693,
    "text": " So this is good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.713,
    "end": 2442.514,
    "text": "Yeah, yeah, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.054,
    "end": 2449.457,
    "text": "So to kind of speak to the why, you and I have both done tree construction in terms of phylogenetics, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2449.497,
    "end": 2451.258,
    "text": "And the tree switching and the switching of nodes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2451.618,
    "end": 2456.501,
    "text": "And that can get really computationally overwhelming, like can run for days and days and days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2456.741,
    "end": 2462.644,
    "text": "So it's really nice to see such a sweet, clean implementation of approximation here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2463.284,
    "end": 2463.504,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.185,
    "end": 2466.626,
    "text": "Here we're...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.702,
    "end": 2480.313,
    "text": " not going to go into depth into formalism 16 and 17 but we'll look forward to the authors describing it but here is the key piece the exact marginal posterior beliefs over reward probabilities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.977,
    "end": 2484.159,
    "text": " theta can be expressed this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.439,
    "end": 2487.623,
    "text": "Okay, just looking at that, you go, okay, it's gnarly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.204,
    "end": 2493.129,
    "text": "How are we going to win if that's what we have to solve?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.69,
    "end": 2499.797,
    "text": "So the exact correct beliefs over reward would look this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.865,
    "end": 2509.574,
    "text": " And then they write the exact marginal posterior in equation 17 will not belong to the beta distribution, making the exact inference analytically intractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.374,
    "end": 2516.26,
    "text": "So there might be a way to numerically approach it and simulate it or calculate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.38,
    "end": 2523.147,
    "text": "But if we want to be looking through big data sets and doing it fast without massive amounts of computational effort, we need a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.148,
    "end": 2534.911,
    "text": " However, if we constrain the joint posterior to this approximate fully factorized form, and we've seen factorization of variables before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.091,
    "end": 2543.513,
    "text": "Factorization of variables is kind of a big topic, so we're not going to totally go into detail here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.613,
    "end": 2548.274,
    "text": "Again, it'd be awesome to hear from the authors how did they derive and factorize, but if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.477,
    "end": 2559.224,
    "text": " One way to think about it is that constraining a big open-ended long equation into a factorizable form reduces the solution space a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.985,
    "end": 2563.888,
    "text": "And that enables certain kinds of optimization to become tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.528,
    "end": 2579.782,
    "text": " So for example, for linear regression, we have least squares, which is a way where if you constrain the problem to saying, I'm trying to solve the sum of squares, not the sum of cubes or the sum of some other function, but I'm just trying to solve this one, then there's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.704,
    "end": 2583.425,
    "text": " computations that scale really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.106,
    "end": 2586.367,
    "text": "And so that is what is happening, a factorization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.388,
    "end": 2595.974,
    "text": "And another way to think about factorization is if you have a Bayesian graph where the nodes are the variables and then the edges are like the relationships between the variables,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.15,
    "end": 2602.533,
    "text": " you could just dump it all into a parameter fitting framework with all the edges possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.953,
    "end": 2604.814,
    "text": "That would be like an unfactorized model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.174,
    "end": 2615.199,
    "text": "So the number of edges that you have to figure out the exact values for is going to be a lot, and it's going to increase exponentially with the amount of parameters you want to fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.84,
    "end": 2623.284,
    "text": "But if you factorize things, you go, okay, variable A only is associated with B, and B is only associated with C and A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.224,
    "end": 2651.903,
    "text": " all of a sudden you're reducing the amount of edges that you have to fit which helps you get to hopefully a solution that is attractively reached but also approximatingly accurate so that's like probably approximately correct and approximate bayesian computation but we've seen that factorization a few times won't go into too much more detail here but what they do is they take this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.154,
    "end": 2681.477,
    "text": " factorized form and they use variational calculus to recover the following variational smile rule which we'll go to in a second and so they get to a different set of formalisms we'll hear from the authors about what's different about those formalisms and then um what's kind of cool is that for the stationary bandit where you can change the parameters to like zero for the rate of change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.768,
    "end": 2687.114,
    "text": " it corresponds to the exact Bayesian inference over stationary Bernoulli-Bandit problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.915,
    "end": 2699.609,
    "text": "So that was just kind of interesting how the exact form of an algorithm solution might, how active inference might be doing something exact in the asymptote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.24,
    "end": 2702.001,
    "text": " What is SMILE?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.642,
    "end": 2703.843,
    "text": "Here's the SMILE paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.743,
    "end": 2708.026,
    "text": "Variational methods as a prize to surprise minimization learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.827,
    "end": 2714.651,
    "text": "So that sounds like a lot of things that we do with variational methods, variational Bayes, and surprise minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.572,
    "end": 2719.015,
    "text": "And the pseudo code is presented here for the exponential family.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.498,
    "end": 2722.639,
    "text": " This is just a question for the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.72,
    "end": 2724.561,
    "text": "What is the smile doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.341,
    "end": 2727.763,
    "text": "How does it help us approximate active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.643,
    "end": 2731.185,
    "text": "What else can we use the smile for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.186,
    "end": 2734.928,
    "text": "So that's this approximating active inference interlude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.588,
    "end": 2747.256,
    "text": "They take a big messy form and then by constraining how variables can be related to each other and using variational methods on that factorized representation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.789,
    "end": 2753.831,
    "text": " it's possible to get an approximation that is going to be effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.632,
    "end": 2767.936,
    "text": "So it's interesting that, you know, there's this direct correspondence for the stationary bandit case, because in the stationary case, like we didn't see improvement, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2768.296,
    "end": 2771.177,
    "text": "Using the active inference algorithm, that totally explains why, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2773.038,
    "end": 2776.699,
    "text": "Yep, and they have a few more pieces on that, I think in a bigger...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.943,
    "end": 2780.905,
    "text": " Figure four or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.425,
    "end": 2788.31,
    "text": "Let's go to the two problems that they tackle and then the results for those two sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.35,
    "end": 2793.073,
    "text": "We'll cover first the stationary bandit and then the dynamic bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.113,
    "end": 2798.857,
    "text": "Here's the definition and where they work through the stationary bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.877,
    "end": 2801.599,
    "text": "A stationary bandit has a finite number of arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.68,
    "end": 2805.762,
    "text": "It has K arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.031,
    "end": 2811.076,
    "text": " And then it's going to be playing through T time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.017,
    "end": 2814.18,
    "text": "And then it's big K, big K arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.061,
    "end": 2819.787,
    "text": "And then each little, little K, K is the set of little arms, little K. Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.867,
    "end": 2820.648,
    "text": "K is the action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2820.668,
    "end": 2820.748,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2823.703,
    "end": 2825.584,
    "text": " So here's how they define the stationary bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.445,
    "end": 2831.469,
    "text": "And again, you can think about T in time, actions, and arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.349,
    "end": 2838.574,
    "text": "And then in stationary bandits, the reward probabilities theta sub K are fixed for all trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.614,
    "end": 2843.558,
    "text": "So theta is just like, it's funny, it's like the parameter that means just like variable sometimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.978,
    "end": 2845.659,
    "text": "I guess a lot of them do, but theta especially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.8,
    "end": 2849.262,
    "text": "So just a fixed reward value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.942,
    "end": 2852.984,
    "text": " the fixed reward probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.345,
    "end": 2855.027,
    "text": "So that's why it's not stationary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.128,
    "end": 2862.395,
    "text": "In the casino, this would be like one of them pays out on average one to one, one of them pays out 50%, one pays out 200%, but they never change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.434,
    "end": 2879.301,
    "text": " So here's a sort of visual representation of that with here's the multi-armed and then the mouse is getting the cheese and each arm has a different fixed probability, but those don't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.521,
    "end": 2882.763,
    "text": "So the probability of cheese does not move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2886.645,
    "end": 2887.626,
    "text": "Here's figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.746,
    "end": 2893.229,
    "text": "So in figure one, we're going to see regret rate analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.508,
    "end": 2902.651,
    "text": " So the regret rate you can imagine is, we'll get to that in a second, but the regret rate analysis for the stationary bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.612,
    "end": 2910.854,
    "text": "And then we're going to be comparing approximate active inference in red to the exact active inference in blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.875,
    "end": 2918.537,
    "text": "So that will be cool to talk to the authors about what was the relative change in how much time it took to compute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.278,
    "end": 2921.859,
    "text": "We'll find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.85,
    "end": 2930.936,
    "text": " And what they do is they are showing that the blue and the red are always kind of tracking together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.796,
    "end": 2940.543,
    "text": "So that suggests that the approximate form does a really good job because it follows the behavior of the exact form pretty well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.723,
    "end": 2945.646,
    "text": "And then just to sort of how to read this graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.006,
    "end": 2947.487,
    "text": "So there's four columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2948.427,
    "end": 2951.69,
    "text": " corresponding to k equals 10, 20, 40, and 80 arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.491,
    "end": 2954.432,
    "text": "So that's changing just the number of arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.613,
    "end": 2965.442,
    "text": "Then there's the rows, which are for epsilon being the, so this is like the differential between the arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.283,
    "end": 2971.027,
    "text": "So kind of how easy the task is, I believe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.028,
    "end": 2972.909,
    "text": "And then that's 0.1, 0.25, and 0.4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.575,
    "end": 2986.279,
    "text": " And then within each cell, there's lambda, which is a function of precision over prior preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.44,
    "end": 2993.722,
    "text": "And then R sub T, which is the regret as a function of trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.943,
    "end": 3000.785,
    "text": "And the dash black line denotes the upper bound on the regret rate corresponding to the random agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.685,
    "end": 3002.786,
    "text": "So this is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.02,
    "end": 3030.08,
    "text": " i guess as bad as you could get and then we see that active inference is performing better like there's it converges upon a lower rate of regret than 0.1 or around 0.1 which is the amount of regret that's accumulating for the randomly behaving agent so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.052,
    "end": 3038.513,
    "text": " So just to footnote that, which I thought was interesting and made this more meaningful for me, that lambda parameter, the precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.034,
    "end": 3053.496,
    "text": "So it says when the active inference agent has very imprecise preferences, so lambda closer to zero, it engages in exploration for longer and reduces the uncertainty that way at the expense of accumulating reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.736,
    "end": 3056.297,
    "text": "So just to kind of footnote that in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3058.368,
    "end": 3076.449,
    "text": " interesting and that's definitely going to come back when we talk about active inference and how we rethink explore exploit so what is this showing it's showing that as you uh though they're that as a function of precision you're getting different behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.561,
    "end": 3095.008,
    "text": " the active inference agents but the approximation is basically always working pretty well and then also the dotted lines are fewer trials and the solid lines are more trials so we can see like in all these cases the dotted line and then the dash and then the solid you're always doing better with more trials",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.97,
    "end": 3097.11,
    "text": " That's what we kind of see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.651,
    "end": 3104.713,
    "text": "Like, if you only have 100 trials, so just a few trials on 80 arms, your regret is almost as if you were playing randomly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.913,
    "end": 3109.274,
    "text": "Because you've barely tried every arm once, so you're kind of not able to do so well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.175,
    "end": 3110.355,
    "text": "But...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.155,
    "end": 3123.764,
    "text": " If you're in the right area of precision, not too much precision, but still in this area down here, and you have 10,000 trials, even with 80 arms, the regret rate can drop to very, very low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.225,
    "end": 3133.532,
    "text": "So playing almost optimally, even on 80 arms, given the trials, and given a significant enough difference between the outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.633,
    "end": 3154.472,
    "text": " So that's what figure one shows, which is that active inference can learn to reduce its regret, given the right parameters, the things that we'd expect to make the situation harder, like more arms or less differentiability amongst the arms or super high or low precision rates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.014,
    "end": 3158.216,
    "text": "Those are the things that influence active inference algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.803,
    "end": 3166.609,
    "text": " And also they said that they found the minimal regret rate at around Lambda is 0.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3167.81,
    "end": 3173.055,
    "text": "So that's why they fixed the regret rate for the upcoming trials or for the upcoming tests.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3173.575,
    "end": 3176.898,
    "text": "Because there's a bunch of knobs to tweak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.479,
    "end": 3182.643,
    "text": "And so they do their best to do a parameter sweeps and show like here's for...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.524,
    "end": 3203.051,
    "text": " know the whole distribution of lambda for three different sampling regimes for four different arm styles for three different difficulties like already the combinatorics get really high and if you were going to be using this in an industrial situation you would optimize it with all these parameters in play and then um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.724,
    "end": 3213.848,
    "text": " they write that they're only going to consider this approximate active inference variant for the between agent comparison because it was doing pretty well in figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.208,
    "end": 3222.831,
    "text": "So they're just going to follow up with the approximate, but it's something we can ask them like, what is the difference in computation time for the general or exact?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.851,
    "end": 3224.272,
    "text": "All right, figure two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.612,
    "end": 3227.953,
    "text": "So we're still thinking about the stationary Bernoulli bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.254,
    "end": 3231.495,
    "text": "Here is going to be a slightly different plot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.197,
    "end": 3245.982,
    "text": " It's a comparison of the cumulative regret trajectories for the approximate active inference, that's AAI, optimistic tops in sampling, that's OTS, purple, and Bayesian upper confidence bound in the teal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.662,
    "end": 3249.743,
    "text": "So those are the three lines, and that's the legend on the top left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.411,
    "end": 3271.749,
    "text": " and as blue just said the prior precision is fixed to 0.1 which is what they found from figure one like this sort of dip that they all have at near 0.1 that seems to be a good precision variable setting so they're just going to roll with that instead of also sweeping across precisions and here we see a similar",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.95,
    "end": 3293.392,
    "text": " columns and rows where k different number of arms in the columns and then different problem difficulties in the rows and then the cumulative regret so you want lower regret that makes sense that's the whole thing that we're training on um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.266,
    "end": 3321.349,
    "text": " what do we see there's a lot that can be seen because there's so many combinatorics of viewing at it but what do we see right off the bat well as the number of samples increases beyond say a hundred in almost all cases the red line approximate active inference is below the other ones so you're getting less regret with active inference on the stationary bandit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.441,
    "end": 3325.202,
    "text": " for many parameter combinations, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.982,
    "end": 3328.123,
    "text": "But there's a few interesting pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.944,
    "end": 3334.066,
    "text": "So one of them is that sometimes active inference early on has a higher regret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.526,
    "end": 3337.887,
    "text": "So maybe it's like a little bit more exploratory in the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.327,
    "end": 3340.428,
    "text": "That's one thing to see in that bottom left corner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.748,
    "end": 3344.27,
    "text": "There's a few other ones where it's sort of like this elbow early on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.93,
    "end": 3349.992,
    "text": "But then there's this very interesting behavior that actually shows a lot on the very top left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.092,
    "end": 3359.578,
    "text": " So it's not always the case that you can just set your model to some parameter combination and draw a really generalized conclusion, but this is an awesome point by the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.739,
    "end": 3366.203,
    "text": "So they're looking at an ensemble of agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3366.623,
    "end": 3375.35,
    "text": "So here it's a thousand agents, like they're sort of running a thousand of each of these and then taking the average, which is why the lines are smooth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3376.251,
    "end": 3378.932,
    "text": "And so what we see in the very top left is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3379.872,
    "end": 3385.536,
    "text": " The active inference agent is doing as well as the other algorithms, then it's doing better, lower regret under those lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.137,
    "end": 3392.341,
    "text": "But then the error bound increases, that red shading, and it starts to head really far up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.262,
    "end": 3395.424,
    "text": "So that's pretty fascinating what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.544,
    "end": 3407.153,
    "text": "And they write, this divergence is driven by a small percentage of the agents in the ensemble that did not find the accurate solution and were overconfident in their estimate of the arm with the highest reward probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.893,
    "end": 3432.563,
    "text": " so that sort of pie chart of which arm you should choose it got off to a bad start and then their precision was such that they just sort of rolled with that and they kept on seeing the information they were getting within that way of setting up the problem and so they ended up for a small fraction of the agents kind of getting derailed with continuing to regret the decisions they were making because they were locked in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.7,
    "end": 3447.029,
    "text": " The divergence is not visible in the earlier settings, easier settings with larger, I'm not sure what variables you see there, as one requires larger ensembles and bigger number of trials to observe suboptimal instances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.444,
    "end": 3455.129,
    "text": " it may appear surprising that the divergence is evident only for the smallest number of arms considered, because that's supposed to be like the easier problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3455.769,
    "end": 3463.995,
    "text": "However, the reason for this is the smaller the number of arms is, the more chance an agent has to explore each individual arm for a limited trial number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.735,
    "end": 3474.602,
    "text": "So it's almost like it's easier to lock in your beliefs and maybe even false beliefs for a small social group rather than a party with K equals 80 people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.368,
    "end": 3480.089,
    "text": " It's like, there's so much to learn that you're less likely to get locked in early.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.829,
    "end": 3490.311,
    "text": "But then at the smaller party, some of these active inference agents are getting locked in really early to what they think the most rewarding arms are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.331,
    "end": 3494.212,
    "text": "And then they end up not sampling efficaciously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.652,
    "end": 3498.413,
    "text": "So they end up implementing regrettable policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.533,
    "end": 3501.554,
    "text": "So pretty fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.372,
    "end": 3503.913,
    "text": " So I just want to footnote here also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3503.933,
    "end": 3510.258,
    "text": "So you're looking at this top left where K equals 10 and then this epsilon is 0.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3510.719,
    "end": 3513.0,
    "text": "The top left is the most easy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3513.621,
    "end": 3517.884,
    "text": "And then the bottom right is the most difficult where K is the number of arms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3518.405,
    "end": 3522.348,
    "text": "And then this epsilon factor is the difference between the arms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3523.048,
    "end": 3527.612,
    "text": "So it's the outcome difference if I go to an arm that has a reward versus an arm that doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3528.757,
    "end": 3552.78,
    "text": " yeah i think well point one is harder because there's less of a distinction between a better and a worse um so it's the smaller number of arms is easier but then point four is a bigger contrast so point one is harder than than point four okay so then it's the bottom left that's the the that would be the easiest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.574,
    "end": 3556.456,
    "text": " Well, it depends on what you mean, easiest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3556.576,
    "end": 3559.639,
    "text": "I mean, all things being equal, fewer arms is easier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.26,
    "end": 3565.706,
    "text": "And then all things being equal, the more contrast between good and bad arms, the easier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.693,
    "end": 3567.133,
    "text": " Got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.173,
    "end": 3570.697,
    "text": "So then the bottom left would be the easier... Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3571.157,
    "end": 3573.099,
    "text": "The fewest arms and the biggest contrast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3573.179,
    "end": 3580.405,
    "text": "And interestingly, that's where we see the biggest elbow of active inference, like the biggest initial regret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3580.745,
    "end": 3590.934,
    "text": "So it's like when the game is easy and there's few arms, active inference stays exploring a little bit longer, but then it ends up locking in on what's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.097,
    "end": 3610.138,
    "text": " then especially when there's not that big of a difference between arms all of them have this slight uptick and then the variance increasing with this shading that's showing us that it's not like all of the ensemble is behaving differently but perhaps again that a subset are getting deranged",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.533,
    "end": 3615.899,
    "text": " Yeah, see, that's why I think the bigger epsilon would be the more difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.979,
    "end": 3618.142,
    "text": "But we'll just have to save that one for the authors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3618.222,
    "end": 3620.245,
    "text": "I would think that the less contrast would be easier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3620.385,
    "end": 3623.329,
    "text": "So I guess it's like not super clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3623.389,
    "end": 3624.291,
    "text": "So we'll just have to ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3626.604,
    "end": 3641.156,
    "text": " This is a cool outcome, and it's almost like it's a qualified critique that makes a bigger point about where Active Inference can really succeed and where it might still need challenges, which we're going to return to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.196,
    "end": 3642.537,
    "text": "That's Stationary Bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.158,
    "end": 3645.679,
    "text": "Let's go to the Switching Bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3646.76,
    "end": 3649.342,
    "text": "The key difference is that at each time step,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.399,
    "end": 3653.941,
    "text": " Any particular arm has a maximum expected reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.841,
    "end": 3659.884,
    "text": "And this reward probability is going to change with the probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.304,
    "end": 3666.327,
    "text": "So there's some probability row, which is, is it P or is it row?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.748,
    "end": 3668.909,
    "text": " Yeah, with row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.769,
    "end": 3673.551,
    "text": "That is the probability of the reward changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.252,
    "end": 3678.574,
    "text": "So now you can't just learn it in any old order because things are changing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.694,
    "end": 3680.715,
    "text": "The probability of the cheese is time dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.436,
    "end": 3682.696,
    "text": "Section 2.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.796,
    "end": 3683.937,
    "text": "Oh yeah, go ahead, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.952,
    "end": 3685.733,
    "text": " Oh, I don't have anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3685.793,
    "end": 3686.313,
    "text": "No, that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3686.473,
    "end": 3687.114,
    "text": "So you did it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.394,
    "end": 3688.115,
    "text": "It's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.135,
    "end": 3691.818,
    "text": "So 2.2 is where they give the formalism for the switching bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.659,
    "end": 3700.126,
    "text": "And so in contrast to the stationary bandit problem, outcomes are drawn from a time dependent Bernoulli probability distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.766,
    "end": 3702.167,
    "text": "So that is provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3703.048,
    "end": 3705.47,
    "text": "And those who want to look into the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.411,
    "end": 3707.714,
    "text": " details can do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.235,
    "end": 3713.907,
    "text": "But the key difference is that there's some probability that things change as you're playing the game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.649,
    "end": 3714.769,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.785,
    "end": 3720.487,
    "text": " So I did have a question here for the authors and looking forward to getting to ask them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3720.527,
    "end": 3724.868,
    "text": "So it's the probability is the same and then it just suddenly changes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3724.948,
    "end": 3730.15,
    "text": "So like after 20 time steps or 50 time steps, like it's the same, the same, the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3730.33,
    "end": 3734.371,
    "text": "And then it suddenly changes or it's the it's changing at each time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3734.631,
    "end": 3739.213,
    "text": "I feel like it's because it says it changes with some probability, but it's otherwise constant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3739.733,
    "end": 3745.581,
    "text": " So I'm curious as a constant, like across all of the arms, is that the probability that's constant or is it always changing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3745.761,
    "end": 3746.062,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3746.382,
    "end": 3746.803,
    "text": "Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.526,
    "end": 3758.532,
    "text": " Here we get to the between agent comparisons of different algorithms in the switching Bernoulli bandit with a fixed mean outcome difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.672,
    "end": 3759.713,
    "text": "So epsilon equals 25.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.934,
    "end": 3763.276,
    "text": "So they're setting epsilon fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.436,
    "end": 3767.619,
    "text": "So now it's gonna be a different row and column situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.38,
    "end": 3769.141,
    "text": "So in this figure,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.287,
    "end": 3774.249,
    "text": " the three columns are row equals 0.01, 0.02 and 0.04.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.209,
    "end": 3776.67,
    "text": "So that's the probability of changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3776.77,
    "end": 3781.912,
    "text": "So here on the left column, it's a dynamic environment with 1% of time steps, there's a change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.493,
    "end": 3785.434,
    "text": "Here it's on the right side, it's up to 4% changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.814,
    "end": 3792.997,
    "text": "So all things being equal, the more change, the harder it's gonna be because it's gonna be like changing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.218,
    "end": 3808.437,
    "text": " faster and then the less change it's more like the static case and then the rows now are the arms so k 10 20 and 40. so all things being equal it's easier when there's fewer arms because there's fewer decisions to make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.302,
    "end": 3826.986,
    "text": " And then we're gonna be looking within each cell as the regret rate, this R sub T with a tilde, regret rate through time, where again, you want to have less regret, so lower is better, as a function of the samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.446,
    "end": 3832.347,
    "text": "So up to several thousand samples, and then here are the algorithms that are being compared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.867,
    "end": 3836.208,
    "text": "Active inference in red, Bayesian upper confidence in blue,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.395,
    "end": 3842.118,
    "text": " Optimistic Thompson in purple, and then Random Control in the black dashed line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.658,
    "end": 3852.544,
    "text": "So the random play is a good... It's not the adversarial play, so it's not like you're choosing to lose, but this is the random play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.384,
    "end": 3858.347,
    "text": "And what we're seeing is that it accumulates a static amount of regret rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.148,
    "end": 3860.849,
    "text": "It starts at the same value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.929,
    "end": 3864.031,
    "text": "The purple and the teal algorithms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.287,
    "end": 3870.171,
    "text": " they also converge upon a regret rate that's lower than the random play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.571,
    "end": 3872.153,
    "text": "So they're playing better than random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.133,
    "end": 3875.695,
    "text": "But we see in essentially all cases,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.584,
    "end": 3880.046,
    "text": " the active inference is lower than these other algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.686,
    "end": 3889.771,
    "text": "So when we say like, oh, active inference has better performance on this task than some other algorithm, this is kind of what it looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.432,
    "end": 3898.176,
    "text": "This is saying that as time goes on, active inference is acquiring regret at a lower rate than the other algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.336,
    "end": 3899.637,
    "text": "It's just performing better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.757,
    "end": 3901.318,
    "text": "It's implementing better policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.571,
    "end": 3924.922,
    "text": " then we can see that for the less less changing and fewer arms on the top left so that's like easier we see that the the difference between random play and the algorithm is significant and active inference does like super well whereas when you have a very dynamic environment and more arms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.778,
    "end": 3929.039,
    "text": " you don't get that much of a regret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3929.059,
    "end": 3933.082,
    "text": "You're still doing relatively better and still active inference outperforms the other algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.722,
    "end": 3944.109,
    "text": "But it's like, imagine if it was changing every few time steps and there's a hundred arms, you would just, you would never be able to sample enough to make a meaningful update to your model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.769,
    "end": 3954.075,
    "text": "So that's why the faster things change and the more arms there are, the more the overall performance of any machine learning algorithm is gonna converge to random play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.997,
    "end": 3965.89,
    "text": " Whereas the more static the problem is and then the fewer options there are, then better and better strategies are going to perform better and better relative to random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.671,
    "end": 3970.495,
    "text": "So this is just pretty cool that they do simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.515,
    "end": 3973.679,
    "text": "They do, I guess, a thousand simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.676,
    "end": 3979.122,
    "text": " And then the switching schedule is generated randomly for each agent instance within the ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.742,
    "end": 3985.73,
    "text": "So they do a full simulation 1,000 times for each of these cases and then average it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.691,
    "end": 3989.114,
    "text": "And yeah, well done, Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3989.935,
    "end": 4006.626,
    "text": " Pretty cool to see that it is doing better on the switching Bernoulli Bandit for a wide range of situations, and it rapidly figures out a good way to work, and then it stays at that low rate of regret accumulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.867,
    "end": 4009.628,
    "text": "Any thoughts on three?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.629,
    "end": 4012.109,
    "text": "Super cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.349,
    "end": 4012.49,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.71,
    "end": 4018.634,
    "text": "Now, in four, we're going to fix the number of arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.747,
    "end": 4044.486,
    "text": " so now we're at k equals 20 arms in the switching bernoulli bandit and then we're going to be comparing these algorithms again so here the columns are just as they were before with less changing row equals 0.01 o2 and o4 on the right but now as we kind of saw on previous figures we have epsilon which is that differential between the rewarding and less rewarding arms as the rows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.615,
    "end": 4061.144,
    "text": " So we can think about the less changing and the most contrast between rows is where you see the most gain relative to random play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.124,
    "end": 4064.966,
    "text": "Whereas when you're in the more dynamic setting,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4065.785,
    "end": 4074.687,
    "text": " And when there's less differences between which choice you make in terms of the outcome, then there's less of a regret rate differential with the algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.987,
    "end": 4081.349,
    "text": "But again, broadly across the board, active inference is performing better than these other algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.049,
    "end": 4089.411,
    "text": "So as sampling increases, active inference locks into a pretty good spot by around 200 or 500 samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4092.401,
    "end": 4093.802,
    "text": " And this is for the 20 arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4094.482,
    "end": 4101.944,
    "text": "So it's kind of like it's visited each arm probably a few times, maybe some more than others, but again, they're always changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.665,
    "end": 4106.866,
    "text": "And so Active Inference is able to cope with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.386,
    "end": 4116.85,
    "text": "And also it's interesting that especially this teal one, it almost has a lower regret rate and then it actually creeps up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4118.393,
    "end": 4124.539,
    "text": " Whereas, at least just visually, we're seeing active inference kind of flatline, but not creep back up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.159,
    "end": 4130.904,
    "text": "And so that's something that can happen with all kinds of algorithms that they'll get locked into an aberrant precision regime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.466,
    "end": 4132.646,
    "text": "And...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4136.414,
    "end": 4137.735,
    "text": " So this is just another way to slice it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.975,
    "end": 4150.025,
    "text": "In Figure 3, they fixed the epsilon, the difference between the more and less rewarding arms, and then they explored how the number of arms was associated with how dynamic of a problem was being solved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.545,
    "end": 4163.455,
    "text": "In Figure 4, we fixed arms so that we could explore how rho, the dynamic, changing probability, and epsilon, the differential, how those change performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.956,
    "end": 4165.236,
    "text": "And then...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4168.553,
    "end": 4169.193,
    "text": " Okay, good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.295,
    "end": 4174.696,
    "text": "Now, okay, figure five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4176.337,
    "end": 4179.779,
    "text": "Here, it's yet another similar looking figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.899,
    "end": 4185.061,
    "text": "We're going to have similarly the row for the column.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.101,
    "end": 4188.183,
    "text": "So less changing on the left column, more changing on the right column.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.883,
    "end": 4193.145,
    "text": "And we're going to have the number of arms just like figure three with 10, 20, and 40.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4194.105,
    "end": 4196.787,
    "text": "But there's going to be a non-stationary difficulty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.591,
    "end": 4206.657,
    "text": " And the difficulty of the problem is non-stationary as the advantage of the best arm over the second best arm changes with time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.838,
    "end": 4209.699,
    "text": "Ah, so epsilon is varied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.26,
    "end": 4212.261,
    "text": "Yes, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.081,
    "end": 4214.943,
    "text": "So switching, changing epsilon through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4215.703,
    "end": 4220.026,
    "text": "And they fixed the precision over preferences to lambda equals 0.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.466,
    "end": 4223.368,
    "text": "So that's a different lambda than they used elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.469,
    "end": 4234.213,
    "text": " And this is just sort of showing, I mean, the variable values they choose clearly work because they're outperforming the state of the art, but here they chose a different variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.353,
    "end": 4234.834,
    "text": "Yeah, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.254,
    "end": 4239.536,
    "text": "The lambda of 0.5 they used in all of the switching graphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4239.696,
    "end": 4239.936,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.956,
    "end": 4241.557,
    "text": "Figure 3, figure 4, and figure 5.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4241.877,
    "end": 4247.939,
    "text": "And they changed it to 0.5 in the switching because they just optimized for that but didn't show that variable optimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.959,
    "end": 4248.98,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.231,
    "end": 4260.797,
    "text": " And so here we can see that, yep, active inference, the red line is on bottom, and it doesn't have this sort of secondary increase in regret rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.397,
    "end": 4270.142,
    "text": "So for even dynamic on the right and many arms on the bottom right, we're seeing active inference perform well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4270.862,
    "end": 4278.847,
    "text": "So figure 3, 4, and 5 really make a super compelling case for active inference outperforming state-of-the-art algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4280.276,
    "end": 4283.661,
    "text": " Nice work, and that's something that we're really excited about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.863,
    "end": 4293.295,
    "text": "Let's go to the discussion and just spend a couple minutes on the discussion and the closing notes, and then we'll look forward to the dot one and dot two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.841,
    "end": 4308.047,
    "text": " They opened the discussion by rehearsing what they have previously mentioned, that they're comparing active inference to two state-of-the-art machine learning algorithms, the Bayesian upper confidence bound and the optimistic Thompson sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4308.567,
    "end": 4315.23,
    "text": "That's the pair of algorithms in the pair of problems, the stationary and the non-stationary stochastic multi-armed bandits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4316.26,
    "end": 4321.485,
    "text": " Their contribution, among other things, was the introduction of the approximate active inference algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4322.346,
    "end": 4328.312,
    "text": "And then they perform some checks to show that it's performing again as well as you could do exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.173,
    "end": 4334.578,
    "text": "So they derived an active inference algorithm that's efficient and easily scalable to high dimensional problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.461,
    "end": 4342.107,
    "text": " leading us to ask, of course, where could it be cool or useful or important to apply active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.088,
    "end": 4351.455,
    "text": "And we know that there's many thoughts on this and hopefully will be many more, but we'll just note for those who are listening at the right time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.256,
    "end": 4371.267,
    "text": " that there's been recently announced a net hack challenge and we're going to be starting work on this in the end of july or the beginning of august 2021 so if you're interested in applying active inference to like a video game performance challenge we hope that having a collaborative team",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.441,
    "end": 4379.223,
    "text": " Make an entry for this challenge will be an awesome opportunity to really demonstrate to the world what active inference can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.783,
    "end": 4391.526,
    "text": "But we'll also look forward to the authors and all guests sharing what kinds of questions they think might be interesting to explore using approximate active inference type algorithms like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4396.36,
    "end": 4415.771,
    "text": " Here's a really nice point that speaks to that, again, in figure two, where we saw that sort of runaway regret on a small fraction of the agents that were just getting locked into extremely regrettable decisions in that K equals 10 case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4417.025,
    "end": 4419.807,
    "text": " So what do they say about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.748,
    "end": 4429.375,
    "text": "To our surprise, the empirical algorithm comparison in the stationary bandit problem, figure two, showed that the active inference algorithm is not asymptotically efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4430.116,
    "end": 4435.28,
    "text": "The cumulative regret increased faster than logarithmic in the limit of large trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.221,
    "end": 4444.949,
    "text": "So in other words, even though it's not all agents that get deranged, the ones that do are dragging down the group in a way that's damaging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.786,
    "end": 4455.75,
    "text": " This cause for the behavior seems to be the fixed prior precision over preferences lambda, which acts as a balancing parameter between exploration and exploitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.47,
    "end": 4458.711,
    "text": "So this is a pretty interesting piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.231,
    "end": 4465.954,
    "text": "Instead of like two modes, explore and exploit, and then we're going to have a parameter that flips us one way to the other, like a light switch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.574,
    "end": 4473.197,
    "text": "Or we have one extreme explore mode and one extreme exploit mode in the model, and then we're going to have a dimmer that goes between the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.917,
    "end": 4474.758,
    "text": "In active inference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.518,
    "end": 4492.704,
    "text": " the knob that kind of does that is actually the prior precision over preferences so if you have no if you have no preferences aka you have no precision over preferences you're going to act in the maximally exploratory way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.872,
    "end": 4521.662,
    "text": " you have an incredibly strong incredibly precise prior over your preferences then you're going to act in a very exploitative way like if there's two restaurants and one of them you like you know 60 the other one you like 40 if you have no preference you're going to go to them 50 50. that's like explore but then if you have a super high precision over your preferences you're always going to go to the one you that you prefer even if it's only slightly preferred",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.021,
    "end": 4536.906,
    "text": " An analysis of how performance of the algorithm depends on that parameter showed that parameter values that give the best performance decrease over time, suggesting that this parameter should be adaptive and decay over time as the need for exploration decreases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.687,
    "end": 4542.989,
    "text": "So start with low precision over your preferences, and then you learn",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.83,
    "end": 4548.271,
    "text": " and you update so that eventually you increase your precision later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.252,
    "end": 4553.454,
    "text": "Attempts to remedy this situation with a simple and widely used decay scheme were not successful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.954,
    "end": 4555.054,
    "text": "So the logarithm of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.394,
    "end": 4563.257,
    "text": "So you just make the precision directly a function of time, like, you know, one over the number of trials, just that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.297,
    "end": 4566.079,
    "text": "It's like, that's a function that scales with the number of trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.679,
    "end": 4569.14,
    "text": "So here you scale it with the logarithm of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.558,
    "end": 4576.767,
    "text": " This indicates that it's not a simple relationship and a proper theoretical analysis will be needed to identify whether a scheme exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.967,
    "end": 4579.408,
    "text": " So that's pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.468,
    "end": 4582.01,
    "text": "Like, how are we gonna pull back a level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.29,
    "end": 4595.878,
    "text": "Okay, we think that active inference architecture is gonna be a really productive way to model learning under uncertainty, but we're also just pushing the problem up a level, which is, okay, how uncertain should we be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4595.898,
    "end": 4601.342,
    "text": "And then how should we change that uncertainty over preferences moving through time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.603,
    "end": 4603.783,
    "text": "So nice point there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4603.803,
    "end": 4605.845,
    "text": "And then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.223,
    "end": 4630.123,
    "text": " one last thought is in the non-stationary so the dynamic switching bandit the active inference algorithm generally outperformed the bayesian upper confidence bound and the optimistic thompson sampling this provides evidence that the active inference framework may provide a good solution for optimization problems that require continuous adaptation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.235,
    "end": 4639.985,
    "text": " Active inference provides the most efficient way of gaining information, and this property of the algorithm pays off in the non-stationary setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.847,
    "end": 4645.351,
    "text": "Cool points that'll be awesome to hear the author's perspective on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.952,
    "end": 4651.478,
    "text": "So how do we compare active inference framework algorithms to machine learning more broadly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.717,
    "end": 4668.924,
    "text": " And then especially for problems where informed foraging is helpful, like not that epsilon greedy, just sometimes look away from the best and pick randomly and not even just the Thompson sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.504,
    "end": 4672.805,
    "text": "Remember pick each arm according to how likely it is to be the best arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.826,
    "end": 4678.668,
    "text": "We could have an even more informed or empirically better performing scheme",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4679.534,
    "end": 4682.817,
    "text": " for doing the trade-off for earning while learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.638,
    "end": 4691.004,
    "text": "Earning while learning doesn't mean that you're learning optimally or earning optimally, or how are we going to balance that out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4692.005,
    "end": 4694.947,
    "text": "And it seems like active inference is gonna be a strong contender",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.868,
    "end": 4724.206,
    "text": " in the coming years as more and more people in the machine learning community start to get keyed into these results tune the regime of attention to what these authors and others are doing and it starts to become more broadly understood that hey rather than just having more and more parameters and billions and billions of parameters in our model and training it on larger and larger networks of you know computers what if we just had a curious agent who learns how to learn and prefers to win",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.026,
    "end": 4729.231,
    "text": " It's sort of like a ground floor reinterpretation of these problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.992,
    "end": 4741.506,
    "text": "And I think hearing the author's views on where the active inference and machine learning communities and fields are heading will be for sure informative for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4742.427,
    "end": 4743.489,
    "text": "What do you think about that, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4745.359,
    "end": 4752.025,
    "text": " I just am thinking about problems like the mountain car problem, where actually learning is winning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4752.606,
    "end": 4760.733,
    "text": "If you have to explore, you want to go up the hill so that you can get back up to the other side of the hill and the flag.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4761.153,
    "end": 4766.538,
    "text": "So what other problems are out there like that that have a reward that's uncoupled from exploration?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4772.023,
    "end": 4775.024,
    "text": " So I'm thinking about that, and I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4775.044,
    "end": 4776.264,
    "text": "Just where is learning winning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4776.925,
    "end": 4778.305,
    "text": "Great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4778.345,
    "end": 4783.847,
    "text": "It's almost like in a mountain car, the altitude is, in some senses, a reward heuristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4783.867,
    "end": 4787.348,
    "text": "You want to get to the top of a hill, so it seems like altitude would be the way to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.888,
    "end": 4797.171,
    "text": "But then the way that the problem is set up, you could also optimize the bounds and say, I seek to be expanding my bounds laterally more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.191,
    "end": 4799.991,
    "text": "Oh, yeah, well, of course we're changing in height.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.252,
    "end": 4800.892,
    "text": "We're in the mountains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4801.412,
    "end": 4801.552,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.106,
    "end": 4812.63,
    "text": " especially for cases where we focus on exploration, like innovation or maybe other areas, it's cool to think about how active inference could perform well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4813.73,
    "end": 4817.211,
    "text": "So what are the next steps for the authors and for us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4819.594,
    "end": 4828.926,
    "text": " An important next step in examining active inference in the context of multi-armed bandits is establishing theoretical bounds on the cumulative regret for the stationary bandit problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.446,
    "end": 4837.416,
    "text": "Because as we saw, it kind of diverged in an unexpected way that made sense, but still wasn't quite the behavior that was initially expected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.377,
    "end": 4845.704,
    "text": " And a key part of these theoretical studies will be to investigate whether it's possible to devise a sound decay scheme for that lambda parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4846.204,
    "end": 4850.748,
    "text": "So how rapidly should we change our precision over preferences?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.629,
    "end": 4855.593,
    "text": "That provably works for all instances of the canonical stationary bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.837,
    "end": 4857.658,
    "text": " What would that enable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.998,
    "end": 4858.919,
    "text": "That's our favorite question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.48,
    "end": 4865.866,
    "text": "This would lead to the development of new active inference inspired algorithms, which can achieve asymptotic efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4866.867,
    "end": 4875.915,
    "text": "These theoretical bounds would also allow us to more rigorously compare active inference algorithms to the already established bandit algorithms for which regret bounds are known.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.997,
    "end": 4901.119,
    "text": " moreover we would potentially be able to generalize Beyond settings we have empirically tested here future work may also consider an information theoretic analysis of active inference which might be more appropriate than regret analysis also kind of a cool idea like regret analysis was performance oriented it's saying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4902.335,
    "end": 4910.06,
    "text": " You're calculating your regret based upon the difference in performance between optimal versus what you did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.94,
    "end": 4918.645,
    "text": "But another way to look at that is using information theory and looking as a function of information being gained perhaps through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4919.545,
    "end": 4944.456,
    "text": " which just like you brought up it really helps us focus on exploration because if the whole project is framed in terms of performance and reward and value it's almost like favoring exploitation off the bat because exploration is always going to have to get couched in terms of successful exploitation like this basic research is important because later on we'll be able to apply it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4945.316,
    "end": 4958.554,
    "text": " which is fair but when we have an information theoretic analysis not just a regret performance analysis there might be a way to have exploration for exploration's sake and what that might enable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.242,
    "end": 4968.489,
    "text": " Or even exploitation can be thrown in in terms of surprise minimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4968.97,
    "end": 4975.275,
    "text": "If we're going to frame active inference in terms of minimization of surprise, think about something like the stock market problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4975.455,
    "end": 4978.058,
    "text": "This is very much like a switching bandit problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4978.458,
    "end": 4979.919,
    "text": "Everything's changing all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4980.039,
    "end": 4981.401,
    "text": "It's the same for a little while.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4982.401,
    "end": 4984.123,
    "text": "You're stock that's going to win.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4985.644,
    "end": 4989.647,
    "text": " Like, you know, you're surprised when you deviate from, say, the S&P 500.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4989.967,
    "end": 4994.371,
    "text": "So you want to track with the S&P 500 and surprise happens when you deviate from that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4995.752,
    "end": 5001.956,
    "text": "One more thought there on the information theoretic analysis and how it might say something different than regret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5002.895,
    "end": 5004.536,
    "text": " Let's go back to picking a restaurant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.476,
    "end": 5007.998,
    "text": "So we often hear about like controlled novelty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.318,
    "end": 5010.759,
    "text": "You want surprise, but not too much surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.379,
    "end": 5015.782,
    "text": "So this gives an explanation for why people might like their favorite restaurant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.302,
    "end": 5020.704,
    "text": "It doesn't even need to be thought of in the context of maximizing reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.385,
    "end": 5024.707,
    "text": " the 60% likely to be the most rewarding restaurant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5025.127,
    "end": 5027.769,
    "text": "It could be like, I'm trying to reduce my uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.369,
    "end": 5037.194,
    "text": "So I'm likely to choose a place that I'm familiar with so that maybe I'll choose a different meal or maybe I'll choose the meal I always order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5037.735,
    "end": 5042.017,
    "text": "But it's like the choice was driven by reducing uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5043.058,
    "end": 5056.865,
    "text": " not even per se by maximizing reward, which is something that we come back all the time to, the difference between value-driven reinforcement learning, reward learning, and implicitly regret, which is regret about reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.007,
    "end": 5081.715,
    "text": " and reduction of uncertainty which puts us in a whole different space yes we're able to enter that whole physics of information flows area and where we get the pragmatic um straight component and then the solenoidal the flow the iso contour yes we access that whole area in the information theory reduction of uncertainty world but also we just get",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5082.335,
    "end": 5086.216,
    "text": " qualitatively a different story and a different explanation for behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5086.796,
    "end": 5108.139,
    "text": "Again, you don't need to grasp for why somebody is maximizing reward with why they went to that restaurant or why they ordered that one thing when a lot of times just it stands alone as an uncertainty reduction and prior preferences understanding rather than needing to make it about some sort of maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5108.559,
    "end": 5111.54,
    "text": "I'll flip to the last slide and then we have an awesome question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.512,
    "end": 5123.337,
    "text": " So Alex V wrote, is there connections between exploration on epistemic value and exploitation for pragmatic value?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.517,
    "end": 5129.98,
    "text": "I think that's related to what you were just speaking about, which is that we're putting it on a common,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5130.74,
    "end": 5152.152,
    "text": " footing with active inference in terms of the reduction of the expected free energy which has this epistemic or knowledge gain component and this pragmatic or functional component so the epistemic is like learning and the pragmatic is earning so we're we're learning while we're earning or the other way around we're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5153.502,
    "end": 5161.716,
    "text": " acquiring epistemically valuable information while we're also acquiring pragmatically valuable information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.714,
    "end": 5182.827,
    "text": " because the decision making of um expected free energy minimization conditioned on policy we're choosing policies based upon a function that looks at both of those jointly and so that is one of the ways that we're rethinking exploration and exploitation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.948,
    "end": 5193.734,
    "text": " by thinking, okay, that's not really the duality of policies that you want to talk about because explore exploit makes it sound like it's two behaviors that the bird can be doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5194.655,
    "end": 5203.501,
    "text": "And so here, what we're doing is we're kind of taking that idea of sometimes you want to be doing a more exploitative act, other times, a more exploratory act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5204.301,
    "end": 5223.086,
    "text": " then we're asking given the policy of which a whole spectrum might exist of different policies how is each policy contributing to epistemic and pragmatic gain and then which policy is going to have the best combination of the two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5223.866,
    "end": 5236.02,
    "text": " Maybe there's strategies where you're maximizing both and maybe there's strategies where you're maximizing neither, but if you're only looking at one or the other, then you might choose one that's like a poor combination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.162,
    "end": 5246.007,
    "text": " Well, so a perfect example is like, you know, so your policy is based on your previous chance of reward, of minimizing surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5246.347,
    "end": 5255.252,
    "text": "So I have a policy that I'm not going to eat a meal I've never had before in a restaurant I've never been to before because I like I don't know what I'm getting into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5255.292,
    "end": 5256.433,
    "text": "That's like way over there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5256.733,
    "end": 5256.873,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5256.893,
    "end": 5264.898,
    "text": "So my policy would be to order a new meal in a restaurant that I like or order a meal that I'm used to in a new restaurant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5265.278,
    "end": 5266.679,
    "text": "So that would be like the policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5267.159,
    "end": 5268.681,
    "text": " And that just to continue that example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5270.383,
    "end": 5270.663,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5270.943,
    "end": 5273.666,
    "text": "Well, what a fun discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5274.267,
    "end": 5283.998,
    "text": "I hope this was useful to those who are familiar with active inference as well as Bayesian statistics, machine learning or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5284.898,
    "end": 5290.859,
    "text": " It's all chill because your questions will really help move the whole project forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5291.36,
    "end": 5295.361,
    "text": "The parts that do and don't make sense and the parts that you want to explore more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.381,
    "end": 5305.063,
    "text": "I think that's how our ensemble is going to proceed in these transdisciplinary areas is by welcoming those who have different backgrounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.123,
    "end": 5313.365,
    "text": "So whether you're really familiar or not, you're totally welcome to participate in our live discussions or just to ask questions or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5314.065,
    "end": 5315.666,
    "text": " participate in some other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.346,
    "end": 5322.068,
    "text": "Thanks Blue for the awesome help with preparing the slides and for this conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5322.768,
    "end": 5324.689,
    "text": "And we'll see everybody another time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.709,
    "end": 5326.25,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5326.85,
    "end": 5326.99,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]