[
  {
    "start": 8.097,
    "end": 9.759,
    "text": " Hello, welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.399,
    "end": 13.242,
    "text": "It is the 22nd of April 2025.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 13.302,
    "end": 20.13,
    "text": "We're in Active Inference Guest Stream 104.1 with Tadahiro Taniguchi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.93,
    "end": 31.101,
    "text": "We will be hearing a presentation and a discussion on collective predictive coding and active inference, a new perspective on emergent communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.842,
    "end": 35.826,
    "text": "So thank you for joining and looking forward to the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.856,
    "end": 41.518,
    "text": " Okay, thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.339,
    "end": 49.589,
    "text": "Thank you very much for giving me this great opportunity to speak at this great live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.431,
    "end": 54.156,
    "text": "I'm Tadahiro Taniguchi from Kyoto University, Japan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.937,
    "end": 64.91,
    "text": "Okay, today, I will be talking about collective predictive coding and active inference, a new perspective on emergent communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.792,
    "end": 69.036,
    "text": "So maybe for many of you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.438,
    "end": 74.405,
    "text": " the collective predictive coding, maybe a new term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.425,
    "end": 80.233,
    "text": "And I would like to introduce this, our theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.253,
    "end": 83.737,
    "text": "Okay, so before starting, let me introduce myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.358,
    "end": 85.5,
    "text": "I'm Tadahiro Taniguchi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.121,
    "end": 93.911,
    "text": "And actually, I have been working on the simple emergence for a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.652,
    "end": 96.795,
    "text": "And in more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.079,
    "end": 124.302,
    "text": " process the ai and robotics and especially cognitive developmental robotics is my background okay last year i moved to kyoto university and i'm now the professor at kyoto university in japan so if you have a chance to visit kyoto it's a beautiful city please stop by our laboratory okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.703,
    "end": 127.467,
    "text": " Anyway, let me start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.487,
    "end": 136.801,
    "text": "So before starting, let me share the key points of today's talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.821,
    "end": 148.197,
    "text": "So I will propose the Floch Collective Predictive Coding, CPC in short, as a dynamic underlying simple emergent system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.818,
    "end": 152.263,
    "text": "I will explain what is a simple emergent system later as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.564,
    "end": 166.464,
    "text": " and present a formulation of language emergence based on probabilistic generative models, showing its relationship to the free energy principle and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.605,
    "end": 180.343,
    "text": "They also position CPC as a natural generalization of FEP to the group or societal level, and present the CPC hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.64,
    "end": 202.166,
    "text": " as an interpretation of why large energy models appear to understand the structure of the physical world, and also introduce new perspectives derived from or inspired by CPC, such as CPC as a model of science and quad process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.107,
    "end": 210.617,
    "text": "Maybe the topic will be too much, but I would like to introduce our idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.728,
    "end": 215.615,
    "text": " I hope it is exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.456,
    "end": 226.294,
    "text": "Before diving into today's main topic, maybe the CPC, as I mentioned, CPC will be a new term for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.426,
    "end": 231.494,
    "text": " Let me introduce the collective predictive coding CPC hypothesis briefly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.295,
    "end": 239.666,
    "text": "This hypothesis extends the idea of predictive coding to social and linguistic phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.807,
    "end": 250.662,
    "text": "It states that similar systems, including language, are formed through collective predictive coding by humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 251.62,
    "end": 261.058,
    "text": " In other words, symbol emergence or language emergence can be understood as a social representation learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.198,
    "end": 271.097,
    "text": "As a result, the structure of the world may be encoded in distributional semantics in language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.364,
    "end": 277.573,
    "text": " The hypothesis also suggests that this is why LLMs appear to understand the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.154,
    "end": 284.503,
    "text": "They inherit this structure through vast amounts of distributed human-generated text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.709,
    "end": 293.676,
    "text": "The main topic is CPC and free energy principle and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.128,
    "end": 302.718,
    "text": " But let me choose the LLM as the starting point of today's talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.579,
    "end": 308.946,
    "text": "Maybe the LLM because everybody knows LLM recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.966,
    "end": 309.266,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.307,
    "end": 315.934,
    "text": "So LLM, we have LLM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.954,
    "end": 318.477,
    "text": "But what are they actually based on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.839,
    "end": 323.443,
    "text": "So they are completely reliant on human language data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.773,
    "end": 331.442,
    "text": " Let's take a moment to reflect on our linguistic lives, our language, human language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.084,
    "end": 348.925,
    "text": "Actually, as I showed on this slide, each individual possesses a unique set of linguistic and word knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.445,
    "end": 357.433,
    "text": " But no one has complete knowledge of language or knowledge of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.814,
    "end": 365.881,
    "text": "And actually, we dynamically learn, even when we were children or infants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.502,
    "end": 376.532,
    "text": "So we dynamically learn and adapt our linguistic knowledge through communication, including reading, writing, and conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.782,
    "end": 383.712,
    "text": " So, language system itself is not a concrete fixed system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.473,
    "end": 394.307,
    "text": "So, that is always changing and that is above ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.068,
    "end": 398.994,
    "text": "So, nobody has complete the language system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.795,
    "end": 402.098,
    "text": "Importantly, through",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.382,
    "end": 408.169,
    "text": " communication, the language system, as I said, itself evolve over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.691,
    "end": 419.603,
    "text": "In recent human history, the vast amount of linguistic data have been accumulated in massive datasets on the internet or server.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.324,
    "end": 423.428,
    "text": "So by training,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.302,
    "end": 438.179,
    "text": " On these corpora, using next token prediction, and also, of course, we can use some reinforcement learning method, the large neural networks have internalized the distributional structure of human language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.88,
    "end": 447.711,
    "text": "As a result, LLM exhibit surprisingly high level of language understanding and usage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.927,
    "end": 458.161,
    "text": " This achievement makes a major discovery of the past decade and indeed a significant milestone in human history, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.222,
    "end": 468.855,
    "text": "But, as I mentioned, this capability is very much relying on our language that we created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.949,
    "end": 476.544,
    "text": " So the question remains, how does human society form language in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.146,
    "end": 482.819,
    "text": "How do we share meaning without directly accessing each other's minds?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.62,
    "end": 488.211,
    "text": "How did society create a language system without any centralized learning process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.035,
    "end": 501.895,
    "text": " These profound questions motivated us to engage in constructive research on language evolution and language learning and symbol emergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 501.915,
    "end": 513.072,
    "text": "And actually, we have been working on this kind of constructive studies since around 2010.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.553,
    "end": 518.08,
    "text": "Our community has been studying symbol emergence in robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.313,
    "end": 519.414,
    "text": " SEL, in short.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.476,
    "end": 527.065,
    "text": "SEL takes a constructive approach to cognitive systems inspired by developmental robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.585,
    "end": 547.712,
    "text": "So actually, we developed many unsupervised learning methods and artificial cognitive systems for multimodal object categorizations and concept formation, language acquisition from speech signals, and so on, to better understand human developmental cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.827,
    "end": 550.069,
    "text": " and the emergence of language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.85,
    "end": 561.54,
    "text": "So actually, recently, this kind of self-supervised, unsupervised learning on multimodal data is very, very common recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.181,
    "end": 569.027,
    "text": "But 15 years ago, it was very, very characteristic research to my understanding, to my knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.708,
    "end": 577.395,
    "text": "And also, most of our models were based on probabilistic generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.763,
    "end": 580.09,
    "text": " and predictive models in other words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.116,
    "end": 592.667,
    "text": "We defined the symbol emergence in robotics in this series of research as constructive approach to symbol emergence systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.638,
    "end": 610.774,
    "text": " As a part of this annual research, we have been working on world models and predictive coding as well in collaboration with co-authors from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.108,
    "end": 616.594,
    "text": " the active inference community, we have published several papers on this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.295,
    "end": 629.73,
    "text": "For example, we co-authored world models and predictive coding for cognitive and developmental robotics alongside roboticists, neuroscientists, and cognitive scientists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.251,
    "end": 640.002,
    "text": "We also contributed to a paper on world model learning and inference, where Professor Carl Frisson served as the first author.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.467,
    "end": 650.697,
    "text": " These are the kind of background of my research before getting into the CPC-like topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.218,
    "end": 663.411,
    "text": "Let me briefly introduce the simple emergent system, another important term in this talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.712,
    "end": 666.715,
    "text": "This figure provides an overview of the concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.264,
    "end": 690.593,
    "text": " let me briefly introduce the main idea here the system does not mean artificial system or a robot or something like that the system here refers a complex system that enables symbol systems including language to emerge",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.383,
    "end": 698.573,
    "text": " The core idea is that symbol emergence involves two key dynamics happening simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.714,
    "end": 710.168,
    "text": "So you have individual agents learning internal representations, forming concepts through physical interaction with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.61,
    "end": 717.458,
    "text": "It's kind of embodied, the interaction, the active interaction with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.64,
    "end": 727.876,
    "text": " The traditional studies in developmental and cognitive robotics and also our simple emergency robotics focus on this individual representation learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.697,
    "end": 733.725,
    "text": "And still, many AI studies are looking at the individual capability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.195,
    "end": 738.239,
    "text": " of language learning and other skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.16,
    "end": 751.152,
    "text": "But at the same time, these engines interact socially through semiotic communication, communication using symbols or signs, including language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.313,
    "end": 764.185,
    "text": "And it's through this social communication that agents share the symbol systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.418,
    "end": 769.285,
    "text": " And through that process, symbol systems emerges across that group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.286,
    "end": 781.002,
    "text": "This emergent system then influence, the emergent symbol system then influence individual perception, communication, and behaviors in a top-down manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.422,
    "end": 782.804,
    "text": "It's a kind of top-down constraint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.625,
    "end": 793.159,
    "text": "So the SES, symbol emergent system framework, emphasizes the interplay between individual learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.24,
    "end": 811.502,
    "text": " and collective behavior and kind of bottom-up formation and top-down constraints this kind of micro macro loop is the heart of the symbol emergent systems and i believe this is the crucial part of our language",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.545,
    "end": 829.506,
    "text": " After proposing this descriptive model from the viewpoint of emergent systems, I have been studying this system to uncover the fundamental mechanism of the human cognitive and collective intelligence in terms of symbols and language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.249,
    "end": 837.856,
    "text": "Of course, there are so many related prior studies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.978,
    "end": 842.502,
    "text": "The researchers have been studying constructive approaches",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.954,
    "end": 847.061,
    "text": " to language evolution and emergent communication for a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.783,
    "end": 862.93,
    "text": "So, for example, in 1990s, Luke Stiles in Europe and other researchers pioneered a language game experiment, where agents form a sign through interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.651,
    "end": 865.755,
    "text": "So many algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.258,
    "end": 892.03,
    "text": " are proposed and most of them are based on language game so the two agents or similar robots apply some sort of communication including the naming game or differential games and through that process they become sharing the signs and symbols or form language or something and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.005,
    "end": 914.074,
    "text": " More recently, after deep learning became popular, deep reinforcement learning-based approaches have gained popularity, and that changed the landscape of emergent research on emergent communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.597,
    "end": 918.76,
    "text": "But basically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.959,
    "end": 925.647,
    "text": " the central idea is similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.968,
    "end": 945.912,
    "text": "I can talk about the pros and cons of this approach, but because of time constraints, let me simply introduce another line of research, our approach on emergent communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.297,
    "end": 963.402,
    "text": " based on genitive model, probabilistic genitive model, which has been employed in a series of study on simple emergency in robotics, our research and the answer by the learning based approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.024,
    "end": 967.588,
    "text": "So I mentioned the naming game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.389,
    "end": 972.355,
    "text": "So I didn't talk about the example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.841,
    "end": 984.259,
    "text": " But we extended, or we changed, the theoretical basis of naming game and proposed Metropolis Hastings naming game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.301,
    "end": 993.754,
    "text": "A bit complicated name, but that has reason why we call this Metropolis Hastings naming game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.896,
    "end": 1000.705,
    "text": "This is a kind of game, language game, built on a solid mathematical foundation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.343,
    "end": 1004.026,
    "text": " Okay, let me introduce how does it work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.268,
    "end": 1008.392,
    "text": "First, there are two agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.412,
    "end": 1013.759,
    "text": "Consider agent A as a speaker and agent B as the listener.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.021,
    "end": 1019.206,
    "text": "Both agents observe the same object here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.007,
    "end": 1024.633,
    "text": "So this means we assume joint attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.854,
    "end": 1029.78,
    "text": "Joint attention is the fundamental basis of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.199,
    "end": 1032.282,
    "text": " our language acquisition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.823,
    "end": 1045.442,
    "text": "Basically, when infants around nine months old become able to perform the joint attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.584,
    "end": 1051.952,
    "text": "And the joint attention is believed to be the basis of language learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.413,
    "end": 1056.679,
    "text": "So I think this is a very, very natural assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.448,
    "end": 1062.194,
    "text": " OK, so next, the speaker names the object probabilistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1063.415,
    "end": 1076.515,
    "text": "And that naming is performed by sampling from the posterior distribution of a name based on this image and the latent variable, internal representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.438,
    "end": 1085.248,
    "text": "The listener then decides whether to accept the naming based on a certain probability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.667,
    "end": 1088.311,
    "text": " which depends on the belief state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.272,
    "end": 1098.366,
    "text": "Specifically, this probability reflects how well the listener's belief matches the name proposed by the speaker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.308,
    "end": 1107.26,
    "text": "The listener agent does not find the incoming sign believable, so it can reject the proposed naming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.221,
    "end": 1112.147,
    "text": "This ability to reject is crucial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.836,
    "end": 1121.11,
    "text": " After communication, the listener updates the internal parameters related to representation learning and naming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.951,
    "end": 1127.18,
    "text": "Then they switch roles, and Agent B becomes the speaker and the game continues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.062,
    "end": 1138.219,
    "text": "Overall, this is a very, very simple game, but it captures essential dynamics of how shared symbols can emerge through communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.465,
    "end": 1144.952,
    "text": " Let me continue the explanation from the mathematical viewpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.375,
    "end": 1166.518,
    "text": "If the acceptance decision is made according to this probability, we can mathematically prove that the name game is equivalent to the metal processing algorithm for Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.667,
    "end": 1175.88,
    "text": " of the latent variable shown in the figure on the right, this W. Let's begin with this graphical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.32,
    "end": 1183.791,
    "text": "Here, OA and OB represents a visual observation of each event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.811,
    "end": 1190.78,
    "text": "Of course, they can be multimodal information that can involve other sensor input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.88,
    "end": 1194.305,
    "text": "But anyway, they have observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.325,
    "end": 1196.488,
    "text": "That is the internal representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.093,
    "end": 1197.974,
    "text": " latent variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.575,
    "end": 1210.793,
    "text": "We also assume the existence of a variable w here, which serves as a prior of these two observations, two agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.096,
    "end": 1225.834,
    "text": "If we treat w as a latent variable, this graphical model becomes very similar to multimodal or multivariational autoencoder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.27,
    "end": 1229.313,
    "text": " or some multi-modal representation learning system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.375,
    "end": 1255.281,
    "text": "So, if the two agents' brain were directly connected and could use both observations simultaneously, they could jointly update the shared variable W. And this variable would encode the combined information from both agents' input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.054,
    "end": 1260.259,
    "text": " However, in reality, they are independent cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.88,
    "end": 1263.083,
    "text": "We humans cannot directly connect our brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.224,
    "end": 1265.826,
    "text": "So, let's introduce a trick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.508,
    "end": 1274.718,
    "text": "Algorithmically, we can decompose the model into two parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.738,
    "end": 1284.61,
    "text": "The right-hand side represents agent A. The right-hand side represents agent B. Then we consider an alternative inference method for W.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.923,
    "end": 1288.387,
    "text": " So now, think about the sampling process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.229,
    "end": 1296.803,
    "text": "Agent A proposed a candidate latent variable, WD, by sampling from its posterior distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.087,
    "end": 1305.298,
    "text": "And this value is passed to Agent B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.493,
    "end": 1312.864,
    "text": " and who then decides whether to accept the sample based on a certain probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.966,
    "end": 1331.877,
    "text": "If the acceptance probability is designed appropriately, this process becomes equivalent to Metropolis-Haysing's algorithm, which some of you may recognize as a Markovitch and Monte Carlo MCMC method, under certain conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.16,
    "end": 1360.227,
    "text": " And this guarantees that the shared signs are forked and that the categories emerge among agents to approximate the posterior distribution based on agents' observations, because this is completely the same as a multi-modal variational autoencoder, multi-viewport variational autoencoder like SAC, like SYNC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.135,
    "end": 1365.881,
    "text": " Okay, this is the kind of the theory, the basic theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.702,
    "end": 1370.748,
    "text": "And of course, we can test this kind of system on some dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.649,
    "end": 1375.113,
    "text": "Okay, the simplest one is always MNIST.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.414,
    "end": 1377.777,
    "text": "Now let's move on to the result of the experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.538,
    "end": 1380.24,
    "text": "We conducted a small experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.541,
    "end": 1387.75,
    "text": "Agent A observes the MNIST dataset, and Agent B observes rotated MNIST data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.017,
    "end": 1405.279,
    "text": " You know, for example, in learning process, even though we have joint attention, when mother is pointing, oh, this is 0, or this is 1, or this is 2, the infant or child look at the object from a different direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.599,
    "end": 1407.862,
    "text": "This is imitating such kind of situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.964,
    "end": 1413.99,
    "text": "And we let the agent play the Metaboys Hastings naming game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.392,
    "end": 1415.593,
    "text": " Okay, this is a simple result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.254,
    "end": 1427.746,
    "text": "So, simply, this result, if the agent do not perform communication, the performance is like this, no communication setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.886,
    "end": 1439.438,
    "text": "And if the agent performs the Metropolis Async Slamming game, they can share sign, they can share sign, and actually the performance of clustering is improved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.278,
    "end": 1455.062,
    "text": " So this is because in the learning process, the categorization process involving representation learning process depends not only on single agents observation, but also on both agents observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.745,
    "end": 1461.392,
    "text": "The information is rich, and the result becomes better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.473,
    "end": 1462.894,
    "text": " So this is wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.296,
    "end": 1481.974,
    "text": "Don't forget that this Metropolis-Hassings naming game is an inference process of this multi-view representation learning system, of course, with a single view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.994,
    "end": 1487.7,
    "text": "So without communication, the agent can only use",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.338,
    "end": 1492.121,
    "text": " the image data the agent observes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.141,
    "end": 1502.611,
    "text": "But through the emergent communication, they mathematically, they theoretically make use of the information as another agent of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.214,
    "end": 1516.624,
    "text": "This implies that the simple emergence in society is not only for emergent communication, but also for better representation learning, in other words, better understanding of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.195,
    "end": 1521.259,
    "text": " That's a very important implication, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.279,
    "end": 1530.147,
    "text": "So in that paper I published two years ago, we conducted the experiment on a slightly different death set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.388,
    "end": 1533.571,
    "text": "And a similar result was obtained, observed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.211,
    "end": 1546.543,
    "text": "Actually, if we are based on this kind of modeling, this gave us a different view of semiotic communication, communication using symbol signs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.62,
    "end": 1554.809,
    "text": " Here, the communication is interpreted as an interpersonal kind of cross-modal inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.451,
    "end": 1565.382,
    "text": "First, agent A observes the object and infer the latent variable, the sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.402,
    "end": 1568.987,
    "text": "And the sampling, the what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.705,
    "end": 1578.637,
    "text": " And after that, based on a given sample, the receiver can reconstruct the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.839,
    "end": 1598.468,
    "text": "If the agent performs the MH Metropolis Hastings naming game, they shall sign, and also Agent B, after receiving that message, successfully reconstructs the image of the fruit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.764,
    "end": 1603.771,
    "text": " Okay, and interestingly, please see the all-acceptance condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.492,
    "end": 1610.583,
    "text": "All-acceptance condition means the listener agent never rejects the incoming sign.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.264,
    "end": 1624.607,
    "text": "Always, they listen to the speakers and learn something from their level, their word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.802,
    "end": 1639.391,
    "text": " Interestingly, if we make the agent accept all samples, and the agent do not use their belief state for rejection, they could not successfully form nice representation internally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.992,
    "end": 1643.98,
    "text": "As a result, they cannot reconstruct the images from the signs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.301,
    "end": 1645.684,
    "text": "It's very interesting, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.035,
    "end": 1660.479,
    "text": " This is because the communication without rejected decision diverts from the theoretical posterior sampling, the Bayesian inference, approximate Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.88,
    "end": 1665.748,
    "text": "And this is the kind of first step of our journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.977,
    "end": 1679.6,
    "text": " And following this study, we have continued to explore the Metropolis-Hassings naming game and emergent communication based on this kind of probabilistic generative modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.262,
    "end": 1687.956,
    "text": "The recent research has introduced several key extensions to improve scalability and structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.358,
    "end": 1696.008,
    "text": " adaptability, including expansion to multiple agents, not only two, but three or four or more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.889,
    "end": 1698.912,
    "text": "Expansion to compositional language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.333,
    "end": 1707.544,
    "text": "In the previous scenario, the agents just used the A or B or C categorical signs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.165,
    "end": 1717.437,
    "text": "But now, the agents can use the sequence of tokens, like sentence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.687,
    "end": 1725.235,
    "text": " Not only such a discrete sequence, actually the agents can use continuous signals as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.957,
    "end": 1742.935,
    "text": "Also, in a budget communication, not only this kind of naming or captioning, something like that, so cooperation is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.961,
    "end": 1753.753,
    "text": " So one of the main fields of emergent communication is multi-agent reinforcement learning with emergent communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.654,
    "end": 1771.133,
    "text": "So actually, thanks to the probabilistic modeling and controller-as-influence framework, now model-based reinforcement learning can be interpreted as probabilistic inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.417,
    "end": 1777.768,
    "text": " So we successfully integrate our idea to merge agent reinforcement learning as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.889,
    "end": 1790.208,
    "text": "And we can use this kind of emergent communication for making agent run cooperative behavior as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.228,
    "end": 1797.34,
    "text": "And also, our original idea was based on Metropolis Hastings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1797.826,
    "end": 1802.051,
    "text": " that is a kind of approximate Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.052,
    "end": 1812.104,
    "text": "And of course, Metropolis-Hastings algorithm is not only a solution for such kind of implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1812.785,
    "end": 1825.2,
    "text": "So we are now developing a variational inference-based and contrastive learning-based approach, and we can get a similar result with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.349,
    "end": 1829.759,
    "text": " Let me introduce one very recent work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.38,
    "end": 1838.498,
    "text": "Actually, we uploaded the display print one or two weeks ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.254,
    "end": 1855.414,
    "text": " And we want to connect our emergent communication like research to the current recent trend of AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.595,
    "end": 1866.527,
    "text": "And we replace the variational autoencoder and Gaussian mixture model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.997,
    "end": 1872.163,
    "text": " the previous model by the vision language model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.183,
    "end": 1877.349,
    "text": "So naming can be replaced by captioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.61,
    "end": 1885.098,
    "text": "The agent can observe the natural image and play captioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.841,
    "end": 1888.501,
    "text": "Matsui et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.722,
    "end": 1894.388,
    "text": "extended the Metaboys Hastings naming game to image captioning using vision language model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.638,
    "end": 1901.708,
    "text": " We introduced a language model, GPT-2, into the caption generation process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.75,
    "end": 1912.123,
    "text": "In this scenario, agents were pre-trained on different datasets and attempted to adjust their expression through communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.666,
    "end": 1923.7,
    "text": "More specifically, one agent was trained with Cocoa dataset, and another agent learned",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.933,
    "end": 1936.368,
    "text": " are trained with conceptual captions, so very different way of captioning type of expression they have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.949,
    "end": 1947.922,
    "text": "But through the process, their way of captioning is become similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.703,
    "end": 1952.387,
    "text": "And I will not get into the detail,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.654,
    "end": 1963.508,
    "text": " today but if you are interested please take a look okay and also as we found that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.825,
    "end": 1976.728,
    "text": " This kind of process even prevents the catastrophic forgetting that was a problematic problem in the fine-tuning in VLM as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.409,
    "end": 1986.846,
    "text": "This may be an engineering aspect, but I think it has much implication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.484,
    "end": 2004.943,
    "text": " These studies, along with the idea of viewing symbol or language emergence as decentralized Bayesian inference, have led us to a new concept, that is, a collective predictive coding of CPC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.025,
    "end": 2007.927,
    "text": "The idea is something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.748,
    "end": 2016.276,
    "text": "Through the creation and negotiation of symbols or symbol systems, societies may optimize",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.762,
    "end": 2019.506,
    "text": " collective world models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.526,
    "end": 2025.033,
    "text": "This perspective suggests a social extension of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.634,
    "end": 2032.304,
    "text": "Later, I will talk about this a bit more in detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.564,
    "end": 2039.433,
    "text": "And I think this is very much inspiring idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.453,
    "end": 2045.622,
    "text": "And I think so human society,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.563,
    "end": 2053.23,
    "text": " is operating the same mechanism, same things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.25,
    "end": 2072.25,
    "text": "And I'm wondering, actually, when people play the similar naming game, are they following the similar acceptance ratio or rejection ratio?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.5,
    "end": 2089.547,
    "text": " I mean, if they follow the similar rejection ratio, acceptance ratio, that shows we humans can perform the Bayesian inference, posterior inference together as a group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.713,
    "end": 2098.521,
    "text": " So we conducted this kind of experiment with participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.262,
    "end": 2108.191,
    "text": "So sometimes, in the study of semiotics, they use this kind of experimental setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.491,
    "end": 2111.714,
    "text": "This is called experimental semiotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.734,
    "end": 2115.838,
    "text": "And as a result, the result supports",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.122,
    "end": 2130.523,
    "text": " the idea that human language, you know, that these humans follow the Metropolis, follow the similar pattern to the Metropolis-Hasings naming game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.905,
    "end": 2146.045,
    "text": "This is a very, very weak evidence, I think, but this relatively supports the idea that human language evolution, language follows a CPC-like mechanism to a certain extent, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.936,
    "end": 2174.04,
    "text": " OK, so we have been building many algorithms with the idea of that emergent communication or our simple emergence can be viewed as a kind of generative model, generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.476,
    "end": 2188.939,
    "text": " And reviewing these works and considering future perspective, we recently wrote a preprint titled, Generative Amazon Communication, Large Language Model as a Collective Word Model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.122,
    "end": 2199.876,
    "text": "In this paper, we expressly argue that a large language model can function as a collective word model in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.21,
    "end": 2205.476,
    "text": " So let me go back to the starting point of today's talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.197,
    "end": 2209.901,
    "text": "I talked about the language-language model, the learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.223,
    "end": 2214.527,
    "text": "We have a simple emergent system on the right-hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.108,
    "end": 2220.934,
    "text": "And we now have the idea of collective predict coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.955,
    "end": 2226.1,
    "text": "This is a kind of representation learning performed by everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.839,
    "end": 2240.775,
    "text": " And usually, when we talk about the representation learning, it's often, it also always consider it is a kind of internal representation learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.875,
    "end": 2256.272,
    "text": "But the process of symbol emergence, in the process of symbol emergence, we actually create, form the external symbol systems, like language and knowledge and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.13,
    "end": 2271.684,
    "text": " And that process can be regarded as a kind of social representation learning or external representation learning performed by multi-agent systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.745,
    "end": 2277.749,
    "text": "So, in some sense, language embodying collective intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.01,
    "end": 2281.012,
    "text": "That is the whole thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.252,
    "end": 2284.015,
    "text": "And then, with this perspective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.653,
    "end": 2297.777,
    "text": " We can now say that our language system is structurally the modeling, the representing, the structure of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.997,
    "end": 2300.181,
    "text": "But this is not the kind of objective world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.823,
    "end": 2308.737,
    "text": "It's a kind of the sum of our subjective and perceptual embodied experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.56,
    "end": 2323.001,
    "text": " But as a result, and by internalizing this structure through predictive modeling, the LLM reconstruct such kind of world model internally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.862,
    "end": 2324.883,
    "text": "That is a scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.665,
    "end": 2337.643,
    "text": "And many, I think that this, I think that this is one idea that can, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.058,
    "end": 2344.725,
    "text": " as a kind of the why LLM is so working well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.745,
    "end": 2360.244,
    "text": "Okay, so let me move on to the, let me re-illustrate the CPC hypothesis again, CPC again, with the idea of emergent communication and pre-predictive coding or free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.985,
    "end": 2364.389,
    "text": "First, let's start from predictive coding or world model learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.49,
    "end": 2368.474,
    "text": "There is a person, the he,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.095,
    "end": 2372.978,
    "text": " internally has internal representation or world models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.879,
    "end": 2377.242,
    "text": "We are living with action-perception loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.262,
    "end": 2389.893,
    "text": "This is very, how to say, this is very popular way of describing the agent interacting with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.053,
    "end": 2396.419,
    "text": "And this process is regarded as a kind of inference process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.179,
    "end": 2399.001,
    "text": "Okay, but with humans,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.449,
    "end": 2401.05,
    "text": " We are so many.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.031,
    "end": 2412.907,
    "text": "And also, this interaction, this process is not informationally probabilistically independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.189,
    "end": 2420.618,
    "text": "So yes, we have communication, and we are influencing each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.172,
    "end": 2432.578,
    "text": " Following the predictive-predictive coding hypothesis through language game, we can form language-like social representation through the learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.64,
    "end": 2439.012,
    "text": "I think through this process, we model and adapt to the world collectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.287,
    "end": 2448.578,
    "text": " So this is the CPC process explaining the simple language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.299,
    "end": 2456.249,
    "text": "But with this view, we can change our view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.251,
    "end": 2462.639,
    "text": "Until now, we believe that each person is an independent and autonomous agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.36,
    "end": 2464.702,
    "text": "But let's change the viewpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.683,
    "end": 2467.165,
    "text": "First, language is here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.147,
    "end": 2470.45,
    "text": "Language is a kind of autonomous system here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.324,
    "end": 2479.192,
    "text": " And language has sensors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.792,
    "end": 2480.653,
    "text": "That's us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.714,
    "end": 2485.338,
    "text": "Language uses us to model the world through interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.098,
    "end": 2490.282,
    "text": "From this point, we are supporting it through the language system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.083,
    "end": 2497.99,
    "text": "Actually, this kind of view is often mentioned in sociology and some other academic fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.202,
    "end": 2507.973,
    "text": " and we are kind of the people working for language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.615,
    "end": 2520.649,
    "text": "Okay, I think this kind of dual viewpoint is very interesting to extend our view of cognition to the social view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.511,
    "end": 2526.576,
    "text": "Then, let's move on to the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.552,
    "end": 2534.781,
    "text": " Recently, we formalized the CPC from the viewpoint of free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.482,
    "end": 2542.111,
    "text": "Based on a generative model representing CPC, we can naturally derive variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.454,
    "end": 2549.481,
    "text": "Interestingly, final form can be divided into two parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.964,
    "end": 2555.989,
    "text": "The first one is an ordinary free energy term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.762,
    "end": 2562.77,
    "text": " This is the sum of the variation-free energy of a number of agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.892,
    "end": 2568.218,
    "text": "In addition to that, an interesting term pops up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.238,
    "end": 2571.983,
    "text": "We call this the collective regularization term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.025,
    "end": 2575.328,
    "text": "This term tries to align",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.645,
    "end": 2602.075,
    "text": " agents external representation w with each other's internal representation with this term the problem of minimizing individual free energy becomes the minimization of free energy of a single of a single total system and actually this is this free energy is not for a single agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.443,
    "end": 2621.811,
    "text": " But actually, this language, this total system, free energy, is defined like this, and they are divided into the individual free energy and some mysterious collective regularization term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.831,
    "end": 2632.146,
    "text": "I think this view can extend the free energy principle from the individual to the collective level with a clear relationship to simple emergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.459,
    "end": 2639.708,
    "text": " And actually, this is related to the classical semiotics, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.829,
    "end": 2647.098,
    "text": "The corrective visualization term is particularly interesting from the perspective of semiotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.118,
    "end": 2653.848,
    "text": "In semiotics, here is Charles Sanders' path, the father of semiotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.868,
    "end": 2657.533,
    "text": "And arbitrariness is a crucial concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.274,
    "end": 2661.238,
    "text": "Science can represent orbital objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.826,
    "end": 2665.17,
    "text": " depending on language, culture, society, and context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.192,
    "end": 2676.265,
    "text": "So while this is widely recognized, to my knowledge, most studies in semiotics have explicitly addressed the functional role of this arbitrariness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.166,
    "end": 2689.723,
    "text": "From the perspective of simple emergence, we can argue that this arbitrariness provides a degree of freedom that allow us to optimize collective variation of free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.412,
    "end": 2700.564,
    "text": " This shifts individual's free energy minimization problem into a collective free energy minimization framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.465,
    "end": 2715.742,
    "text": "In other words, while we rely on the plasticity of individual brain, we become a collective social intelligence by exploiting the plasticity of similar systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.802,
    "end": 2719.086,
    "text": "These are my current speculative thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.302,
    "end": 2741.243,
    "text": " on human intelligence okay so before wrapping up my talk so i want to talk about a bit more a bit several uh one or two topics so and this you gave us further inspiration about the temporal aspect of human mind",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.05,
    "end": 2746.215,
    "text": " So many of you may know the dual process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.936,
    "end": 2750.28,
    "text": "Sometimes it is called System 1 and 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.602,
    "end": 2758.55,
    "text": "So that tells us we humans have fast thinking and slow thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.012,
    "end": 2765.779,
    "text": "CPC gives us an opportunity to extend this idea to group level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.417,
    "end": 2777.195,
    "text": " So in our paper, we discussed the system 0123, acquired process theory for multi-time-scale embodied collective cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.996,
    "end": 2785.388,
    "text": "The CPC hypothesis allows us the emergent symbol system as a type of supercognitive system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.638,
    "end": 2790.931,
    "text": " that adapts to its environment with extremities through temporal dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.274,
    "end": 2794.78,
    "text": "First, we have a kind of physical dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.043,
    "end": 2802.178,
    "text": "Even some of you may know, like passive dynamic walker and soft robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.158,
    "end": 2820.022,
    "text": " They showed that even without brain, our body itself interacts with the world so flexibly if your body has sufficient mechanical properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.042,
    "end": 2830.056,
    "text": "So this is a kind of superfast dynamics, and this is important in robotics and often missed in AI studies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.424,
    "end": 2858.845,
    "text": " and yes after that in our cognitive process first dynamic system one and system two and actually the recently the system one is modeled by world model and the political learning and imitation learning and so on and the system two the language level the kind of derivative thought that is modeled by language model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.057,
    "end": 2864.501,
    "text": " But these are happening internally, inside of our mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.482,
    "end": 2870.287,
    "text": "But as a group, we have more slow, super slow dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.049,
    "end": 2883.56,
    "text": "It is the learning process is corresponding to the kind of negotiating our simple systems, changing our custom habit in our society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.341,
    "end": 2886.823,
    "text": "That is a more slower dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.782,
    "end": 2895.132,
    "text": " So, and importantly, System 3 and System 2 are happening outside of our mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.893,
    "end": 2903.263,
    "text": "But it is super important for our society and ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.084,
    "end": 2906.607,
    "text": "We really have to do this as System 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.149,
    "end": 2914.077,
    "text": "Dr. Hirai, who is a philosopher,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2914.951,
    "end": 2924.244,
    "text": " Okay, and following this work, we wrote another perspective paper exploring the formalization of scientific activity using the CPC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.865,
    "end": 2934.599,
    "text": "The core idea of CPC is the symbolic system emerged through the organization of external representations as a human attempt to model the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.86,
    "end": 2944.232,
    "text": "This concept closely aligns with scientific activity, even rather than language learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.853,
    "end": 2959.512,
    "text": " As one of the fundamental goals of science is to construct external representation systems that describe and enhance our understanding of the world, ultimately improving our predictive capabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.054,
    "end": 2970.085,
    "text": "So, and one of the key insights is that image name gate in symbol emergence has",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.655,
    "end": 2974.141,
    "text": " an interesting similarity to scientific discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.563,
    "end": 2981.452,
    "text": "A representative form of scientific discussion is a kind of peer review process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.474,
    "end": 2998.519,
    "text": "An agent performs an experiment, writes a paper based on their observations, submits the paper, and the reviewers decide whether to accept or reject it, considering their beliefs, evidence, and the style of paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.668,
    "end": 3011.988,
    "text": " And this structural similarity between the image naming game and scientific discussion suggests that this type of overall scientific activity can be regarded as a presentation learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.489,
    "end": 3019.019,
    "text": "This analogy leads us to the idea of CPC as the model of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.78,
    "end": 3026.65,
    "text": "I believe this work will bring meaningful implications to the philosophy of science and other fields as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.216,
    "end": 3038.804,
    "text": " In this paper, we derived the free energy of CPC I explained before in the previous slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.967,
    "end": 3043.356,
    "text": "On the basis of free energy for CPC framework,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.488,
    "end": 3047.132,
    "text": " we can naturally connect it to active inference, finally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.953,
    "end": 3053.64,
    "text": "It extends the individual expected free energy by incorporating a collective term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.201,
    "end": 3059.867,
    "text": "This now can be called collective epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.928,
    "end": 3069.698,
    "text": "So this formulation allows us to consider active inference motivated or guided by emergent language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.117,
    "end": 3084.777,
    "text": " The future work includes exploring this concept as active influence at a group level, potentially framing it as collective curiosity or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.198,
    "end": 3096.013,
    "text": "In scientific community, we are conducting research not only on collective curiosity driving scientific exploration or societal adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3096.693,
    "end": 3099.297,
    "text": "This is just the beginning, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.749,
    "end": 3116.34,
    "text": " But I think this kind of approach, actually connecting, this has been a kind of long journey, but connecting the simple emergence or I would say the collective learning process for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.86,
    "end": 3130.582,
    "text": " some external representation, not only just a sequence of token or category of something like that, but the scientific knowledge, our laws, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.424,
    "end": 3138.896,
    "text": "So modeling such kind of social phenomena is a huge challenge for us and future AI, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.397,
    "end": 3139.998,
    "text": "Future AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.719,
    "end": 3141.4,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.548,
    "end": 3144.913,
    "text": " So that's almost all of my talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.374,
    "end": 3146.715,
    "text": "The summary is something like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3146.776,
    "end": 3149.399,
    "text": "We propose a corrective-predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.261,
    "end": 3163.179,
    "text": "And that was from the simple emergence as decentralized Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.199,
    "end": 3169.328,
    "text": "And that was extended to the free energy principle and the active inference to the societal end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.848,
    "end": 3180.479,
    "text": " And I mentioned the relationship between LLM and kind of the world modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.499,
    "end": 3184.843,
    "text": "And we introduced generative emergent communication and related works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.484,
    "end": 3199.838,
    "text": "And lastly, I mentioned several implications, including CPC as a model of science and system 0123 quadratic process model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.054,
    "end": 3202.737,
    "text": " Okay, that's all for today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.057,
    "end": 3203.838,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.159,
    "end": 3206.401,
    "text": "So these are the main differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.421,
    "end": 3210.145,
    "text": "I added these to today's abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.606,
    "end": 3215.692,
    "text": "So if you are interested in, please take a look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.452,
    "end": 3217.433,
    "text": "Okay, thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.916,
    "end": 3220.337,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3220.737,
    "end": 3221.438,
    "text": "Thank you for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3221.618,
    "end": 3222.9,
    "text": "Lots in the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.94,
    "end": 3229.487,
    "text": "Okay, I'll ask a few questions I wrote down and read some questions from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.653,
    "end": 3243.596,
    "text": " So what is the relationship between convergence amongst agents in their symbolic representation and, for example, cooperative social behavior or novel research?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3244.237,
    "end": 3256.757,
    "text": "Like what else needs to come into play beyond just symbolic representation conformity to get learning, novelty, pro-social activity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.184,
    "end": 3283.15,
    "text": " or is this or is the symbol representation do that work by itself okay uh could you copy and paste copy it to the chat and uh yeah yeah so it does a bit difficult to remember okay could you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.72,
    "end": 3317.22,
    "text": " okay what is the relationship between convergence of symbolic representation and narrative coherent corporate social behavior novel research okay that's a very important point interesting and important point and actually the maybe the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.858,
    "end": 3322.123,
    "text": " So the answer is not a single one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.004,
    "end": 3332.256,
    "text": "So for example, regarding the cooperative social behavior, let me take the cooperative social behavior first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.477,
    "end": 3346.954,
    "text": "So in cooperative social behavior, we need, and if we play a cooperative social behavior using language,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.947,
    "end": 3356.577,
    "text": " So we need some sort of convergence to let the counterpart understand my intention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.218,
    "end": 3369.072,
    "text": "So actually, such kind of, how to say, convergence of symbolic representation, symbolic external symbol system, allow us to collaborate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3370.634,
    "end": 3373.397,
    "text": "But before that, we need to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.086,
    "end": 3379.274,
    "text": " construct, form the symbolic system, simple system, like language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.416,
    "end": 3384.522,
    "text": "This itself is a kind of social cooperation, cooperative behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.484,
    "end": 3401.95,
    "text": "So for example, Michael Tomasello, who is a very famous, I would say, linguist and developmental scientist, he put much emphasis on cooperative behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3402.352,
    "end": 3406.138,
    "text": " as a kind of origin of language learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.158,
    "end": 3418.336,
    "text": "And interestingly, from the viewpoint of CPC, kind of the cooperative behavior is treated as a kind of very much innate stuff, innate like stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.356,
    "end": 3425.727,
    "text": "So can I go back to the... Okay, let me go back to the Metropolis-Hessing name game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.888,
    "end": 3431.295,
    "text": "So in our point of view, usually,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.782,
    "end": 3440.692,
    "text": " usually the, how to say, the previous approach, the conventional approach to emergent communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.553,
    "end": 3457.131,
    "text": "So forming the language is modeled as a part of kind of policy learning or something, the kind of explicit cooperation, have maximizing reward or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.972,
    "end": 3467.849,
    "text": " But here, we don't have any reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.869,
    "end": 3478.247,
    "text": "So basically, what we assured is the joint attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.267,
    "end": 3479.068,
    "text": "Joint attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.892,
    "end": 3498.035,
    "text": " And also, we assumed this rejection or acceptance that determine whether they accept or reject based on their own belief state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.336,
    "end": 3508.768,
    "text": "So as a result, the kind of shared language cooperatively shared or formed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.867,
    "end": 3513.676,
    "text": " So this is a kind of cooperative behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.696,
    "end": 3524.535,
    "text": "But it's not about the policy learning, but the kind of process of cooperative world modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3524.555,
    "end": 3529.103,
    "text": "So this is a very much different viewpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.353,
    "end": 3531.556,
    "text": " And this is the first point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3531.576,
    "end": 3539.067,
    "text": "So in other words, convergence of symbolic representation itself is a cooperative social behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.988,
    "end": 3541.771,
    "text": "So this is the first answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.652,
    "end": 3546.238,
    "text": "And the second answer is novel research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.818,
    "end": 3554.77,
    "text": "Maybe this is about the CPC-MS, collective predictive coding as the model of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.273,
    "end": 3577.899,
    "text": " And yes, so as you know, or as we understand, this is a kind of optimization process, but we, how to say, I think that most of us don't believe this process reaches actually the kind of convergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.019,
    "end": 3584.166,
    "text": "We are always struggling to minimize the free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.146,
    "end": 3610.423,
    "text": " and take actions you know so and the other kind of the you know the collective behavior cpc try to minimize the i said try to minimize the social level collectively energy and to that end the each researcher each research is like this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.078,
    "end": 3632.297,
    "text": " This looks like controlled by the scientific society, but they need to explore to obtain new data to update the simple system with new information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.218,
    "end": 3640.765,
    "text": "So this is corresponding to the novel research in our society, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.791,
    "end": 3643.4,
    "text": " OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.507,
    "end": 3646.941,
    "text": "That's the answer from my side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.562,
    "end": 3673.992,
    "text": " thank you yeah i really like this image it's like humans as the blanket or the interface between a disembodied symbolic system and a world that evades symbolic description alone um okay i'll ask another question and then i'll look for questions in the live chat and i put it in the chat so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.972,
    "end": 3685.885,
    "text": " You brought up this dual view of neural plasticity in terms of our learning and symbolic plasticity in terms of the development of symbol systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3686.626,
    "end": 3696.857,
    "text": "So with access to LLMs and computational semantics, how is human language changing or how might it change?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.065,
    "end": 3702.069,
    "text": " That's very much interesting topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.85,
    "end": 3711.603,
    "text": "And actually, that is a project I want to start, I want to launch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.444,
    "end": 3718.733,
    "text": "Actually, this is kind of a very new and interesting topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.814,
    "end": 3722.859,
    "text": "And I think, yeah, to be honest, I don't have answer now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.48,
    "end": 3728.768,
    "text": "But with the lens of CPC, I can say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.068,
    "end": 3736.916,
    "text": " I can have a discussion about this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.137,
    "end": 3743.262,
    "text": "Sorry, let me move to the generative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3743.362,
    "end": 3745.565,
    "text": "Okay, this one, this one, this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.585,
    "end": 3749.508,
    "text": "So, of course, the LLM will give us a huge impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.31,
    "end": 3759.058,
    "text": "But that also depends on in what way in the future we learn",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3759.545,
    "end": 3760.867,
    "text": " the LLM system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.447,
    "end": 3765.992,
    "text": "Actually, two years ago, the GPT-4 was launched.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3766.974,
    "end": 3771.259,
    "text": "And at that time, everybody started using the GPT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.379,
    "end": 3777.326,
    "text": "And everything, every linguistic phenomena on the internet is affected by a single LLM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.167,
    "end": 3787.257,
    "text": "But recently, the situation is changing, and the LLM becomes diversified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.355,
    "end": 3789.237,
    "text": " So the situation has changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3789.918,
    "end": 3800.751,
    "text": "But anyway, our communication, our language has been affected by the LLM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.771,
    "end": 3807.419,
    "text": "And the empirical evidence shows some effect has already shown some effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.08,
    "end": 3814.408,
    "text": "So the word choice has already been changed to some extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3814.76,
    "end": 3831.747,
    "text": " But, you know, the people tend to think LLM is something like an alien or something very much different from human, I'll say, human cognitive system, you know, humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.588,
    "end": 3836.194,
    "text": "But, you know, if the LLM",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.647,
    "end": 3844.537,
    "text": " based on the language generated by CPC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.498,
    "end": 3853.447,
    "text": "So basically, the distribution is very much a naturalistic one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.868,
    "end": 3860.196,
    "text": "We, humans, created the language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3860.796,
    "end": 3863.92,
    "text": "And maybe we can use this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3864.457,
    "end": 3870.83,
    "text": " So behind the LLM, there are so many humans, people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.752,
    "end": 3878.365,
    "text": "So just let the LLM summarize the information and give you an influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.02,
    "end": 3890.392,
    "text": " So actually, there is similar to what was happening in the past like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.013,
    "end": 3904.487,
    "text": "So language system was, we shared, our way of speaking, way of writing is affected by some, you know, some, how to say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3904.467,
    "end": 3906.571,
    "text": " the shared symbol system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.591,
    "end": 3911.74,
    "text": "Of course, the distribution of nature has become very much different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3912.742,
    "end": 3919.434,
    "text": "So maybe that leads us to a different way of language use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3920.336,
    "end": 3925.345,
    "text": "But yes, and I think that I would say that we cannot",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.898,
    "end": 3954.252,
    "text": " uh we i think we cannot determine or this is the future or something but uh we can discuss the i'll say uh the future you know uh the future changes based on using the model of uh cpc you know model of symbol emergence you know the the if we can model the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.805,
    "end": 3975.548,
    "text": " how to say background of llm so that may enrich our discussion so maybe next year or next next year i will have a three other answer i don't know thank you very much all right all",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.658,
    "end": 3977.579,
    "text": " Read the next question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3977.839,
    "end": 3987.772,
    "text": "ML Don wrote, In the collective predictive coding hypothesis paper, the generative model does not seem to have any mechanism to capture the dynamics of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3988.473,
    "end": 3994.019,
    "text": "This is surprising since the paper keeps referring to the dynamic nature of the world repeatedly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.76,
    "end": 4002.93,
    "text": "If my observation is correct, may I suggest to add, at the very least, x as well as dx dt to the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.111,
    "end": 4006.615,
    "text": "This can help immensely when the world is truly dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4006.595,
    "end": 4016.687,
    "text": " So yeah, how did any of these papers deal with potential change through time of the referent or of the semiosis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4018.693,
    "end": 4019.676,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.892,
    "end": 4049.275,
    "text": " and no objection no defense and i totally agree with you and uh actually so when i when i when i uh proposed the metropolis hashing's name game and uh actually uh uh cpc so we didn't yes the as a first as the first step we didn't involve the temporal nature and dynamic nature",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4049.795,
    "end": 4053.801,
    "text": " And it was a kind of a strategic one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4054.782,
    "end": 4075.031,
    "text": "And we wanted to focus on this part, connecting the collective learning or symbol emergence process at the group level and the representation learning in the individual level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4075.853,
    "end": 4078.857,
    "text": "And also, we have been conducting research",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.157,
    "end": 4108.624,
    "text": " on the world modeling and predictable learning like stuff and so the actually we thought that i thought that we can extend we can involve the dynamic nature after that and actually that we wrote uh and we wrote the some papers about the kind of the uh say the the merchant the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.958,
    "end": 4122.895,
    "text": " the collective predictive learning-based approach, coding-based approach, based the multi-agent reinforcement learning with imagined communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4123.436,
    "end": 4133.869,
    "text": "And also, we haven't published that, but our students are now working on the world model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4134.271,
    "end": 4140.88,
    "text": " based world, how to say, emergent communication based on world model, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.461,
    "end": 4146.328,
    "text": "And of course, how to say, we haven't invented that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.808,
    "end": 4157.683,
    "text": "But yes, we want to, how to say, reformulate this kind of process based on dynamical systems-based approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.084,
    "end": 4163.451,
    "text": "And yeah, we had a discussion over that with our collaborator,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.785,
    "end": 4184.899,
    "text": " and friends that yes that i think so such if you if you are somebody some great researchers add such kind of aspect to this this kind of cpc like idea that was hugely that is very great and that's actually also why",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.879,
    "end": 4205.487,
    "text": " uh we i i wanted to have said join this live stream you know so in the active influence community there are so many great researchers who uh i think who can add the another value uh or another well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4206.142,
    "end": 4218.2,
    "text": " nice idea, nice formulation to this kind of research preaching, collective behavior, and individual learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.861,
    "end": 4220.844,
    "text": "So, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.324,
    "end": 4223.067,
    "text": "Thank you very much for your comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4225.771,
    "end": 4226.412,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.838,
    "end": 4241.537,
    "text": " Um, sort of in closing, what are you looking forward to this year or how might people get involved beyond like reading the papers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.522,
    "end": 4245.183,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.764,
    "end": 4257.141,
    "text": "So, uh, last year, so after I got the inspiration of CBC, I rushed, we rushed to write several papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.475,
    "end": 4264.644,
    "text": " And I wanted to share this idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4264.784,
    "end": 4277.86,
    "text": "And I think that this will be a kind of a stream of how the following streams of research is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.88,
    "end": 4281.525,
    "text": "And in Japan, I have now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.978,
    "end": 4287.063,
    "text": " many collaborators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.723,
    "end": 4310.685,
    "text": "But if you think this is an interesting aspect, but it's insufficient, please, please add another value or another contribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4311.104,
    "end": 4317.356,
    "text": " to the research community and active influence community as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.416,
    "end": 4324.489,
    "text": "And actually the last year and the year before last, I really wanted to join the IW",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4324.756,
    "end": 4329.523,
    "text": " AI in the workshop on active influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4330.204,
    "end": 4336.473,
    "text": "And yes, my friend Tetsuya Ogata was a keynote speaker last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.513,
    "end": 4344.304,
    "text": "Actually, because of some university's job or something, I couldn't attend the meeting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4344.365,
    "end": 4347.008,
    "text": "This year, I really want to join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.329,
    "end": 4353.598,
    "text": "But if I miss, my collaborator or my students will join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4354.169,
    "end": 4368.133,
    "text": " I hope we can have a fruitful collaboration or discussion in the venue and not only in person but also online as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.155,
    "end": 4376.127,
    "text": "I welcome any messages or any tweets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.292,
    "end": 4405.675,
    "text": " to and i'm the kind of the long-term twitter or x user and yes and please keep in touch thank you very much thank you it was an awesome presentation i hope people in the community read these papers and start to build and work with them so i hope to keep in touch and see you again thank you very much",
    "speaker": "SPEAKER_01"
  }
]