[
  {
    "start": 14.82,
    "end": 36.514,
    "text": " hello and welcome to the active inference lab this is active inference live stream number 19.2 on april 13 2021 so welcome everyone and thank you for joining we are the active inference lab we are a participatory online lab that is communicating learning and practicing active inference",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 37.844,
    "end": 40.969,
    "text": " You can find us at the links that are listed here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 41.971,
    "end": 44.015,
    "text": "This is recorded in an archived live stream.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 44.315,
    "end": 48.021,
    "text": "So please provide us with feedback so that we can be improving on our work.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 49.332,
    "end": 55.575,
    "text": " All backgrounds and perspectives are welcome here and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 56.916,
    "end": 68.943,
    "text": "Today we're in the follow-up discussion 19.2, our third discussion following on the .0 contextualizing video and the .1 first discussion last week with Casper and everyone else.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 69.523,
    "end": 74.966,
    "text": "And so today in 19.2, we're gonna be continuing this discussion on deeply felt affect",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 75.526,
    "end": 82.248,
    "text": " hearing some slides from Casper, bringing up some of these questions that we're having about implications and other topics.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 83.728,
    "end": 93.011,
    "text": "So really the goal is just to learn and discuss, and we'll be going through whatever we need to, and next week and beyond, we'll be discussing different papers.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 94.164,
    "end": 105.177,
    "text": " So let's just do a quick round of introduction and then we can see and hear what Casper has brought to share with us today.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 105.818,
    "end": 107.58,
    "text": "So I'll start, I'm Daniel.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 108.021,
    "end": 112.066,
    "text": "I'm a postdoc in California and I'll pass it to Scott.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 115.077,
    "end": 115.517,
    "text": " Hi there, folks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 115.737,
    "end": 116.717,
    "text": "I'm Scott David.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 116.937,
    "end": 125.859,
    "text": "I'm the director of the Information Risk and Synthetic Intelligence Research Initiative at the University of Washington Applied Physics Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 126.519,
    "end": 128.14,
    "text": "And I'll transfer it to Alex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 131.54,
    "end": 131.84,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.101,
    "end": 133.581,
    "text": "I'm Alex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.841,
    "end": 138.282,
    "text": "I'm a researcher in Systems Management School in Moscow, Russia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 139.002,
    "end": 140.162,
    "text": "And I pass it to Blu.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.595,
    "end": 144.135,
    "text": " Good morning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.155,
    "end": 145.216,
    "text": "I am Blue Knight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 145.436,
    "end": 151.38,
    "text": "I'm an independent research consultant based out of New Mexico, and I will pass it to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.301,
    "end": 153.961,
    "text": "Hi, I'm Dean.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 154.562,
    "end": 159.445,
    "text": "I'm up here in Calgary, Canada, retired, trying to keep up with all this active influence stuff.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 160.025,
    "end": 161.086,
    "text": "And I'll pass it to Stephen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 162.813,
    "end": 163.553,
    "text": " Hello, I'm Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.593,
    "end": 164.554,
    "text": "I'm in Toronto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.574,
    "end": 166.935,
    "text": "I'm just working on a practice-based PhD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.535,
    "end": 175.54,
    "text": "I do a lot of work with participatory theatre and social topographies for exploring community development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.42,
    "end": 179.862,
    "text": "And I'll pass it over to, I think it's now Kasper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.922,
    "end": 180.342,
    "text": "Is that right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.883,
    "end": 182.763,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 183.204,
    "end": 184.404,
    "text": "So my name is Kasper Hesp.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 185.725,
    "end": 189.387,
    "text": "I'm a PhD student at the University of Amsterdam, focusing on",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 190.126,
    "end": 196.487,
    "text": " and the emergence of social cognition in development and evolution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 198.988,
    "end": 204.589,
    "text": "And today I will be continuing, as Daniel said, from last time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 204.629,
    "end": 211.971,
    "text": "So I'll be mostly assuming that you've already listened to that livestream as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 212.831,
    "end": 216.552,
    "text": "But just for everybody's sanity,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 217.369,
    "end": 221.45,
    "text": " I'll give a short intro on what we've been discussing so far.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 223.391,
    "end": 245.578,
    "text": "And just to describe the context of this research, when I started this particular topic, Deeply Felt Affects, for this paper, I was in the process of setting up the topic of my PhD research and focusing on social cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 246.445,
    "end": 250.628,
    "text": " But then in doing that, I realized that we were seriously lacking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 251.369,
    "end": 261.497,
    "text": "There were serious gaps in the literature on how we actually connect from our bodily existence to an abstract social world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 262.057,
    "end": 272.065,
    "text": "Our expectations about our social world shape the way we feel physically and how that recursively shapes the way we think about our social environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 273.703,
    "end": 282.485,
    "text": " And that's where I actually got into this kind of, well, you could call it a rabbit hole, of affect and emotions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 282.825,
    "end": 300.69,
    "text": "Because I think that affect is basically the kind of, through emotions is what links the social world, the abstract social relations that we are expert at, innately, you could say even, to a large extent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 301.22,
    "end": 320.294,
    "text": " If you look at the efficiency with which children in elementary school kind of track each other's popularity and whether they're part of the group or not, and this kind of, I mean, of course, we're not making, I don't like the dichotomy of nature and nurture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 320.714,
    "end": 322.215,
    "text": "It's an emergent system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 322.476,
    "end": 324.237,
    "text": "It's like there's an interaction going on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 326.67,
    "end": 342.963,
    "text": " You can say that one of the things we teach each other to do and that our system is kind of prepared to do to a large degree is to track events happening in our social environments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 343.243,
    "end": 352.51,
    "text": "And from an evolutionary perspective, that's a very logical thing to do because for hundreds of thousands of years, you could say each of our...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 354.73,
    "end": 363.036,
    "text": " Our survival would be entirely dependent on our capacity to be part of the group, so to speak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 363.336,
    "end": 365.617,
    "text": "Our capacity to function in a group context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 366.438,
    "end": 368.579,
    "text": "Not just on the individual level, but also on the group level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 368.839,
    "end": 383.029,
    "text": "So our ability to survive as a species depends on our capacity to coordinate and distribute tasks and specialize in different directions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 384.746,
    "end": 390.49,
    "text": " in the very same way, shaping and basically forming a body at a higher level of organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 391.291,
    "end": 403.499,
    "text": "And just like the cells in our bodies are differentiated in different directions, we as humans have to differentiate ourselves to form one large functioning body.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 404.18,
    "end": 408.843,
    "text": "And you think like, what does this have to do with the paper?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 408.883,
    "end": 411.905,
    "text": "Well, essentially,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 413.891,
    "end": 429.964,
    "text": " The idea is that the affective states, as we talked about them last time in terms of kind of subjective fitness, we focus largely on the affective states of a single agent doing some task in like a teammates.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 432.042,
    "end": 435.124,
    "text": " But today we'll kind of move towards steps beyond that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 436.545,
    "end": 447.13,
    "text": "And in particular, the way in which tracking the effective states of others in the body, so to speak, in the unit of organization as a group.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 448.911,
    "end": 462.621,
    "text": " how that tracking can allow you to find your place in the body, just completely analogous to the way in which cells track each other's stress signals in the body.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 463.782,
    "end": 464.843,
    "text": "So the pain...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 467.045,
    "end": 478.655,
    "text": " Basically, our capacity to empathize with others would be very similar to the way in which cells respond to each other's stress signals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 478.975,
    "end": 479.575,
    "text": "Yeah, Stephen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 481.277,
    "end": 495.489,
    "text": "I'd just be curious to know, in your sort of journey, often affect is tied to sensory feelings, you know, at the kind of personal level, and sort of so that it becomes a kind of a macro-social experience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.485,
    "end": 497.307,
    "text": " sort of measure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.447,
    "end": 499.671,
    "text": "Was that something that you already had in mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 499.952,
    "end": 505.844,
    "text": "Or is that something that sort of evolved as you were exploring this, these questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.116,
    "end": 525.762,
    "text": " Yeah, I was essentially interested in that connection between the very strong like experiential aspects of affects, like when you feel embarrassed, you're literally getting you can get a red face basically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 525.782,
    "end": 530.484,
    "text": "So it's like a very much an embodied aspect of that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 532.085,
    "end": 540.692,
    "text": " And somehow you're able to connect that to, let's say, your beliefs about how other people are perceiving you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 541.693,
    "end": 560.487,
    "text": "So that connection between the bodily states and those abstract beliefs about social environments is something that has kind of driven this effort.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 560.587,
    "end": 560.808,
    "text": "Scott?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 562.66,
    "end": 574.81,
    "text": " One thing that's fascinating to me is that the notion that there might be multiple levels of that harmonic coupling, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 574.911,
    "end": 585.62,
    "text": "And multiple pathways so that the dynamics of it, it's certainly, you know, it's everything, every relationship and interaction is describable potentially as a binary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 586.44,
    "end": 588.382,
    "text": "And then you can elaborate on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.062,
    "end": 589.262,
    "text": " right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.302,
    "end": 599.87,
    "text": "And so there's all sorts of nested affordances that have direct and indirect qualities to informing those interactions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 600.591,
    "end": 609.718,
    "text": "And so that picking apart and disambiguating the general relationship is fascinating, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 610.138,
    "end": 618.225,
    "text": "And it feels like just anticipating the surprises that active inference continuously brings us, that there's going to be a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 619.711,
    "end": 644.051,
    "text": " guess i would not just say a scale independence but also a local independence to some aspects of it so what i mean by that is there'll be analytical interoperability i would expect more broadly than we might get with other analytical framings simply by nature of the manner in which active inference approaches the questions of relationship",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 644.898,
    "end": 662.462,
    "text": " So what I guess I'm saying in that is I think it may be possible, and this is my years as a lawyer, it may be possible to insert rhetorical, artificial, or let me use the word synthetic instead, linkages in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 662.502,
    "end": 670.503,
    "text": "And that's something I'd be very interested in understanding what your thoughts are and how we can, you know, we assert them into being, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 670.583,
    "end": 674.404,
    "text": "And so describing them, if it's efficacious to describe them in a certain way,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 675.137,
    "end": 698.702,
    "text": " then they become adopted those things don't exist in nature until we describe them so we have an opportunity now to describe and disambiguate these things in a way that i'll use the it's like tempering with the buck and the well-tempered clavier we get to decide on the notes or like when they decided on 360 degrees in a circle because it divides well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 699.597,
    "end": 703.241,
    "text": " I think that was the reason the Phoenicians or whoever did that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 704.062,
    "end": 712.13,
    "text": "So here we get to maybe get to decide without doing an injustice to reality on how to parse the truth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 712.674,
    "end": 731.576,
    "text": " linkages anyway it's it's exciting because i love the way you you introduce that possibility of starting to pick apart those things and call and name them in a way that starts to do like david bohm stuff where every reality is first a thought and here we're having the thought so thank you for inviting us into that space it's fantastic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 732.895,
    "end": 733.175,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 733.435,
    "end": 733.995,
    "text": "Thanks for joining.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 736.216,
    "end": 738.217,
    "text": "We'll get more into that in a second.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 738.237,
    "end": 753.603,
    "text": "But I read it like it's kind of refers back to what I talked about last time in terms of compositionality or the kind of Lego box in the sense that yeah, this abstract relationships can be applied on different levels of organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 754.404,
    "end": 759.746,
    "text": "And that gives you a freedom in the sense that if you're able",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 761.181,
    "end": 767.692,
    "text": " to capture these relationships and the way they talk to each other on the different levels of description.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 769.675,
    "end": 770.737,
    "text": "That's really essential.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 770.877,
    "end": 774.083,
    "text": "I think also Blue was putting up her hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 776.178,
    "end": 781.2,
    "text": " So I'm anxious to see how this model unfolds in tracking others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.68,
    "end": 791.985,
    "text": "I think that that's a great way to add an extra layer, but I wanted to kind of ask first about the model as we discussed it last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 792.185,
    "end": 793.686,
    "text": "It's just something I've been thinking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.606,
    "end": 802.09,
    "text": " we talked about how surprise is related to like negative affect, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.49,
    "end": 811.334,
    "text": "So like, you know, whenever your prediction doesn't track that that's the negative affect or that's the, as opposed to the positive valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.534,
    "end": 812.915,
    "text": "And so I just was wondering, like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.1,
    "end": 817.483,
    "text": " Do we ever leave room for pleasant surprises?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.583,
    "end": 823.607,
    "text": "Like, you know, if I don't go food shopping, I don't expect there to be a chocolate cake in my fridge, but I come home and I find a chocolate cake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.627,
    "end": 824.668,
    "text": "I'm like, this is awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.128,
    "end": 830.492,
    "text": "So is there room for that or is it like incongruent or how do you resolve that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.533,
    "end": 838.578,
    "text": "Yeah, in fact, it's a necessity that comes out of the fact that we talked about last time that the effective charge only",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 840.586,
    "end": 843.727,
    "text": " emerges when there is a difference between the prior and the posterior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 844.207,
    "end": 847.809,
    "text": "So like you can be pleasantly, you can be positively surprised.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 847.989,
    "end": 850.03,
    "text": "Your predictions can be better than expected.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 850.95,
    "end": 851.63,
    "text": "Essentially so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 852.171,
    "end": 856.592,
    "text": "Or let's say reality can be closer to your preferences than you thought it was.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 859.674,
    "end": 860.554,
    "text": "Or like further away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 860.936,
    "end": 879.874,
    "text": " let's say, so pleasant surprise is when you get a nice present from your loved ones or something, but then basically there's like a kind of surprise in the sense that there is a certain preference being met that you hadn't anticipated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 881.46,
    "end": 881.6,
    "text": " Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 881.62,
    "end": 882.32,
    "text": "It's like, thanks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 882.42,
    "end": 883.301,
    "text": "Thanks for the gift card.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 883.501,
    "end": 884.001,
    "text": "Oh, wow.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 884.181,
    "end": 885.502,
    "text": "It's so much.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 885.562,
    "end": 891.524,
    "text": "It's like another surprise after you renormalized it to the fact that you were receiving a gift, you made an expectation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 891.544,
    "end": 894.085,
    "text": "Oh, maybe it'll be $20 and then it's more.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 896.681,
    "end": 911.249,
    "text": " I mean, there's that aspect and then there's also purely on the information processing level, so to speak, when you're listening to music or some kind of something that's aesthetically pleasing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 913.23,
    "end": 924.877,
    "text": "There's often these kind of stimulation have some patterns that have inherent predictability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 925.694,
    "end": 929.177,
    "text": " So like there, you could say there can be surprisingly easy to resolve.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 931.719,
    "end": 936.202,
    "text": "So it usually starts with setting up some tension and then suddenly resolving that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 936.242,
    "end": 946.371,
    "text": "You can see that in many art forms, in storytelling, in jokes, telling jokes, you basically have to create the tension and then suddenly the punchline resolves that tension.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 947.331,
    "end": 954.017,
    "text": "And that's exactly the unsurprising, or sorry, the surprising part of that reduction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 954.941,
    "end": 983.147,
    "text": " in the free energy essentially but yeah that's a very good question i mean i think that's a very common misunderstanding also um that's uh yeah an understandable misunderstanding but that's because once you get to these hierarchical models things are often kind of get much more nuanced and you can't just say like surprise is always bad",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 985.81,
    "end": 994.732,
    "text": " but is surprised with respect to a particular generative model that specifies your ideal world, so to speak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 998.373,
    "end": 1002.854,
    "text": "That's what creates this negative effect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1005.275,
    "end": 1010.576,
    "text": "But then once you, on the meta level, start to create expectations about how close you are to this ideal,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1011.837,
    "end": 1017.56,
    "text": " Then once you get surprised on those expectations, it can be negative or positive section.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1018.18,
    "end": 1022.262,
    "text": "Um, anyway, so that's the long winded answer to your question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1023.383,
    "end": 1029.406,
    "text": "Let's have a question from Dave and then maybe Casper will go through anything you want to present.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1029.426,
    "end": 1033.168,
    "text": "Cause we could definitely just keep on peppering with questions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1033.268,
    "end": 1034.168,
    "text": "I totally feel it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1034.248,
    "end": 1036.189,
    "text": "So Dave, and then continue on.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1038.03,
    "end": 1038.531,
    "text": "Oh, you're muted.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1038.551,
    "end": 1041.032,
    "text": "Dave continue.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1042.29,
    "end": 1058.32,
    "text": " Apropos of Blue's question, some of the older researchers on affect, notably Sylvan Tompkins and Jaak Pongsepp, go into a lot of detail on the differentiation of the emotions and sensations and affects and drives and so on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1058.821,
    "end": 1065.025,
    "text": "One of the things that Tompkins did a lot on was the speed of change, very specifically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1065.886,
    "end": 1075.378,
    "text": " A rapid change in a sensation may have a very different effect from a slow change.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1076.016,
    "end": 1082.817,
    "text": " Also, that's reflected in the face and in what he considered inborn facial expressions underneath all the layers of acculturation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1083.317,
    "end": 1090.459,
    "text": "A rapid smile is sometimes directly contradictory to a slow smile.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1091.199,
    "end": 1093.939,
    "text": "A fast smile means, oh, you idiot.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1094.079,
    "end": 1097.44,
    "text": "A slow smile means, oh, you got it, too.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1097.46,
    "end": 1101.641,
    "text": "Very good point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1101.861,
    "end": 1104.001,
    "text": "I mean, there's indeed",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1104.935,
    "end": 1126.441,
    "text": " temporal dynamics they come into play are really really important as well and especially because these nested levels they tend the higher levels tend to be slower so for um feedback to trickle down let's say you need some time um so then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1128.138,
    "end": 1147.65,
    "text": " if it's a slower kind of moving change then your top down let's say priors can already adapt a little bit before the next step happens um i mean that's what you see in for example in music where to really make something give to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1149.218,
    "end": 1162.037,
    "text": " have an impact on the listener, you need to have some kind of temporal slowness to the piece where there's like an intro and like different stages to really kind of prepare your expectations, so to speak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1164.426,
    "end": 1167.287,
    "text": " Or actually, the joke example is also a good one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1167.327,
    "end": 1168.667,
    "text": "Some people are bad at telling jokes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1168.687,
    "end": 1175.649,
    "text": "They tell the punchline too early, whereas don't give the tension time to emerge, basically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1176.729,
    "end": 1182.93,
    "text": "Yes, Sarah actually just made a comment in the chat about how this model might be associated with humor.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1183.33,
    "end": 1186.811,
    "text": "And then can we think about humor in terms of surprise only?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1187.051,
    "end": 1193.713,
    "text": "Or how do we think about these complex layers of emotion, like catharsis, surprise at different layers of the model, like you had mentioned?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1195.899,
    "end": 1199.922,
    "text": " Yeah, I think humor, of course, many different levels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1201.443,
    "end": 1203.384,
    "text": "There's this really simple jokes, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1203.464,
    "end": 1206.566,
    "text": "It's like one question and then a surprising answer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1208.187,
    "end": 1213.59,
    "text": "Sometimes in lectures, I use this example like, how do you call somebody without a body and without a nose?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1218.713,
    "end": 1219.334,
    "text": "Nobody knows.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1222.173,
    "end": 1230.819,
    "text": " So there's like a really silly one, but it's kind of nice as an illustration because you can think basically the free energy is accuracy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1232.66,
    "end": 1234.942,
    "text": "Sorry, it's complexity minus accuracy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1235.462,
    "end": 1244.829,
    "text": "So when you get a question like that and you get two concepts without the body and without the nose and you try to find one unifying concept and it doesn't work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1246.294,
    "end": 1251.376,
    "text": " And then you get the answer, and the answer is both truthful, it's accurate, and it's like a reduction in complexity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1251.796,
    "end": 1254.957,
    "text": "So you get like a double bonus in this case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1256.777,
    "end": 1268.941,
    "text": "But that's an easy one, because the more interesting types of humor, I guess, emerge when you have like complex storylines, and there are certain, I don't know, like satire and all these kinds of things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1269.001,
    "end": 1274.683,
    "text": "So that's where it's not as easy to describe, but I think it's also possible if you had some kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1275.836,
    "end": 1301.207,
    "text": " generative model of the social environment and then certain things are kind of inappropriate and then certain things are so inappropriate that they become funny or something like that like uh yeah there's every country has those comedians i think that they're able to to walk that thin line of uh extremity and so there was another question i think um can we do one more question oh yeah",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1303.955,
    "end": 1326.224,
    "text": " Yes, Scott Scott you want to go for it a question so much is just on that on the measurement of the subtleties of the free energy There are books on rhetoric and I'm trying to find the title here, but it's specifically list dozens hundreds of techniques of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1327.59,
    "end": 1350.61,
    "text": " rhetoric like the juxtaposition of words in a sentence does one come before the other as priming or whatever a conceptual linking of multiple sentences paragraph structuring use of foreign languages French tends to indicate certain thing of style German tends to indicate accuracy whatever and so those notions of metrics from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1351.641,
    "end": 1354.022,
    "text": " There are things that can be observed so they can be measured.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.422,
    "end": 1367.309,
    "text": "So the metrics from the humanities, let's call it, linguistics, psychology, they are positioned and ready to dive in to inform those variables in that space, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1367.889,
    "end": 1370.811,
    "text": "And so that is the next interoperability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1371.011,
    "end": 1373.232,
    "text": "It's not going to be technical interoperability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1373.252,
    "end": 1374.252,
    "text": "We got plenty of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.433,
    "end": 1375.293,
    "text": "It's going to keep going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1376.496,
    "end": 1385.081,
    "text": " But what we have is this deluge of interactions as a result, the true exponential increase in interaction volumes because of fifth order effective Moore's law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1385.781,
    "end": 1390.744,
    "text": "And what we need is meaning now to be interoperable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1391.664,
    "end": 1399.228,
    "text": "And that's where we get to the drive here of the shared framings of rhetoric, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1399.768,
    "end": 1404.931,
    "text": "And so one other point, 100,000 years ago, we were one village in the horn of East Africa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1405.629,
    "end": 1407.33,
    "text": " We radiated out around the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1407.67,
    "end": 1413.014,
    "text": "We came up with different food, different language, different politics, different gods, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.515,
    "end": 1422.501,
    "text": "And now the internet brought us together for show and tell everyone's got everyone's work and active inference on each other, whether we know it or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1423.061,
    "end": 1429.606,
    "text": "And if we name it as such, it gives us a sandbox to play in at massive scales.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1429.706,
    "end": 1432.808,
    "text": "And I, so I love the way you're naturally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1432.868,
    "end": 1434.129,
    "text": "And I think appropriately you,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1434.597,
    "end": 1446.421,
    "text": " And not by analogy, but by direct application of the concepts, bringing in our behaviors that are beyond what are seen as base of Maslow's hierarchy of needs, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1446.521,
    "end": 1447.201,
    "text": "It's beautiful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1447.301,
    "end": 1448.522,
    "text": "You're doing beautiful work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1448.542,
    "end": 1450.802,
    "text": "So thank you for inviting us into the space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1450.842,
    "end": 1451.302,
    "text": "It's great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1452.383,
    "end": 1452.603,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1452.843,
    "end": 1454.683,
    "text": "Actually, that comes back in a sec.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1454.704,
    "end": 1461.046,
    "text": "Kind of needs, hierarchy of needs, or how to deal with that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1461.066,
    "end": 1461.346,
    "text": "So that's...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1463.228,
    "end": 1464.769,
    "text": " I did see one more question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1466.25,
    "end": 1470.252,
    "text": "Until we find a break time, we can, yeah, Dean, or you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1471.012,
    "end": 1472.813,
    "text": "Well, mine isn't really a question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1473.934,
    "end": 1486.58,
    "text": "In this, I'm curious whether or not, I have a question later, but what I wanted to find out was when you discuss implications, whether or not my question gets answered before I have to ask it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1487.54,
    "end": 1492.643,
    "text": " Because I think from an effective standpoint, that's the part that's going to get really interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1492.883,
    "end": 1499.407,
    "text": "So I just wanted to put that out there because I actually do have it written down because it's a long one, but I want to ask it yet.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1499.467,
    "end": 1510.754,
    "text": "I want to see whether or not in the implications that you're going to share with us, whether or not my expectations align with what you think we want to kind of find out more about.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1511.555,
    "end": 1511.615,
    "text": "Hmm."
  },
  {
    "start": 1512.785,
    "end": 1513.126,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1513.346,
    "end": 1520.256,
    "text": "Then I'll try my best to, I mean, it's impossible to be exhausted, but I will try my best.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1520.597,
    "end": 1521.498,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1522.42,
    "end": 1525.664,
    "text": "Actually, about the book, The Rhetoric of Style, of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1527.879,
    "end": 1531.041,
    "text": " There's actually another interesting example of this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1531.221,
    "end": 1540.345,
    "text": "It's like the art of movie directing, like choosing the shots and which shots are kind of cognitively fluent, so to speak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1540.485,
    "end": 1543.867,
    "text": "And if you're creating a horror movie, you do the exact opposite of that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1544.627,
    "end": 1554.291,
    "text": "And there are certain ways you can create anxiety or different kinds of emotions based on how you move the camera around and which parts you do and don't show.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1556.741,
    "end": 1560.264,
    "text": " I guess it's also a type of rhetoric with images.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.884,
    "end": 1571.191,
    "text": "And one reason I just, this book in particular, just advise that anyone take a look at this if they're looking at this, it has hundreds of different examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1571.251,
    "end": 1572.231,
    "text": "Each one's one page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1572.311,
    "end": 1577.314,
    "text": "It's like sentence construction, sentence basics, etymological things, tropes, blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1577.355,
    "end": 1578.055,
    "text": "It just goes on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.095,
    "end": 1579.956,
    "text": "It's like a checklist, but it's this thick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1580.897,
    "end": 1582.678,
    "text": "And so this is things to measure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1583.482,
    "end": 1607.351,
    "text": " for influencing other groups and so this is i really this is gene fawnstock f-a-h-n-e-s-t-o-c-k i really thought this one was a really helpful one from a checklist and systems approach because we're really doing processes here trying to anticipate those processes that we can make interoperable so good stuff um uh what was the title rhetoric or style someone's describing this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1609.184,
    "end": 1616.974,
    "text": " Rhetorical Style, the Uses of Language in Persuasion by Jean Faunstock, F-A-H-N-E-S-T-O-C-K.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1618.015,
    "end": 1627.587,
    "text": "And in fact, one of the things just we're doing in our program is we're trying to come up, we're not trying to come up with, coming up with metrics for business operating legal, technical, and social variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1628.59,
    "end": 1636.733,
    "text": " So we take technically feasible systems, like what we're talking about generally here, AI and others, and then test them for Bolt's reasonability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1637.133,
    "end": 1639.153,
    "text": "And the way we get there is just by rhetoric.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1640.294,
    "end": 1641.794,
    "text": "Because it's storytelling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1642.114,
    "end": 1642.995,
    "text": "It's folkways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.375,
    "end": 1644.675,
    "text": "They're just folkways for the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1645.155,
    "end": 1647.396,
    "text": "And that's why the active inference gives us that framing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1647.436,
    "end": 1654.938,
    "text": "It basically says, you tell us what your things are in your minds, you group, and we'll take them and synthesize them and feed them back to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1654.958,
    "end": 1656.979,
    "text": "And then you get to decide whether you like them or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1658.03,
    "end": 1660.072,
    "text": " And so it's just really an interactive element.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1662.735,
    "end": 1663.536,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1663.556,
    "end": 1664.757,
    "text": "You're really interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1665.077,
    "end": 1674.047,
    "text": "All right, so let me try and get to the actual slides that I was going to share.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1674.107,
    "end": 1677.15,
    "text": "But I'm sure we can find many of these slides.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1679.893,
    "end": 1680.233,
    "text": "Let's see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1680.772,
    "end": 1682.514,
    "text": " I'm going to share my screen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1682.795,
    "end": 1684.397,
    "text": "On the bottom left, the middle button.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1684.617,
    "end": 1691.085,
    "text": "And then I'll resize it so it can look however it looks on everybody's computer.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1691.165,
    "end": 1692.847,
    "text": "I'll make it look normal, so no worries about that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1696.631,
    "end": 1697.052,
    "text": "Looks good.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1699.194,
    "end": 1699.475,
    "text": "Yeah, OK.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1700.037,
    "end": 1714.38,
    "text": " So just to kind of recap a little bit, I mean, we already did that, but last time we were talking about this nested set of inferences, essentially, that happens or appears to happen, actually.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1714.54,
    "end": 1725.262,
    "text": "And pretty much to kind of hint at the instrumentalist discussion, I'm pretty much fine with being completely instrumentalist in the sense that I don't mind if it's",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1728.291,
    "end": 1732.832,
    "text": " As I said, I like to always say that all models are wrong, but some are useful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1733.052,
    "end": 1735.913,
    "text": "So I think this is a very useful way looking at it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1735.953,
    "end": 1736.913,
    "text": "So it's instrumental.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1738.514,
    "end": 1746.856,
    "text": "Whether it's true in a realist sense, I don't really care that much, I guess, in the end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1746.876,
    "end": 1753.098,
    "text": "But mostly because I just don't have a way to make that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1758.001,
    "end": 1777.996,
    "text": " claim um i'd say that there's no way to prove it i mean there's a way you can believe in it or something but um and you can say that you require some amount of evidence to believe in it but as long as it works i i guess um for most",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1779.361,
    "end": 1803.526,
    "text": " applications that I'm interested in or maybe all occasions doesn't really matter whether it's yeah what's what the philosopher thinks about whether it's real or not as long as it works so that's my I don't that's why I always say I don't have to talk in this fight but yeah just to recap a little bit",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1804.934,
    "end": 1810.638,
    "text": " Last time we talked a lot about valence, but there's also other types or dimensions of affect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1811.078,
    "end": 1830.171,
    "text": "And some of them are like, there are like three fundamental dimensions, like arousal being like kind of your activity level, your current amount of resources that your body is expending for",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1832.236,
    "end": 1838.881,
    "text": " the current task at hand or current context and power control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1839.602,
    "end": 1848.209,
    "text": "So the perception of agency, you can say, whether you are in control of the situation or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1848.829,
    "end": 1851.191,
    "text": "It's not exactly the same as valence in a sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1851.351,
    "end": 1861.139,
    "text": "Last time we talked a lot about control as well, but you can have a highly positive experience, let's say, if you're",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1863.354,
    "end": 1871.398,
    "text": " able to, if you trust that your needs are being met, even though you don't have control over them yourself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1872.799,
    "end": 1878.742,
    "text": "So there's these different dimensions that to some extent can correlate with each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1881.272,
    "end": 1904.657,
    "text": " and but don't always and you have another one something like approach and avoidance which is often related to valence but you can think of cases like anger where you have an uh or aggression you have an approach reaction but you're angry um you're so you have negative valence high arousal um and an approach response",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1905.555,
    "end": 1909.878,
    "text": " So there's these different dimensions that sometimes correlate, but not always.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1910.198,
    "end": 1918.743,
    "text": "And there are ways to, let's say, in very simplistic organisms, the dimensionality is very much reduced.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1923.137,
    "end": 1927.78,
    "text": " When you're, let's say, a baby, you start out with very simplistic dimensions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1928.061,
    "end": 1932.584,
    "text": "You feel content or you feel discomfort.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1933.144,
    "end": 1942.051,
    "text": "As you get older, you start to get more of this dimensionality starts to become more nuanced, so to speak, so to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1942.191,
    "end": 1951.618,
    "text": "And the way I'm relating this to take this one step further,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1953.968,
    "end": 1972.195,
    "text": " is to think about what this means for when we have internal generative models, what those generative models, what kind of influence they have on your affective state, your current affective state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1973.356,
    "end": 1977.357,
    "text": "And that's where it gets an interesting application in psychiatry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1978.498,
    "end": 1982.359,
    "text": "Because as we all know, there is a dark side",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1984.008,
    "end": 1996.551,
    "text": " to our imagination, and that is that imagination induced affect plays a role in all kinds of mental conditions and also just in everyday life.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1997.811,
    "end": 2011.854,
    "text": "So these are the extremities, of course, the psychiatric diagnostic categories, but everybody, I think, to some extent has experienced at least a few of these",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2013.703,
    "end": 2014.263,
    "text": " types of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2015.544,
    "end": 2031.653,
    "text": "Affects inducing thoughts and basically I can just run you quickly through them, but imagination of imagined threats and flashbacks to some bad experiences and PTSD cravings.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2031.733,
    "end": 2041.359,
    "text": "So that's like imagining obtaining of drugs that you have and that you're attached to, but can be also other types of addiction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2043.331,
    "end": 2060.708,
    "text": " OCD is obsessive compulsive disorder is a really, really strong example of people who basically, um, kind of, you could say they're, uh, the effective responses that they get when they have certain thoughts are",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2062.208,
    "end": 2083.613,
    "text": " reinforcing the thoughts so they are afraid of breaking their own rules and they they get this kind of dread of breaking them so there's like a cycle and this kind of cycle is very self-reinforcing cycles of affective states and that then guide the way your imagination works",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2085.413,
    "end": 2089.994,
    "text": " And then that triggers more effective responses in depression.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2090.074,
    "end": 2111.941,
    "text": "And actually, I mean, you can go on, I think almost, I haven't really found any disorder in psychiatric, like the DSM that doesn't really fall into this, except for perhaps the really more like physical problems, but those are often psychosomatic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2112.001,
    "end": 2114.562,
    "text": "So there's also a connection there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2116.553,
    "end": 2127.039,
    "text": " Anyway, so just as a very abstract analogy, we can construct a generative model to give this some flavor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2127.539,
    "end": 2129.54,
    "text": "It can be of some social environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2129.58,
    "end": 2132.382,
    "text": "Let's say you start in your four locations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2132.402,
    "end": 2139.946,
    "text": "You can make this as complex as you want, but just for the sake of the simulation that I'm going to be showing,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2141.026,
    "end": 2143.588,
    "text": " You can start neutral, so some safe space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2144.148,
    "end": 2149.711,
    "text": "There is a place that's safe, relatively safe, but you get only a small reward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2151.112,
    "end": 2154.674,
    "text": "There is a place that's a little bit risky, but you can get a higher reward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2155.394,
    "end": 2156.735,
    "text": "And why is it risky?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2156.875,
    "end": 2162.178,
    "text": "Well, because it has the probability of transitioning to this absorbing painful state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2162.198,
    "end": 2164.979,
    "text": "You can think of this as like...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2167.634,
    "end": 2171.277,
    "text": " Asking somebody out on a date, you have the risk of getting rejected.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2171.857,
    "end": 2181.804,
    "text": "Or as a hunter, hunting a big prey can be dangerous, can get hurt, can also do something safer, but you get a smaller reward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2181.824,
    "end": 2193.893,
    "text": "So there's many types of situations in the world where this kind of structure comes back, where the higher rewards are often associated with",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2194.605,
    "end": 2197.888,
    "text": " potential adverse events.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2199.549,
    "end": 2204.693,
    "text": "The problem with this type of state space is that it very quickly explodes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2204.834,
    "end": 2212.02,
    "text": "When you want to search into the future, the events as they unfold is something we call combinatorial explosion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2212.08,
    "end": 2213.821,
    "text": "But let's say you want to plan ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2214.302,
    "end": 2219.186,
    "text": "And for a few time steps, in this case, four time steps, you want to anticipate what's going to happen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2221.067,
    "end": 2221.788,
    "text": "Very quickly,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2224.127,
    "end": 2229.93,
    "text": " the number of possibilities just becomes hard to track.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2230.891,
    "end": 2250.582,
    "text": "And the types of generative models that I've been working on and Carl Fristen recently did a paper with me and Thomas Parr and Danijar Hafner developed a new, it was basically sophisticated inference, something I mentioned last time as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2252.236,
    "end": 2257.918,
    "text": " a way to do this kind of research without having the whole thing become computationally intractable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2259.638,
    "end": 2263.199,
    "text": "And I'm not really going into the technical details here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2263.94,
    "end": 2278.264,
    "text": "But essentially, the core idea is that instead of having the whole policy space, which is multiplicative, so you have, in this case, the policy space, if for each transition you have three options, here you have four.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2278.284,
    "end": 2281.865,
    "text": "So you get something to the order of four",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2282.81,
    "end": 2287.213,
    "text": " to the power of four, a little bit less in this case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2287.333,
    "end": 2295.019,
    "text": "But this is just for four to the power of three, just for three time steps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2295.399,
    "end": 2306.708,
    "text": "And of course, in reality, we often anticipate more steps into the future just without even thinking about it explicitly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2309.307,
    "end": 2323.771,
    "text": " So there needs to be a way to do this in a way that prevents overloading the system with anticipating too many possible outcomes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2324.971,
    "end": 2334.534,
    "text": "And what is interesting is that you can design a model in which the way you explore the future is guided by your affective states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2337.065,
    "end": 2351.177,
    "text": " And this is what I did for this simulation where you have this exploration of the future is itself an action model in a sense that you're experimenting internally with potential futures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2352.078,
    "end": 2359.424,
    "text": "And the way you basically travel through the decision tree is guided by this action model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2359.544,
    "end": 2362.387,
    "text": "And because it's an action model, it's guided by your affective state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2362.827,
    "end": 2363.608,
    "text": "And because it's",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2364.645,
    "end": 2374.713,
    "text": " And the way I've linked that in my research is by having this action model precision that we talk about in terms of the valence states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2376.555,
    "end": 2386.583,
    "text": "So what you get as an interesting example of what I simulated here is a model that can do over thinking and basically is something that you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2387.392,
    "end": 2393.601,
    "text": " may have come across when you discussed sophisticated affective inference a long time ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2394.282,
    "end": 2401.273,
    "text": "Essentially, this model, action model precision is guiding the way the tree search is performed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2404.042,
    "end": 2420.268,
    "text": " But then at some point this agent starts to imagine a little bit, yeah, some negative, uh, events and starts to, um, basically the precision starts to drop of that the way they explore in the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2420.428,
    "end": 2429.931,
    "text": "And they start, start to become more likely to, um, imagine negative outcomes because when the precision on their actual was high,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2430.967,
    "end": 2441.041,
    "text": " They basically have a confident kind of course of action in mind and where they would go and would automatically down-regulate unlikely negative events.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2441.361,
    "end": 2446.148,
    "text": "But once this precision started dropping, this agent started basically",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2447.04,
    "end": 2474.177,
    "text": " imagining these negative outcomes and that's made the precision drop even more and then this agent yeah you can see i kind of calculated in terms of the fraction of imagined events that were negative and negative outcomes call it like threat perception or something and and just an illustration of how you could simulate some process something like what we could call rumination um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2475.723,
    "end": 2481.426,
    "text": " or at least negative consequences produced by overthinking the situation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2481.866,
    "end": 2487.889,
    "text": "And that's interesting because it means that you actually can also model too much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2489.45,
    "end": 2495.072,
    "text": "You would think in machine learning that the longer you run your model, the better it gets.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2495.733,
    "end": 2500.335,
    "text": "But once you get this kind of recursive relationship, you can actually get a kind of breakdown in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2503.61,
    "end": 2508.014,
    "text": " in the way the future is imagined or anticipated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2509.335,
    "end": 2518.383,
    "text": "You bring this one step further, it can also, actually I have a picture here as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2520.805,
    "end": 2521.185,
    "text": "This one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2523.314,
    "end": 2537.322,
    "text": " So this is where something that looks a little bit like Maslow's hierarchy can come into play, especially when you start to make this with extra layers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2537.362,
    "end": 2551.531,
    "text": "But here I just connected this sophisticated affective inference to high-level states that in this case describe exhaustion, hunger,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2555.105,
    "end": 2560.267,
    "text": " And the point is, and that's something I also highlighted last time, didn't show them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2560.427,
    "end": 2577.352,
    "text": "So that's the more hungry you are, the more strongly you're driven by preferences for foods, the more exhausted you are, the more strongly you are driven to prevent expanding energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2578.553,
    "end": 2579.453,
    "text": "And valence is then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2580.051,
    "end": 2587.035,
    "text": " a kind of summary of how well you're able to manage all these different kinds of preferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2587.715,
    "end": 2608.386,
    "text": "And here I just show an example simulation where you have these three different high-level states and they're kind of, yeah, failings, sorry, exhaustion and hunger are kind of competing in a sense because the agent needs to get food.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2608.446,
    "end": 2609.687,
    "text": "They need to expend energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2612.09,
    "end": 2622.753,
    "text": " But yeah, while they're at home resting, their hunger increases, the energy levels, yeah, the exhaustion decreases.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2622.993,
    "end": 2630.756,
    "text": "So there's this kind of cycle, cyclical behavior where, yeah, if you follow, it's kind of interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2630.796,
    "end": 2637.978,
    "text": "You see that there's hunger is in this case a very strong driver of negative effects.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2638.038,
    "end": 2639.578,
    "text": "You see that whenever hunger is high,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2641.704,
    "end": 2653.091,
    "text": " And the best situations are in this kind of cases where you see that both of them are low at the same time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2653.251,
    "end": 2659.214,
    "text": "So they're basically not hungry and not exhausted either.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2660.735,
    "end": 2663.437,
    "text": "I mean, there's different kinds of balances you can implement here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2663.477,
    "end": 2665.558,
    "text": "And this is, in that sense, just an illustration.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2666.299,
    "end": 2667.98,
    "text": "But you can already think of ways in which",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2669.299,
    "end": 2689.704,
    "text": " This also relates to things like depression, for example, where these people with depression would often report, or that have experienced depression, would report that they have a lack of interest, a reduced appetite.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2690.744,
    "end": 2697.266,
    "text": "Because if you're really exhausted, that means that you have a strong preference against expanding energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2698.28,
    "end": 2717.41,
    "text": " And that means that you can't anticipate the pleasure of eating anymore and you can't even experience it because you have this extreme and exhaustion or, um, in this case, the express, yeah, the depression states will be associated with, um, experience of lack of energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2717.43,
    "end": 2726.014,
    "text": "Um, I mean, this is like a, an example of, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2727.045,
    "end": 2738.687,
    "text": " how different kinds of phenomena that we know from psychiatric conditions actually emerge once you start to construct these types of models in detail.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2738.927,
    "end": 2739.727,
    "text": "Let's see if I can.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2742.188,
    "end": 2743.648,
    "text": "So there is this aspect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2745.749,
    "end": 2748.049,
    "text": "So this is kind of on the individual level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2748.089,
    "end": 2753.19,
    "text": "And as I said, I wanted to share with you how this works when you start to think about multiple",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2754.861,
    "end": 2760.363,
    "text": " Um, unless there are any questions, um, I'll just continue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2761.144,
    "end": 2763.684,
    "text": "Um, you can hit, um, hide on that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2763.985,
    "end": 2766.045,
    "text": "Stop sharing thing to move it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2766.185,
    "end": 2769.067,
    "text": "And then I think let's have Dean and then Steven.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2769.567,
    "end": 2770.427,
    "text": "So Dean go for it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2772.348,
    "end": 2772.528,
    "text": "Well,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2774.056,
    "end": 2775.056,
    "text": " Boing, bing, bing, bing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2776.137,
    "end": 2778.738,
    "text": "My question fits perfectly with what you just talked about.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2778.918,
    "end": 2789.663,
    "text": "So essentially, comparing a T-search to a tree search, which I think of as natural order, and your slide about combinational explosion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2789.763,
    "end": 2794.264,
    "text": "My question was, in simple likelihood mapping, the binary is what it is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2794.304,
    "end": 2800.067,
    "text": "The explorer action is limited in answering what is good and what is bad on some version of valence continuum.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2801.862,
    "end": 2806.275,
    "text": " Past that, one wonders about what happens when trade-offs become trade-ins.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2807.674,
    "end": 2813.118,
    "text": " This would add a layer of complexity by keeping what is good, what is bad, and adding what if to the mix.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2813.739,
    "end": 2819.523,
    "text": "In the team A's example, there would be a third option, trapdoor, with optioning as function being the key.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2819.563,
    "end": 2830.492,
    "text": "That third door would contain, say, four times reward and two times pain, so not enough to cause permanent consequence, but still exponential relative to the queued outcome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2831.293,
    "end": 2836.437,
    "text": "There'd be no queue to this option, only the barrier that is either charged or not is transparent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2837.037,
    "end": 2860.983,
    "text": " you can see the reward, you can see the lightning bolt signaling that the barrier could be charged based on what if, which extends the epistemic and specific of the simplified likelihood mapping to now include distribution, which is third possibility and perception sensing, which is the potential shock just as part of a 4x result.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2861.063,
    "end": 2864.164,
    "text": "Do you think effective charge remains continuous",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2865.0,
    "end": 2867.541,
    "text": " in terms of the path to renewed confidence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2869.001,
    "end": 2875.082,
    "text": "I know that's a really long thing, but essentially, I thought this was the direction you might go with this work.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2875.562,
    "end": 2886.864,
    "text": "And as it turned out, way to go, because this is exactly the kind of question when you have a learner who's thrown into a novel context, they don't tend to only have a binary choice.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2887.805,
    "end": 2889.865,
    "text": "So how do we model for it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2890.065,
    "end": 2893.326,
    "text": "Because we want this to apply in real situations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2895.267,
    "end": 2909.555,
    "text": " clap clap that's perfect thanks I mean the continuous versus discrete state space problem is pretty universal yeah I think the way",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2910.333,
    "end": 2921.923,
    "text": " Our minds tend to deal with it by coarse-graining it first in categories, and then later on when you're locally in the situation, you end up sorting out the details on the continuous level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2922.424,
    "end": 2924.605,
    "text": "Exactly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2925.546,
    "end": 2932.893,
    "text": "I kind of ignored the continuous state-space story here, just for the sake of the simulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2933.663,
    "end": 2945.012,
    "text": " But what's nice is when you start to look at the parameters, actually, you do get the continuous, or the way the variables vary over the course of simulation, you get the continuous part back.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2947.915,
    "end": 2949.176,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2949.436,
    "end": 2953.98,
    "text": "And also, Dean, in that, I saw you're approaching a T-turn.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2954.2,
    "end": 2961.926,
    "text": "It's a discrete choice in the moment, but when you pull back and when you include what if, it almost makes continuous",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2962.807,
    "end": 2969.071,
    "text": " through the generative model of the learner, in this case, it makes that situation go from discrete to continuous.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2969.411,
    "end": 2972.253,
    "text": "And also when you're learning, you could rest or you could eat.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2972.774,
    "end": 2986.103,
    "text": "And so it's actually like our affect as learners, as we're optimally foraging, it really does need to be considered in an embodied sense, because at any point, when reading Casper's paper, we all could have thought, wow, we're a little tired.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2986.603,
    "end": 2991.747,
    "text": "And then that changes, that's a binary decision, but it's part of multiple overlapping continuums.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2992.507,
    "end": 2995.01,
    "text": " Yeah, it's reflect, reconcile, recover.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2996.132,
    "end": 2996.372,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2996.632,
    "end": 2997.614,
    "text": "So thanks for the question, Dean.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2997.994,
    "end": 3000.557,
    "text": "Stephen, go for the question and then anyone else.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3000.637,
    "end": 3001.779,
    "text": "And then if not, Casper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3002.904,
    "end": 3007.286,
    "text": " I'd just like to get your thoughts on how context comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.346,
    "end": 3012.948,
    "text": "I see that often we think about scaling, and it's very tempting to sort of, oh, this can scale in many ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.988,
    "end": 3018.171,
    "text": "But this almost speaks to this idea of, they talk about transcontextuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.571,
    "end": 3021.812,
    "text": "We need to think about different ways that we're in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.852,
    "end": 3030.116,
    "text": "And I think that the way that also ties in with the psychiatric challenges is that, like you say, the affect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.917,
    "end": 3060.218,
    "text": " starts to run away from itself so that unlike someone who maybe doesn't have that disorder and can recalibrate or reattune to the new environment someone with the disorder it's sort of like you say it runs away from itself but i'd be interested because one of the things with this work is it it puts the environment into this the potential treatment regime and it doesn't just make it all about the mind and the body so just context and and how that that that has an impact",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.382,
    "end": 3071.308,
    "text": " And yeah, so in this types of models, in this case, I simplified it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3071.689,
    "end": 3079.434,
    "text": "But as we remember from last time, this D, high level D would also include contextual states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3080.375,
    "end": 3085.358,
    "text": "And then those contextual states can be inferred based on other things like external cues.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3087.62,
    "end": 3090.642,
    "text": "So for example, me observing myself",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3092.589,
    "end": 3114.691,
    "text": " sitting at the dining table and smelling foods could trigger a kind of hunger state and then that increases my appetite basically or like increase my preference for eating food so there's there's actually yeah there's space to include um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3116.491,
    "end": 3142.087,
    "text": " just things like where the context determines the way your preferences are structured and or at least influences the way they're structured so and this has done interesting implications for things like um ptsd where people would get flashbacks when they're in a certain context that they associated with this experience for example or addiction as well it's like um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3143.55,
    "end": 3151.835,
    "text": " people on the first line of treatment in strong addictions as just take people out of their contexts so that these cravings aren't triggered.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3154.997,
    "end": 3159.62,
    "text": "And I think when you say transcontextuality, that's a really interesting word.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3159.961,
    "end": 3167.666,
    "text": "I guess what you mean is that you have a different version of you for every different context in a sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3169.068,
    "end": 3196.254,
    "text": " yeah and it's also it's it's that that that that piece and then they're talking about that a lot now with um developing um gregory bateson's work in terms of um looking at multiple contexts and warm data they're talking about warm data so data it's not just dead data but is alive in a way the sort of stuff we talk has affective content and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.094,
    "end": 3225.591,
    "text": " transcontextuality means if you want to understand different contexts and not just deal with them separately and interrelate them then there has to be some way that they're the living component of context is somehow held alive um yeah yeah this comes actually maybe that's a nice segue unless there are other questions that's a nice segue to the um culture part because um great yep go for it yeah okay um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.748,
    "end": 3256.959,
    "text": " Because the most stable part of our context, besides basic physical variables like temperature, et cetera, but our body temperature, for example, but once you move beyond that, one of the most stable components is other people in our environment and how we coordinate with them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3257.889,
    "end": 3282.501,
    "text": " um and it comes back to also some of the points that um were made on the rhetoric and story but just on the i i guess i kind of like to start bottom up so i just start with the way um the yeah the affected states translate um so shared effects",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3283.231,
    "end": 3284.652,
    "text": " and cultured emotions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3284.692,
    "end": 3289.675,
    "text": "So in this case, I construct a few generative models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3291.236,
    "end": 3296.579,
    "text": "I can have the ones that are associated with competition or with cooperation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3297.059,
    "end": 3298.28,
    "text": "And there are different kinds of models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3298.56,
    "end": 3305.744,
    "text": "And it would be, if I believe somebody is an opponent, then I have a certain expectation about what they prefer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3306.825,
    "end": 3310.547,
    "text": "If they're antagonistic, so in the sense that they prefer",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3311.934,
    "end": 3329.585,
    "text": " They like to observe that I don't I don't get any reward or they may be just competing in the sense that they just want to maximize their own game and different kinds of generative models I can have for the way other agents behave.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3329.605,
    "end": 3334.429,
    "text": "So that would be like the antagonistic and competitive versions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3335.789,
    "end": 3338.771,
    "text": "And then there's like cooperation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3340.984,
    "end": 3342.365,
    "text": " can also have different flavors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3342.385,
    "end": 3351.11,
    "text": "You can have agents who genuinely have preferences for maximizing your gain as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3352.111,
    "end": 3358.435,
    "text": "Or you can have agents who only cooperate just because it happens to maximize their gain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3361.337,
    "end": 3368.581,
    "text": "These kinds of preference factors is basically what you can infer based on how people behave and what kind of situations they want.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3370.177,
    "end": 3374.74,
    "text": " it's something like an altruist altruism versus egoism access.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3374.94,
    "end": 3384.986,
    "text": "Uh, you could think of it like that, but, and then beyond egoism, there is something like, um, uh, Machiavelli.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3385.046,
    "end": 3387.868,
    "text": "No, it's something like you want the other person to have less.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3387.908,
    "end": 3390.129,
    "text": "So that's something, I guess, even beyond egoism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3390.509,
    "end": 3398.934,
    "text": "Um, anyway, there's different kinds of, um, generative models that you can, uh, apply to make sense of the behavior of others.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3399.615,
    "end": 3399.675,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3400.646,
    "end": 3414.157,
    "text": " And just wanted to share with you a dynamic model that I made quite a long time ago, before actually I got into active inference modeling, per se.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3415.459,
    "end": 3417.64,
    "text": "And then it took a while to get it out and published.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3417.72,
    "end": 3419.042,
    "text": "But this is work from 2015.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3425.478,
    "end": 3430.681,
    "text": " And it was a pretty big challenge to get it published because people, yeah, it's like a dynamical model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3430.721,
    "end": 3438.587,
    "text": "It's not very easy to sell to just psychologists who are used to their t-tests and everything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3440.248,
    "end": 3447.052,
    "text": "But this model was about child play, or actually play can be any interaction between agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3447.252,
    "end": 3451.275,
    "text": "Actually, child play was more like the immediate application.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3453.137,
    "end": 3462.799,
    "text": " What is happening here is that every agent generates a decision, just a binary decision in this case, 0 and 1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3463.419,
    "end": 3467.54,
    "text": "As was mentioned before, you can often reduce it back to binaries.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3469.241,
    "end": 3470.741,
    "text": "And in this case, it's about playing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3471.041,
    "end": 3472.741,
    "text": "So are they playing together, yes or no?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3474.182,
    "end": 3480.323,
    "text": "If the agent tries to play with the other agent, then only if both of them are trying to do that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3480.962,
    "end": 3501.119,
    "text": " they have the emergent play outcome is playing together so there's a kind of conditionality embedded in their environment if one of them tries to play together and the other one doesn't then they then you get a zero outcome um since that they both end up being low this kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3503.601,
    "end": 3511.886,
    "text": " I built this dynamical model context, I built different self influences on the cell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3512.987,
    "end": 3516.369,
    "text": "This based on a motion theory by Nico, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3516.409,
    "end": 3527.617,
    "text": "I don't know if you've heard of him, he's kind of famous in the Netherlands, but motion theorists, but then kind of revamped for dynamical system theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3528.157,
    "end": 3532.36,
    "text": "And the basic idea is that you have these concerns that was also referred to as",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3533.473,
    "end": 3537.036,
    "text": " muscle pyramid.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3537.056,
    "end": 3547.304,
    "text": "And these concerns tend to drive behavior, but they also tend to drive or tend to generate appraisals in terms of whether your concerns are being met.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3548.364,
    "end": 3558.332,
    "text": "And that can trigger emotional expressions, which then influence the other person in the environment and vice versa, of course.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3558.352,
    "end": 3561.674,
    "text": "So that was something from previous work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3562.722,
    "end": 3571.785,
    "text": " But then I started to use this to translate it to Active Inference, essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3573.465,
    "end": 3574.786,
    "text": "It's pretty easy to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3574.826,
    "end": 3577.907,
    "text": "You can do this with almost any dynamical model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3578.807,
    "end": 3585.909,
    "text": "If you're interested in Active Inference, but you already are familiar with some other dynamical models, usually it's a pretty straightforward translation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3586.837,
    "end": 3590.22,
    "text": " just means that you're reinterpreting certain parts of the maths.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3591.44,
    "end": 3609.414,
    "text": "Sometimes it means that you're reorganizing certain equations, but often the core notions underlying the model, because I mean, most, yeah, the models are always, I mean, usually they're thought through quite carefully by scientists.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3609.454,
    "end": 3613.317,
    "text": "So I tend to think of every model as a potential,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3614.807,
    "end": 3621.211,
    "text": " Yeah, that has something of value that can be translated into this interpretive framework.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3623.152,
    "end": 3626.714,
    "text": "And here it's about what kind of preferences the agents have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3627.334,
    "end": 3630.676,
    "text": "And this is the lower level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3630.796,
    "end": 3631.796,
    "text": "So I make it fixed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3632.037,
    "end": 3634.558,
    "text": "They have preferences for being alone, being together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3634.578,
    "end": 3641.462,
    "text": "And then this parameter here would be something like a symmetry bias.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3642.332,
    "end": 3646.834,
    "text": " So there's a preference against doing something else than the other person.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3649.735,
    "end": 3652.436,
    "text": "It's more of an hypothesis, as I said before.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3652.456,
    "end": 3655.277,
    "text": "Every model is a parameterization is a hypothesis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3655.337,
    "end": 3658.019,
    "text": "It can be tested whether there's such a symmetry bias.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3659.699,
    "end": 3662.48,
    "text": "In practice, there does seem to be such a thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3663.381,
    "end": 3670.844,
    "text": "Anyway, just not to overwhelm you with numbers, but we can then make this hierarchical and let it play out over",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3674.038,
    "end": 3675.398,
    "text": " over time steps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3676.419,
    "end": 3681.94,
    "text": "And then this agent starts to be able to manage their concerns over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3682.32,
    "end": 3687.362,
    "text": "So some agents might like to play together a lot more than others.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3687.662,
    "end": 3695.685,
    "text": "So then you get something like a baseline concern for autonomy or that playing alone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3696.948,
    "end": 3702.971,
    "text": " versus a concern for togetherness or belonging or something like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3703.451,
    "end": 3706.493,
    "text": "And those would be, I think, in every person are kind of competing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3707.233,
    "end": 3712.215,
    "text": "So the idea here is that you're gathering evidence for each of these states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3713.376,
    "end": 3716.177,
    "text": "And they are driving your preferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3717.858,
    "end": 3720.599,
    "text": "But when you start to feel too lonely,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3721.519,
    "end": 3723.881,
    "text": " then you might be willing to sacrifice autonomy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3724.562,
    "end": 3737.312,
    "text": "And when you start to... And if I was a person, when you need more autonomy, I'd be willing to play along.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3737.813,
    "end": 3740.175,
    "text": "I mean, this is a basic concept.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3740.195,
    "end": 3745.559,
    "text": "It can be applied to any kind of balancing act between preferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3748.427,
    "end": 3751.889,
    "text": " And you can also apply it, actually, I anticipated another slide here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3751.909,
    "end": 3770.237,
    "text": "Anyway, I have applied the same concept to model things like trust, so trust games, where you're trying to get a sense, are we in a context where we're working together, or are we in a context where we are against each other?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3771.377,
    "end": 3776.7,
    "text": "And it's actually the same types of models, but then with one additional twist.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3777.742,
    "end": 3799.265,
    "text": " that now you're also inferring um yeah the the preferences of the other agent in a sense um with the same model supply so there's one i in addition to this there's one final thing i wanted to share let's see how much time oh we have quite some time that is nice um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3801.425,
    "end": 3820.074,
    "text": " I just wanted to share with you a few slides from finish this from a talk I gave with Maxwell Ramstead in Canadian neuroscience spotlight was in September, somewhere in September.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3821.754,
    "end": 3828.898,
    "text": "Just to go a little bit more in depth on what you do when you have this type of model that characterizes some",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3829.949,
    "end": 3835.933,
    "text": " psychiatric condition or could characterize it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3836.333,
    "end": 3840.736,
    "text": "So there's always a different kinds of domains of the state space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3841.176,
    "end": 3850.962,
    "text": "And we start with something, we kind of presuppose a functioning or at least the potential to function for the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3852.043,
    "end": 3853.964,
    "text": "And that's the kind of starting point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3854.204,
    "end": 3856.966,
    "text": "But then you look at, okay, in what ways can it break down?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3857.714,
    "end": 3869.557,
    "text": " and what types of combinations of parameters result in different kinds of what we call computational phenotypes that could be associated with affective disorders in this case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3871.297,
    "end": 3883.901,
    "text": "And what's nice there is that you can now start to do computational phenotype to get a kind of map of different kinds of problems that can emerge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3886.26,
    "end": 3894.343,
    "text": " this map doesn't need to be strictly categorical in the sense that the parameter space can be largely continuous.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3894.383,
    "end": 3898.525,
    "text": "So you can get clustering, but it doesn't have to be absolute.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3898.565,
    "end": 3899.726,
    "text": "You can code morbidity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3899.766,
    "end": 3903.447,
    "text": "You kind of get it for free because there's like this kind of coupling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3905.988,
    "end": 3912.291,
    "text": "You can get, yeah, basically combine it with things like RDOC.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3912.571,
    "end": 3914.792,
    "text": "I don't know if you're familiar with that, but it's kind of...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3916.112,
    "end": 3932.817,
    "text": " Alternative to the DSM, which has mostly a categorical approach, our doc tries to focus more also in the underlying mechanisms that generate these different phenotypes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3934.298,
    "end": 3942.481,
    "text": "And in that sense, this type of computational phenotyping could be the underlying statistical tool that could guide",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3944.127,
    "end": 3953.913,
    "text": " different kinds of investigations of not just affective disorders in the basic level, but also social emotional function.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3956.014,
    "end": 3961.317,
    "text": "Because of course, as we started out in the beginning, those are intricately linked to each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3963.458,
    "end": 3967.821,
    "text": "And that's where the context becomes important.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3969.801,
    "end": 3978.889,
    "text": " And the way, this is the final slide that I want to share, is that we can now use these types of tools.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3979.469,
    "end": 3987.116,
    "text": "Let's say we can fit them to individuals based on a wide variety of data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3987.136,
    "end": 3989.798,
    "text": "It can be self-reports, it can be objective measures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3991.954,
    "end": 3999.719,
    "text": " Can be also things like even the more traditional measures could be used to kind of initialize the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4001.02,
    "end": 4003.662,
    "text": "There's different approaches you can take there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4005.283,
    "end": 4013.349,
    "text": "The basic point is that now you can have, if you want to have a model of the model, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4013.409,
    "end": 4014.289,
    "text": "It's a meta model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4014.33,
    "end": 4020.594,
    "text": "It's a model of the model that tends to describe the way a person generates their behaviors and their thoughts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4021.59,
    "end": 4024.171,
    "text": " and the way their feelings evolve over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4025.652,
    "end": 4033.977,
    "text": "Once you have that, you can use that to employ, to basically forecast their weather conditions, so to speak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4034.877,
    "end": 4036.318,
    "text": "And those can be context-dependent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4036.978,
    "end": 4044.802,
    "text": "They can be to kind of tie it back to a question that was posed on transcontextuality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4048.211,
    "end": 4063.201,
    "text": " we know that the chances of rain are dependent on certain contextual factors that don't really, yeah, that depends on a higher level dynamics on the scale that are not local.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4063.261,
    "end": 4064.882,
    "text": "Yeah, it's not local.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4066.423,
    "end": 4077.75,
    "text": "In the same way, what's happening down inside your body, or let's say your heart rate can be contextualized by what's happening in the rest of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4080.244,
    "end": 4106.503,
    "text": " and in the end what's the kind of dream for this psychiatric application of an affective inference would be that therapists and psychiatrists etc don't have like a static thing like a book like DSM that just puts people into boxes but instead they have this dynamic tool that updates itself by",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4107.23,
    "end": 4116.733,
    "text": " through feedback with the clients, then relates that to help the therapist, and then the therapist can also improve that tool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4117.033,
    "end": 4135.758,
    "text": "So in that sense, you get a triad where the, and this can be applied not just to therapist-client relationships, but also can be applied to, let's say, help clients within their home environment to relate to their clients",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4136.857,
    "end": 4144.199,
    "text": " Yeah, their loved ones in school and their work environments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4145.779,
    "end": 4154.181,
    "text": "This would be a personalized treatment prediction tool and treatment monitoring.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4154.241,
    "end": 4160.102,
    "text": "So there's the different levels of application.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4160.122,
    "end": 4166.184,
    "text": "I mean, I focus here a lot on psychiatric applications because I think personally that's one of the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4167.102,
    "end": 4169.763,
    "text": " Yeah, one that I find the most fascinating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4169.803,
    "end": 4171.824,
    "text": "There's loads of other applications.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4171.944,
    "end": 4178.487,
    "text": "You can think of these types of models can be used for all kinds of commercial purposes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4179.348,
    "end": 4191.393,
    "text": "If you think about entertainment industry, how to generate an output that is kind of personalized to entertain somebody.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4193.224,
    "end": 4196.066,
    "text": " I mean, there are so many steps that you can take.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4196.086,
    "end": 4199.789,
    "text": "I just focused on the psychiatric side.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4199.809,
    "end": 4203.051,
    "text": "Yeah, that's pretty much it for now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4204.152,
    "end": 4209.555,
    "text": "But I'm sure that we can find some nice rabbit holes to...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4211.226,
    "end": 4211.526,
    "text": " Fun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4213.026,
    "end": 4214.667,
    "text": "Let me see how I can stop sharing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4214.847,
    "end": 4215.187,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4216.347,
    "end": 4217.007,
    "text": "Yeah, awesome.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4217.167,
    "end": 4218.307,
    "text": "Thank you, Casper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4218.508,
    "end": 4226.169,
    "text": "Super great to have you just kind of help us revisit the paper and also some of your past work and some of this other work.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4226.629,
    "end": 4233.811,
    "text": "And it really just struck me that you're talking about moving beyond the DSM into dynamic systems modeling, the other DSM.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4234.391,
    "end": 4239.692,
    "text": "So it's a little acronym overlap, but it just shows how when we have general principles,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4240.788,
    "end": 4266.212,
    "text": " it helps us descend into the nuance and the context, the subtlety of a clinical relationship, an entertainment relationship, the educational relationship, and actually do full justice to the complexity of the embodied situation, rather than thinking that we're going to just have some sort of meso-level theory that ends up actually falling in between sometimes general dynamical systems theory or complexity theory, and then on the",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4266.852,
    "end": 4267.692,
    "text": " actual specific.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4267.752,
    "end": 4270.033,
    "text": "So it was awesome to hear about these cases.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4270.654,
    "end": 4274.875,
    "text": "So we have Steven, and then Scott, and then anyone else who raises their hand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4277.496,
    "end": 4278.016,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.056,
    "end": 4286.7,
    "text": "This is really exciting with I've been I've been reading some of the work around the dynamical sort of options for psychiatry that you've been doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.72,
    "end": 4291.362,
    "text": "And I think one thing I noticed is you talked about the self the other and then the outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.182,
    "end": 4292.302,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.942,
    "end": 4322.482,
    "text": " like the outcome it seems that as people get immersed in the outcome it gives a way to dissolve this self other dilemma which is in a way that the trap of modern psychology and psychiatry is you name someone the self because you can analyze the self and the other because you can name and analyze the other and then everything else just goes from there and the model is just like is is dominant but never spoken about whereas here the model center stage but if you start to make it about the outcome and the context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4323.822,
    "end": 4346.29,
    "text": " now suddenly the self and the other can start to take a more dissolved space you know and and the positive psychology and the client can start to have more agency in their own life so i just yeah it'd be interesting just how you saw that relationship to self other and outcome yeah i mean um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.672,
    "end": 4360.958,
    "text": " In the interaction, the distinction kind of dissolves to some extent in the sense that they are co-creating each other's models, so to speak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4362.779,
    "end": 4366.181,
    "text": "And they end up having like a shared reality to a certain degree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4371.354,
    "end": 4398.309,
    "text": " what makes this reality real of when like shared expectations is the fact that they have them together and many of things in society are actually function only because other because we all to some extent believe in them like money is a very clear example but like the only value money has is that other people believe it has value um and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4400.325,
    "end": 4404.788,
    "text": " Again, I mean, the self-other, I guess you can't really escape it in the end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4405.828,
    "end": 4412.232,
    "text": "I don't think we need to, because it's just a matter of the level of description, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4412.312,
    "end": 4420.597,
    "text": "Just like the cells of a body are clear units, but at the same time, they are part of one whole.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4420.617,
    "end": 4425.3,
    "text": "I mean, yeah, this is like the Gestalt, basically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4425.32,
    "end": 4428.282,
    "text": "Gestalt psychology kind of comes back to haunt you in a sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4430.646,
    "end": 4434.187,
    "text": " There's the emergence hole that's other than the sum of its parts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4437.569,
    "end": 4448.332,
    "text": "I don't really mind talking about the units as long, but I think what you describe is really important that you keep in mind that there is like, it's just one level of, yeah, in the end, a reduction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4451.774,
    "end": 4454.075,
    "text": "I think there was another, is it a follow-up question?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4455.015,
    "end": 4455.235,
    "text": "Agnes?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4455.842,
    "end": 4457.382,
    "text": " Yeah, I think that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.422,
    "end": 4475.747,
    "text": "I think just like you were saying, if the outcome is being measured, does that change the way that we think about, like if we start looking at the space, the environment, the outcome, the context, are we in a whole different paradigm for treating disorders?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.187,
    "end": 4476.667,
    "text": "Okay, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4477.864,
    "end": 4490.11,
    "text": " That's a really interesting one because I mean, I know some really interesting research on the way in which psychiatric categories have influenced cognition and behavior across cultures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4490.991,
    "end": 4503.637,
    "text": "Basically, people believing they have a depression or they have depression and then they can't get out of it because they ended up believing that that's their disease, like a kind of discrete thing that they just stuck in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4505.816,
    "end": 4518.299,
    "text": " So that's a really interesting example where categories in that sense are kind of like mind where, and they program, they kind of specify the way you structure your worlds.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4518.759,
    "end": 4528.101,
    "text": "Um, and what I like about this kind of individualized modeling is that you can move away from those categories.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4528.141,
    "end": 4535.082,
    "text": "You don't even have to tell a person that they have a clinical diagnosis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4536.004,
    "end": 4541.628,
    "text": " You can tell how you know how to help them because they have individualized predictions for treatment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4542.569,
    "end": 4546.612,
    "text": "You don't have to tell them like, oh, we're putting you in this bin.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4548.413,
    "end": 4552.076,
    "text": "There's somebody that's like it becomes like a spectrum and there's different.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4553.177,
    "end": 4556.92,
    "text": "Attractors in that state space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4559.061,
    "end": 4563.825,
    "text": "We don't need to make this strict dichotomies anymore.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4564.997,
    "end": 4567.322,
    "text": " I mean, maybe for the insurance, that's the only limit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4568.224,
    "end": 4571.39,
    "text": "It's like the insurance companies want to know, do we have to pay for this or not?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4573.922,
    "end": 4599.656,
    "text": " it's so true that the implicit story of diagnosis is you know you got two kinds of people the diagnosed and the undiagnosed and if you have three of these five symptoms you're in this box and it almost made me laugh with this last point about insurance how about uh pay per affective charge let's uh continuously tune that dial if they just need to like you know a little bit pay a little bit or something there's a whole level of nuance that's when we're thinking about",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4600.856,
    "end": 4602.537,
    "text": " this in a big way.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4602.677,
    "end": 4603.758,
    "text": "So thanks for that answer.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4604.538,
    "end": 4605.579,
    "text": "Scott, go ahead.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4605.919,
    "end": 4607.08,
    "text": "Casper, then Scott.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4607.22,
    "end": 4629.673,
    "text": "I wanted to respond to that because that's an interesting point where it was something I also was trying to, I gave a talk in my psychology department or like the brain cognition meeting in my university where I was basically saying that in principle, if we can automate this, we can treat everybody to the extent that they're interested in like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4630.583,
    "end": 4653.455,
    "text": " improving aspects of their life i think everybody has some things they would like to improve so there's like don't even need to just limit it to like the kind of model where you just wait until things go horribly wrong and then you start to try to help like preventive treatments that are not based on this kind and this kind of disease model essentially",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4656.159,
    "end": 4662.623,
    "text": " And those prodromes might be revealed through these inferred parameters like uncertainty.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4663.123,
    "end": 4666.906,
    "text": "So before the real situation begins, it's really a good point.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4667.346,
    "end": 4668.927,
    "text": "So Scott, Dave, and Blue.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4670.308,
    "end": 4671.709,
    "text": "So fantastic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4671.769,
    "end": 4674.571,
    "text": "There are so many things, so many threads here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4674.591,
    "end": 4676.513,
    "text": "Let me pull a couple together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4676.673,
    "end": 4677.673,
    "text": "And it's on this...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4680.807,
    "end": 4707.499,
    "text": " uh space of social and internalized norms and folkways so dsm-4 used to list the cultural phenomenon that weren't considered disorders like tarantella or you know the or the different things that you know they were cultural not considered disorders but that always seemed to be very um imperialistic uh the way they did that but it's kind of interesting when you start to move into the um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4708.999,
    "end": 4712.221,
    "text": " You mentioned insurance companies and what they will pay for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4712.241,
    "end": 4722.129,
    "text": "The naming of disorders, many of them are just called disorders because they don't let you function as an industrial worker.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4722.889,
    "end": 4723.31,
    "text": "You know what I mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4723.33,
    "end": 4728.333,
    "text": "There's all sorts of context outside that dictates whether a disorder is a disorder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4730.225,
    "end": 4734.147,
    "text": " I love that notion you were talking about, about the clustering and the predictive elements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4734.687,
    "end": 4749.174,
    "text": "There's people in public health, non-mental health and physical disease health talk about 40% of the global health effort for any emerging pandemic is repeated from one to another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4750.02,
    "end": 4753.582,
    "text": " So imagine the cost savings and resource savings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4754.123,
    "end": 4760.807,
    "text": "If you can start to do predictive mental health, like people have been talking about the COVID is causing the PTSD generation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4761.687,
    "end": 4767.991,
    "text": "So you can have these clusters of things that need to be dealt with and scales of billions of people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4768.551,
    "end": 4773.475,
    "text": "And that idea about merging treatment into norms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4774.115,
    "end": 4778.958,
    "text": "So really not talking about treatment, you're just talking about a continuity of existential support",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4780.049,
    "end": 4805.443,
    "text": " in in society that's that really is fascinating here's the question so it's kind of an interesting there was an article on soft paternalism a number of years ago in the economist that idea that for instance if i have a gambling problem i can register with the state of missouri to not let me into the gambling ships that go up and down the mississippi when i have a moment of clarity i could say don't let me on the ships and then i'm registered there and then they won't let me on the ships when i'm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4806.141,
    "end": 4835.935,
    "text": " feeling the urge to go gamble so there's this kind of inviting that externality in one of the things i wanted to ask you about is your thoughts your gut thoughts on sovereignty and so i define a sovereign as something that doesn't need to ask for permission or forgiveness and it's always an external teleology it's always a projection out whether it's a deity or royalty or a country or a company we project it out so we can self-bind to it okay that's my assertion okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4836.638,
    "end": 4843.481,
    "text": " So I'm looking at that sovereignty has to have an abstraction of its subjects because that's the notion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4843.501,
    "end": 4848.984,
    "text": "So we project out it to be abstracting us so it can deal with the big problems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4849.884,
    "end": 4856.667,
    "text": "And then the anomalies we take care of with a mass customization of localizing it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4857.007,
    "end": 4858.648,
    "text": "So it feels like you're,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4859.406,
    "end": 4865.03,
    "text": " clinical notion about psychological states could be employed for political purposes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4865.071,
    "end": 4875.739,
    "text": "And I'm talking about in a positive way, not in a bad manipulation, but in a good intentional manipulation of affective states that are positive for civic engagement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4877.32,
    "end": 4885.126,
    "text": "And then you basically use the same notions as psychological disorders, but you start correcting for, let's call them political disorders.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4886.813,
    "end": 4887.013,
    "text": " Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4887.274,
    "end": 4889.476,
    "text": "Because it's just normative states, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4889.816,
    "end": 4897.543,
    "text": "So that's what I'm curious about is have you done any thinking about how to project cultural states from a group?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4897.683,
    "end": 4903.128,
    "text": "Like projecting it on the screen and then everyone watches it and says, huh, that's us up there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4903.468,
    "end": 4905.07,
    "text": "Let's go move towards that now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4907.372,
    "end": 4907.992,
    "text": "Sort of a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4909.113,
    "end": 4910.174,
    "text": "It's a really interesting question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4911.368,
    "end": 4932.601,
    "text": " I have a student that works on like cumulative cultural dynamics and simulating the way in which beliefs kind of in a kind of minimalistic way that can be seen as, um, yeah, model today, quite similarly to viral spread of, um, but then there,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4933.724,
    "end": 4960.705,
    "text": " the perspective of the beliefs that are spreading it's kind of like every time it's trying to be it's somebody tries to transmit it to the next person the question is how well does this fit with the next minds and only then only if their fit is close enough uh it can be it can reproduce essentially um so then your question is kind of like one level beyond that where you're like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4961.101,
    "end": 4966.043,
    "text": " where you're trying to predict which message will fit to which group of people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4967.383,
    "end": 4979.047,
    "text": "And then that can be taken in very evil directions, but you can also kind of use it maybe to break political bubbles that lead to extremism or something like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4979.607,
    "end": 4982.328,
    "text": "So there's different kinds of... Because in the end, it's a tool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4982.588,
    "end": 4983.669,
    "text": "That's right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4984.429,
    "end": 4992.772,
    "text": " And one note on that political side that some people bring up is we're not simply talking about the communications or just the rhetoric display.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4993.272,
    "end": 5001.755,
    "text": "It's actually about doing a systems identification and potentially finding latent areas of agreement that are just two terms being used by two communities, for example.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5002.115,
    "end": 5005.817,
    "text": "So, yeah, but very important and interesting topics.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5006.773,
    "end": 5030.369,
    "text": " was just wondering uh sorry you talked about sovereignty so i was wondering how you view that connecting to sovereign because the way i see sovereignty is just like a sovereign body is like something that has complete power over certain domain and then talking about people within that domain so they are completely under the sovereignty of that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5030.965,
    "end": 5054.364,
    "text": " governing body right the way the way the link happens is my assertion is that all sovereigns are projections so they are they're gods oh i don't say we invented god because i'm an atheist but it might be a blasphemy to other people so we invented deities because there's different things you know yeah so it's like we invented royalty we invented",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5055.735,
    "end": 5056.696,
    "text": " We invented companies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5056.756,
    "end": 5057.657,
    "text": "Name another sovereign.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5057.677,
    "end": 5059.779,
    "text": "They're the things that don't ask for permission or forgiveness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5060.279,
    "end": 5064.824,
    "text": "We invented them so that we can organize at larger levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5064.844,
    "end": 5068.027,
    "text": "Now, we didn't say it explicitly, but that's why we did it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5068.528,
    "end": 5070.45,
    "text": "And so all of them are projections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5070.63,
    "end": 5072.392,
    "text": "So they're all stories from us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5073.233,
    "end": 5076.116,
    "text": "Now, they take on a separate life, sort of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5077.281,
    "end": 5079.262,
    "text": " but they can never be identified.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5079.302,
    "end": 5080.323,
    "text": "That's the thing about sovereigns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5080.343,
    "end": 5081.924,
    "text": "There's always a metaphysical element.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5082.224,
    "end": 5084.766,
    "text": "They can never be identical to the subjects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5085.286,
    "end": 5098.595,
    "text": "That's why when a sovereign dies in office, it's a real difficulty for the sovereignty when a human who represents the sovereign dies because it has to be separated out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5098.895,
    "end": 5102.718,
    "text": "You have a state funeral, but then the body has to be separated from the body politic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5103.326,
    "end": 5103.966,
    "text": " It's Hobbes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5104.047,
    "end": 5105.227,
    "text": "It's a Leviathan thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5105.688,
    "end": 5108.029,
    "text": "Leviathan can't be composed of the individual parts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5108.109,
    "end": 5109.39,
    "text": "It takes on a separate nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5109.41,
    "end": 5114.493,
    "text": "And anyway, so that's why this is so interesting, that projection and that act",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5115.356,
    "end": 5119.279,
    "text": " of collective projection is totally where we are right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5119.339,
    "end": 5126.345,
    "text": "Think about all the problems, climate change, global resources, water resources, finance, things that can't be done by nation states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5126.705,
    "end": 5128.146,
    "text": "We need new sovereign levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5128.646,
    "end": 5132.049,
    "text": "Active inference is going to be the way that we synthesize them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5132.209,
    "end": 5139.615,
    "text": "It will be, whether we call it active inference or not, because it's all we've ever done as biological and living and social organisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5140.256,
    "end": 5141.257,
    "text": " And it's a way of framing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5141.337,
    "end": 5145.119,
    "text": "And so it's a way of now, to me, it's a new teleology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5145.499,
    "end": 5148.341,
    "text": "We can project forward, just like you're saying, predicting on psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5148.761,
    "end": 5154.364,
    "text": "I think we can predict politics and social states because we can use predictive analytics of clustering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5154.404,
    "end": 5155.085,
    "text": "It's the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5155.585,
    "end": 5162.169,
    "text": "You take a bunch of... Another student who was modeling the elections, American elections, the same.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5162.189,
    "end": 5167.512,
    "text": "I like what you said about it's kind of subjective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5167.772,
    "end": 5169.393,
    "text": "It's like the attribution of power.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5172.024,
    "end": 5176.585,
    "text": " But then it's like a totally imaginary thing, just like we had to build power to money.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5176.605,
    "end": 5177.866,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5177.906,
    "end": 5181.687,
    "text": "I mean, money is a de-risking consolidator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5181.707,
    "end": 5182.927,
    "text": "It's one form of money.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5182.967,
    "end": 5185.568,
    "text": "Wixel and Smith and Hume, they all have different ideas about money.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5186.108,
    "end": 5188.489,
    "text": "But one way you can look at it is a de-risking consolidator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5188.889,
    "end": 5192.11,
    "text": "So it takes all risk and makes it into one risk, which is how can I get more money?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5192.991,
    "end": 5196.432,
    "text": "And if that's the case, it's an interaction de-risking tool, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5196.492,
    "end": 5197.112,
    "text": "Actually, it is one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5197.54,
    "end": 5207.908,
    "text": " This could give us a way to discuss, to bring it also to the earlier point of instrumentalism and realism, because the fact that money has instrumental value, does it make it real?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5208.409,
    "end": 5211.631,
    "text": "I mean, that's like a kind of interesting question that I don't have an answer to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5211.651,
    "end": 5218.296,
    "text": "I mean, I guess in practice it's real because people believe, you know, it's like a thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5218.917,
    "end": 5225.062,
    "text": "One thing I just suggest you look at, somebody just apprised me a couple of months ago about Christopher Alexander's work in architecture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5225.999,
    "end": 5233.723,
    "text": " If you haven't run into that, check it out, because what he does is basically looks at patterns in architecture through deep time and through space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5234.424,
    "end": 5240.227,
    "text": "And the idea is that existing practices are captured in patterns of practice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5241.267,
    "end": 5250.312,
    "text": "And if you want to look at a solution for an earlier for a problem, look at patterns of practice from other situations and bring them into the situation here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5250.953,
    "end": 5254.515,
    "text": "Similarly, it feels like we can in your work, it's revealing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5254.943,
    "end": 5260.284,
    "text": " that we can look at patterns of practice, and then take them as predictive models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5260.404,
    "end": 5262.945,
    "text": "And so that's what Chris Alexander does that in architecture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5262.965,
    "end": 5271.947,
    "text": "And it's very straightforward there, because it's physical instantiations, like an archaeology of the mind of architecture in a way, or the archaeology of the problem space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5272.387,
    "end": 5274.548,
    "text": "Anyway, something to look at it might be fruitful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5274.968,
    "end": 5275.168,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5275.548,
    "end": 5276.528,
    "text": "Thank you, Scott.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5277.068,
    "end": 5280.149,
    "text": "So we have Dave blue, and then a question from the chat.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5280.249,
    "end": 5280.789,
    "text": "So go ahead, Dave.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5284.201,
    "end": 5293.231,
    "text": " Yeah, if you could turn toward the realistic side of your experience with these questions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5294.132,
    "end": 5301.321,
    "text": "Do you, Kaspar, have the feeling that people's real models are",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5302.819,
    "end": 5320.447,
    "text": " of the same structure as these transpersonal models or person to environment or organism to environment, folks in this field seem to kind of assume that, oh, yeah, it is all turtles all the way down or it's blankets all the way down.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5320.747,
    "end": 5322.487,
    "text": "And I don't know that I'm convinced of that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5322.748,
    "end": 5323.628,
    "text": "What's your intuition?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5325.129,
    "end": 5326.029,
    "text": "Interesting question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5330.464,
    "end": 5345.853,
    "text": " I think that it's kind of similar to the way that you can last time we talked about dimensionality and you can project from 3D into 2D space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5346.474,
    "end": 5351.397,
    "text": "But like understanding a 3D space while you're in a 2D space is kind of impossible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5352.477,
    "end": 5358.401,
    "text": "Essentially, in the end, it's a little bit similar, like looking down on the hierarchy, I think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5359.104,
    "end": 5370.05,
    "text": " It's much easier, makes things feel much realer, more real, because essentially they can, they're within your, yeah, your mind can grasp them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5372.791,
    "end": 5386.658,
    "text": "And when you move upwards, your sort of transpersonal part, I think it's, our minds don't have, yeah, the capacity to fully grasp something like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5388.564,
    "end": 5412.408,
    "text": " can so it doesn't have the same experiential um yeah i would just say um detail maybe um so yeah i think you're getting at an interesting point where there seems to be a difference between the way what experientially feels real and what",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5413.426,
    "end": 5422.832,
    "text": " from an instrumentalist perspective, and there doesn't seem to be much of a difference if you can move through the transpersonal level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5424.673,
    "end": 5442.064,
    "text": "Just like, as I said, I think in principle humans can form higher levels of organization, can form bodies together, and every human is this unit in this body.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5442.651,
    "end": 5460.64,
    "text": " just like every cell and every organ in the end has its own local experience, so to speak, its own local data, maybe, that is being integrated to inform their states and their decisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5462.981,
    "end": 5467.664,
    "text": "But then there's the global pattern, and that's the local elements never have direct access to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5468.984,
    "end": 5472.186,
    "text": "And I think that's something that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5474.634,
    "end": 5499.543,
    "text": " um gets at this point that you're describing um but yeah i guess i don't have a real answer just but i understand experientially what you're saying in the sense that definitely there are things that feel real there are things that don't exist but feel real that's also um so there are ways in which transpersonal concepts can start to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5501.252,
    "end": 5530.463,
    "text": " trigger hallucinations in people for example and there's all kinds of um edge cases i don't know does that answer your question i think it's a really interesting one but i don't have a good answer actually it does yeah i think it it is an elephant in the room perhaps um yeah and if i could just run off on a tangent on that um the relation between inner in the sense of what's inside a frestonian blanket",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5531.056,
    "end": 5537.4,
    "text": " and inner in the sense of what's going on in various parts of the nervous system or the organism.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5538.58,
    "end": 5555.07,
    "text": "I tend to come at this by thinking that what the physiological, the anatomical correlates of what we've been focusing on for the last two weeks are largely going on in the midbrain, the brainstem.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5555.91,
    "end": 5558.412,
    "text": "Some of the lower structures in the cortex",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5559.574,
    "end": 5564.477,
    "text": " But the modeling goes on in the neocortex.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5565.518,
    "end": 5580.087,
    "text": "So the inside is actually executed outside in the portion of the nervous system that's really good at doing algorithms and pattern matching and reinvestment of pattern transformations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5580.527,
    "end": 5587.952,
    "text": "But the purpose of doing the whole thing is largely, especially in a small child or a non-human mammal,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5588.866,
    "end": 5616.188,
    "text": " outside the cortex so that probably blows the whole thing in principle yeah from the models that i built it usually doesn't really matter where the data comes from like uh can be inter internal signals external it's more important what the inference is about so like um extra reception is is perception about external states of the world",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5617.492,
    "end": 5622.313,
    "text": " an interoception about internal states of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5622.853,
    "end": 5630.375,
    "text": "But I can have external signals that may give me information about my internal states and vice versa.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5632.915,
    "end": 5635.536,
    "text": "So this distinction is pretty important.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5636.456,
    "end": 5639.517,
    "text": "But yeah, that doesn't entirely resolve the issue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5640.277,
    "end": 5644.058,
    "text": "I like the fact that the models are kind of agnostic about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5645.836,
    "end": 5649.94,
    "text": " where it's actually the information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5650.541,
    "end": 5656.848,
    "text": "A lot to say on this blue, and then a question from the chat, and then anyone else in the chat or here who wants to ask?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5659.628,
    "end": 5670.898,
    "text": " So I loved the diagnosis or the elimination of diagnosis and clustering instead of diagnosing people, except like when it comes to insurance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.058,
    "end": 5681.327,
    "text": "And so, Kasper, I'm going to charge you with obliterating this in the minds of insurance companies also, because I think that there's this fundamental thing that happens",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5682.308,
    "end": 5692.371,
    "text": " And I mean, maybe I'm wrong, but if I display some behavior of someone with ADHD and I display a lot of those behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5692.712,
    "end": 5698.934,
    "text": "So if I display some of this behavior, but then I go see a psychiatrist and I'm diagnosed with ADHD,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5700.394,
    "end": 5708.681,
    "text": " I think that there's a large degree, especially in younger children, like as they're coming into themselves and dealing with identity crises, teenagers and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.581,
    "end": 5717.247,
    "text": "I think that there's a large degree of excusing or perpetuating my behavior because I have a diagnosis, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5717.447,
    "end": 5721.27,
    "text": "So if I'm diagnosed with something like ADHD, like maybe that will...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5722.511,
    "end": 5734.056,
    "text": " I'll give myself permission or excuse or I'll cluster more strongly into the group of people that have those kinds of behaviors because I have a diagnosis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5734.096,
    "end": 5735.576,
    "text": "I think that this is very plausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5736.237,
    "end": 5736.717,
    "text": "What do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5739.198,
    "end": 5751.643,
    "text": "That's also what I was trying to get at in a sense that people tend to use these internal representations to structure their experience and then to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5753.775,
    "end": 5756.136,
    "text": " to generate their responses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5756.696,
    "end": 5762.978,
    "text": "And then these boxes become self-filling prophecies, to a certain extent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5764.579,
    "end": 5773.682,
    "text": "Then there's that side, but there's also, then there's another side to it, is that there are also positive reports that people, when they can",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5776.354,
    "end": 5796.05,
    "text": " Attributes the effects to something and it makes them feel less anxious so they can kind of explain it away And yeah, I don't know what's yeah, it has downsides and upsides I guess yeah Yep a very",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5797.17,
    "end": 5818.946,
    "text": " sensitive and interesting thing but it reminds me of the 12 steps and the first step is to acknowledge the kind of person that one is obviously we're not going to go into this and it's for others to investigate but it's a trade-off between having a narrative certainty a diagnostic confidence versus the alternative and so there's our teammates in meaning or a narrative space",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5819.767,
    "end": 5831.397,
    "text": " which one of these bifurcation paths narratively will we then have the lower levels of our model like whether we exercise or not or whether we have a job or not those kinds of things come into play",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5832.552,
    "end": 5837.756,
    "text": " I just want to ask the question from the chat and then Dean and Steven and Scott.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5838.196,
    "end": 5847.482,
    "text": "So in the chat, someone wrote, can free energy principle based models reach a level in the future to be able to precisely predict when emotion or valence happens?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5848.002,
    "end": 5852.465,
    "text": "And more importantly, when in the temporal dynamics of that cycle, does thought subside?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5853.246,
    "end": 5861.732,
    "text": "So how is our experience of thought related to some of these simulations with the countervailing affective chart or countervailing hidden states?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5862.588,
    "end": 5864.81,
    "text": " Where does our experience of thought come into play?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5869.594,
    "end": 5880.323,
    "text": "I mean, it's to some extent already being done in the sense that there's applications in Amsterdam.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5880.803,
    "end": 5885.047,
    "text": "They have been treating OCD with deep brain stimulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5886.267,
    "end": 5892.628,
    "text": " And they identify the locus of intervention using fMRI.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5893.988,
    "end": 5898.889,
    "text": "And fMRI is driven by DCM, which is driven by pre-energy minimization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5899.649,
    "end": 5913.232,
    "text": "So we're already doing that to some degree, identifying the kind of recurrent self-destructive loops of behavior in the brain, essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5914.259,
    "end": 5917.582,
    "text": " So internal behavior of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5919.003,
    "end": 5921.805,
    "text": "And then identifying ways to break those loops.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5923.086,
    "end": 5938.278,
    "text": "So they implant, they just try to find the kind of nodes at which the loop is, through which the loop is circulating and then they break, yeah, they disturb that node once in a while.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5938.819,
    "end": 5940.04,
    "text": "And that actually...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5941.027,
    "end": 5970.503,
    "text": " leads to an improvement in function it's kind of funny because when they remove it and loops tend to return pretty quickly again so it seems not to be an it's it's kind of it's not a full treatment it's more like a prevention it gets more interesting if you have like real-time way of getting into that then you don't yeah you would need not just like an electrode in there but like a whole",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5972.888,
    "end": 5998.107,
    "text": " a whole array of electrodes that are like tracking and it's a little bit scary but in principle you could have like a whole weather tracking system inside and then if there's a hurricane emerging kind of blocking the i mean they tried to do that already for people with epilepsy i guess",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5999.258,
    "end": 6027.151,
    "text": " then we all become like a cyborg or something if you start to go that and that's where it's maybe not i mean what i guess i find more interesting or like more appealing is um if we start to become more aware of how these feelings are generated by our relation with the external world so there's this use case of um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6028.484,
    "end": 6040.275,
    "text": " tracking warehouse workers that I've been seeking to apply some of my work to where you could track their affective states over the course of the day.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6040.535,
    "end": 6042.497,
    "text": "And every person has a different chronotype.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6043.318,
    "end": 6046.761,
    "text": "Every person has different times of day when they feel most energetic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6047.241,
    "end": 6050.084,
    "text": "And it depends also on how well they've slept recently, et cetera.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6052.026,
    "end": 6054.488,
    "text": "So if you had some intelligent warehousing system,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6055.023,
    "end": 6079.955,
    "text": " then you could basically you could distribute tasks and the schedule of the warehouse could be adjusted to suit the preferences and to maximize um well-being um of the the workers and potentially uh in the process also increase productivity so there's like kind of capitalistic potentially",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6081.164,
    "end": 6090.049,
    "text": " If we could construct things like that, we could use our modeling of these affective dynamics over the course of day by day for each individual.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6090.069,
    "end": 6106.658,
    "text": "We could use them to care for people, to make them, to prevent burnout and potentially make that appealing for people who are just driven by money, by profit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6106.698,
    "end": 6108.68,
    "text": "Unfortunately, they're always in the end just",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6110.162,
    "end": 6112.343,
    "text": " Most companies are just driven by profit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6112.363,
    "end": 6118.144,
    "text": "So to make that realistic and scalable, you need to show that also is good for the business.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6120.104,
    "end": 6123.665,
    "text": "Anyway, so that's like some thoughts I have in reaction to that question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6125.445,
    "end": 6126.946,
    "text": "There was a sub component.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6126.986,
    "end": 6127.966,
    "text": "What was the second part?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6127.986,
    "end": 6129.846,
    "text": "Could you read that again?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6130.527,
    "end": 6135.808,
    "text": "More importantly, where in this temporal dynamical cycle does thought subside?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6136.808,
    "end": 6136.908,
    "text": "Hmm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6139.196,
    "end": 6140.417,
    "text": " That's a very nice question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6144.72,
    "end": 6145.26,
    "text": "I wish I knew.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6145.28,
    "end": 6148.202,
    "text": "Let's keep thinking on it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6149.523,
    "end": 6156.508,
    "text": "I guess there are certain parts of our system that are able to, are kind of contributing to our verbalization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6157.549,
    "end": 6167.056,
    "text": "And the way I view thought, at least the kinds of introspective thoughts that is verbal tends to be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6169.498,
    "end": 6174.922,
    "text": " internalized social skill, essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6176.684,
    "end": 6190.154,
    "text": "You first need to learn about how to speak with others, and then as a child, I guess when you're really young, at some point you start to be able to have these dynamics run internally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6190.954,
    "end": 6195.278,
    "text": "And my suspicion is, and I think there's some research actually confirming this to some extent, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6196.325,
    "end": 6200.427,
    "text": " that in order to create a verbal thought, you need to access the verbal pathways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6202.488,
    "end": 6206.67,
    "text": "But you just attenuate the actual motor execution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6209.152,
    "end": 6212.213,
    "text": "That's how they tend to think about it in the literature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6212.774,
    "end": 6222.799,
    "text": "And then there's imagery thought, which is, in a sense, even more amazing, maybe, because that's not something you can",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6224.178,
    "end": 6227.42,
    "text": " I mean, verbal, that's an actual action that you do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6227.84,
    "end": 6232.984,
    "text": "So it's kind of easier to imagine how you could have this action unfold internally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6233.064,
    "end": 6240.729,
    "text": "But imagery is not something that you actually do in life.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6241.069,
    "end": 6250.115,
    "text": "It's something you can somehow... You control your own internal...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6255.475,
    "end": 6280.698,
    "text": " pathways that you normally you would use for for having a visual sensation your mental actions can somehow control your visual processing pathways which i i have a hard time imagining how exactly that thing i mean i can build a model of that i think but yeah how it works in like biologically i find it quite hard to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6283.512,
    "end": 6285.594,
    "text": " Well, that's the instrumentalist tango.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6285.974,
    "end": 6287.795,
    "text": "We can build a few model architectures.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6287.875,
    "end": 6290.277,
    "text": "We could think about some differentiating experiments.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6290.357,
    "end": 6293.059,
    "text": "We could imagine some informative observations.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6293.939,
    "end": 6294.42,
    "text": "Go from there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6294.84,
    "end": 6295.961,
    "text": "Continue the discussion from there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6296.481,
    "end": 6301.845,
    "text": "So in our last little bit, let's go with Dean, Scott, Stephen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6303.783,
    "end": 6304.043,
    "text": " Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6304.384,
    "end": 6318.119,
    "text": "Real quick, you talked about personalized stuff and the loop seems to come back on politics because I remember a couple of weeks ago, the first thing I think I said to you after high was, we can't unlearn this once we start using these diagnostic tools.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6318.259,
    "end": 6319.26,
    "text": "We can't unsee it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6321.215,
    "end": 6326.561,
    "text": " So there's a lot of politics involved when people have this ability to see things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6328.003,
    "end": 6339.256,
    "text": "One reference I wanted to mention, and especially I think helpful to Scott if he hasn't already read it, about this personalized versus political, is an author by the name of Paul W. Kahn.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6341.223,
    "end": 6343.084,
    "text": " And his book is called Origins of Order.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6343.945,
    "end": 6354.093,
    "text": "And what it does is it tries to bring those two ends of that continuum into some sort of a, not like there's no balance between the two, but there's kind of a back and forth.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6354.653,
    "end": 6362.739,
    "text": "And it's very looking at rules, but not just on a legal level, but on much bigger scales.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6363.059,
    "end": 6370.285,
    "text": "So it kind of fits nicely with what Blue said about the diagnostics, what we've touched on a couple of times about the instrumental stuff.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6371.274,
    "end": 6388.133,
    "text": " But I still think that if you try to apply a lot of this stuff to, which is what I did before, I used very rudimentary ways of expressing this, but I gave young learners these tools and boy, was it political, the results of that, because they could just see things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6389.147,
    "end": 6389.987,
    "text": " and started doing things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6390.007,
    "end": 6392.889,
    "text": "And there was a whole lot of people that went, Hey, whoa, whoa, whoa, whoa.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6393.469,
    "end": 6395.17,
    "text": "They're getting way too much power from this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6395.75,
    "end": 6397.071,
    "text": "But anyway, that's just an aside.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6397.111,
    "end": 6403.514,
    "text": "I just wanted to share the reference because I think it really ties in nicely with some of the stuff that Scott was talking about earlier.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6403.554,
    "end": 6408.997,
    "text": "And obviously I don't think the political part of it goes away, no matter how much we want to be agnostic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6409.417,
    "end": 6409.697,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6409.717,
    "end": 6413.699,
    "text": "I mean, uh, yeah, in a political,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6414.52,
    "end": 6435.376,
    "text": " context in a sense what we're trying to determine is what what is the generative model that governs the body so like this conflict and tension and tension resolution and it's kind of like the price we have paid for being able to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6436.909,
    "end": 6437.489,
    "text": " to organize.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6438.05,
    "end": 6442.252,
    "text": "It's the body politic, the Leviathan, as brought up earlier.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6442.392,
    "end": 6443.412,
    "text": "Will we turn left?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6443.532,
    "end": 6444.413,
    "text": "Will we turn right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6444.473,
    "end": 6445.453,
    "text": "Will we look forward?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6445.493,
    "end": 6446.594,
    "text": "Will we look backwards?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6447.994,
    "end": 6451.736,
    "text": "There's a lot to this multi-level political approach.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6452.617,
    "end": 6454.317,
    "text": "So Scott, and then Stephen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6456.078,
    "end": 6456.498,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6456.839,
    "end": 6463.762,
    "text": "So it is a big, it's like moving a slime mold, but from outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6464.523,
    "end": 6474.711,
    "text": " A couple of things that jumped in in the last bit and where I'm going with this is the notion of a capitalist enclosure of consciousness with the categories of abstraction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6475.532,
    "end": 6484.619,
    "text": "So the painter Kandinsky, and I've said this before, it just prays in my mind, painter Kandinsky said that violent societies yield abstract art.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6486.32,
    "end": 6489.763,
    "text": "And one of the things I've always wondered about is, is the reverse also true?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6490.124,
    "end": 6491.745,
    "text": "Is abstraction a form of violence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6493.177,
    "end": 6500.041,
    "text": " And so here, one of the things that I was thinking about in the last couple of comments was symbolic synesthesia, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6500.121,
    "end": 6504.924,
    "text": "We don't really have a perceptual synesthesia, but we take symbols and we substitute them in for things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6505.524,
    "end": 6514.489,
    "text": "So like if I drank tequila when I had a bad experience with something else, a bad tequila experience with something else, then I'll remember the bad tequila experience as associated with that other thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6515.429,
    "end": 6517.05,
    "text": "Not that I ever had a bad tequila experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6517.07,
    "end": 6518.131,
    "text": "I'm just saying if it ever happened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6518.797,
    "end": 6522.96,
    "text": " So that abstraction, you know, we had to kind of becomes our prior or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6522.98,
    "end": 6531.145,
    "text": "And it goes back to that notion of the humor element to the abstractions are taking us to a place and then revealing the reveal comes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6531.205,
    "end": 6531.405,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6532.146,
    "end": 6538.09,
    "text": "And so one of the things I was wondering about on the capitalist side, we don't want surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6538.25,
    "end": 6541.692,
    "text": "We don't want punch lines for jokes because that's risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6543.669,
    "end": 6550.455,
    "text": " Right now that you don't have innovation, then that's the problem is there's this tension between innovation and stasis, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6550.835,
    "end": 6555.118,
    "text": "And so they want innovation, but they don't want somebody else to innovate and take the risk, but then they want to benefit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6555.779,
    "end": 6566.888,
    "text": "But anyway, so from a capitalist enclosure perspective, one of the things I'm wondering is does active inference, and this is the question, does active inference, we were all taking care of each other's active inference exhaust.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6567.928,
    "end": 6573.311,
    "text": " We're all taking the, everyone's doing active inference on each other and we're all the externalities for everyone else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6573.371,
    "end": 6578.574,
    "text": "And so we're all having to internalize everyone else's discovery pathway in a sense, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6579.534,
    "end": 6581.215,
    "text": "We're loading on each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6582.015,
    "end": 6586.638,
    "text": "So that space of exhaust management is a commons in a way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6586.698,
    "end": 6588.298,
    "text": "We're co-managing risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6589.559,
    "end": 6597.083,
    "text": "So when I talk about money as a universal risk consolidator, might the metrics of value in markets",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6598.823,
    "end": 6615.196,
    "text": " give us insight, not entire insights, because markets don't tell you everything and not everything is measurable that way, but give us insights into preferences in a way that starts to give us the insight into that co-management of the active inference exhaust, essentially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6615.617,
    "end": 6621.361,
    "text": "So it's really treating commons not as a fisheries commons, like with an asset commons, but as a risk commons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6621.962,
    "end": 6624.444,
    "text": "And it's basically consciousness as a commons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6625.509,
    "end": 6629.792,
    "text": " So imagine that the mind exists in language rather than the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6630.152,
    "end": 6632.774,
    "text": "The brains are tuned into the shared mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6634.115,
    "end": 6636.097,
    "text": "And now we got to manage that shared mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6636.557,
    "end": 6642.902,
    "text": "So we get nonsense in there, something that's wrong science or bad politics or not functional economics or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6643.562,
    "end": 6645.724,
    "text": "And we want to get rid of that because it's spoiling the commons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6646.872,
    "end": 6660.6,
    "text": " So that was what came to me, this idea, the sovereign feels like how we synthesize an externality to say, whoa, whoa, whoa, we got to get this right because we got some big scale stuff we got to do like ants and bees can do without memos.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6660.64,
    "end": 6662.941,
    "text": "We have memos, so we got to write the memos.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6663.381,
    "end": 6664.382,
    "text": "So what do the memos say?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6665.442,
    "end": 6667.463,
    "text": "And that's why you get the DSM and stuff like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6667.483,
    "end": 6673.927,
    "text": "And what they're saying is just like Foucault said, pastoral control is what drives people together with certain behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6674.884,
    "end": 6675.084,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6675.344,
    "end": 6676.465,
    "text": "And so it's that same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6676.485,
    "end": 6677.806,
    "text": "Are we being driven?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6677.826,
    "end": 6684.31,
    "text": "Is it is are we being driven to be industrial workers or now we're being driven to something else?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6684.51,
    "end": 6691.975,
    "text": "And how do we manage that that commons of our inference, active inference commons to aspire to what we want to be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6692.335,
    "end": 6693.276,
    "text": "Now, there's a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6693.916,
    "end": 6694.356,
    "text": "Sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6698.279,
    "end": 6700.781,
    "text": "I mean, it kind of makes me think about the way in which",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6702.748,
    "end": 6711.254,
    "text": " the major religions have mostly merged as soon as, at least during the same amount of time that they ended up being able to write it down, basically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6711.294,
    "end": 6721.561,
    "text": "So it's like a recursive relation, of course, but you basically need a culture for that level of unity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6722.341,
    "end": 6730.547,
    "text": "There's two directions you can go, and I guess it's probably both ways, but on the one hand, you need to be organized enough to have a culture that you're able to write things down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6731.778,
    "end": 6744.746,
    "text": " And once you're able to do so, you can basically, you can kind of hard code the structures and you end up having a competitive advantage over other potential models, essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6745.467,
    "end": 6751.591,
    "text": "So maybe the mind and culture are emergent phenomenon of complexity, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6751.631,
    "end": 6758.355,
    "text": "Maybe complexity causes the mind because we need to, when we say we need to do something,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6758.968,
    "end": 6782.787,
    "text": " we often think it's in response to something but maybe that thing itself is another instantiation of complexity itself and so maybe what we're doing is merely red queening the whole thing right just keeping up we think we're actually innovating and doing things but really what's happening is with increasing exponential increase in interaction volume and this and this is not this is what i actually believe in pursuing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6783.664,
    "end": 6801.269,
    "text": " If there's a raw increase since the big bang in exponential increase in interaction volume, maybe all we do is just keep up and keep dealing with that externality as living organisms in order to maintain negentropy states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6801.769,
    "end": 6808.271,
    "text": "Maybe we just have to keep rushing into higher levels of order organization in order just to not dissipate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6809.131,
    "end": 6809.291,
    "text": "Anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6810.307,
    "end": 6811.728,
    "text": " Thank you, Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6812.189,
    "end": 6822.218,
    "text": "There's also opposite ways of thinking about it, like where these organized structures are like the best way to dissipate energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6822.398,
    "end": 6824.641,
    "text": "So there is like a kind of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6824.681,
    "end": 6829.265,
    "text": "Just like the convective bubbles in in some kind of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6829.445,
    "end": 6831.467,
    "text": "It is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6834.324,
    "end": 6848.195,
    "text": " volume of water or fluid um the substructure basically helps the system to dissipate the energy um so there are certain it's like interesting two ways of looking it's the same thing in the sense",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6849.139,
    "end": 6853.341,
    "text": " It's that structural dissipation of risk is what you have in law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6853.781,
    "end": 6854.822,
    "text": "And that's, that's all it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6854.842,
    "end": 6857.643,
    "text": "It's just, it's a time machine that predicts the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6858.063,
    "end": 6860.624,
    "text": "Everyone can look at the prediction in a contractor law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6860.964,
    "end": 6863.205,
    "text": "It's enforceable and they can rely on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6863.445,
    "end": 6864.706,
    "text": "And so it saves resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6864.726,
    "end": 6867.167,
    "text": "So it's exactly what you're saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6867.467,
    "end": 6867.807,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6868.467,
    "end": 6871.949,
    "text": "Steven, if you want to make a really quick last comment, cause we're out of time and then we'll close out.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6872.762,
    "end": 6873.703,
    "text": " Yeah, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6874.444,
    "end": 6884.615,
    "text": "I was just going to say, I mean, it sort of ties in this idea of abstraction and the, is I do a lot of work with action methods and ways of working in space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6884.795,
    "end": 6886.557,
    "text": "And I think it ties into this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6886.577,
    "end": 6893.604,
    "text": "I think it might also tie into next week's talk is there's certain things that we can realistically get a handle on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6895.245,
    "end": 6896.806,
    "text": " if we can take a perspective on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6897.046,
    "end": 6905.749,
    "text": "So for instance, you talked about exteroception, that sometimes it gives you information you take a perspective on to reflect on your internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6906.289,
    "end": 6907.95,
    "text": "And maybe you look at your internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6908.57,
    "end": 6914.873,
    "text": "But I think there is this danger that this abstraction starts to take over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6915.673,
    "end": 6918.494,
    "text": "Because there's a whole load of levels of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6919.79,
    "end": 6924.555,
    "text": " particularly when it's the embodied, which we can't see, and that's okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6924.595,
    "end": 6933.464,
    "text": "These blankets of blankets can go down and it's beyond our perception to take a thought on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6934.594,
    "end": 6956.959,
    "text": " And the reason that I think that can be interesting is because in action methods and psychodrama and these types of action approaches, rather than the Freudian approaches, which basically took over, is, OK, you can't take all these perspectives and analyze it in the way that we've got in this habit of doing, but these other ways of knowing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6957.759,
    "end": 6981.452,
    "text": " embodying exploring i think that that also is another direction which often is not thought about so i just think that um as we go into this um what you're saying and the way that we think about instrumentalization is that you know we might need to instrumentalize using the the sort of the more embodied",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6983.284,
    "end": 7009.231,
    "text": " effective methods and processes as well as this kind of other approaches because i think that we will hit the limits of an analysis and i think that might be something that this conversation sort of talked about so anyway i just thought i'll put that there if you've got any thoughts on that and i'll thanks a lot for a great presentation yeah i mean i think you make a very good point and that's uh and thanks for the compliment and i mean this um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7010.103,
    "end": 7034.179,
    "text": " the connection, the integration across levels, let's say, that's important for your well-being, then what you describe is a very logical pathway to improve people's mental state in the end as well when they're more connected with their embodied existence instead of living in that abstract space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7036.363,
    "end": 7047.925,
    "text": " I mean, I think I have, as a scientist, I have probably increased risk of going down that path because you're always thinking about this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7052.246,
    "end": 7055.287,
    "text": "I totally agree that that's probably in many treatments, actually.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7055.907,
    "end": 7061.208,
    "text": "I mean, that's why meditation appears to be such an effective tool as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7063.819,
    "end": 7064.92,
    "text": " Yeah, thanks for the thoughts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7064.96,
    "end": 7065.68,
    "text": "Yeah, very good point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7066.08,
    "end": 7068.48,
    "text": "Yeah, thanks so much, everyone, for participating.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7068.58,
    "end": 7070.821,
    "text": "And Casper, you're not always thinking.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7070.901,
    "end": 7075.402,
    "text": "Sometimes you're coming on and hanging out with us, I guess, but maybe thinking during that too.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7075.622,
    "end": 7078.183,
    "text": "But really fun discussion.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7078.643,
    "end": 7083.244,
    "text": "We hope to have all of you on again, whether it's a paper you've authored or not.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7083.804,
    "end": 7084.404,
    "text": "So thanks a lot.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7084.704,
    "end": 7087.185,
    "text": "And yeah, until next time.",
    "speaker": "SPEAKER_08"
  }
]