[
  {
    "start": 8.288,
    "end": 11.195,
    "text": " Hello, welcome to the Active Inference live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.416,
    "end": 14.263,
    "text": "This is Active Inference live stream number 19.0 on April 1st, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.151,
    "end": 44.356,
    "text": " welcome to the active inference lab we are a participatory online lab that is communicating learning and practicing applied active inference you can find us at our links here this is a recorded and archived live stream so please provide us with feedback so that we can improve on our work all backgrounds and perspectives are welcome and we'll be following good video etiquette for live streams as outlined in this checklist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.952,
    "end": 60.538,
    "text": " this is the schedule that we've had so far for 2021 and the upcoming two discussions on april 6th and the 13th will be number 19.1.2 on this paper that we're going to be discussing today",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.724,
    "end": 81.594,
    "text": " So right now in 19.0, the goal is to set the context and give a little background for 19.1 and 19.2 and people who are just learning about the paper, which is Deeply Felt Affect the Emergence of Valence in Deep Active Inference by Hesp, Smith, Parr, Allen, Fristen, and Ramstead in 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.015,
    "end": 86.739,
    "text": " And this video is definitely just an introduction to the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.519,
    "end": 103.215,
    "text": "It's meant to be a two-way on-off ramp from Active Inference, so exposing the Active Inference community to ideas outside of Active Inference and people who might be interested in some of the bigger ideas, connecting them to the Active Inference implementations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.255,
    "end": 107.676,
    "text": " And we have a bunch of sections planned for today in 19.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.036,
    "end": 114.939,
    "text": "So thanks a lot to Stephen and to Blue for helping with the slides and for coming on today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.499,
    "end": 123.902,
    "text": "So maybe we can just introduce ourselves briefly and then we can go on to the rest of the slides we have prepared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.022,
    "end": 127.963,
    "text": "So I'm Daniel, I'm a postdoc in California and I'll pass to Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.693,
    "end": 130.534,
    "text": " Hello, I'm Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.594,
    "end": 131.515,
    "text": "I'm in Toronto.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.535,
    "end": 136.86,
    "text": "I'm doing a practice-based PhD around social topographies and community-based development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 137.281,
    "end": 138.462,
    "text": "And I'll pass it over to Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.304,
    "end": 141.425,
    "text": "Hi, I'm Blue Knight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 141.685,
    "end": 145.189,
    "text": "I am an independent research consultant based out of New Mexico.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.971,
    "end": 147.191,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.772,
    "end": 162.635,
    "text": "Well, I think this was a fun paper for us to read and we can just go right into what were some of the big points of the paper and the background ideas before we go through the figure and the model, which will take up a lot of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.971,
    "end": 168.836,
    "text": " The paper is called Deeply Felt Affect, the Emergent Surveillance and Deep Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.617,
    "end": 173.861,
    "text": "And it was published in the journal Neural Computation in 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.102,
    "end": 179.527,
    "text": "And so I'll read the first one and then either of you can give a thought on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.608,
    "end": 182.049,
    "text": "In this letter, meaning paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.967,
    "end": 198.017,
    "text": " We demonstrate that hierarchical, deep Bayesian networks solved using active inference afford a principled formulation of emotional valence, building on both the work mentioned above as well as prior work on other emotional phenomena within the active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.403,
    "end": 204.664,
    "text": " Yeah, so that's just given us that insight into this idea of valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.724,
    "end": 210.186,
    "text": "So we'll be speaking about that more, but that's an important part of this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.466,
    "end": 212.466,
    "text": "I'll say the next one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.927,
    "end": 228.191,
    "text": "Our hypothesis is that emotional valence can be formalized as a state of self that is inferred on the basis of fluctuations in the estimated confidence or precision an agent has in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.642,
    "end": 233.503,
    "text": " her generative model of the world that informs her decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.844,
    "end": 236.124,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.524,
    "end": 245.426,
    "text": "So we're going to be connecting some of the decision-making aspects of agents and inference aspects of agents to emotional valence, and they're going to demonstrate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.926,
    "end": 249.007,
    "text": "So those are the goals and the claims that they set out in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.387,
    "end": 253.048,
    "text": "Any thoughts, Blue, or do you want to go to big questions and maybe introduce a big question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.108,
    "end": 255.128,
    "text": "I'll introduce the big questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 255.549,
    "end": 255.829,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.929,
    "end": 257.329,
    "text": "Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.324,
    "end": 269.221,
    "text": " So the big questions of this paper were, how can we make more active inference models or agents that are expressive, powerful, realistic, and interpretable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 270.37,
    "end": 271.591,
    "text": " What are the implications of this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.291,
    "end": 282.598,
    "text": "Active inference formalizes our survival and procreation in terms of a single imperative to minimize the divergence between observed outcomes and phenotypically expected, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.279,
    "end": 289.743,
    "text": "preferred outcomes under a generative model that is fine-tuned over phylogeny and ontogeny.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.364,
    "end": 291.825,
    "text": "Thoughts on this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.016,
    "end": 306.428,
    "text": " The first one, this to me is about just developing the active inference framework to capture more of the patterns that we see in nature or in designed systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.909,
    "end": 309.992,
    "text": "So how do we make systems that plan for multiple time steps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.092,
    "end": 311.453,
    "text": "That's deep active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.873,
    "end": 315.277,
    "text": "How do we make agents that interface with the environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.597,
    "end": 318.48,
    "text": "So that's sort of a big move overall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.1,
    "end": 334.079,
    "text": " and then this is going to be zooming in on the valence and some of those affective aspects that's on the first point and then the second this is a quote from the paper and it says something that active inference does it formalizes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 335.683,
    "end": 360.71,
    "text": " survival and procreation not in terms of evolutionary fitness again you could agree or disagree with the authors or think it's consistent with fitness or not but claiming that the imperative is to minimize a specific kind of a divergence and so what are the implications of that if you think okay well if that's the imperative then where's the situation where we've been acting like there's a different imperative and is that consistent or inconsistent with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.75,
    "end": 383.99,
    "text": " um this and then the last quote and then someone could give a thought is a quote where they say we conclude with a discussion of the implications of this work such as the relationship between implicit metacognition and affect connections to reinforcement learning and future empirical directions so what does active inference or this model say about cognition or metacognition and reinforcement learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.246,
    "end": 388.088,
    "text": " Yeah, if I could add something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.148,
    "end": 396.838,
    "text": "I think it really opens up a lot of the philosophical questions and starts to give a modelling interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.858,
    "end": 401.643,
    "text": "So how the body comes in, so the emotion starts to tie in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.364,
    "end": 407.03,
    "text": " to a way that the body comes in and inactive inference starts to become modelable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.071,
    "end": 417.262,
    "text": "And it starts to also show how affect is somehow connected to all cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.263,
    "end": 435.502,
    "text": " and all processes so it's not some weird artifact of shame which might be more of a freudian trap but it's actually an integration of the cybernetic process all the way through in some way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.062,
    "end": 437.542,
    "text": " Very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.722,
    "end": 451.629,
    "text": "It's also captured a little bit on this slide, which is recycled from some 2020 vintage Act-Inf, which is asking about how Active Inference is going to be saying something about the relationship between agents in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.41,
    "end": 460.474,
    "text": "And we're imagining an agent, not a one-step tic-tac-toe player, but we're thinking about an agent that's imagining through deep time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.014,
    "end": 463.736,
    "text": " and they have imagination or the capacity to simulate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.376,
    "end": 469.479,
    "text": "And then they have affect, and they can also predict their affect and have precision and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.839,
    "end": 473.721,
    "text": "So here's sort of the drama masks for the positive and negative affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.222,
    "end": 481.166,
    "text": "And then there's sort of different world trajectories that are being estimated through time that lead to positive or negative sentiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.079,
    "end": 485.202,
    "text": " And that gets around some of the sort of basic considerations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.242,
    "end": 493.169,
    "text": "Like in the paper, they say, well, wouldn't the agent, as they meet their demise, wouldn't they have precision over their sensory states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.749,
    "end": 498.974,
    "text": "And the answer is like, yes, but it's not part of a long-term trajectory that involves desired preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 499.514,
    "end": 504.238,
    "text": "So by appealing to model nesting, some of the sort of single-layer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.339,
    "end": 514.514,
    "text": " not paradoxes, but just scenarios that models might fall into, like always going with what was known before, never going what was known before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.534,
    "end": 517.839,
    "text": "These can be resolved just with empirical modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.037,
    "end": 520.518,
    "text": " Interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.758,
    "end": 534.779,
    "text": "One reason why it matters and we'll come back to this when we quote the authors later, is that these kinds of richer models lead more closely to experimentally tractable and unique predictions of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.62,
    "end": 542.144,
    "text": " because if the only thing the model predicts is the reaction time, that might fit the distribution better than some other model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.645,
    "end": 557.875,
    "text": "Now if it can also fit the reaction time and the EEG and also the self-report, it's starting to become a very rich multimodal and multi-measurement way of talking about behavior, which is what a good instrument should do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.675,
    "end": 583.282,
    "text": " so this is helping us come closer through these contact points with other big important areas of research like reinforcement learning and autonomous computer agents and just inference agents of all kinds especially ones with action but then maybe some of these other areas that we'll bring into the discussion because if we can have a scale free framework that does apply to cognitive agents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.369,
    "end": 605.076,
    "text": " and then we frame it in terms of the input and the output and the actions and the policy, the generative model, all of these terms, maybe some of these other systems like online teams might be able to also be said to have at least computationally affective charge or precision or different things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.277,
    "end": 609.018,
    "text": "So we kind of talked a little bit about that in our 2020 paper for online teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.956,
    "end": 618.336,
    "text": " Any thoughts on sort of the bigger topics that this paper is up against before we jump into the abstract and the figures and everything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.7,
    "end": 633.584,
    "text": " If I could just say one thing I think that's very interesting is that it opens up the realities of trying to bring in the mind, the body, and the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 634.204,
    "end": 636.545,
    "text": "And there's been this question, well, how do you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.785,
    "end": 638.946,
    "text": "And why didn't we do that before?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.966,
    "end": 642.667,
    "text": "It was partly because we wanted to be able to measure things and lock things down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.327,
    "end": 648.789,
    "text": "And the question of how do you bring this whole dynamic in, how could you possibly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.409,
    "end": 663.605,
    "text": " get a handle on all of that well emotion seems to actually make a lot of sense in terms of or let's say valence should say valence more broadly makes sense in terms of how it could be calibrated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.466,
    "end": 667.207,
    "text": " um, the more conscious levels of that process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.587,
    "end": 686.996,
    "text": "Um, so I think that has implications for scaling psychology, um, and bringing consciousness back into psychology, um, and helping to really move into a ecological and ecosystem approach to psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.799,
    "end": 694.915,
    "text": " Lou, any thoughts or do you want to start with the first part of the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.919,
    "end": 696.76,
    "text": " I'll hold my thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 697.22,
    "end": 701.823,
    "text": "I have some, but I don't want to ruin the surprise of the paper, so let's start off on the abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 702.223,
    "end": 702.584,
    "text": "Agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.684,
    "end": 703.204,
    "text": "Fun times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.424,
    "end": 703.725,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.885,
    "end": 707.127,
    "text": "Does anyone want to start with the first part of the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.767,
    "end": 708.248,
    "text": "I'll take it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 708.508,
    "end": 709.288,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 709.629,
    "end": 722.478,
    "text": "The positive-negative axis of emotional valence has long been recognized as fundamental to adaptive behavior, but its origin and underlying function have largely eluded formal theorizing and computational modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 723.238,
    "end": 733.347,
    "text": " Using deep active inference, a hierarchical inference scheme that rests on inverting a model of how sensory data are generated, we developed a principle Bayesian model of emotional valence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 734.048,
    "end": 745.939,
    "text": "This formulation asserts that agents in further valence state based on the expected precision of their action model, an internal estimate of overall model fitness, which the authors term subjective fitness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.122,
    "end": 758.147,
    "text": " This index of subjective fitness can be estimated within any environment and exploit the domain general generality of sorry, my screen is in the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.348,
    "end": 762.249,
    "text": "Second order beliefs, which are beliefs about beliefs there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 763.837,
    "end": 764.097,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.837,
    "end": 773.84,
    "text": "So in this first part of the abstract, kind of priming what this whole research agenda is about, I'm seeing a few threads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.56,
    "end": 781.702,
    "text": "One is about fitting good models, overall model fitness, especially with a subjective twist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.762,
    "end": 787.164,
    "text": "So that's another kind of a bonus that it's actually not just objective model fitness, it's subjective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.244,
    "end": 790.225,
    "text": "So it's about good fitting models with this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.845,
    "end": 814.301,
    "text": " recognition that that's like personalized okay so that's cool thread then there's the first words which are about the positive and negative aspect of emotional valence which is despite the richness and the amount of experiences and all the diversity of altered states of consciousness and adjectives there's also kind of this um approach versus recede binary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 815.422,
    "end": 818.485,
    "text": " And this is, as they're saying, it's fundamental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.885,
    "end": 825.21,
    "text": "And we see it in living forms like go-no-go signaling, and we also see it in computational agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.95,
    "end": 838.1,
    "text": "And so this is putting a lot of different kinds of systems that have very nuanced maybe behavior in their outputs, but at a top level, they act as if they have a sort of go-no-go",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.7,
    "end": 842.661,
    "text": " that in a way helps them be adaptive in their own niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.121,
    "end": 854.664,
    "text": "And then the way that they're gonna go about that is actually with a second level or second order cybernetics model, which is by enabling belief about belief, maybe some of these gaps between systems can be bridged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.604,
    "end": 863.666,
    "text": "So interesting research questions that are not always brought out because the abstract is so reduced and they have to say what they did do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.146,
    "end": 867.067,
    "text": "But for those who are interested in those questions, that's good to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.962,
    "end": 870.562,
    "text": " I'll read this one and then anyone can give a thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.423,
    "end": 880.565,
    "text": "We show how maintaining internal valence representations allow the ensuing effective agents to optimize confidence in action selection preemptively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.225,
    "end": 889.107,
    "text": "Valence representations can in turn be optimized by leveraging the Bayes optimal updating term for subjective fitness, which we label affective charge or AC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.068,
    "end": 897.71,
    "text": "AC tracks changes in fitness estimates and lends a sign to otherwise unsigned divergences between predictions and outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.61,
    "end": 925.071,
    "text": " that's pretty interesting we simulate the resulting affective inference by subjecting an in silico in the computer affective agent to a teammates paradigm requiring context learning followed by context reversal this formulation of affective inference offers a principled account of the link between affect mental action and implicit metacognition it characterizes how a deep biological system can refer its affective state to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.831,
    "end": 950.627,
    "text": " and reduce uncertainty about such inferences through internal action i.e top-down modulation of priors that underwrite confidence so this for me like was a big surprise of the paper like the the valence and um the relationship with valence and subjective fitness so or precision accuracy this was just a really different take like compared to the last",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 950.967,
    "end": 976.556,
    "text": " paper that we did just like on valence was very much like positive or negative in terms of like feeling or emotion, where this is like really positive or negative, just based on like surprise, essentially like what, if my model doesn't match my expectations, like, or the outcomes, if my expectations don't match my outcomes, that is negative valence, which that was a kind of surprising take on this for me, compared to the last valence paper that we did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 977.036,
    "end": 979.317,
    "text": "And the other thing is really this,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 980.797,
    "end": 996.249,
    "text": " The way that they've modeled this is totally like a perfect example, as they talk about in the discussion of the Bayesian brain and why Bayesian statistics and updating, like, especially when they talk, well, I'll hold my thought for them for that time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.589,
    "end": 1000.052,
    "text": "But really, this was just an exemplary paper for that for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.053,
    "end": 1001.313,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.333,
    "end": 1002.414,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1003.587,
    "end": 1020.432,
    "text": " one one thing that came up for me there is it talks about you know representations again and those so this idea that internal valence representation so suddenly we've got a way to bring representations back into um what had become quite a non-representational",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.412,
    "end": 1045.342,
    "text": " modeling approach and that's really interesting because it's like normally you think of representations previously like the most concrete is the thought then there's the body and there was this fuzzy thing called emotions which somehow was there and axiology and all this stuff but now it's like well wait you've got an internal valence representation which could inform the body and the cybernetic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.13,
    "end": 1049.111,
    "text": " thinking metacognition process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.151,
    "end": 1057.335,
    "text": "So it gives a way in for representations, but it's not representations as we normally maybe approach that term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.355,
    "end": 1058.116,
    "text": "So that's quite cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1058.756,
    "end": 1058.996,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.696,
    "end": 1059.937,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.517,
    "end": 1062.738,
    "text": "Third abstract, who would like to read it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.805,
    "end": 1066.686,
    "text": " Okay, I'll read this one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.926,
    "end": 1076.452,
    "text": "Thus, we demonstrate the potential of active inference to provide a formal and computationally tractable account of affect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.452,
    "end": 1085.778,
    "text": "Our demonstration of the face validity and potential utility of this formulation represents the first step within a larger research program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.131,
    "end": 1097.853,
    "text": " Next, this model can be leveraged to test the hypothesized role of valence by fitting the model to behavioral and neuronal responses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.181,
    "end": 1119.388,
    "text": " nice so they set up the problem by being about using higher order cognition this second level modeling to approach some of the interesting dynamics of agents like their apparent affective charge influencing their behavioral decisions in the present moment based upon inference about the future",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.308,
    "end": 1142.618,
    "text": " and they're going to demonstrate a simulation there's going to be kind of a model layer and then there's going to be a simulation that goes down into the team maze and a mouse and so there's sort of two levels of generality that we're going to go through here they start the paper with the qualitative but still rigorous level of generality which is just talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.9,
    "end": 1155.307,
    "text": " action in different systems and multi-scale biology and the need to integrate bayesian approaches into how we think about evolution and development ecology and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.26,
    "end": 1181.136,
    "text": " And then they turn directly to the methods and perform this four-step walkthrough that will be somewhat familiar to those who have seen Model Stream 1 with Ryan Smith and Christopher White, where they also step through the construction of this model, but it's something that, as we'll probably see soon, it's just always worth it to kind of build up this model incrementally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.177,
    "end": 1182.417,
    "text": "Then they...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.378,
    "end": 1207.287,
    "text": " with this implicit metacognitive model at step four of their models elaboration they discuss a few kinds of important key terms that are like bridges between previous computational psychological models and their active inference model and then they implement a simulation with a rat in a team base",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.223,
    "end": 1209.324,
    "text": " which we'll discuss as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.205,
    "end": 1221.074,
    "text": "And then they bring up all these very interesting questions towards the discussion section of the paper, some of which we've excerpted and conclude with a discussion on the future empirical directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.835,
    "end": 1229.121,
    "text": "So before we go into the affect and valence model simulation implications, any thoughts on the roadmap?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.243,
    "end": 1234.706,
    "text": "All right, let's go to affect and valence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.418,
    "end": 1241.342,
    "text": " This is quoting from their paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.742,
    "end": 1249.009,
    "text": "So definitely read it to see everything that they say, but they refer to classical constructs of valence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.849,
    "end": 1255.615,
    "text": "So maybe here just representing the classical valence construct on a kind of clock chart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.295,
    "end": 1263.582,
    "text": "What would either of you think or say about valence or what motivates the study of valence this way or overall?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.447,
    "end": 1270.608,
    "text": " So I just had a comment and it's based on something that the authors had said about valence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1271.168,
    "end": 1278.17,
    "text": "So here we've got the arousal and like high and low arousal on one axis and positive and negative on the other axis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1278.33,
    "end": 1289.753,
    "text": "But the authors had mentioned that some people see valence as like an array of positive, like it's a positive and negative are two separate axes of valence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.793,
    "end": 1291.173,
    "text": "And I thought that that was very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1291.593,
    "end": 1303.341,
    "text": " Whereas it's not a binary choice, positive and negative, but there's a range of positive and there's a range of negative and ambivalence contains some degree of both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1303.721,
    "end": 1306.403,
    "text": "I thought that that was an interesting take on valence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.523,
    "end": 1310.105,
    "text": "Not something I've thought about before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1310.964,
    "end": 1311.244,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.504,
    "end": 1316.248,
    "text": "And they bring up good scholarship with bringing up a unidimensional view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.949,
    "end": 1321.812,
    "text": "So that would be like, yes, there's like a thermometer and it's kind of just like it goes up or down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.872,
    "end": 1332.66,
    "text": "It's a number that has to be strictly ordered and less than and greater than, maybe even linearly correlated with a hormone or a chemical or a neural firing in some region or a pattern of activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.301,
    "end": 1335.542,
    "text": "Then maybe there's multiple dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.083,
    "end": 1338.184,
    "text": "Maybe there's like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.345,
    "end": 1346.132,
    "text": " As here, high to low arousal and high to low valence, positive, negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.493,
    "end": 1348.554,
    "text": "Maybe it's multidimensional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.794,
    "end": 1362.166,
    "text": "So what's cool about the active inference framework is we could test the computational roles of these kinds of variables and ask, okay, this is fitting the data better, but is it...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.706,
    "end": 1366.748,
    "text": " more parameters, is this worth the trade-off that we're getting here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.468,
    "end": 1389.603,
    "text": "So we're kind of taking this single dimensional model and thinking about it with a family of other models where we could test the influence of other factors and see if such patterns are detectable in the data or ask what kind of behavioral settings or groups or questionnaires or whatever it might be would elicit a differentiation on another hypothesized axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.339,
    "end": 1401.622,
    "text": " Yeah, and just one thing that goes with that is it sort of shows you the current ways to get at this is kind of through self-reported emotions and using this kind of graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.642,
    "end": 1409.064,
    "text": "And I actually have used this tool with our community with disabilities for reporting back on their experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.764,
    "end": 1422.968,
    "text": " But you're essentially still getting this emotion as a self-report and trying to track back using sort of assumptions about how that plots with other self-reported emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.268,
    "end": 1431.59,
    "text": "And this is also used a lot in market research for marketing and advertising, this tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.61,
    "end": 1433.551,
    "text": "But actually in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.711,
    "end": 1441.296,
    "text": " This approach here, they've got a way to access this without just getting self-reported words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.997,
    "end": 1449.463,
    "text": "So this, I think, shows how it has, you know, this is an area that's got a lot of application potentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.483,
    "end": 1450.884,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.23,
    "end": 1460.138,
    "text": " Here is a slide just upon differentiation in English between affect and effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.178,
    "end": 1464.683,
    "text": "So not to split hairs or to introduce words that they didn't use in the paper like effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.164,
    "end": 1467.226,
    "text": "But what would be the point on this, Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.099,
    "end": 1474.046,
    "text": " Well, you've got, just to give the sense that it is often confusing, those two terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.066,
    "end": 1482.958,
    "text": "So if we have the person, these two people on the left, so you've got the person X's experiences and effect at some sort of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.259,
    "end": 1488.72,
    "text": " you know, relationship to person Y and it's, it's created some affect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1488.76,
    "end": 1494.122,
    "text": "Now that could be anger if it was reported later and they said, what was their emotional state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.802,
    "end": 1503.744,
    "text": "And this affect contributes to a policy selection where person X interacts with person Y and pushes them into the pool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.605,
    "end": 1505.445,
    "text": "So you can see that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.565,
    "end": 1505.845,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.865,
    "end": 1509.626,
    "text": "So that, that, um, the effect of this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.371,
    "end": 1513.632,
    "text": " is that that person winds up in the pool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.652,
    "end": 1522.735,
    "text": "So there's an act and there's a cause-effect type of linear type of mechanical action that happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.635,
    "end": 1529.417,
    "text": "And of course, then there can be additional affects on both the parties and effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.376,
    "end": 1536.0,
    "text": " resulting from this, particularly if the person was to drown or something, depending on the scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.12,
    "end": 1548.349,
    "text": "So I think it shows that there's a kind of, one's more dynamical and relational, and one is more objective, I suppose you could say, and cause and effect related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.872,
    "end": 1550.372,
    "text": " Sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.952,
    "end": 1561.615,
    "text": "And here was from a previous discussion, I think number 11, where we talked also about affect and about trajectories through affect space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.295,
    "end": 1578.199,
    "text": "So whether or not it's like how things quote really are, it might be a behavioral index or summary statistics of someone's online activity, even if you're not directly measuring them or getting their self-report, and there can be trajectories through this space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.12,
    "end": 1579.422,
    "text": " Now, one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.56,
    "end": 1610.18,
    "text": " topic that um a sort of detail that's a little bit special for active inference that doesn't get emphasized a ton is that basically the certainty in the model is one and the same thing as having better affect better affective charge increasing certainty and high certainty in the model are taking the place in a reward centric of highest expected for example value and it's one major difference between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.901,
    "end": 1621.606,
    "text": " active inference approach to thinking about economics or decision-making versus a sort of just like classical maximum likelihood reward maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.306,
    "end": 1629.19,
    "text": "So in these active inference frameworks, they're not modeling a happy to sad variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.87,
    "end": 1631.691,
    "text": " and calling that affective charge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.272,
    "end": 1644.46,
    "text": "They're actually modeling a precision variable and then saying that when things are more precise and are getting more precise, there is low negative affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.82,
    "end": 1646.261,
    "text": "So it's kind of like positive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.681,
    "end": 1653.606,
    "text": "And then anxiety, like negative affect, arises as a function of uncertainty in the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.967,
    "end": 1660.954,
    "text": " And here's just some words and some thoughts that we had put on anxiety from a previous one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.515,
    "end": 1671.386,
    "text": "But any thoughts on this about this sort of integration of valence and certainty rather than valence and expected average?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.087,
    "end": 1675.491,
    "text": "What that means or how that's different than other models that others have seen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.967,
    "end": 1683.952,
    "text": " Yeah, well, I think that does have quite important implications because it's now prospective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.972,
    "end": 1694.379,
    "text": "It's kind of what was the contextual expectation on where things would go as opposed to just it being this kind of static",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.24,
    "end": 1720.403,
    "text": " expectation on the moment itself and it's all collapsed down into sort of some sort of reductive there's the idea that there's the person's valence is dynamic in relation to you know their expectation but then there's also the precision at which that expectation then resolved or didn't resolve you know so you may expect things to go badly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.164,
    "end": 1728.012,
    "text": " and then things went worse than you expected, or it went better than you expected, but it still might have gone badly, but it didn't go as bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.032,
    "end": 1733.699,
    "text": "So it gives you that much more, well, I don't know, I wouldn't use the word realistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1733.719,
    "end": 1737.784,
    "text": "I don't know what term you'd use for that, Daniel, but yeah, that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.505,
    "end": 1738.765,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.966,
    "end": 1739.146,
    "text": "Luke?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.645,
    "end": 1747.247,
    "text": " So I can't remember which paper it was exactly, but it was talking about anxiety.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1747.267,
    "end": 1753.59,
    "text": "It was one that we did on the live stream talking about anxiety as like a fixation on the future, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1753.67,
    "end": 1756.692,
    "text": "And it talks about depression as a fixation on the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1757.052,
    "end": 1769.018,
    "text": "Wasn't the big five, I feel like it was the big five paper, but that is just an interesting and kind of different perspective on anxiety as relative to the valence that's presented here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1771.391,
    "end": 1771.631,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.552,
    "end": 1784.72,
    "text": "And the question of how to map model parameters to experiences that we have, which are encultured and which are relating to our individual kind of qualia, that's a big jump too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.0,
    "end": 1794.386,
    "text": "So we shouldn't just instantly also paper over the computational psychiatric gap, but that's what we're gonna unpack is what does the model really say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.406,
    "end": 1797.308,
    "text": "And then what is that gonna help us do or rethink?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.39,
    "end": 1815.74,
    "text": " One note is that they wrote that they are referring to their model, distincting it from just sort of active inference more broadly as affective inference, because it sort of has the active in there, but it also has affect in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.581,
    "end": 1821.484,
    "text": "And they're saying there's what makes it different than just general active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.524,
    "end": 1827.547,
    "text": " And one attribute that they apply here is deep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.627,
    "end": 1835.072,
    "text": "So that's meaning deep through time or potentially also using deep learning, like deep neural network approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.432,
    "end": 1841.956,
    "text": "We had, I think, Christopher White or someone, it all blurs together, but somebody gave a few senses of deep active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.617,
    "end": 1847.479,
    "text": "And then they're also modeling affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.894,
    "end": 1851.436,
    "text": " And so that's why they call it affective inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.776,
    "end": 1853.357,
    "text": "So it's deep affective inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.738,
    "end": 1869.41,
    "text": "So if you know what active inference kind of is about, they're taking that skeletal framework and extending it through time and adding an affective parameter or set of interacting variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.23,
    "end": 1874.654,
    "text": "Way to think about and model the kinds of things that people study affect in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.194,
    "end": 1877.176,
    "text": "That's what they want to study with this new development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.696,
    "end": 1878.257,
    "text": "So that's kind of what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.517,
    "end": 1898.809,
    "text": " think they're doing in this paper and um it's also a little more general than just affect because as they say it can generalize to potentially other higher level explanations for conditional dependencies between higher level parameters and how they reflect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.389,
    "end": 1928.898,
    "text": " behavioral outcomes so that's a pretty general statement that's very important though it's saying that it could be possible to have other higher hidden states that cognitive ideas let's say and those don't have to be just the positive or negative approach or recede that they model here it could be something that's a lot more subtle or symbolic or categorical rather than this is more of like foraging go no go so this is a initial foray into this kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.319,
    "end": 1934.656,
    "text": " deep and hyperparameter reaching back down affective in that sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.894,
    "end": 1940.257,
    "text": " And it's tied to the affect rather than to the, for example, cognitive work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.577,
    "end": 1942.819,
    "text": "But it's, as they say, implicitly metacognitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.399,
    "end": 1948.563,
    "text": "And Stephen, as you said, it's not that affect is latent, latent, latent, and then like strikes into the scene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.843,
    "end": 1954.948,
    "text": "It's actually that there's this sort of fundamental cybernetic role for affect regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.528,
    "end": 1959.291,
    "text": "So it's not a red flag mode that is explosive or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.851,
    "end": 1961.993,
    "text": "It's something that's intrinsic like metabolism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.965,
    "end": 1985.403,
    "text": " okay they uh bring up a lot of previous work and some limitations of the model so check out the paper more if you want to learn about for example if you think well that's a very narrow uh model definition of valence they might bring it up in their paper so check that out but let's just get right into what the model is and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.571,
    "end": 1990.132,
    "text": " there's gonna be sort of two acts coming up here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.292,
    "end": 1996.074,
    "text": "There's gonna be the model, which is just the mathematics of what they lay out and the formulas they lay out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.555,
    "end": 2002.317,
    "text": "And then we're gonna go into the simulation with the mouse or the rat or the ant or whatever in the team mates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.917,
    "end": 2004.298,
    "text": "So the first is gonna be general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.718,
    "end": 2008.119,
    "text": "And the second is gonna go into a simulation that they're gonna get results from as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.659,
    "end": 2014.662,
    "text": "So we're gonna walk through kind of four clicks in the elaboration incrementally as they write.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.462,
    "end": 2017.283,
    "text": " on an active inference model, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.664,
    "end": 2019.004,
    "text": "So fun stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.365,
    "end": 2021.366,
    "text": "Thanks everyone also for joining live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.067,
    "end": 2023.928,
    "text": "So here we are in figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.169,
    "end": 2026.349,
    "text": "Who would like to go first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.59,
    "end": 2029.291,
    "text": "Maybe Blue, you annotated this really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.351,
    "end": 2032.974,
    "text": "So what did you see in figure one with model one and model two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.413,
    "end": 2035.753,
    "text": " Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2035.913,
    "end": 2046.58,
    "text": "So model one is the generative model of perception, which we've seen before, where S is hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2047.1,
    "end": 2049.021,
    "text": "O stands for observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2049.882,
    "end": 2051.723,
    "text": "D is prior belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2052.464,
    "end": 2056.926,
    "text": "A is this likelihood mapping or like a probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2057.727,
    "end": 2059.368,
    "text": "And then tau is time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2059.988,
    "end": 2060.828,
    "text": " which we've seen before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2060.868,
    "end": 2062.649,
    "text": "So in M1, there's no time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2063.069,
    "end": 2067.231,
    "text": "This is the first step of a generative model and it's just perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2067.311,
    "end": 2076.154,
    "text": "So it's like sensory input and the posterior over hidden states is all that's really taken into the model of perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.974,
    "end": 2093.375,
    "text": " And then the M2, so as the models, as we go through these M1, M2, M3 and M4 in the next few slides, there's an increasing layer of complexity as we transition from M1 to M2 to M3 and then M4, with M4 being the most complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.675,
    "end": 2112.448,
    "text": " And so in M2, which is the generative model of anticipation, the idea of perception is then extended forward and backward into the past, if you want to go there, using a transition matrix, which is this b sub t, to represent the hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.688,
    "end": 2126.116,
    "text": " So it's just an extension of perception, essentially, and it includes anticipation, what you expect to happen, as opposed to just the sensory input, which is just what's present in M1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2126.796,
    "end": 2129.438,
    "text": "So it's anticipating hidden states over time, M2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2131.719,
    "end": 2131.98,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.44,
    "end": 2132.76,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.781,
    "end": 2134.681,
    "text": "Good explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.602,
    "end": 2142.046,
    "text": "And we can look at some of their... Anything else to add, actually, or ask here, Stephen, on Figure 1?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.083,
    "end": 2143.863,
    "text": " That was really helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2143.883,
    "end": 2151.546,
    "text": "I mean, the only thing I might add is, as you were mentioning that, is it's almost like the predicted input in that funny sort of way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.566,
    "end": 2161.309,
    "text": "It's like, so what's the predictions of what the sensory input is if I could sort of somehow infer that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.369,
    "end": 2162.79,
    "text": "And that's that dynamical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.81,
    "end": 2165.451,
    "text": "So I think this is really helpful, though, to go through it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.991,
    "end": 2187.478,
    "text": " yep and to give a note on that a lot of times when people think statistics they think descriptive statistics like we're going to take the big data set the big you know image data set and we're going to describe it with a summary statistic and that does map onto this topology like observations get mapped through likelihood onto the most optimal state of the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.058,
    "end": 2195.761,
    "text": " But where generative Bayesian modeling comes into play is that that model that's inferred, that hidden state, what is the real temperature?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.881,
    "end": 2197.982,
    "text": "Or what is the real average height of the classroom?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.603,
    "end": 2204.885,
    "text": "It can also be used to generate and to combine with other models to generate testable distinctions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.905,
    "end": 2206.246,
    "text": "It can generate data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.786,
    "end": 2212.649,
    "text": "And then this duality where you can take a little bit or a ton of data and then update your prior,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.062,
    "end": 2225.929,
    "text": " already using the Bayesian terminology and then use those prior estimates to generate more data, that is like expectation maximization or EM optimization or the parametric empirical Bayes approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.67,
    "end": 2233.334,
    "text": "So it's not just taking big data and crunching it into a regression coordinate and saying, all right, we found the most likely one, it's done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.854,
    "end": 2238.217,
    "text": "This is actually a framework that allows us to bounce back and forth between summaries of big data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.937,
    "end": 2241.52,
    "text": " and the actual large observations themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.041,
    "end": 2246.566,
    "text": "And then here you can think of the prediction is on a single observation with a single hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.626,
    "end": 2249.349,
    "text": "And here it's like getting a vector through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2250.05,
    "end": 2255.036,
    "text": "Then you can imagine that it would be more dimensions, but this is just the skeleton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.056,
    "end": 2257.018,
    "text": "So let's keep on walking through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.399,
    "end": 2257.519,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.699,
    "end": 2259.04,
    "text": " Let me interject here really quick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2259.06,
    "end": 2259.361,
    "text": "Sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2259.641,
    "end": 2260.582,
    "text": "So can you scroll back?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2260.602,
    "end": 2261.002,
    "text": "There we go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2261.062,
    "end": 2263.804,
    "text": "I love this, what the authors, how they describe perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2263.844,
    "end": 2264.905,
    "text": "I thought it was very clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.386,
    "end": 2277.537,
    "text": "They said perception corresponds to a process of inferring which hidden states or posterior expectations provide the best explanation for the observed outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2277.697,
    "end": 2278.718,
    "text": "I thought that that was very clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.858,
    "end": 2280.098,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.218,
    "end": 2286.945,
    "text": "And the softmax is the sigma, and that's just saying it's like a decision-making criterion function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.185,
    "end": 2291.689,
    "text": "But we can also ask the authors more because that's sort of a machine learning term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.709,
    "end": 2292.67,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.73,
    "end": 2294.812,
    "text": "Actually, just one very quick thing on that as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2294.852,
    "end": 2302.779,
    "text": "I like what Blue's just said there as well is by bringing it on the outcomes as opposed to that outcomes brings in action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.42,
    "end": 2303.68,
    "text": "So you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.081,
    "end": 2314.612,
    "text": " Because it's like the perception, it's not what the data is telling me, it's also the outcomes of what happened in the world with the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.632,
    "end": 2322.38,
    "text": "And that is really quite, I don't know if that's been so easy to bring in before in the language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.4,
    "end": 2323.662,
    "text": "So I thought that's quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2324.372,
    "end": 2324.572,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.692,
    "end": 2326.814,
    "text": "And we're going to bring policy in in a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.015,
    "end": 2328.056,
    "text": "But for now, you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.116,
    "end": 2331.178,
    "text": "We have the difference between the outcomes and the hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.639,
    "end": 2332.48,
    "text": "Is it raining or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.56,
    "end": 2333.381,
    "text": "That's the hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.501,
    "end": 2335.122,
    "text": "And then is my shirt wet or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.202,
    "end": 2336.924,
    "text": "That's the sensory state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.344,
    "end": 2339.166,
    "text": "Or why is my shirt wet, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.186,
    "end": 2340.027,
    "text": "Why is my shirt wet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.327,
    "end": 2364.583,
    "text": " yeah exactly but we haven't gotten to this policy level which is should i go outside so table one is just describing in a little bit more detail the p and the q distributions that they use um in their figure one for this like basic level and that uh comports their math with just the broader modeling bayesian statistics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.905,
    "end": 2394.125,
    "text": " letters used although the a b c d are sort of specific for active so let's go from that uh m2 model and bring in policy so this is m3 model this is the next click that actually gets us to the first thing that looks more like a real active inference model beyond just a bayesian time series approach so maybe blue go for it again with what you would say for m3",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.32,
    "end": 2401.004,
    "text": " So for M3, this is the third step, and this is the generative model of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2401.184,
    "end": 2421.579,
    "text": "So here it's inferring phenotype congruent policies from all of the terms that we had talked about in M1 and M2, and then this brings in policies, which that's pi policies, and then E sub pi is the baseline prior over the policies, and G sub pi is expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2422.259,
    "end": 2425.14,
    "text": " C is phenotype congruent preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2425.38,
    "end": 2430.582,
    "text": "And then F sub pi is the variational free energy conditioned on a policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2431.162,
    "end": 2434.243,
    "text": "So the policies are here, already here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2434.423,
    "end": 2440.985,
    "text": "And we just have these M2 is what's perceived over hidden states based on perception M1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2441.185,
    "end": 2448.588,
    "text": "So this is kind of just adding that extra layer, including policy into the action model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2449.448,
    "end": 2449.648,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.808,
    "end": 2460.471,
    "text": "So it says here, posterior policy beliefs are informed by the fit between anticipated and preferred outcomes, while at the same time minimizing their ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2461.551,
    "end": 2462.871,
    "text": "So to minimize that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2464.251,
    "end": 2465.312,
    "text": "So nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.632,
    "end": 2466.172,
    "text": "Thanks for this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.132,
    "end": 2473.814,
    "text": "A connection between variables in this kind of a graph represents them having like a statistical dependency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.494,
    "end": 2478.035,
    "text": "So we can look at pi, which is policy, and then ask, okay, so we had M2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.335,
    "end": 2485.283,
    "text": " which was this time series that looked kind of like a, I don't know, like a rake or something, or a horse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.765,
    "end": 2495.556,
    "text": "And then policy, Pi, gets linked in, not directly with the thumb on the scale influencing the hidden state,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.357,
    "end": 2503.84,
    "text": " but actually influencing B sub T, which is the transition matrix through time of that hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2504.52,
    "end": 2512.064,
    "text": "So one thing, because there's no pi onto the hidden state, you can't have policy at a snapshot, like timeless policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.224,
    "end": 2520.847,
    "text": "All policy is intrinsically related to the movement of time because it's hitting the B matrix, not because it's not plugging into a hidden state directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.127,
    "end": 2524.689,
    "text": "So you're always talking about a temporal model, just how deep are you talking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.449,
    "end": 2532.051,
    "text": " And then it also conditions the estimate of how the hidden state evolves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.171,
    "end": 2537.373,
    "text": "That's what that vertical line, like given, you know, A given B. So this is, we're going to do the time series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.793,
    "end": 2542.695,
    "text": "How much Bitcoin will I have under the policy of not acquiring any?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.275,
    "end": 2543.615,
    "text": "Zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.155,
    "end": 2544.895,
    "text": "Easy estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.476,
    "end": 2546.196,
    "text": "Easy heuristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.856,
    "end": 2549.917,
    "text": "So then those kinds of conditionalized conditions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.237,
    "end": 2573.131,
    "text": " estimates of different kinds of things can help agents act in the world so that's why policy is interesting to think about and so instead of thinking about how to optimize a massively complicated scheme for maximizing utility with an unknown variability this is allowing the agent to model how one is embedded in hidden states estimate or changing through time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.175,
    "end": 2574.956,
    "text": " So that's the pie part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.496,
    "end": 2577.758,
    "text": "And then also this is kind of explore exploit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.499,
    "end": 2585.525,
    "text": "So minimizing the ambiguity is one imperative, but also you want it to be fitting the whole time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.245,
    "end": 2592.13,
    "text": "Like I want my shoe to fit, but I also wanna figure out where it doesn't fit, but I need to be walking the whole time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.711,
    "end": 2594.793,
    "text": "And so by keeping a bunch of these features",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.343,
    "end": 2619.723,
    "text": " linked in the model the dials at least exist to modulate in really creative ways like e is this baseline prior and so you could modulate it so that the prior is relatively unperturbed by sensory outcomes or you could make it very sensitive to specific kinds of sensory outcomes so this is again like a modeling skeleton",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.444,
    "end": 2641.27,
    "text": " that potentially could be used to evaluate how different sorts of behavioral phenomena, like approach and proceed or something like that, or freeze, whatever it happens to be, might be linked by the organism seeking precision on an estimate of how things are going to change in the niche given its policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.97,
    "end": 2648.054,
    "text": " So of course there's a lot to say because it's kind of an interesting area, but that's just the third level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.574,
    "end": 2651.836,
    "text": "So we're integrating policy decision into how states are changing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.537,
    "end": 2660.482,
    "text": "And then policy decision is the interaction of several variables, the baseline prior, like the affordances, the habit, as some have said it here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.303,
    "end": 2669.705,
    "text": " And then C, the preferences, phenotype congruent is like if I'm a shoe size 10, I want a shoe size 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.445,
    "end": 2680.367,
    "text": "Then if you have a phenotypic preference that's different than what your actual niche or needs are, then it will be ill fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.727,
    "end": 2682.247,
    "text": "So you won't be fit for your niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.907,
    "end": 2686.228,
    "text": "So then the niche will be filled by those that are fit to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.62,
    "end": 2703.885,
    "text": " then f of pi is similar like it's um calculating variational free energy which we can definitely ask the authors more about and see how that is related to calculation on a specific policy you know yeah okay any thoughts either of you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.994,
    "end": 2714.783,
    "text": " Well, just one thing I think is quite helpful as well is they call that perceptual evidence, the variational free energy conditioned on a policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2715.343,
    "end": 2726.153,
    "text": "So it's like and then that gives you the sort of perceptual evidence and then the actual action model, which is kind of like the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.173,
    "end": 2727.874,
    "text": "And that helps sort of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2728.895,
    "end": 2753.891,
    "text": " um show how free energy is coming in at this kind of larger time scale and i suppose one thing just to mention to the viewers there is a whole load of nested free energy processes going into all of this process but at this scale that we're talking about it's so that we can understand in terms of policies that we're trying to understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.273,
    "end": 2755.933,
    "text": " Sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.874,
    "end": 2763.479,
    "text": "And so I want to add to your like shoe thing here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.539,
    "end": 2767.541,
    "text": "You know, anyone who has small children knows that their feet grow very fast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2767.601,
    "end": 2767.802,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2767.862,
    "end": 2777.188,
    "text": "So when we're talking about the action model, expected free energy, it's the expected free energy because I don't like the actual free energy can't really be measured in this situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2777.248,
    "end": 2778.529,
    "text": "So we're dealing with expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2779.009,
    "end": 2782.772,
    "text": "So there's this phenotypic risk component on the left side of the equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2783.072,
    "end": 2784.733,
    "text": "Like how much money am I going to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.873,
    "end": 2808.645,
    "text": " spend on these shoes and minus the the perceptual ambiguity like i think uh my kid is a size 13 but they might be a one or two how expensive are these shoes do i want to buy shoes that fit them right now or do i want to buy shoes that they can wear two pairs of socks with and wear for a little while so you're always weighing out this this risk and the ambiguity that that occurs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2809.733,
    "end": 2836.399,
    "text": " okay in that specific example the specific policies are like okay i could ever measure the field every day and that's my sensory outcome the hidden state is the true size of the foot and then every day my policy could be if they're in a new shoe size we change that day another policy with a different trade-off structure different measurement requirements might be every two shoe sizes another one might be when the perceived ill fitness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.259,
    "end": 2842.521,
    "text": " is too high, the squeaky wheel gets the grease, then we have an action oriented response policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.101,
    "end": 2848.983,
    "text": "And I'm going to be thinking about all the outcomes in this model and about the certainty on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.203,
    "end": 2850.104,
    "text": "So nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.164,
    "end": 2854.665,
    "text": "Yeah, I mean, it also relates to when my daughter has a big toe starts to get sore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2855.046,
    "end": 2856.626,
    "text": "That's my perceptual evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.686,
    "end": 2859.727,
    "text": "It's like, okay, it's like, that shoes rubbing a bit now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.067,
    "end": 2862.208,
    "text": "So yeah, at some point, I've got to make a choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.328,
    "end": 2864.169,
    "text": "So that's a good that's a good example, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.449,
    "end": 2882.951,
    "text": " it's an error signal that it's ill fit and so the policy and that's a niche modification with a shoe um but it's a similar idea so table three kind of goes through m3 in a little bit more detail and that brings us to figure three which is the fourth click",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.912,
    "end": 2891.079,
    "text": " of the active inference kind of chain here, and it adds just two more letters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.839,
    "end": 2897.284,
    "text": "It's mostly the same as figure two, like the C, G, and the E, which connect at pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.384,
    "end": 2902.95,
    "text": "That was my mistake in the 18.2, and I connected the E to the G instead of the E to the pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.391,
    "end": 2906.352,
    "text": " They're connected though at the Pi as shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.172,
    "end": 2912.415,
    "text": "The CG and E are now in M3 with a blue box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.855,
    "end": 2918.279,
    "text": "And then M4, one more dependency is being clicked in here, which is gamma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.119,
    "end": 2925.101,
    "text": " which is being clicked to G. So gamma is now an input to a bigger G function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.561,
    "end": 2933.923,
    "text": "So the G is a function which you could input just a number, you could input a few, depends on how you write it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.023,
    "end": 2939.105,
    "text": "So this is a slightly more expressive G function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.492,
    "end": 2943.013,
    "text": " because it includes this precision variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.894,
    "end": 2946.495,
    "text": "And gamma and B are kind of like one over each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.015,
    "end": 2958.261,
    "text": "The reason why it's kind of like when people take logs or do one over or negative this, it's just sometimes you want to get the most of something, but it's easier to frame it as getting the least of something or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.481,
    "end": 2968.426,
    "text": "But what this gamma represents is the expected precision because this is kind of certainty, so this one is uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.346,
    "end": 2974.73,
    "text": " So what would either you say about this final click to M for blue or stupid?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.75,
    "end": 2976.211,
    "text": "So this is so this is so fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.451,
    "end": 2979.893,
    "text": "So the gamma is like, how much did that shoe not fit?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2980.654,
    "end": 2983.436,
    "text": "And the beta is like, how fast are their feet growing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2984.897,
    "end": 2991.361,
    "text": "So I think that that's the I mean, I guess beta doesn't take into consideration time, but it was it was described as a rate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2992.822,
    "end": 2993.743,
    "text": "It was described as a rate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2993.783,
    "end": 2995.004,
    "text": "So maybe it does include time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2995.024,
    "end": 2996.265,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2999.212,
    "end": 3003.854,
    "text": " I don't want to go too far down the rabbit hole with the shoes, but it's almost like there's more precise shoes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.494,
    "end": 3009.415,
    "text": "Like, you can be more precise with a steel toe, and then you can have the more stretchy... No, no, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.475,
    "end": 3010.736,
    "text": "No one take this too seriously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.836,
    "end": 3019.939,
    "text": "It's about what it actually does say, which is basically the precision, which is the expected precision is in the Gamma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.919,
    "end": 3042.108,
    "text": " so that the uncertainty can be yeah in the b and this figure three the reason why they even went to this level of incrementing it out first off is to show us level by level how we're building on okay it's about a time series that's being predicted through time of sensory outcomes that are like generated from an underlying time series of hidden states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.748,
    "end": 3045.594,
    "text": " vis-a-vis a likelihood mapping and a transition matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.135,
    "end": 3050.644,
    "text": "And that's getting played into by priors at that S1 level, at the first state level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.496,
    "end": 3053.518,
    "text": " And then there's policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.558,
    "end": 3055.259,
    "text": "That's the whole cybernetics control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.379,
    "end": 3057.721,
    "text": "And then this is the machinery of the decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.801,
    "end": 3061.824,
    "text": "And now we're just adding one more level, which is the implicit metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.665,
    "end": 3068.249,
    "text": "So now we're adding this implicit kind of always on, always being integrated into the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.469,
    "end": 3078.036,
    "text": "Again, not a disaster mode, recovery mode for the otherwise non-affective agent, but it's an affective agent whose implicit metacognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.957,
    "end": 3100.218,
    "text": " its kind of key regulator here is related to its certitude not the thermometers tracking the average of um its its returns on investment or its average estimate but its uncertainty in its generative model so that's what we get to with their figure three with a fourth click",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.05,
    "end": 3109.516,
    "text": " So wait, wait, I think we need to talk about here, because it's the first time that it comes up, is their affective charge here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3109.716,
    "end": 3110.097,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.797,
    "end": 3116.861,
    "text": "So in this model, which also M4 really is the top level illustrating the hierarchical...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3118.974,
    "end": 3141.945,
    "text": " hierarchical nature or the nested nature of how this model is is normally and then in the effective charge it's it's described here as phenotypic pro phenotypic progress which is the policy in the prior minus the policy in the posterior and then the free the free energy of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3143.22,
    "end": 3144.84,
    "text": " Prior, posterior, minus the prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3145.04,
    "end": 3146.321,
    "text": "Wait, no, I said that wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3146.681,
    "end": 3147.861,
    "text": "Prior minus the posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3148.001,
    "end": 3149.121,
    "text": "There it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3149.201,
    "end": 3149.381,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3149.461,
    "end": 3150.461,
    "text": "Here it is in table four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.441,
    "end": 3151.621,
    "text": "Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.661,
    "end": 3153.282,
    "text": "So let's look at what they say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.482,
    "end": 3155.122,
    "text": "So expected precision is gamma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.782,
    "end": 3156.002,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.102,
    "end": 3156.982,
    "text": "Looks like a little dart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.342,
    "end": 3158.483,
    "text": "Gamma, precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.823,
    "end": 3162.023,
    "text": "You want more precision in an optimistic world model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.123,
    "end": 3164.364,
    "text": "And policy, pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.884,
    "end": 3165.104,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.724,
    "end": 3171.605,
    "text": "And it turns out that gamma, the expected precision, is one over a gamma distribution of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.165,
    "end": 3173.706,
    "text": " that's going to be the beta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.346,
    "end": 3181.669,
    "text": "And that's just going to be a statistical distribution that plays nicely with statistics, just like you see, like natural log, like the gamma, the normal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.709,
    "end": 3184.15,
    "text": "These are tools that statisticians use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.45,
    "end": 3185.231,
    "text": "And so they kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.274,
    "end": 3214.791,
    "text": " work here but we can ask the authors to what extent does it have to be this way but anyways gamma is the expected precision so gamma and beta we can kind of think about them as like linked because again they're one over each other so wherever you see a gamma or beta it could just be replaced with the other one and affective charge is being um defined as yeah the the uh change in the policy multiplied by the free energy of that policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.658,
    "end": 3221.925,
    "text": " So not just if it's good, but unchanging, then this is gonna cancel out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.086,
    "end": 3224.709,
    "text": "So the phenotypic progress is low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.729,
    "end": 3230.356,
    "text": "If you expect the 10 Bitcoin and you see them and you're not changing your policy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.491,
    "end": 3254.009,
    "text": " in this formulation that's why we don't need to tie it too closely to a specific emotional experiences because those are going to always be super subjective and require a ton more specification but we're just kind of broadly calling this ac variable something that's related to both the way that the phenotype is changing the policy is changing and the way that the free energy estimating of that policy is changing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.237,
    "end": 3261.701,
    "text": " But there's something important to note in that equation is if the policy doesn't change, then the affective charge is zero.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.845,
    "end": 3267.085,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.245,
    "end": 3276.852,
    "text": "And let's, again, let's have the authors give us the authoritative information on how to read some of these terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.593,
    "end": 3280.755,
    "text": "But here is what they said about that step four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.537,
    "end": 3293.128,
    "text": " The fourth level, which is again this gamma precision, is required to enable the agent to estimate its own success, which could be thought of a minimal form of implicit non-reportable metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3293.889,
    "end": 3301.677,
    "text": "So even to be able to semantically express metacognition, like I am unsure, that sentence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.618,
    "end": 3329.04,
    "text": " is many levels or another level away from just this precision variable which is like an in it doesn't have a self-report circuit this is just like a model that has an error term that it's updating at a slightly higher level than just the likelihood mapping and um the expected precision term that's gamma reflects prior confidence in the expected free energy over policies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.977,
    "end": 3341.73,
    "text": " The expected precision term modulates the influence of expected free energy on policy selection relative to the fixed form policy prior E sub pi, which is the habits or the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.451,
    "end": 3347.176,
    "text": "So it's kind of like, should I fall back to priors or should I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.65,
    "end": 3373.375,
    "text": " go with what the g function lean into what my g is telling me then um yeah formulated this way we can think of of gamma the precision as an internal estimate of model fitness subjective fitness so higher precision my internal model is doing better lower precision my internal model is doing relatively worse than it could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.901,
    "end": 3384.109,
    "text": " It represents an estimate of confidence in M4, that fourth click, in the phenotype congruent model of actions, given the inferred hidden states of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3384.129,
    "end": 3386.752,
    "text": "So they kind of tessellate it back out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.392,
    "end": 3389.754,
    "text": "They're saying it's about those outcomes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.885,
    "end": 3394.689,
    "text": " and about what generates them and how those change and how our policies play into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.229,
    "end": 3398.312,
    "text": "And it's about how certain we are in that generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.213,
    "end": 3401.335,
    "text": "And there's a lot of ways the environment can change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.375,
    "end": 3408.062,
    "text": "So if we're getting good data from our observation, then we should be reasonably confident with staying with what works to some extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.923,
    "end": 3415.209,
    "text": "But if that should change, there should be another mode that allows us to rebalance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.653,
    "end": 3425.075,
    "text": " preferences, affordances, and integrate that in a different way, in a different allocation to our policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3428.976,
    "end": 3434.838,
    "text": "And then to emphasize its relation to valence in our formulation, remember valence is like feeling good or bad, positive, negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.72,
    "end": 3441.028,
    "text": " Going forward, we refer to gamma updates using this term affective charge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.869,
    "end": 3449.74,
    "text": "So here's AC, affective charge, is change in beta, aka change in gamma, in just another way of saying it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.381,
    "end": 3451.583,
    "text": "It's change in precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.424,
    "end": 3474.688,
    "text": " then you can imagine if if the precision goes up it's going to be good precision going down bad and flip it for the one over or however it ends up being written but that's what it's getting at when the precision is going up as new data are coming in like they're you know i'm thinking of a slot machine and then it's like oh you won something and now the second digit is going to spin",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.905,
    "end": 3479.871,
    "text": " So there's both an increase in charge and then that like kind of restabilizes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.931,
    "end": 3484.097,
    "text": "And now it's about whether that changes again, whether the second digit is better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.117,
    "end": 3489.225,
    "text": "And so that is how affective charge is being tracked through time with these gamma updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.325,
    "end": 3491.565,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.785,
    "end": 3492.626,
    "text": "Any thoughts or continue 32?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.046,
    "end": 3506.091,
    "text": "Well, I think, well, I think the one thing that sort of, I find helpful here in this here is it's, it's the general overarching active inference, um, parameter of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.991,
    "end": 3515.015,
    "text": "It's like, it's, it's, they're using the term confidence and precision more at these higher levels because it's like a meta parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.675,
    "end": 3535.903,
    "text": " inter is still at some level uh an interpretation of uncertainty but because it's on policies and that confidence and precision um are at play because you're interpreting your ability to act not just the raw sensory sort of malheur so to speak",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.943,
    "end": 3550.006,
    "text": " Right, there's a big difference between like visual uncertainty, it's just two shades of gray and they're so similar, you just don't know what, you don't even see a difference versus two strategies, two chess moves that are very different and you're just not sure which one to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.606,
    "end": 3557.888,
    "text": "That's a very different situation for inference because the way that your eye scans on the page is kind of reversible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.268,
    "end": 3564.069,
    "text": "You're getting to retract your choices, but with strategy, it might be very irreversible, very nonlinear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.289,
    "end": 3579.954,
    "text": " um okay here's another example they give on 32. so this carrying on right below equation 3.1 which was screenshotted there so um ac can only be non-zero",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3580.956,
    "end": 3583.858,
    "text": " when the inferred policies are different from the expected policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.158,
    "end": 3585.94,
    "text": "So Blue, that's what you had said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.26,
    "end": 3593.265,
    "text": "So if it's sort of at the bottom of the bowl from a policy perspective, thermodynamically, it's not moving, the delta is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3594.406,
    "end": 3600.991,
    "text": "It is positive when perceptual evidence favors an agent's action model and negative otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.096,
    "end": 3609.017,
    "text": " So it's like, are the data coming in locally good for my model or locally not congruent with my model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.557,
    "end": 3615.799,
    "text": "In other words, positive and negative AC corresponds respectively to increased and decreased confidence in one's action model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.559,
    "end": 3623.18,
    "text": "So as the data are increasingly good, you actually like lean into your model and prioritize that prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.78,
    "end": 3628.421,
    "text": "And then you kind of start maybe overfitting and then maybe the model has to pull back",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.241,
    "end": 3639.255,
    "text": " and rely a little bit on something different to re-equilibrate that to stay on this multi-dimensional front with model fit and optimal learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.996,
    "end": 3644.942,
    "text": "So that's one of the ways that active inference is rethinking the explore-exploit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.643,
    "end": 3663.131,
    "text": " is by relying on the generative model and then the trade-off with different ways the generative model can get combined with priors you can get explore and exploit behavior as well as a lot of other modes and a rapid switching that's informed by the instantaneous performance of a model um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.44,
    "end": 3667.423,
    "text": " Then they give some examples of different, a prey and a predator animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.143,
    "end": 3668.884,
    "text": "Okay, and then here's 5.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.124,
    "end": 3671.706,
    "text": "Yeah, any thoughts on that before 5.3?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.708,
    "end": 3676.09,
    "text": "Okay, 5.3, affective charge lies in the mind of the beholder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.67,
    "end": 3682.255,
    "text": "So that's cool because it shows that the authors in this research line have taken up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.556,
    "end": 3703.788,
    "text": " the challenge of ecological psychology or of action-oriented philosophy or whatever it happens to be it's like this relational insight that these variables have to be about the beholder and their relationship to a situation partially for computational tractability and partially just because it's kind of how these systems seem to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.793,
    "end": 3708.416,
    "text": " we are modeling things that are in the mind of the beholder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.456,
    "end": 3719.207,
    "text": "So it's always gonna be with the situation and the context, and we're always gonna have to go into the specifics, but we're also gonna find the patterns that are similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.647,
    "end": 3723.29,
    "text": "For example, we all, as they say, tend to experience a rush of satisfaction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.318,
    "end": 3732.581,
    "text": " not five hours of satisfaction unless it was a long jigsaw, when we solve a puzzle or understand the punchline of a joke or active inference, an aha moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.281,
    "end": 3734.481,
    "text": "Our explanation is straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.942,
    "end": 3740.563,
    "text": "In active inference, biologically plausible forms of cognition inevitably involve policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.064,
    "end": 3743.284,
    "text": "Policy as fundamental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3743.404,
    "end": 3745.565,
    "text": "So policy is not the disaster mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.625,
    "end": 3753.688,
    "text": "This is as fundamental as affect, whether those policy internal selections are internal, citation, citation, citation, or external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.889,
    "end": 3755.169,
    "text": " Period.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3756.351,
    "end": 3763.318,
    "text": "Therefore, AC is also elicited by mental action, typically in form of top-down modulation of lower-level priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.259,
    "end": 3765.721,
    "text": "I'm getting the lower-level pain signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3766.562,
    "end": 3767.663,
    "text": "I shan't not think of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.203,
    "end": 3770.706,
    "text": "And then, now I'm feeling better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.787,
    "end": 3801.177,
    "text": " as that is top down prior is influencing the bottom up signals just to give one example so this is like bringing a lot of pretty interesting areas together especially because again it's not just about humans as cognitive agents this is about a scale free formulation for how affective charge works in active inference but we can look at the specific example that they do provide with the simulation so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.93,
    "end": 3810.119,
    "text": " Blue, any thoughts here or on figure five as far as what they do in the simulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.682,
    "end": 3814.304,
    "text": "Maybe should we go through the simulation first?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3814.324,
    "end": 3815.446,
    "text": "Do you have that figured out or no?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3815.806,
    "end": 3818.029,
    "text": "Yes, I think it's, is it this one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.83,
    "end": 3819.631,
    "text": "Yeah, figure four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.853,
    "end": 3821.514,
    "text": "Okay, sorry, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.202,
    "end": 3824.344,
    "text": " Yeah, I think that, yeah, that's probably better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3825.925,
    "end": 3834.673,
    "text": "So in this simulation, the way that they set up the tea maze is it's a rat or it could be, I mean, it's a simulated agent, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3834.733,
    "end": 3849.865,
    "text": "So it could be a rat or it could be an ant or it could be anything in a maze where on one side of the maze is food or so the mouse is placed in the middle of the maze and on the north end, say you have on the left side food and on the right side, a shock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3850.706,
    "end": 3860.114,
    "text": " And on the south end, there is an informational queue about which side the food is on as opposed to the shop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3860.734,
    "end": 3864.337,
    "text": "And so the food location changes over the trials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3865.369,
    "end": 3869.671,
    "text": " And then the subject is allowed to move themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3870.211,
    "end": 3875.753,
    "text": "And so typically the subject checks the queue and then gets the reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3875.833,
    "end": 3885.537,
    "text": "So there's like some, there's a reward for, like you don't get shocked accidentally if you first go see which side that the food is on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3886.397,
    "end": 3890.881,
    "text": " So how the cue is associated, how the cue is associated with decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3890.961,
    "end": 3898.729,
    "text": "Well, if if they know to epistemically forage like that, that's more valuable than, you know, accidentally getting shocked, then they go to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3898.769,
    "end": 3906.877,
    "text": "But I think in the trials they changed, they kept the location of food consistent for many trials and then they changed it for many trials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3907.237,
    "end": 3909.839,
    "text": "And so the mouse had to relearn what to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3911.206,
    "end": 3911.386,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3912.166,
    "end": 3916.287,
    "text": "So let's just imagine the food was always on the left side, never changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.527,
    "end": 3920.968,
    "text": "Well, as soon as you went to the left side 10 times, you'd be like, I don't even need that queue anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3921.548,
    "end": 3923.148,
    "text": "It's kind of useless info gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.188,
    "end": 3925.109,
    "text": "It's going to be not good time spent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.549,
    "end": 3928.109,
    "text": "So I should just go for the policy of going right for the food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.77,
    "end": 3935.051,
    "text": "Now, if it was switching every time, it would make sense every time if the shock was painful to get that queue every time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.791,
    "end": 3946.654,
    "text": " So the mouse is able to, in one way, make a binary decision which arm to follow for the food, but also there's this higher order decision about getting information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.374,
    "end": 3957.036,
    "text": "And actually in the Active InfraAnts, the ant paper that I did with some of these co-authors, we also use a T-Maze, but there was no metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.056,
    "end": 3959.097,
    "text": "There was just the stigmergy of the colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3959.98,
    "end": 3963.203,
    "text": " So the T-Maze is really a generalizable framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.503,
    "end": 3969.227,
    "text": "And once you have the code to make the T-Maze, you can just make basically anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.448,
    "end": 3972.15,
    "text": "It's just like any other shape maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.19,
    "end": 3973.471,
    "text": "It's just another matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.511,
    "end": 3976.073,
    "text": "So this is, again, it's like an initial foray.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.693,
    "end": 3981.237,
    "text": "And the places where people see that it's lacking, that's where we want to kind of build in the gaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.518,
    "end": 3989.163,
    "text": "Let's get to a little more formal view of how you make that active infrared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.202,
    "end": 3994.928,
    "text": " that is doing the active inference on this foraging decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.029,
    "end": 3999.673,
    "text": "So there's a bunch of sections to this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.674,
    "end": 4002.376,
    "text": "And Blue, would you say it's better?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4002.397,
    "end": 4004.779,
    "text": "Yeah, I think five is better before seven, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.68,
    "end": 4006.281,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.022,
    "end": 4008.824,
    "text": "So there is a generative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4009.75,
    "end": 4022.006,
    "text": " model uh first off i mean there's a lot of entry points people should check out the model and just read it themselves because it will take there's a lot of ways to enter into it but one thing to notice is this c the preference over outcomes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.567,
    "end": 4026.189,
    "text": " If it's not, if it's food, it has a plus four points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.509,
    "end": 4027.55,
    "text": "Shock is negative six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.79,
    "end": 4028.53,
    "text": "These are just numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.57,
    "end": 4029.951,
    "text": "You can make it scale differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.051,
    "end": 4032.513,
    "text": "And then if it's not a shock or food, it's zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.233,
    "end": 4036.476,
    "text": "And then also it doesn't have a preference for going left or right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.456,
    "end": 4044.301,
    "text": "So these you can already see are some of like the little atoms that are going to get fed into a bigger model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.241,
    "end": 4050.485,
    "text": "So this bigger model is going to be able to take kind of these variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.785,
    "end": 4052.887,
    "text": "Like how much is the relative weighting of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.748,
    "end": 4056.213,
    "text": " the food versus the lightning bolt?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.253,
    "end": 4059.219,
    "text": "Or is there an implicit preference for one side versus another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.101,
    "end": 4061.745,
    "text": "And then here, the prior, D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.967,
    "end": 4065.908,
    "text": " The prior is that they're 50-50, that it's on either side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.568,
    "end": 4075.531,
    "text": "But again, that's actually different than a preference for left or right branch is different than a belief that it's likely to be on the left or right branch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.431,
    "end": 4079.853,
    "text": "So we can separate out those two variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.033,
    "end": 4081.573,
    "text": "Someone says, I wish it were this temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.613,
    "end": 4084.874,
    "text": "That's my preference, but I'm very accurate that it's not that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4085.574,
    "end": 4086.655,
    "text": "And that's why I'm sad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.435,
    "end": 4094.137,
    "text": " So then you can talk about those kinds of combinations of different parts of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.297,
    "end": 4099.718,
    "text": "And B, so that's D and C. B is the state transitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.698,
    "end": 4103.699,
    "text": "And so these are, it's kind of like a second level matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.859,
    "end": 4105.619,
    "text": "And this is kind of, it's like a cube.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.959,
    "end": 4110.06,
    "text": "If you think about it, it's like a four by four by four, because there's four positions it can be in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4110.66,
    "end": 4113.101,
    "text": "The waiting position, that's this front one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.041,
    "end": 4116.522,
    "text": "Then it can go left to the right or to the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.54,
    "end": 4120.372,
    "text": " And then there are state transitions that are defined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.209,
    "end": 4127.054,
    "text": " Like if you go from the center to the left branch, that's going to be a defined move in a matrix that you can make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.895,
    "end": 4134.461,
    "text": "Then A is the mapping between where you're at and whether you get the cue left or right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.182,
    "end": 4141.527,
    "text": "So that's the info that you'd get on the bottom, the south branch, and then the reward or the punishment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.728,
    "end": 4147.132,
    "text": "And that's the likelihood mapping, whether you go to the left or the right, regardless of whether you got the cue or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.873,
    "end": 4153.296,
    "text": " And then E is that baseline prior over policies, which is just, it's even here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4153.336,
    "end": 4154.276,
    "text": "They're all 2.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.576,
    "end": 4156.777,
    "text": "We could ask, what is the effect of different values?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.937,
    "end": 4162.34,
    "text": "It might make, you know, you could work that through in your head a little bit, but it could be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.88,
    "end": 4163.361,
    "text": "But here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.441,
    "end": 4187.308,
    "text": " all of the expressivity is in the other parts like the preference for the um reward over the shock so one doesn't need to specify like yes and i'd rather you know take a left turn at this exit while i'm going there but that could be specified because again it's just sort of a um skeletal model of this scenario any thoughts on this before we go to seven",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.877,
    "end": 4190.418,
    "text": " Nice, but isn't it, it's cool model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.058,
    "end": 4196.961,
    "text": "And it's nice how even with only four locations, there's so much richness in the behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.981,
    "end": 4204.104,
    "text": "So it shows you don't need the little scurrying animal to simulate the spatial dynamics of the maze, because then you're going to get trapped up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.504,
    "end": 4206.825,
    "text": "Oh, is it a narrow chamber or a broad one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.305,
    "end": 4212.747,
    "text": "But this helps you look more semantically perhaps at the way that the agents interact with their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.408,
    "end": 4215.829,
    "text": "Okay, so now on seven,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.366,
    "end": 4219.168,
    "text": " Blue, do you want to say the two halves of seven?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.689,
    "end": 4220.97,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4221.01,
    "end": 4227.435,
    "text": "So this part of seven, this is the generative model that they've created for affective inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4227.555,
    "end": 4236.563,
    "text": "And the next slide is going to talk about all of the different matrices that go into producing this model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4237.104,
    "end": 4238.425,
    "text": "So that's why I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4238.445,
    "end": 4239.226,
    "text": "Maybe it's this one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4239.286,
    "end": 4240.627,
    "text": "Maybe this is better first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4240.847,
    "end": 4241.327,
    "text": "Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.148,
    "end": 4268.689,
    "text": " so the uh here the the different matrices that go into the the larger model in figure seven include the prior expectations d2 for any initial states so that's this uh top left and then the second one which is down here on the bottom um is the affective prior which is the likelihood matrix reflecting some degree of uncertainty in the predictions which was also shown in figure five multiplied by that beta",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4270.63,
    "end": 4290.338,
    "text": " and sets the expectation on expected sets the expected precision so which varies between negative 0.5 which would be a negative valence and then two which is positive valence and then this contextual prior is this matrix a c a a to the c",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4291.26,
    "end": 4303.521,
    "text": " For the likelihood mapping from the context states, there's a lower level reflecting the fact that the agent is always certain which context they observed after the trial is over, so they either got the food or the shock and they know that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4304.644,
    "end": 4309.525,
    "text": " And then this last one is the state transitions B to the 2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.966,
    "end": 4324.109,
    "text": "And this is state transitions at the second level, reflecting a couple of assumptions that both the affective and contextual states vary, but have some stability across trials, 0.2 to 0.3 probability of change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4326.135,
    "end": 4333.942,
    "text": " and that the agent has a positivity bias in the sense that they're more likely to switch from a negative to a positive state than vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4335.323,
    "end": 4335.883,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.704,
    "end": 4342.289,
    "text": "So what's happening in 7 is we're adding another level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4342.449,
    "end": 4351.136,
    "text": "So here we see that beta and gamma being connected to the whole CGE policy and then that rake formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.077,
    "end": 4378.747,
    "text": " and now we're going to tie in this implicit metacognitive layer with another hidden state so that introduces this parentheses notation where if there's a parentheses it means which level of the nested markov decision process it is so that the s that we knew and loved that was giving rise to the sensory outcomes is now s one and that's the first level of the model and then the s",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.29,
    "end": 4386.833,
    "text": " that is given rise to the precision is S2, the hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.834,
    "end": 4403.321,
    "text": "So that is now what is being called the implicit metacognitive component, which is the second level of the model S upper score two, which has its own prior D upper two, just like this has a D upper one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.441,
    "end": 4405.282,
    "text": "It's actually not shown here, but it is there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.763,
    "end": 4408.284,
    "text": "There are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4410.692,
    "end": 4422.556,
    "text": " the same Markov decision process structure is being recapitulated, but there's a different interpretation because the hidden states at one level are now the observations linked through an A at the next level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4423.577,
    "end": 4426.097,
    "text": "So here's the observations, like what square am I on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.117,
    "end": 4429.178,
    "text": "The sensory outcome, am I then a hidden state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.198,
    "end": 4430.299,
    "text": "What kind of square am I on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4430.959,
    "end": 4433.92,
    "text": "And then that's getting mapped to, am I happy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.32,
    "end": 4439.342,
    "text": "Or that's the whole question of this paper is what does this actual second state, yep, Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.731,
    "end": 4441.252,
    "text": " Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.412,
    "end": 4441.852,
    "text": "You're heading out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.892,
    "end": 4443.214,
    "text": "Yeah, I'm going to have to head out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4443.334,
    "end": 4443.614,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4443.854,
    "end": 4444.115,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.375,
    "end": 4444.635,
    "text": "Peace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.855,
    "end": 4445.216,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.396,
    "end": 4445.456,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.318,
    "end": 4453.503,
    "text": " So then you get all these kind of interesting different kinds of matrices at the second level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.683,
    "end": 4459.808,
    "text": "Like, yeah, given that I went left and the food was left, then will I find out about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.908,
    "end": 4468.775,
    "text": "And so you need a few matrices to kind of close the doors and make the model run, but that's a little bit on the implementation details and we'll probably learn from the others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.436,
    "end": 4471.838,
    "text": "And in 10, we kind of just have a summary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.458,
    "end": 4480.225,
    "text": " This is, I think, a great figure because it shows how multiple timescales of nested processes are linked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.106,
    "end": 4488.272,
    "text": "From the inheritance of prior phenotypes, like how big is that foot, and also development and learning, like how fast does it change?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.221,
    "end": 4514.038,
    "text": " get linked in through multiple levels that are getting nested closer and closer to action and perception in the loop and then rippling back out so pretty nice overarching figure any thoughts on this or continue on blue this just really like like like you said it's a nice figure a good summary and just reflects like the deep temporal like nature of of this model that they've built",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4515.461,
    "end": 4515.722,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4515.762,
    "end": 4521.918,
    "text": "Let's go through the results of the simulation and then just deal with a few little further implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4522.018,
    "end": 4523.041,
    "text": "And then that will be a nice 19.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.151,
    "end": 4535.177,
    "text": " So in figure six, they simulate out that scenario that we just talked through a few times with the maze for 32 trials with food located on the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4535.217,
    "end": 4540.38,
    "text": "So this was just testing that it will converge to expecting the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.4,
    "end": 4549.986,
    "text": "So this was kind of like a little sanity check for their model, but also it shows that we're doing this in the broader SPM toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.746,
    "end": 4570.976,
    "text": " And so that means that a lot of these things, like the ability to visualize and easily run these models and check that they're complete and debug them and run them at scale, a lot of these things that tie up a lot of innovative modeling efforts, a lot of those are simplified somewhat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.056,
    "end": 4572.777,
    "text": "And again, we'll ask the authors about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.632,
    "end": 4585.125,
    "text": " So they simulated in figure six just to show that they could do different policies from the exploratory policy in the first 12 and then switching over to just the go left policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.145,
    "end": 4589.291,
    "text": "Okay, figure eight, anything to say, Lou?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.496,
    "end": 4592.596,
    "text": "No.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4593.502,
    "end": 4593.702,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.003,
    "end": 4594.163,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.203,
    "end": 4599.588,
    "text": "So figure eight, they're kind of just giving a few trajectories of what can happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.868,
    "end": 4604.212,
    "text": "So it's characterizing the model in a little bit of a playful way, but I think it's fair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.272,
    "end": 4607.375,
    "text": "And as we'll see, it's at least computationally warranted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.736,
    "end": 4612.62,
    "text": "So here we have initially anxious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4612.92,
    "end": 4613.941,
    "text": "The state is negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4614.778,
    "end": 4637.804,
    "text": " for the first eight time steps where it's getting the cue and the left side and then it develops confidence and then the green line here in eight is where the um the situation changes so then there's a few time steps where it still hasn't caught on before it gets shocked and then it gets anxious again and it gets renewed confidence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.644,
    "end": 4645.267,
    "text": " So this is capturing a few of the, just like with the ants, how we showed how it could switch arms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.788,
    "end": 4652.251,
    "text": "Here, they're showing not just that it can switch arms from Q and left, left and stuck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.851,
    "end": 4654.652,
    "text": "Then the shock unsticks it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4654.712,
    "end": 4658.794,
    "text": "It's like, whoa, I was very sure that going left was the right decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.274,
    "end": 4659.955,
    "text": "I got shocked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4660.715,
    "end": 4663.997,
    "text": " Now I need to go take the cue and not just one time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.097,
    "end": 4665.998,
    "text": "I'm going to get the cue multiple times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.118,
    "end": 4666.338,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.938,
    "end": 4669.54,
    "text": "I think that I have renewed confidence in this direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.52,
    "end": 4673.182,
    "text": "So it's really nice model behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.202,
    "end": 4673.942,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.962,
    "end": 4674.622,
    "text": "What do you think Lou?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.663,
    "end": 4678.104,
    "text": "So they did actually, there's one thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4678.204,
    "end": 4679.405,
    "text": "And so it's not showing here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4679.485,
    "end": 4687.149,
    "text": "Maybe it's going to show in figure nine, but maybe they, maybe they, I don't know if they showed it in a figure or maybe we'll just let the authors talk about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4688.305,
    "end": 4689.685,
    "text": " What about it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4689.746,
    "end": 4695.027,
    "text": "So about the model that lacked the last level, the metacognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4695.768,
    "end": 4704.29,
    "text": "So in one of the models, they took that highest level of integration away to see if the mouse would similarly adapt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4704.33,
    "end": 4708.032,
    "text": "So here they changed the position of the food in the top right figure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4708.852,
    "end": 4729.529,
    "text": " so they changed the position of food it was always on the left always on the left always on the left the mouse adapted it didn't even go look for the cue and then in the the model without that metacognition the model thought the metacognition didn't adapt to going to look for the cue like they just like stayed stuck in the middle like not sure do i i don't know if i should go up or go down i thought that that was really like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4730.389,
    "end": 4732.55,
    "text": " So this is what happened with the metacognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4732.61,
    "end": 4736.471,
    "text": "Initially anxious, developed confidence, anxious again, and then renewed confidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4736.951,
    "end": 4743.033,
    "text": "But in the model that lacked that integration, that metacognition, it just like stayed stuck in the middle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4743.053,
    "end": 4750.216,
    "text": "I thought that that was a very like cool anomalous effect and like a really neat control like trial for this test.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4750.896,
    "end": 4773.931,
    "text": " nice and it actually relates again to this idea that affect or anxieties in the loop and it's something that's a continuous variable and in uh you know healthy settings we could say maybe anxiety is actually warranted here there was a shock in a strategy that was pre there's nothing wrong with a strategy that works and there's nothing wrong with switching strategies when it doesn't work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.755,
    "end": 4793.822,
    "text": " But there is some variable, whether we associate it with suffering, again, that's the second question, but there is some feeling or some computational need for the system to actually pull back and re-weight how it uses its prior evidence versus how it deals with incoming evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.747,
    "end": 4811.638,
    "text": " So I think this is a really nice example of just the categorical, the discrete kinds of behavior that are very different from low precision and negative valence, and then a kind of phase transition rapidly into a stable phase",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4812.378,
    "end": 4834.643,
    "text": " into negative and back again and integrating it with decision making with as they say early on the imperative is that reduction of uncertainty with a generative model not maximize reward not minimize suffering either but actually to optimize its precision aka reduce its uncertainty about a generative model of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4835.745,
    "end": 4858.423,
    "text": " the states of the world including its own action so it's just really nice work some of the reasons why active inference is so cool actually and then figure nine they simulate 64 trials oh I think this is what you were speaking to um an affective agent plotted in orange and an agent without higher level contextual and affective states plotted in gray",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.986,
    "end": 4876.492,
    "text": " So there's, it's, I mean, one could look at figure nine a little more closely to see the difference, but yes, the expectations in like just looking at the top one, the expected food location, they both converge to left and the orange goes a little bit higher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.672,
    "end": 4877.793,
    "text": "So it learns a little faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.813,
    "end": 4879.774,
    "text": "It's like, yeah, I'm doing really well on this test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.114,
    "end": 4880.994,
    "text": "This is an easy course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.474,
    "end": 4882.995,
    "text": "Then the green line happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.795,
    "end": 4885.577,
    "text": " And the gray one slowly updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.597,
    "end": 4888.779,
    "text": "It's like, hey, I've been right for, you know, 20 and I was only wrong twice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.259,
    "end": 4890.14,
    "text": "So I'm at 90%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.18,
    "end": 4890.781,
    "text": "What's the issue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4891.101,
    "end": 4895.044,
    "text": "And the orange one's like, whoa, something's wrong because I'm getting error signals when I wasn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.845,
    "end": 4898.487,
    "text": "And the green line here represents the food changing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4898.507,
    "end": 4899.548,
    "text": "Like that's the context switch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4899.608,
    "end": 4900.569,
    "text": "I just wanted to contextualize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.589,
    "end": 4900.829,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.529,
    "end": 4901.749,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.83,
    "end": 4902.87,
    "text": "The context reversal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.211,
    "end": 4906.133,
    "text": "So it was on the left and now it's on the right, aka I got a shock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.054,
    "end": 4912.358,
    "text": "And so then also look at this, the affective charge, the orange one, anxiety drop, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4914.757,
    "end": 4917.221,
    "text": " blissful ignorance, anxiety, drop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.301,
    "end": 4919.225,
    "text": "And then the gray one doesn't have affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4919.245,
    "end": 4920.406,
    "text": "So we don't see it there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4921.148,
    "end": 4922.029,
    "text": "But then, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.991,
    "end": 4928.179,
    "text": "Well, the gray one's affective charge is actually a little bit all over the place, but we could ask them what that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4929.506,
    "end": 4940.491,
    "text": " And so, yeah, pretty, it is super interesting because like learning, you know, even organic chemistry is an emotional learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4940.671,
    "end": 4947.054,
    "text": "So how actually affect and policy and mental effort, all these things come together, it's kind of cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.867,
    "end": 4955.689,
    "text": " I wonder if this is, like, just, like, to take it to the, like, meta level, like, is it, like, you know, self-reflection, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4955.729,
    "end": 4958.25,
    "text": "Like, at what level of integration is that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4958.29,
    "end": 4969.853,
    "text": "Like, so you do the action, you select the policy, and I like that my student teammates don't self-reflect, but, like, when you integrate at that level, there's agents that do, humans that do self-reflection, and then humans that just kind of don't think about it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4970.253,
    "end": 4972.893,
    "text": "And so what is the better adaptation there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4972.913,
    "end": 4974.914,
    "text": "It just provides evidence for that, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4976.243,
    "end": 4976.443,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.703,
    "end": 4980.824,
    "text": "And similarly, it's like, you know, I want to be doing the right thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.365,
    "end": 4990.768,
    "text": "But then will that preclude you from having a thought that where that's actually being, that expectation is being violated, especially if there's sensory evidence that that's the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4991.568,
    "end": 4993.929,
    "text": "Those are really interesting situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4994.589,
    "end": 4994.809,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4994.829,
    "end": 5001.891,
    "text": "So like psychopathology, like, are they just missing some higher level integration, like for lacking that affect, you know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5004.403,
    "end": 5005.224,
    "text": " We'll ask the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.444,
    "end": 5005.704,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.045,
    "end": 5019.919,
    "text": "So then just the additional info section of the paper, as we kind of close out in the last little few slides here, there are four appendices and the code is available on Casper Hesp's GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.01,
    "end": 5025.673,
    "text": " And so you can see just from the top lines of the main MATLAB script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5025.753,
    "end": 5027.114,
    "text": "Yeah, it's in MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.214,
    "end": 5038.18,
    "text": "It uses Markov decision processes and it involves active inference and learning using variational Bayes, the factorized version in the SPM toolkit using MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.62,
    "end": 5043.463,
    "text": "So check out the model streams and let us know how it goes to work with the code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5045.404,
    "end": 5050.088,
    "text": " We kind of just had one or two more random areas to cover.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5051.088,
    "end": 5054.411,
    "text": "A few directions that this takes us in, which we've discussed a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.052,
    "end": 5057.053,
    "text": "One of them is more advanced simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5057.133,
    "end": 5063.458,
    "text": "So can we have two dimensions of affect or could we have another summary variable that represents some other feature of systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5064.219,
    "end": 5070.243,
    "text": "Could we bring it more into alignment with computational psychiatry and translational research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.221,
    "end": 5077.169,
    "text": " And could we embody robots that implement these kinds of algorithms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.59,
    "end": 5087.723,
    "text": "How would that change some type of situational, like physical robot or even a software robot if it had these kinds of estimators internally?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.803,
    "end": 5116.17,
    "text": " then we're always just thinking about where does active inference come into play which is easy for this paper because that's the whole model but um where where are the next empirical steps which they mentioned in 5.7 a little bit and how does this relate to this realism versus instrumentalism question we're always getting at like is this what the systems are or is this how we're going to model the systems or are those one and the same thing um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5119.682,
    "end": 5145.649,
    "text": " any broad ideas and questions before this little freudian interlude yeah okay so thanks dave for pointing out um a lot of the recent work of mark solmes specifically this new project for a scientific psychology general scheme which the link's given down below but it's um pretty interesting work that has to do with integrating recent developments in neuroscience with some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5146.988,
    "end": 5173.841,
    "text": " freudian and uh ideas and beyond and i guess i just like ideas that aren't named after people because then it gets pretty much like oh who's doing darwinian evolution what does it really mean to be freudian it gets a little bit uh historiographical instead of about the ideas but the mappings that are made are clear and stand on their own and and put the sort of history hopefully um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.438,
    "end": 5194.378,
    "text": " the side when we see that there are commonalities across very disparate models and here we see a familiar structure which is kind of like that markov blanket separating the internal and the external states but the letters are a little bit different and so there's an abbreviations table given in this paper and also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5195.279,
    "end": 5210.144,
    "text": " For many years, Friston and Karhar Harris and others have been writing papers that are about different Freudian concepts and relating it to free energy and drive and a lot of other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5210.919,
    "end": 5213.961,
    "text": " points of contact with different psychological threads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5214.141,
    "end": 5225.306,
    "text": "It's just not an area I'm super familiar with the literature and the debates around, but it's an area that's obviously important to many and influences a lot of areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5226.087,
    "end": 5239.573,
    "text": "And it's just interesting to see how these developments play into the absolutely still open for evolution field of psychology, psychiatry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5240.934,
    "end": 5264.806,
    "text": " so that was uh pretty much what we wanted to cover in 19. so that's pretty fun and little little sprint to get the paper finished because it was somewhat of a long paper but it's really worth it so blue any final thoughts or what what are you taking moving forward or what do you hope that we discuss in the point one and point two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5266.374,
    "end": 5272.219,
    "text": " I don't know, I'm looking to really discussing the Bayesian brain integration or correlation here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5272.259,
    "end": 5276.742,
    "text": "I really think that the ability to update your brain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5277.864,
    "end": 5287.586,
    "text": " beliefs based on what your previous experiences is like, this is like the perfect, like case study for this kind of philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5287.626,
    "end": 5297.868,
    "text": "And I know like the Bayesian brain catches some slack sometimes and Bayesian statistics catch a lot of slack, but in reality, like we aren't going to go to the shock side of the box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5297.948,
    "end": 5300.509,
    "text": "If we know that the food is always in the left side of the box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5300.949,
    "end": 5302.449,
    "text": "Like, so having that, that update.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5302.469,
    "end": 5306.93,
    "text": "So I'm looking forward to just see what, what people have to say about the Bayesian brain aspect of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5307.35,
    "end": 5325.276,
    "text": " paper if anything we get that far we can make it all the way through the model right nice yeah i agree i was also curious about okay well what if we could just associate a like you know like click share whatever on social media and then maybe you don't even need the shock or maybe you could add that or something but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5326.016,
    "end": 5331.061,
    "text": " With that matrix, could there be upvote, downvote systems where maybe the data already exists?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.581,
    "end": 5336.425,
    "text": "And then the positions that somebody could be in would be like, I have not seen it or I have seen it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5336.886,
    "end": 5337.386,
    "text": "Something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5337.406,
    "end": 5340.669,
    "text": "And they're moving around pages, seeing or not seeing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5341.39,
    "end": 5345.773,
    "text": "And that's influencing their beliefs about the world and their beliefs about themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5345.853,
    "end": 5350.117,
    "text": "And how accurate am I if this is what the info I'm getting is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5351.238,
    "end": 5362.27,
    "text": " And then that's without even going into the instrumentalism realism, at least it's something that it feels like to be searching for information or a question that can be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5362.85,
    "end": 5363.952,
    "text": "So it's pretty cool stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5364.512,
    "end": 5365.573,
    "text": "Thanks a lot, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5365.773,
    "end": 5367.575,
    "text": "And thanks also, Stephen, for joining for 19.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5367.615,
    "end": 5368.416,
    "text": "We'll see everyone for 19.1 and 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5369.037,
    "end": 5369.437,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5369.457,
    "end": 5369.517,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]