[
  {
    "start": 6.462,
    "end": 7.603,
    "text": " All right, hello everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 8.645,
    "end": 24.024,
    "text": "It's August 12th, 2022, and we are in guest stream number 26.1, From Users to Sensemakers on the Pivotal Role of Stigmatic Social Annotation in the Quest for Collective Sensemaking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 25.745,
    "end": 28.207,
    "text": " This should be a great presentation and discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 28.768,
    "end": 34.533,
    "text": "And so I'll pass it to Ronan to introduce the context and take it away with the presentation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 34.693,
    "end": 36.374,
    "text": "So thanks, everyone, for joining.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 36.754,
    "end": 38.916,
    "text": "And Ronan and Will, thanks for coming on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 40.658,
    "end": 40.978,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.198,
    "end": 43.841,
    "text": "Yeah, thanks, Daniel, for putting this on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.981,
    "end": 47.424,
    "text": "And yeah, excited to be here and have this discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.384,
    "end": 52.348,
    "text": "I think it's our first time discussing this paper in long form, so looking forward to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.964,
    "end": 62.927,
    "text": " So yeah, this paper actually, for some context, this presentation will be related to the paper that we wrote together as a group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.248,
    "end": 72.35,
    "text": "And it was also presented in a conference on hypertext and social media in June of this year in Barcelona.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.27,
    "end": 75.231,
    "text": "So today we'll go over kind of the key points of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.71,
    "end": 84.973,
    "text": " try to dive into more details, kind of explore directions that we didn't maybe have time to address in a sort of short kind of presentation debate over the paper of the conference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 86.074,
    "end": 104.581,
    "text": "And then we'll sort of open a wider discussion, talk about how this is sort of informing the work of our collective and a discussion of some initial projects that we're working on in the context of this research, including active inference and some other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.976,
    "end": 128.543,
    "text": " projects like vio and a few more so yeah looking forward to a lot to talk about so yeah probably we should start with the definitions of some of the terms we're going to be using this because we introduced a lot of a lot of words that can mean a lot of things to a lot of people so i think yeah sense making is something that has a lot of definitions the one we're working with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.355,
    "end": 138.662,
    "text": " we're looking at processes by which individuals and groups make sense of their environment by organizing sense data so the environment is understood well enough to enable reasonable decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.902,
    "end": 142.845,
    "text": "So we do sense-making all the time in physical environments and online environments, as we'll see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.106,
    "end": 157.838,
    "text": "So there's this kind of incoming stream of sense data coming from the environment, and we have to sort of adapt and handle this kind of stream of data to inform our decisions, incorporate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.847,
    "end": 170.732,
    "text": " But yeah, so sense-making is a kind of fraught subject in terms of where collective sense-making comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.272,
    "end": 179.557,
    "text": "Because there's this kind of feeling, or you'll hear a lot of people talking about how democracies are in danger, and they make reference to sense-making, some kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.51,
    "end": 204.968,
    "text": " a kind of typical sort of uh thing you might hear from you know media you'll hear things like like this what we brought here so yeah the quality of our democratic life depends on the public having the fact of being able to make sense of them and there's the feeling that this isn't really happening anymore so that's why a lot of people are worried about the future of democracy this is just kind of an interesting uh research here on the right that's showing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.351,
    "end": 211.956,
    "text": " how polarized and how much we don't have a shared sense of what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.996,
    "end": 224.728,
    "text": "So you can look at things like the topics people are looking at and seeing on CNN or Fox News and see how different the coverage is of each of those networks for the same topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 224.748,
    "end": 231.835,
    "text": "So things like Trump's failures will get a lot of being addressed very heavily on CNN.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.243,
    "end": 235.306,
    "text": " not so much on Fox and then vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.326,
    "end": 241.695,
    "text": "So yeah, people are living in a really different world because of our information environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.835,
    "end": 249.786,
    "text": "So this is kind of the motivating background for why we're getting interested in this because really our democracies are at stake as a lot of people have already noticed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.474,
    "end": 257.736,
    "text": " And yeah, just kind of another word of sort of disclaiming that sensemaking is a wicked problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.457,
    "end": 264.819,
    "text": "And yeah, we definitely aren't going to claim to have like the solution to sensemaking or collect-to-sensemaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.919,
    "end": 267.8,
    "text": "It will require many different solutions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 268.624,
    "end": 274.307,
    "text": " It's kind of an ongoing problem, so we'll kind of make progress on it, and then we'll have new problems as we make progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.228,
    "end": 282.973,
    "text": "It's very interdisciplinary, so there's a lot of stakeholders, a lot of different schools of thought and practice that will need to be involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.094,
    "end": 296.481,
    "text": "So we're looking at kind of, we're trying to look at one angle that we think is really important, and that is how platforms shape our information landscapes online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.731,
    "end": 306.48,
    "text": " And we kind of noticed two things, two sort of important things about platforms that make them what we call perilous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.602,
    "end": 321.355,
    "text": "So for one, there's the notion of centralization, where a few giant platforms, Facebook, Google, YouTube, et cetera, have gained unprecedented control over attention by controlling the means to create, search, and distribute information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.6,
    "end": 329.583,
    "text": " And two, opacity, where platforms, network data, and algorithms are hidden away from the public.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.284,
    "end": 334.946,
    "text": "So there's all the oversight that could help us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.006,
    "end": 338.828,
    "text": "Issues with our information landscape are really not, we don't really have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.828,
    "end": 343.49,
    "text": "We don't really have any way to handle this currently because of this opacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.731,
    "end": 351.534,
    "text": "Yeah, the kind of Google scrolling has become the icon of our times, and we don't know what's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 352.816,
    "end": 356.238,
    "text": " behind our screens, like why isn't something being shown to us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.698,
    "end": 364.743,
    "text": "We kind of have, you know, at times, you know, vague or less vague, you know, motivations for why that might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 364.803,
    "end": 374.629,
    "text": "But yeah, we really are kind of, yeah, they're controlling the screens and we're on the screens for most of the day, so definitely a lot of power over what we're, our information giants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.811,
    "end": 378.011,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.591,
    "end": 381.413,
    "text": "So, you know, it's clear how we got here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.075,
    "end": 386.515,
    "text": " kind of convenient you know we have these platforms like tick tock and twitter they offer us they do offers like very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.821,
    "end": 390.962,
    "text": " high quality in some regards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.002,
    "end": 392.742,
    "text": "They give us information that we're interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.762,
    "end": 394.903,
    "text": "We like seeing what we're looking at on Instagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.923,
    "end": 396.743,
    "text": "We like seeing the videos we're watching on TikTok.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.803,
    "end": 398.863,
    "text": "They give us this short-term dopamine kick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.923,
    "end": 407.285,
    "text": "But of course, then when we look at the more global picture, we can start seeing the cost of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.805,
    "end": 414.067,
    "text": "Platforms are involved in a host of deeply problematic social phenomena like polarization, misinformation, and systemic distraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.565,
    "end": 437.524,
    "text": " uh and yeah it's interesting to sort of go into the literature like scientific literature on this because uh you know scientists yeah this is just just one uh uh tweet that i remember in particular you know the most important paper of my career talking about this kind of uh dramatic restructuring of the human communication in the span of the decade",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.996,
    "end": 441.798,
    "text": " brought by these platforms with no aim of selling ads.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.818,
    "end": 445.38,
    "text": "Yeah, the paper is called Stewardship of Global Collective Behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.4,
    "end": 447.762,
    "text": "It's a very inspiring call to action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.402,
    "end": 453.946,
    "text": "This is a crisis discipline, just like ecology and sustainability are crisis disciplines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.966,
    "end": 458.329,
    "text": "We need to understand how we're going to help save the planet from ruining nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.369,
    "end": 463.072,
    "text": "So we have a similar kind of crisis that they're sort of claiming on the front of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.761,
    "end": 476.164,
    "text": " So, yeah, so there's been a lot of work on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.204,
    "end": 492.837,
    "text": "So this is, you know, on the scientific side, this book is another kind of interesting, very inspiring book that also kind of puts the fingers squarely on this kind of challenge of attention economy, you know, that says that if we're going to surmount the formidable challenges we face today,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 494.22,
    "end": 497.221,
    "text": " We'll need to be giving rights of attention, rights of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.601,
    "end": 499.882,
    "text": "The book is called Stand Out of the Light.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.122,
    "end": 502.302,
    "text": "It talks about freedom and resistance to the attention account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.523,
    "end": 510.245,
    "text": "And these are all very inspiring sort of works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.844,
    "end": 515.025,
    "text": " The question is, where do we go from here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 515.406,
    "end": 520.809,
    "text": "So we're really inspired, and we understand that the information environments are very sort of putting us in this perilous spot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.23,
    "end": 521.77,
    "text": "What can we do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.85,
    "end": 524.231,
    "text": "So this is also from the same book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 525.012,
    "end": 531.917,
    "text": "We're kind of working toward where we can start to actually be doing work on helping rethink these information environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.553,
    "end": 536.095,
    "text": " Our quest kind of begins with this kind of realization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.115,
    "end": 538.578,
    "text": "And again, this is from the same book we presented earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.138,
    "end": 545.124,
    "text": "If we're at all serious about promoting freedom and autonomy in the digital age, what that would entail is starting to assert and defend our freedom of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.364,
    "end": 548.787,
    "text": "And this is also a very evocative kind of passage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.468,
    "end": 550.248,
    "text": "Freedom of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 550.549,
    "end": 552.971,
    "text": "What does that look like on online spaces?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.011,
    "end": 555.513,
    "text": "There's a lot of ways we can think about freedom of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.834,
    "end": 567.342,
    "text": " Yeah, so a lot of this work is sort of, I think, an attempt to sort of articulate one vision of what freedom of attention looks like online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.824,
    "end": 570.886,
    "text": "Yeah, so we have this quest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.026,
    "end": 575.81,
    "text": "We're trying to sort of put this plan more into more concrete words, what it means, freedom of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.83,
    "end": 580.535,
    "text": "We still don't really have a sort of concrete target, which is what we're working",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 585.427,
    "end": 598.095,
    "text": " As a spoiler, what we talked about in this presentation, what we talked about in the paper, we take stigmergy to be some kind of unifying concept that's underlying attention and sensitivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.235,
    "end": 605.639,
    "text": "So if we need some place to start, a concrete, solid place to put our feet and start working, we think stigmergy is a really useful concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.179,
    "end": 607.92,
    "text": "Many of you probably haven't even heard of stigmergy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.421,
    "end": 610.762,
    "text": "I surely haven't until I met Daniel here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.651,
    "end": 614.935,
    "text": " I learned about collective intelligence in insects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.477,
    "end": 618.179,
    "text": "So we'll start from ground zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.459,
    "end": 626.108,
    "text": "Stigma G is collective behavioral coordination among entities via perception and modification of shared environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.609,
    "end": 628.731,
    "text": "And this, I think, really did originate in studies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.327,
    "end": 632.227,
    "text": " of coordination in ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.368,
    "end": 637.989,
    "text": "So the classic sort of example is trail pheromones that ants leave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.109,
    "end": 640.39,
    "text": "And we'll go into more detail on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.41,
    "end": 645.051,
    "text": "So an ant leaves some kind of environment modification in the form of a trail pheromone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.111,
    "end": 646.331,
    "text": "And then it's attracted to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.351,
    "end": 650.052,
    "text": "And there's some of this collective intelligent behavior emerging as a result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.313,
    "end": 657.054,
    "text": "Another important thing to say about sphygmurgy is this is on the next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.394,
    "end": 657.554,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.545,
    "end": 667.51,
    "text": " Stigma G is really kind of profound when you go into it because we shape the environment and it shapes us in a very profound way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.612,
    "end": 675.015,
    "text": "Some even go as far to say that environments act as a distributed memory system for a collective organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.035,
    "end": 683.461,
    "text": "So if any of you are familiar with extended mind hypothesis in cognitive science, how our tools are sort of extensions of our cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.561,
    "end": 687.464,
    "text": "So Stigma G is a sort of extended mind for collectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.722,
    "end": 693.503,
    "text": " And then we have these divergent feedback loops, where you can go back here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.523,
    "end": 697.724,
    "text": "We have agents, and they're producing some kind of mark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 697.884,
    "end": 701.585,
    "text": "That's where stigma in Greek, mark, is coming from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.745,
    "end": 707.146,
    "text": "So agents are producing these results of action, and that's stimulating the same agent or other agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.626,
    "end": 715.948,
    "text": "And so there's this coupling between the environment, agent acting on the environment, stimulating other agents for action, and then this emergent global sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.301,
    "end": 724.242,
    "text": " Yeah, also important, no large-scale coordination is possible without SIGMERG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.262,
    "end": 730.624,
    "text": "So if you go above n equals 25, then you need SIGMERG communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.724,
    "end": 733.064,
    "text": "It's not like we can do Zoom calls with 1,000 people, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.084,
    "end": 735.045,
    "text": "We need other methods of coordination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.165,
    "end": 737.305,
    "text": "And SIGMERG is this main method of doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.765,
    "end": 741.386,
    "text": "And you can connect modifying environments that other people are participating in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.626,
    "end": 743.047,
    "text": "We'll go through a lot of examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.247,
    "end": 747.488,
    "text": "But the point is that we really need to create healthy SIGMERG infrastructure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 749.508,
    "end": 750.829,
    "text": " for large scale coordination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.589,
    "end": 760.592,
    "text": "And then, yeah, we can ask, is the StigmaGi infrastructure that is provided to us today in the online environments, how healthy is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.612,
    "end": 761.692,
    "text": "So we'll talk about that in a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.712,
    "end": 773.416,
    "text": "Yeah, Daniel, did you have anything you wanted to say about other aspects of StigmaGi that we may or may not be touching here or maybe later?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.976,
    "end": 775.917,
    "text": "On the types of StigmaGi, yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 778.052,
    "end": 779.213,
    "text": " Yeah, so that's our next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.754,
    "end": 790.764,
    "text": "Yeah, we took a lot of inspiration from this work by Leslie Marsh and Christian Onoff, Stigmatic Epistemology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 792.446,
    "end": 801.895,
    "text": "And they give this kind of useful distinction between two kinds of Stigmata G. And you have content-creating Stigmata G, they call it semi-tectonic, I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.883,
    "end": 807.424,
    "text": " Oh, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.464,
    "end": 809.966,
    "text": "Yeah, acts as a sign of good, because I wasn't sure that .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.707,
    "end": 810.887,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.027,
    "end": 813.569,
    "text": "So yeah, contemplating is the versus signaling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.45,
    "end": 815.851,
    "text": "Signaling is just marker-based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.931,
    "end": 818.974,
    "text": "So the examples are helpful here in understanding what they each mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.534,
    "end": 826.761,
    "text": "In a physical environment, contemplating is like actually carving out a trail, which other agents are going to see and use that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.361,
    "end": 831.765,
    "text": "They take that as some kind of sign that we should go on this trail and not just randomly off into the woods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 834.95,
    "end": 837.711,
    "text": " And in a digital environment, you might think of things like writing a document.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 838.032,
    "end": 841.813,
    "text": "So you're actually modifying the digital environment by writing words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.434,
    "end": 844.535,
    "text": "So that's kind of the content creating StigmaG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.115,
    "end": 849.617,
    "text": "And on the other side, you have signaling StigmaG, the marker-based, where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.871,
    "end": 856.812,
    "text": " Looking at things like pheromone trails in a physical environment, so ants aren't actually modifying the environment in any sort of meaningful way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.892,
    "end": 858.673,
    "text": "I mean, they're just doing it as sort of communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 858.693,
    "end": 867.835,
    "text": "They're not changing the environment by like moving some debris out of the path or creating some new path, just like marking some kind of trail for other ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.815,
    "end": 870.496,
    "text": "In the digital environment, you can think of a sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.768,
    "end": 878.353,
    "text": " highlighting or tagging is the counterpart to that in the physical environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.773,
    "end": 880.735,
    "text": "We'll definitely go into this more in detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.676,
    "end": 895.649,
    "text": "Now we are focusing here on this signaling-based Stigma G. We kind of isolate that as this is what we want to focus on because actually, yeah, this doesn't get as much attention if you're thinking about online environments, as we'll see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.669,
    "end": 898.572,
    "text": "A lot of people are talking about this kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.517,
    "end": 901.279,
    "text": " content, creating StigmaG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.619,
    "end": 905.764,
    "text": "People don't mention it in StigmaG, but people are talking about how we create content, how we share it online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.284,
    "end": 909.989,
    "text": "And not as many people are talking about how we're sharing markers online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.249,
    "end": 914.614,
    "text": "So this is why we decided this is kind of an important thing to focus on and bring to attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.155,
    "end": 918.097,
    "text": "Yeah, Andy, do you want to say something else about Texas StigmaG?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.925,
    "end": 938.612,
    "text": " yeah in the physical case the left side the actions that modify the niche and clear out the trail or move pebbles and do the nest architecture and so on the analogy to content creation is very clear like there's some arrangement of mass",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 939.292,
    "end": 958.069,
    "text": " that isn't where it was previously and then on the right side where in the physical case it's more like the pheromone trails which are transient or longer lasting accumulations and uh as i hope you can draw out on the next slide and going forward there is this kind of accumulation",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 959.525,
    "end": 979.967,
    "text": " across both types like somebody might make an initial post on a social media but then somebody else might annotate it and it blurs the line between what is a reaction what's a pheromone and what is like building another piece of content like if somebody responds with a image is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 980.507,
    "end": 983.109,
    "text": " like building or is that like annotating and marking?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 983.57,
    "end": 996.881,
    "text": "And I think that points to the need to have a design language and a way of framing this question that is able to encompass like the pure classical content delivery, like a paper publication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 997.722,
    "end": 1016.083,
    "text": " and pure classical transient marking on some digital context and everything in between so that we don't have to categorize different communication acts along the lines that they've been defined by essentially the platforms that got us into this position.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1017.574,
    "end": 1019.654,
    "text": " Yeah, yeah, yeah, no, that's really great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1019.674,
    "end": 1029.576,
    "text": "And I think here, this maybe creates a misleading impression that there's some kind of categorization with the taxonomy, but yeah, there's really a spectrum between marker base and content creating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.716,
    "end": 1037.278,
    "text": "So it's kind of a, yeah, there's all the gray areas in between and some things, some markers are almost content in their own right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.998,
    "end": 1043.259,
    "text": "Yeah, if I add a highlight with some words on it, is that really content creating or is that more of an annotation, like signaling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.319,
    "end": 1044.599,
    "text": "So yeah, definitely a lot of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.161,
    "end": 1047.081,
    "text": " a lot of spectrum here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.201,
    "end": 1051.043,
    "text": "And this is just to say that we're focused more on this side of the spectrum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.123,
    "end": 1054.764,
    "text": "And really, we can talk about this side of the spectrum to give a better idea of what we're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1055.824,
    "end": 1058.385,
    "text": "So we're looking at the emerging markers on the web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1059.065,
    "end": 1065.827,
    "text": "And the reason we're focused on them is because, in a lot of respects, they function as the digital traces of human attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.308,
    "end": 1073.39,
    "text": "And you're looking at things like reactions, associations that people might make, hyperlinks, like, oh, I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.273,
    "end": 1080.9,
    "text": " or a tool like Notion, you're, you know, you're linking to some other page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.0,
    "end": 1086.169,
    "text": "I think this reminds me of, yeah, tags, tagging content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.389,
    "end": 1088.473,
    "text": "Oh, this is a, on the topic of, I don't know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.125,
    "end": 1093.525,
    "text": " is interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.545,
    "end": 1094.906,
    "text": "This is an implicit, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.026,
    "end": 1096.606,
    "text": "An explicit and an implicit marker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.626,
    "end": 1098.867,
    "text": "So some of these markers, people are kind of doing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.927,
    "end": 1104.368,
    "text": "They're leaving consciously the digital pheromone trail by liking some posts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1104.929,
    "end": 1110.47,
    "text": "And other times, it's actually like you can think of it as an implicit marker, where it's just like the trail that we're traveling on the web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.49,
    "end": 1113.691,
    "text": "We're leaving this marker, and it is definitely being harvested, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.711,
    "end": 1119.393,
    "text": "Like click-through data is very valuable data, as we'll see also later with platforms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.203,
    "end": 1121.403,
    "text": " or selling it and hoarding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.423,
    "end": 1128.826,
    "text": "But yeah, there's the difference in what people, people might not think they're even creating any kind of data here, even though people today are more sort of aware of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.326,
    "end": 1134.507,
    "text": "But yeah, I think there's a lot of interesting, these are some interesting future directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.628,
    "end": 1136.368,
    "text": "If we're talking about like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.498,
    "end": 1138.639,
    "text": " implicit versus explicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.659,
    "end": 1148.584,
    "text": "So there might be things that are more implicit in the future, for example, pupil measurements or gaze tracking, rain computer interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.604,
    "end": 1157.289,
    "text": "So this is just where you're looking on a screen could also be a sigmargic marker, given that someone is recording it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.429,
    "end": 1159.651,
    "text": "It's getting recorded in some kind of medium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.371,
    "end": 1164.674,
    "text": " and being used to sort of guide somewhere else's attention, yes, then that is a stigmatic marker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.214,
    "end": 1168.236,
    "text": "If no one is recording it, then you could say, yeah, it's not actually a stigmatic marker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.225,
    "end": 1172.807,
    "text": " There are definitely, yeah, there's a few things to say about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1173.107,
    "end": 1180.511,
    "text": "One is that the reason these markers are so important is because they're very cheap to create, but they have a very high information content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.731,
    "end": 1188.655,
    "text": "So this is why machine learning researchers and practitioners will pay a lot of money for human annotated data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.675,
    "end": 1189.716,
    "text": "Annotation is like a very,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.676,
    "end": 1199.601,
    "text": " It can be a few bits of information, what label is some category, but it's very high information content because the human looked at this picture and decided, okay, this is a dog and this is a cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.841,
    "end": 1203.023,
    "text": "So these things are very high information content and that makes them very valuable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.083,
    "end": 1205.504,
    "text": "And they're also cheap to create and interpret.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.524,
    "end": 1211.187,
    "text": "So yeah, this makes markers very valuable, but it also creates challenges with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.651,
    "end": 1218.952,
    "text": " ethics, user consent, how the data is being used, privacy, because this thing is very valuable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.972,
    "end": 1221.893,
    "text": "But on the other hand, we're also creating a lot of things without even thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.013,
    "end": 1225.414,
    "text": "So should this be ours, or should it not be ours?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.474,
    "end": 1227.434,
    "text": "So a lot of questions there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.395,
    "end": 1229.695,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.855,
    "end": 1236.536,
    "text": "So we're getting closer now to certainty, understanding where our question is going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.696,
    "end": 1239.757,
    "text": "So yeah, emerging markets could be harnessed for health and collective sensemaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.339,
    "end": 1241.861,
    "text": " But centralized platforms are guarding them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.001,
    "end": 1248.969,
    "text": "Now we kind of can see that if we look now, everywhere we look at what platforms are doing, we can see that they're actually these dragons that are hoarding the emerging markets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.009,
    "end": 1254.255,
    "text": "Like everything we're doing is getting really recorded without us having much access to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.495,
    "end": 1261.603,
    "text": "So the click-through data, likes, all this kind of stuff is very precious and it's getting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.635,
    "end": 1268.796,
    "text": " Okay, we kind of know where we're going now a little better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.816,
    "end": 1276.199,
    "text": "I want to say one thing, this is just a little, yeah, go into a little bit of what we mean when we say healthier collective sentiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.279,
    "end": 1279.54,
    "text": "Like, why do we think that sigmergic markers could be harnessed for healthier collective sentiment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1279.641,
    "end": 1287.564,
    "text": "So let's try to give a little more insight on like what is healthier, unhealthier, you know, information comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.084,
    "end": 1288.524,
    "text": "Yeah, we can look",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.398,
    "end": 1296.364,
    "text": " This is kind of the mental model I had in my mind as I was thinking about this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.685,
    "end": 1306.359,
    "text": "So, you know, if you're looking at healthy figure G in ants, so an ant, you know, finds some food source and they start bringing it back to the nest, they lay the pheromone trail, that line there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.775,
    "end": 1308.296,
    "text": " Sorry for the poor graphics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1308.576,
    "end": 1312.198,
    "text": "And other ants are going to see that trail, be attracted to it, and follow it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1313.319,
    "end": 1314.56,
    "text": "The food source is consumed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.24,
    "end": 1319.062,
    "text": "And meanwhile, the pheromone trail is decaying, and the food source is consumed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.323,
    "end": 1322.304,
    "text": "Eventually, it just decays, and then no ants are going to go there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.324,
    "end": 1324.185,
    "text": "They don't need to waste their time because there's no more food there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.205,
    "end": 1328.307,
    "text": "That's kind of how the healthy sort of pheromones for pheromones decay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.208,
    "end": 1330.909,
    "text": "The ground holds them for some time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.848,
    "end": 1335.591,
    "text": " and then there's the sort of predictable operating characteristics of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.131,
    "end": 1343.837,
    "text": "Now imagine a different kind of setup where you have a different kind of ground, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.857,
    "end": 1349.981,
    "text": "Like here I'm using platform just to be suggestive, but you have a platform which is actually like swallowing pheromone, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.081,
    "end": 1350.482,
    "text": "Not ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.982,
    "end": 1353.163,
    "text": " are trying to lay the pheromone, but it's kind of decaying, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.183,
    "end": 1366.769,
    "text": "So this is already one way in which the stigmergic infrastructure is not healthy because, in a sense, the ants are going to decline the food because they're not going to be able to lay the pheromone there to attract other ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.969,
    "end": 1371.991,
    "text": "Another thing that could happen is platforms are over-anticipating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.051,
    "end": 1376.433,
    "text": "So if this ground, instead of decaying predictably,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.602,
    "end": 1379.983,
    "text": " for some reason, reacting and over-amplifying pheromones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.023,
    "end": 1388.328,
    "text": "So even when the food source was consumed, ants would still be kind of traversing and wasting their time, even when there's no food there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.308,
    "end": 1393.611,
    "text": "So another thing, you can kind of see the parallels in light spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.912,
    "end": 1404.557,
    "text": "Yeah, a third thing you might think of is a case where you have areas where you can't leave the pheromone trail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.188,
    "end": 1414.173,
    "text": " If there's food that's outside the area where you can leave pheromone, then ants won't be finding it because, you know, just the properties of the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1414.353,
    "end": 1432.465,
    "text": "So these are all kinds of ways in which there's, just trying to give you the sort of, yeah, convey the intuition that there are, it's a very sort of delicately tuned system, and there are many ways that it can be out of tune, and which would, you know, lead to very disastrous consequences for the sort of organism, the collective organism as a whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.485,
    "end": 1435.888,
    "text": "Yeah, Will, did you want to say something about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.229,
    "end": 1454.561,
    "text": " Yeah, I was just going to observe that looking back on the concept of sort of information silos that you discussed with Fox News and CNN, maybe one more aspect of unhealthy stigmergy is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.451,
    "end": 1462.853,
    "text": " some of these stigmatic markers or trails are visible to one group and invisible to another group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.373,
    "end": 1467.914,
    "text": "So you also have this failure to create a shared reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.934,
    "end": 1473.716,
    "text": "I wonder if that's another aspect of unhealthy stigmata.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.136,
    "end": 1474.696,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.756,
    "end": 1482.418,
    "text": "I think that would definitely be another great example where you might have a certain part of the hive is going to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.374,
    "end": 1508.695,
    "text": " sensing and then another type that on the other part of time is going to be something they're really going to be just living in share share not shared realities uh yeah for sure so i think that's a that's a great example also yeah so yeah those are a few kind of angry intuitive examples to try to get the uh point across that if we're looking at healthier information environments uh they're going to be highly complex because as you can see a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.794,
    "end": 1541.214,
    "text": " simple and even that was complex but um you have all these you know different kinds of markers people are leaving and the different parameters to reach the markers and how they're getting spread and used to recommend content so a lot of parameters here the point is that as designers and participants in these information environments uh we'll need to be able to assume more control more descent decentralized control right because we don't want a central designer but uh we'll need to be able to sort of play with these parameters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.054,
    "end": 1545.336,
    "text": " And currently, as we discussed, there's the opacity and centralization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.376,
    "end": 1551.901,
    "text": "So very few people are able even to tweak these parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.941,
    "end": 1555.584,
    "text": "And they can do experiments on global scale, and they're the only people that can do them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.045,
    "end": 1559.166,
    "text": "So yeah, that was the point of these examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.306,
    "end": 1562.889,
    "text": "So our proposals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.929,
    "end": 1567.932,
    "text": "So finally, we can talk about where we think a fruitful direction would be to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.881,
    "end": 1593.969,
    "text": " yeah we call it open source attention and we try to draw the parallel to open source software and decentralization movements and the sort of as i was alluding to earlier they're all about freeing most of the work up until now has been about freeing content creation sharing so you have things like github and you know decentralized currencies like bitcoin um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.913,
    "end": 1599.097,
    "text": " All those are examples of the kind of semi-tectonic stigmergy, the content-creating stigmergy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.117,
    "end": 1604.903,
    "text": "So we can create code, we can create documents, we can publish social media posts, all that kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.923,
    "end": 1605.743,
    "text": "That's content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.804,
    "end": 1608.526,
    "text": "We're talking about open source tension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.906,
    "end": 1611.369,
    "text": "We're looking at sort of the complement to that, the stigmergic markers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.45,
    "end": 1614.251,
    "text": "Is anyone looking at this idea of freeing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.228,
    "end": 1617.009,
    "text": " the reactions to contact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.249,
    "end": 1628.734,
    "text": "So we're doing a lot of this kind of work on decentralizing contact patient, but we're actually, what we are kind of the moment is like, we're not actually doing much work on freeing these kind of reactions to contact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.754,
    "end": 1635.477,
    "text": "So on the technical level, we think that just as we have sort of systems and platforms that will help us with protocols that help us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.376,
    "end": 1638.256,
    "text": " share content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1638.957,
    "end": 1641.017,
    "text": "We need the same for sharing reactions to content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.157,
    "end": 1643.298,
    "text": "That's on the technical level, like at a high level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.318,
    "end": 1656.942,
    "text": "And then we have here sort of just like the social aspect of the open source software movement with these kind of hacker heroes that were building code in public and sharing it without sort of any monetary compensation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1657.782,
    "end": 1666.225,
    "text": "Then we'll have a similar kind of, we envision kind of a similar kind of sense maker hero that are sort of the counterpart and they're doing kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1666.795,
    "end": 1670.259,
    "text": " curation in public and they're mindful of their digital attention traces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.279,
    "end": 1679.41,
    "text": "So they're doing kind of open source attention, open source thinking, sort of following these lines of open source coding with the hackers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.273,
    "end": 1682.693,
    "text": "Yeah, so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.221,
    "end": 1708.892,
    "text": " let's look at what open source attention means for like uh information ecosystems like how we translate that to information ecosystem now we can actually we're zooming in now we're getting into the sort of more in the direction like concrete uh implementation so first let's understand like the platform-centric information because with all the new terms we have the new terminology so what we can see like okay these are the dragons that are hoarding our attention data and how it happens is we have these kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.557,
    "end": 1711.1,
    "text": " Now we can sort of see what's happening here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.14,
    "end": 1718.632,
    "text": "The doom controlling we're doing here is kind of a low agency annotation interface that's collecting our submerging markers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.663,
    "end": 1735.077,
    "text": " platforms are storing this data, they sell it to advertisers, they use it to drive content discovery in a way that sort of is optimizing for platforms by serving us new content that will keep us on our screens, as well as ads that will keep the advertisers happy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.918,
    "end": 1738.62,
    "text": "So they can sort of, this is the feedback loop, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.7,
    "end": 1744.746,
    "text": "They have the control loop closed on us because they have the data and they have the algorithms that are serving content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.922,
    "end": 1752.506,
    "text": " Now, how might you do something alternative that doesn't involve those dragon platforms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.126,
    "end": 1757.929,
    "text": "So what we propose is a decentralized maker-centric ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.949,
    "end": 1759.871,
    "text": "So instead of users, we have makers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.931,
    "end": 1764.093,
    "text": "And makers are these kind of high-agency annotators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.113,
    "end": 1768.536,
    "text": "So you can think of all these personal knowledge management tools, Notion and Roam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.216,
    "end": 1771.778,
    "text": "And we'll look at FIO hopefully later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.306,
    "end": 1778.567,
    "text": " Then all these different kinds of annotation interfaces, people are building these knowledge management tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.107,
    "end": 1783.809,
    "text": "You can actually think of them as annotation interfaces that are collecting stigmatic markers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.109,
    "end": 1792.651,
    "text": "But the crucial point is that we're talking about a case where makers are owning these markers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.731,
    "end": 1797.593,
    "text": "This is the point of self-sovereign storage, self-sovereign data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.353,
    "end": 1801.574,
    "text": "You have things like solid protocol that allow people to actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1802.076,
    "end": 1803.397,
    "text": " control and own their own data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.857,
    "end": 1813.544,
    "text": "And we're saying if we apply this to Stigmergic markers, we actually get this separation, decoupling of the content discovery algorithms and the Stigmergic markers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1813.704,
    "end": 1815.686,
    "text": "And then you kind of break up this platform loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.846,
    "end": 1820.149,
    "text": "And then content discovery services will need to be sort of focused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1820.529,
    "end": 1829.195,
    "text": "They'll need to be aligned with the, take into account the sort of human-centered incentives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.652,
    "end": 1833.092,
    "text": " makers will be able to share data with these content discovery services.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.112,
    "end": 1837.673,
    "text": "And there'll be a lot of diverse content discovery services, but they won't have control over our data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.793,
    "end": 1840.594,
    "text": "And then that's kind of a way to break up that vicious cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.534,
    "end": 1856.797,
    "text": "So you can imagine, you know, different kinds of feed algorithms that you'll have like a competing market feed algorithms, or you'll have matchmaking services, uh, AI recommendation, all kinds of, um, diverse new discovery services.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.997,
    "end": 1859.297,
    "text": "And you can use all of them or any of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.104,
    "end": 1871.206,
    "text": " and more human-centered environment than the type we were looking at previously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.487,
    "end": 1873.707,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.428,
    "end": 1894.917,
    "text": "One of the main challenges, like one of the first challenges that this kind of proposal is running into is how to scale up because we have this kind of network effect where we need to compete essentially with Facebook and Twitter and all these huge established networks because they have the data",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1896.167,
    "end": 1898.569,
    "text": " the high quality recommendations and we don't have anything right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.009,
    "end": 1905.053,
    "text": "So the idea here is to bootstrap growth in personal knowledge management tools for collective knowledge management.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.153,
    "end": 1910.677,
    "text": "This is an idea that's kind of been floating around in a lot of different spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.717,
    "end": 1916.04,
    "text": "But yeah, this kind of feeling that user curated knowledge is going to be stuck in single player tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.381,
    "end": 1919.763,
    "text": "And all the while, search engines really aren't doing as well as they could be doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1920.8,
    "end": 1926.604,
    "text": " how do we build more collectively curated knowledge that works with it, not just like in silos second grade.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.644,
    "end": 1942.714,
    "text": "So I think one way to look at it is that, yeah, from going, sort of this is swinging the pendulum in the other direction, where if previously there was a data silos in the platform levels, so each platform is like a data silo using that for harmful sort of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.851,
    "end": 1946.733,
    "text": " purposes, this kind of problem is here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.853,
    "end": 1955.16,
    "text": "What's currently happening is each of these relatively small knowledge management tools is going to be a data site.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.58,
    "end": 1959.243,
    "text": "And they won't be large enough to reach critical math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.263,
    "end": 1962.245,
    "text": "They won't be large enough to provide high quality content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.265,
    "end": 1964.667,
    "text": "So they have some data, but it's not enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.707,
    "end": 1966.469,
    "text": "So all of them are competing versus each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.505,
    "end": 1975.27,
    "text": " None of them are going to be able to provide this kind of high-quality service, and they won't be able to beat the platforms, the big platforms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.37,
    "end": 1983.296,
    "text": "So what we propose here is a protocol, not platforms approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.316,
    "end": 1986.878,
    "text": "And this is something that's very widely advocated for in Web3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.898,
    "end": 1993.783,
    "text": "So you see protocols for all kinds of interoperable online objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.883,
    "end": 1996.364,
    "text": "And what we're talking about here are protocols",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.822,
    "end": 2023.912,
    "text": " emerging primitives so you might imagine a protocol for light or backlink or other kinds of things we talked about earlier and that what is effectively would enable is having markers uh being able to you could share markers essentially so instead of having these dialogue markers you can actually pull them so if i'm collecting my reading list in notion someone else is doing it in rome and someone else is doing it in another app they can all sort of be shared in this common format and use",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.828,
    "end": 2028.249,
    "text": " for driving this kind of discovery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.21,
    "end": 2032.571,
    "text": "So that is kind of where we're envisioning it going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.832,
    "end": 2040.476,
    "text": "We took a lot of inspiration from this very good essay on protocols.platforms, highly recommend it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.758,
    "end": 2049.381,
    "text": "So yeah, I think kind of the main version of that is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.728,
    "end": 2059.597,
    "text": " We have these kind of current situation where these small independent platforms are going to be eaten by the big fish, TikTok, and Twitter, and Facebook, and all those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.638,
    "end": 2069.146,
    "text": "And the way for these independent platforms to coordinate is through interoperability, using protocols for signal-merging markers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.427,
    "end": 2071.048,
    "text": "That's kind of our vision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.956,
    "end": 2083.181,
    "text": " So some next steps we are thinking about are definitely kind of going deeper into the weeds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.201,
    "end": 2094.769,
    "text": "There are a lot of questions remaining about social incentives, the tech stack, malicious use of these kind of technologies, cultural transitions, like how do we do the transition from users to makers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.09,
    "end": 2102.274,
    "text": "This kind of work, this kind of paper was more like a blue sky idea paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.434,
    "end": 2105.156,
    "text": "It was more like functioning as a call to action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2106.607,
    "end": 2107.728,
    "text": " to the sort of challenges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.588,
    "end": 2115.512,
    "text": "We're saying we need to start building tech for governing our attention, which is sort of something that we haven't heard much talked about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.612,
    "end": 2119.895,
    "text": "So we wanted to sort of bring that, emphasize that in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.035,
    "end": 2125.878,
    "text": "Yeah, we are really looking for all kinds of collaborators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.898,
    "end": 2129.3,
    "text": "So check out our website and connect with us if any of this interests you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.903,
    "end": 2136.429,
    "text": " I think we can maybe pause there and open for discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.413,
    "end": 2140.114,
    "text": "Awesome questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2141.695,
    "end": 2143.557,
    "text": "Thanks for the presentation, Ronan.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2144.398,
    "end": 2147.962,
    "text": "For those who are watching live, feel free to write a comment in the live chat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2149.013,
    "end": 2167.192,
    "text": " Otherwise, Will, if you have any reflections or thoughts, and then we have a few more slides to go through in this next steps phase, and that'll include looking a little bit more at some platform affordances and also talking about how this connects to active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2171.941,
    "end": 2175.083,
    "text": " Uh, no, no immediate thoughts here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.443,
    "end": 2179.546,
    "text": "Um, I need to talk about when we get to the discussion and the questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.487,
    "end": 2180.687,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2181.307,
    "end": 2186.831,
    "text": "Let's go to, uh, the, uh, promising directions and talk about that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2187.031,
    "end": 2190.633,
    "text": "And then we'll go after that to VO and then active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2192.434,
    "end": 2192.735,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.775,
    "end": 2193.035,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.335,
    "end": 2199.339,
    "text": "Um, so yeah, some promising directions we kind of became aware of just actually even after",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.09,
    "end": 2211.015,
    "text": " after we wrote the paper, this is an interesting work from a few years back on opportunities and challenges around public web activity tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.035,
    "end": 2221.12,
    "text": "So essentially getting people to look at experiments with human subjects and explored the kind of affordances for allowing people to share browsing activity traces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.5,
    "end": 2226.842,
    "text": "For example, like URLs they visited and time spent on the web page and information like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.673,
    "end": 2232.215,
    "text": " They gave people a tool that would allow them to do that inside the browser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.415,
    "end": 2239.541,
    "text": "And they checked small groups of people, different kind of friend groups or research groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.441,
    "end": 2242.122,
    "text": "And they found a lot of interesting things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.182,
    "end": 2252.771,
    "text": "I think some of the highlights were that they found that while people had privacy concerns, they definitely can and will tailor their sharing depending on the context and incentives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.492,
    "end": 2258.635,
    "text": "People felt that this made them a lot more mindful of their browsing behavior and a lot of times",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.16,
    "end": 2262.38,
    "text": " which kind of speaks to the user to maker transition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.521,
    "end": 2268.802,
    "text": "If people are sort of being open source, just like you write open source code, you kind of make sure it's like high quality because we know people are looking at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.322,
    "end": 2271.302,
    "text": "So staying maybe with like attention and browsing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.703,
    "end": 2289.026,
    "text": "And people also could kind of feel how this would help them better sort of navigate the information landscape because they were saying like, you can better assess the legitness of some website by knowing how many people visited it, who visited it, and this kind of shared public information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.874,
    "end": 2292.535,
    "text": " Yeah, this book kind of caught my eye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.555,
    "end": 2303.82,
    "text": "Yeah, if you ask me, I would rather, for a thousand to a billion times, that researchers for an academic and humanistic knowledge purposes are the ones that can map information to our first humanity rather than private companies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.84,
    "end": 2308.362,
    "text": "This is really speaking to people feeling that human-treated search, humans for humans,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.585,
    "end": 2311.486,
    "text": " can be healthier information environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.907,
    "end": 2315.689,
    "text": "Definitely, this work also pointed to sort of the limitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.97,
    "end": 2320.313,
    "text": "It's like, how do we scale up to something larger than just a group of friends?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.773,
    "end": 2325.216,
    "text": "So yeah, but definitely, this is a cool preliminary study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.298,
    "end": 2333.462,
    "text": "Yeah, Theo, we have also definitely a very interesting kind of preliminary work that Will can tell us more about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.284,
    "end": 2336.024,
    "text": "Yeah, thanks, Ronan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.432,
    "end": 2361.438,
    "text": " So Veo is a prototype stage software project that was actually originally designed to be a platform that is a kind of knowledge garden, a way for people to visually build their network of references and make connections and trace their paths back",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.647,
    "end": 2370.674,
    "text": " And it was, in a sense, a way of creating trails for people between pieces of content in different platforms or silos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.255,
    "end": 2378.822,
    "text": "And of course, the problem with that, as Ronan has discussed, is it itself is in a cycle and is in a platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.862,
    "end": 2383.045,
    "text": "So it's a little bit self-defeating in its original conceptualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.946,
    "end": 2412.126,
    "text": " um so right now we're actually in a stage where we're sort of going back to the drawing board taking this this new research and this new approach of building a tool that works on an interoperable protocol using distributed data instead of a centralized data store with proprietary mechanisms of interaction and hopefully we can take vo and make it a a test case where we can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.027,
    "end": 2436.088,
    "text": " practically apply the concept of this common sense protocol to build out a piece of software where the data can then be used in other pieces of software other front ends other search engines and so on and in that way start to actually break free of this um platforms dominate our attention paradigm and see kind of what the possibilities and limitations are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.448,
    "end": 2442.271,
    "text": " We have a short demo that is kind of the original concept of VO.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.871,
    "end": 2448.095,
    "text": "So we'll go through that real quick.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2451.057,
    "end": 2456.52,
    "text": "I don't think the sound will play, but just full screen the video and just play it and Will describe us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2456.76,
    "end": 2457.701,
    "text": "Yeah, okay, I got it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2457.741,
    "end": 2460.543,
    "text": "Yeah, if you want to describe Will, you can kind of say what we're seeing there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.243,
    "end": 2461.644,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.944,
    "end": 2466.067,
    "text": "So this is an example of how VO might work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.19,
    "end": 2471.454,
    "text": " It takes you through a process of discovery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.654,
    "end": 2482.604,
    "text": "You can essentially keep track of what you're interested in learning, go through the entire search process, look for sources that seem interesting or relevant to you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.723,
    "end": 2492.892,
    "text": " And then as you go, you can go through and annotate different pieces, take detailed notes, take excerpts, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.112,
    "end": 2504.043,
    "text": "And then as you have new questions, as there are new areas that you would like to search, you can essentially capture those as you go without breaking your train of thought, without breaking your research process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.544,
    "end": 2506.225,
    "text": "And then from there,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.348,
    "end": 2520.66,
    "text": " VO automatically builds a visual map of what you've explored and what you have yet to explore so that you can continue to build an ongoing research map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.68,
    "end": 2527.267,
    "text": "And then when you come back to this many months later, you have the entire context of your whole research process visually laid out for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.627,
    "end": 2531.871,
    "text": "Everything you looked for, everything you found, everything you were interested in but never got around to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.291,
    "end": 2543.767,
    "text": " you kind of take a lot of the burden of manually managing your research process off of the researcher and allow the technology to do what the technology does best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.027,
    "end": 2547.552,
    "text": "So largely, this is just a way for you to take",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.994,
    "end": 2557.562,
    "text": " kind of a walk at your own pace through the information you're interested in or is valuable to you at the level that you can understand it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.282,
    "end": 2568.713,
    "text": "So it allows you to sort of self-select the best learning path without really getting lost in the platforms and algorithms and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.799,
    "end": 2579.021,
    "text": " I guess, content suggestions or even curated content or courses that might not be at the proper level of depth for where you are at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.462,
    "end": 2582.242,
    "text": "So, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.302,
    "end": 2582.602,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.922,
    "end": 2583.843,
    "text": "Oh, did you want to say anything?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2584.603,
    "end": 2586.944,
    "text": "Well, go first, Ronan, and then I'll add a few notes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2588.004,
    "end": 2598.187,
    "text": "I just wanted to say that this is, I mean, this was one of the things that sort of, I think, triggered the whole collaboration and got us started on this direction of research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.051,
    "end": 2604.634,
    "text": " like seeing what Vio can, like Vio does a few intriguing things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.694,
    "end": 2613.859,
    "text": "Like one is that many annotation tools don't provide this kind of temporal relation between annotations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.899,
    "end": 2618.822,
    "text": "So they're just like, you're annotating everything and you don't really know the structure of like how you got there and where you went from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.282,
    "end": 2627.207,
    "text": "And things like laid out in a trail form was really evocative and sort of thinking about like, how would this look if we could share this kind of information and like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.58,
    "end": 2633.924,
    "text": " imagining the sort of multiplayer VO where you might be standing on a node and then you're like seeing the trails of other people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.245,
    "end": 2645.172,
    "text": "And maybe it's like even using AI to sort of highlight the people that are maybe, you know, recommended that you should follow their trails based on Stigma G and crowd signals and AI or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.632,
    "end": 2650.796,
    "text": "So like that was very, like, that was like a moment of like, wow, that would be an amazing tool to have as you're navigating the web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.757,
    "end": 2655.419,
    "text": "And yeah, one of the thought there about,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2657.06,
    "end": 2660.141,
    "text": " Yeah, I think those are the three things I wanted to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2660.241,
    "end": 2667.184,
    "text": "Social VO and the sort of linking annotations are like two seem like really, really intriguing directions to take this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.304,
    "end": 2670.285,
    "text": "Yeah, I also...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2672.273,
    "end": 2682.755,
    "text": " saw that transition between the first person knowledge management and the second person that Ronan had brought up earlier, and it hinges on shared landmarks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2683.436,
    "end": 2696.199,
    "text": "And so being able to think of these in a spatial context, which maybe we can return to with active inference, and then being able to go down to just one's own path, like just like we'd have a trace on a,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2697.839,
    "end": 2724.076,
    "text": " google maps or something like that but then see multiple paths together and have curation approaches there and then i think it's really uh it's a fascinating tension with this functionality the single or the multiplayer case it could be done in a centralized platform web 2 strategy and there's even arguments for why that would be streamlined more efficient more secure all these different aspects",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2725.399,
    "end": 2747.32,
    "text": " yet in a different way or at a higher level there are challenges and failure modes and so on that would be like dismantling the function potentially for example allowing for a centralized point of control over those path recommendation algorithms so as long as the architecture is bundled",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2748.149,
    "end": 2752.05,
    "text": " then there are certain failure modes that this is actually escalating to the next level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2752.15,
    "end": 2764.413,
    "text": "People say, oh, we used to have the newsfeed, it was linear, and now we have the branching newsfeed, and it's so much more fun and engaging, but then it's just representing the next escalation in attention capture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2764.433,
    "end": 2768.473,
    "text": "Yeah, that's a really good observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.414,
    "end": 2771.074,
    "text": "Oh yeah, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.681,
    "end": 2782.813,
    "text": " Yeah, that's kind of why we're motivated to pull out of this platform paradigm and kind of follow this new approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.833,
    "end": 2789.741,
    "text": "Because fundamentally, all we're trying to do is enhance people's ability to make sense of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.181,
    "end": 2792.584,
    "text": "And if we make a tool that undermines it...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.304,
    "end": 2797.085,
    "text": " No matter how cool or fun it is, we failed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.686,
    "end": 2818.112,
    "text": "So bringing it into a context where this data is... You can take the same data and use it in different apps, or you can take data from different apps and use it in here, and you can kind of break free of certain mechanisms where the fact that the data is siloed could be used against the end user.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.365,
    "end": 2848.393,
    "text": " and instead create a paradigm where this information can be acted on and interpreted in a lot of different ways, where there's room for innovation and insights and creativity and competition and disruption, where this model can be evolved outside of just this app by one team of developers and can be integrated into different ways of interacting with information and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.51,
    "end": 2859.638,
    "text": " by freeing it from that, then the concept isn't only serving a business or a small group of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.658,
    "end": 2864.742,
    "text": "It's serving everybody who stands to benefit from the concept being available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.762,
    "end": 2866.443,
    "text": "So that's kind of what we're trying to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.483,
    "end": 2871.427,
    "text": "We don't want to shoot ourselves in the foot and violate our purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.567,
    "end": 2871.908,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.088,
    "end": 2872.388,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2873.068,
    "end": 2873.329,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.769,
    "end": 2874.009,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.109,
    "end": 2877.272,
    "text": "I was thinking, just one more thought, I was thinking of like the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.851,
    "end": 2881.072,
    "text": " Like you were talking about the different kinds of apps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.432,
    "end": 2886.695,
    "text": "By letting this data be free, it opens up the space of, you don't really know how it can be used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.835,
    "end": 2892.138,
    "text": "I mean, we know it's incredibly valuable, but you can't even envision how it can be used in different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.158,
    "end": 2895.239,
    "text": "I was just thinking of, for example, learning apps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.259,
    "end": 2898.501,
    "text": "I think there's a lot of intriguing space there to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.281,
    "end": 2927.162,
    "text": " you know the trail that someone is making in the beginning of their steps in some topic is very different to the trail that someone is making like an advanced trail and you could if you could you know learn these different kinds of trails you could build like really cool online curriculum um services that's one thing i was thinking of but there's just like so many others and i think there's just a lot of questions you know people are maybe thinking themselves like yeah i mean obviously there's technical questions because what we're saying here just to kind of drive the point home we're saying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2927.921,
    "end": 2931.562,
    "text": " We don't think Veo should be the only tool that will let you map these rabbit holes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.582,
    "end": 2935.282,
    "text": "We want a lot of different tools to be able to do this and interoperate with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.822,
    "end": 2937.123,
    "text": "That's one thing that's kind of OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.143,
    "end": 2942.764,
    "text": "Because it raises a lot of confusing questions about, OK, how do you guys monetize this stuff?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.304,
    "end": 2946.384,
    "text": "Where are the data getting stored?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.444,
    "end": 2948.765,
    "text": "How are people not stealing your data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2948.885,
    "end": 2954.546,
    "text": "Or how are you maybe getting compensated for people using your data in different kinds of services?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.68,
    "end": 2960.082,
    "text": " We're aware that there are a lot of challenging questions there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2960.162,
    "end": 2970.488,
    "text": "We're not naive about that, but we do think that these kind of questions are joining broader questions in Web3 space, the data sovereignty and decentralized identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.849,
    "end": 2977.933,
    "text": "All of the bigger questions that a lot of people are working on, we see ourselves interfacing with them in a modular way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.013,
    "end": 2984.877,
    "text": "If you don't have a good solution for renumerating people on their data creation, we can draw from that and apply it here, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.042,
    "end": 2997.752,
    "text": " Let's bring it to Active Inference and maybe go to the second of the Active Inference slides first.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2997.832,
    "end": 2997.992,
    "text": "Awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2998.072,
    "end": 2999.394,
    "text": "And the next slide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3008.834,
    "end": 3028.429,
    "text": " We'll come back to the general questions, but I just wanted to start with this one, highlight some awesome recent work and provide like an example-based entry point to the intersection of attention, which is often used very abstractly or in a single entity case in active inference or in a non-stigmatic setting",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3029.17,
    "end": 3033.413,
    "text": " how attention is being used and bring it to like a very clear applied case.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3034.073,
    "end": 3038.936,
    "text": "So this is the recent work of Alborazen et al from this year.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3040.017,
    "end": 3056.187,
    "text": "And they are making a model of kind of like a toy Twitter where individuals are involved in just like in any active inference model, they're involved in perception, cognition and action and then impact in the niche.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3057.228,
    "end": 3069.74,
    "text": " And in this case, what is being perceived from the niche, what the generative process is handing those entities is information that in this case is being proxied by different hashtags.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3070.181,
    "end": 3072.904,
    "text": "So, you know, yes on X, no on X.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3074.025,
    "end": 3080.008,
    "text": " Of course, hashtags have much more complex usage, simply tagging content or using or not using.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3080.249,
    "end": 3094.817,
    "text": "One can see many ways that the hashtag is not the whole semantic picture, but again, it serves as a proxy and as an expansible platform to make models that could include different kinds of communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3097.174,
    "end": 3104.443,
    "text": " On the left is a graphical representation of how this simulation plays out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3104.623,
    "end": 3111.771,
    "text": "And so a simulation like this can be used prospectively given a set of parameters to evaluate different futures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3112.412,
    "end": 3116.716,
    "text": " It can also be used given empirical data to tune those parameters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3117.236,
    "end": 3126.764,
    "text": "And in fact, there can be kind of a bidirectionality or a tale of two cities, tale of two densities, where empirical data are coming in and updating parameters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3127.225,
    "end": 3134.931,
    "text": "And then those updated parameters are used in a generative capacity, again, to look at counterfactuals or to simulate futures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3135.672,
    "end": 3159.07,
    "text": " and it's called a graphical model because it's based upon a bayesian graphical network model the nodes whether they're a circle or square there's some details to go into but the nodes are variables so that would be like x equals those are the nodes and that would be equivalent to like a variable in a script",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3159.77,
    "end": 3171.965,
    "text": " So whether you think about this more mathematically or more from a programming and implementation angle, the nodes are like the variables and the edges represent relationships amongst the variables.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3172.826,
    "end": 3178.873,
    "text": "And for those who have more familiarity with this type of representation of an active inference model, they'll",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3179.654,
    "end": 3196.362,
    "text": " see what some of these letters mean and what roles they might be playing here but suffice to say that this graphical network here is representing the cognitive context of multiple entities that are receiving information in the form of hashtag",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3197.102,
    "end": 3220.074,
    "text": " doing some cognitive process on it updating their beliefs as well as choosing how to act and then implementing that action and then that is like one time step in the simulation so i wanted to provide this example because it's a great case study of bringing active inference into a social and digital setting",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3220.934,
    "end": 3227.596,
    "text": " And it's a great direction that uses also the PyMDP package developed by some of the authors and others.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3228.236,
    "end": 3240.659,
    "text": "So it's a great case on multiple sides to understand how research developments and open source software developments can meet up with socially relevant cases.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3241.179,
    "end": 3243.1,
    "text": "So I wanted to just describe that case.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3244.324,
    "end": 3254.649,
    "text": " If either of you have any thoughts or questions, and then the next case that we'll look into will be more of an ant case, and that'll help bring us to some of these bigger questions about attention and stigmacy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3255.509,
    "end": 3269.756,
    "text": "Yeah, I was just going to say, this kind of trickles back, I think, to the one of the first slides we were talking about is this kind of stewardship of global collective behavior paper, which was kind of, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.486,
    "end": 3281.264,
    "text": " calling out the fact that there's no ethical or scientific oversight over the large platforms and then saying, this is something like how, you know, how oversight might look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3281.464,
    "end": 3282.907,
    "text": "And actually it's more than oversight, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3287.785,
    "end": 3302.229,
    "text": " This being involved in sort of intervention in platforms, being able to sort of, if you have recommendation services, this could like inform, you know, how to update parameters, the recommendation service based on observed behavior of the network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.369,
    "end": 3311.492,
    "text": "So yeah, beyond oversight, even sort of like this kind of collective decentralized control we were alluding to, I think this is like a more concrete instance of how that might look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.992,
    "end": 3316.193,
    "text": "A very fascinating kind of direction, a modeling direction that people can maybe find interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3317.37,
    "end": 3337.056,
    "text": " And it also really highlights the relevance of a bottom-up agentic perspective, not just because we then can talk about pluralism and diversity of perspectives much more easily, but even the kinds of design interventions and suggestions are going to be different if we think about this from the top-down perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3337.276,
    "end": 3340.859,
    "text": " content depositing or the bottom-up approach.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3340.979,
    "end": 3351.588,
    "text": "Like imagine if we wanted the ants in the colony to be in a different location and we're putting all these articles in one location, we're making so much amazing content promoting this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3352.805,
    "end": 3379.783,
    "text": " idea but of course if the entities are not navigating to it and reinforcing that trail you could spend all the money on advertising and it would just dissipate as soon as that like life support for the trail were gone and so when we take that bottom-up attention-based perspective it really puts us like in the view from the inside from the participant what are they perceiving which is always going to be extremely limited",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3380.791,
    "end": 3383.774,
    "text": " And then what are they updating their beliefs in terms of?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3383.834,
    "end": 3386.577,
    "text": "And then how are they choosing to act given the affordances they have?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3387.098,
    "end": 3396.728,
    "text": "So the bottom-up perspective brings in all these very important discussions around like accessibility in discourse and perspective integration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3397.569,
    "end": 3424.774,
    "text": " and then treats it as like something that might be addressed at the level where it's occurring which is at the entity or the actor level rather than being like well there's 500 petabytes of data and this is how much the system does on this high level those are abstract metrics again with an economic analogy it'd be like macroeconomics and then behavioral and like neuro and microeconomics",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3426.147,
    "end": 3437.246,
    "text": " One can just put piles of product in different locations, but unless there's individuals who are interested in it and prefer it and allocate their attention to it, nothing will occur.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3439.206,
    "end": 3449.733,
    "text": " And maybe another, just to try a concrete example for that could be, Will brought up this dashboard, the Fox News versus BNN.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.773,
    "end": 3458.518,
    "text": "So you might imagine stewards of some futuristic social network or social attention data we're talking about collecting here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3459.198,
    "end": 3464.781,
    "text": "And they might be able to, through these kind of model approaches, figure out, OK, what if we want to optimize this network?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.082,
    "end": 3471.404,
    "text": " for relative coverage and get people to see diverse viewpoints and stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3471.424,
    "end": 3475.605,
    "text": "Which recommendation services we use and how should we tune them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.325,
    "end": 3482.947,
    "text": "And then seeing the effect of that and being able to learn how to collectively steward attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.187,
    "end": 3488.849,
    "text": "Again, this is open source, people can participate in it in directions that are more healthy for society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.35,
    "end": 3506.16,
    "text": " One last thought before going to the next slide is in the VO traces, we saw about how what was being presented or provided or curated wasn't necessarily the granular content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3506.5,
    "end": 3519.59,
    "text": "So not the newsletter that says, here's the five things you want to look at, or here ranked by whatever metric novelty or by importance or popularity, here are the granular atomic pieces of content for you to look at.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3520.35,
    "end": 3531.721,
    "text": " when we can curate and in a consensual way, determine how transitions amongst content are coming into play, that's like the true value.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3532.081,
    "end": 3537.467,
    "text": "Okay, so you're on the Wikipedia page for active inference, or you're on the Wikipedia page for some historical entity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3538.567,
    "end": 3545.889,
    "text": " Maybe that content is just so amazing it stands alone, but the reality is it's part of our epistemic forging, our learning journeys.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3546.349,
    "end": 3558.812,
    "text": "And so being able to connect dots is quite literally understanding, okay, for somebody who is in a given context and language experience, this intro to Python should link to this next resource.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3559.252,
    "end": 3560.433,
    "text": "But then of course there's many links.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3560.473,
    "end": 3564.954,
    "text": "So there's no reason to collapse that pathway to like a hallway.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3566.184,
    "end": 3571.346,
    "text": " it kind of respects the actual dynamics of the information environment in a few interesting ways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3571.906,
    "end": 3575.047,
    "text": "Let's go to the next slide, because it connects some more points, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3576.187,
    "end": 3577.988,
    "text": "The back ones are backwards or forwards?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3578.428,
    "end": 3578.928,
    "text": "The forwards.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3581.709,
    "end": 3582.949,
    "text": "Okay, so in 2021,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3585.396,
    "end": 3604.212,
    "text": " With some colleagues, I worked on an ant colony simulation where the individual nest mates were utilizing an active inference model of perception-cognition action, and those actions were spatial movement in a tea maze, so in a foraging space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3604.933,
    "end": 3610.698,
    "text": "And then one other action that they had the opportunity to do upon finding food was to deposit pheromone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3611.198,
    "end": 3615.179,
    "text": " So no pheromone was being deposited until the food was detected.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3615.619,
    "end": 3621.1,
    "text": "And then upon kind of turning around, a pheromone deposition occurred and it was decaying in the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3622.02,
    "end": 3640.284,
    "text": "Now it's a kind of fun link to look at the place where that core model of epistemic foraging, being foraging in a space and looking for something, seeking for something, having a preference to find something,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3641.334,
    "end": 3648.621,
    "text": " that we used in the ant spatial foraging case for finding the food resource in the tea maze.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3649.321,
    "end": 3656.248,
    "text": "It was adapted from a earlier slash different paper by Axel Constant et al.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3657.169,
    "end": 3662.153,
    "text": "And the paper was acquisition of culturally patterned attention styles under active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3663.274,
    "end": 3691.321,
    "text": " and so the setting is very creative and subtle which is that there's a tic-tac-toe grid so a three by three grid that is representing like the visual scope of someone who's looking at something so they're um staring or they're foveating on the central point and then they have like a limited range of peripheral vision and then outside of that there's much less visual acuity",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3693.351,
    "end": 3696.174,
    "text": " They were involved in an epistemic foraging task.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3696.675,
    "end": 3709.33,
    "text": "So unlike where in reward learning, the decisions of where to move and how to move might be dictated by what is perceived as the most pragmatically rewarding state or paths towards pragmatic reward,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3710.291,
    "end": 3726.327,
    "text": " in this information forging case which has been also explored a lot of other eye movements active inference simulations it's driven by epistemic forging reducing uncertainty about what kind of pattern one is existing in",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3727.108,
    "end": 3737.152,
    "text": " And so it's almost like reading Braille, except it's with our eyes, because we, of course, don't see at the same resolution the whole page at the same time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3737.352,
    "end": 3744.875,
    "text": "In fact, the clarity outside of your main visual region and the clarity even in your blind spot is part of our generative model of vision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3745.355,
    "end": 3751.438,
    "text": "But putting that aside, what the entities are doing in this pottery scanning task",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3752.398,
    "end": 3776.149,
    "text": " is actually scanning locally and using the local patterns that they're seeing with the relationship of like okay is it like a line going across or line going up or is there a diagonal understanding the motifs that they're perceiving to reduce their uncertainty about what kind of pottery they're looking at and this the only tweak",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3776.88,
    "end": 3796.367,
    "text": " main tweak that we had to make to bring it into a spatial foraging context was thinking, okay, instead of the point at the center of the visual gaze, instead of that just being like the XY coordinate of where one is looking at, we're going to make that the body position of the nestmate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3797.208,
    "end": 3805.351,
    "text": "And so visual foraging, you can scan and you can, you can like teleport or move very rapidly, but it doesn't leave a trace.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3806.98,
    "end": 3810.445,
    "text": " You could look over something many times and it's not going to modify the object.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3811.266,
    "end": 3819.797,
    "text": "In the ant case, because it's this embodied spatial foraging, they are only able to move locally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3820.805,
    "end": 3826.393,
    "text": " And they do under all slash some situations physically modify the niche.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3826.473,
    "end": 3838.649,
    "text": "And I think it really closes the loop with what Ronan brought up earlier with like eye gaze and other brain computer interfaces are taking invisible information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3838.889,
    "end": 3866.167,
    "text": " stigmatic markers of attention and making them into visible markers like heat gaze analysis or heat maps of gaze not sure what they call it it is often used like in advertising um where people might present two versions of a page or a product and see where people are looking in terms of the label and other features do we have or use that kind of approach for education",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3867.401,
    "end": 3890.5,
    "text": " do we proactively use it do people field test different layouts of papers so that's an interesting thought and um well yeah I definitely feel like uh the whole I was thinking just like um yeah I feel like a whole new sort of yeah field of epistemic engineering for like there's so many",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3893.914,
    "end": 3916.323,
    "text": " engineering yeah practice they're all at all the different levels there's just like yeah it's like pretty wide blue ocean space for different kind of techniques modeling this is really cool i like how you bridge between sites like the site where we have here like the foliation and the ant movement like it's really interesting like how and each ant is sort of like a sensor of the collective organism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.525,
    "end": 3932.83,
    "text": " um so yeah it almost felt like what we're trying to build and for social networks it's kind of like we're trying to build like a seismograph or something like that like a epistemic seismograph or another kind of visual mixed metaphor",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3941.03,
    "end": 3947.794,
    "text": " If there's a top-down attention determiner, it's like the Eye of Mordor in Lord of the Rings.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3948.214,
    "end": 3954.238,
    "text": "It's like a laser that's leaving a scar where it's scanning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3954.338,
    "end": 3965.504,
    "text": "So it could be modifying the environment or not, but it's like one strong laser versus seeing it as many distributed eyes that are in local feedback loops.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3965.684,
    "end": 3966.165,
    "text": "So they're...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3967.085,
    "end": 3989.277,
    "text": " cognitive burden if we think about the actual biology of it or their computational burden if we think about simulating this system would be lower and more paralyzable and wouldn't require any entity to have access to information that we know it can't have like how do people interact with markets well they don't have the time series data from the last 10 years loaded into memory",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3989.777,
    "end": 4018.795,
    "text": " but the analyst might but the individual is actually on this journey seeing random things from different times and so if we wanted to understand decision making in that setting we would want to be taking or at least complementing the top down with a bottom-up view and so it's the case in economics and it's also the case in our epistemic environments though those are corralled in a way that keeps the discourse",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4020.45,
    "end": 4022.051,
    "text": " on certain areas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4023.913,
    "end": 4026.475,
    "text": "Yeah, I, well, we kind of talked about this a little before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.495,
    "end": 4047.832,
    "text": "I feel like there's another whole rabbit hole to talk about how this kind of, how much we want to bring in this sort of machine-aided decision-making, because we understand that, like, humans, like, on one side, I really, I can see where you're going with, like, the sort of how local agents are making sense of their local environments, and that's sort of creating this global, more global sense-making environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4048.288,
    "end": 4061.885,
    "text": " But then I know, we also know that humans, like when, when we choose, for example, you know, what path on this like social view, we're going to use AI to sort of integrate histories of people that have traversed those paths, you know, here suggest like a few to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.125,
    "end": 4067.112,
    "text": "So I think there's just this delicate balance between maintaining human agency and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4068.484,
    "end": 4085.452,
    "text": " interpretability, that they know what they're doing, they're not just following blindly some instructions from algorithms, versus really needing algorithms to make sense, crunch the data, but doing it in a way that doesn't sort of... I think that I've heard it called algorithms that disintermediate humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4085.872,
    "end": 4090.534,
    "text": "It's kind of like, the human is like a peripheral part of this, and the sense-making is that it's mostly between algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4090.554,
    "end": 4095.457,
    "text": "So yeah, I think there's definitely a delicate block there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.037,
    "end": 4096.197,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.355,
    "end": 4101.043,
    "text": " Let's go to the first active inference slide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4101.564,
    "end": 4104.791,
    "text": "So we have two slides of general questions to raise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4105.372,
    "end": 4105.893,
    "text": "Some of them to...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4108.646,
    "end": 4117.548,
    "text": " bring us out from those more specific examples, some general active inference questions, and then we can close with the open challenges.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4119.029,
    "end": 4124.41,
    "text": "So just the first one was, what is attention in active inference and how is it being used?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4124.93,
    "end": 4130.712,
    "text": "Because there's a technical usage of attention that's common in Bayesian statistics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4131.312,
    "end": 4137.654,
    "text": " Like you could hear about a neural network with an attention module or even a simpler kind of model with attention as a parameter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4138.194,
    "end": 4142.475,
    "text": "And it relates to how much new observations are updating your priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4142.976,
    "end": 4146.897,
    "text": "So if you have no attention on an observation, it's not updating your priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4147.617,
    "end": 4149.438,
    "text": "So that is equivalent to not paying attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4149.478,
    "end": 4151.018,
    "text": "It's like there's things you're not seeing behind you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4151.118,
    "end": 4152.178,
    "text": "You're not paying any attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4152.198,
    "end": 4153.539,
    "text": "They're not being used up to your priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4153.959,
    "end": 4156.98,
    "text": "Whereas if you're super paying attention to something,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4158.231,
    "end": 4176.849,
    "text": " then you're going to be updating your priors to its location or what it's um telling you so where have we seen that kind of motif in active inference and how did it play a role in the albaracin at all paper and how does it play a role in these kinds of simulations um second question is like a very uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4177.409,
    "end": 4183.394,
    "text": " General question that we ask all the time, which is just where and how is active inference being applied?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4183.874,
    "end": 4187.056,
    "text": "Are those conceptual or schematic simulations?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4187.697,
    "end": 4193.962,
    "text": "Or are these real-time data processing systems, which almost inevitably are going to require",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4195.287,
    "end": 4200.548,
    "text": " technical solutions that aren't like just the active inference entity loop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4200.948,
    "end": 4212.57,
    "text": "That's kind of like the kernel, but then there's a technological system that uses the kernel, just like the linear model kernel, like Y equals MX plus B, that is so simple it can be written down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4213.13,
    "end": 4218.711,
    "text": "Yet in practice, there needs to be a lot of architecture and multilinear regressions and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4218.971,
    "end": 4223.392,
    "text": "So this is a different kernel for modeling this kind of an active situation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4224.423,
    "end": 4230.525,
    "text": " And also the systems need to have more than just an insightful kernel to be of any utility, let alone function.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4232.546,
    "end": 4244.73,
    "text": "The third point, we recently had a symposium on active inference and robotics, where we had about nine presenters who shared different work that is involving",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4245.908,
    "end": 4265.033,
    "text": " the realization of robotic systems implementing active inference and to see the kinds of topics that they were bringing to the front, like affective robotics, robots that are dealing with us as affective entities, but also robots that even have computational",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4266.556,
    "end": 4268.477,
    "text": " emulations of affect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4268.997,
    "end": 4282.28,
    "text": "Like what if a robot could have a frustration parameter, but it used that to not go down a road that it wasn't really finding value in, for example, or boredom if the information wasn't good or excitement if it were good.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4282.62,
    "end": 4288.402,
    "text": "So those kinds of affects have a technical and computational usage in active inference models.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4289.142,
    "end": 4292.963,
    "text": "And then I think the last question that brings us to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4294.124,
    "end": 4320.229,
    "text": " the more open questions and a lot of the other threads that our coauthors have been bringing in is like, where is design in this and human centered design, graphical design and the user interface, but taking that as like the tip of the iceberg and how do we bring in proactive,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4321.377,
    "end": 4335.781,
    "text": " thinking around what kinds of systems and experiences that are to be curated, how does that design thinking meld with cognitive science in a positive way?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4338.802,
    "end": 4339.102,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.282,
    "end": 4343.943,
    "text": "Yeah, one thing you mentioned, I think this was in the beginning when we started working on this research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4344.784,
    "end": 4346.304,
    "text": "You asked this question, it kind of stuck with me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4346.324,
    "end": 4349.045,
    "text": "You said something about like, yeah, we have...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.063,
    "end": 4352.945,
    "text": " Like, what are we doing with all the cognitive science theories if we're not using them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4354.106,
    "end": 4361.471,
    "text": "Like, you were saying something to the effect of like, yeah, we're not implementing the theories in practice, like often when we're building products.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4362.211,
    "end": 4367.235,
    "text": "So it seems, yeah, this seems like a really interesting kind of theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.365,
    "end": 4372.689,
    "text": " integrating with practice to build information landscapes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.05,
    "end": 4377.874,
    "text": "I think cognitive science has a lot to say here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.014,
    "end": 4381.258,
    "text": "I'm excited to see how this gets integrated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.098,
    "end": 4385.342,
    "text": "I like how it kind of gets a little meta, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.362,
    "end": 4388.425,
    "text": "I liked what you said earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.445,
    "end": 4390.026,
    "text": "You said epistemic engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.734,
    "end": 4411.98,
    "text": " I'm inclined to reframe it as epistemic design, epistemic environment design, in which agents are using their understanding of active inference to develop systems that allow individuals to interact with the world in a way that's used as active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.4,
    "end": 4414.161,
    "text": "That's what I believe the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.126,
    "end": 4420.127,
    "text": " I've heard it phrased as active open-mindedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.167,
    "end": 4422.407,
    "text": "That's a sort of like self reflection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.467,
    "end": 4440.033,
    "text": "It's this ability to evaluate your own cognitive processes, update your models and your own cognitive processes in ways that allow you to interact with other external information so that you can continue to update your models where they might otherwise become entrenched in overconfidence and confirmation bias and whatnot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.093,
    "end": 4445.915,
    "text": "And this is kind of taking it out of that individualistic paradigm and applying it in a collective paradigm where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.249,
    "end": 4474.146,
    "text": " By designing epistemic ecosystems that allow people to best leverage those innate qualities without even thinking about it, we're kind of reaping the same benefit to some extent that people would gain from deep, somewhat critical, or at least humble and skeptical introspection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.55,
    "end": 4479.696,
    "text": " which is active inference applied to itself in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.898,
    "end": 4486.067,
    "text": "Yeah, maybe it is pretty meta, which I think is really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4487.125,
    "end": 4499.433,
    "text": " Just to maybe try to connect it to some things people might be familiar with, I think Tristan Harris often speaks about the current technology, which is sort of raised to the bottom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.613,
    "end": 4506.357,
    "text": "It sort of thrives on exploiting our different vulnerabilities, cognitive vulnerabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.924,
    "end": 4509.605,
    "text": " in profiting off those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4510.025,
    "end": 4513.167,
    "text": "The externality is that we're degrading human cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4514.068,
    "end": 4534.0,
    "text": "Here, I feel like we're in this trying to be in the space of race to the top, which is another saying that Tristan Harris and I have heard him talk about, where trying to think about technology in a way that's actually making us more open-minded, more attuned to our space and the collective, where we've been",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4534.659,
    "end": 4537.485,
    "text": " collective sense-making and yeah, I think like it's really a great thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4537.505,
    "end": 4541.352,
    "text": "How do we get people, how do we build technology to make people more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4545.876,
    "end": 4567.744,
    "text": " and we have a lot of principles to do it we have to understand those things we have to know what open-mindedness means to be able to sort of build technology that will help bring it about yeah that's the meta maybe a last active comment which will go to our last slide is like well what you mentioned with uh active open-mindedness which is surely a term that preceded active inference but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4568.852,
    "end": 4593.549,
    "text": " it it for sages that active engagement and then the dilemma or tension or dialectic between like what we bring to the table and then what the table is providing to us and so if it were um some other kind of product design we're making a soft drink are we going to barge in with assumptions",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4594.437,
    "end": 4596.098,
    "text": " And then what are the danger modes of that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4596.138,
    "end": 4607.826,
    "text": "But also what is the danger of just what every single person tells you, putting too much attention on the specifics, overfitting to those 20 people and making some kind of like chimera that only appeals to them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4608.247,
    "end": 4616.792,
    "text": "And that would be one thing in the food engineering and food design case, but this is the leverage point on digital communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4617.753,
    "end": 4620.215,
    "text": "And so it becomes even more of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4621.553,
    "end": 4627.575,
    "text": " in immediacy, because this is like the coefficient on how we communicate and share and learn nowadays.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4628.495,
    "end": 4637.038,
    "text": "And also like puts in these higher order questions like we were talking about earlier, which is there's always gonna be an argument for centralization.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4637.058,
    "end": 4650.162,
    "text": "And that's not to say that one extreme is better than another, it's always contextual, but there always is an argument to just do it faster internally, rather than potentially avert a deeper failure mode",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4651.345,
    "end": 4654.23,
    "text": " but there are other challenges arising with decentralized systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4654.751,
    "end": 4659.018,
    "text": "So there's no generalized free lunch",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4660.114,
    "end": 4670.759,
    "text": " but then the question could be like, but could there be information environments and regimes of action and regimes of attention that are consensual and also productive and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4671.239,
    "end": 4687.267,
    "text": "So I agree, it's been an awesome, and to bring in Will with yours and Lauren's experience on design and seeing design as like almost the art and science and practice of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4688.613,
    "end": 4698.68,
    "text": " bringing the counterfactual and the adjacent possible via inference into something that is implemented.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4698.7,
    "end": 4701.301,
    "text": "So I think there's a lot to connect there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4701.321,
    "end": 4708.146,
    "text": "So maybe let's go to our last slide, and then if anybody in the live chat has any thoughts or questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4708.986,
    "end": 4711.748,
    "text": "Otherwise, Ronan, looking forward to hearing these.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4712.589,
    "end": 4712.809,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4715.711,
    "end": 4717.051,
    "text": "Yeah, epistemic design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4723.551,
    "end": 4735.394,
    "text": " But yeah, so we were talking about, you know, some of the sort of trade-offs between, I think, yeah, where we are now and, you know, centralized systems and decentralized systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.534,
    "end": 4737.034,
    "text": "There are a lot of open challenges here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4737.054,
    "end": 4740.335,
    "text": "Some of them we kind of already talked about, so I'll go through them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4740.415,
    "end": 4748.097,
    "text": "But yeah, I just kind of finish on some of these things that we're looking at as we try to make progress with our research proposal and development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4751.141,
    "end": 4760.984,
    "text": " So, yeah, I think, you know, one thing is definitely that we're in sort of what can we do right now to help clean up our information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4761.044,
    "end": 4771.467,
    "text": "Because sometimes given that, you know, many of these tools don't exist yet, and they're sort of, I guess a lot of people would say these are like, it could be a decade-long project to build these kind of interoperable protocols.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4773.428,
    "end": 4775.308,
    "text": "So, yeah, where do we do right now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.388,
    "end": 4777.249,
    "text": "I think, yeah, if anyone has thoughts on that, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4778.76,
    "end": 4779.721,
    "text": " If we've got to raise those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.961,
    "end": 4783.643,
    "text": "I'll run through them all, and if you have thoughts, you can go back to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.823,
    "end": 4790.907,
    "text": "Yeah, I think there's this kind of, you know, we talked about this a few times during the conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4790.927,
    "end": 4794.289,
    "text": "You have this kind of user, which is the local minima convenience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4794.549,
    "end": 4800.832,
    "text": "Users are just like, they're getting used, and they're using software, but it's really like this kind of very convenient local minima, and we get stuck in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.273,
    "end": 4804.014,
    "text": "How do we transition towards a more active, sensitive role?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4804.515,
    "end": 4807.116,
    "text": "There's a lot of sort of culture and norms and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4807.836,
    "end": 4831.638,
    "text": " social aspects here that we can definitely also dive deeper into but yeah probably have future conversations like that and yeah there's also the protocol problem which we're mindful of where this is I think best expressed by this xkcd comic you know you have some kind of situation where you want to introduce the new standard but they're already standard then you kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4832.059,
    "end": 4837.52,
    "text": " try to generalize everyone else's protocols, and now they're like 50 protocols, and you're stuck in the same situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.54,
    "end": 4840.841,
    "text": "Yeah, this is a problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4841.201,
    "end": 4843.221,
    "text": "I don't know any really great results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.321,
    "end": 4850.443,
    "text": "I mean, I'm not aware of so many success stories here, so it is clear we have a challenge facing us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4850.783,
    "end": 4859.325,
    "text": "But on the other hand, Web3 seems to be all about tackling this protocol problem, so we feel like we're in good company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.871,
    "end": 4867.533,
    "text": " Will, you want to add something?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4869.413,
    "end": 4873.975,
    "text": "Yeah, one of the things... I love the second one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.435,
    "end": 4876.196,
    "text": "And I think one of the things that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.193,
    "end": 4893.238,
    "text": " resonates with me is I think it speaks to one of the original explicit goals of Veo which is like obviously this is a huge problem and one of the things that we were trying to do in designing that interface is to make it as convenient as possible to be an active sense maker and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.639,
    "end": 4898.52,
    "text": " Largely, this is driven by my own research process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.6,
    "end": 4900.28,
    "text": "I have ADHD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.34,
    "end": 4904.041,
    "text": "I have a very hard time getting through research papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.741,
    "end": 4923.086,
    "text": "We were trying to find a way to make going through this process that seems really overwhelming to some people, including myself, a lot more convenient and a lot more simple and taking a lot of the labor burden off so that the person's mind is free to think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.63,
    "end": 4941.814,
    "text": " and record and doesn't have to actually manage like really what is a fairly sophisticated process for people who, I mean, both of you are, you know, seasoned academics, you, you know, that it's not a trivial skill to be able to go through loads of information and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.581,
    "end": 4946.804,
    "text": " extract what's meaningful and figure out where you need to delve into new arenas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.445,
    "end": 4964.138,
    "text": "And if you can make that process that requires a lot of discipline and planning and structures and whatnot, if you can make that very convenient, then all of a sudden you can just think about the thing, think about the information and the ideas that are in the information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.556,
    "end": 4969.946,
    "text": " Of course, we don't have that tool yet, so what can we do right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4974.111,
    "end": 4998.952,
    "text": " nice thanks will just a few other um comments uh the interoperability we brought up earlier um the content is often highly interoperable today like whether you can download it directly or right click save or use obs to screen cap pretty much any content can be delivered on another platform you can share text or an image you found on one location to another so in many ways you",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4999.793,
    "end": 5007.999,
    "text": " Amidst the platforms, jumping from platform to platform, we have interoperable content because we have like file types for content, JPEG.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5009.56,
    "end": 5023.289,
    "text": "And Ronan, you highlighted the interoperability of these attention markers, the ones that we have today, the likes and so on, but then the ones that we could have tomorrow with all these other kinds of interfaces.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5023.949,
    "end": 5029.233,
    "text": "And then I wondered, well, where are we at with financial interoperability?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5030.013,
    "end": 5044.566,
    "text": " is there a way for even this one special kind of data, like a ledger or some kind of bookkeeping, what are the interoperability mechanisms that exist for financial data?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5044.586,
    "end": 5048.91,
    "text": "And then would the knowledge case be easier or harder?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5050.691,
    "end": 5052.293,
    "text": "And then what happened, this 14 and then going to 15 is,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5055.874,
    "end": 5061.516,
    "text": " So how does the financial information stay coherent with markets?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5062.276,
    "end": 5080.944,
    "text": "There isn't an interoperability layer necessarily directly between two currencies, but then there are different kinds of intermediators who can be clear or obscure with why they're providing some kind of exchange.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5081.004,
    "end": 5083.625,
    "text": "And so I think that points to like information exchanges",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5084.69,
    "end": 5107.925,
    "text": " before some kind of sweeping knowledge generalization synthesis, like a future knowledge protocol, there would be many options for just like the APIs and the kind of web scraping and reparsing techniques exist today to act as markets that help swap different information",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5109.068,
    "end": 5136.325,
    "text": " um and then one other point to make was we talked also about like what is opaque and what is transparent and in some earlier uh active streams actually on like consciousness and attention and awareness we had an interesting discussion around transparency and opaque a transparent thing is something that you can't see you see through it because you can't see it something that's opaque",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5137.25,
    "end": 5139.832,
    "text": " You do see because you can't see through it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5141.354,
    "end": 5151.863,
    "text": "So what aspects of the system should be transparent, which isn't to say we could investigate the source code because that would actually be opacity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5152.503,
    "end": 5156.527,
    "text": "And one could say, well, it's fully documented, totally comprehensive opacity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5156.667,
    "end": 5157.187,
    "text": "Well, that's great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5158.048,
    "end": 5161.952,
    "text": "But what are the parts of the system that are transparent, like the water we swim in,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5163.206,
    "end": 5165.227,
    "text": " that would be not visible?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5166.248,
    "end": 5173.492,
    "text": "And then what are the parts of the system where people would see them and know them and those would be opaque?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5175.473,
    "end": 5180.777,
    "text": "Yeah, that's an awesome, that's a kind of mind blowing thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.557,
    "end": 5184.079,
    "text": "Yeah, that kind of brings to mind, you know, world distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5185.251,
    "end": 5197.021,
    "text": " on making, like convenience isn't always, I was treating it here as sort of something that's kind of cursed, but he was saying that it can also be a doom or benefit if the right thing is made convenient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.041,
    "end": 5212.574,
    "text": "And it kind of seems like what you're saying also is we need to make the right things, like, just like, you know, an interface, like a cell phone, you know, the right things are opaque and the right things are transparent, where the importance is for controlling it, the relevant importance for controlling it are the ones that you see, the ones that you don't need to see, you don't see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5212.634,
    "end": 5212.794,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5213.55,
    "end": 5215.13,
    "text": " Yeah, probably something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5215.15,
    "end": 5227.173,
    "text": "It seems like, again, this epistemic design, how to make information landscapes that show you the right levers and obscure the things you don't need to see so you can not get overwhelmed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5227.854,
    "end": 5233.815,
    "text": "And probably being able to, and then kind of openness, the open source quality of it means that different people will want different levers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5233.835,
    "end": 5238.996,
    "text": "So some people really want to play with the nuts and bolts, and other people just want to have simple interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5239.076,
    "end": 5240.757,
    "text": "But allowing all that span of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5242.611,
    "end": 5248.395,
    "text": " of interfaces, I think it's part of the, yeah, you touched on this kind of plurality aspect you were talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5248.455,
    "end": 5253.258,
    "text": "I think it's really important that different people will see different interfaces based on what's best for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5256.44,
    "end": 5264.866,
    "text": "That's one of the biggest advantages of having this interoperability is now we have an opportunity to take what is ultimately the same data set and make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5268.502,
    "end": 5281.17,
    "text": " interfaces make end user applications that are tailored to particular needs or people or use cases or accessibility needs and whatnot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5281.911,
    "end": 5297.121,
    "text": "So that really niche groups of people can interact on this broad scale in a way that specifically suits them that can't be accommodated with a platform or with like kind of a one size fits all approach to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5298.775,
    "end": 5303.698,
    "text": " manipulating with, engaging with, interacting with this data, this information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.659,
    "end": 5306.82,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5308.2,
    "end": 5319.587,
    "text": "One quick comment on the accessibility, because I think it really distinguishes the semi-tectonic, the building-like stigmergy from the attention-like stigmergy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5320.087,
    "end": 5327.031,
    "text": "So content accessibility is the prerequisite for there to be the trail.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5328.223,
    "end": 5347.773,
    "text": " Content accessibility could include screen reader affordances, changing the font size, changing the colors, making sure that, just like the open science movement has been highlighting, that the content quite literally is accessible in any form, let alone one that accounts for sensory differences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5347.873,
    "end": 5352.015,
    "text": "But just making the content available has to be a first step.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5353.015,
    "end": 5357.599,
    "text": " And then what does attention accessibility look like?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5358.239,
    "end": 5364.604,
    "text": "So like if previously it was like, we need that PDF accessible, not behind a paywall.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5365.225,
    "end": 5376.434,
    "text": "Okay, content accessibility with preprint servers to a large extent in the scientific domain, just speaking narrowly, like that content is accessible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5377.355,
    "end": 5382.479,
    "text": "And then what are all the trails that go from this one preprint",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5383.646,
    "end": 5398.812,
    "text": " website and PDF and the way that these 700 people had these thoughts and these 300 people had these thoughts, that's that transition amongst different content and giving visibility",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5400.171,
    "end": 5418.246,
    "text": " to that content because that content is being recorded and it is being used to shape attention but through this covert platform-owned loop rather than us being able to be like, I want to publicly add this comment on the paper",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5419.247,
    "end": 5423.651,
    "text": " And then this is just, I want this to be only in my private information or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5424.752,
    "end": 5429.937,
    "text": "But I think that really highlights that accessibility isn't just the font size genre.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5430.738,
    "end": 5438.425,
    "text": "There's another connecting the dots kind of accessibility that doesn't exist even on the radar.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5439.434,
    "end": 5444.096,
    "text": " because it feels like, well, what do you need to understand the scientific paper beyond having access to the PDF?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5444.136,
    "end": 5445.777,
    "text": "It's like, you need everything.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5446.777,
    "end": 5449.898,
    "text": "And now that can be a clearer conversation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5451.039,
    "end": 5452.399,
    "text": "Yeah, I love that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5452.74,
    "end": 5455.021,
    "text": "Accessibility is broader than just the content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5455.041,
    "end": 5458.142,
    "text": "It's accessibility to the reactions of people to the content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5459.943,
    "end": 5460.103,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5461.103,
    "end": 5467.826,
    "text": "Well, any other thoughts or directions or information you want to share, feel free to go for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5471.772,
    "end": 5472.352,
    "text": " Yeah, this was great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5472.452,
    "end": 5476.174,
    "text": "I mean, it's fun to dive into all these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5477.835,
    "end": 5479.275,
    "text": "Yeah, so many quick questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5479.776,
    "end": 5486.959,
    "text": "And just again, to reiterate, it'll take a lot of minds to think about these things and work on these things, a lot of different types of minds, builders, and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5486.999,
    "end": 5491.361,
    "text": "So yeah, if you're interested by any of this, then we're really welcoming collaborators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5493.201,
    "end": 5493.502,
    "text": "Awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5493.782,
    "end": 5494.922,
    "text": "Yeah, we can have like a 26.2.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5497.059,
    "end": 5503.443,
    "text": " We can always continue the series and like version and update and include others in the conversation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5503.503,
    "end": 5507.206,
    "text": "So great presentation and thanks both for joining.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5508.687,
    "end": 5509.207,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5509.227,
    "end": 5512.169,
    "text": "Yeah, thanks so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5514.17,
    "end": 5514.47,
    "text": "Goodbye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5516.132,
    "end": 5516.292,
    "text": "See you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5529.218,
    "end": 5529.679,
    "text": " It is fun.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5530.66,
    "end": 5531.561,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5538.229,
    "end": 5540.271,
    "text": "There's a few things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5540.371,
    "end": 5545.798,
    "text": "One is to just share it and ask people, but it's an hour and a half long.",
    "speaker": "SPEAKER_05"
  }
]