[
  {
    "start": 3.102,
    "end": 28.165,
    "text": " all right welcome back cohort five we're in our second discussion on chapter seven so is there anything anybody wants to begin with we can look at the text we can look at any question we can add a new question we could look at pi mdp anything um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 30.76,
    "end": 33.765,
    "text": " Anyone can write in the chat or raise their hand or just go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.371,
    "end": 51.015,
    "text": "Yeah, so I have a sort of more more open ended question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.055,
    "end": 52.718,
    "text": "I've been sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.267,
    "end": 57.714,
    "text": " thinking about doing a little modeling project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.094,
    "end": 71.28,
    "text": "And what I'm thinking about is that I'm just wondering how I can use this active inference machinery to model some kind of recognition task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.26,
    "end": 78.47,
    "text": " How would you approach doing something like an MNIST classification with active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.971,
    "end": 95.614,
    "text": "But what I am interested in is bringing this one key difference from the active inference-like approach to the problem that's basically completely solved using artificial neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.594,
    "end": 105.09,
    "text": " But in a way that, you know, if you feed MNIST to like a transformer-based classifier, you patchify it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.13,
    "end": 113.805,
    "text": "So it turned into small little chunks of image and you feed that into a transformer and the transformer kind of like sees the whole sequence and then finally learns how to classify an image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.785,
    "end": 132.181,
    "text": " I'm just sort of wondering, thinking about how to find some sort of connection between doing something like that, except getting the neural network or some other kind of system to choose where to look, to sort of model the behavior to be almost like a saccade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.241,
    "end": 142.83,
    "text": "I'm seeing a part of an image, and then I have to make a decision where to look next to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.81,
    "end": 147.136,
    "text": " resolve as much uncertainty as I can about what am I seeing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.656,
    "end": 149.158,
    "text": "And it doesn't have to be something like an MNIST.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.218,
    "end": 157.248,
    "text": "It could be like some really, really simple images to start with, you know, like 8x8 pixels, some generated, I don't know, knots and crosses or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.849,
    "end": 159.992,
    "text": "But I don't really even know where to start with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 160.893,
    "end": 162.876,
    "text": "It's a very open-ended, big, big thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.896,
    "end": 167.181,
    "text": "But if you have any suggestions where to look, I would love some pointers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.161,
    "end": 186.908,
    "text": " yeah great great questions well certainly what I'll show now is not the end of the story but I think it'll provide some motifs that you can pick up on here's a 2021 paper with Axel constant so in this setting it was an eye Cicade visual",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 187.63,
    "end": 198.642,
    "text": " And one of their novelties was that they made a bounding box that was kind of like the zone that was visible in the Cicade.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.263,
    "end": 203.027,
    "text": "So the cross focus is the center of vision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.688,
    "end": 207.832,
    "text": "And then the affordance of the I Cicade is to move to another cross.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.852,
    "end": 210.755,
    "text": "And then that would move the bounding box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 210.775,
    "end": 216.962,
    "text": "And it's a cultural pattern recognition task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 217.685,
    "end": 227.273,
    "text": " like based upon identifying these higher order patterns of pottery.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.422,
    "end": 230.045,
    "text": " So that's one visual way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.106,
    "end": 243.323,
    "text": "I think this is a super fascinating thing because in almost all visual recognition tasks, either the whole image is passed through if it's sufficiently small, like MNIST, or it's tokenized or chunked or however.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 244.965,
    "end": 253.537,
    "text": "But here we bring the action into vision with actual guided cognitive vision moving to uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.597,
    "end": 255.319,
    "text": "So that might be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.463,
    "end": 285.863,
    "text": " way more efficient in certain settings um for example recognizing a person like first there's like the movement just empirically like there's like movement to the body and then there's a movement to the face and then identifiable parts of the face that's the saccade model and then on the MNIST the recent uh structure learning paper actually specifically they do MNIST um and they um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 288.762,
    "end": 293.767,
    "text": " So the labeled data in MNIST are the true identity of the digit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.568,
    "end": 309.164,
    "text": "And then they use their structure learning technique to develop the styles, handwriting styles of the digit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 310.305,
    "end": 317.773,
    "text": "So they're not doing structure learning on how many digits there are as far as my reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 317.973,
    "end": 320.476,
    "text": " but they do look at different styles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 322.078,
    "end": 326.243,
    "text": "Like these are different styles of the digits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.825,
    "end": 332.65,
    "text": "So then it is learning, it's doing, it's saying how many styles of one are there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 334.432,
    "end": 347.828,
    "text": "And then it's finding through structure learning, which is the proposal of a additional latent factor, and then Bayesian model reduction, pruning the model back down for redundancy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 349.192,
    "end": 352.757,
    "text": " they find strong performance on the MNIST.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.1,
    "end": 357.283,
    "text": "The code is in MATLAB, and I've looked into it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 360.286,
    "end": 366.134,
    "text": "With some language models, you might be able to bring it into something out of MATLAB or just isolate it into pseudocode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.296,
    "end": 379.131,
    "text": "But the MATLAB code itself, it's a little bit of a... It integrates a lot with the broader SPM package.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.229,
    "end": 383.494,
    "text": " So it's not just like you can just pop out the MATLAB script and run it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.455,
    "end": 393.705,
    "text": "Because if you follow the rabbit's trail, it goes into a few other SPM scripts that I don't think have been brought over into PyMDP yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 395.027,
    "end": 400.073,
    "text": "But from a pseudocode perspective, it's very informative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 400.093,
    "end": 400.333,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.353,
    "end": 401.274,
    "text": "That looks super relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.255,
    "end": 402.595,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.636,
    "end": 404.237,
    "text": "Yeah, but this one does not have CICADE.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.878,
    "end": 407.481,
    "text": "This one, the MNIST digit is coming in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 408.963,
    "end": 427.292,
    "text": " One interesting thing also on the cultural one, this generative model was actually, this is before PyMDP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 428.251,
    "end": 432.635,
    "text": " this generative model is the one that we utilized for active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 433.436,
    "end": 443.645,
    "text": "We just said, well, what if instead of it was an eye saccade in a bounding box without leaving a trace, what if it was an estimate moving in a zone leaving a trace?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 445.547,
    "end": 457.718,
    "text": "So that kind of opened up the like observing from afar, moving your eyes, but not leaving a trace versus skin in the game where the movement from here to here is interpreted as a physical movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.317,
    "end": 463.537,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.557,
    "end": 463.978,
    "text": "Great stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.998,
    "end": 464.318,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.864,
    "end": 480.319,
    "text": "This, this paper all, I mean, has other benchmarks like the, the recognition, um, Sprites dataset, maybe even a third one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 483.043,
    "end": 487.148,
    "text": "Towers of Hanoi, classic TI 83 game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 494.958,
    "end": 500.812,
    "text": " with some very interesting shapes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 505.944,
    "end": 506.225,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 509.553,
    "end": 512.46,
    "text": "Any other thought or part on seven?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.27,
    "end": 552.808,
    "text": " why mdp right now is only in discrete time so pretty much everything that you encounter in time dp today will be in the chapter seven spirit um sanjeev's python work as well as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 553.447,
    "end": 557.853,
    "text": " Rx and for Julia have continuous time models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.955,
    "end": 568.306,
    "text": "Okay, can we go through the matrices other than a to D so you're talking about in here because or in which figure to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 569.468,
    "end": 571.611,
    "text": "Maybe yeah this this seems good sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 572.812,
    "end": 574.695,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 574.715,
    "end": 574.915,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 582.758,
    "end": 587.647,
    "text": " Okay, so here's the progression of how they introduced the matrices in 7.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 587.667,
    "end": 593.017,
    "text": "O is the observation vector at each time point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 593.418,
    "end": 596.824,
    "text": "So if you just had one binary sensor, O would be a 0 or 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 597.245,
    "end": 601.813,
    "text": "If you had eight float sensors, it would be eight float numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.249,
    "end": 608.403,
    "text": " S is a vector carried through time, each time point, of the latent states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 608.904,
    "end": 618.807,
    "text": "So let's say we're talking about temperature in the room, thermometer, observations, latent temperature, hidden state S, agent's estimate of hidden state S.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.787,
    "end": 645.587,
    "text": " a is a matrix that has um rows and columns corresponding to o and s a is a mapping between o and s and so it can be used to start with s and then emit a distribution of expected observations or it could be taking in an observation conditioning upon an observation like base theorem does and then updating um a hidden state belief",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 646.546,
    "end": 652.056,
    "text": " D has the same dimensionality as S being carried through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.517,
    "end": 654.08,
    "text": "So D is just like a vector.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 654.14,
    "end": 655.904,
    "text": "It's kind of like T zero.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.964,
    "end": 663.137,
    "text": "It just starts the chain going and it gives you S at the first time point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 663.218,
    "end": 680.896,
    "text": " And then B is a transition matrix that has edges and rows and columns, edges, of the dimensionality of S. Because it maps S at t minus 1 to S at t. So this is a standard hidden Markov model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.596,
    "end": 684.9,
    "text": "Ambiguity matrix A between hidden states and observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 685.4,
    "end": 690.065,
    "text": "Transition matrix B between states at times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.086,
    "end": 693.208,
    "text": "There's no action in this model yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 694.167,
    "end": 701.355,
    "text": " Um, the next thing that they do is they take that exact downstairs model E coming down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 702.736,
    "end": 715.149,
    "text": "And then this is where the action answers the picture, which is PI, which is, uh, the policy space expressed as a probability distribution over actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 715.85,
    "end": 717.571,
    "text": "So PI sums up to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 717.632,
    "end": 721.896,
    "text": "It could be sampled from, or it could be just pick the highest number.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.078,
    "end": 728.447,
    "text": " Or it could be pick the second highest or all these different things that you can do regarding how to pick a policy from pi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.068,
    "end": 748.356,
    "text": "But pi intervenes with a policy in B. And so while previously B was just a single matrix going from S of T minus 1 to S of T, now B is going to be having a matrix slice for every single affordance that we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 748.707,
    "end": 757.841,
    "text": " So each slice of B is like an index card that describes the world transition model conditioned upon action selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.544,
    "end": 773.145,
    "text": "G is expected free energy, and G is a distribution that essentially updates the policy prior habit with respect to epistemic and pragmatic value equation 2.6.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 774.087,
    "end": 780.935,
    "text": " So that gets us to this kind of figure 4.3 or figure 7.3 discrete time classic model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 780.955,
    "end": 798.677,
    "text": "We have a downstairs hidden Markov model with no action, and then actions select which B matrix is gonna be applied as S unrolls through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.277,
    "end": 803.082,
    "text": "And then in figure 7.10,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 803.703,
    "end": 808.771,
    "text": " we see a lowercase letter above each of these other letters that we have talked about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 810.053,
    "end": 819.948,
    "text": "That represents a hyperprior or however you want to think about it, but it's a distribution which that uppercase variable is drawn from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 820.969,
    "end": 827.439,
    "text": "So instead of just saying, well, there's four states in the world, so our D vector could be 0.25, 0.25, 0.25, 0.25.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.479,
    "end": 831.786,
    "text": "That'd be like a uniform prior across initial location.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.867,
    "end": 837.595,
    "text": " Or it could be 1, 0, 0, 0, just unambiguously starting in the first distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.396,
    "end": 851.655,
    "text": "Or you could parameterize little d, which would be a distribution which big D is sampled from, for example, across individuals or across nest mates or across trials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 852.697,
    "end": 856.322,
    "text": "So then learning could happen on little d.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 857.062,
    "end": 858.004,
    "text": " across trials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.485,
    "end": 861.791,
    "text": "So you could begin with like a uniform prior of where I begin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 861.812,
    "end": 877.062,
    "text": "And then with learning by counting, you can just say, okay, I'm going to, with the conjugate prior, the Dirichlet distribution, I'm going to add one count to little d every time I observe myself starting at a certain location.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.244,
    "end": 888.239,
    "text": " And then trial after trial, you'll end up drawing big D from a prior distribution that does resemble the experienced history.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 889.22,
    "end": 890.502,
    "text": "That's the learning by counting part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.724,
    "end": 902.138,
    "text": "And then the end of the chapter, they just kind of present one more motif, which is now that exact 7.3 or figure 4.3 exact motif.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.658,
    "end": 929.627,
    "text": " just demonstrating a little bit of the composability of the base graph by showing that like the observation being emitted from a top level model here level two that observation could be understood as for example a prior on a lower level model but figure 4.3 or figure 7.3 is kind of where in the discrete time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 930.417,
    "end": 943.512,
    "text": " we get the downstairs sense-making from observations, transition world model, and then finally to the action-dependent world transition model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 947.397,
    "end": 948.078,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 948.238,
    "end": 952.543,
    "text": "I think it's a very good overview, and I'll refer it back again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 952.642,
    "end": 954.724,
    "text": " I just have one question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 954.844,
    "end": 958.247,
    "text": "When you use the word motif all the time, what does it exactly mean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 958.327,
    "end": 960.149,
    "text": "I just don't understand that word, actually.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 960.169,
    "end": 960.529,
    "text": "Sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 961.61,
    "end": 962.591,
    "text": "Motif?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 962.891,
    "end": 964.212,
    "text": "What do you mean by motif?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 964.232,
    "end": 964.612,
    "text": "Sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 965.413,
    "end": 971.018,
    "text": "I use it like a pattern, like a pattern language, or like an identifiable theme.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.839,
    "end": 976.583,
    "text": "So let's just say we were looking at cars as generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 976.723,
    "end": 977.764,
    "text": "One of them is red.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.104,
    "end": 979.826,
    "text": "Another one has a convertible top.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 980.366,
    "end": 982.328,
    "text": "Another one has six wheels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 982.51,
    "end": 1010.053,
    "text": " another one has a trailer like those are just kind of like motifs some motifs might be mutually incompatible but other motifs it might just be like well like um here we're looking at the motif of having a hyper prior here we're looking at the motif of nesting now the lower the lowercase letters are not shown but of course you could have lowercase letters",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1010.86,
    "end": 1039.112,
    "text": " so there's nothing contradictory about those two motifs it just and this is definitely not like the only or formal way to think about it it just like here in figure 7.3 we kind of have like the kernel nucleus um there isn't much you could remove here if you wanted to remove something you could remove like this part so it was just focused on the transition of two time steps",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1040.51,
    "end": 1070.365,
    "text": " but that's very minor um this kind of shows the basic initialization and then the step from the previous moment and then the step to the next moment of action as reweighted by expected free energy so here we have kind of an essential kernel and then there's all these motifs or there's other ways probably to say it but there's all these other strategies that we could start to see or use",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.158,
    "end": 1075.14,
    "text": " All right, thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1078.304,
    "end": 1096.993,
    "text": "And yeah, I mean, I don't know how far the Linux kernel metaphor will go, but like this model doesn't have just as written various of the more sophisticated cognitive phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.087,
    "end": 1106.718,
    "text": " So it's not that advanced cognitive phenomena or higher order human type thinking is already in this image.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.22,
    "end": 1117.232,
    "text": "It's like, this is the canvas that is a starting point for like learning and novelty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.633,
    "end": 1127.605,
    "text": "So it's not that all these different diverse cognitive phenomena are like intrinsically, essentially within the active inference formalism percept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1128.58,
    "end": 1153.727,
    "text": " it's that we have something that's general and modular enough to accept and even entertain multiple different renditions of a given phenomena like there's not just learning a narrow definition of learning would be like each parameter being updated and then if somebody wanted to engage with a higher order like kind of conversationally what we might talk of as learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1154.787,
    "end": 1179.732,
    "text": " like chapter six is there for us we could go through it and we would find like a room of 10 people could come up with a thousand ways to implement learning at a higher level in active inference hence a lot of emphasis on like what's the core and then what are some of those like decorators and modifications augmentations and so on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1182.091,
    "end": 1204.065,
    "text": " because chapter six plus the core essence plus the confidence to play with motifs gets very far um would people be up for maybe a little if we take a look at figure 7.10",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.564,
    "end": 1214.212,
    "text": " Adrian Holovaty, What people may be up for trying to walk through it perhaps like and I don't know if this is applicable it's a long way from the teammates but.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.993,
    "end": 1225.522,
    "text": "Adrian Holovaty, Like walking through it like with like a real life kind of decision idea like what i'm thinking is and try to map that process on to the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.542,
    "end": 1234.17,
    "text": "Adrian Holovaty, So, like what I was thinking is like i'm sitting in my room and i'm looking outside of my window and i'm trying to decide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.197,
    "end": 1236.84,
    "text": " whether I'm gonna go outside or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.861,
    "end": 1240.966,
    "text": "And looking at, okay, what are the parameters of that decision?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.046,
    "end": 1252.765,
    "text": "What are the different observable states or hidden states that are gonna influence that policy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.748,
    "end": 1258.555,
    "text": "You think that's an appropriate exercise, Daniel, or something along those lines?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.915,
    "end": 1260.057,
    "text": "Would people be into that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.167,
    "end": 1262.709,
    "text": " I mean, it definitely is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1262.87,
    "end": 1266.455,
    "text": "I'm just finding a table that I'll copy in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1268.618,
    "end": 1271.342,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1271.362,
    "end": 1273.105,
    "text": "I'll make this under chapter seven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.242,
    "end": 1287.165,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1287.185,
    "end": 1289.689,
    "text": "This is just one little template.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1292.622,
    "end": 1321.785,
    "text": " so here we have the a b c d e and pi and o and s so we um have we don't have the the lowercase letters yet but we could add them and um each of those discrete time variables is linked up to an ontology term most of which are all of which have been used um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1322.17,
    "end": 1349.781,
    "text": " and then here is an example like for an ant colony nestmate how those got mapped um but i mean let's hide these and then let's just go for it okay what's the setting what is the agents",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1350.959,
    "end": 1353.362,
    "text": " Living room in New Mexico.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.382,
    "end": 1356.906,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.926,
    "end": 1359.569,
    "text": "If that makes sense, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.589,
    "end": 1360.05,
    "text": "Aren't we all?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.53,
    "end": 1361.432,
    "text": "Okay, observing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1363.794,
    "end": 1364.235,
    "text": "The window.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.295,
    "end": 1366.658,
    "text": "Outside through the window.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1366.698,
    "end": 1370.903,
    "text": "So I guess outdoors through the window.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.123,
    "end": 1372.685,
    "text": "Okay, pixels coming from outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.046,
    "end": 1375.609,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1375.629,
    "end": 1378.452,
    "text": "And then what's truly out there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1381.368,
    "end": 1402.515,
    "text": " could be is it raining or not yeah the weather I guess you know is it is it that's the decision I'm trying to make yeah okay well and and this just goes to show like first off how open it is like what actions are but um I mean we'll get there but can we control the rain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.71,
    "end": 1414.665,
    "text": " So then there's already such differences between a model where there's a hidden state that you can't control, but you still could make a policy decision to take an umbrella or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1415.867,
    "end": 1429.465,
    "text": "But then there would be another level of interactivity of a model when the policy can also control the hidden state, like an air conditioner with a temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1429.732,
    "end": 1430.473,
    "text": " Bruce Sutherland, Ph.D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.453,
    "end": 1437.505,
    "text": ": versus just sort of like a put on a jacket if it's raining okay so now, given that we already said s&o.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1437.805,
    "end": 1438.286,
    "text": "Bruce Sutherland, Ph.D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1438.266,
    "end": 1444.737,
    "text": ": What is the dimensionality of a and what is the semantics of a.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1462.672,
    "end": 1472.769,
    "text": " Let's just say, just to be clear, that the visual stimuli that we're getting is 10 pixels, and then they have a continuous level of brightness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.831,
    "end": 1477.397,
    "text": "Like we could go into the RGB and all this other stuff, but there's 10 pixels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.419,
    "end": 1480.202,
    "text": "And then raining or not is a binary state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1480.963,
    "end": 1486.553,
    "text": "So what is the dimensionality of A, or what does A map?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1491.595,
    "end": 1496.059,
    "text": " I mean, the site of raindrops or not, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.079,
    "end": 1512.615,
    "text": "So it's like... Yes, it maps, but... So that's a two-dimensional, yeah?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.635,
    "end": 1514.477,
    "text": "Maps between the observations in the hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1515.238,
    "end": 1520.122,
    "text": "So its shape is 2 by 10 matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1520.142,
    "end": 1520.843,
    "text": "Okay, I see, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.518,
    "end": 1546.003,
    "text": " there there's other we're just going with just the first sketch pass okay so this is mapping these pixels from the pixels down to beliefs about the rain or vice versa so if we said condition upon i know it's raining we could emit a profile of pixels that's the likeliest thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1546.844,
    "end": 1557.8,
    "text": " Or we could take in an empirical pixel distribution and then ask what is our conditional probability of it being raining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.82,
    "end": 1563.268,
    "text": "So that was, this is then last piece of the downstairs sensemaking part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.368,
    "end": 1565.05,
    "text": "What is the B matrix shape?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1570.058,
    "end": 1571.62,
    "text": "Given it's a transition matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1577.692,
    "end": 1601.404,
    "text": " should be two by two i guess yes these are just the transition probabilities of staying raining staying not raining or switching the the on the identity matrix the diagonal on b is like stay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1602.093,
    "end": 1605.74,
    "text": " Because you're mapping for, let's just say that the first row is raining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.78,
    "end": 1606.662,
    "text": "The second one is not raining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1607.303,
    "end": 1610.349,
    "text": "The upper left corner on B is rain to rain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1610.649,
    "end": 1614.116,
    "text": "And then the lower right corner on B is not rain to not rain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1614.677,
    "end": 1616.54,
    "text": "And then the off diagonals are switching.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.581,
    "end": 1618.524,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1619.747,
    "end": 1621.57,
    "text": "This is the downstairs map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.765,
    "end": 1625.167,
    "text": " This is a partially observable Markov decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1625.588,
    "end": 1628.111,
    "text": "Sorry, this is just a partially observable Markov model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1628.591,
    "end": 1630.053,
    "text": "No decision has come yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1630.713,
    "end": 1630.833,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1631.294,
    "end": 1632.875,
    "text": "Now we're going to come into the decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1632.936,
    "end": 1635.358,
    "text": "Okay, so what is the action space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1639.162,
    "end": 1639.983,
    "text": "Go outside or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1641.925,
    "end": 1642.225,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1642.886,
    "end": 1647.411,
    "text": "Now if we go outside, then we're going to get different observations, but we'll just say yes, go outside or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1649.132,
    "end": 1649.413,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1651.235,
    "end": 1651.675,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.313,
    "end": 1681.999,
    "text": " what is what are the affordances basically not raining it's an affordance for us to go outside yeah um almost here the affordances are the same as the policy space because there's no planning okay so affordances are what you can do in a moment like up down left right and then the policy space is the affordance space exponentiated to the time Horizon of planning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1682.587,
    "end": 1687.812,
    "text": " So if it's a non-planning model, then affordances equals the policy space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1688.633,
    "end": 1696.181,
    "text": "But if it was a two-step model, then you could plan, I'm going to not go outside and then I'm going to go outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1696.861,
    "end": 1699.184,
    "text": "Or I'm like, I'm going to go outside and then I'm going to come back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.285,
    "end": 1702.687,
    "text": "So then that is considering over multiple time steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.828,
    "end": 1708.273,
    "text": "But here, single time step, no blame.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.738,
    "end": 1714.844,
    "text": " Okay, we need D as part of our downstairs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1715.264,
    "end": 1719.69,
    "text": "D is prior on it raining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.871,
    "end": 1734.767,
    "text": "And so this is just, this has the same shape as S. So this basically is just gonna, this could be like one, zero, which is like, we start, sure, it is raining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1735.945,
    "end": 1760.367,
    "text": " or it could be 0.5 0.5 we start unsure if it's raining okay and then um actions are selected different ways obviously that's what we're interested in so what are some different ways you could select actions well you could just draw from your habit distribution that's one approach in um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1764.278,
    "end": 1764.598,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1764.618,
    "end": 1772.328,
    "text": "Now we're going into the, the, the New Mexico dopamine brain on the left side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.368,
    "end": 1778.295,
    "text": "This is where we have actions being drawn from the habit distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1779.536,
    "end": 1784.122,
    "text": "So that's a totally, totally, um, viable decision-making strategy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1784.182,
    "end": 1788.607,
    "text": "That's kind of like thinking fast, like type one is drawing from habit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1789.949,
    "end": 1790.269,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.156,
    "end": 1821.927,
    "text": " another approach is to use expected free energy to reweight the policy prior into a policy posterior according to equation 2.6 which is to say reweighting policies according to their epistemic plus pragmatic value so in this setting the epistemic value um right now like everything's pretty much fixed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1823.105,
    "end": 1827.889,
    "text": " So there really isn't much epistemic value to gain yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1829.351,
    "end": 1834.415,
    "text": "Pragmatic value though, is gonna be about preference satisfaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1835.516,
    "end": 1837.318,
    "text": "So what would the preference be?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1840.841,
    "end": 1842.502,
    "text": "Preferences over observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.27,
    "end": 1853.112,
    "text": "I'll just note like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1853.159,
    "end": 1856.002,
    "text": " This recent one on intentional behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.626,
    "end": 1865.514,
    "text": "They do explore like essentially preferences over whether it's raining or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.876,
    "end": 1873.664,
    "text": "But suffice to say in the textbook and in this kind of primary version, the preferences are over observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1875.746,
    "end": 1881.293,
    "text": "So let's just say that let's just say that it's darker when raining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.045,
    "end": 1912.427,
    "text": " lighter when not so if our kind of if our conversational preference is like i prefer it to rain our c preference variable because it's over observations would say i i prefer i expect and prefer it to be darker because the preferences are grounded in sensory observations that haven't come in yet",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1914.348,
    "end": 1936.234,
    "text": " I mean, uploading the textbook to a language model or not, copying in this table and then saying, write active inference Python code, given that this is my POMDP, you will get a script with just this much information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.137,
    "end": 1940.98,
    "text": "Because you've given all of the information needed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1944.453,
    "end": 1950.803,
    "text": " There's no other, there's no, there's way more complex models to make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1951.824,
    "end": 1955.77,
    "text": "But in terms of describing all of this, I mean, G is not really a variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1956.611,
    "end": 1971.574,
    "text": "It's a functional that gets applied to pi conditioned upon C and E. So by defining A, B, C, D, E, S, O, and then the generative process,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1981.19,
    "end": 2010.302,
    "text": " the true rain but that doesn't have to be active inference that could be um a random number that could be an API to a weather station that that it could just be anything else that plugs in and outputs observations and then intakes actions but here it's kind of a null action intake because your choice to go outside does not affect",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2012.155,
    "end": 2014.538,
    "text": " Yeah, that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2037.724,
    "end": 2037.964,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2038.064,
    "end": 2038.625,
    "text": "Thank you for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2038.965,
    "end": 2039.246,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.486,
    "end": 2040.407,
    "text": "Yeah, I mean,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2040.792,
    "end": 2044.576,
    "text": " David Price- plug it in and see where it goes or look at a pie mdp.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2045.817,
    "end": 2051.944,
    "text": "David Price- documentation and see which one it looks most like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.729,
    "end": 2061.935,
    "text": "David Price- I think we looked at it a previous time, but this one is a moving grid world agent in one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2064.518,
    "end": 2065.359,
    "text": "David Price- And then to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2067.081,
    "end": 2067.441,
    "text": "David Price- um.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2069.598,
    "end": 2079.335,
    "text": " Prakash, this is under chapter seven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.143,
    "end": 2084.303,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.323,
    "end": 2090.193,
    "text": "And then chapter two here is, again, similar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2090.253,
    "end": 2094.34,
    "text": "And then the, I mean,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2095.906,
    "end": 2120.715,
    "text": " make some kind of fusion variants like there's a T maze it's like your living room is the starting position in the maze and then like you know you could check the weather that's the epistemic Q or you could choose to bring an umbrella or not and then it would already have almost isomorphic relationship with it with a tutorial",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.525,
    "end": 2141.62,
    "text": " And especially when starting, this is like why the iterating on having a model is so informative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2141.8,
    "end": 2147.81,
    "text": "Like ironically or appropriately, depending on how you see it, it's like it's epistemic chaining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2148.35,
    "end": 2153.479,
    "text": "The modeler is in an epistemic chain with their own modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2154.741,
    "end": 2157.906,
    "text": "It's super easy to wait on the sideline until what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2158.387,
    "end": 2159.308,
    "text": "I really don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2159.93,
    "end": 2165.198,
    "text": " But by putting something down, then there's all these other things that open up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2166.2,
    "end": 2168.303,
    "text": "So that's the epistemic chaining as a process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.129,
    "end": 2177.517,
    "text": "Okay, Francis, let me just see what you wrote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2180.078,
    "end": 2186.428,
    "text": " Is it straightforward to download either the PMD, the PMD notebook is the chapter seven document also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.508,
    "end": 2187.409,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2187.429,
    "end": 2188.771,
    "text": "Um, about PMD.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.753,
    "end": 2190.093,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2190.534,
    "end": 2193.899,
    "text": "At the top of each page, like I'll just put it in the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.602,
    "end": 2199.187,
    "text": "You can open it in Colab super easy and then just make a copy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2200.309,
    "end": 2204.415,
    "text": "So those are very nice notebooks to pull.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2205.497,
    "end": 2208.702,
    "text": "Um, is the chapter seven document also a Jupiter notebook?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.677,
    "end": 2232.09,
    "text": " no um that would probably require going to appendix c and uh going to the matlab code or um this the team is foraging",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2235.108,
    "end": 2239.353,
    "text": " and bringing this MATLAB code into something like a notebook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.373,
    "end": 2241.715,
    "text": "I'm not actually sure if MATLAB even has notebook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2242.776,
    "end": 2254.769,
    "text": "Or realistically, since it's the T-Maze, like this PyMDP T-Maze demo, it's the same exact thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.931,
    "end": 2258.973,
    "text": "So this notebook is probably a good one to go with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2261.256,
    "end": 2262.297,
    "text": "I don't have MATLAB.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2262.462,
    "end": 2283.863,
    "text": " uh as a non-academic is uh expensive uh or used to be expensive sorry you said you don't have coda or matlab colab it's free you just click on the link and then just duplicate it okay yeah okay",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2284.653,
    "end": 2292.105,
    "text": " Matt lab does have a costly license, except there's the octave like variant that's open source.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2292.125,
    "end": 2304.604,
    "text": "But like, rather than get into this whole like octave mat lab situation, like the, the Python and Julia are the way to go and rust when the time is right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.512,
    "end": 2310.694,
    "text": "This is interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.336,
    "end": 2318.503,
    "text": " recommend breaking the demo to change the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2319.184,
    "end": 2326.255,
    "text": "Only by doing this will an intuitive sense of mechanics of active inference develop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2326.275,
    "end": 2327.617,
    "text": "Pretty interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.637,
    "end": 2330.522,
    "text": "That's exactly what I was planning to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2330.941,
    "end": 2359.497,
    "text": " thank you okay yeah i mean it's it's super fun and then also like again seeing the kernel execute like just seeing a decision be made that helps open up like oh there's some there's like all these levels of diagnostics or analytics about the trace of the model that you might be interested in now is that active inference well it's about an active inference model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2359.763,
    "end": 2372.237,
    "text": " But then a next step might be like to do a parameter sweep across parameter combinations and then summarize the outcomes of those swept parameters with another heat map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2374.039,
    "end": 2375.2,
    "text": "And then what do you do from there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2375.48,
    "end": 2383.189,
    "text": "Then you could fold that back into the base model, or maybe you make another active inference agent that looks at the heat map and then does something from there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2386.038,
    "end": 2395.769,
    "text": " Hence it being more like lines or journeys of inquiry rather than like developing an artifact that just kind of slams the door.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2397.491,
    "end": 2401.816,
    "text": "Especially with these kind of more intuition pump examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2405.279,
    "end": 2414.83,
    "text": "Without wishing to derail things, I have an interest in doing test automation for code.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2415.316,
    "end": 2432.412,
    "text": " And I was looking in chapter seven at the way that the agent explores the little maze quite efficiently because it's seeking novelty.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2433.173,
    "end": 2443.062,
    "text": "And I was wondering whether I could do something like that to do exploratory testing of, say, an API.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2447.581,
    "end": 2449.563,
    "text": " That, that sounds very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2449.683,
    "end": 2456.209,
    "text": "I've never specifically seen it, but something like adaptive fuzzing or testing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2456.269,
    "end": 2463.977,
    "text": "And then that's where the epistemic value comes into play is like, let's just say pragmatic value is I prefer the program to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2464.858,
    "end": 2470.203,
    "text": "So, and then epistemic value is I'm going to find out about where and how it does or doesn't work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2471.064,
    "end": 2477.47,
    "text": "So if you only, um, made the breaking changes that you knew were going to break it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2478.192,
    "end": 2492.775,
    "text": " it would be very confirmatory, but it wouldn't be epistemic because you would only have been confirming, which might be a valid exercise, but you'd only be confirming the consequences of the actions that you already suspected.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2493.456,
    "end": 2494.497,
    "text": "But maybe that's important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.118,
    "end": 2500.707,
    "text": "And then another setting would be like with a kind of uniform prior or with an informed prior,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.328,
    "end": 2508.08,
    "text": " what kinds of changes would actually reveal more learning about the structure of the program or the API.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2508.902,
    "end": 2517.879,
    "text": "And then it's like, but once we figured out that that's a breaking change, like we've kind of mapped that part of the maze, there's probably a lot of cool ways to go there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2519.341,
    "end": 2519.742,
    "text": "Christoph?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.662,
    "end": 2526.212,
    "text": " So I think it's an interesting problem what to do with something like, you know, exploring the API.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.854,
    "end": 2534.17,
    "text": "There's this paper, first of all, there's planning and, no, certainly not planning and navigation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.365,
    "end": 2555.533,
    "text": " active interest in intentional behavior and they have this notion of sort of like inductive planning where there is a certain goal that the agent wants to reach and it works backwards to figure out what are the steps",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.513,
    "end": 2556.134,
    "text": " to get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.955,
    "end": 2577.206,
    "text": "For something like exploring an API, and I think for a lot of applications though, I think what's going to be eventually necessary somehow is to have a hybrid model that you will have to be able to attach almost like an LLM to it to basically at some point say like, well, I would like to actually, I decided on my course of action, I want to write some code that actually invokes the API.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.047,
    "end": 2581.993,
    "text": "And here with this decision, the structure of decision-making, we're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.973,
    "end": 2584.716,
    "text": " looking at assembly level of intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.916,
    "end": 2599.653,
    "text": "At some point, just like we are attached to an LLM that continuously pumps out words, and I'm just choosing over the distribution of those words, they're being pumped out, but I'm not actually generating them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.713,
    "end": 2601.095,
    "text": "I'm not aware of how that's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.935,
    "end": 2610.445,
    "text": "In the same way, you would have to attach an LLM to almost like an active inference agent that does some goal-oriented exploration of the API.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.425,
    "end": 2613.231,
    "text": " So that would be very interesting if you could achieve something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.291,
    "end": 2624.072,
    "text": "It's probably, you know, quite a lot of money to be made on this sort of intelligent exploration of APIs given how much trouble bugs are causing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.862,
    "end": 2629.202,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2629.623,
    "end": 2629.944,
    "text": "Thanks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2630.645,
    "end": 2631.066,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2631.468,
    "end": 2645.306,
    "text": " Like, and then it kind of like in, in that, um, like we were talking about right before we began with like the feedback and the training examples, like you can have a data set of correct API calls and incorrect API calls or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2646.508,
    "end": 2653.277,
    "text": "Um, and then it's like plan to make it work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2653.297,
    "end": 2658.083,
    "text": "And those are kind of the semantics of perception and action that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.092,
    "end": 2687.631,
    "text": " like ecosystems of shared intelligence, synthetic intelligence, if we can construct a formalism that has the semantics that are how we think about it and or co-evolve that with updating how we think about it, then we would have kind of a high bandwidth or a low loss or some other good property of the edge between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2689.045,
    "end": 2689.994,
    "text": " artifacts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2691.914,
    "end": 2714.638,
    "text": " Yeah, I think this is where LLM's really kind of suck at, that you can sort of ask it to do something like this, but it will not really have any kind of notion of thinking about the problem deeply, about how would you go about breaking something for an API, because that requires a sophisticated model of what the API might be doing under the hood, for instance, like some kind of buffer overflow and something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.139,
    "end": 2720.925,
    "text": "But if you could come up with a minimal example that would model something like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.905,
    "end": 2730.655,
    "text": " you know, assume there is a possibility of a buffer overflow in an API, how would you go about making some kind of inference about our planning to exploit that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.015,
    "end": 2742.127,
    "text": "That'd be super interesting, as a minimum as a kind of a minimum example, even for just a simple, you know, very simple API that takes like a car star and a size or something, something like this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.208,
    "end": 2748.313,
    "text": "How would you go about, you know, inferring whether it's possible to do the buffer overflow in this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.238,
    "end": 2766.167,
    "text": " One funny piece there would be, check out the PyMDP API, and then what would be appropriate, the appropriate, the latitude within that API is active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2766.805,
    "end": 2769.308,
    "text": " That's kind of one, that would be a plot twist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2769.608,
    "end": 2775.374,
    "text": "And then also on the interpretability, here's a paper with Mao and others from last year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.936,
    "end": 2780.56,
    "text": "Like largely there aren't technical advances in this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.04,
    "end": 2786.086,
    "text": "The images are drawn from Sanfed Smith's Livestream 28 paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2786.666,
    "end": 2796.677,
    "text": "So it's not like this is breaking the theoretical ground, but the whole point is when you ask a neural network or LLM, et cetera, how sure are you about that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2797.349,
    "end": 2808.991,
    "text": " it can come up with a sequence of tokens, but that sequence of tokens is only going to be coincidentally related to anything like an uncertainty evaluation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2810.414,
    "end": 2819.07,
    "text": "Whereas if uncertainty parameters are explicitly encoded, then self-access introspection",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2821.16,
    "end": 2843.961,
    "text": " is just like a parameter look up it's not like some second it's like part of the real-time function of the system is um uncertainty estimates of different kinds at different levels so then to ask about how certain it is about a certain thing at a certain level you just ask that question and then return that variable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2844.211,
    "end": 2850.28,
    "text": " You know, maybe even that's on some kind of special chip or something like with verified access or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2850.641,
    "end": 2862.74,
    "text": "So it opens up to all these different architectures rather than like, well, let's train like another adversarial neural network to like, you know, try to infer this about this one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2862.8,
    "end": 2869.651,
    "text": "And then that gets into this whole like deception game versus having these introspectable architectures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2869.931,
    "end": 2870.472,
    "text": "Joris?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2872.493,
    "end": 2876.308,
    "text": " To what extent does this differ from Bayesian reinforcement learning?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2878.497,
    "end": 2880.023,
    "text": "Great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2881.724,
    "end": 2888.514,
    "text": " What what what what about that, or what what do you mean overall house activity inference different than reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2889.236,
    "end": 2905.2,
    "text": "yeah maybe indeed even overall but yeah if you want this kind of uncertainty measure with whatever you infer, then I guess both frameworks will allow this or is there yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2906.648,
    "end": 2933.28,
    "text": " uh it's probably a very unclear question but yeah okay there's there's there's a few a few works and a few approaches there so um models that aren't active inference still do deal in uncertainty so there still is an uncertainty parameterization in even a linear regression however a neural network or reinforcement learner that's trained to generate language",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2933.699,
    "end": 2939.558,
    "text": " its outputs of languages don't necessarily represent a veridical introspection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2941.006,
    "end": 2950.537,
    "text": " Maybe there's a way to train it so that the output is a veridical representation, but that would be a secondary kind of welding together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2951.017,
    "end": 2958.846,
    "text": "Whereas this architecture that we just looked at, like it's it's a part of that's kind of on the uncertainty as part of the architecture part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2959.667,
    "end": 2966.895,
    "text": "The key the key difference between active inference and the reinforcement learning is in reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.875,
    "end": 2988.293,
    "text": " a reward distribution is proposed a secondary or auxiliary or corollary corollary distribution is proposed that's like layered over the observations so in the homeostatic environment we'd say we're getting observations about temperature and we are rewarded by 37c and we seek out high reward",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2989.015,
    "end": 3013.032,
    "text": " In active inference, we do away with this secondary auxiliary function, and we directly work on the observation distribution by calling our preferences not a preference for higher score on this proposed distribution, but rather we have an expectation and a preference that connects directly to the observations themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.395,
    "end": 3017.959,
    "text": "Yes, I understand that, but I",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3018.597,
    "end": 3029.61,
    "text": " have been vaguely looking at things that Benjamin van Rooij and his lab are doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3030.171,
    "end": 3031.833,
    "text": "But I don't really understand it yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3031.873,
    "end": 3039.542,
    "text": "But there is some kind of thing like Bayesian reinforcement learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3039.522,
    "end": 3066.897,
    "text": " I wonder if they have I I would expect it to have uh um a measure of uncertainty that comes with with any prediction there but I might have uh yeah it might just be too fake concept in my mind no you're right there it is there I mean this work on um demystified and compared and there's several other",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3067.771,
    "end": 3070.534,
    "text": " works that do directly tackle it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3072.676,
    "end": 3079.222,
    "text": "It's not out of the picture that, I mean, architectures can include arbitrary components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3079.262,
    "end": 3083.766,
    "text": "So it is possible to be like, well, let's have an epistemic module.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3084.546,
    "end": 3096.057,
    "text": "Well, yes, but then epistemic and pragmatic value at the end of the day in the RL learner or the deep Q learner or whatever epistemic and pragmatic value are going to get blended back together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3097.319,
    "end": 3127.174,
    "text": " into the reward function right you have this like artificial curiosity and and other uh intrinsic motivations that you could add add on to a classic canonical reinforcement learner and i see quite a lot of of research on that but then it seems that from an active inference framework it kind of emerges from the from from the the system but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.238,
    "end": 3130.061,
    "text": " Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3130.101,
    "end": 3155.929,
    "text": "That is the hope, that there's a variety of cognitive phenomena from planning to epistemic value, curiosity, intentionality, variety of phenomena that could be implemented in a range of architectures, but will pursuing a first principles approach lead to simpler, more interpretable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3156.652,
    "end": 3157.853,
    "text": " more efficacious models?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3158.514,
    "end": 3160.016,
    "text": "Possibly, possibly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.318,
    "end": 3172.512,
    "text": "If somebody needed, there might be a better model for a situation today because there are such incredible gyms and toolkits for reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3174.274,
    "end": 3181.022,
    "text": "So, but yes, hence the moment of the epistemic,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3181.913,
    "end": 3208.798,
    "text": " excitement that we have and share here plus the accelerating pragmatic conversion and understanding like yeah where is this useful because it's it's all good for something to be insightful but then um i mean there could be a situation where active inference just gives us an intuition pump and then we use a neural network or there are hybrid architectures that that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3209.707,
    "end": 3235.512,
    "text": " do this or that and um but if utility is is what is desired or or some other property that another system already has then yeah definitely active inference has to work to to to be superior there one really interesting um moment from um this was a couple days ago",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3235.846,
    "end": 3258.529,
    "text": " with uh Ryan Smith and two of his PhD students so the empirical status of predictive coding um what was super interesting about this paper was like in this textbook group if someone said like what's the status like of of FEP or status of acting people would often take it like in a metaphysical direction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3259.167,
    "end": 3271.345,
    "text": " However, they took it the other way and asked what's the empirical status of predictive coding and active inference in explaining neuroimaging and neurobiology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3271.385,
    "end": 3282.441,
    "text": "So it's very interesting and these are the ongoing questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.26,
    "end": 3308.665,
    "text": " and curating the models and being able to compare them based upon how they do treat these phenomena that would be super informative and then if we can have a similar um syntax for the variable similar API use agent I mean this um the demystified and compared it uses the open AI gym so like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3312.087,
    "end": 3315.932,
    "text": " they presented some promising, interesting results, and that was several years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3316.753,
    "end": 3328.046,
    "text": "And a lot of the work has probably not been published on the OpenAI ActiveInference side, but it is right there, like with Frozen Lake or with the other reinforcement learning settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3331.029,
    "end": 3339.9,
    "text": "And then look at where they're different, find out where does the super high-performance, large-scale RL model do well that this simple ActiveInf one doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3340.488,
    "end": 3344.232,
    "text": " And then what would we need to do to make it different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3347.336,
    "end": 3347.977,
    "text": "Well, fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3348.157,
    "end": 3352.322,
    "text": "Yeah, Chapter 7 is pretty fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3353.943,
    "end": 3359.41,
    "text": "Next weeks, we'll head into Chapter 8 on the continuous time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.571,
    "end": 3366.698,
    "text": "Maybe we'll look at some Rx and Fur examples because there aren't going to be PyMDP examples for Chapter 8.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3367.336,
    "end": 3395.318,
    "text": " um the continuous time models there's a lot to say there on the math and on the philosophy and so on chapter nine integrating with data and then chapter 10 just a long wrap up with no figures or equations so thank you all see you next time thank you daniel bye thank you thanks everybody",
    "speaker": "SPEAKER_02"
  }
]