[
  {
    "start": 7.793,
    "end": 35.37,
    "text": " hello welcome everyone it is april 21st 2025 we're in active inference guest stream number 103.1 with tobias plowman discussing the mind in motion so we will have a presentation followed by a discussion if you're watching live feel free to write any questions in the live chat otherwise tobias thank you for joining looking forward to the presentation go for it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.464,
    "end": 37.605,
    "text": " Hey, thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.146,
    "end": 39.127,
    "text": "So hi, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.147,
    "end": 41.37,
    "text": "I'm Tobias, and this is the Mind in Motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.41,
    "end": 49.699,
    "text": "Today, I'll be sharing with you a model that I've spent the last few years developing, the Neurocognitive Systems Model, or NCSM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.641,
    "end": 65.998,
    "text": "Before we go any further, I just want to do a little disclaimer, just saying I developed this framework independently outside of traditional academic channels, which did allow for novel insights into how cognition dynamically organizes and reconfigures itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.417,
    "end": 75.512,
    "text": " While this model does explain how cognition works, it also clarifies systems sometimes fail and sometimes they break down under pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.532,
    "end": 86.509,
    "text": "I encourage critical evaluation and I invite you all to consider how this might connect or contrast with your own research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.112,
    "end": 89.995,
    "text": "So what is NCSM?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.768,
    "end": 96.416,
    "text": " NCSM proposes cognition as a recursive adaptive control architecture, not fixed or linear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.797,
    "end": 100.422,
    "text": "It's dynamic, precision-weighted, and regulated under varying constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.286,
    "end": 106.05,
    "text": "The model compromises three integrated layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.292,
    "end": 114.683,
    "text": "MPPE, the neurocognitive predictive processing engine, is the generative core predicting and updating cognitive states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.865,
    "end": 120.831,
    "text": " We then have CSTP, the arbitration layer, managing transitions between cognitive states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.912,
    "end": 125.175,
    "text": "And then we have the dynamic cognitive systems, or DCSM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.016,
    "end": 131.882,
    "text": "These are five cognitive attractor modes, instinctual, social, executive, memory-driven, and associative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.564,
    "end": 142.712,
    "text": "Cognition here is framed as an ongoing inference over internal states regulated via dynamic precision and adaptive control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.033,
    "end": 168.075,
    "text": " By the end of this presentation, you will have a mechanistic account of cognition as a recursive hierarchical and dynamically coupled system, a generalizable architecture grounded in neuroscience, cognitive psychology, and computational logic, a framework designed for structural adaptability capable of being reconfigured, extended, or embedded,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.523,
    "end": 176.631,
    "text": " and a model aligned with the principles of active inference enabling uncertainty minimization through predictive goal-directed dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.323,
    "end": 187.369,
    "text": " So the way we'll be breaking this down is we'll go through DCSM first, the five cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.23,
    "end": 191.513,
    "text": "Then we'll go through CSTP, MPP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.973,
    "end": 202.903,
    "text": "And once we've built out the full model, we'll be able to look at some cognitive loops and coherent systems, building cognition, behavior, emotion into a mechanical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.084,
    "end": 210.229,
    "text": "And then we'll go into cognitive breakdowns, dysregulation, and maladaptive feedback loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.627,
    "end": 222.421,
    "text": " And then we'll get onto some edge case scenarios where we'll look at stuff like addiction, meditation, and some more interesting things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.082,
    "end": 231.693,
    "text": "And finally, we'll end on part seven, where we'll look at where this model is going, future work, and collaborations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.538,
    "end": 241.566,
    "text": "So first, we're going to start with the dynamic cognitive systems model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.115,
    "end": 246.56,
    "text": " Sorry, the dynamic cognitive systems model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 248.783,
    "end": 253.51,
    "text": "So there are five key attractive systems, each governing specialized cognitive domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.211,
    "end": 260.0,
    "text": "First, we have the instinctual core system, which governs reflexes, threat detection, urgency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.04,
    "end": 264.186,
    "text": "Next, we have the social and environmental modulation system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.907,
    "end": 267.891,
    "text": "This balances personal drives against social context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.626,
    "end": 273.71,
    "text": " Next, we have ECOS, the Executive Control and Optimization System.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.75,
    "end": 281.418,
    "text": "This system is responsible for executive control, planning, inhibition, and strategic reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.46,
    "end": 287.424,
    "text": "Fourthly, we have NPRS, the Memory Pattern Retrieval System.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.444,
    "end": 294.992,
    "text": "This system is responsible for memory-guided inference using past experiences to inform current cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.474,
    "end": 302.442,
    "text": " And finally, we have the associative pattern recognition system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.404,
    "end": 310.654,
    "text": "This system is responsible for symbolic reframing and facilitates creativity, insight, and symbolic adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.457,
    "end": 314.58,
    "text": "Crucially, these aren't isolated modules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.6,
    "end": 319.146,
    "text": "They recursively influence, suppress, and reshape each other in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.708,
    "end": 323.292,
    "text": "First, I'm going to introduce the three behavioral systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.436,
    "end": 338.133,
    "text": " Traditionally, we conceptualize cognition as hierarchical, executive reason on the top, reflexes in the bottom, where in reality, cognition is a recursive and multi-directional process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.835,
    "end": 350.848,
    "text": "This interplay lends itself to dynamic precision weighting, where the brain decides moment by moment how much weight to give instinctual cues, social expectations, or executive predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.415,
    "end": 356.399,
    "text": " The first system we're going to look at is the instinctual core system or ICS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.16,
    "end": 361.865,
    "text": "This is cognition's rapid response module and doesn't deliberate, it acts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.308,
    "end": 371.156,
    "text": "ICS is survival first, speed focused and consistently scanning for threat signals or unexpected changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.297,
    "end": 377.663,
    "text": "Think reflexes, instinctual urges, immediate emotional reactions like panic or freeze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.731,
    "end": 385.879,
    "text": " Its operational strategy is biased towards action, even if that action might be a false alarm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.4,
    "end": 389.525,
    "text": "From an evolutionary standpoint, it's better safe than sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.565,
    "end": 402.807,
    "text": "ICS minimizes immediate bodily prediction errors by quickly aligning organism states to perceived threats, prioritizing urgent action over perfect accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.263,
    "end": 409.548,
    "text": " While ICS is vital, over-activation is costly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.868,
    "end": 418.5,
    "text": "Chronic ICS arousal means chronic anxiety, hypervigilance, or reactive impulsivity, which can cascade into broader cognitive dysregulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.924,
    "end": 423.628,
    "text": "ICS is essential but must be carefully regulated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.709,
    "end": 428.374,
    "text": "If relied solely on ICS, there'd be no reflection or any reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.337,
    "end": 434.363,
    "text": "That's where the social and environmental modulation comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.575,
    "end": 445.615,
    "text": " SEMS take ICS signals and filters them through social context and emotional tone and environmental norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.865,
    "end": 454.933,
    "text": "SEMS asks, is this behavior socially acceptable or appropriate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.698,
    "end": 465.249,
    "text": " It processes the raw ICS inputs like anger, fear or excitement and evaluates their social consequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.13,
    "end": 469.575,
    "text": "It regulates our expressiveness and ensures coherence with social norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.197,
    "end": 478.407,
    "text": "SEMS balances authenticity with social coherence, maintaining acceptance and harmony within groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.778,
    "end": 495.451,
    "text": " In active inference terms, SEMS modulates precision assigned to social signals, emotional expectations, actively inferring what emotional states and behaviors align with predicted social landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.077,
    "end": 510.705,
    "text": "When SEMS becomes overly restrictive, individuals suppress emotions excessively, resulting in anxiety, isolation, or depressive states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.023,
    "end": 515.93,
    "text": " Conversely, weak SEMS signals lead to inappropriate outbursts or social rejection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.993,
    "end": 524.823,
    "text": "SEMS ensures our instinctual responses remain socially viable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 525.464,
    "end": 528.99,
    "text": "Without it, coherent social life and group functioning become impossible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.694,
    "end": 538.684,
    "text": "So thirdly and finally of the behavioral systems, we have ECHOs or the Executive Control and Optimization System.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.233,
    "end": 542.275,
    "text": " ECHOES is the cognitive architect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.596,
    "end": 549.064,
    "text": "It strategically plans actions, inhibits impulses, and evaluates long-term consequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.265,
    "end": 556.172,
    "text": "It models future states, setting goals and constraints, and balances short-term desires against long-term well-being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.194,
    "end": 560.277,
    "text": "ECHOES is a powerful system, but costly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.778,
    "end": 565.363,
    "text": "It demands extensive cognitive resources, relying heavily on prefrontal processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.525,
    "end": 570.269,
    "text": " Its computational load makes it vulnerable under stress or cognitive overload.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.831,
    "end": 579.28,
    "text": "ECHOES acts as a precision weighted control policy, minimizing expected free energy by choosing behaviors aligned with coherent long-term predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.941,
    "end": 586.889,
    "text": "For instance, deciding between enjoying leisurely time now or preparing for an important future exam.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 589.092,
    "end": 594.118,
    "text": "It evaluates anticipated reward prediction and uncertainty reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.043,
    "end": 600.068,
    "text": " When overloaded by stress, fatigue, or information density, ECOS loses precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.629,
    "end": 607.355,
    "text": "Decisions become impulsive, erratic, or overly rigid, leading to maladaptive loops or paralysis by analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.017,
    "end": 615.303,
    "text": "Healthy ECOS function differentiates adaptive, purposeful living from chaotic, impulsive existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.264,
    "end": 619.988,
    "text": "This impairment is central to many cognitive and clinical disorders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.153,
    "end": 626.529,
    "text": " So now we have the three behavioral systems built.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.67,
    "end": 630.214,
    "text": "We can look a little bit at how they interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.156,
    "end": 644.698,
    "text": " where traditional views often picture cognition as strictly hierarchical, executive control at the top and instincts at the bottom, where in reality cognition is much more dynamic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.718,
    "end": 655.155,
    "text": "These three behavioural systems, ICS, SEMS and ECOS, interact recursively, forming a flexible bi-directional loop, rather than a rigid hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.3,
    "end": 661.187,
    "text": " Let's first explore the bottom-up pathway, starting with ICS, the Instinctual Unconscious System.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.529,
    "end": 665.594,
    "text": "ICS rapidly triggers responses like panic or urgency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.634,
    "end": 671.042,
    "text": "It's not subtle, it acts fast to ensure survival, even at the cost of accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.244,
    "end": 678.733,
    "text": "These signals often move up to SEMS, the Semiconscious Social and Emotional Modulation System.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.876,
    "end": 686.104,
    "text": "SEMS acts as a filter, evaluating instinctive reactions through a social lens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.287,
    "end": 689.33,
    "text": " It checks what's socially acceptable, appropriate, or shameful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.712,
    "end": 692.373,
    "text": "Consider panic in a social setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.154,
    "end": 694.376,
    "text": "ICS signals panic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.796,
    "end": 696.518,
    "text": "SEMS evaluates social context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.379,
    "end": 706.528,
    "text": "If SEMS perceives social risk, it might suppress visible panic, redirecting or internalizing the response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.509,
    "end": 713.796,
    "text": "Crucially, ICS and SEMS can directly suppress or even override executive planning in ECHOS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.232,
    "end": 723.908,
    "text": " For instance, an extreme fear, ICS, or intense shame, SEMS, can disable your ability to plan or make rational decisions in ECHOES.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.873,
    "end": 738.653,
    "text": "Now we can look at some of the long-term bottom-up effects where, importantly, repeated bottom-up signals shape how ECHOES sees the world over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.751,
    "end": 748.461,
    "text": " Persistent fear can gradually train ECHOs to expect threats elsewhere, altering long-term cognitive strategies and causing anxiety disorders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.002,
    "end": 758.651,
    "text": "Continuous shame or negative social feedback can restructure how ECHOs evaluate self-worth, resulting in lowered self-esteem or chronic social anxiety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.614,
    "end": 767.88,
    "text": "Now let's look at the top-down pathway, where ECHOs, the conscious executive system, shapes SEMS and ICS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.008,
    "end": 775.679,
    "text": " ECOS models the world strategically, evaluates long-term consequences, and inhibits impulsive reactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.583,
    "end": 785.396,
    "text": "Through repeated inhibition, reframing, and habit formation, ECOS actively retrains SEMS and ICS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.378,
    "end": 792.007,
    "text": "For instance, deliberative exposure to fearful situations guided by ECOS planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.37,
    "end": 794.712,
    "text": "Gradually, ICS",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.923,
    "end": 802.038,
    "text": " It gradually teaches ICS that certain threats are manageable, eventually reducing instinctual fear responses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.04,
    "end": 813.966,
    "text": "Similarly, conscious reframing, like cognitive therapy, helps STEMs reinterpret social cues while reshaping emotional reactions and responses over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.372,
    "end": 819.435,
    "text": " why this system is dynamic and not fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.476,
    "end": 822.318,
    "text": "So these interactions aren't static.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.539,
    "end": 828.366,
    "text": "Each system, ICS, SEMS, and ECOS, is an attractor pulling cognitive process towards its domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.648,
    "end": 834.133,
    "text": "Crucially, with constant feedback, they dynamically rewire each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.034,
    "end": 836.817,
    "text": "ICS is not permanently dominant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.037,
    "end": 838.939,
    "text": "ECOS isn't permanently in control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 839.86,
    "end": 845.067,
    "text": "Each can reshape and influence each other, creating cognitive flexibility and adaptability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.312,
    "end": 847.354,
    "text": " So why does this matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.596,
    "end": 854.365,
    "text": "Understanding this recursive dynamic explains how reflexive or emotional reactions become controllable over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.026,
    "end": 857.69,
    "text": "It also explains why control breaks down under stress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.111,
    "end": 862.438,
    "text": "In overload, ICS signals become too strong, overriding SEMs and echoes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.64,
    "end": 872.033,
    "text": "Most importantly, this explains long-term behavioral change, persistent adaptive or maladaptive patterns emerge precisely from this ongoing recursive feedback loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.152,
    "end": 884.484,
    "text": " By appreciating this dynamic interplay, we can better understand and eventually guide healthy cognitive development, therapeutic interventions, and adaptive behavioral change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.187,
    "end": 889.932,
    "text": "So now we have two more systems of the dynamic cognitive systems model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.153,
    "end": 894.998,
    "text": "These next two systems are responsible for memory and creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.4,
    "end": 900.906,
    "text": "First of all, we have the memory pattern retrieval system, or NPRS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.207,
    "end": 911.041,
    "text": " This is cognition stabilizer, and it draws from stored experience and memory traces to contextualize present events and maintain coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.824,
    "end": 924.66,
    "text": "The functional importance of NPRS is it anchors cognition in familiar contexts, rapidly retrieving past schemas and patterns to guide real-time interpretation and response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.884,
    "end": 929.307,
    "text": "NPRS reduces uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.877,
    "end": 939.552,
    "text": " by supplying stable priors, essentially predictive memories, which help cognitive systems to interpret ambiguous or complex sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.417,
    "end": 951.531,
    "text": "When you recognize a friend in a crowded cafe, NPRS matches visual cues with stored patterns, immediately stabilizing uncertainty and facilitating social engagement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.498,
    "end": 957.662,
    "text": " Yet strong reliance on NPRS can be problematic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.682,
    "end": 966.134,
    "text": "Traumatic memories or past rigid experiences become self-sustaining attractors, creating loops such as rumination or avoidance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.756,
    "end": 976.388,
    "text": "Healthy NPRS maintains balance, retrieving memories sufficiently to stabilize cognition without imposing rigid maladaptive interpretations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.617,
    "end": 990.715,
    "text": " NPRS allows cognition to leverage past coherence in uncertain present moments, but it must remain flexible enough to adapt and recontextualize experience effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.078,
    "end": 1000.468,
    "text": "Finally, we have APRS, the Associative Pattern Recognition System,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.782,
    "end": 1007.994,
    "text": " This is Cognition's creative reframe engine responsible for insight, creativity, and symbolic adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.478,
    "end": 1015.708,
    "text": "Functionally, APRS engages when existing cognitive models fails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.49,
    "end": 1024.785,
    "text": "It recombines symbolic associations, generating novel frameworks or explanations to resolve prediction errors and reestablish coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.769,
    "end": 1043.831,
    "text": " APRS represents an exploratory inference system actively generating alternative hypotheses when habitual predictions fail to adequately minimize uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.473,
    "end": 1056.949,
    "text": "When you face an unexpected life crisis, like a sudden career change, APRS activates to explore alternative possibilities or reframing the situation positively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.756,
    "end": 1060.521,
    "text": " However, APRS is inherently unstable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.981,
    "end": 1069.035,
    "text": "Excessive activation leads to symbolic overload, overwhelming cognition with too many novel hypothesis or symbolic reinterpretations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.756,
    "end": 1073.923,
    "text": "This manifests as confusion, existential distress or dissociation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.307,
    "end": 1083.78,
    "text": "Healthy cognition balances APRS with echo stability, avoiding symbolic drift while benefiting from novel reframing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.705,
    "end": 1092.994,
    "text": " APRS gives cognition its flexibility and resilience, but requires careful management to avoid cognitive destabilization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.995,
    "end": 1099.52,
    "text": " So now we've looked at all five of the cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.042,
    "end": 1107.751,
    "text": "So the reason I started with DCSM is because this is where the model originated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.211,
    "end": 1113.899,
    "text": "So it was intentionally started as a psychological framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.281,
    "end": 1122.07,
    "text": "But then research kind of led me to develop something called the cognitive synchronization transition protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.598,
    "end": 1134.428,
    "text": " So DCSM described the individual cognitive modes quite clearly, but it didn't fully explain the transitions between them, especially under conditions of uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.468,
    "end": 1144.157,
    "text": "So I was thinking, what precisely triggers the instinctual shifts from ICS to SEMS to ECHOS?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.498,
    "end": 1151.905,
    "text": "Or how does the brain move from social-emotional evaluation into memory retrieval, for instance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.707,
    "end": 1160.598,
    "text": " Without understanding these transitions, cognition appeared incomplete, a set of powerful but disconnected states without clear switching rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.765,
    "end": 1167.65,
    "text": "This critical gap is filled by a new mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.95,
    "end": 1172.157,
    "text": "I call it the Cognitive Synchronization Transition Protocol, or CSTP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.72,
    "end": 1178.888,
    "text": "CSTP acts as the arbitration control layer, managing cognitive transitions in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.939,
    "end": 1185.926,
    "text": " Think of CSTP as cognition's real-time traffic controller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1186.968,
    "end": 1195.304,
    "text": "It continuously addresses the state of cognitive coherence to determine whether to maintain current cognitive mode or initiate a shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.148,
    "end": 1199.332,
    "text": "It isn't simply turning systems on or off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.033,
    "end": 1204.842,
    "text": "It is dynamically monitoring how stable the current cognitive mode is under real-time demands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.252,
    "end": 1209.054,
    "text": " Signals monitored by CSTP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.035,
    "end": 1211.597,
    "text": "Number one is confidence decay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.678,
    "end": 1216.822,
    "text": "Is this current cognitive mode losing its predictive reliability?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.842,
    "end": 1219.345,
    "text": "Next, we have entropy buildup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.186,
    "end": 1223.95,
    "text": "Is this uncertainty or confusion escalating to unsuitable levels?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.751,
    "end": 1227.393,
    "text": "And thirdly, we have neural phase desynchronization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.413,
    "end": 1233.58,
    "text": "Are these neural signals underpinning our current cognitive state, becoming misaligned or out of sync?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.99,
    "end": 1244.502,
    "text": " When these signals exceed a certain threshold, indicating instability, CSTP initiates a cognitive mode shift to maintain coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.268,
    "end": 1253.834,
    "text": "CSTP continuously checks whether the system is coherent or starting to break down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.575,
    "end": 1256.958,
    "text": "It asks critical questions in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.541,
    "end": 1263.347,
    "text": "Is our current cognitive state still precise and reliable enough to manage demands at hand?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.766,
    "end": 1267.97,
    "text": " Are the levels of cognitive tension or entropy manageable, or are they becoming critical?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.034,
    "end": 1273.356,
    "text": "CSTP also has gating transitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.157,
    "end": 1281.465,
    "text": "If predictions remain high and coherence is stable, CSTP actively maintains the current cognitive mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.406,
    "end": 1292.777,
    "text": "But if coherence deteriorates, if precision is sharply declining, or if entropy sharply rises, CSTP gates, initiates the transition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.9,
    "end": 1297.906,
    "text": " CSTP's active reallocation of cognitive control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.707,
    "end": 1306.142,
    "text": "During this gating process, CSTP reallocates cognitive resources and redirects neural synchrony to restore coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.124,
    "end": 1317.364,
    "text": "This active gating and synchronization ensures cognition remains adaptive, responsible, and resilient, rather than becoming overly rigid or chaotically fragmented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.917,
    "end": 1323.759,
    "text": " Why is CSTP so crucial?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.48,
    "end": 1331.589,
    "text": "In short, CSTP ensures our cognition can flexibly adapt to constantly changing demands without losing structural integrity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.71,
    "end": 1339.379,
    "text": "It's the dynamic regulator allowing our cognitive systems to reorganize efficiently, preventing maladaptive loops and cognitive breakdown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.324,
    "end": 1350.152,
    "text": "Next, that brings us on to the final part of the model, the neurocognitive predictive processing engine, or NPPE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.393,
    "end": 1361.602,
    "text": " Now we've seen CSTP manage cognitive mode transitions, but underneath these transitions and the cognitive attractors lies an essential predictive engine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.783,
    "end": 1363.784,
    "text": "This is MPPE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.845,
    "end": 1369.389,
    "text": "MPPE is the fundamental closed-loop architecture that powers cognitive adaptability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.17,
    "end": 1378.198,
    "text": "It continuously generates predictions about incoming sensory signals, evaluates them against reality, and determines how much discrepancies matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.524,
    "end": 1382.826,
    "text": " MPP is composed of three components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.527,
    "end": 1385.209,
    "text": "Number one is the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.831,
    "end": 1393.278,
    "text": "This component predicts what will happen next, creating a coherent expectation or hypothesis about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.839,
    "end": 1398.203,
    "text": "Number two is the error detection system, or EDS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.064,
    "end": 1405.33,
    "text": "EDS checks the predictions from the generative model against actual sensory inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.131,
    "end": 1409.755,
    "text": "Its job is to detect mismatches between expectations and reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.22,
    "end": 1419.99,
    "text": " And then finally, we have the precision weighting mechanism where PWM evaluates how significant these mismatches are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.031,
    "end": 1424.856,
    "text": "It decides if the discrepancy should trigger a change or if it's minor enough to ignore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.338,
    "end": 1433.807,
    "text": "Together, these three elements perform a predictive loop that ensures cognitive coherence, adaptability, and adaptability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.748,
    "end": 1440.535,
    "text": "Without MPP, cognition wouldn't respond effectively to uncertainty or change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.645,
    "end": 1450.152,
    "text": " Let's take a closer look at exactly how MPP works step by step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.706,
    "end": 1461.648,
    "text": "So first, the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.012,
    "end": 1470.001,
    "text": "The GM creates a prediction, an internal hypothesis about sensory inputs and upcoming events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.822,
    "end": 1475.128,
    "text": "For example, the GM might predict a friend's reaction to something you say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.733,
    "end": 1476.517,
    "text": " Error detection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.079,
    "end": 1481.519,
    "text": "The error detection then compares this prediction with actual incoming sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.941,
    "end": 1483.347,
    "text": "What really happens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.597,
    "end": 1487.242,
    "text": " If your friend's reaction matches your expectation, everything stays smooth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.843,
    "end": 1489.826,
    "text": "If it doesn't, a mismatch occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.687,
    "end": 1492.59,
    "text": "This is where precision tuning comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.63,
    "end": 1495.554,
    "text": "The PWM evaluates the mismatch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.115,
    "end": 1497.617,
    "text": "How important is this difference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.398,
    "end": 1504.606,
    "text": "If PWM decides it's trivial, the system suppresses the mismatch and maintains its existing cognitive model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.388,
    "end": 1509.273,
    "text": "If PWM signals it's significant, an update is needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.136,
    "end": 1512.878,
    "text": "CSTP integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.01,
    "end": 1519.985,
    "text": " When PWN signals a significant mismatch, the GM revises its internal prediction model to align better with reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.007,
    "end": 1531.71,
    "text": "If its revision is substantial, large enough to shift cognitive change, it demands CSTP to initiate a cognitive mode shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.167,
    "end": 1538.973,
    "text": " Imagine you expect a friendly greeting, but instead your friend looks upset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.775,
    "end": 1558.727,
    "text": "MPP identifies this mismatch, PWM flags it as significant, GM updates expectations, and CSTP shifts you from casual conversation into memory retrieval or planning to adapt to this unexpected interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.187,
    "end": 1570.558,
    "text": " While MPPE typically keeps cognition adaptive and coherent, the system isn't foolproof.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.578,
    "end": 1575.809,
    "text": "Under intense stress, overload, or malfunction, MPPE can still fail in predictable ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.915,
    "end": 1582.302,
    "text": "So there's three major failure modes for MPPE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.53,
    "end": 1587.734,
    "text": " There's high precision weighting, so belief lock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.355,
    "end": 1590.137,
    "text": "PWM is excessively high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.417,
    "end": 1593.941,
    "text": "The cognitive system refuses to acknowledge prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.762,
    "end": 1598.385,
    "text": "This creates stubborn beliefs or rigid thinking despite clear contradictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.667,
    "end": 1609.297,
    "text": "Cognition clings to existing models, refusing to update, think of denial or rigid ideologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.899,
    "end": 1613.301,
    "text": "Low precision weighting or noise dominance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.99,
    "end": 1615.833,
    "text": " PWM is excessively low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.873,
    "end": 1621.964,
    "text": "The system sees every small mismatch as significant, making cognition unstable and overwhelmed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.266,
    "end": 1628.155,
    "text": "This leads to cognitive chaos, constant anxiety, hypervigilance or confusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.117,
    "end": 1631.26,
    "text": "Nothing feels predictive or trustworthy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.125,
    "end": 1637.972,
    "text": "Thirdly, we have GM collapse or loss of structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.728,
    "end": 1642.535,
    "text": " The generative model itself breaks down with no clear predictions conform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.377,
    "end": 1651.433,
    "text": "In this state, cognition is completely uncertain and disorientated, unable to guess or model reality effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.154,
    "end": 1656.703,
    "text": "This manifests as severe cognition disruption, dissociation or acute distress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.472,
    "end": 1660.194,
    "text": " So why does MPPE matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.035,
    "end": 1664.158,
    "text": "MPPE isn't merely about getting predictions correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.719,
    "end": 1668.423,
    "text": "It's fundamentally about maintaining coherence under stress and uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.485,
    "end": 1675.972,
    "text": "Healthy cognition balances flexibility, updating models with stability, retaining useful predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1676.873,
    "end": 1684.902,
    "text": "MPPE manages this delicate balance and its failure represents serious cognitive vulnerabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.198,
    "end": 1697.758,
    "text": " Understanding MPPE failures give us clear insights into clinical conditions, cognitive biases, and maladaptive loops, highlighting the value of robust adaptive prediction engine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.583,
    "end": 1706.333,
    "text": "So now we're going to look at some cognitive dynamics and feedback loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.713,
    "end": 1709.396,
    "text": " We've seen each layer clearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.177,
    "end": 1717.991,
    "text": "MPPE predicts, CSTP arbitrates, and DCSM expresses cognitive modes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1719.093,
    "end": 1727.568,
    "text": "When integrated, these three layers form a powerful recursive cognitive control loop, continuously adapting to cognition moment by moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.65,
    "end": 1731.375,
    "text": "So if you look at the picture here, we've got a rough",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.334,
    "end": 1742.549,
    "text": " kind of breakdown of the cycle from input from external environment or internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.569,
    "end": 1754.287,
    "text": "There we can see the signal would go through the generative model to be matched against the predictive state compared through the error detection system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.589,
    "end": 1758.493,
    "text": "If it matches, it is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.165,
    "end": 1788.818,
    "text": " low and not needed to be processed if there's a mismatch it's sent to the precision weighting mechanism which then checks for error strength confidence relevance and resources if it's not important again it suppresses and exits the loop if not it's flagged as unstable and activates cstp this is where cstp then checks coherence phase confidence and confidence if it's stable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.587,
    "end": 1792.65,
    "text": " delays the switch and re-weights the loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.073,
    "end": 1796.376,
    "text": "If unstable, it begins mode arbitration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.436,
    "end": 1800.002,
    "text": "This is where the DCSM's modes compete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.167,
    "end": 1810.199,
    "text": "CSTP selects the dominant mode and executes the mode and then the cycle repeats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.219,
    "end": 1815.447,
    "text": "This is obviously quite a simple breakdown of it and it's a lot more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.034,
    "end": 1819.98,
    "text": " kind of higher dimensional than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.841,
    "end": 1834.6,
    "text": "But essentially, this continuous loop of prediction, arbitration, expression is precisely what makes thought and coherence adaptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.908,
    "end": 1849.663,
    "text": " But more importantly, it also explains where cognition can fail and any disruptions in this recursive cycle can cause instability, maladaptive feedback loops, or coherence collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.429,
    "end": 1860.655,
    "text": "So we're going to look at emotion now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.465,
    "end": 1869.131,
    "text": " Let's discuss how emotion integrates into predictive cognitive system dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.894,
    "end": 1872.656,
    "text": "Motion isn't random or disruptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.937,
    "end": 1878.144,
    "text": "It actively biases predictions profoundly, shaping how cognition adapts and selects actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.446,
    "end": 1882.33,
    "text": "Emotions serve three crucial functions within cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.05,
    "end": 1887.917,
    "text": "Adding weight to predictions, emotions emphasize certain outcomes over others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.498,
    "end": 1891.362,
    "text": "Fear prioritizes threat avoidance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.883,
    "end": 1893.645,
    "text": "Excitement signals reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.79,
    "end": 1916.68,
    "text": " one two is modulating inhibition or activation emotion can either energize or dampen cognitive processes anxiety inhibits actions anger facilitates and anger facilitates assertive behavior number three emotion um guides action viability emotion text signal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.267,
    "end": 1925.683,
    "text": " which actions feel feasible, socially appropriate, or internally coherent, and which seem impossible or undesirable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.967,
    "end": 1930.392,
    "text": "Crucially, emotions are not cognitive noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.313,
    "end": 1939.208,
    "text": "They're precise signal taggers, marking internal states with urgency, social relevance, and subjective significance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.095,
    "end": 1943.198,
    "text": " Imagine approaching a stage to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.658,
    "end": 1950.868,
    "text": "Fear signals the possibility of social rejection, amplifying predictions of negative outcomes, prompting caution or avoidance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.729,
    "end": 1957.857,
    "text": "Excitement, conversely, might highlight opportunities for achievement, energizing action towards performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.659,
    "end": 1968.03,
    "text": "By integrating emotional signaling into the cognitive system, MPP, CSTP, and DCSM become finely attuned",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.247,
    "end": 1977.277,
    "text": " not just to logical accuracy, but also to urgent, social and adaptive demands of real-time situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.297,
    "end": 1986.107,
    "text": "Emotion ensures cognition doesn't merely predict accurately, it ensures predictions matter to our survival, social cohesion and identity coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.55,
    "end": 1992.093,
    "text": "Next, we'll look at the insight loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.356,
    "end": 1998.22,
    "text": "This is one of the most fascinating cognitive loops, the insight loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.478,
    "end": 2004.863,
    "text": " or as I like to call it, the shower realization loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.044,
    "end": 2011.59,
    "text": "This process activates when echoes, your executive control system becomes overloaded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.89,
    "end": 2017.776,
    "text": "The system hits a wall or is stuck in repetitive resource intensive loops without reaching a solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.836,
    "end": 2029.168,
    "text": "When echoes is overwhelmed, cognitive control momentarily relaxes, allowing the associative pattern recognition to passively, recognition system to passively activate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.127,
    "end": 2042.567,
    "text": " APRS, with its wide-ranging associative power, freely explores symbolic connections without the tide of direct control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.21,
    "end": 2052.724,
    "text": "In this state, your memory pattern retrieval system retrieves symbolic traces or subtle hints from past experiences, connecting disparate memories and insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.307,
    "end": 2056.911,
    "text": "Once a promising symbolic pattern emerges,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.68,
    "end": 2064.967,
    "text": " Echos can re-engage, adopting the fresh insight generated by APRS and MPRS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.948,
    "end": 2069.612,
    "text": "It reorganizes a coherent plan around this newly discovered pathway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.553,
    "end": 2080.605,
    "text": "This is how symbolic recombination not only resolves cognitive overload, but revitalizes the executive function, providing sudden clarity and those aha moments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.211,
    "end": 2088.113,
    "text": "Next, we'll look at the goal reset loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.168,
    "end": 2096.497,
    "text": " This is how your cognition adapts when a plan fails or when goals become impossible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.959,
    "end": 2102.426,
    "text": "Initially, the mismatch builds between the current state and the expected outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.928,
    "end": 2107.534,
    "text": "This signals growing uncertainty and stress within the cognitive system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.675,
    "end": 2118.69,
    "text": "As the mismatch accumulates, CSTP detects instability and triggers drift away from the current, now failing mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.206,
    "end": 2129.943,
    "text": " In response, APRS again activates, but this time intentionally, recombining various alternatives and potential new pathways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.564,
    "end": 2133.229,
    "text": "It's actively looking for viable symbolic alternatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.591,
    "end": 2145.049,
    "text": "Simultaneously, NPRS contributes context, grounding these alternatives in past successful strategies or relevant memories, adding coherence and validity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.598,
    "end": 2152.644,
    "text": " Finally, Echoes assesses these recombinations and chooses a new, contextually appropriate path to move forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.965,
    "end": 2158.95,
    "text": "This is effectively reframing the situation, replanning and correcting your internal narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.852,
    "end": 2173.804,
    "text": "The goal reset loop illustrates how our cognitive architecture maintains flexibility, resilience and resilience by rapidly shifting strategies, ensuring that we rarely get stuck and are always adaptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.373,
    "end": 2190.36,
    "text": " Okay, so now we've explored how cognitive loops like insight and goal reset help cognition to stay adaptive and resilient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.501,
    "end": 2193.823,
    "text": "But what happens when these loops fail or misfire?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.883,
    "end": 2197.847,
    "text": "When transitions between cognitive states break down?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.887,
    "end": 2203.752,
    "text": "Here we enter maladaptive feedback loops, persistent states of cognitive dysfunction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.854,
    "end": 2210.018,
    "text": "Maladaptive loops are cognitive patterns that reinforce themselves negatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.42,
    "end": 2212.864,
    "text": " becoming stuck in cycles or repeated errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2215.168,
    "end": 2221.198,
    "text": "Instead of resolving uncertainty or achieving adaptive goals, these loops maintain problematic status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.664,
    "end": 2236.444,
    "text": "Understanding these loops is crucial because they underpin many cognitive and emotional difficulties like avoidance, denial, or persistent anxiety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.875,
    "end": 2243.698,
    "text": " Let's explore a few key examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.119,
    "end": 2260.641,
    "text": "Like here, we're going to look at the avoidance loop, which is when cognition repeatedly predicts failure or threat, leading the system to suppress action or planning altogether.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.701,
    "end": 2268.051,
    "text": "First, the generative model predicts a high likelihood of failure or discomfort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.925,
    "end": 2272.909,
    "text": " whether social rejection, personal embarrassment, or task difficulty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.351,
    "end": 2282.719,
    "text": "Second, the precision weighting mechanism tags this predicted failure as highly significant, creating intense anxiety or uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.98,
    "end": 2296.333,
    "text": "Thirdly, in response, echoes, shuts down, or suppressive active planning to avoid predictive negative outcomes, reinforcing immediate relief through disengagement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.891,
    "end": 2308.088,
    "text": " Short-term relief validates avoidance, so the next time the task appears, the cognitive system immediately predicts failure again, restarting the cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.01,
    "end": 2314.982,
    "text": "Each repetition strengthens avoidance, embedding disengagement as a default cognitive strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.002,
    "end": 2320.093,
    "text": "Imagine avoiding a challenge at work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.474,
    "end": 2323.676,
    "text": " repeatedly because you anticipate failure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.716,
    "end": 2330.363,
    "text": "Each avoidance episode makes the task appear more daunting next time, reinforcing your belief that you can't handle it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.304,
    "end": 2339.612,
    "text": "This loop traps cognition, preventing adaptive growth and leading to chronic procrastination, anxiety, and lowered self-confidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.875,
    "end": 2345.738,
    "text": "Next, we'll look at a belief lock loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.02,
    "end": 2350.823,
    "text": "So this is another critical maladaptive loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.174,
    "end": 2358.966,
    "text": " where outdated or incorrect cognitive models persist despite clear external evidence contradicting them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.549,
    "end": 2366.918,
    "text": "First, we have the generative model maintains an outdated or flawed perception about reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.958,
    "end": 2371.225,
    "text": "This could be an innocent self-perception, belief or expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.972,
    "end": 2379.699,
    "text": " Secondly, the error detection system correctly flags this mismatch between predictions and reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.239,
    "end": 2387.648,
    "text": "However, the precision weighting mechanism strongly suppresses these error signals, dismissing the mismatch as insignificant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.429,
    "end": 2393.494,
    "text": "With no significant mismatch perceived, CSTP never triggers an update or cognitive mode shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2394.375,
    "end": 2403.726,
    "text": "SEMS conforms to social or emotional pressures supporting the original belief, and ECOS rationalizes logically to maintain cognitive coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.908,
    "end": 2405.911,
    "text": " reinforcing the outdated belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.955,
    "end": 2413.302,
    "text": "Over time, the cognitive system defends the faulty belief ever more robustly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.063,
    "end": 2417.428,
    "text": "Evidence against it is constantly ignored, denied, or rationalized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.81,
    "end": 2422.174,
    "text": "Consider someone firmly believing they're incapable of public speaking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.835,
    "end": 2430.827,
    "text": "Even after multiple successful talks, they discount the successes as luck or expectations, preserving their original negative self-belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.123,
    "end": 2435.367,
    "text": " Belief lock restricts cognitive flexibility and prevents growth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.888,
    "end": 2446.341,
    "text": "It solidifies cognitive biases, fuels demands, I mean, sorry, fuels denial and maintains rigid patterns to resist change, even in the face of clear evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.764,
    "end": 2452.629,
    "text": "Finally, we'll look at the rumination loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.931,
    "end": 2459.818,
    "text": "So rumination occurs when cognition becomes stuck, cycling between cognitive models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.469,
    "end": 2464.152,
    "text": " unable to commit firmly to any one attractor state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.594,
    "end": 2473.485,
    "text": "Rather than resolving uncertainty, rumination continually revisits the same thought patterns without productive resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.487,
    "end": 2476.669,
    "text": "Step-by-step dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.631,
    "end": 2487.763,
    "text": "So rumination would start with a triggering event where CSTP detects uncertainty or instability and tries shifting cognitive modes to resolve it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.077,
    "end": 2495.126,
    "text": " That results in a failed arbitration where CSTP can't confidently commit to a new cognitive attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.947,
    "end": 2498.991,
    "text": "No mode feels entirely stable or appropriate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.914,
    "end": 2508.425,
    "text": "With CSTP unable to stabilize, APRS, ECOS, and NPRS continue cycling endlessly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.445,
    "end": 2517.919,
    "text": "Each cycle of APRS, ECOS, and NPRS introduces slight variations, but no cycle is stable or satisfying enough to halt the loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.481,
    "end": 2524.666,
    "text": " So imagine repeatedly replaying a past conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.706,
    "end": 2533.597,
    "text": "Each replay is slightly different, evaluating alternatives, feeling unsettled and never finding a satisfying interpretation to this rumination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.76,
    "end": 2537.202,
    "text": "Why does rumination persist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.043,
    "end": 2540.546,
    "text": "Because confidence and precision remains unstable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.766,
    "end": 2546.033,
    "text": "CSTP never selects a stable cognitive state, creating persistent cycle without progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.958,
    "end": 2548.46,
    "text": " Rumination isn't productive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.74,
    "end": 2553.427,
    "text": "It drains resources, maintains stress and blocks adaptive cognitive resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.669,
    "end": 2560.637,
    "text": "Long-term rumination contributes significantly to anxiety disorders, depressive episodes and chronic stress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.662,
    "end": 2567.987,
    "text": "Now we've got the social saturation and aversion loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.86,
    "end": 2596.021,
    "text": " So this is a mode where SEMS fails to align due to perceived overconformity triggering an identity-preserving inhibition, not out of fear of rejection, but of rejection of belonging by default.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.183,
    "end": 2604.91,
    "text": "So SEMS detects overalignment in the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.818,
    "end": 2628.973,
    "text": " so um essentially um this mechanism is where how can i explain that it's like um where when you realize everyone does something so then it biases you to do the opposite",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.067,
    "end": 2638.198,
    "text": " basically what that means is internally, um, our self is made by, it's an internal model of ourselves essentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.378,
    "end": 2655.822,
    "text": "And when our internal model is, um, not underweighted, but when it's, um, when it's not established enough, we reject outside, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.995,
    "end": 2666.73,
    "text": " social priors because it would lower the weight of our internal model of ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2667.952,
    "end": 2675.545,
    "text": "So identity stabilizes selfhood by selectively accepting new priors where when self-priors are strong, adaptation occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.926,
    "end": 2679.312,
    "text": "When weak, the system resists change to preserve continuity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.24,
    "end": 2699.66,
    "text": " So now we can look at applying NCSM to traditional models or to clinical models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.647,
    "end": 2708.05,
    "text": "Here we can see that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.515,
    "end": 2717.524,
    "text": " We have common cognitive patterns like freeze loops, over control, social masking, rumination, and alienation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2717.564,
    "end": 2725.353,
    "text": "Here you can see the dominant modes they're mapped to and the clinical expression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.393,
    "end": 2735.404,
    "text": "These patterns persist not because of static traits, but because the system fails to reconfigure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.633,
    "end": 2744.561,
    "text": " Essentially, what we're trying to say is, NCSM is the foundation from which these clinical patterns emerge from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.601,
    "end": 2747.603,
    "text": "And they're not fixed deficits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.887,
    "end": 2762.978,
    "text": "So now we're moving more on to the edge case scenarios and kind of more what I think is a bit getting to some of the more kind of interesting stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.274,
    "end": 2775.007,
    "text": " So here we're looking at addiction, which provides one of the clearest examples of a maladaptive feedback loop where the cognitive prediction loop itself becomes hijacked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.168,
    "end": 2787.462,
    "text": "So step by step dynamics of addiction is ICS triggers urgency where ICS triggers stress or emotional discomfort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.783,
    "end": 2789.725,
    "text": "Something feels intolerable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.177,
    "end": 2799.79,
    "text": " Next, APRS rapidly predicts a shortcut to relief, typically a familiar addictive substance or behavior that has previously provided immediate relief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.912,
    "end": 2808.682,
    "text": "NPRS retrieval confirms this prediction based on past relief experiences, reinforcing the shortcut as highly reliable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.702,
    "end": 2819.998,
    "text": "The precision weighting mechanism then actively suppresses contradictions or negative consequences, downplaying evidence that the shortcut is harmful or maladaptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2821.362,
    "end": 2831.036,
    "text": " Crucially, CSTP gets bypassed entirely, no cognitive reconfiguration occurs, no evaluation or reconsideration happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2833.28,
    "end": 2837.887,
    "text": "The result of this, sorry, is the outcome is predictive coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.708,
    "end": 2843.615,
    "text": "A consistent internal state is built entirely on false or damaging assumptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.376,
    "end": 2849.023,
    "text": "Cognition feels stable inside even as it's systematically compromised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.568,
    "end": 2862.288,
    "text": " Addiction persists purely because it artificially stabilizes prediction loops, creating coherence that feels right internally, even while causing severe external harm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.835,
    "end": 2867.358,
    "text": "Sorry, now we're uneducated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.658,
    "end": 2868.48,
    "text": "My apologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.013,
    "end": 2878.062,
    "text": " So now we move beyond everyday maladaptive loops into extreme cognitive scenarios, what we call edge cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.822,
    "end": 2886.791,
    "text": "Edge cases are critical tests for our cognitive models because they reveal how cognition behaves under intense and often overwhelming conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.712,
    "end": 2896.341,
    "text": "Far from anomalies, edge cases are the sharpest stress tests that clarify the limits and resilience of a cognitive system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.536,
    "end": 2907.506,
    "text": " Ed States represent moments where cognition either transcends typical constraints, such as during intense meditation, or completely collapses as seen in severe addiction or suicide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.247,
    "end": 2918.316,
    "text": "These extremes aren't merely outliers, they're valuable for revealing the fundamental mechanics and breaking points of cognitive coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.197,
    "end": 2925.163,
    "text": "By exploring Ed States, we gain insights into how cognitive systems adapt, survive or fail under extreme pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.143,
    "end": 2930.044,
    "text": " So it's suicide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.084,
    "end": 2940.956,
    "text": "One of the most severe edge cases is suicide, defined here not metaphorically, but mechanically as terminal cognitive collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.717,
    "end": 2946.862,
    "text": "The step-by-steps of terminal collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.882,
    "end": 2957.513,
    "text": "Initially, prediction confidence drops critically low, so low that the cognitive system can no longer reliably forecast any viable future states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.218,
    "end": 2965.669,
    "text": " CSTP, which normally reroutes and reconfigures cognitive system modes under distress, becomes unable to manage or redirect the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.873,
    "end": 2983.517,
    "text": "Symbolic recombination, APRS, and executive planning, ECOS, the systems that usually help to reframe or replan, disengage entirely, leaving the cognition with no meaningful alternative situation to the scenario, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.577,
    "end": 2985.539,
    "text": " ICS dominance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.24,
    "end": 2993.214,
    "text": "With no coherent alternative available, the instinctual core system becomes fully dominant, driving urgent, desperate action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.759,
    "end": 2998.785,
    "text": "Action here isn't primarily emotional despair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.306,
    "end": 3005.218,
    "text": "It's the cognitive system attempting an urgent escape from recursive overload and unresolved prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.515,
    "end": 3009.58,
    "text": " The cognitive system identifies no path back to coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.86,
    "end": 3016.952,
    "text": "Suicide emerges as the only viable resolution, an act driven mechanically by precision collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.756,
    "end": 3021.499,
    "text": "This scenario is not metaphorical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.98,
    "end": 3029.552,
    "text": "It is literally a terminal attractor state, a cognitive condition where the system forcibly exits because it cannot resolve the ongoing predictive overload.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.764,
    "end": 3043.169,
    "text": " By framing suicide this way, we can better grasp its cognitive dynamics, potentially informing more effective interventions and support systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.189,
    "end": 3048.72,
    "text": "Next, we'll look at meditation, where we'll look at the opposite end of cognitive collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.041,
    "end": 3050.123,
    "text": "In meditation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.554,
    "end": 3055.338,
    "text": " which is internal suppression of predictive urgency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.799,
    "end": 3058.922,
    "text": "During meditation, cognitive load reduces drastically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.243,
    "end": 3069.254,
    "text": "The associative memory and patterns via APRS system and NPRS begin symbolic drift, gently recombining experiences without immediate demand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.055,
    "end": 3078.304,
    "text": "Precision waiting relaxes, allowing previously suppressed signals to emerge, yet softly enough to avoid triggering reactive states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.925,
    "end": 3085.433,
    "text": " Executive control gradually loosens its inhibitory grip, no longer urgently maintaining coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.534,
    "end": 3094.043,
    "text": "At the same time, instinctual and social systems, ICS and SEMS, fade into the cognitive background, fighting emotional and reactive noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3096.065,
    "end": 3104.815,
    "text": "This deliberate release reduces internal prediction pressure, creating a state where coherence can be safely renegotiated and restructured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.06,
    "end": 3110.53,
    "text": " Importantly, meditation is not about achieving complete mental silence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.011,
    "end": 3114.197,
    "text": "It's about symbolic cleanup and coherence restructuring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.58,
    "end": 3117.745,
    "text": "It's coherence hygiene, not emptiness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.772,
    "end": 3122.415,
    "text": "Finally, we'll look at murder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3123.745,
    "end": 3138.045,
    "text": " And back to the opposite end, a more extreme end of the spectrum, we can look at where in murder, where internal coherence is broken, but instead of withdrawing, the system externalizes the collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.026,
    "end": 3150.883,
    "text": "This occurs when a powerful rumination loop fuses urgency, ICS, with identity protection, SEMS, misinterpreting the external action as the path to internal coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.197,
    "end": 3154.28,
    "text": " CSTP fails to manage the conflict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.941,
    "end": 3160.929,
    "text": "Unable to reroute or recalibrate effectively, it relinquishes control, allowing ICS to dominate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.172,
    "end": 3170.343,
    "text": "Executive inhibition echoes is bypassed or severely suppressed, driven down by the system's desperate attempt to regain stability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.324,
    "end": 3173.427,
    "text": "The internal prediction becomes tragically clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.467,
    "end": 3178.474,
    "text": "Unless this external obstacle is removed, internal coherence cannot return.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.741,
    "end": 3183.847,
    "text": " This act isn't primarily about rage or hatred, it's about a mistaken cognitive solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.448,
    "end": 3192.057,
    "text": "The system perceives external harm as an unfortunate but coherent pathway back to internal predictability and stability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.982,
    "end": 3198.886,
    "text": "Now we reach a critical point, falsifiability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.926,
    "end": 3203.972,
    "text": "This model isn't simply theoretical speculation, it's designed for rigorous testing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.117,
    "end": 3207.28,
    "text": " I'm not just describing cognitive phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.901,
    "end": 3212.989,
    "text": "I'm trying to set conditions for experimental validation or disconfirmation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.93,
    "end": 3223.604,
    "text": "Let's quickly overview three key predictions which offer clear testable paths to validate or falsify the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.367,
    "end": 3228.171,
    "text": "So test one, we have the CSTP collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.94,
    "end": 3237.655,
    "text": " This is the first falsifiable prediction which focuses on CSTP, the Cognitive Synchronization and Transition Protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.508,
    "end": 3248.521,
    "text": " This model predicts that before observable cognitive breakdown, CSTP will show a measurable loss of neural synchrony between theta and gamma frequencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.362,
    "end": 3260.077,
    "text": "In EEG recordings, we expect to see a signal disruption clearly in the anterior cingulate cortex, a region critical for conflict monitoring and cognitive arbitration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.0,
    "end": 3262.821,
    "text": "Behavioral markers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.743,
    "end": 3268.89,
    "text": "Behaviorally, this desynchronization corresponds to specific symptoms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.123,
    "end": 3278.618,
    "text": " delayed cognitive responses, fragmentation of thoughts and decision-making, and feelings of disassociation or loss of coherent self-awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.201,
    "end": 3281.202,
    "text": "So how do we test it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.565,
    "end": 3290.778,
    "text": "We measure EEG activity specifically for theta-gamma coupling while subjects perform demanding cognitive tasks under stress or overload conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.339,
    "end": 3295.806,
    "text": "We look for moments immediately preceding observable cognitive failures or breakdowns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.271,
    "end": 3302.938,
    "text": " Importantly, the prediction can be falsified clearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.238,
    "end": 3313.692,
    "text": "If cognitive breakdown occurs without any measurable theta gamma synchrony loss in the AACC, our model requires significant revision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.236,
    "end": 3321.962,
    "text": "Test number two is precision weighting rigidity and rumination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.883,
    "end": 3339.701,
    "text": " This predicts that in high PWM rigidity, which excessively emphasizes existing cognitive predictions, will block adaptive shifts between cognitive modes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.402,
    "end": 3352.776,
    "text": "When PWM rigidity occurs, executive control echoes excessively dominates, preventing access to flexible symbolic reframing, APRS, and memory context, MPRS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.422,
    "end": 3364.914,
    "text": " We propose using fMRI to test for heightened and persistent dorsolateral prefrontal cortex activation, indicating rigid executive dominance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3366.215,
    "end": 3375.827,
    "text": "We combine this with pupillometry, measuring pupil constriction as an indicator of cognitive fixation and reduced exploratory behavior under uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.288,
    "end": 3388.952,
    "text": " Subjects will encounter uncertain or ambiguous scenarios in the scanner requiring cognitive flexibility and reframing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.115,
    "end": 3396.87,
    "text": "We look explicitly for neural and physiological traits that indicate rigid cognitive locking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.774,
    "end": 3412.548,
    "text": " falsify our prediction clearly, we must observe flexible cognitive switching, adaptive reframing, and exploratory behavior under conditions of demonstrably high echoes activation and rigid PWM conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.651,
    "end": 3419.835,
    "text": "Finally, we have arbitration fails under social conflict testing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.976,
    "end": 3425.22,
    "text": "This third test examines how CSTP handles social dilemmas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.382,
    "end": 3439.648,
    "text": " specifically situations marked by high ambiguity and internal cognitive conflict between executive goals and social emotional modulation, so ECHOs and SEMs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.434,
    "end": 3456.759,
    "text": " So we have a clear and specific prediction, which is the model predicts that in high-ambiguity social dilemmas, CSTP struggles significantly to resolve conflicts between ECHOs and SEMs, so rational planning and social alignment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.023,
    "end": 3468.218,
    "text": "This unresolved conflict should produce measurable neural signatures, specifically simultaneous subsystem activation and increased frontal theta activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.531,
    "end": 3479.147,
    "text": " Behaviorally, we expect to see delayed responses, indecision, hesitation, and signs of internal cognitive conflict during complex social interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.869,
    "end": 3494.712,
    "text": "So for the experimental testing and setup, we'll conduct EEG tests while subjects navigate morally or socially ambiguous scenarios designed to trigger echoes or SEMS conflicts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.063,
    "end": 3504.233,
    "text": " We then analyze neural data explicitly looking for simultaneous subsystem activity, elevated frontal theta oscillations, and delayed behavioral responses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.897,
    "end": 3523.635,
    "text": "Critically, this model can be falsified if we find consistently rapid cognitive resolution without evidence of subsystem conflict markers or frontal theta elevation, even in highly ambiguous social dilemmas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.345,
    "end": 3544.088,
    "text": " next step so um basically i've been kind of limited in um access so i don't really come from an academic background so i've done a lot of internal kind of simulations computationally",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.507,
    "end": 3561.739,
    "text": " I'm currently working on a runtime environment which simulates mainly CSTP's core logic of predictive mode transitions, arbitration, confidence decay, and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.141,
    "end": 3570.23,
    "text": " This runtime environment makes cognitive coherence and mode switching not just theoretical but directly observable and testable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.211,
    "end": 3579.921,
    "text": "We can watch cognitive breakdown and adaptive coherence in action and stress test the mind as rigorously as any control system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.984,
    "end": 3591.034,
    "text": "Alongside this runtime, also in very, very early stages, I've developed an internal simulation engine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.229,
    "end": 3602.06,
    "text": " based off NCSM, where I've started to model cognitive processes like recursive breakdown and symbolic recombination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.262,
    "end": 3608.948,
    "text": "Early results are promising, and I plan to publicly demo this engine later this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.988,
    "end": 3613.793,
    "text": "Right now, I'm looking to expand beyond solo development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.073,
    "end": 3617.717,
    "text": "This model has been, like I said, built entirely independently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.757,
    "end": 3621.021,
    "text": "No lab, no degree, no funding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.102,
    "end": 3624.326,
    "text": " So to scale this work, I'm actively seeking collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.587,
    "end": 3647.937,
    "text": "If you are running a EEG, MRI, or cuponometry lab, if you are exploring AGI, symbolic architectures, or safe arbitration in AI, or if you are involved in clinical diagnostics, psychiatric modeling, or neurological conditions, I would love to collaborate and hear from you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.098,
    "end": 3658.448,
    "text": " Just a little bit as well before I finish, you might be wondering what is SLR and how does it work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.289,
    "end": 3664.455,
    "text": "So SLR continuously tracks not what has changed, but why it has changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.575,
    "end": 3668.139,
    "text": "It then uses that contextual information to decide the next step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.0,
    "end": 3671.443,
    "text": "Each decision involves clear logic checks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.427,
    "end": 3675.85,
    "text": " Like, did something break?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.411,
    "end": 3677.955,
    "text": "Is this still coherent and safe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.975,
    "end": 3680.46,
    "text": "Should we switch to another cognitive pathway?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.422,
    "end": 3687.315,
    "text": "Every action within SLR is traceable, transparent, and reversible, creating an audit trail of cognitive decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.377,
    "end": 3690.141,
    "text": "Why does this matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.644,
    "end": 3697.323,
    "text": " With SLR, we have a symbolic engine capable of simulating complex cognitive phenomena without losing interpretability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.185,
    "end": 3704.704,
    "text": "It allows us to study cognition at a granular symbolic level, examining breakdowns, coherence recovery, and adaptive stability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.114,
    "end": 3708.796,
    "text": " Cognition is more than just function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.077,
    "end": 3711.74,
    "text": "It's a continuous recursive act of coherence management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.041,
    "end": 3717.748,
    "text": "Your beliefs, your blind spots, your identity itself all depend on how well your cognitive loops withstand stress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.73,
    "end": 3724.157,
    "text": "This model provides the tools to visualize, simulate, and potentially stabilize these cognitive loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.198,
    "end": 3729.664,
    "text": "Together, we can take this further, less collaborate test, and refine the model in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.684,
    "end": 3730.025,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.97,
    "end": 3734.831,
    "text": "Thank you, Tobias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.952,
    "end": 3735.332,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.612,
    "end": 3740.618,
    "text": " All right, I'm going to ask some questions from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.179,
    "end": 3745.646,
    "text": "So I'll ask one and anyone else can add and then I'll ask some other questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.707,
    "end": 3753.658,
    "text": "So Isaac wrote, does this theory help explain how societies function or other systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.832,
    "end": 3779.73,
    "text": " um i think so i think um the way i found out this model is through behavioral science so um there's a guy called rory sutherland who's a quite a famous marketer here in the uk who runs a behavioral science unit at ogilvy and um the way i kind of fell into this is actually through um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.71,
    "end": 3788.218,
    "text": " his mechanistic and interesting view on the way he talks about not just people, but society in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.258,
    "end": 3801.19,
    "text": "He framed irrationality as kind of system, just another half of the system that we're not thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3803.493,
    "end": 3806.055,
    "text": "So I think to answer that question,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.98,
    "end": 3808.625,
    "text": " Um, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.169,
    "end": 3812.014,
    "text": "Um, but I think there's a lot more to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.034,
    "end": 3814.962,
    "text": "It's not just mechanically inside ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3814.982,
    "end": 3817.108,
    "text": "There's a lot of external mechanics as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.244,
    "end": 3831.929,
    "text": " Yeah, I guess continuing on that question of whether it applies to other systems, like, how or why did the human cognitive apparatus come to have this articulation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.491,
    "end": 3840.548,
    "text": "Do you expect those motifs or systems to exist in mammals, other systems, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3840.207,
    "end": 3840.548,
    "text": "?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.708,
    "end": 3854.519,
    "text": " I think they do, but I think it's, um, very evolutionary dependent and environment dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.959,
    "end": 3865.953,
    "text": "Like a lot of these systems originate from our, like ICS is very, um, what's it like a reptilian brain based almost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.313,
    "end": 3872.24,
    "text": "And then SEMS is definitely comes from our kind of primate era.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.26,
    "end": 3875.344,
    "text": "And then Echoes is right when we're crossing into, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.062,
    "end": 3901.332,
    "text": " more homo sapien so i think there is parts of the model that we can take and kind of apply to other species but i think um environment and evolutionary context is probably where you'd want to start when when when building a model of of other cognitive systems if that makes sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.78,
    "end": 3912.5,
    "text": " Yeah, how does that connect to AI, AGI, interpretability, these topics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3912.56,
    "end": 3913.582,
    "text": "What do you mean, sorry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.323,
    "end": 3918.672,
    "text": "On the previous slide, you had the AI and AGI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3921.338,
    "end": 3921.598,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.675,
    "end": 3927.627,
    "text": " Okay, just because that's how we process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.927,
    "end": 3934.643,
    "text": "I've done a lot of research into the neuronal dynamics of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.45,
    "end": 3964.41,
    "text": " kind of we're not so what happens is we see the world as patterns and relationships so when you think of say something like maths or something you don't go through binary and think of every logic rule for maths we kind of symbolically compress it into its own um i think of it like a um like cognitively it's almost like a tensor kind of thing and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.842,
    "end": 3967.064,
    "text": " Sorry, I've lost my train of thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.485,
    "end": 3991.502,
    "text": "But basically, I think that AI systems right now are still processing in the way of ones and zeros distributed through neural nets, where what we're doing is we're actively predicting before, whereas AI is predicting after.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.542,
    "end": 3993.705,
    "text": "So like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.339,
    "end": 4000.087,
    "text": " When you're speaking to me, you're anticipating what I'm going to say before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.608,
    "end": 4008.02,
    "text": "Whereas when I speak to chat GPT, it's not, it's only responding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.681,
    "end": 4009.662,
    "text": "Does that make any sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4009.762,
    "end": 4011.445,
    "text": "They need to kind of close the loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.465,
    "end": 4018.697,
    "text": "So then when they need to feed the old prediction back into what's coming next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.736,
    "end": 4039.032,
    "text": " yes cool okay i'll continue with some live chat questions okay dylan wrote how do the different levels of cognition framed here relate to existing ideas of cognition are they completely novel have they got a basis in machine learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.42,
    "end": 4072.191,
    "text": " um i i wouldn't say they are novel um when kind of designing this framework designers what all i i took a lot of stuff from a lot of different places so like um like evolution psychology um neurology um society like just general society um human behavior and stuff so it's not i wouldn't say um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.542,
    "end": 4083.982,
    "text": " I would say putting all the things together is novel, but I wouldn't say like the way intelligence works is just kind of layers of information on top of each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.042,
    "end": 4089.792,
    "text": "So I think this is the model itself is a prediction of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.408,
    "end": 4107.46,
    "text": " um cognition and the way intelligence works is if this prediction is accurate it will remain as that next layer and if it is not it will need to be re-predicted um modulated and refined some more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4110.038,
    "end": 4129.262,
    "text": " yeah also i'd add in the video description you link to the pre-print and there's some citations there but certainly a lot of um possible concordances to draw with different kinds of cognitive frameworks okay exactly tobias wrote",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4129.242,
    "end": 4135.117,
    "text": " Could this model help to understand and address psychiatric issues?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.498,
    "end": 4138.466,
    "text": "You touched on suicide and maladaptive feedback loops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.967,
    "end": 4142.155,
    "text": "How might these loops be understood, addressed, and changed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.227,
    "end": 4155.88,
    "text": " Sure, so I think what could happen, so with humans and the way we work is not knowing is like what gives us the most anxiety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.9,
    "end": 4168.193,
    "text": "I should have included a loop for that, but basically it's just a prediction that if we're essentially based on prediction and not knowing is what drives us a bit mental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4168.794,
    "end": 4173.559,
    "text": "Like if you're waiting for, in the UK,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.843,
    "end": 4203.242,
    "text": " have like little timers on top of the bus stops but before they bring them in it was just it wasn't a nightmare but like you'd prefer to wait for a bus that's nine minutes if you can see the time versus waiting four minutes and there's no there's no time displayed it's the it's the anxiety of not knowing so i think i'm the way i base it is if we can validate this and map this and or if whether it's this framework or another framework or whatever i think if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4203.475,
    "end": 4231.272,
    "text": " um humans can know how they work and understand how they work then i think that we'll be able to almost reprogram ourselves in a way where um like i i briefly touched on like echoes can reprogram ics or sem's um systems so i think more than um therapy and and all of that stuff like i think obviously",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.011,
    "end": 4234.714,
    "text": " people with quite serious issues would still need therapy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.754,
    "end": 4261.748,
    "text": "But I think in the future, if we can accurately map our own cognition, I think it'll be a matter of just understanding ourselves, understanding the loops, understanding, like if it becomes common knowledge, how humans work or how cognition works in society, then we would, it'd be a reframing entirely and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.93,
    "end": 4267.856,
    "text": " we'd all be able to kind of help ourselves and kind of help each other, if that makes any sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4270.92,
    "end": 4272.601,
    "text": "Yeah, there's a lot there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.002,
    "end": 4275.785,
    "text": "It's kind of like the implication of cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4275.825,
    "end": 4288.178,
    "text": "What would it really be to have it be a science, not just an art or a ad hoc approach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.399,
    "end": 4291.802,
    "text": "When you say that it's reversible,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.875,
    "end": 4321.553,
    "text": " does that mean does that mean that specific actions can be reversed in their implication or that just from a computational perspective you have like logging for all the steps yeah so um let me talk a bit about personal experience so um i'm i'm diagnosed with um ptsd from some kind of medical stuff it's not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.495,
    "end": 4349.768,
    "text": " anything um so basically what i realized though is that um my ics was like ics responses were involuntary so i'd kind of be cognitively or my echoes would be engaged and um i could see involuntary responses happening and i could over time rewrite them through um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4350.845,
    "end": 4355.972,
    "text": " echoes engagement through cognitive engagement when these ICS responses happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4356.714,
    "end": 4374.039,
    "text": "If you can, I don't know how to explain it, but it's active integration, like actively focusing your cognitive modes internally can restructure other system responses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4374.119,
    "end": 4375.601,
    "text": "And that goes both ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4375.761,
    "end": 4380.328,
    "text": "Like if you don't regulate your kind of social",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.675,
    "end": 4388.386,
    "text": " like social systems internally, it can all go off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.406,
    "end": 4406.856,
    "text": "Like, it's just like, we have a bunch of different states inside and none of them, or sorry, all of them can take control or can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4409.823,
    "end": 4419.247,
    "text": " It's very complex to talk about because it's all so dynamic, but essentially, yeah, I think they can all kind of reconfigure each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.964,
    "end": 4426.465,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.609,
    "end": 4434.239,
    "text": " So there was an unconscious, semi-conscious, and conscious aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4434.84,
    "end": 4440.668,
    "text": "And is that sort of where the buck stops with cognition, with our conscious awareness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4440.829,
    "end": 4447.639,
    "text": "Or how does what we become aware of causally re-enter into these lower level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.42,
    "end": 4451.765,
    "text": "Because you describe these systems as attractors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4452.586,
    "end": 4453.988,
    "text": "So they're kind of like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.812,
    "end": 4484.363,
    "text": " patterns of uh they're like attractor patterns within the same anatomical apparatus even though they they might hinge more pivotally on on some brain regions or neurotransmitters yeah so how do we become aware of some modes but not other modes when it's the same pieces same molecules same brain regions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4486.283,
    "end": 4514.417,
    "text": " yeah i understand um again i'm not too i'm not too sure how um how echoes is like the conscious or the most adaptable one if that makes sense i've still got a lot of research to do on kind of the subsystems the subsystem dynamics but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.102,
    "end": 4542.75,
    "text": " Yeah, just it's an interesting question how with the same pieces in very very slightly differing but importantly differing configurations like phase synchrony give rise to these vastly different cognitive outputs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4542.983,
    "end": 4550.37,
    "text": " even though there's a lot of overlap with the parts and the functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4555.396,
    "end": 4555.756,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.397,
    "end": 4560.641,
    "text": "I mean, what are your next moves?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4561.301,
    "end": 4564.525,
    "text": "How can people specifically get more involved?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.545,
    "end": 4565.706,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.846,
    "end": 4571.792,
    "text": "So I've started a unit called the Neurodynamics Systems Unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.857,
    "end": 4577.245,
    "text": " And the website should be on the screen, ndsunit.org.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.445,
    "end": 4580.609,
    "text": "So you can contact me there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4583.113,
    "end": 4600.598,
    "text": "But yeah, I'm kind of looking for just anyone kind of interested in either validating the model, testing the model, or working on some symbolic AI systems with this runtime that will be available shortly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.468,
    "end": 4604.594,
    "text": " What will it look like when it's available?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.937,
    "end": 4609.727,
    "text": "It'll just be a short, small package with the core.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.389,
    "end": 4615.262,
    "text": "The way it works is you get nodes that perform a single action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.592,
    "end": 4620.217,
    "text": " And then you bundle these nodes together into modules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.059,
    "end": 4623.282,
    "text": "And the modules are kind of like simple folders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.302,
    "end": 4626.186,
    "text": "The way it's coded is actually really drag and drop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4627.388,
    "end": 4638.344,
    "text": "And then you program the config, which is kind of like the lattice state config, which is which nodes activate in which order, which modules activate in which order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.647,
    "end": 4645.975,
    "text": "And then it processes information, again, through like a symbolic chain where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4646.917,
    "end": 4652.783,
    "text": " You know, it's quite similar to a lot of like, like nested if statements a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4653.864,
    "end": 4661.511,
    "text": "But it's like I said, I'm struggling to kind of talk about it because I don't come from an academic background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4661.671,
    "end": 4665.475,
    "text": "And I'm like, deep in like some complex stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.495,
    "end": 4667.116,
    "text": "So but it's a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4667.196,
    "end": 4670.119,
    "text": "It's a lot like some nested if statements, I'd say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.159,
    "end": 4676.485,
    "text": "Academia is just like one big nested if statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.384,
    "end": 4681.928,
    "text": " Yeah, I can see that for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.611,
    "end": 4683.932,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.733,
    "end": 4687.638,
    "text": "If you have any last comments, feel free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4687.758,
    "end": 4688.72,
    "text": "Otherwise, this was great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4688.8,
    "end": 4690.443,
    "text": "I'm glad you shared it with us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4690.944,
    "end": 4693.889,
    "text": "And I look forward to staying in touch and learning more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.071,
    "end": 4695.432,
    "text": "Amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.492,
    "end": 4697.195,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.215,
    "end": 4697.455,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4698.297,
    "end": 4699.058,
    "text": "Thank you, Tobias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.579,
    "end": 4699.94,
    "text": "See you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.42,
    "end": 4700.561,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4701.823,
    "end": 4701.983,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_01"
  }
]