[
  {
    "start": 1.493,
    "end": 29.035,
    "text": " hello everyone it's June 23rd 2022 and we are in week eight of the textbook group cohort one we're starting chapter four and we'll be continuing with chapter four next week we're more than halfway done with the time and with the chapters that we're going through in the first half of the book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.799,
    "end": 38.005,
    "text": " So let's go to chapter four and just raise your hand and gather or write in the chat if you have anything that you wanna address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.787,
    "end": 50.456,
    "text": "So I'm going first to the math overviews page where I've written some overviews for the previous chapters of varying levels of completeness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.757,
    "end": 55.761,
    "text": "But this is very important as we set off into chapter four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.862,
    "end": 57.282,
    "text": "So on page 64.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.056,
    "end": 66.061,
    "text": " This chapter is more technical than chapters 1 through 3, appealing to linear algebra, differentiation, and a Taylor series expansion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.582,
    "end": 77.248,
    "text": "Those readers interested in the details may turn to the appendices... Those who do not want to delve into the theoretical underpinnings may skip this chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.389,
    "end": 82.431,
    "text": "So, keep that in mind as we continue on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.992,
    "end": 84.112,
    "text": "And...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.706,
    "end": 89.369,
    "text": " It can be an area of discussion and learning and such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.29,
    "end": 112.685,
    "text": "But let's approach these themes and formalisms with the author's forewarning that this is something we can look for more detail in the appendixes, as well as skip this chapter, even if we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.577,
    "end": 134.271,
    "text": " might disagree of course okay any other overall comments on chapter four just for whomever read it even a part of it what was their overall perspective on chapter four what was it trying to do what approach did they take",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.971,
    "end": 154.124,
    "text": " Yeah, Ali, and then anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.174,
    "end": 187.314,
    "text": " I think if we take the materials in chapters one through three as the foundational materials on which the active inference theory is supposed to build, well, this chapter four is one of the first steps toward building the actual theory and, I mean, going beyond just the basics and foundational materials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.794,
    "end": 213.586,
    "text": " So using the tools and foundations established in previous chapters, we are now perhaps ready to tackle the problem of actually constructing the generative models in two different situations as discrete time models and as continuous ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.047,
    "end": 238.315,
    "text": " awesome thanks yes in the chapters page we can recall back to chapter one that just laid out the structure of the book chapter two provided the low road to active inference which began with bayesian inference and talked about a few other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.043,
    "end": 254.773,
    "text": " prerequisite or preliminary themes including introducing variational and expected free energy as imperatives in the sense that they're able to be bounding surprise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.311,
    "end": 270.001,
    "text": " Chapter 3 introduced the high road to active inference, which was starting not from the mechanistic kind of nucleus of the Bayes equation, but rather from the imperative for survival and persistence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.922,
    "end": 276.826,
    "text": "Also introducing, in a first pass, the Markov blanket concept in partitioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.266,
    "end": 306.673,
    "text": " chapter four is indeed when we start to get into many details that were not covered in earlier sections it's gonna first begin by bringing us closer to this connection between bayesian inference and the free energy evaluation and then this central idea of a generative model is discussed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.413,
    "end": 321.987,
    "text": " that is going to be described in discrete time, specifically using the POMDP formalism, partially observable Markov decision process, and then as well as in continuous time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.016,
    "end": 352.643,
    "text": " then there's going to be some very interesting figures and formalisms and discussions on what generative models underlie predictive coding and motor reflexes which is moving us towards chapter five which is going to have some empirical work mainly cited out and some discussion on the plausible neurobiologies that can be implementing or modeled as implementing or modeled with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.595,
    "end": 365.196,
    "text": " the kinds of generative models of which have been prepared for in chapters two and three, motivated in chapters two and three, really, and then described in their essence in chapter four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.689,
    "end": 374.912,
    "text": " Also, just a reminder that in the math group activities, but we're all in the math group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.112,
    "end": 377.414,
    "text": "We're all in this learning journey together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.894,
    "end": 382.797,
    "text": "We've been striving to make the natural language descriptions for equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 383.84,
    "end": 387.463,
    "text": " So, that would be extremely, extremely helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.224,
    "end": 391.086,
    "text": "Every annotation that people can make is helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.647,
    "end": 395.51,
    "text": "People shouldn't feel abashed or ashamed to make any kind of contribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.53,
    "end": 400.715,
    "text": "It can always be reordered or edited by others, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 401.963,
    "end": 430.209,
    "text": " this is how we're going to create those like natural language descriptions of equations and ask questions about them even just copying and pasting what does this mean what does this mean they're all helpful contributions because this is very technical and it's not immediately apparent how for example these copious equations in chapter four relate to some of the broader discussions from the earlier chapters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 431.874,
    "end": 447.294,
    "text": " we'll get them okay if anyone has more questions to add they can do that or if they want to upvote questions feel free to do that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.502,
    "end": 454.644,
    "text": " It's motivating for other people when they see that their questions are being improved or other people are paying attention to their questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 455.384,
    "end": 458.685,
    "text": "So that's always something free and helpful that people can engage in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.166,
    "end": 466.127,
    "text": "Are beliefs policy or state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.107,
    "end": 475.489,
    "text": "If the person who asked it is here, they can feel free to address it because it's a very short",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.489,
    "end": 505.018,
    "text": " partially formed question I also wasn't sure whether this was using the CAD-CAD ontology which uses policy and state in a slightly different way but beliefs in a general sense coming from the Bayesian ontology are referring to any distributional expression Bayesian beliefs those are states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.557,
    "end": 528.227,
    "text": " policies in the actin fontology which you can just mouse over and find out it's a sequence of actions and policies are constructed or enumerated by the affordances the e vector that the generative model has",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.329,
    "end": 556.293,
    "text": " over a given time horizon so if it's able to go left or right over two time steps all the policies are left left left right right right right left um does anyone else just want to add anything else to this short question otherwise it's a fine clarifying question okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.427,
    "end": 577.535,
    "text": " In the discussion of active inference in POMDPs, the authors write, to update beliefs about policies, we find the posterior that minimizes the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.755,
    "end": 582.878,
    "text": "Does a posterior at time t become a prior at time t plus one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 585.319,
    "end": 586.1,
    "text": "What does anyone think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.994,
    "end": 610.176,
    "text": " I guess it depends on the specific posterior and prior, because that can mean multiple things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 610.296,
    "end": 626.219,
    "text": "But in the context of figure 4.3, I'd say it does, because we are updating our prior, which at the end of a time step becomes the posterior probability, which then is fed back as the prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 628.237,
    "end": 652.426,
    "text": " thanks totally agree with that uh there needs to be an initiating prior d which is shown with a three here in the discrete time and that is like the initial prior and then prior and posterior are referring to what incoming data so after the data at point one comes in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.544,
    "end": 660.288,
    "text": " the updated posterior is now playing the functional role of the prior for the next data point coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.308,
    "end": 672.136,
    "text": "Okay, then here's sort of a related question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.057,
    "end": 678.861,
    "text": "Well, we've addressed this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.37,
    "end": 706.184,
    "text": " question in the narrow sense but it would be very helpful to look through the order in which different topics are addressed in chapter four because these are some questions that are invoking things that are much later and we don't assume that people have high or low comprehension of this chapter yet but many of these questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.556,
    "end": 728.788,
    "text": " it's really important that we understand like why we're bringing them up so let's just walk through very quickly the chapter to see why they're bringing up things in a different order in terms of looking at the figures and formalism 4.1 is returning to bayes theorem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.109,
    "end": 733.851,
    "text": " And I think this is a really nice representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.792,
    "end": 738.254,
    "text": "Here's the joint distribution of X and Y, the hidden states and the observables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.615,
    "end": 757.126,
    "text": "And it's like it gets split up into Y conditioned on X and X. So this is like the probability, the joint distribution of the coin flip and the die is the distribution of the coin flip",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.735,
    "end": 785.515,
    "text": " conditioned upon the die and the die itself so it's just separating out a joint distribution and that's the heart of bayes theorem this is a key move to move an integration problem a sum in the discrete case or an integration problem in the continuous case into an optimization problem which permits incremental solutions of improving quality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.425,
    "end": 808.918,
    "text": " unlike an integration problem which you might just be tallying up numbers and not necessarily moving closer to knowing when you're done with that integral they introduced Jensen's inequality which is the log of the average is always greater or equal to the average of a log and that's true for any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.928,
    "end": 839.327,
    "text": " shape that has this kind of a curve anything where there's a decreasing curve and here's where that gets applied above we had this taking this joint distribution multiplying it by an arbitrary distribution divided by itself so that's one whatever q is later q will play a more specific role",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.765,
    "end": 844.887,
    "text": " And then here, the expectation is inside the log.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.707,
    "end": 848.828,
    "text": "Here, the expectation is over the log itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.729,
    "end": 866.976,
    "text": "So the one that we'd really want would be like the joint distribution, would be like the expectation of the joint distribution divided by some function queue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.028,
    "end": 895.964,
    "text": " jensen's inequality allows us to make this uh instead of an equal sign make a greater than an equal sign and then pull the expectation out and utilize that as the negative free energy which is going to be bounding us on this one that we would truly want but going about it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.085,
    "end": 924.961,
    "text": " by using this nice feature of the natural log Bayes theorem in the logarithmic form and anyone can totally raise their hand and add details allows rearrangement into this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.226,
    "end": 946.876,
    "text": " form which is already recalling the free energy that we saw from variational free energy from from equation 2.5 more details to be filled in and that's why we want to be annotating these equations and so on generative models is the name of this chapter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.701,
    "end": 972.704,
    "text": " calculate free energy we need three things data variational distribution family and a generative model which at minimum is composing of the prior and the likelihood they're going to be describing two different kinds of generative models this is a really nice and intuitive graphic for those who might have different familiarity with statistical representations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.481,
    "end": 1000.875,
    "text": " the circles are random variables and the squares are probability distributions describing relationships these are some Bayes graphs that are simpler and less action involved then this canonical active representation where PI is policy and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.533,
    "end": 1005.436,
    "text": " And so, yeah, Jakob, you wrote three is the B matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1006.237,
    "end": 1007.378,
    "text": "Yes, it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.018,
    "end": 1011.221,
    "text": "There's like these threes are the B matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.762,
    "end": 1015.544,
    "text": "But this is the D letter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.146,
    "end": 1021.129,
    "text": "So I agree, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.83,
    "end": 1024.311,
    "text": "Sorry, which one is the D letter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1025.052,
    "end": 1025.632,
    "text": "The first three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1026.173,
    "end": 1026.353,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.374,
    "end": 1054.697,
    "text": " because they're playing similar roles but they're a little bit i mean or what do you think about that yeah i guess i mean i was thinking about it as this being just one snapshot of like an infinite um factor graph so i mean just the fact that it's um assigned the p of s tau plus one given s tau and pi",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.158,
    "end": 1071.041,
    "text": " I understand what you mean by saying that it's kind of like it plays the role of being... Yeah, I'm not entirely sure though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.222,
    "end": 1077.043,
    "text": "We'll come back to this because there's actually a few other interesting notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.943,
    "end": 1086.925,
    "text": "So this is kind of the simplest of the graphs that they describe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.269,
    "end": 1091.892,
    "text": " This is like one variable influencing another variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.194,
    "end": 1110.292,
    "text": "This is like two factors z and x influencing y. So, 2 is like a little factory that outputs y conditioned upon the state of x and z.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.307,
    "end": 1127.752,
    "text": " So knowing this notation and how to read these directed graphs is relatively essential for interpreting more complex graphs that involve actions and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.073,
    "end": 1138.636,
    "text": "Here's X as like an upstream hidden cause that influences two downstream variables that don't influence each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.117,
    "end": 1150.66,
    "text": " And here is like hierarchical model where V influences X and X influences Y. Does anyone have like thoughts or questions about this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.909,
    "end": 1163.87,
    "text": " This is a graphical probabilistic model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.29,
    "end": 1168.852,
    "text": "The variables are stochastic or they're statistical random variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.772,
    "end": 1170.833,
    "text": "And it's a graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.433,
    "end": 1179.457,
    "text": "It's consisting of nodes and edges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1179.477,
    "end": 1189.741,
    "text": "4.3 is going to introduce these two basic forms of the generative model dynamic through time used in ACT-INF in the factor graph form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.346,
    "end": 1197.649,
    "text": " Does anyone want to describe what they see in this figure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.259,
    "end": 1211.981,
    "text": "The top is in the discrete time case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.443,
    "end": 1217.366,
    "text": "S is the hidden state, temperature of the room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.547,
    "end": 1221.79,
    "text": "O are the observations, the thermometer readings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.393,
    "end": 1230.696,
    "text": " The two is the relationship between the temperature in the room and the readings of the thermometer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.896,
    "end": 1237.198,
    "text": "Three is how the temperature is changing through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1239.499,
    "end": 1249.883,
    "text": "And then it is just like Jakob said, it's kind of like here, we can think of this as being like a little bit of a snippet from this infinite sequence of temperatures through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.384,
    "end": 1251.464,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.231,
    "end": 1278.633,
    "text": " in practice there has to be an initiating prior pi are policies policies are sequences of actions sequences of affordances that are concatenated over some time horizon that's what we're evaluating like expected free energy on and policies represent causal impact in the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1280.069,
    "end": 1307.579,
    "text": " we can look at this graph which is why this is an importance prerequisite to understand because the way in which policies influence the world isn't like by taking the temperature and like just changing it to a different value it's changing three which is how the temperature changes through time any thoughts on the discrete time formalism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.079,
    "end": 1314.539,
    "text": " Yes, Mike.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1319.982,
    "end": 1324.224,
    "text": "So as represented in this figure, the policy is not changing over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1324.244,
    "end": 1325.005,
    "text": "Is that correct?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1327.486,
    "end": 1334.69,
    "text": "The set of policies in this figure is not changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.921,
    "end": 1341.062,
    "text": " It's not that it can't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.162,
    "end": 1346.725,
    "text": "This is just only showing two steps of some policy being applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.265,
    "end": 1348.906,
    "text": "Yeah, just the way it is in this figure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1349.406,
    "end": 1363.114,
    "text": "So if we were to maybe extend this figure with two more of the bottom section, we could also extend policy and have that changing over time and feeding into that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1365.816,
    "end": 1367.537,
    "text": "Yes, and that's actually one of the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.792,
    "end": 1393.713,
    "text": " amazing and interesting things about this graphical representation is we can say okay well let's carry out this s to five more time steps and then let's have pi 1 implemented here and then let's have it do pi 2 here and it's kind of like if you can draw it you can do it and that's very important work from de Vries and Friston and Parr",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.687,
    "end": 1423.004,
    "text": " from around five years ago was demonstrating that if the Bayes graph can be drawn that there's a 40 factor graph representation and where there's the 40 factor graph representation there's a attractable variational message passing approximation I don't know exactly what the guide rails are for like are there graphs that can't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.451,
    "end": 1439.735,
    "text": " be amenable to message passing and et cetera, but just at a first pass for graphs that look like this, they can be drawn and more variables can be added and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.215,
    "end": 1445.656,
    "text": "So it's kind of like a visual code for probabilistic graphical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.454,
    "end": 1455.396,
    "text": " So maybe that's a fun exercise is like to think about causal inference in our day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.236,
    "end": 1462.278,
    "text": "Like the temperature in my room is being influenced by like whether the air conditioner is running in the other room and the temperature outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.418,
    "end": 1466.259,
    "text": "Which one of these scenarios does it model onto?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.78,
    "end": 1473.862,
    "text": "And just kind of taking scenarios that are familiar to us and then separating them in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.96,
    "end": 1476.681,
    "text": " How are the hidden states changing through time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.941,
    "end": 1477.921,
    "text": "What are the observations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.621,
    "end": 1480.962,
    "text": "What policies influence how hidden states change through time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.983,
    "end": 1490.746,
    "text": "But this is going to be an interesting different view on the bottom here with the continuous time model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.567,
    "end": 1495.568,
    "text": "Does anyone want to describe the continuous time variant?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.276,
    "end": 1518.265,
    "text": " Also, one interesting piece here is in the live streams that we just did over the last few weeks, 46, they make a clear distinguishing between DAI, Decision Active Inference, and MAI, Motor Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.325,
    "end": 1533.635,
    "text": "And beyond just modeling cognitive decision-making versus motor reflex arcs, they also highlight how the DAI is a discrete time model that's using the POMDP, while the motor models tended to use continuous time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.474,
    "end": 1545.82,
    "text": " So they're laying out and also kind of generalizing to show the similarities between these two different variants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.78,
    "end": 1551.863,
    "text": "And we can use the notation concordance table to like highlight some of those parallels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1554.184,
    "end": 1560.707,
    "text": "This is where the Taylor series approximation comes in and the generalized coordinates of motion, though they can also be applied to the discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.068,
    "end": 1562.268,
    "text": "Here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.476,
    "end": 1568.979,
    "text": " we have x, x prime and x double prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1570.34,
    "end": 1573.641,
    "text": "The prime notation indicates temporal derivatives and second derivatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1576.503,
    "end": 1584.687,
    "text": "If anyone has a thought on that, feel free, because this is not doing time series prediction in the same way that the POMDP is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.748,
    "end": 1589.69,
    "text": "The POMDP is in the memory of the program,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.001,
    "end": 1613.809,
    "text": " there's a value at the previous state the current state and the next state and however many other states in the time horizon the way that a continuous time taylor series approximation is dealing with reduction of uncertainty about future data is quite different than the way that these discrete time models are doing so what's happening here is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1616.452,
    "end": 1623.255,
    "text": " the value of the function at now is being estimated or provided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.615,
    "end": 1627.936,
    "text": "Then the first derivative is calculated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.716,
    "end": 1643.402,
    "text": "So here, three has the same structure, but whereas this is the hidden state at the next time point, conditioned upon the hidden state at this time point and the policy, here's the derivative of x.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.761,
    "end": 1673.783,
    "text": " conditioned upon x and the policy v v also has a slightly different interpretation because it's not sequence of events either um and analogously for the second derivative and the higher derivatives so they're still emitting observations but these are not observations at future time points in the same way and that is visualized in this box 4.2",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.799,
    "end": 1681.821,
    "text": " So here is X of T at time T. So this is like the way that the time series is going to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.041,
    "end": 1686.462,
    "text": "X of T is just this value here, you know, five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1689.162,
    "end": 1698.825,
    "text": "The first term being added in the Taylor series expansion is the first derivative, rate of change at that X zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.705,
    "end": 1703.566,
    "text": "That's giving you a better approximation through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.758,
    "end": 1726.517,
    "text": " then the second derivative adds this quadratic feature and so taylor series converge closer and closer moving further and further away from the target point as they include higher and higher derivatives but there isn't an um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.639,
    "end": 1735.726,
    "text": " there isn't an explicit calculation in the Taylor series of like, let's just say this is like, you know, one, two, three time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1736.627,
    "end": 1741.231,
    "text": "It's not like, well, what is going to happen at three time steps from now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.392,
    "end": 1746.956,
    "text": "The Taylor series could then be plugged in with three to calculate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.818,
    "end": 1750.559,
    "text": "However, this is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1752.615,
    "end": 1770.178,
    "text": " um calculating x x prime x double prime at t equals three it's calculating it for x sub zero and then using this expansion to achieve reduction of uncertainty of more and more distal points",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.693,
    "end": 1792.547,
    "text": " So that's quite interesting and it's, again, it's an extremely different way of doing time series prediction in the continuous time framework than this kind of explicit consideration of past, present, and future state values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.209,
    "end": 1797.871,
    "text": "Okay, any other thoughts on 4.3?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.591,
    "end": 1800.673,
    "text": "Because this is one of the most key figures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1802.503,
    "end": 1804.794,
    "text": " But the things we can explore and ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.075,
    "end": 1805.216,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.739,
    "end": 1818.166,
    "text": " About this figure on page 69, it says the relationship between a state and its temporal derivative here depends on slowly varying causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.067,
    "end": 1834.299,
    "text": "I just wanted to make sure, does this mean this slowly varying causes here is used to account for the fluctuations or it has some different meaning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.46,
    "end": 1837.321,
    "text": "Slowly varying causes here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.487,
    "end": 1870.113,
    "text": " so policies are influencing the causal unfolding of states in this discrete formalization here in the continuous time setting the very the cause slowly varying causes more slowly than these changes play a similar role to policies above",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.971,
    "end": 1880.613,
    "text": " So these causes intervene in how the derivatives are calculated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.915,
    "end": 1904.461,
    "text": "No, I mean, here in the discrete time, well, obviously we have, we can say stable policies that don't change through time, but in the continuous time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.861,
    "end": 1918.949,
    "text": " Well, I don't know, at least that was my understanding, that the policies can slightly change, but the change can be somehow negligible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.59,
    "end": 1926.774,
    "text": "And, well, that's because of the additional term for fluctuations in the equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.795,
    "end": 1934.839,
    "text": "And they don't necessarily affect the main components of the equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.869,
    "end": 1965.242,
    "text": " one could set it up so that the policies are ineffectual so that the state changes through time are with their own endogenous dynamics not influenced by policy or one could imagine a situation where the states don't change at all through time and their changes are entirely driven by policy and i think analogously there could be a setting in which the derivative of x",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.756,
    "end": 1990.371,
    "text": " is hardly influenced by these v slowly varying causes or v might entirely describe the derivatives of x but i'm not sure if just at this level of generality we can allocate importance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.27,
    "end": 2003.858,
    "text": " to kind of the endogenous dynamics or like sort of the policy independent changes, just the way that those states are changing or analogously derivatives are calculated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.161,
    "end": 2008.422,
    "text": "But that's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.882,
    "end": 2009.943,
    "text": "Lyle, and then Mike.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.904,
    "end": 2021.131,
    "text": "Yeah, this might be just slightly off topic, but the tools, if you're using a multi-mode simulation tool,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2022.423,
    "end": 2031.509,
    "text": " then it can handle both in some sense, it's going to try and solve both continuous formulations and discrete time formulation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2031.569,
    "end": 2038.514,
    "text": "So one they would typically call agent based and the other would be ODE based or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2039.294,
    "end": 2049.021,
    "text": "Just the way that they do that is a little bit of sleight of hand because of course they're not solving the equations per se, they're estimating the solutions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2049.77,
    "end": 2067.082,
    "text": " And they always, if you have that, then if you have a slowly changing set of parameters, like you might model with the discrete case, then you've got an event queue and those events are however far apart they need to be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2067.743,
    "end": 2078.23,
    "text": "Then to estimate the continuous form, they simply set that delta T, delta T goes to zero in some sense, never goes in the software exactly to zero, but then",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2078.792,
    "end": 2086.518,
    "text": " you compress that delta T down to very small time slices, and then you have estimated your continuous form.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2087.399,
    "end": 2099.649,
    "text": "And so by doing that, you can really have a pretty comprehensive way to represent both cases in the same modeling environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2099.669,
    "end": 2100.029,
    "text": "Yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2102.947,
    "end": 2129.055,
    "text": " great point um numerical approximations to continuous processes can be done through breaking them down into discrete processes and then making sure that as your delta t is getting smaller and smaller that you're getting a convergent estimator the approach that's taken analytically here is to use a taylor series approximation mike",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.488,
    "end": 2144.136,
    "text": " And so in thinking about how we should build the mental model of the Taylor series approximation or incorporate that in our model, that's one example of how you might capture the time series structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2145.537,
    "end": 2154.543,
    "text": "And you could potentially substitute in other approaches to maybe capture finer detail or discrete events that might occur on the series.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2158.206,
    "end": 2158.566,
    "text": "Like what?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2161.384,
    "end": 2171.694,
    "text": " like Loez decomposition or something like that, where you're taking apart components of the time series, things like trend, seasonality, discrete events?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2173.816,
    "end": 2183.906,
    "text": "Yes, I think the analytical comparisons would be tight or loose, but Kalman filter, generalized Bayesian filtering, splines,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2185.92,
    "end": 2187.261,
    "text": " time series decomposition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.161,
    "end": 2193.585,
    "text": "These are all in the category or in the genre of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2195.706,
    "end": 2195.946,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.908,
    "end": 2202.77,
    "text": "By the way, Lionel, thanks for the clarification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.79,
    "end": 2204.011,
    "text": "That was really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.712,
    "end": 2211.115,
    "text": "Well, to ask my question more explicitly, on page 78, equation 4.15,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2215.657,
    "end": 2225.481,
    "text": " We have some additional omega terms which are defined as stochastic fluctuations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.821,
    "end": 2234.724,
    "text": "My question was that, is the term slightly varying somehow related to these stochastic fluctuations or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.985,
    "end": 2243.868,
    "text": "Yes, I believe that the slowly varying is in relationship to it being included with the flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.014,
    "end": 2273.448,
    "text": " component rather than with the um at that time scale stochastic more thermal like vibration and that was explored in like live stream 45 with free energy principle made simpler but not too simple um with this idea of um the langvin and how physics and mechanics are predicated upon the separation into flow like actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.629,
    "end": 2290.772,
    "text": " a given scale and then stochastic non-flow aligned changes and the path of least action is when the the limit of the the stochastic term going to zero",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.884,
    "end": 2294.385,
    "text": " But let's come there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.987,
    "end": 2304.434,
    "text": "As people can see, even though it's like, we could totally read this like 20 times, and it still is like, why is the next word there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.555,
    "end": 2305.696,
    "text": "Why is the next equation there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.736,
    "end": 2316.125,
    "text": "But okay, they're introducing these two types of generative models that have like kind of tantalizing isomorphisms, but also very interesting differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.606,
    "end": 2319.288,
    "text": "They're going to first focus on the discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.995,
    "end": 2348.83,
    "text": " um the partially observable markov decision process formalism is used someone asked like why is the categorical notation used it just allows it it makes it easy to look at a matrix and to interpret the matrix as like a confusion matrix not just a matrix that is confusing like they can be but one that has to do with like a coin flip so categorical outcomes um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.071,
    "end": 2379.331,
    "text": " the uh three nodes are the transition function here in the categorical context between different states that's this b and here's where we see the d the prior over the initial state and b and together these account for the three nodes in figure 4.3 they play a functionally similar role here's where they get distinguished",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.47,
    "end": 2401.768,
    "text": " selecting between models of behavior and that was another question which maybe we could get to um requires selection amongst these categorically discrete plans and then the softmax normalizes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.072,
    "end": 2429.433,
    "text": " and ensures that the probability over those policies is normalized so that they can be understood as a probability distribution okay a categorical probability distribution here's the expected free energy that we've seen before more on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.546,
    "end": 2457.737,
    "text": " expected free energy specifically on how this kl divergence term which as we talked about last week was about how the preferred states are realized active inference uses f and g they're related but they play different roles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.039,
    "end": 2462.702,
    "text": " VFE, F, is the primary quantity minimized over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.062,
    "end": 2472.068,
    "text": "That was interesting to read because EFE is what is minimized prospectively through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2474.269,
    "end": 2483.416,
    "text": "Whereas here, the claim is that variational free energy is what is minimized over time in relationship to generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.357,
    "end": 2488.219,
    "text": "So again, more could be explored there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.481,
    "end": 2518.375,
    "text": " they're going to focus on a rearrangement of equation 2.6 here with the ambiguity and risk being juxtaposed with the informational value information gain info max and pragmatic value they then move into the linear algebraic form where the bolds",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.522,
    "end": 2524.762,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2527.323,
    "end": 2537.185,
    "text": "I don't know if bold is used in the same way in this appendix as it is in these equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.425,
    "end": 2543.126,
    "text": "Does anyone know about what bold means here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.266,
    "end": 2544.307,
    "text": "It could mean the vector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.667,
    "end": 2545.827,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.455,
    "end": 2554.698,
    "text": " Yes, I also think bold most probably means vector or matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.339,
    "end": 2556.599,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2558.361,
    "end": 2565.625,
    "text": "It gets pretty subtle though sometimes because there's times where there's italics, bold, and neutral being used very closely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2565.645,
    "end": 2570.028,
    "text": "When they're used closely, it can be confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.048,
    "end": 2573.209,
    "text": "And then when they're used not closely, it's hard to juxtapose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2573.229,
    "end": 2574.05,
    "text": "More",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.431,
    "end": 2586.436,
    "text": " Expected free energy rewriting within the linear algebraic form, softmax.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.578,
    "end": 2589.619,
    "text": "Bringing back the logs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.121,
    "end": 2595.483,
    "text": "Variational inference rests upon factorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.024,
    "end": 2599.126,
    "text": "That's related to the sparsity of the Bayes graph, Moritz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2602.423,
    "end": 2610.286,
    "text": " Hey, so just going to 4.10 again, I was wondering what's the use of the categorical distribution here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2610.306,
    "end": 2617.388,
    "text": "Because maybe I missed it, but it's not really explained in the text what they use it for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2617.408,
    "end": 2626.631,
    "text": "There's one sentence saying, oh, yeah, the fifth line shows that the prior belief about observation is a categorical distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2627.952,
    "end": 2628.612,
    "text": "What is it for?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2628.692,
    "end": 2629.352,
    "text": "What does it do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2629.712,
    "end": 2631.453,
    "text": "I've never seen it before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2639.195,
    "end": 2642.156,
    "text": " I don't know if it has to be categorical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2642.176,
    "end": 2661.28,
    "text": "A preference distribution could be a continuous function, but here it's just simpler, perhaps, to show it as a categorical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.68,
    "end": 2664.641,
    "text": "There's two outcomes, having the food and not having the food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.437,
    "end": 2687.564,
    "text": " so then that's a categorical distribution of preferences and of observations so they're just modeling a situation where there's categorical differences that are being preferred as opposed to like a preference over some continuous distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.572,
    "end": 2692.113,
    "text": " Does that address it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.193,
    "end": 2699.717,
    "text": "They're just modeling a situation where there's a categorical difference with observations and with preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.618,
    "end": 2705.621,
    "text": "Just because like mathematically it's easier now to start with that or like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.826,
    "end": 2736.146,
    "text": " yeah i think didactically it's a lot clearer because you can see like a two by two matrix did i observe the food or not did i get the food or not instead of like a distribution of temperature preference and a distribution of observations i'd expect that the formalism will work out the same in the sense that you're still minimizing your surprisal and you're still performing distribution matching",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.145,
    "end": 2745.509,
    "text": " but also this is like a distribution matching in a categorical context that has an interpretation of almost like false positive and false negative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.211,
    "end": 2751.012,
    "text": "All right, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2751.392,
    "end": 2752.072,
    "text": "I will go with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.092,
    "end": 2753.333,
    "text": "Thank you for the explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2754.013,
    "end": 2755.834,
    "text": "Yeah, it's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.854,
    "end": 2761.517,
    "text": "And I mean, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.697,
    "end": 2765.139,
    "text": "The matrices help connect to the linear algebra, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.311,
    "end": 2793.57,
    "text": " and the matlab representations and also just to like sort of match or no match like in 46 the example had to do with like wanting ice cream and then they observed ice cream or not okay p-o-m-d-p and also like where does this eta we'll come back to that another time but just to kind of get through it all the first pass",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2795.168,
    "end": 2797.389,
    "text": " More details on a POMDP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.87,
    "end": 2804.751,
    "text": "S and V. Auxiliary variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.531,
    "end": 2809.932,
    "text": "I don't think this is the V here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.753,
    "end": 2814.454,
    "text": "Because we're in the POMDP setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.354,
    "end": 2823.216,
    "text": "So it's just an auxiliary variable used as sort of a analytical convenience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.737,
    "end": 2854.413,
    "text": " that concludes their discussion of the discrete time model into continuous time but first they describe again Markov blankets and take kind of a second pass the blankets are the causes of X upstream which are parents and the children and the parents of the children the kind of co-influencers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.519,
    "end": 2888.006,
    "text": " course there's more to say but that's what the um pearl definition is how that gets mapped to sense and action states and what influences what what's in the blanket on the blanket etc those are model specific and then here are two common um message passing schemes that are used for approximate inference unless the base graph is fully connected there is a markov partitioning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.707,
    "end": 2891.168,
    "text": " Here, this is pretty funny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.628,
    "end": 2895.19,
    "text": "NB, note bene, good note, good note to note.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.73,
    "end": 2908.896,
    "text": "The slightly non-standard use of the expectation operator, perhaps by overloading it with a massive subscript, but it's unclear what exactly they meant there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.44,
    "end": 2930.476,
    "text": " is showing alignment between these two different schemes but there's definitely citations to go into more into detail on like belief propagation and message passing inactive and then we see several of these um figures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.039,
    "end": 2957.413,
    "text": " Personally, I think it's slightly challenging to understand whether this is being used illustratively or whether these specific topologies are as directly interpretable as these topologies are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.196,
    "end": 2968.241,
    "text": "But here we see kind of, if you blur your eyes, here's policy at the top",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.602,
    "end": 2971.103,
    "text": " Here's the observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.564,
    "end": 2973.765,
    "text": "Here's time minus one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.106,
    "end": 2978.549,
    "text": "Here's s minus t minus one, t and t plus one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.77,
    "end": 2986.275,
    "text": "So we can see some resonances with 4.3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.897,
    "end": 2990.318,
    "text": "But now we're in the continuous time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.06,
    "end": 2994.581,
    "text": "Motor active inference from 46.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.74,
    "end": 3004.044,
    "text": " is justifying the use of continuous time based upon the continuous unrolling aspect of sensory input and motor output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.145,
    "end": 3011.867,
    "text": "They're going to start in a different place than they did with the POMDP model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3013.488,
    "end": 3017.59,
    "text": "In this case, we have much more of a physics grounding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.877,
    "end": 3024.021,
    "text": " Again, check out live stream number 45 to see about the Langvin and how this is connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.782,
    "end": 3034.37,
    "text": "But this is a much more physics-based grounding in terms of like a flow operator and a stochastic term at a given timescale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.052,
    "end": 3041.396,
    "text": "The stochastic term",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.118,
    "end": 3045.799,
    "text": " is assumed to have a normal distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3046.339,
    "end": 3048.82,
    "text": "And that kind of relates to like what Mike said about detrending.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.421,
    "end": 3066.868,
    "text": "Like one can think of this stochastic term as being what happens when you've detrended all of the signal that's non-Gaussian out, you're left with like the residuals which have a Gaussian nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3069.149,
    "end": 3071.15,
    "text": "Precision is capital Pi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.406,
    "end": 3097.908,
    "text": " that's the inverse of the fluctuation and so that's they're going to connect that to the common filtering here we return again to the generalized coordinates motion um coming from this taylor series approximation route so if somebody said i have 10 numbers and we need to predict 10 years in the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.953,
    "end": 3103.155,
    "text": " The discrete time way would be like, well, let's try to predict it at each of those 10 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.036,
    "end": 3105.476,
    "text": "And those will be your 10 numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3106.537,
    "end": 3118.704,
    "text": "The generalized coordinates of motions approach, which we explored the most in live stream number 26 with DaCosta et al in Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.665,
    "end": 3124.387,
    "text": "The 10 numbers could be like the value today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.356,
    "end": 3131.597,
    "text": " And the derivative today, the second derivative and the third and the fourth and the fifth, up to however many, that's the generalized coordinates of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.457,
    "end": 3136.938,
    "text": "So it's like a snapshot of the process and all of its higher derivatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.239,
    "end": 3153.762,
    "text": "And so the generalized coordinates of motion are very similar to Taylor series approximations in how they represent centered at a certain point X naught, how one expects as movement happens away from that X naught,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.325,
    "end": 3182.306,
    "text": " reducing surprise and so here is like x with a dot on top is the change in x and then this is like the derivative of the change in x and so on here the tilde notation is used for the generalized coordinates of motion so we see this equation which was just for one value like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.063,
    "end": 3186.184,
    "text": " where you are on the freeway, you know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.024,
    "end": 3189.385,
    "text": "And then this is the generalized coordinates of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.167,
    "end": 3204.231,
    "text": "The free energy is written down for this generalized coordinates of motion with precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.191,
    "end": 3211.794,
    "text": "Here, the closest that we came to exploring it was in 43 on predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.362,
    "end": 3247.099,
    "text": " there's some more details on Gaussian the relationship between like Gaussian processes and also I think Lyle brought up this like sort of mode and multi-mode simulations this is modeling a single mode not that it can't model a bimodal distribution but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.038,
    "end": 3274.371,
    "text": " this is where the Laplace approximation comes into play this is potentially even unnecessarily complex but it's there and the Laplace approximation is fitting a quadratic distribution that tracks the mode",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.539,
    "end": 3305.844,
    "text": " so like the highest point on the distribution and then it fits a parabola around that here is more details on the hierarchical nature and the kind of multi-time scale nature that's implied ultimately by the Langvin",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.352,
    "end": 3335.648,
    "text": " and then there's a a it'd be good to juxtapose figure four six and four four to see how they're similar and different but here we see message passing happening on the generalized predictive coding architecture and that was like explored a lot more not with this exact figure but this was explored more from like an analytical and empirical perspective in 43.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.584,
    "end": 3366.557,
    "text": " then there's an abrupt ending but the following chapters are going to appeal to the formalisms and apply them so any thoughts or ideas on chapter four as we close out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3368.314,
    "end": 3391.808,
    "text": " and hopefully next week we can have um a lot of questions and things like that even basic questions it's like if the if you read it and you understood it then it'd be awesome to contribute a question that would explore someone else's understanding or prompt towards how you thought about it in a way that made sense for you and if you don't understand it then just ask the question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.468,
    "end": 3405.569,
    "text": " Ali, and then anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.711,
    "end": 3418.938,
    "text": "I just wanted to briefly mention an additional point related to the question about the reason behind using the categorical distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.659,
    "end": 3420.199,
    "text": "On page 74, it says,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.322,
    "end": 3432.526,
    "text": " The fifth line shows that the prior belief about the observations is a categorical distribution whose sufficient statistics are given in the C vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.826,
    "end": 3444.572,
    "text": "I think here sufficient statistics is the key term to understand the reason behind using categorical distributions, because for insufficient, insufficient statistics, we don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.732,
    "end": 3451.214,
    "text": " necessarily use the exact modeling or distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.315,
    "end": 3463.34,
    "text": "Instead, we use a substituted statistics that is simple enough to calculate and also close enough to the actual data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.84,
    "end": 3470.463,
    "text": "So I think that can help in understanding the reason behind that decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.185,
    "end": 3497.161,
    "text": " good point and this is definitely a a technical note but um is it fair to say that like the mean and the variance are sufficient statistics for a gaussian distribution uh yes i think so so like that's one of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3499.619,
    "end": 3525.686,
    "text": " perhaps proximate mechanisms by which the Laplace approximation and variational inference more generally are able to deal with arbitrary true distributions by fitting a family of distributions that have tractable optimization structure and a vastly reduced set of sufficient statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3526.749,
    "end": 3538.897,
    "text": " If you had even just a simple bimodal distribution, well, there'd be like the location of the two peaks, the relative heights of the two peaks, the skewedness and all the, you can have many, many parameters needed to describe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.659,
    "end": 3547.363,
    "text": "In contrast, the Laplace approximation only requires the location of the mode and the variance estimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.324,
    "end": 3554.308,
    "text": "And so where that's adequate, it's simple and fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.868,
    "end": 3585.233,
    "text": " where it's inadequate you'll at least know because you'll continue to be surprised at new observations coming in okay any final comments on this chapter four part one definitely a challenging though interesting chapter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.884,
    "end": 3616.122,
    "text": " and it really is at the heart of Aktiv and as we hopefully explored a little bit today it includes like basic intuition pumps as well as some Rosetta Stone like representations and many many equations which I hope we can unpack",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3617.253,
    "end": 3641.933,
    "text": " so could someone explain it in simple words it's what we've been asking for every single equation and it's something that everyone can contribute to all right well looking forward to people's edits over the coming week and additions and uh we'll come back in one week for part two on four",
    "speaker": "SPEAKER_01"
  }
]