[
  {
    "start": 7.085,
    "end": 35.488,
    "text": " hello welcome everyone hi it is greetings it's may 23rd 2025 and we're an active inference guest stream 109.1 with alexander hemming presenting some shared work on emotional attention and predictive processing so alexander thank you for joining looking forward to your presentation and anyone watching live please feel free to write questions in the live chat during so thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.565,
    "end": 37.586,
    "text": " Okay, sweet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.606,
    "end": 39.609,
    "text": "So emotional attention and predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.97,
    "end": 52.705,
    "text": "For the actual presentation, I'll go through an introduction, a foundations of attentional narrowing, then a understanding of the neurology and a connection between the attentional narrowing and the predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.606,
    "end": 57.871,
    "text": "I'll run through some computational models, so it'll give a more holistic understanding of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.112,
    "end": 63.298,
    "text": "And then we'll go through a discussion, which will include the applications and future directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.865,
    "end": 65.666,
    "text": " So this is the team.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.166,
    "end": 68.348,
    "text": "At the moment, I've got me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.069,
    "end": 72.112,
    "text": "There's a co-author for a book I'm writing as well called Dylan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.412,
    "end": 79.799,
    "text": "And then there's Kirsten, who is a psychology researcher at the University of Birmingham.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.819,
    "end": 81.441,
    "text": "So this is a project that we're working on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.661,
    "end": 82.842,
    "text": "I'm going to briefly talk about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.862,
    "end": 85.125,
    "text": "This is a book that me and Dylan are working on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.185,
    "end": 91.851,
    "text": "We're using predictive processing and active inference to understand the basis for how ideologies are formed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.067,
    "end": 100.4,
    "text": " kind of from a foundational way, building up to pretty much all the differences in politics, but it's difficult to go into at this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.082,
    "end": 103.385,
    "text": "If anyone has any questions about this, happy to answer as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.968,
    "end": 109.435,
    "text": "So introducing the idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.326,
    "end": 123.466,
    "text": " Here, we have the whole idea, which is, in a sense, when you have a prediction and the prediction error goes wrong about something which is very emotional, then you tend to have an emotional salience of attentional narrowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 124.167,
    "end": 127.873,
    "text": "So the threat uncertainty creates a predictive error minimization process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.394,
    "end": 137.768,
    "text": "But that also creates a neuromodulation of a temperature parameter, which then creates a narrowing effect so you consider fewer alternatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.055,
    "end": 152.932,
    "text": " The thesis aims are to kind of create more of a unified understanding of the brain by adding together more of an understanding of what the actual parameters in the active inference equations link to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.112,
    "end": 158.7,
    "text": "It's connecting it between a lot of different disciplines to try and understand more of how this works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.082,
    "end": 162.706,
    "text": "Affect-based attention is one of the most prime parts of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.946,
    "end": 169.375,
    "text": "It's how does emotionally salient information go through a Bayesian distribution to try and make a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.962,
    "end": 177.935,
    "text": " different precision weighting compared to more calculated predictions, which is the normal direction of predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 177.955,
    "end": 187.671,
    "text": "The research gap is predominantly about the lack of a link between processes such as dominant response facilitation and attentional narrowing and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.272,
    "end": 196.425,
    "text": "And so using those two together, it aims at addressing things which have not really been talked about, but also connecting a lot of this together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.468,
    "end": 202.221,
    "text": " I'm running through quite a lot because we have quite a few slides in the time, but the foundation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.765,
    "end": 212.288,
    "text": "So it starts originally in the 1908 theory of the Yerkes-Dodson inverse U graph, which many people might know from A-level psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 212.96,
    "end": 236.098,
    "text": " uh well that's a uk thing but uh yeah and the idea is if you have a certain amount of pressure then your most reinforced responses will be facilitated so let's say you're playing piano in front of an audience and you've been practicing for a very long time you'll actually improve your performance of playing the piano until the stress gets so high that you choke and you do even worse than you did before this went on to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.821,
    "end": 242.412,
    "text": " be understood by Easterbrook as not just all arousal creates that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.452,
    "end": 248.003,
    "text": "It's not excitement which creates this attentional narrowing process, but it's actually a negative effect for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 248.023,
    "end": 252.692,
    "text": "So it's the uncertainty of some form of threat will then create a form of pressure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.073,
    "end": 256.5,
    "text": "This form of pressure then facilitates a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.037,
    "end": 259.42,
    "text": " a lack of consideration to alternatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.76,
    "end": 265.688,
    "text": "It's kind of automatic when it goes into the dominant response facilitation, but he also connects it to belief formation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.908,
    "end": 278.524,
    "text": "It's almost like a societal stress that facilitates a lack of consideration of alternatives when you're creating an ideology or a belief about certain concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.546,
    "end": 282.93,
    "text": "I've included a few references in the slides if anyone is interested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 283.331,
    "end": 286.875,
    "text": "There's quite a few more references, but some of them are a bit key.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.307,
    "end": 290.329,
    "text": " So why hierarchical predictive processing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.393,
    "end": 302.023,
    "text": "Well, this is more about the idea that it kind of like connects these things in a way where we can actually add to more of a predictive understanding of the brain as a whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.145,
    "end": 311.234,
    "text": "It allows for a significant magnitude between interaction between the social phenomena and the predictive mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.294,
    "end": 317.622,
    "text": "So anything which is dependent on motivational mechanisms has more of a ingrained understanding of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.492,
    "end": 325.02,
    "text": " So that's the attentional narrowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 325.04,
    "end": 333.111,
    "text": "And now we've got the neuroscience behind it, which is one thing which is very strongly researched is the neural gain and emotions as computations perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.052,
    "end": 341.523,
    "text": "We do know that having adrenaline in your system, it's a kind of a neuromodulator for these sorts of processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 341.763,
    "end": 347.271,
    "text": "And it does create this, what I'll show later to be the sigmoid function where the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 347.723,
    "end": 362.317,
    "text": " most reinforced, the most reinforced processes are strengthened and the the other ones which are more that you have a lower probability of transitioning into these states is reduced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.501,
    "end": 369.243,
    "text": "So this is also enhanced by prefrontal cortical inhibition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.044,
    "end": 376.33,
    "text": "So we do know that cortisol and catecholamines do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 376.698,
    "end": 386.531,
    "text": " increase the reactive to the reflexive type of actions, and they reduce the contemplative reflexive thought processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.791,
    "end": 399.027,
    "text": "This means that when you are under a lot of stress, it's difficult to contemplate and think clearly, but it's quite easy to react to sudden situations and do the most learnt and most reinforced",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.53,
    "end": 413.951,
    "text": " But it's more of an effective neuroscience look at things because it's opening and closing different pathways rather than something which is more ingrained in the computational neuroscience of seeing how excitable different neurons are, such as which would happen in the neural game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.412,
    "end": 423.105,
    "text": "So it's instead of resistance to stochastic resonance and noise, which affects each individual neuron, it would be more of a opening and closing of different pathways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 423.205,
    "end": 426.55,
    "text": "But it still has the same effect of the attentional narrowing mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.133,
    "end": 435.023,
    "text": " And as we can see from reflexive, it's more about the individual contemplative strategies of the individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 435.063,
    "end": 449.162,
    "text": "And as we can see from the reflexive, it's more about the reaction process, so it's it's more of a slow acting process when we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.632,
    "end": 452.779,
    "text": " kind of adrenaline rushing into our system and it affects the entire brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.219,
    "end": 469.834,
    "text": "So this is different to direct precision racing, which you would normally see inside policy selection mechanisms, because you have this idea that there's a different exploration exploitation dynamic in which you kind of focus on the things which are,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.814,
    "end": 471.237,
    "text": " the most expected to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.377,
    "end": 479.451,
    "text": "They become more salient and when something unexpected happens about these most expected situations, then you kind of focus on that and then you dive into that type of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.471,
    "end": 493.476,
    "text": "But that's such a specific dynamical process that it's not something you consider as universally affecting all areas of the brain in a very emergent way where you have an individual neuron",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.878,
    "end": 497.863,
    "text": " and the traits with those neurons actually affecting the dynamics of how the whole brain works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.963,
    "end": 501.668,
    "text": "It's more about the actual processes of how free energy works in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.371,
    "end": 506.534,
    "text": "So stress from prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.976,
    "end": 513.423,
    "text": "Emotional valence is the way in which you would kind of understand stress to come about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.563,
    "end": 518.569,
    "text": "If you have a negative emotional valence, then you would have an emotion which does not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.275,
    "end": 520.657,
    "text": " It's not pleasant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.897,
    "end": 527.104,
    "text": "It's something which is kind of like fear, anger, sadness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.645,
    "end": 529.087,
    "text": "These are all negative emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.327,
    "end": 539.299,
    "text": "And because of the least action principle, people go down the idea of you want to avoid the negatives and you want to reduce the amount of energy that reduces the amount of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.379,
    "end": 544.005,
    "text": "So all negatives were associated with a rate of change increase with free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.706,
    "end": 546.548,
    "text": "But the issue with that was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.068,
    "end": 555.821,
    "text": " When people use the idea of predictive error minimization, they tend to use the idea of everyone is always predicting everything and everything has to be a direct calculation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.863,
    "end": 559.426,
    "text": "And that has been an issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.408,
    "end": 571.244,
    "text": "The kind of like rationalizations people go about that is like if you're surprised by a present which a friend has given you, it has filled the prediction of a social expectation of you being given a present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.065,
    "end": 576.552,
    "text": "It doesn't necessarily have to be that type of rationalization, but you can see how these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.768,
    "end": 580.372,
    "text": " things don't seem to have much intuitive sense behind them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.972,
    "end": 599.492,
    "text": "And that's that's why when we have a Joffley's points, we delve into the idea of like when there's a prediction and it hasn't you predicted something, but it becomes worse to you than what you originally predicted, then that is still something you would say has negative emotional valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.512,
    "end": 601.234,
    "text": "And that's a very simple way of thinking about us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.814,
    "end": 603.636,
    "text": "But it still works in the way of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.173,
    "end": 615.105,
    "text": " Even though it's a negative to what you actually predicted, it is still an increase in free energy or predictive error mechanisms because you can understand that prediction might not be the best word for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.026,
    "end": 618.148,
    "text": "And a few people have written articles on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.628,
    "end": 628.819,
    "text": "One person has decided to determine that it's a instead of Bayesian priors, they say a Bayesian preference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.159,
    "end": 632.543,
    "text": "So it's a Bayesian prior distribution and a Bayesian preference distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.843,
    "end": 642.567,
    "text": " if we have the Bayesian prior distribution, we can have the idea that there is a calculated weighting of what you expect to happen based on your kind of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.053,
    "end": 670.123,
    "text": " uh prior uh opinion of that being that probability and it's very calculative it's very much on this understanding of what is observed is is real and you're trying to get around to what is actually an accurate representation of things but if you have certain sensory inputs and they might just be like uh i'm hungry i need this and as as if people know about the dark room uh situation that doesn't always add up in the way that people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.015,
    "end": 677.041,
    "text": " understand how motivation works in the way that prediction is accounting for the hunger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.762,
    "end": 693.857,
    "text": "And instead you kind of would have to have a preference distribution, a Bayesian preference distribution, which can be understood more instead of as predictions, more as desires and drives, which then weights the predictive mechanisms towards a certain direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.038,
    "end": 698.642,
    "text": "But this at the lower order functioning would still be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.365,
    "end": 710.937,
    "text": " would still be kind of a Bayesian prior in of itself, because it's having an influence in the probability distribution to try and give you more probability to weighting your behavior in that direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.678,
    "end": 718.525,
    "text": "So it shouldn't really be understood as a Bayesian prior prediction, but more as a driving force which increases salience of certain ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.988,
    "end": 728.916,
    "text": "And this leads into what my co-author and colleague in the article",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.605,
    "end": 733.832,
    "text": " is keen on describing as a human vs Kant dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.272,
    "end": 750.759,
    "text": "And the Kantian understanding of predictive processing is very much on their way of understanding the generative model, but it does ignore the fundamental idea that you can understand, to a certain degree, a relationship between desires and passions directing what you want as an individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.68,
    "end": 753.503,
    "text": "The fundamental thing is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 753.837,
    "end": 760.77,
    "text": " In a sense, would you do anything if you didn't have a desire to move, a desire to exist, a desire to do everything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.331,
    "end": 769.405,
    "text": "Or are you a method for the universe to know itself and you're just an emergent property which has calculations for the sake of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.506,
    "end": 777.921,
    "text": "It doesn't make sense without there being a driving force which does count as the concept of a desire, and these desires in a Bayesian preference distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.559,
    "end": 785.994,
    "text": " can direct individuals' behaviors and even their beliefs towards things that are important to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.138,
    "end": 790.002,
    "text": "Attentional narrowing in predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.042,
    "end": 792.687,
    "text": "So as attentional narrowing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.055,
    "end": 808.19,
    "text": " relates to all this, you can see that as you have a couple Bayesian preferences, a Bayesian prize, and they're in dissonance with each other, there's predictive error because of the mismatch between these two, and that can create the negative emotional valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 808.51,
    "end": 817.579,
    "text": "This negative emotional valence can then stimulate a neuromodulation of a attentional narrowing process, which then affects the way that your decisions would be made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.959,
    "end": 821.863,
    "text": "They attentionally narrow you so you have less exploration to alternatives,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.843,
    "end": 850.011,
    "text": " thus making your decisions especially in societal uncertainty a bit more rigid a bit more deterministic and a bit more going down reinforced certain paths and this leads into the exploration exploitation trade-off going further into the mathematics we can understand that there is a tendency to explore a lot of alternatives or a tendency to exploit the very well-learned and very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.48,
    "end": 877.483,
    "text": " deterministic paths and this is understood differently by according to different paths but we've got the fundamental variable in predictive processing that relates to constant rigidity and attentional narrowing and that is the Omega value this is a stress induced sigmoid version function it that means it's a it's a temperature parameter but an inverse of that so one over the temperature parameter and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.885,
    "end": 899.421,
    "text": " what happens is we could know it is affecting all processes uh equally as as this as this if there was the same sigmoid function for every neuron then you know if there's the same excitability of every neuron then that would be termed as the sigmoid function because it's the same uh the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.823,
    "end": 911.421,
    "text": " The most reactive would be more reactive and more reliable, and the least reactive would be the less reliable, making the pathways a lot more deterministic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.942,
    "end": 921.256,
    "text": "And it shows, for example, in Natchital, we have the understanding of how relationship uncertainty can create political absolutism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.637,
    "end": 922.438,
    "text": "And this is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 923.38,
    "end": 947.886,
    "text": " you can see how inside a precision weighting mechanism that shouldn't be the case it shouldn't be that you've had something with a relationship so you're going to become more absolutist in an ideological perspective they they don't relate to each other but somehow one of them affects the other which can only really be understood outside of precision weighting in a more domain agnostic kind of perspective though i don't think i'm using that term necessarily correctly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.469,
    "end": 971.325,
    "text": " Sorry, so inverse temperature just to run through what this is It's it's the thing in thermodynamics where the more atoms you are hitting the higher the temperature thus the more The higher a temperature you have the more attention you are paying to the less narrowed your attention and following that you can see that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.301,
    "end": 981.253,
    "text": " There is a sigmoid function would then reduce the temperature because it would make everything go down a very linear path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.593,
    "end": 989.483,
    "text": "You would only have the well rehearsed, well learned things which are going to be exploited rather than the directions which would be a lot more chaotic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.824,
    "end": 1000.097,
    "text": "It's almost as though the chaos can add to like in the edge of chaos perspective, we have a optimal functioning where we have the most exploration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.786,
    "end": 1007.256,
    "text": " bordering on chaos with actually having the largest amount of complexity within a system which still has a function behind it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.103,
    "end": 1013.286,
    "text": "Cognitive flexibility as the baseline parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.847,
    "end": 1028.11,
    "text": "This is the equation that we brought in, which is the idea that the rate of change of free energy times by a ability to handle dissonance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.579,
    "end": 1036.15,
    "text": " Minus or added to the initial cognitive rigidity of an individual makes the attentional narrowed cognitive rigidity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.691,
    "end": 1041.297,
    "text": "And this parameter then could be used in the state change function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.819,
    "end": 1053.895,
    "text": "It reflects cognitive flexibility in a number of different fields because you can see how a lot of people in certain psychopathological diagnosis, diagnoses,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.347,
    "end": 1061.276,
    "text": " do tend to have cognitive inflexibility in a way which would support this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.86,
    "end": 1069.147,
    "text": "And in the computational models, we have the state transition temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.467,
    "end": 1073.272,
    "text": "So this one here is the main equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.773,
    "end": 1075.495,
    "text": "It's obviously not mine, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.829,
    "end": 1087.966,
    "text": " There's the omega value here, which you can see times by the logarithm of the transition matrices, which is the next stage considering what the current stage is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1088.347,
    "end": 1096.078,
    "text": "And so when you have the log of all these values, then you're pushing the high ones to the high point and the low ones to the low point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.498,
    "end": 1099.963,
    "text": "And then you're creating a softmax function to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.365,
    "end": 1108.694,
    "text": " guide these all to add up to one, and that kind of allows them to be accurately mapped out inside a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.017,
    "end": 1117.063,
    "text": "And this then makes the transformed matrices afterwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.186,
    "end": 1121.829,
    "text": "And here's to go through the maths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.929,
    "end": 1130.338,
    "text": "If anyone wants to pause it on here, it might be a bit better, but I think I went through the maths just then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.656,
    "end": 1132.98,
    "text": " And here we can see when we combine it all together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.322,
    "end": 1150.47,
    "text": "So the probability of the next stage, considering the previous stage, is equal to the softmax of this, which is the original equation that we came up with for determining how the negative valence affects a new attentional narrating process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.911,
    "end": 1155.178,
    "text": "And this attentional narrowed original omega variable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.412,
    "end": 1162.063,
    "text": " then is multiplied by the logarithm of the transition matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1163.613,
    "end": 1170.983,
    "text": " When and as you can see, when it is low, then this is the maximum amount of cognitive flexibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.143,
    "end": 1174.929,
    "text": "This is when you can have a very clear mind and consider all the possibilities before you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.189,
    "end": 1177.232,
    "text": "But you may have choice paralysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.272,
    "end": 1188.167,
    "text": "You may not be very comfortable in a fight or flight situation where the pressure of a situation is making you go to a sudden, immediate action, which is going to be the most learned action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.207,
    "end": 1189.308,
    "text": "And you want to do it very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.949,
    "end": 1192.793,
    "text": "And when you have it as deterministically as possible,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.363,
    "end": 1199.405,
    "text": " Even simple thoughts might be difficult because you might need to explore a lot of options around you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.466,
    "end": 1204.183,
    "text": "And even the most deterministic thing could just be to stand there and be frozen in the headlights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.003,
    "end": 1217.797,
    "text": " As such, this affects both belief formation and dominant response formation because we can we can see how this affects every aspect of of of life and in our interests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.817,
    "end": 1219.82,
    "text": "It's in politics, but obviously it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1220.02,
    "end": 1223.684,
    "text": "It does reflect in psychopathology and it does reflect in sports psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.707,
    "end": 1228.23,
    "text": "This leads to the bidirectional dance of cognitive rigidity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.784,
    "end": 1236.483,
    "text": " So we do have the idea that from the ground upwards, so from the sensing to the actual thoughts, we have how the environment affects the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.744,
    "end": 1240.072,
    "text": "And that would be the stresses inside the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.473,
    "end": 1241.275,
    "text": "And that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.693,
    "end": 1242.875,
    "text": " in the bottom up processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.315,
    "end": 1248.082,
    "text": "So as we are in any societal uncertainty, it will create these prediction errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.302,
    "end": 1259.879,
    "text": "And when these prediction errors are manifest, they will then lower the temperature parameter, which then top down goes to your actions, which are to have more entrenched reinforced beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.64,
    "end": 1263.043,
    "text": "And it is to have a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.462,
    "end": 1278.743,
    "text": " limited, you may jump to conclusions more easily, you may be fixated on certain points, you have an inability to change your mind about certain things, and you would also be more likely to do your well-practiced responses rather than exploring alternatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.587,
    "end": 1282.408,
    "text": "This leads to discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.87,
    "end": 1287.955,
    "text": "Right, so flexible minds nuance their ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.496,
    "end": 1291.36,
    "text": "This is something I find quite",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.947,
    "end": 1320.25,
    "text": " uh interesting in this concept so if we have this inability to transition from one state to another state then we don't really have the ability to consider other people's perspectives to add to and build on our ideas if we entrench ourselves in our ideas if we have rigid minds we have absolutist ideologies if we have absolute things inside any any perspective then we are unable to uh create the most complicated the most detailed uh concepts which you know in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.567,
    "end": 1347.391,
    "text": " this leading to this ultimate complexity at the edge of chaos, it would never be achievable if we stick ourselves in what would be a which I should have addressed as a suboptimal local minima in a sense of if we imagine a large landscape of ideas and we can't explore other places and we can't get out of this hole of an idea we're in, then we will never see a bigger hole of an idea, which is a better hole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.351,
    "end": 1350.253,
    "text": "We would have to get to the globally best hole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.723,
    "end": 1356.87,
    "text": " We would always be stuck in the rigid beliefs, which can potentially lead to a lot of problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.272,
    "end": 1362.677,
    "text": "Whereas having flexible, nuanced beliefs means we will have more integrated complexity in our ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.997,
    "end": 1366.121,
    "text": "In political theory, that is how you get to the best conclusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1366.421,
    "end": 1369.345,
    "text": "It's not necessarily that there's one idea which is better than another idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.365,
    "end": 1376.393,
    "text": "It's just if you get an absolutist idea, you tend to have problematic stances on a multitude of different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.677,
    "end": 1405.823,
    "text": " it's better to consider as many perspectives as possible so you're aware of good ideas but i believe there's a famous quote of uh it's good to have an open mind but not so open your brain falls out but there are a lot of a lot of nuances to every aspect and every rule that you can make both for yourself and for everything in in society and this is in conjunction with cognitive dissonance and predictive processing you can have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.444,
    "end": 1411.711,
    "text": " an integration more thoroughly with this based off the attentional narrowing details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.291,
    "end": 1430.114,
    "text": "So as we have Bayesian priors, something important to you is criticized, which is in the Bayesian preference distribution, and that in conjunction with the Bayesian prior distribution of calculations can then create the resolutions in cognitive dissonance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.134,
    "end": 1432.317,
    "text": "And these resolutions are either",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.6,
    "end": 1435.526,
    "text": " affects cognitions or behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.707,
    "end": 1444.165,
    "text": "So these are the ideas in cognitive dissonance which are in contradiction with each other, which cause the dissonance, which causes the rationalizations, which make the theory of cognitive dissonance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.967,
    "end": 1447.673,
    "text": "And so if you have an emotional",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.041,
    "end": 1452.31,
    "text": " It could be an addiction to cigarettes, and then you have a fact that cigarettes are bad for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.871,
    "end": 1462.39,
    "text": "This dissonance between them creates a prediction error, and this prediction error then leads you to rationalize that cigarettes will help you lose weight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.751,
    "end": 1469.003,
    "text": "These are common cognitive dissonance scenarios studied quite well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.928,
    "end": 1491.649,
    "text": " That establishes how when you have attentional narrowing, your consideration of alternatives is reduced to such a degree that you're more likely to rationalize because it lowers your ability to see alternatives as you move towards the rationalization, making the rationalizations more distinct when things are very emotionally significant to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.97,
    "end": 1498.194,
    "text": " And this leads connected to heuristic adherence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.214,
    "end": 1506.244,
    "text": "So heuristic adherence is very strongly connected to cognitive dissonance to a degree and the predictive processing mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.324,
    "end": 1517.758,
    "text": "Because heuristics, if you read the Daniel Kahneman thing, they're generally held in negative light, but heuristics are also often held inside just a tool for how you can do things throughout life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.778,
    "end": 1521.703,
    "text": "But if you are attentionally narrowed, then your heuristic adherence is a lot stronger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.122,
    "end": 1528.585,
    "text": " Because to get out of your entrenched beliefs, you have to rely on something which is kind of an easy go-to card.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.77,
    "end": 1534.326,
    "text": "And this can mean that you are...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.217,
    "end": 1538.702,
    "text": " unlikely to nuance these heuristics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.664,
    "end": 1548.256,
    "text": "If you don't nuance the heuristics, however, then you tend to justify perspectives in society, which to a lot of people can seem very clearly wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.697,
    "end": 1554.205,
    "text": "But if you're under a very large amount of emotional strain, then it can seem more appealing to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1554.505,
    "end": 1559.574,
    "text": " An obvious heuristic which was studied in marketing is the price tag.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.594,
    "end": 1574.24,
    "text": "You rely on the price tag, but if you're really stressed, you don't really know what to think, and you're kind of faced with this time pressure, then the price tag itself will be a reliance you will have on the actual value of the item you are buying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.542,
    "end": 1579.028,
    "text": "But then you also have one of my favorites.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.514,
    "end": 1585.47,
    "text": " Well, one of the worst heuristics that I like to talk about is the just world fallacy slash hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.112,
    "end": 1589.22,
    "text": "And this is generally defined as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.656,
    "end": 1591.859,
    "text": " Everybody gets what they deserve and deserves what they get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.42,
    "end": 1601.252,
    "text": "In this perspective, we have a justification for the status quo, which could be anything inside the most authoritarian societies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.372,
    "end": 1614.049,
    "text": "It can be very distinct cultural dynamics, which you feel you can't see why they happen, but you're going to justify them because they exist for a reason, because they exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.069,
    "end": 1616.372,
    "text": "And this can cause a lot of victim blaming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1616.977,
    "end": 1619.723,
    "text": " It can cause the belief in a pretender fallacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.104,
    "end": 1628.404,
    "text": "If you're in a situation where you do not feel like you deserve this and you feel like something is not right about things, it can be due to a backfire with this heuristic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.105,
    "end": 1635.019,
    "text": "It can be in the general resistance to change, which is endemic with...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.674,
    "end": 1658.138,
    "text": " the loss aversion tendency because people are generally against change even when it's beneficial and a just world hypothesis attaches onto that because the heuristic adherence to the idea that everything must make sense or everything you know it exists for a reason makes you unlikely to change especially when there is a lot of stress so the attentional narrowing mechanism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.202,
    "end": 1668.252,
    "text": " facilitates the predictive processing error minimization, which causes more of a reliance on the heuristics, which then reduce your ability to change in these situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.372,
    "end": 1678.362,
    "text": "And this is very strongly studied in relation to cognitive rigidity through how cognitive rigidity is a fundamental neuroscientific trait.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.803,
    "end": 1684.108,
    "text": "It's more recent in the developments of political psychology, but it shows that cognitive rigidity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.493,
    "end": 1691.905,
    "text": " helps or forces people to be unable to change their mind and to create what they term as absolutist ideologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.79,
    "end": 1697.595,
    "text": "So does this better our understanding of the brain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.635,
    "end": 1710.636,
    "text": "I think combining attentional narrowing with cognitive rigidity and putting them into a computational mechanism within the active inference models of state transitions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.19,
    "end": 1716.677,
    "text": " does help give an understanding of the brain which enhances the predictive processing mechanisms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.872,
    "end": 1742.445,
    "text": " And it should help enhance every step of its involvement with the involvement in psychopathology, in precision psychiatry, because if you go into the area of psychology, the importance of how stress affects people is incredibly significant and showing if there's biological components to this, whether they can be reinforced or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.425,
    "end": 1751.396,
    "text": " some innate component which is outside of the direct environment, which makes a difference between people is also interesting for the diagnostic criteria of what people go through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.86,
    "end": 1757.684,
    "text": "And that's where we get into the applications, precision psychiatry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.606,
    "end": 1765.254,
    "text": "So schizophrenics and autistics tend to have more cognitive rigidity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.975,
    "end": 1771.622,
    "text": "They tend to be cognitively inflexible is what they term it, but the resistance to changing their beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1772.615,
    "end": 1780.467,
    "text": " The correlation they've had has actually led people to even ask the question of, is cognitive flexibility the missing link?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.487,
    "end": 1787.417,
    "text": "Is it the component in the differences between people which cause the genetic component?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.078,
    "end": 1791.984,
    "text": "Because the genetic markers for autism and schizophrenia are vaguely strong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.284,
    "end": 1799.415,
    "text": "And so the link between these two is seen to be on the cognitive rigidity, which seems to be strong in both categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.252,
    "end": 1828.98,
    "text": " Inside predictive processing, people have also had the idea of the generative model and the recognition model being quite significant in how the generative model and the over-the-top focus on predictions and imagination of the scenario creates the preference for schizophrenic people to have hallucinations and delusions and come up with ideas outside of what people would normally expect to be realistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1829.382,
    "end": 1836.332,
    "text": " And in the autistic situation, there's the sensory overload, which is more in the sensory aspects of the recognition model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.394,
    "end": 1839.817,
    "text": "And that's over-focus on the sensory information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.097,
    "end": 1851.915,
    "text": "There seems to be a very large link between autism and schizophrenia according to the dysregulation perspectives of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.319,
    "end": 1857.803,
    "text": "And that is why there's a relevance to schizophrenia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1858.39,
    "end": 1865.019,
    "text": " because the idea of the entrenching in beliefs is strong with the concept of delusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.439,
    "end": 1888.11,
    "text": "So schizophrenics are also more likely to have conspiracy theories, and this entrenched belief system that they hold means that the cognitive rigidity appears to be a strong factor in what develops the problematic issues with the diagnosis, with suffering with schizophrenia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.491,
    "end": 1890.956,
    "text": " There is also educational benefits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.778,
    "end": 1896.654,
    "text": "So there are studies into the idea of just attentional narrowing in general, increasing your focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.256,
    "end": 1902.353,
    "text": "And if you have a certain amount of pressure, then it does help you study harder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1902.788,
    "end": 1922.923,
    "text": " This is important in a lot of developments in psychology, which can use the concepts of attentional narrowing, especially in a mechanistic way, to develop into other psychological concepts, which then help understand how a drive towards supporting a value and ideal you believe in can be facilitated by the pressure of this ideal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.967,
    "end": 1929.874,
    "text": " It's almost as though when you have a bit of stress in your life, sometimes laser focusing on a task can reduce that stress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.294,
    "end": 1938.844,
    "text": "Doing something which is associated with your values can reduce an error process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.565,
    "end": 1948.135,
    "text": "It can do an error minimization mechanism for the actual issues at hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.84,
    "end": 1977.497,
    "text": " this also can understand how learned helplessness can happen from a error minimization process where you see what you are doing as being uh difficult to solve so instead of uh when the when the attentional narrowing gets too high you will go down to a simpler solution which is learned helplessness or giving up or disassociating from the concepts instead of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.882,
    "end": 2005.577,
    "text": " focusing on the task the anxiety will get too high and it'll be harder to focus on that task and understanding that inside a relationship between other metrics inside the brain can help understand what can cause learned helplessness and what influences can develop that further a respect for academia academia in in total can facilitate the importance waiting and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.266,
    "end": 2011.231,
    "text": " Bayesian prior distributions in favor of doing better in academia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.372,
    "end": 2028.811,
    "text": "And it can actually, according to certain texts, for example, the book The Moral Arc, there's evidence that respect for academia and having a skeptic-first mindset can facilitate a sense of morality in any country which holds those values, which I think is quite significant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.192,
    "end": 2032.695,
    "text": "And future research directions after the applications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.705,
    "end": 2036.489,
    "text": " This is in social and political psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.85,
    "end": 2041.197,
    "text": "These are areas in which I think attentional narrowing and cognitive rigidity are profound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.417,
    "end": 2044.241,
    "text": "Obviously cognitive rigidity is pretty good for cognitive rigidity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.802,
    "end": 2055.979,
    "text": "If we have a computational aspect to that and we attach it to the mechanisms of predictive processing then it will distinctly help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.921,
    "end": 2060.286,
    "text": "The right-wing authoritarian personality trait, which is a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.553,
    "end": 2081.211,
    "text": " uh kind of it's it's a development from something which is called the fascist scale which applies to both the far left inside a traditionally left country and the far right in a traditionally right-wing country most of all but it's still called right-wing authoritarianism because of the associated of right-wing with traditional conventional attitudes and that being correlated with the concept of authoritarianism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.765,
    "end": 2087.477,
    "text": " Social dominance orientation is kind of the idea of feeling as though there should be a dominance over certain groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.018,
    "end": 2095.013,
    "text": "And all of these seem to associate with the concept of heuristic adherence in the political environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.534,
    "end": 2102.068,
    "text": "It's the adherence to rules, the idea that everyone gets what they deserve to do what they get because of this authoritarian structure that you live in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.453,
    "end": 2122.075,
    "text": " That enhances by the intentional narrowing focus and as such you can kind of see how they would not nuance their beliefs according to these dynamics of their society and they would go more absolutist into supporting of any ideological background, especially when it's strongly associated with a Bayesian preference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.095,
    "end": 2129.423,
    "text": "And that works for all of these processes and they're all psychology theories which are very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.398,
    "end": 2134.222,
    "text": " And in social psychology, you can see how they also relate in the same way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.022,
    "end": 2140.988,
    "text": "Game theory, I'm not the most certain on, but social facilitation is the basic one about dominant response facilitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2141.909,
    "end": 2147.794,
    "text": "Conformity under stress obviously would increase because you have the uncertainty enhancing the attentional narrowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.874,
    "end": 2156.282,
    "text": "Even though it's not directly precision weighted, the threat uncertainty significantly influences your chance to conform.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.563,
    "end": 2159.865,
    "text": "And even the Dunning-Kruger effect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.436,
    "end": 2168.487,
    "text": " There's a preference to narrowing your focus to only what you've experienced and not to an exploration of unknown possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.888,
    "end": 2177.88,
    "text": "And so this process is believing you're better than you are because you don't have much experience about what else is out there, which probably happens in the area of research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.96,
    "end": 2179.963,
    "text": "And I'm hoping it doesn't happen to me too much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.618,
    "end": 2190.832,
    "text": " I think that there's the idea of exploring other options instead of going down your singular path, which gives you more an awareness of the unknown unknowns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.076,
    "end": 2196.539,
    "text": "And then there's reactive approach motivation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.74,
    "end": 2208.195,
    "text": "So this is something which I think is a really good direction to take future research after attentional narrowing, because this gives more of a holistic picture of how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.12,
    "end": 2216.042,
    "text": " When under stress, you will do certain things which then make you more zealous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.528,
    "end": 2226.867,
    "text": " I have a quote here, which is, if any adaptive change in the brain will minimize free energy, then how does an adaption to stress minimize free energy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.368,
    "end": 2233.819,
    "text": "And the adaption to stress doesn't always minimize free energy in that regard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.879,
    "end": 2239.87,
    "text": "It aims to minimize free energy, but because of the positive feedback loop, it can loop things through quite a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.187,
    "end": 2256.023,
    "text": " The way that reactive approach and motivation tries to react to stress reactive approach motivation is that they find that any societal stresses will be reduced by disassociation from these societal stresses through a laser focus in an ideal that you believe in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.403,
    "end": 2261.448,
    "text": "You can distract yourself by focusing on something which to you has value and worth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.588,
    "end": 2268.135,
    "text": "And that does increase, for example, zealous adherence to a cult like religion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.419,
    "end": 2288.942,
    "text": " in opposition to when you are suffering quite a lot in a lot of threat uncertainty in your personal life and that can be enhanced by cognitive fragility when maybe the stresses are more effective and then this is the conclusion summary of points so from this we've got",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.277,
    "end": 2293.265,
    "text": " attentional narrowing from emotional stresses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.946,
    "end": 2308.095,
    "text": "The predictive error minimization from emotional stresses creates an increase of rate of change of free energy, which then forces you to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.02,
    "end": 2337.981,
    "text": " rely on on heuristics to when when your attention is narrowed and you are too rigid inside your perspectives because you you then don't nuance these heuristics and then you have a perspective on both society and actions in society as well as a facilitation of more learns like practice piano responses in front of an audience type of situations of the the most reinforced neural connections and belief formations and belief that you don't really have belief updating and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.687,
    "end": 2344.198,
    "text": " So and it develops a more authoritarian outlook on things in society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.563,
    "end": 2360.29,
    "text": "And thanks, and if you have any questions, then you can email me and also you can ask for the email of either of my colleagues, well, mostly Dylan and Mr. Grove, and it would be much appreciated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.531,
    "end": 2363.573,
    "text": " Thank you, Alexander.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.434,
    "end": 2364.694,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.836,
    "end": 2366.196,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.457,
    "end": 2366.857,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.917,
    "end": 2373.447,
    "text": "While I'm cropping things back, maybe share a little bit like how did you come to this project?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.507,
    "end": 2376.211,
    "text": "Or how did you come together with these authors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.772,
    "end": 2382.16,
    "text": "And what are you like looking for, in terms of milestones in that collaboration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.726,
    "end": 2405.667,
    "text": " um uh will i i've i've been the co-author with dylan for for a while and we've been writing a book which is the the foundations of ideology so our our our work in in trying to you know explain the political dynamics we came to quite a lot of conclusions about things when we did research very continuously coming with a lot of ideas and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.647,
    "end": 2413.78,
    "text": " And in our research, we've read quite a few books between us on active inference, and this seems to be a very prominent gap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.543,
    "end": 2424.598,
    "text": "What I hope to gain from it is to add to the community and to try and help as much as possible, well, to ingrain myself inside research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.139,
    "end": 2431.249,
    "text": "And, well, the book has been my passion project for a while now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.82,
    "end": 2455.752,
    "text": " and it's and it's now Dylan's passion project to a degree as well and we do believe that this will be good to add to the research community and it will help the world in the theory of how you know you can address certain things which will help a lot of people inside a diagnosis and in political dynamics reducing the polarization of the world for example so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.33,
    "end": 2462.296,
    "text": " Okay, lot of topics that we could go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.957,
    "end": 2464.479,
    "text": "There's a few questions in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.94,
    "end": 2468.165,
    "text": "And anyone can ask more questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.245,
    "end": 2469.046,
    "text": "So I'll read some of those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.366,
    "end": 2472.751,
    "text": "Maybe leave the slides up and we could go to a slide if it comes up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.853,
    "end": 2474.194,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.195,
    "end": 2476.417,
    "text": "Um, all right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.797,
    "end": 2482.566,
    "text": "Susan asks, Is there any research on addiction to exploitation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.773,
    "end": 2486.016,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.377,
    "end": 2488.482,
    "text": "I mean, well, addiction to exploitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.184,
    "end": 2501.213,
    "text": "Well, the exploitation-exploration trade-off is more of a machine learning term, but the thing about addiction is actually more towards the policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.733,
    "end": 2524.315,
    "text": " process and that's that's not the state transition process necessarily and that addiction mechanism is more about uh kind of the gamma temperature variable rather than the omega temperature variable and it's it's it's kind of more about uh the the dopamine pathways and how you are uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.598,
    "end": 2539.941,
    "text": " reinforced into having, I'm not super knowledgeable about that area, but I know it's more associated with dopamine, it's more associated with policy selection rather than state transition, and there is a lot of research on that from what I'm aware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.22,
    "end": 2569.303,
    "text": " okay here's a question that i wrote down well first the scope is very vast essentially encompassing our human cognitive niche ranging from differences in neurodiversity associated with like context changes and different scenarios in a given day-to-day life to just different people different stages of life and then all the way into these social pieces so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.283,
    "end": 2593.924,
    "text": " how how do we think about these more system general cognitive phenomena with the domain specific phenomena and then also multi-step kind of like rhetorical or justification phenomena like what do you think that model kind of looks like the equations do give some pointers and reference but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.904,
    "end": 2618.46,
    "text": " What do you see the puzzle pieces coming together looking like to bring together like fundamental constraints of informational systems with these system general stress and attention phenomena with ultimately the kind of domain specific models that are usually deployed in a specific generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.448,
    "end": 2626.193,
    "text": " Well, I think the specific generative models can work the best as they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.213,
    "end": 2640.367,
    "text": "And then this model just basically goes that when you explore, in a sense, in any part of the Markov chain, you are also forcing on yourself more of a rate of change of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.607,
    "end": 2646.793,
    "text": "It's almost like any action that is taken will theoretically, in their increase of free energy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.077,
    "end": 2648.981,
    "text": " they will potentially create stress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.101,
    "end": 2650.163,
    "text": "It's like thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.584,
    "end": 2657.758,
    "text": "Like if you were playing chess, you would force yourself to feel stressed just to try and solve a puzzle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2657.999,
    "end": 2664.091,
    "text": "And that, forcing yourself to feel stressed, means you are creating a tiny bit of stress, which then narrows your thought processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.652,
    "end": 2665.373,
    "text": "So it's not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.792,
    "end": 2676.471,
    "text": " It's that this stuff happens anyway, but there's very constraining mechanisms in place which just stop too much free energy accumulating during that same domain-specific process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2677.072,
    "end": 2689.234,
    "text": "If the domain-specific processes are specific to going along one direction from one step to another in a Markov chain rather than in a one thing affects everything dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.446,
    "end": 2690.747,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.887,
    "end": 2708.083,
    "text": "Yeah, that was one of the parts I found most interesting in sort of the deep affective work and the way that you brought it out and worked it here is like the re-entry of the rate of change of free energy into an equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.063,
    "end": 2724.739,
    "text": " because otherwise the the free energy values or the rates of change can be essentially epiphenomenal like a model diagnostic used in training but then that generative model doesn't have re-entry or causal efficacy of the free energy itself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.719,
    "end": 2743.555,
    "text": " but then it is this really clever way to bring global dynamics back into the process of the domain like staying with that chess example there's a time pressure and time pressure and choosing when to act is not always",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.535,
    "end": 2772.917,
    "text": " modeled in decision-making models it'll just be this kind of like frozen universe and then a slot machine is pulled or a frozen universe and then a move is made in a teammates so then when you start to bring in the the unfolding dynamics it's it's this kind of like everything plays into that free energy value or rate of change and that provides the domain agnostic signal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.146,
    "end": 2799.613,
    "text": " of basically how well things are going and then valence has been associated with whether that is going better or worse than itself was expected to be yeah yeah perfect i like the analogy um okay another question from susan could cognitive rigidity be related to a deficit in perceptual affordance acuity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.247,
    "end": 2805.931,
    "text": " I think perceptual processes are a different neuromodulator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.392,
    "end": 2821.346,
    "text": "In the way in which I got the state transition from a 2024 article, there was an acetyl-CoA or acetylcholine parameter for perception specifically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2822.067,
    "end": 2826.991,
    "text": "I'm not too keen on the knowledge of perception, but I do know that there is in that area something more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.492,
    "end": 2828.773,
    "text": "It's a different neuromodulator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.981,
    "end": 2832.703,
    "text": " That's as far as I can go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.004,
    "end": 2841.836,
    "text": "I do think that when you look at neurotransmitters and hormones inside the brain, there is a tendency for neurotransmitters to slightly affect other pathways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.016,
    "end": 2853.731,
    "text": "If you look at how stochastic resonance, which is the noise between neurotransmitters affect each other, it's not necessarily that you have to have the thing which is normally activated by that neurotransmitter is only activated by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.751,
    "end": 2855.614,
    "text": "There's like a slight effect from others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.055,
    "end": 2857.917,
    "text": "So I think adrenaline could affect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.268,
    "end": 2865.338,
    "text": " your vision as well, but I think it's more about the ability to change your states inside those processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.479,
    "end": 2868.443,
    "text": "Though I don't know too much about that area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.33,
    "end": 2879.86,
    "text": "Okay, on, I think it was slide 30.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.88,
    "end": 2886.269,
    "text": "Is that 30?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.77,
    "end": 2888.072,
    "text": "Oh, wait, no, I'm getting the wrong way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2888.778,
    "end": 2892.163,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.183,
    "end": 2892.383,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.204,
    "end": 2893.425,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.247,
    "end": 2895.528,
    "text": "Alright.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.01,
    "end": 2907.264,
    "text": "So, maximum cognitive flexibility is being associated with a uniform probability distribution over future states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.526,
    "end": 2914.314,
    "text": "So, um... Yeah, that's not true, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.355,
    "end": 2917.198,
    "text": "Yeah, how do you see it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.938,
    "end": 2919.803,
    "text": " Sorry, well, it can't be a uniform.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.124,
    "end": 2927.104,
    "text": "Obviously, it's almost just that there's a temperature parameter adding in, which is making you more rigid and only more rigid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2927.523,
    "end": 2930.346,
    "text": " it doesn't ever go in the opposite direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.887,
    "end": 2935.391,
    "text": "I mean, there is the idea that if you are happier about things, then you are actually more cognitively flexible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.972,
    "end": 2941.738,
    "text": "And there are studies which show that, but I don't think it can ever get to a uniform perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.758,
    "end": 2946.603,
    "text": "That's just a theoretical perspective of, you know, if you have temperature and you put it in different directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.904,
    "end": 2951.809,
    "text": "If I could see that in anywhere of an actual possibility, I would basically think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.789,
    "end": 2980.851,
    "text": " there's someone stuck in one place unable to make any decision about anything because they're trying to see everything with equal possibility and it's it's kind of like when you have the edge of chaos concepts so you have the ordered structure overfitting and then you have the uh over exploration actually into chaos you know you'll have strange attractions you'll have other things but it's it's it's not really information it's not information in it in enough of a structured way to mean anything in a goal directed way it it is just chaos",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2980.831,
    "end": 2989.215,
    "text": " And anyone who is actually pushed to that point of exploration, they would not be able to have any structured beliefs and they would devolve to chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.438,
    "end": 2992.364,
    "text": "But it would probably be closer to a praesia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.745,
    "end": 2995.954,
    "text": "It would be the sense of like a, you know, you wouldn't,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.778,
    "end": 3024.726,
    "text": " have hallucinations or anything because if you have that much chaos a hallucination is still a structured dynamic process where you have ideas idea idea it's almost a hallucination i would say is more rigid because you can't escape the hallucination even if you want to whereas this would be more you can't even have a simple thoughts because you're considering so many possibilities you're completely changing all the time that's the way i think of it think of it really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.275,
    "end": 3054.763,
    "text": " yes interesting so the more rigidity is just crystallizing or just sharpening the definition on a given on the given contours of a belief in this situation it's a belief about the consequences of action um the the rigidity i feel like belief is is a oh wait so so the wait sorry what is the belief",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.402,
    "end": 3062.602,
    "text": " Will the B matrix our beliefs about how things are apt to change conditioned upon what actions are taken?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3064.267,
    "end": 3065.25,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.27,
    "end": 3069.141,
    "text": "Well, I was thinking more in a distribution of beliefs which are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.083,
    "end": 3095.466,
    "text": " uh going to trigger other beliefs in the future so if you have a bayesian prior which is uh kind of like a if it's creating an attractive dynamic of flow into a certain direction then what's the chance of that happening considering those chances but then if you multiply that by a temperature then you would potentially make it more rigid and not transition into the next stage um so sorry can you repeat the question one more time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3096.998,
    "end": 3105.164,
    "text": " I'm just trying to work out what is being made more rigid in the B matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.648,
    "end": 3107.852,
    "text": "And...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.946,
    "end": 3111.77,
    "text": " Yeah, well, it would be beliefs are more rigid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.391,
    "end": 3124.309,
    "text": "In terms of dominant response facilitation, it would be you are being made more rigid in your... It's the fluid dynamics in the brain of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.449,
    "end": 3126.792,
    "text": "So the rigidity would be the attractive dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.913,
    "end": 3131.84,
    "text": "It would be, in a sense, the information flowing throughout the brain is going through a singular path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.421,
    "end": 3138.109,
    "text": "And because it's going through that singular path, that means that you're not going to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.832,
    "end": 3143.47,
    "text": " have more different options that you're considering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3143.49,
    "end": 3146.26,
    "text": "You're going to only have the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3147.522,
    "end": 3152.55,
    "text": " singular dynamic of playing the piano inside that one direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.151,
    "end": 3173.243,
    "text": "But in a belief, it would be that you would, having more rigid beliefs, it would be you have more entrenched beliefs being facilitated more, which means that when someone is trying to convince you of an idea and your beliefs are very entrenched and you're under attentional narrowing, then the chance that your belief will change will be very minimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.623,
    "end": 3193.273,
    "text": " Yeah, I think I hear you and it may be interesting to parse out flexibility as the capacity to change from flexibility being the sharpness of a given distribution in a moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.928,
    "end": 3205.065,
    "text": " Because you could have a very sharp belief distribution about successor of the next states or whatever it happens to be, and that could be rapidly changing or it could be fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.686,
    "end": 3212.055,
    "text": "And then you could have sort of closer to a flatter distribution that also could be changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.166,
    "end": 3236.777,
    "text": " there's less room for change the flatter you get with this extreme case like you brought up it's like yeah does a blob have flexibility it's like it doesn't even have enough differentiation to have flexibility because it's just sort of inert um question from live chat yeah what did you mean by temperature that's a great question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.158,
    "end": 3242.008,
    "text": " Temperature, well, it came from thermodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.088,
    "end": 3250.37,
    "text": "So in the understanding of temperature in thermodynamics, you have more entropy, which is more information happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3250.831,
    "end": 3254.26,
    "text": "So when I mean temperature, it's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.628,
    "end": 3268.857,
    "text": " Originally, the term of just more stuff happening and then in this it's used in the normal kind of reinforcement learning equations of the amount of options being considered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.495,
    "end": 3281.731,
    "text": " So in this, it is when you multiply it by the matrix, which is the amounts of coordinates in a graph, which are pointing in a specific direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3281.771,
    "end": 3283.313,
    "text": "So it's like a vector database.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.714,
    "end": 3288.28,
    "text": "If you imagine, sorry, if you imagine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.732,
    "end": 3318.52,
    "text": " weather and convection currents and weather they are pushing air in one direction and if you're mapping out a still image of this weather you'll have arrows moving in different directions from where the convection currents are pushing things you can then give numbers to all these arrows so all of these arrows are kind of like points inside this graph and when when you have these these uh sorry when you have these points in these graphs you can give them numbers and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.175,
    "end": 3331.356,
    "text": " Sorry, this is getting way too complicated, but these numbers then represent the amount of push inside a given direction and the probability of it going in that direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3331.857,
    "end": 3342.094,
    "text": "And if you put this into a probability distribution like in quantum mechanics, it represents the same thing as in fluid dynamics and inside graphing temperature convection currents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.698,
    "end": 3343.379,
    "text": " That's right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.599,
    "end": 3356.68,
    "text": "And then the probability of one thing moving from one thing to another thing is going to be like 10 or two and maybe higher or lower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.88,
    "end": 3361.647,
    "text": "But if it's a high probability, then the temperature being lower means that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.329,
    "end": 3363.27,
    "text": "So that's the point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.29,
    "end": 3366.495,
    "text": "When you have temperature lower, the high probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.965,
    "end": 3368.849,
    "text": " is raised in its number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.03,
    "end": 3375.043,
    "text": "When you have temperature higher, when you have temperature lower, also the lower probability is made lower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3376.627,
    "end": 3385.767,
    "text": "Sorry, I'm not really in the best of zones for this, but temperature adjusts the probability so it makes more probable actions more likely and less probable actions less likely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.126,
    "end": 3389.328,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.009,
    "end": 3390.31,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.071,
    "end": 3398.623,
    "text": "I think about Kelvin, the temperature scale, and how there's basically a stopping of molecular motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.425,
    "end": 3413.728,
    "text": "And so if we were to have a ball rolling on a table and the table were to be unmoving, and we were to drop the ball on, one way to say it is it would find the lowest point, or a little bit of a looser way is it would reflect the actual distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3413.708,
    "end": 3434.772,
    "text": " of the hills and the valleys and then as you shake it more and more with higher temperature those differences start to matter less in elevation because there's so much energy being added in by the movement of the table that the small differences in in elevation are are basically outweighed by the random jostling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3436.608,
    "end": 3437.45,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3438.972,
    "end": 3441.657,
    "text": "Yeah, finding the local minima through gradient descent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3442.659,
    "end": 3443.12,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3443.521,
    "end": 3444.082,
    "text": "Good metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.144,
    "end": 3451.476,
    "text": "Okay, another question from... Oh, yeah, go ahead, then I'll ask another question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.496,
    "end": 3456.225,
    "text": "Sorry, I was just going to say... Oh, sorry, no, carry on, please, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.305,
    "end": 3458.008,
    "text": "Sorry, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3458.866,
    "end": 3466.058,
    "text": " So, well, I would say, I guess, the only way to escape one of those dips is to add a bit of chaos into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.579,
    "end": 3476.035,
    "text": "And that chaos can also be understood as the temperature, because it's not really efficient to try and get out of a correct answer, which is the dip, to find a bigger dip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.055,
    "end": 3479.06,
    "text": "So you have to have something which is a bit chaotic, like temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.304,
    "end": 3481.585,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.685,
    "end": 3481.785,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.339,
    "end": 3505.765,
    "text": " I think the way that you brought in the U-curve response is going to be really interesting to see as you develop this out, because that reflective and reactive on the previous slide, stress may increase the piano playing a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.099,
    "end": 3518.351,
    "text": " But then it doesn't, it doesn't have a monotonic relationship, but then oftentimes when we're working with like a preference vector or something like that, just, it's kind of like you just increase the preference just forever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.052,
    "end": 3535.448,
    "text": "So it's actually hard to bring in those U-curve like responses, but those have a lot more biological validity when we start looking at the tension between different, different general systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.626,
    "end": 3540.675,
    "text": " Yeah, that makes a lot of sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.695,
    "end": 3548.593,
    "text": "If there was a preference for something, I guess any contradiction to that would create more free energy, which would then create more attentional narrowing in that regard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3551.981,
    "end": 3554.567,
    "text": "Okay, I'll ask a question from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3556.403,
    "end": 3563.331,
    "text": " Vitor wrote, could trends be identified in real time or near real time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.551,
    "end": 3569.298,
    "text": "Do you think I'm thinking of, say, collecting personal data and establishing a personal baseline?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3573.844,
    "end": 3585.077,
    "text": "I think that's more of psychology research than it is computational neuroscience, but you could definitely you can definitely find trends in real time and you can validate certain things based on how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.985,
    "end": 3598.043,
    "text": " likely someone is going to, like if you weight the importance someone has towards a certain thing, then it can definitely be collected in real time based off surveys and certain bits of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.343,
    "end": 3608.618,
    "text": "And then also you can probably do like galvanic skin response things to check how much aversive arousal or negative effects someone will have and then see how their",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.053,
    "end": 3620.025,
    "text": " attention will be narrowed towards that, especially when considering criticisms to things which they hold very important to them, which would then be more more entrenched beliefs and more rationalization of these perspectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.766,
    "end": 3638.385,
    "text": "It's possible, but it's I don't think it's realistic and it doesn't really I think it's not based on this type of research necessarily, but it is something which is more based inside the theories it's building towards in psychology already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.605,
    "end": 3646.49,
    "text": " However, in these models, you're talking about observables and latent states of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.311,
    "end": 3658.122,
    "text": "So conceivably that does connect with some kind of self-report or biometric or other behavioral measures that would be used to parameterize the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.603,
    "end": 3667.512,
    "text": "So what would that look like and how do you see that being brought into practice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.825,
    "end": 3673.933,
    "text": " Well, I think it's possible, but it wouldn't be super accurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3674.654,
    "end": 3681.705,
    "text": "The kind of explanatory power of this process is pretty good and you can have some validity to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.786,
    "end": 3683.689,
    "text": "You could probably do some significance test towards it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3684.69,
    "end": 3687.154,
    "text": "But what you would probably",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3687.573,
    "end": 3699.075,
    "text": " do is just copy Lios Migrod's research on cognitive rigidity, where she finds that cognitive rigidity through card assortment tests correlates with the absolutist ideology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.757,
    "end": 3707.833,
    "text": "And that, then you can connect that to some other people's research on cognitive rigidity, which is associated with attentional narrowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.294,
    "end": 3709.075,
    "text": "And then if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3709.46,
    "end": 3726.188,
    "text": " So these things are quite well established and then using the active inference equations in support of that just more gives an explanation for it rather than giving an enhance to the predictive power of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.511,
    "end": 3730.135,
    "text": "It can, the influence of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3730.739,
    "end": 3735.405,
    "text": " computational modeling with all these is probably beneficial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.465,
    "end": 3742.974,
    "text": "And if you had EEG scans on people's heads, you could probably see the processes of error minimization in conjunction with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.314,
    "end": 3749.061,
    "text": "But it would probably look very, very close to the research by Liorce Migrod.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3751.684,
    "end": 3753.306,
    "text": "And it probably wouldn't be self-report either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.326,
    "end": 3760.054,
    "text": "It would probably be just, I think it's implicit cognitive rigidity tasks that she does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3760.338,
    "end": 3764.142,
    "text": " Most of the time, I don't think she actually does much on on the self report side of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3767.946,
    "end": 3769.768,
    "text": "Okay, kind of zooming out a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.349,
    "end": 3786.987,
    "text": "How do you think ideology will evolve or change as cognitive science brings new insights into neuro mechanistic aspects, and real time and different influences on ideology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.637,
    "end": 3797.392,
    "text": " Because it's been, I think, as your interdisciplinary approach is showing, there's like political analysis of, psychological analysis of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.892,
    "end": 3803.582,
    "text": "So as these puzzle pieces come together, what is that going to look like and what ideology comes out of the wash there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.425,
    "end": 3812.637,
    "text": "Well, I mean, I think there's this tendency for people to always try and point out gaps, to try and...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.836,
    "end": 3841.813,
    "text": " support a perspective that they'll have and this fitting of all of the gaps gives enough of a reasoning to try and go this is correct rather than this and there's a lot of ideological perspectives that people have which are a bit problematic and if you have so much science refined around the idea of it's bad to reject a nuance in a sense then it at least",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3842.165,
    "end": 3844.467,
    "text": " builds up evidence for that perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.628,
    "end": 3857.118,
    "text": "I also think that it can help in structure societal change and a predictive mechanism for people inside debates with elites, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.598,
    "end": 3863.303,
    "text": "And these things can add to a betterment of society and reducing the polarization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3863.383,
    "end": 3870.99,
    "text": "But if we're talking about the changes of ideologies with consideration to these things, I think it'll only be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3871.544,
    "end": 3897.552,
    "text": " uh if someone considers what we're saying uh then there's so much evidence behind it that it can show it's bad to be absolutist basically it's bad to not be nuanced inside any direction anyone takes you know it encourages everybody no matter who it is to be a bit more nuanced and maybe socratic and question themselves and never be fully certain about anything hmm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.978,
    "end": 3915.0,
    "text": " do you feel that that might come into play in power discussions like how would this how would this um for somebody let's just say experiencing that rigidity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.98,
    "end": 3934.896,
    "text": " How would this land or what if rigidity remains a viable cognitive strategy, even in light of knowing about it, like in an almost a sort of cooperate defect fashion, like a global optimum could be reached with two flexible parties, but one rigid and one flexible leads to a different outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3936.901,
    "end": 3937.963,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.983,
    "end": 3945.214,
    "text": "Well, I think if we're talking about rigid inside the temperature dynamic, then it's good at going down a path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3946.276,
    "end": 3951.625,
    "text": "But if there's the option of both exploring and going down that path, then it's very unlikely that it's going to be correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3951.825,
    "end": 3953.868,
    "text": "It's just there's a statistically less chance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.449,
    "end": 3958.656,
    "text": "The arguments of who will be better inside any political dynamic...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3959.463,
    "end": 3961.586,
    "text": " That's not really necessarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3961.606,
    "end": 3963.528,
    "text": "I can't say either way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.029,
    "end": 3967.213,
    "text": "It's impossible to predict who's going to be better in any situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.313,
    "end": 3976.005,
    "text": "But the probability that an un-nuanced path would be better is quite low because it's a rejection of considering alternatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.486,
    "end": 3981.392,
    "text": "It's not a rejection of something because it could be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.512,
    "end": 3986.719,
    "text": "If you're considering alternatives, you could still go down the same path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.699,
    "end": 3990.11,
    "text": " But if you're just not considering alternatives, you're just lowering your chances of success.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3990.25,
    "end": 3992.076,
    "text": "And that's what I meant more by the rigid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.417,
    "end": 3997.232,
    "text": "And if we have the assessment of the people in power, then it's more treating people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.039,
    "end": 4021.11,
    "text": " like they have, like if they are overly rigid, and they're, you know, like, in charge of, like, Kim Jong Un in charge of North Korea, it would give a perspective of analyzing them not as a rational party, but as someone who can be predicted based off what they find is important to them, and what they're likely to do on very narrow, rigid circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.069,
    "end": 4028.803,
    "text": " You can probably give diagnostic criteria for them of what they're likely to consider in a lot of ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.083,
    "end": 4043.352,
    "text": "And you can also point out that because of their rigidity and their lack of consideration of alternatives, they're very unlikely to act outside of very predictable metrics according to the dynamics they have chosen to act currently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4044.867,
    "end": 4046.73,
    "text": " Yeah, two things that makes me think of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.97,
    "end": 4063.416,
    "text": "First, the more templated or rigid a given actor is, the more predictable their behavior is in terms of their sensemaking and decision selection, which actually can be a strategic detriment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.396,
    "end": 4087.108,
    "text": " so open openness or flexibility it leaves leaves leaves the possibility open for action that's difficult to predict and then also when we start to see the reasoning type models so again to the sort of earlier question of how do Markovian generative models come to capture multi-stage",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.73,
    "end": 4104.49,
    "text": " reasoning like processes and how do we model the duration of thinking in behavior basically this reflective to reflexive continuum the more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.955,
    "end": 4130.916,
    "text": " rigid focusing just on the on a language model example the more rigid the distribution of the next token the less thinking matters because it's just being captured in small attractors whereas the larger the vista for reasoning the more combinatorics and the more semantic exploration can happen in that chain of thought space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4130.896,
    "end": 4141.598,
    "text": " And so there can actually be semantically important considerations and kind of a space for there to be adaptive updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.995,
    "end": 4170.522,
    "text": " so it's a and then there's a fundamental trade-off because there's the time cost of thinking and there's also like rumination and so on so there's no free lunch there's no general strategy that can be you know in a system independent way and that's not what the framework does uh as you you basically said with the with the political case as well it gives us these state spaces where these very grand trade-offs can be elucidated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.502,
    "end": 4198.23,
    "text": " and they apply importantly to different scales of deliberation like reflective and reflexive could be happening to a given person or it could be a group deliberative process and so that points the way to very interesting synthetic approach to understanding the first principles of of biology and ourselves as political yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.531,
    "end": 4199.052,
    "text": " I mean, 100%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4199.973,
    "end": 4208.943,
    "text": "The idea of exploration, meaning that you're in the exploratory thing, so there's more exploration, the more thinking that happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.223,
    "end": 4214.73,
    "text": "And if you're in a rigid thing, the more dramatic changes that happen, I think is quite apt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.03,
    "end": 4227.424,
    "text": "But it's also interesting to consider that if you are theoretically open to a plethora of different options and you are exploring quite a lot, then you are also going to have more of a normally distributed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4228.18,
    "end": 4233.088,
    "text": " perspective on things whenever there's a chance of noise cancelling out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.148,
    "end": 4246.611,
    "text": "So that sounds a bit odd, but basically when you have a massive amount of exploration and you're considering everything, sometimes you can look the same as everyone else who is considering everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.81,
    "end": 4267.941,
    "text": " Even though you are theoretically thinking more and you're doing a lot more, you give the appearance of being more predictable and more of all these things, and you probably are to a degree just because you have a normally distributed consideration of a lot of different alternatives rather than going down one absolute direction and then dramatic change to another absolute direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4268.444,
    "end": 4269.546,
    "text": " There are issues with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4270.728,
    "end": 4292.562,
    "text": "The reason why I was more interested in the predictable elements of authoritarians and their rigid mentality is because you can, through a nuanced understanding of them, give more of a distinct prediction to them than you could around someone who is exploring all the things all the time and trying to make accurate predictions of everything through a non-rigid mentality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.655,
    "end": 4306.914,
    "text": " And it's sort of the U-shape curve, the entropy curve returns again, where in one game situation the same move is always selected, in the other it's a uniform distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.294,
    "end": 4318.971,
    "text": "In both cases, while it's easier to predict the one move player than the specific square, you do know the distribution that the uniform player is going to select.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.288,
    "end": 4325.357,
    "text": " So it has a predictability, but not in detail like the one move player does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4325.397,
    "end": 4334.369,
    "text": "And then in the middle are sort of strategies that have all this different complexity in terms of actually having adaptive possibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4337.594,
    "end": 4346.106,
    "text": "So what are your next moves or how could people provide feedback or what are you looking to kind of get to next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.301,
    "end": 4350.164,
    "text": " What are we looking to get to next term?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.184,
    "end": 4356.21,
    "text": "Well, integrate ourselves with the active inference community more, talk about as much development as we can inside the area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.171,
    "end": 4367.021,
    "text": "We're very interested in the writing of this book that we have and trying to get a career in the computational neuroscience of politics, which would be pretty interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.181,
    "end": 4372.887,
    "text": "But we're exploring all our options and trying to help out people along the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.525,
    "end": 4390.993,
    "text": " I do like the idea of the sophistication in game theory as the predictable nature of things, but I think there was an interesting study on artificial intelligence and general intelligence in the deep learning of AI, and it kind of showed that when they trained a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.973,
    "end": 4400.97,
    "text": " chess bot to predict one move ahead, it was actually better than when they changed a chess bot to predict two moves ahead, except through five times the amount of data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4401.551,
    "end": 4412.128,
    "text": "So there's a strange thing, which is that a higher level sophistication is more like you're just trying to go into the chaos of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.229,
    "end": 4417.217,
    "text": "Whereas if you try and do everything one step at a time, a lot of the time it actually adds out to something better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4420.066,
    "end": 4443.964,
    "text": " well there's a joke we've had for some years like active inference only works for one time step but you get to do it again and again and you can load everything into that time step but you only get one because if you were able to plan out trajectories of multiple it's equivalent to saying that you had already pre-imagined all of what you could have received",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.944,
    "end": 4452.823,
    "text": " And if you want to do a rollout with all that you could have received from your first action in terms of all the ways that that could influence your second action,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.445,
    "end": 4475.503,
    "text": " even with a small state space you're already getting into these absurd rollouts so that kind of is the justification for having an action perception loop that's ongoing whether it's called run time or real time or online inference or just active inference even when people don't really come at it from the free energy principle side they're just thinking about online learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.483,
    "end": 4490.32,
    "text": " and about systems that do active data sampling, those kinds of processes, it kind of reaches to the same place, which is like there is information in the consequence of action such that you don't know what you're going to do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.565,
    "end": 4513.438,
    "text": " by taking two steps ahead like you would by going one and then one and that's operationally how it proceeds either way and that's the sort of paradox of planning where planning is commonly modeled going back to again staying with our chess metaphor they're modeled as these trees of different possibilities and branching",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.84,
    "end": 4526.659,
    "text": " but we know that that is not what happens in the way that planning proceeds, or even if planning explicitly proceeds in analog systems in the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4527.921,
    "end": 4531.566,
    "text": "Yet it can be approximated with this sort of branching counterfactual play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.788,
    "end": 4538.477,
    "text": "However, in the one time step limit is sort of where biological systems have tuned themselves to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.242,
    "end": 4542.683,
    "text": "Yeah, makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.827,
    "end": 4550.517,
    "text": " I think it's easier to think of things in exploitative terms because there's less free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4550.557,
    "end": 4559.831,
    "text": "So I think maybe people delude themselves into thinking that they can climb three steps ahead just because I don't want to think about the other steps anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.593,
    "end": 4563.557,
    "text": "I want to think everything's this easy, but I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.993,
    "end": 4573.365,
    "text": " Yeah, well, in a reward or pragmatic value only setting, if you're considering one time step at a time, you do get greedy behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.066,
    "end": 4589.005,
    "text": "But then if you have epistemic value as a real contender, then you can still have action selection reflecting learning in that next time step because the expected information gain is legitimately valued.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.086,
    "end": 4599.699,
    "text": " And so that can even say like, well, I know that there's going to be a slight benefit if I go down that gradient, but there might be other information if I go up the gradient of pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.319,
    "end": 4610.832,
    "text": "And so by bringing the information gain into that next time step, then at least there's the possibility of making co-accounting for epistemic and pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.992,
    "end": 4618.401,
    "text": "And that's exactly what the kinds of modifications and attention variations that you're describing get to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.592,
    "end": 4621.993,
    "text": " I think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4622.954,
    "end": 4649.923,
    "text": "I think there's an interesting study, which is Axelrod's study of tit-for-tat, and it kind of showed that consideration of if you try and do the prisoner's dilemma over and over again, then the idea of in a study where everyone says the best things you can do for yourself is to focus on only doing the thing that will betray the other person and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4649.903,
    "end": 4654.332,
    "text": " and selfishly get you the best points, and you should always choose that option inside this prisoner's dilemma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.352,
    "end": 4666.537,
    "text": "But in the study where they did it 50 times in a row, and it was computer programmings trying to do them against each other, everyone thought, let's make the selfish bot which can try and take advantage of the other people because we're competing to try and who has the best bot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4667.158,
    "end": 4669.583,
    "text": "And all the selfish bots did a lot worse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.035,
    "end": 4672.499,
    "text": " It was the most forgiving bots did the best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.639,
    "end": 4678.928,
    "text": "It was people who did it better than a tit-for-tat basis across all the examples of interactions they went into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4678.968,
    "end": 4680.21,
    "text": "They did the best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.991,
    "end": 4690.004,
    "text": "And it's not that in each individual situation they did the best because they would have a bot which could either draw or lose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4690.445,
    "end": 4696.313,
    "text": "But across every interaction, their average amount of points was always the best, which kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4697.002,
    "end": 4705.353,
    "text": " kind of does show your thing about doing things in a individual basis, you're doing it one step at a time, then that would be a lot worse for you as an individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.473,
    "end": 4722.655,
    "text": "But if you have consideration to this vaguely nuanced perspective of being cooperative in society, being a cooperative organization or a cooperative country across all the interactions you have, even if you're not doing it, if you're doing it in a I draw or I lose because of the plethora of good",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4723.023,
    "end": 4742.145,
    "text": " cooperative techniques you have across all the situations you're in you do a lot better than someone who does things selfishly and that's that's i think very similar to that totally totally agree awesome yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.362,
    "end": 4754.274,
    "text": " It's also, if you're interested in global change game, it's this thing when they put people who have very strong right-wing authoritarianism into a game, and it's a four-hour simulation of controlling the whole world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.575,
    "end": 4766.327,
    "text": "And when they put very strong, super authoritarian people inside the game altogether, they started off giving each other wedgies, wrote on a piece of paper, look after your own, take care of your own type of thing, and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4766.307,
    "end": 4791.285,
    "text": " they committed nuclear war on each other that was the worst game they'd ever seen they had to restart it and then there was more nuclear war and in the opposite when they had the least authoritarian people in there they weren't you know going i will bomb you or you give me all your money type of thing they were going let's try and work together even though it was meant to be a competitive game they apparently had the most cooperative game they'd ever seen even though 400 000 people in this world scale dynamic thing still died",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4792.379,
    "end": 4803.699,
    "text": " And it's an interesting look at the reflection of how cognitive rigidity, because it's attached to right-wing authoritarianism, because the traits are being conventional authoritarian, authoritarian aggression, submission and conventionalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4804.64,
    "end": 4814.117,
    "text": "Cognitive rigidity is a strong factor in how cooperative people are in political dynamics and also how much political dynamics can be reduced to chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4816.274,
    "end": 4816.995,
    "text": " Hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.015,
    "end": 4821.002,
    "text": "And yeah, a lot of ways to go with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4821.904,
    "end": 4832.603,
    "text": "But I mean, your presentation and and hopefully the forthcoming works will bring some of that thinking out more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.324,
    "end": 4836.169,
    "text": "And I look forward to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4836.21,
    "end": 4836.71,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.512,
    "end": 4839.295,
    "text": "Anything else you want to say or ask?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4840.473,
    "end": 4866.143,
    "text": " uh no i mean it's been a pleasure um thank you for the opportunity i'm sorry if i didn't do the presentation very well i kind of sprinted through quite a bit of things and such but i really appreciated it thank you yeah hope people enjoyed it and follow up with a contact if they have any additional comments they'd like to provide and good luck with the work see ya bye",
    "speaker": "SPEAKER_00"
  }
]