[
  {
    "start": 7.152,
    "end": 8.314,
    "text": " Hello, welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.895,
    "end": 13.923,
    "text": "It's March 28th, 2025, and we're in quarterly roundtable number one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.968,
    "end": 22.978,
    "text": "We are a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.719,
    "end": 26.364,
    "text": "You can find us at the following platforms and links.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.485,
    "end": 29.789,
    "text": "This is a recorded and archived live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.39,
    "end": 33.295,
    "text": "Please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.68,
    "end": 35.663,
    "text": " all backgrounds and perspectives welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.745,
    "end": 40.15,
    "text": "Video etiquette for live streams is as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.573,
    "end": 48.302,
    "text": "Head over to ActiveInference.Institute to see our static page and links from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.342,
    "end": 56.654,
    "text": "Take a look at this slide for a lot of stable short links and entry points into different activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.717,
    "end": 59.839,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.92,
    "end": 87.953,
    "text": " we will have a lot to talk about today in this round table we will talk about Institute projects then ecosystem projects then talk about some speculative designs for 2025 and then at the end we will check the live chat for questions and comments first though let us introduce ourselves so I'm Daniel I'm the president and one of the co-founders of the Institute and I'm here with Alexandra",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.658,
    "end": 89.058,
    "text": " Greetings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.9,
    "end": 104.254,
    "text": "I am the VP of the Institute and a new officer starting in 2025, working along with Daniel to further the goals of the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.274,
    "end": 104.494,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.395,
    "end": 105.635,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.296,
    "end": 108.258,
    "text": "So let us head into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.959,
    "end": 115.105,
    "text": "And again, looking forward to people's comments written in the live chat, which we'll get to at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.485,
    "end": 128.304,
    "text": " Let's start with some updates at the Institute scale and begin as befits the year and moments with some generative visualizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.747,
    "end": 138.561,
    "text": "So while this from 2023 and versioned since provides more of a structural anatomical view,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.541,
    "end": 163.772,
    "text": " here with a few quick prompts we see a bit more of the pie policy selection planning as inference all that good stuff happening amidst a thriving vibrant ecosystem with kind of dolly-esque and graphical models rivers nature different kinds of synergetic structures geodesics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 163.752,
    "end": 185.929,
    "text": " flowers and trees life tables chairs people all that happening in the ecosystem so there's going to be some technical details there's going to be a lot of nitty-gritty at times but this is the bigger picture and vision that together with the institute as just one player in a broader ecosystem we can make some awesome things happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.968,
    "end": 212.862,
    "text": " 2025.activeinference.institute is kind of a history in real time page it's a good entry point nested under a history page and it archives what's happening this year what is upcoming and as the months fly by we move them down to the bottom of the page and in doing so document what's happening as it happens",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.407,
    "end": 235.137,
    "text": " through many of these short links like ecosystem or others you will find yourself moved into this living coda document which has many many many nested pages it can be a lot so a couple tips",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.534,
    "end": 239.86,
    "text": " First off, you can download a PDF.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.541,
    "end": 242.644,
    "text": "You can go to print and PDF, export it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.684,
    "end": 248.214,
    "text": "You could upload it to your favorite perplexity or similar service to have a direct chat with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.316,
    "end": 255.647,
    "text": "And that chat affordance is also provided at the Institute and Ecosystem page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.107,
    "end": 260.635,
    "text": "So you can have that kind of interactive discussion with the documentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.834,
    "end": 273.713,
    "text": " and at a top level that document which thankfully ends gladfully is in the most updated shape that it's ever been contains pretty much one section on the Institute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.908,
    "end": 294.537,
    "text": " pie and then another main section on the ecosystem itself so within the institute part you can learn who and what are we what has happened here why it's important to support it mission vision values principles and projects all these different things that have happened and are happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.517,
    "end": 316.947,
    "text": " and then out in the ecosystem we'll continue to do our best to curate at the topical and at the project scale what is happening out there and in doing so provide unique services for people who want to ask questions like what is the status of active inference and robotics or law or economics or society or category theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.927,
    "end": 337.855,
    "text": " totally concise valid relevant questions that we look forward to having people as with all activities step into stewarding in this fractalized way these important domains so that with stable links and reference there's an entry point that's kind of always welcoming",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.919,
    "end": 346.758,
    "text": " alignable and soft landable for people who want to start learning and applying as we aim to support.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.322,
    "end": 352.21,
    "text": "Getting to some of the bodies within the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.573,
    "end": 355.658,
    "text": "So we have convened our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.034,
    "end": 360.88,
    "text": " Third or fourth scientific advisory board?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.94,
    "end": 362.803,
    "text": "We could check.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 363.104,
    "end": 366.711,
    "text": "It's the largest of the SABs assembled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 367.653,
    "end": 372.242,
    "text": "And we've had monthly meetings in the past month.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 372.342,
    "end": 375.148,
    "text": "Just this week, we had two great meetings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.128,
    "end": 400.663,
    "text": " uh the scientific advisory board is our informal guidance board and they're focusing their activities first off showing up and participating as individuals in however they see fit and also focusing their activities on supporting the research fellows program supporting mentoring providing mentoring especially to the interns",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 401.808,
    "end": 430.414,
    "text": " providing review and feedback for example on projects applications as well as go no-go type decisions or critical feedback for different projects or grants that we might apply for mission and vision keeping that year-round bonfire discussion about what what do we need what does the ecosystem need how can we do what we should do be who we should be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.394,
    "end": 450.748,
    "text": " and helping to seek out, forage, forge partnerships, which we'll talk more about, but relationships with other organizations, providing different kinds of synergistic win-win type outcomes between the Institute and what we can do, what we are, and with what organizations are doing out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.218,
    "end": 457.489,
    "text": " Looking forward to working more this year with this really awesome and multifaceted SAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.789,
    "end": 465.683,
    "text": "So thank you to everybody who has already stepped in and showed up for what we've gotten started with SAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.92,
    "end": 488.818,
    "text": " onto the formal bodies of the officers and the board of directors so on the officer side officers are operational administrators they consist of myself as the president and treasurer and Alexandra Mikhailova as the vice president and secretary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.798,
    "end": 499.576,
    "text": " So as the president, I aim to provide overall leadership, direction, and support the Institute programs, and as treasurer, support the financial responsibility and accountability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.698,
    "end": 511.195,
    "text": "Alexandra, as the vice president, shares in those responsibilities of the president, and as secretary, provides logistical support with a focus on knowledge engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.917,
    "end": 526.416,
    "text": " On the board of directors, we have convened a new cohort with some new characters and some returning BOD members, John Klippinger, Blue Knight, Alex Vyotkin, Daniel Friedman, Mike Smith, and Vladimir Baulin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.297,
    "end": 537.79,
    "text": "And each of the board of directors are looking to and already playing really important strategic roles, helping us expand the time horizon of where we're looking and where we're going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.305,
    "end": 547.019,
    "text": " It is not too early to think about being an officer or board of director in a future year, possibly 2026, possibly later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.981,
    "end": 554.833,
    "text": "Learning more and getting involved is the best way to reduce your uncertainty about whether these roles might be apt for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.488,
    "end": 565.702,
    "text": " It's also useful to get involved and start to build your history at the Institute and ecosystem, have that open source footprint, and find a co-creative synergy with your work and development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.102,
    "end": 572.05,
    "text": "So these are volunteer positions at this time, though I hope that they can find more support in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.872,
    "end": 575.455,
    "text": "And thank you to officers and BOD.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.616,
    "end": 579.259,
    "text": " All right, getting into some of the programs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.28,
    "end": 589.412,
    "text": "Research Fellows is a program that we began last year with these affiliated researchers and developers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.253,
    "end": 602.708,
    "text": "There are currently five Research Fellows in the game right now, and you can find from Fellows short link more information and link out to each of their products, projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.688,
    "end": 629.202,
    "text": " and they're each working on super fascinating activities and periodically share in through measurements and through live streams and other kinds of reporting what they're working on across super different domains i'll also just note that at the donate short link the drop down menu enables support to a given research fellow project so these are all works in progress and evolving",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.182,
    "end": 654.598,
    "text": " At the organizational level, though, we hope to pattern out this possibility of people who think that a piece of work is really exciting and they want to support it, kind of like having a name on a building at a department at a university or supporting a given project, have the oversight capacities for spinning up to arbitrarily",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.578,
    "end": 674.865,
    "text": " high and exciting levels the work of these research fellows and providing this rotating and evolving space where we provide them support ranging from the affiliation and the email address on through supporting their research and and their time and involvement so jf anna john david and robert",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 674.845,
    "end": 687.042,
    "text": " Thank you for being some of our earliest research fellows and for carrying out your work, which is improving a lot of the aspects of the applicability and scope and the breadth of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.362,
    "end": 688.544,
    "text": "So cool work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.724,
    "end": 690.386,
    "text": "Looking forward to sharing more of these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.406,
    "end": 699.739,
    "text": "A little bit more will come up in later updates in this roundtable and also live streams and the updates just from following these people's work separately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.035,
    "end": 705.536,
    "text": " Partnerships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.917,
    "end": 721.525,
    "text": "So partnerships are structured relationships, consensual, confirmed, between the Institute and other organizations who are looking to make meaningful, visible, custom, impactful contributions to the Active Inference open source ecosystem,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.505,
    "end": 750.583,
    "text": " support the sustainability and the reach of the Institute through financial and or in-kind contributions, organizations who are looking to upskill and accelerate their own processes of learning and application, looking to connect with our community and the growing field and talented and enthusiastic interns, to form regional language and sector level collaborations, any intersectional subsets of those,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.255,
    "end": 756.22,
    "text": " and to provide critical strategic input and guidance to the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 756.892,
    "end": 779.065,
    "text": " As of last year, we had two partners, First Principles First and Neumann Games, and this year we have announced and developed our official partnership with Lazy Dynamics, who lead the development of RxInfer Pro and co-supervise RxInfer through the open source community ReactiveBase frameworks for building active inference and Bayesian agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.927,
    "end": 785.515,
    "text": "So if this is an interesting possibility and a pretty open one at that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.495,
    "end": 796.703,
    "text": " then definitely reach out there are a lot more things happening in the ecosystem which is super exciting to see and so whether it's a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 796.835,
    "end": 812.26,
    "text": " lab, established research academic lab or one that's just beginning or whether you're a startup or looking to have some active inference implementations or bi-directional conceptual or technical transfer happening within an established company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.961,
    "end": 818.149,
    "text": "Lots of opportunities to gain some of these benefits and that link will share more information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.313,
    "end": 822.977,
    "text": "To the topic of philanthropy and support.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 824.29,
    "end": 838.317,
    "text": " it is 2025 our fifth year of all volunteer operations to be totally honest and clear as i am massively appreciative to be able to be such in this roundtable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 838.583,
    "end": 844.11,
    "text": " we're at a critical juncture in how we proceed in our structure and function within the ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.571,
    "end": 856.447,
    "text": "So just to give some of these details and then explain the generative AI over here, we are registered in Delaware in the United States as a 501c3 tax-exempt educational nonprofit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.408,
    "end": 863.376,
    "text": "And we made that strategic move because we believe that philanthropic and grant-type support",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.014,
    "end": 893.717,
    "text": " is and and would be essential as we build towards a more impactful and sustainable organization we have a main donate.activeinfluence.institute paypal link which any amount could be provided through that channel there's also the donation affordances on substack the newsletter and through youtube and more broadly we seek some patrons or sponsors or partners who might like to provide a type of zero to one like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.697,
    "end": 902.323,
    "text": " relationship or help us connect or communicate with individuals or organizations who could help us in that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.641,
    "end": 927.703,
    "text": " you believe in the past present and future value of what we're doing at the institute this is a key direct ask with measurable relevance and leverage for our work in the years to come this is really the time to at least consider it and consider what well here in this sort of two roads diverge robert frostian style there's sort of two archetypes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.818,
    "end": 939.715,
    "text": " This is just speaking personally with some ways about how I've been thinking about this over the past months and years even and where it all fits into my own life too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.217,
    "end": 947.246,
    "text": "Two possible fractal distinctive paths for where and how the Institute proceeds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.307,
    "end": 957.42,
    "text": "Here on the right, the city on the hill and the accumulation of resources and the Institute as a router and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.025,
    "end": 982.952,
    "text": " inputs of resources outputs of resources and a density in the center possibly routing millions of dollars are arbitrary numbers of zeros of different currencies in different ways with this extremely professional non-profit possibility and structure that exists and is recognized globally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.468,
    "end": 1003.118,
    "text": " on the other side of this fork is something like a torus or a donut where enrichment is occurring healthy it's a healthy donut enrichment is occurring in the periphery in the shoulders and in the ecosystem around the institute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1003.098,
    "end": 1018.39,
    "text": " and the institute retains this absolutely priceless special unique character that i believe it has today of a volunteerist potluck type volitional convening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1019.332,
    "end": 1045.963,
    "text": " yes with communication channels however not the same formal resourcing that is required to have city type infrastructure so while there's many kinds of distinctions and gradients that that i believe that we can uh have it both ways or be in a quantum super positionality purely from an administrative perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.602,
    "end": 1075.377,
    "text": " 2025 is going to be a really critical year in at least whether we take steps towards yes we are going to be working with partnerships and philanthropic donors and companies and grants that want to see and want to be part of the journey towards having this civilizational level infrastructural centralization construction even with broad productive lands beyond",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.01,
    "end": 1091.475,
    "text": " and also in what ways or what other vehicles or what higher level understandings is this donut style where we keep space and wildness in the center",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.557,
    "end": 1117.497,
    "text": " and still support through enriching and improving people's connectivity weaving fabrics supporting fundraising rounds finding people the different opportunities that are going to support their lifestyle in their location and then with one or 10 or 30 hours a week out of an abundance they may still want to volunteer or be involved in the institute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.477,
    "end": 1131.047,
    "text": " but again that's different than the city and all that it entails and I like this image too because it highlighted there are many branching paths in the end though we are just going to walk forward so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.179,
    "end": 1157.068,
    "text": " not to overly dichotomize it but i wanted to share that because that is something that i'm thinking about and the decision has been easy and made for us in the previous years with the low income and low outflows this is a pivotal year though in understanding and formalizing that a little better so many many ways to help and and hopefully people provide their their input and support on that avenue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.213,
    "end": 1161.104,
    "text": " Okay, getting to some of the project level updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.184,
    "end": 1167.649,
    "text": "First, the projects within the Institute, and then getting into some of the projects that are happening in the ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.75,
    "end": 1197.855,
    "text": " so the obsidian dot active inference dot institute short link will take you to an obsidian sync front end obsidian dot md is a open source plain text knowledge engineering style that is also going to come up a little bit later in this round table as well and that short link",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.835,
    "end": 1218.949,
    "text": " is a live interactable version of the information that's at this github repo called cognitive and we can go to it this has been the result of some conversations and development over the last few months of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.587,
    "end": 1233.259,
    "text": " having interactable networked ways to learn and apply active inference and guides and all kinds of ways to explore different topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.298,
    "end": 1252.598,
    "text": " developing learning paths so once the template for the learning path was out there it became very possible okay what's the entry point and the bi-directional course from pragmatism or robotics or cognitive security or whatever it happens to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.152,
    "end": 1264.935,
    "text": " developing these learning paths in and out within the context of this broader repo, which provides a lot of support for learners, as well as for autonomous agents who are processing this information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.416,
    "end": 1271.768,
    "text": "And you can clone the repo and access it locally, graphically explore it, or you can use the Obsidian Sync.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.748,
    "end": 1285.487,
    "text": " so the idea is to support interactive modular interlinked resourcing and documentation for learning and applying active inference as well as adjacencies related to math neuroscience computer science etc",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.092,
    "end": 1302.696,
    "text": " Use generative AI wisely for every last mile of learning accessibility and applicability in terms of bringing it to people's preferences and palettes with language, settings, styles, level of math, notation formatting, all these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.757,
    "end": 1314.613,
    "text": "And be part of building these interoperable methods for graphical exploration using simpler wiki and obsidian style hyperlinking, backlinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.593,
    "end": 1333.243,
    "text": " as well as using more advanced graphical database techniques so cool new learning resource enabled by cursor and generative ai and providing a lot of resources and on ramps and off ramps and ways to apply active inference that weren't there just a couple months ago",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.569,
    "end": 1345.342,
    "text": " In the Active Inference textbook group, we are active with Cohort 7, who's in the second half of the book, and Cohort 8, who has begun the first half of the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.144,
    "end": 1360.243,
    "text": "This is the still only Active Inference textbook that's out there, the Parr, Pizzullo, and Friston 2022 textbook, which has also been translated into several languages over the previous years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.223,
    "end": 1370.82,
    "text": " I'd like to especially appreciate Andrew Pachea, who has been facilitating the second later in the day meeting of the textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.08,
    "end": 1372.382,
    "text": "It's been awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.043,
    "end": 1380.816,
    "text": "And the people who watch the recordings, the people who are showing up, it's been a great epistemic experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.257,
    "end": 1382.839,
    "text": "And we continue to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.292,
    "end": 1392.762,
    "text": " revisit classic questions bring new questions onto the table and it remains to be a great attractor and also we're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.079,
    "end": 1414.395,
    "text": " always pulling back and seeing where does this textbook group fit in with this unfolding ecosystem of learning resources and experiences and so there's a lot of ways in which again with wherever and however people want to volunteer or find some sort of supported way to get involved",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1414.375,
    "end": 1428.148,
    "text": " There's a lot of ways in which we could modularly start to think about some mitosis or transfer learning, maybe another textbook group for another book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.628,
    "end": 1432.432,
    "text": "We plan to do so for Sanjeev Namjoshi's book when it's available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.872,
    "end": 1437.177,
    "text": "Maybe there's some other books that having a discussion group around would be useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.858,
    "end": 1442.982,
    "text": "Something around applications specifically, math learning group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.962,
    "end": 1445.698,
    "text": " all these kinds of things which we can explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.235,
    "end": 1474.487,
    "text": " And in that potentiality, without anyone jumping in to lead one of those efforts, we dwell and attract to this big convergence space that's really welcoming, really bringing in people from different backgrounds and all around the world, different time zones who are wanting to just learn more about active inference and also check in weekly, see what's happening with the Institute and hear about other opportunities through there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.256,
    "end": 1486.29,
    "text": " In audio visual production, we continue to produce open source audio visual materials and release them, disseminate them into the Active Inference ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.691,
    "end": 1490.476,
    "text": "So we've had a pretty interesting first quarter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.558,
    "end": 1501.892,
    "text": "We've had a handful of guest streams and a model stream, a math art stream, and several Active Inference streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.53,
    "end": 1517.755,
    "text": " Looking at the guest streams this quarter, what really reflected on me was how possibly with the almost exception of the slime mold and philosophy, Matt Sims guest stream,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.865,
    "end": 1538.726,
    "text": " Almost all of these relate in a way to humans and computational and cognitive interactivity, whether through probabilistic models and their integration with LLMs or more explicitly like human computer interaction and cognitive experience design questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.766,
    "end": 1546.915,
    "text": "So that is, I think, an emerging niche and interfacial relevance for active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.895,
    "end": 1562.455,
    "text": " in that sort of connective tissue and the space within and between different kinds of synthetic intelligence systems amidst a broader sort of pancognitivist understanding in human and social technical ecosystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.337,
    "end": 1566.4,
    "text": "I'll make this call one more time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.141,
    "end": 1574.37,
    "text": "If you have these skills or you'd like to learn some of these skills, like production,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.519,
    "end": 1585.879,
    "text": " audio and visual related, education, communication, any other, or some interest that you can't even put your finger on, but you're watching this live stream, please consider getting involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.838,
    "end": 1613.993,
    "text": " it is just me organizing these live streams and carrying them out there are a ton of other opportunities both in front of the facilitation and also behind the scenes and curating papers inviting people developing materials they don't have to be live streamed they don't have to be in English they can be with a different format like if you have ever felt oh if only there was a shorter video or one from this perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.445,
    "end": 1633.264,
    "text": " you've identified where your preferences could be either dissipated away by just updating, oh, well, it doesn't exist, c'est la vie, or maybe it's a call to action and it's the right moment for you to help step in to make that kind of material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.244,
    "end": 1658.29,
    "text": " so there's a ton of ways it would be really fun to have more audio and visual production and also connect this with different languages different backgrounds and learning paths so if that sounds something that is interesting it can be done in a really time boxed efficient way you could be an intern or it could happen outside of an internship but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.894,
    "end": 1683.484,
    "text": " hopefully this is an exciting opportunity to be involved in producing material either on the institute channel or even just supporting you in your own channel or or ways of disseminating so it's been super fun to have done five or six hundred live streams over the years and i'm really seeking some other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.464,
    "end": 1710.315,
    "text": " contributors who want to pick up that approach and just do it in a different way no need to recapitulate anything that I've done which has been just whimsical in many cases it's just about what is the real need and what would be something that upskills who wants to contribute and provides them meaning and value in the moment so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.295,
    "end": 1738.598,
    "text": " super fun project doesn't require technical expertise and active inference having somebody who wants to learn or just wants to explore can be the question catalyst that brings and creates these unique materials but you know 100 people in a room all asking the same question in their head but then no one says it or no one makes a video doesn't reduce too many uncertainties so i hope that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.983,
    "end": 1748.821,
    "text": " Some people who are interested in these topics and whatever formats they think could be meaningful or valuable, let's literally do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.842,
    "end": 1758.319,
    "text": "Do some new things during this year, just like Darius with Insights and Shanna with MathArtStream sort of led and templated last year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.982,
    "end": 1761.345,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.777,
    "end": 1790.1,
    "text": " a few weeks ago we found out that we did not receive funding for this project however this enabled us to publish it as a pre-print and now excitingly share it with you so this was a project that alexander and i thought we would write up increasing the accessibility and applicability of active inference generative playbooks and open source summer school curriculum development",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.958,
    "end": 1798.024,
    "text": " The letter of funding interest was submitted to Dana Frontier's program in pursuit of funding several promising activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.925,
    "end": 1800.046,
    "text": "The application was not funded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.326,
    "end": 1807.813,
    "text": "We have uploaded it as an open source artifact here, seeking participation and resourcing for these and other projects in due time, place, and fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.674,
    "end": 1820.965,
    "text": "The goals of this project were to develop generative playbooks for open source cognitive modeling, providing educational materials which empower communities to engage in active inference as learners, researchers, and practitioners,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1820.945,
    "end": 1837.076,
    "text": " and to develop an open source curriculum and pilot a summer school in 2025 to integrate our innovative online approaches with in-person opportunities, providing accessibility in this cutting edge area and embedding community perspectives in the future of neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.998,
    "end": 1840.843,
    "text": "So if either of these avenues are interesting,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1842.157,
    "end": 1846.263,
    "text": " today, March 28th, or in a future time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.924,
    "end": 1848.285,
    "text": "That's what it's here for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.345,
    "end": 1852.992,
    "text": "That's why we pre-print and show our work along the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.032,
    "end": 1860.402,
    "text": "Some of these things can pop up in the strangest of ways, maybe for you, maybe for someone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1862.255,
    "end": 1865.279,
    "text": " Getting to some of the Institute research projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.681,
    "end": 1872.75,
    "text": "So activities for the TNB, the Theoretical Neurobiology Group, have been active this year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.81,
    "end": 1876.435,
    "text": "I'll read the objective in the overview for this group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1877.116,
    "end": 1881.722,
    "text": "The TNB group has been fostering interdisciplinary research and collaboration for decades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.363,
    "end": 1889.393,
    "text": "Our mission is to advance the understanding and application of active inference, a theoretical framework developed by Professor Carl Thurston.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.373,
    "end": 1900.752,
    "text": " This is achieved through regular online meetings featuring presentations and discussions, which may include theoretical frameworks, empirical data and its analysis, simulations and mathematical development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.433,
    "end": 1910.368,
    "text": "We welcome contributions and perspectives from diverse fields, including neuroscience, mathematics, machine learning, psychology, philosophy, medicine, and biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.348,
    "end": 1923.512,
    "text": " The TNB for a long time was hosted through the affiliation and professorship of Carl Friston at UCL in London, and now is hosted at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.253,
    "end": 1933.69,
    "text": "So we look to work more with the excellent chairs of the TNB, who I will go to the website and scan over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.332,
    "end": 1944.423,
    "text": " So going to the TNB short link will pop you to this page where you can link over to the YouTube channel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.785,
    "end": 1950.752,
    "text": "You can click over to the meeting, learn more about how to participate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.135,
    "end": 1958.344,
    "text": "Riddhi, Miguel, Peter, Robert, and Christoph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.442,
    "end": 1973.211,
    "text": " and also see a little bit about some of the ways that we're working together between the Institute and TNB to make these extremely unique, very fascinating and historical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.727,
    "end": 2004.666,
    "text": " convenings something that feeds back into the active inference ecosystem and gives a platform and a place for people to present their work in really a unique way so thanks a lot to the tnb chairs and to carl friston and everybody who's participating in these very cool tnb meetings so in the rx infer projects we've had a lot of fun we've continued to meet weekly with a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.591,
    "end": 2006.733,
    "text": " Participants coming through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.773,
    "end": 2014.689,
    "text": "Facilitation by myself and Fraser and sort of guest star Fractal Facilitation popping in throughout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.771,
    "end": 2025.49,
    "text": "We discuss a variety of topics from late breaking updates in RxInfer versioning to minutiae of GitHub issues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.79,
    "end": 2028.654,
    "text": " And examples, we pull back, we think full stack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.075,
    "end": 2032.16,
    "text": "We talk a lot about engineering and about systems engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.362,
    "end": 2043.057,
    "text": "So pop in to the weekly meetings, which are currently on Thursdays at 13 UTC in the Discord a week ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.408,
    "end": 2056.512,
    "text": " We had a great stream with Lazy Dynamics and some guests along Bert de Vries over here and Fraser and talked about RxInfer and what Lazy Dynamics is doing about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.654,
    "end": 2067.171,
    "text": "And in the RxInfer short link, we continue open source development and documentation, building examples, asking questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.151,
    "end": 2068.634,
    "text": " Really exciting, really fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.035,
    "end": 2081.178,
    "text": "Just yesterday, even some fun advancements building off of an example that they provided using Flux to do neural network modeling within Julia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.278,
    "end": 2087.269,
    "text": "So we had Chaotic System hooked up to a neural network with an RxInfer probabilistic model on top and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.249,
    "end": 2107.485,
    "text": " talking about interpretability usability all these different ways in which rx infer and the examples that are being provided week after week are building a lot of contact points with contemporary machine learning methods so really exciting times and and work continues all right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.258,
    "end": 2110.702,
    "text": " A little bit about ecosystem projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.604,
    "end": 2129.676,
    "text": "So, the measurements that I'll share in this next section come from active participants at the Institute, so people who you'll see chatting a storm in a Discord or you might see facilitating or joining a textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.909,
    "end": 2155.883,
    "text": " people who are involved in watching the stream, as well as people just in the broader community, as we seek to convey and norm, hey, there's this measurement opportunity, there's this short link, measure.activeinference.institute, where if you submit, I saw a bird, or I wrote a paper, or whatever it may be, we want to, with your consensual permission in that form,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.032,
    "end": 2163.485,
    "text": " We want to bring that and give it visibility within the roundtable like is about to happen here and also in the newsletter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.346,
    "end": 2178.63,
    "text": "So the idea is streamlined gradients of reporting and ecosystem information flows grounded in active inference and free energy principle cognitive systems concepts and design patterns and modules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.673,
    "end": 2203.453,
    "text": " naming for this prepare and measure is based around the quantum active inference sort of duty cycle preparation is setting up the inquiry and your interpretive frame requesting support from the institute and the ecosystem hey i am about to do this i but i need this amount of support first or i am going to do this no matter what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.923,
    "end": 2212.333,
    "text": " here's what would be awesome support, or here's a way that the Institute or others in the ecosystem could be supporting this journey, this inquiry that I'm about to head out upon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.353,
    "end": 2214.962,
    "text": "And then measure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2215.668,
    "end": 2223.458,
    "text": " Reporting on what happened for your own logging and to share back into our broader community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.42,
    "end": 2226.422,
    "text": "Reset for the next preparation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.604,
    "end": 2232.59,
    "text": "Share your next steps and your learnings and ways for people to find out more or get involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.191,
    "end": 2239.499,
    "text": "And again, to get permanent visibility in the round table and in the newsletter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.521,
    "end": 2242.924,
    "text": "So this is kind of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.972,
    "end": 2252.003,
    "text": " Whatever the interface is, the screen, the qubit, whatever it may be that's happening, we are communicating across interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.08,
    "end": 2256.423,
    "text": " through space, through time, as we know it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.404,
    "end": 2282.226,
    "text": "And we're seeking to balance these sort of operational considerations of streamlined accessible information flows, meeting people where they're at in terms of the information they want to share and the information streams and types that they want to receive with some really, really exciting technical ways to compile the information and rebroadcast it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.628,
    "end": 2305.75,
    "text": " really at the heart of the matter is people wanting to share in their updates and care about what other people are doing in the ecosystem so let's look at some of those okay research discovery engine project gen 25 there's some links here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.012,
    "end": 2316.542,
    "text": " We're building a platform that leverages advanced AI, including LLMs, topic modeling, agents, and active inference to accelerate and increase the impact of scientific research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.562,
    "end": 2318.644,
    "text": "This will be available on mobile and the web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.166,
    "end": 2334.42,
    "text": "This quarter, we applied for funding, launched a website, created a GitHub, produced a product roadmap, began integrating several functional databases and AI oriented backend services, and began collaborating in real time and asynchronously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.109,
    "end": 2354.974,
    "text": " And in terms of the impact of this work, just reading from the form that was submitted by the team, it opened the doors to existing active inference researchers and will provide all researchers or anyone epistemically curious to explore novel areas, ideas, and topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.954,
    "end": 2374.583,
    "text": " by employing a variety of solid paradigms in category theory and agentic modeling we aim to dramatically increase the rigor of existing and potential contributions we will employ a custom score tailored for each user that evaluates research along several important dimensions and the team here is andrea ferris",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.563,
    "end": 2387.661,
    "text": " And I'll just zoom in on this image.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.257,
    "end": 2407.101,
    "text": " So our funding application is pending for this project and it's been volunteer work with some of it being shown through the links in the repo on this page and a lot of it is also developing on the sideline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.081,
    "end": 2409.203,
    "text": " So a lot of fun topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.704,
    "end": 2419.754,
    "text": "We're working on a paper to milestone, and then we will reduce our uncertainty about what to do next when we find out about the current pending grant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.635,
    "end": 2434.81,
    "text": "But one of the big topics here and inspired by a lot of the work happening with the knowledge graphs was thinking about different sorts of epistemic foragers, whether a learner engaging in discovery,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.992,
    "end": 2461.472,
    "text": " and education or whether a researcher looking to evaluate a field or make their own kind of contribution how to have these different views and elements on the path to discovery both new to the person like education and new overall like a research discovery using a variety of tools like embeddings and concept maps to understand what areas are unexplored",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.853,
    "end": 2484.011,
    "text": " be able to do pathfinding, wayfinding, waymaking within different kinds of informational spaces, and also connect that to real people and collaboration opportunities in a really accessible way so that people can see where they're at informationally, socially, et cetera, and have support in their journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.592,
    "end": 2491.898,
    "text": "So it's been really awesome to work with this team and I hope we can continue and find support for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.346,
    "end": 2505.69,
    "text": " Okay, Jonathan Schock from Schock Lab at the University of Cape Town in South Africa asked me to pass on this postdoctoral opportunity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.331,
    "end": 2515.168,
    "text": "So for researchers who might be interested in joining a dynamic team working on active inference in relation to affective consciousness,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.148,
    "end": 2530.366,
    "text": " This position offers an exciting opportunity to work at the intersection of computational, cognitive, and affective neuroscience and artificial intelligence in collaboration with leading researchers in the field, including Dr. Ryan Smith and Cheryl Van Hoof.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.267,
    "end": 2537.034,
    "text": "And it's co-advised by Professor Jonathan Schock and Professor Mark Solms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2537.535,
    "end": 2538.876,
    "text": "So pretty cool opportunity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.936,
    "end": 2540.498,
    "text": "Thank you, Jonathan, for sharing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.047,
    "end": 2549.515,
    "text": " Kolja Kurzer, an intern, has done a very cool update over the last several days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.935,
    "end": 2551.397,
    "text": "So I'll load up the website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2553.079,
    "end": 2555.361,
    "text": "This is what the website looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2561.267,
    "end": 2563.79,
    "text": "Interactive website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.073,
    "end": 2567.734,
    "text": "Terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.684,
    "end": 2600.286,
    "text": " are embedded coda panels from our active inference ontology document so culture wrote the prototype of the idea developed in my master's thesis finally materialized into website i built the website using obsidian and quartz form and hosted it via github pages most of the included theoretical sentences included thus far are from millage at all 2021 a mathematical walkthrough and discussion of the free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.755,
    "end": 2606.322,
    "text": " I just arrived at expected free energy and I'm planning to include the low and high road from par at all textbook next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.143,
    "end": 2608.345,
    "text": "So what happened?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.385,
    "end": 2614.753,
    "text": "Launched the website, the first 40 sentences, first presentation of the idea and the prototype in Leipzig, Germany.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.775,
    "end": 2624.586,
    "text": "And this is really fascinating, so I hope people read about Golgi's work and see what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.566,
    "end": 2633.125,
    "text": " the ontology topic modeling term modeling is used as a sort of background for these for the terms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.797,
    "end": 2663.803,
    "text": " accuracy action and so on but where the really interesting philosophy meets the possibility of rhetorical analysis and and pedagogy is with these sentence fragments and so learning about that and about that sort of next level bringing together of topics into these sentences and how we can link to sentence fragments as nodes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.783,
    "end": 2688.643,
    "text": " is going to be awesome for the applicability and for the accessibility of these topics and and putting them in a place where it can be like yeah does active inference reduce uncertainty where is that claim supported or not this kind of claims analysis done within a really um careful thoughtful way so thank you culture for sharing it and for this epic work okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.547,
    "end": 2698.456,
    "text": " Harshil Shah, Satyaki Mitra, and Rohit Shenoy from the project An Active Inference Approach to Autonomous Navigation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2699.577,
    "end": 2708.627,
    "text": "They are high school interns and they wrote, we have completed phase one of our project submitting to our local science fair and winning second place in our category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2709.288,
    "end": 2714.293,
    "text": "We have completed a poster summarizing our project below and a GitHub showing the code so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2715.877,
    "end": 2720.145,
    "text": " We learned how to present Active Inference to people using examples and technical mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2720.826,
    "end": 2724.794,
    "text": "We applied Active Inference to autonomous navigation in a short period of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2725.795,
    "end": 2729.903,
    "text": "The work expands Active Inference into the field of navigation and hardware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.064,
    "end": 2734.293,
    "text": " We access numerous papers and help from people within the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.834,
    "end": 2740.248,
    "text": "We are asking now, how can we move into more realistic simulations and hardware with active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.91,
    "end": 2743.658,
    "text": "So this was a great project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.718,
    "end": 2747.588,
    "text": "Hopefully the poster conveys that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.568,
    "end": 2768.833,
    "text": " this was outstanding professional work from a very young and enthusiastic team and they're making epic advances in hardware and software open source robotics with active inference so they are flying over the target and thank you for sharing this exciting update",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.518,
    "end": 2776.384,
    "text": " Just a few more short updates from the project Humanity Story of an Uncertain Self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.925,
    "end": 2782.411,
    "text": "Shager Raman reports, formalized the myth of objectivity hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.112,
    "end": 2791.981,
    "text": "And that was pretty cool to see because that is building upon some work that was published a few years ago and cool to see the work continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2792.042,
    "end": 2793.403,
    "text": "So thank you, Shaggy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.383,
    "end": 2794.024,
    "text": " J.F.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.044,
    "end": 2798.85,
    "text": "Klatcher, research fellow from Symbolic Cognitive Robotics Project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.511,
    "end": 2808.984,
    "text": "Just to give a little snapshot, this is what it looks like in Discord to be getting those real-time updates from J.F.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.144,
    "end": 2817.775,
    "text": "Just sharing a couple days ago that a discussion with Elliot Hauser, who's on the SAB, led to some changes and linking to these concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.815,
    "end": 2819.037,
    "text": "So it's like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.32,
    "end": 2840.974,
    "text": " it is epic to see when we are able to connect it can be streamlined and effective it can be of mutual interest it can be technical it can be purely personal it can be operational all these different ways to connect and then report back in in a relevant way in the right time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.95,
    "end": 2870.623,
    "text": " did that update our model how did the updating of our model lead to changes in what we're doing and so jf has been a long time stalwart contributor and is doing awesome work with this project and so for people interested in symbolic cognitive robotics to not say too much more than that check out the github and in the simcog robotics channel in the discord okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.527,
    "end": 2879.196,
    "text": " right so last uh section before the live chats",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.69,
    "end": 2903.31,
    "text": " speculative directions for 2025 and or beyond so as with all things these are conditional on interest resourcing needs emergence volunteer contributions and resourcing funding and grants attentional regimes developments in the ecosystem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.29,
    "end": 2905.738,
    "text": " partnerships, all kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2905.839,
    "end": 2907.765,
    "text": "It's literally conditional on everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.167,
    "end": 2909.532,
    "text": "Conditional on world model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.655,
    "end": 2914.87,
    "text": "And we're thinking, okay, we've reported on what was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.373,
    "end": 2939.946,
    "text": " talked about measurements that came in before today from what has happened in the first quarter of this year and now we find ourselves in this present moment like now how to or what to and that's a tactical topic and we can think about that in terms of policy inference and here let's also look a little further to what if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2940.55,
    "end": 2951.023,
    "text": " The Institute is not something whose future is set in stone, so this is an opening for the conversation in due time as you come across this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.064,
    "end": 2955.388,
    "text": "What would be of epistemic and pragmatic value for you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.231,
    "end": 2960.634,
    "text": "What else should we consider and co-explore?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.736,
    "end": 2966.541,
    "text": "How do you want to be involved with some of these avenues?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.112,
    "end": 2994.621,
    "text": " with the very real possibility that your contribution even if you do or don't feel like an expert and this or that might be part of the go or no go on something that could be life-changing for someone else or yourself so first the fifth applied active inference symposium in 2024 in November we had the fourth applied active inference symposium",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.972,
    "end": 2996.254,
    "text": " And it was pretty epic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.514,
    "end": 3012.092,
    "text": "There was about 30 hours of video with many, many presenters talking about Active Inference applications, tool development, exciting directions, open source repo, lots of great materials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.993,
    "end": 3014.976,
    "text": "And what about this year?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.498,
    "end": 3017.298,
    "text": "We don't have a date.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3017.559,
    "end": 3019.321,
    "text": "We don't have a co-organizing team yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.561,
    "end": 3024.507,
    "text": "So it's just planting the seed early and earlier than we have in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3025.448,
    "end": 3047.085,
    "text": " that we're seeking co-organizers who want to check out the template for how we organized last year and modify that, sponsors, partnering organizations, and also presenters or facilitators who want to be involved in this fifth Applied Active Inference Symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3047.605,
    "end": 3053.034,
    "text": " So you can be affiliated with another organization and just show up as a person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3053.095,
    "end": 3058.003,
    "text": "You don't need to have any kind of affiliation or even previous contribution to the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.925,
    "end": 3063.573,
    "text": "It's super fun participatory opportunity for co-organizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.434,
    "end": 3071.807,
    "text": "So being a part of the planning process and having your input make a difference in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.787,
    "end": 3077.472,
    "text": " how many people will be able to improve their applications of Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.733,
    "end": 3079.835,
    "text": "Again, super fun opportunity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.395,
    "end": 3084.719,
    "text": "I hope that people who are interested in these channels of contribution get in touch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.003,
    "end": 3091.146,
    "text": "Okay, next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.166,
    "end": 3096.27,
    "text": "We are in the process of setting up this DeciNodes publishing affordance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.191,
    "end": 3098.993,
    "text": "So if you'd like to help,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.293,
    "end": 3119.489,
    "text": " as an editor or a platform usability designer, there could be amazing opportunities for people who are interested in durable, accessible, modern publishing, credentialing, cryptographic attestation, decentralized science, DeSci integrations, peer review, all these different kinds of topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.589,
    "end": 3123.917,
    "text": "How do we make, from the first person perspective,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.69,
    "end": 3147.762,
    "text": " reading and writing to the literature modern and more available and useful and how do we include these new technologies for publishing and asserting and all kinds of cool dsci processes so this is a pretty blank slate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3147.742,
    "end": 3149.926,
    "text": " And it's a pretty cool emerging platform.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.547,
    "end": 3164.434,
    "text": "So again, if somebody wants to explore being an editor and having some kind of stewardship over this platform, or just being one of the early publishers on it, let us know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.456,
    "end": 3170.885,
    "text": " Okay, next project and direction from knowledge engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.105,
    "end": 3172.448,
    "text": "So a little bit of history.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.349,
    "end": 3185.072,
    "text": "In 2022, with Blue and RJ, we did a systematic literature meta-analysis on free energy principle and active inference literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.052,
    "end": 3199.208,
    "text": " And then we transformed that data into Coda, and we developed some low-code interactive visualizations about ontology term use, different authorship patterns, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.488,
    "end": 3201.694,
    "text": "That was the end of 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.497,
    "end": 3218.063,
    "text": " Now, in this year, we plan to be working with Sanjeev Namdoshi and the TNB chairs, and also maybe you, to develop a modern interface for accessing, searching, and gleaning relevance from the active inference literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.887,
    "end": 3239.6,
    "text": " So, again, whether you think, oh, I have my own tagging system for the literature and I think that that could be useful to bring into play, or I've done something similar, or I'd like to learn how to do something similar, or I'm the kind of person who wants to be using that system and I want my user experience to be really important in that design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.962,
    "end": 3243.426,
    "text": "This is a great place to get involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3244.722,
    "end": 3250.599,
    "text": " Alright, and then last of the directions for now before I'll check the live chats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.184,
    "end": 3259.626,
    "text": "Big picture, we are moving towards robust modular approaches for applying active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.007,
    "end": 3275.86,
    "text": " And building a little bit on how I framed this at the end of last year, we can think about a lightweight stack and a sort of heavy stack, but it's not about their mass, but just as a metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3275.88,
    "end": 3289.292,
    "text": "On the light stack is something that can be run in a browser, run on mobile, no code and low code, multimedia affordances, high interactivity, looking at the surface,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.728,
    "end": 3295.873,
    "text": " a lot happening under the hood but something that is lightweight and accessible presented on the screen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.596,
    "end": 3326.535,
    "text": " that lightweight stack for learning and for simulating active inference systems under the hood would be running a heavy stack and the heavy stack could also be used on its own so developing the light stack and presenting that is really just one of the functionalities of the heavy stack which would be looking into the future of conventional and unconventional computing and also learning a lot from the open science open source and neuroimaging communities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3326.515,
    "end": 3355.493,
    "text": " for example the way that neurodebian is like a linux distribution for for neuroscience computational uh methods the neurodesk containerization strategy ngc museum archival repositories and then thinking about the implementations of active inference so from the implementational whether on a digital or some kind of non-slash-post digital processor",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3355.827,
    "end": 3358.25,
    "text": " on through the operating systems that we're running.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.251,
    "end": 3359.912,
    "text": "Take it or leave it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.053,
    "end": 3363.277,
    "text": "Maybe the one that you have is fine and you can enter in at the containerization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.978,
    "end": 3371.367,
    "text": "Or maybe you don't want to use containerization and you want to enter in at the level of really well-documented version source code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.188,
    "end": 3380.299,
    "text": "Or maybe you have your own source code on the side and you want to enter in at the level of documentation and methods for the inference implementations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3381.629,
    "end": 3396.149,
    "text": " All of that is part of this stack, which is realistically going to be outside of the development path for, for example, any given research lab or startup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.169,
    "end": 3402.658,
    "text": "So this is, I think, one of the key ways in which we're going to be able to add a lot of value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.178,
    "end": 3421.002,
    "text": " and catalyze a lot of research and application projects in the space is by having documentation and direct work on these tools so that when people think, I want to apply active inference, whether they pull back to the education, how can I learn it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.538,
    "end": 3423.02,
    "text": " or who could I find that knows it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.021,
    "end": 3429.307,
    "text": "Or whether they want to just enter in at the level of, well, what are the tools?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.387,
    "end": 3430.328,
    "text": "What are the examples?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.448,
    "end": 3431.309,
    "text": "What are the packages?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.349,
    "end": 3432.951,
    "text": "All those kinds of questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.651,
    "end": 3441.08,
    "text": "That can be something that is not like square zero, but rather there's some really strong methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3442.902,
    "end": 3445.825,
    "text": "For example, we have curated examples of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3446.277,
    "end": 3449.802,
    "text": " several dozens of active inference implementations in different languages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.663,
    "end": 3470.69,
    "text": "And those could each have a website that is enacting that example in the light stack and linking to a deployment in the heavy stack, just to again show that with different payloads, different languages, it could be possible to deploy these different examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3471.291,
    "end": 3473.554,
    "text": "Those could be cross-referenced with the ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.594,
    "end": 3475.997,
    "text": "So like this example is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.715,
    "end": 3483.76,
    "text": " deep time planning and affective inference and this one is affective inference and attention",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.364,
    "end": 3511.266,
    "text": " then those kinds of things can be recomposed so again big picture this is valuable software tooling and applications that would have stewardship and expertise convened at the institute we could be providing trainings examples guidebooks applications interfaces simulations maths visualizations templates and workspaces for education research and service actin for serve",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.246,
    "end": 3528.563,
    "text": " We could continue the refinement of core active inference functionality, for example with a cross-referenceable tech tree, along with some of these non-technical, not active inference technical, topics like norms of use and intellectual property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3529.876,
    "end": 3544.336,
    "text": " We can support collaboration and the varied works happening at the Institute and ecosystem with networking and making sure that people who want to use this stock can find expertise and enthusiastic contributors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3544.796,
    "end": 3556.913,
    "text": "Just like there are ways if you're wanting to learn or apply Linux, there are different kinds of consultancies and groups and open source efforts that make that something that can be professional and adaptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.057,
    "end": 3562.364,
    "text": " We can integrate with data integrity and cognitive security methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.549,
    "end": 3574.262,
    "text": "And I really hope that more information on this will unfold in the year to come, hopefully with everyone's participation and support.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.685,
    "end": 3576.606,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.704,
    "end": 3605.209,
    "text": " that is it for that section i'll close to this slide that we have always closed on and uh review the live chats so if you're watching please write any comment or question in the chat and uh i will go through them and then we will end it here hello upcycle club thank you for the support",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.872,
    "end": 3610.038,
    "text": " Morgan writes, TNB meetings have been great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.219,
    "end": 3610.961,
    "text": "Thank you, Morgan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.207,
    "end": 3614.25,
    "text": "Ander, hello?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3616.055,
    "end": 3619.806,
    "text": "So I'll wait one minute just to see if anyone writes any specific questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3652.102,
    "end": 3652.402,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.965,
    "end": 3657.81,
    "text": "Blanket at ActiveInference.Institute for emailing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3658.771,
    "end": 3668.805,
    "text": "So enter through any of these portals or email us and you will be well on your way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.845,
    "end": 3671.488,
    "text": "It's a participatory situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.548,
    "end": 3679.459,
    "text": "We're looking for people who want to step in and be involved and help out with this work and make it be what it can be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3679.675,
    "end": 3682.423,
    "text": " or make it be other than what it already has been.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3683.085,
    "end": 3688.862,
    "text": "So I hope that this has been an informative stream for our human and non-human listeners.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3689.825,
    "end": 3692.633,
    "text": "And I will see you around till next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3693.215,
    "end": 3693.516,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]