[
  {
    "start": 7.264,
    "end": 8.465,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.105,
    "end": 11.646,
    "text": "It's January 26th, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.246,
    "end": 18.369,
    "text": "We're here in Active Inference Math Stream 8.1 with Richard Sarajevan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.369,
    "end": 23.551,
    "text": "And we're going to have an interesting presentation and discussion today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.331,
    "end": 29.093,
    "text": " on Introduction to Bayesian Mechanics, Free Energy Principle, and the State-Based Formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.614,
    "end": 30.354,
    "text": "This is part one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.894,
    "end": 33.655,
    "text": "So, Richard, thank you for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.115,
    "end": 36.657,
    "text": "Looking forward to this presentation and discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.917,
    "end": 37.657,
    "text": "So, to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.458,
    "end": 40.138,
    "text": "Hi, everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.198,
    "end": 42.579,
    "text": "So, yeah, my name is Richard Servagent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.619,
    "end": 44.26,
    "text": "I'm French working in Switzerland.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.111,
    "end": 48.894,
    "text": " I'm a PhD student at EPFL in Lausanne.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.075,
    "end": 55.36,
    "text": "And just to bring a bit of context, I'm not working on Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.78,
    "end": 63.827,
    "text": "We do have a physics background, but we are interested in modeling bacterial evolution and ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.99,
    "end": 92.701,
    "text": " and what happened is that something like uh i mean the free energy principle was always in the corner of my head and one year and a half ago i decided to really read about the free energy principle especially if i wanted to transition to the field and i do want to transition to the field after my phd and so i started to ask many questions to the people from the fep community and i'm so grateful thanks for them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.633,
    "end": 120.303,
    "text": " and also on the discord of the of the active inference institute and at some point i said that i was preparing um a lab meeting about the free energy principle and daniel proposed to have this uh discussed on the live stream because there isn't such material to specifically learn about bayesian mechanics and the actual physics underlying the free energy principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.738,
    "end": 148.952,
    "text": " and so here i am so once again i'm not an expert uh on the matter so always refer to the original papers but hopefully i'm gonna i'm gonna do a decent job um so without further ado let's let's start uh i'm not going to tell you uh what we where we are heading what questions we would like to to address or whatever i'm rather going to start building the framework right away",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.875,
    "end": 165.673,
    "text": " and at some point what we are doing will become clear so as you may know there are two formulations or formalisms um of the free energy principles the so-called state-based formulation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.494,
    "end": 168.556,
    "text": " and the so-called path-based formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.976,
    "end": 173.34,
    "text": "So today, we will focus on the state-based formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.941,
    "end": 177.083,
    "text": "It's not like the old versus the new formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.644,
    "end": 189.354,
    "text": "In fact, thinking in terms of path or so-called generalized coordinates of motion have been around forever in the literature, but it kind of came back to the front scene",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.12,
    "end": 211.393,
    "text": " of the bayesian mechanics literature i think anyway today we will focus on the state-based from formalism so the very starting point is to write down a launch by equation a generic launch bar equation so it's literally like saying let's consider a random dynamical system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 212.981,
    "end": 226.429,
    "text": " very briefly for the people not acquainted with such an equation x here is the state of your system so it could be a simple scalar if you are considering a one-dimensional process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.173,
    "end": 230.335,
    "text": " But in general, x would be a vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.996,
    "end": 246.727,
    "text": "For instance, if, I don't know, you want to model the 3D diffusion of a Brownian particle immersed in a liquid, x would be a 3D vector with components as the coordinates of your Brownian particle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.888,
    "end": 254.573,
    "text": "And you can see on the left-hand side that we have dx over dt, the time derivative of the state vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.316,
    "end": 262.18,
    "text": " So that such an equation really describes or specifies the dynamics of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 263.301,
    "end": 266.663,
    "text": "So many things can influence indeed the dynamics of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.343,
    "end": 272.486,
    "text": "If I stick to my Brownian particle example, maybe it is subject to an external force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.307,
    "end": 279.891,
    "text": "So whatever is relevant here, you put it in F, the so-called deterministic term, or flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.211,
    "end": 283.233,
    "text": "We will refer to it as the flow for the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.585,
    "end": 289.169,
    "text": " However, in some cases, there is stuff you don't want to explicitly model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.91,
    "end": 302.782,
    "text": "For instance, if I stick with my Brownian particle example, it is constantly hit by the molecules of the medium surrounding it, hence its Brownian motion, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.917,
    "end": 318.35,
    "text": " And it would be, so if you want to take into account these thermal fluctuations, it would be mission impossible to explicitly model every single molecule of the millions, if not billions of the molecules surrounding it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.93,
    "end": 326.157,
    "text": "So a convenient way to still take into account these fluctuations, which are literally thermal fluctuations in my example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.128,
    "end": 351.461,
    "text": " a convenient way to proceed is just to add a noisy term to the equation so omega here is a random variable was value changes with time with the appropriate statistics okay so two brief remarks before moving on if you assume that the state of your system changes slowly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.273,
    "end": 368.303,
    "text": " compared to the time relaxation of your fluctuations, you can write the autocorrelation function of the noise like that, where gamma is the diffusion matrix and delta is the delta Dirac function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.603,
    "end": 377.269,
    "text": "So what it means, it's just that in that case, your noise is super rough and it's not correlated in time, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.479,
    "end": 395.848,
    "text": " Also, second remark, you can use the central limit theorem to argue that it makes sense to assume that omega is normally distributed, so that in the end, the noise is a Gaussian white noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.288,
    "end": 406.113,
    "text": "But note that in the next livestream, where we will discuss the path-based formulation of the FEP, we will relax the white noise assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.894,
    "end": 407.214,
    "text": "Anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.203,
    "end": 426.6,
    "text": " so we have this random dynamical system and we can do something cool with the flow so the flow f is a vector it has the same dimension than the state vector because each component of the state vector has its own longitudinal equation if you will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.606,
    "end": 452.098,
    "text": " and you can decompose it into a solenoidal and the gradient terms so without before sorry before telling you what this decomposition is all about on a technical note just notice that first q here is the so-called solenoidal matrix gamma is the diffusion matrix just as before",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.981,
    "end": 469.555,
    "text": " and the i here in the with the nabla i this i of x here is a negative log of a density so it's a self-information or surprise we will refer to it as as a surprise throughout the presentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.315,
    "end": 482.65,
    "text": " And the density at play here in this negative log density is the steady state or Nes for non-equilibrium steady state density of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.07,
    "end": 486.415,
    "text": "So we assume that there is such Nes density",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.095,
    "end": 503.443,
    "text": " that exists so that if you uh from a given initial um initial state you let your system evolve it will reach at some point a unique well-defined nest density and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.372,
    "end": 507.993,
    "text": " Second remark before telling you what this decomposition is all about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.273,
    "end": 524.717,
    "text": "Note that usually in the papers, the divergent terms here and here are put together in a third term, which is sometimes called housekeeping or correction term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 525.337,
    "end": 528.758,
    "text": "But actually, if Q and gamma are not state dependent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.66,
    "end": 541.069,
    "text": " these divergence terms vanish anyway, and we end up with the two remaining terms, which can be nicely factorized like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.23,
    "end": 550.116,
    "text": "Also, the last thing I want to say is that if you consider the solenoidal terms, the first term,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.025,
    "end": 574.962,
    "text": " it is indeed a solenoidal term you can indeed write it as the rotational of some potential i'm saying that because sometimes people get confused when they see a gradient in both terms anyway what this decomposition is all about uh is quite in fact simple let's consider",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.182,
    "end": 597.931,
    "text": " uh this nice 2d single modded nest density okay so the flow and more specifically the gradient component of the flow which is here the vertical flow will drive the system towards its mode while fluctuations kind of push it away",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.255,
    "end": 600.896,
    "text": " But it's not the only flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.996,
    "end": 619.05,
    "text": "There is also the solenoidal flow, which is here called the horizontal flow, which will make the system kind of converge to its mode with ever decreasing cycles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.951,
    "end": 627.377,
    "text": "And so if you want to get some more intuitions on this solenoidal flow, what we can do is to remove the fluctuations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.374,
    "end": 641.377,
    "text": " so all the entries of gamma the diffusion matrix go to zero and this means that we would not have any gradient flow anymore we end up with only the solenoidal flow and if we do that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.503,
    "end": 649.248,
    "text": " the system will just follow an isocontour circulation on the nest density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.469,
    "end": 660.039,
    "text": "That's the bottom right panel here, where the solenoidal flow kind of drives the system on this circulation here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.787,
    "end": 679.677,
    "text": " a small remark about this solenoidal flow because it kind of drives the system in this simple example in either clockwise or anti-clockwise direction in an irreversible fashion, irreversible in the statistical physics sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.038,
    "end": 684.54,
    "text": "So it breaks detailed balance and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.22,
    "end": 692.762,
    "text": " People sometimes view this solenoidal flow as underwriting the symmetry breaking ubiquitous in living systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.622,
    "end": 695.383,
    "text": "Anyway, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.983,
    "end": 703.885,
    "text": "So before using this decomposition of the flow to do some cool stuff, I need to introduce some stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.025,
    "end": 710.807,
    "text": "So I will have to go through a couple of things, of notions, one after the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.636,
    "end": 736.421,
    "text": " and afterwards i will we will put everything together and actually derive the free energy principle so the first thing i want to introduce is the notion of sparse coupling so let's say that in my state vector x here i have a subset of variables this mu here we refer to as the internal states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.509,
    "end": 758.873,
    "text": " and they specifies the state of some subsystem called mu so i mean you get the idea the the idea is that we have like an organism an agent the bacteria in my schematic and these variables here literally specifies the internal state of my bacteria",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.111,
    "end": 766.155,
    "text": " And this bacteria is in a given environment, niche, whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.915,
    "end": 780.383,
    "text": "So there is this other subset of variable we refer to as the external states and which corresponds to the external world, the external states of the bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.203,
    "end": 787.627,
    "text": "And the idea here is that these two subsystems are not connected to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.266,
    "end": 800.556,
    "text": " So when I'm saying that two variables are not connected to each other, I just mean that their respective flows do not take the other one state as argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.676,
    "end": 803.839,
    "text": "So they do not influence each other, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.919,
    "end": 816.149,
    "text": "In fact, they are indirectly connected to each other through a third subsystem we refer to as the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.188,
    "end": 820.829,
    "text": " so that these guys here are called the blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.609,
    "end": 826.87,
    "text": "And we will see in a minute that it really corresponds to a Markov blanket in a statistical sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.83,
    "end": 834.891,
    "text": "OK, so we have this architecture, this path coupling architecture here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.652,
    "end": 842.533,
    "text": "And in fact, we can even go a bit further and assume that within the blanket, there are two more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.246,
    "end": 865.343,
    "text": " systems the so-called sensory states and the so-called active state a so basically the idea here is that the external state eta they influence the sensory state s and this sensory state s influence the internal states mu but not the other way around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.128,
    "end": 876.771,
    "text": " And the internal states mu, they influence the active states A, which influence the external state eta, but not the other way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.051,
    "end": 883.212,
    "text": "So it's really a sparse coupling architecture inspired by the so-called action perception loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.973,
    "end": 890.554,
    "text": "However, you could ask questions like, why do the sensory states influence the external states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.135,
    "end": 896.256,
    "text": "Or why do the active states influence the internal states, et cetera?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.899,
    "end": 926.689,
    "text": " so we don't have really time to discuss this i guess you can think of some qualitative example in biology but i just want to point out that even though this architecture is quite canonical it's not a definitive feature of the free energy principle and in fact in the next time when we will discuss the other formalism we will do a bit of zoology and we will look at other sparse coupling architecture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.765,
    "end": 940.635,
    "text": " Okay, so on a technical note, just notice that such sparse couplings are encoded by zero entries in the Jacobian matrix of the flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.721,
    "end": 968.892,
    "text": " anyway so thanks to this pass coupling architecture we have this this system of four coupled uh launch my equations which respectively describes or specify the dynamics of the external states eta the sensory and active states s and a and of the internal states mu okay so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.46,
    "end": 980.527,
    "text": " I want to say here about the Markov Blanket thing that under some conditions I'm not going to discuss here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.707,
    "end": 989.253,
    "text": "So for the people acquainted, it involves having no solenoidal couplings between autonomous and not autonomous states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.313,
    "end": 992.475,
    "text": "But anyway, I'm not going to go into this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.996,
    "end": 994.737,
    "text": "Let's say under some conditions,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.247,
    "end": 1021.108,
    "text": " the external state eta and the internal states mu are conditional independence so they are independent when conditioned upon b which makes sense because all the informations kind of transit through through b however note that when i'm talking about conditional independencies here i'm talking about conditional independencies in the stationary density",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.196,
    "end": 1041.206,
    "text": " So basically, if you fix P and you have this joint conditional stationary density here for xi and xj, if these two guys are conditionally independent, it just means that you can write this joint density like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.187,
    "end": 1051.472,
    "text": "And so that such conditional independencies are encoded by zero entries in the Hessian matrix of surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.169,
    "end": 1059.43,
    "text": " Okay, so now just a bit more of vocabulary before moving on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.45,
    "end": 1074.574,
    "text": "Note that if we put together A and mu, so we consider the couple active state and internal states, we refer to these guys as the autonomous state alpha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.726,
    "end": 1098.751,
    "text": " and the cool thing about the autonomous states a and mu or alpha is that they are conditionally independent of the external states so autonomous and external states are independent when conditioned upon sensory states and if you add the sensory state s",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.451,
    "end": 1101.132,
    "text": " to the autonomous states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.732,
    "end": 1106.835,
    "text": "So you consider the whole thing, the whole Markov blanket and the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.975,
    "end": 1111.977,
    "text": "We refer to these guys as the particular states, pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.257,
    "end": 1117.26,
    "text": "And pi constitutes a particle, a particle in a generic sense, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.82,
    "end": 1121.822,
    "text": "So an organism, an agent, whatever, a bacteria in my schematic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.644,
    "end": 1131.882,
    "text": " OK, so here I just want to make a point to make a bit more clear what we are doing, what this approach is all about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.317,
    "end": 1150.506,
    "text": " So basically here, we kind of define what it means for something, a bacteria, whatever, to exist in the sense that it has its own internal dynamics statistically separated from the external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.207,
    "end": 1153.228,
    "text": "It does have a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.628,
    "end": 1156.069,
    "text": "It does have its own physical integrity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.489,
    "end": 1159.111,
    "text": "So we have no clue of how it maintains, indeed,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.711,
    "end": 1175.808,
    "text": " It's integrity in the sense that if you're considering real systems like an actual bacteria or a human being or whatever, it does survive in a given time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.129,
    "end": 1183.918,
    "text": " For instance, displaying active processes, contouring dissipation, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.339,
    "end": 1187.625,
    "text": "Here, we don't say anything about how it does survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.845,
    "end": 1188.727,
    "text": "It just does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.787,
    "end": 1191.211,
    "text": "We do have this path coupling architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.498,
    "end": 1202.685,
    "text": " And from there, from the starting point, we are going to derive the necessary consequences of such sparse coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.905,
    "end": 1208.389,
    "text": "So basically, we kind of ask or answer or try to answer the questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.53,
    "end": 1211.611,
    "text": "If things exist, what must they do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.332,
    "end": 1217.095,
    "text": "And so if you're a bit confused, don't worry, we're going to go back to this idea later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.887,
    "end": 1230.716,
    "text": " But I just want first to show you this quote here, which tells you, many theories in the biological sciences are answers to the question, what must things do in order to exist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.557,
    "end": 1238.001,
    "text": "The FEP turns this question on its head and asks, if things exist, what must they do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.922,
    "end": 1242.265,
    "text": "But once again, we are going to go back to this idea later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.305,
    "end": 1246.908,
    "text": "But that's kind of the idea of this approach in a nutshell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.13,
    "end": 1270.636,
    "text": " so as i told you uh i still have a couple of things to to present so i will have to go through each of them one after the other and finally we will put everything together and finally derive the free energy principle so the next thing i need to introduce is the notion of synchronization map",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.602,
    "end": 1282.087,
    "text": " So very generally speaking, I'm not specifically here talking about our random dynamical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.807,
    "end": 1296.733,
    "text": "If you have a linear map g mu here, which gives you mu from b, and g eta here, which gives you eta from b, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.842,
    "end": 1315.687,
    "text": " uh if g mu here is injected so that basically you can go back to the pre-image from the image you can use the pseudo inverse of g mu so that from you you go back to b and from b you can go back to you can go to eta",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.855,
    "end": 1345.724,
    "text": " so the successive application of the pseudo inverse of g mu and then of g eta is called the synchronization map and it basically allows you to directly go to eta from you okay so now let's try to uh to use this idea in the context of our system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.647,
    "end": 1351.23,
    "text": " So b here corresponds to the blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.33,
    "end": 1359.936,
    "text": "So if I fix the blanket states, I have corresponding conditional densities for mu and eta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.136,
    "end": 1371.623,
    "text": "I have p of mu given b and p of eta given b. And their modes are bold mu and bold eta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.884,
    "end": 1375.286,
    "text": "So in virtue of this synchronization map,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.107,
    "end": 1385.053,
    "text": " I can go back to the external mode from the internal mode, thanks to, once again, this synchronization map here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.233,
    "end": 1394.259,
    "text": "And I'm going to give an example in a sec, which is going to clarify a bit more what we are doing here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.62,
    "end": 1404.106,
    "text": "But first, I just want to say that in this nice paper by Lance Dacosta about this synchronization map,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.955,
    "end": 1407.116,
    "text": " Basically, everything was Gaussian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.557,
    "end": 1422.325,
    "text": "But sometimes, I mean, if it is not the case, a Laplace approximation, which is literally a Gaussian approximation, might be necessary to derive a synchronization map of closed form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.765,
    "end": 1445.428,
    "text": " but don't worry we will go back to this idea of laplace approximation later just remember that we have this synchronization map here which allows you to go to the external map external mode sorry from the internal mode so for instance if given b given the blanket states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.594,
    "end": 1461.387,
    "text": " the corresponding p of eta given b follows this nice normal distribution where both eta here corresponds to the mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.428,
    "end": 1471.776,
    "text": "Then, in virtue of the synchronization map, I can view the internal mode mu as parametrizing a density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.056,
    "end": 1473.998,
    "text": "I write it that way, q mu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.941,
    "end": 1485.665,
    "text": " which is equal to this nice normal distribution where the mode is just the synchronization map applied to the internal mode to itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.765,
    "end": 1494.988,
    "text": "And by construction of the synchronization map, it is equal to the true external density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.609,
    "end": 1503.071,
    "text": "So you can view the internal mode as parametrizing a distribution over external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.795,
    "end": 1505.896,
    "text": " Basically, thanks to the synchronization map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.096,
    "end": 1508.436,
    "text": "That's what the synchronization map is all about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.737,
    "end": 1518.579,
    "text": "So just a small point, because maybe some of you are a bit confused here because we're talking about modes as opposed to actual states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.299,
    "end": 1522.56,
    "text": "So we will talk about that later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.0,
    "end": 1532.983,
    "text": "But indeed, I mean, if I take the actual internal states at a given time t, they are not necessarily equal to their modes just because of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.955,
    "end": 1555.673,
    "text": " fluctuations or whatever so that if I apply the synchronization map on the actual internal states it might not give you the true external mode but anyway we will discuss this uh a bit more later so that was the notion of synchronization map in a nutshell basically so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.858,
    "end": 1582.843,
    "text": " last thing i want to uh to introduce before finally putting everything together and actually derive the free energy principle is the notion of variational inference so very simply let's say that you have some latent variables or hidden variable or some latent generative process causing some data s",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.937,
    "end": 1608.406,
    "text": " so you have a prior p of eta over the state of these hidden causes of data and you are also equipped with a generative model which just designates this joint distribution here p of eta and s so you can view it as a model of how the latent variables cause the data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.947,
    "end": 1612.629,
    "text": " So the idea is the following.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.869,
    "end": 1630.183,
    "text": "You sample some data S, and you want to compute the posterior distribution p of eta given S. So in a way, you want to refine your belief about the hidden cause of data thanks to a new sample data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.024,
    "end": 1636.789,
    "text": "So it's very simple in principle, because you just have to apply Bayes' theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.223,
    "end": 1653.971,
    "text": " However, in practical settings, the denominator here, p of s, so the marginal density over sensory data, usually requires a monstrous marginalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.031,
    "end": 1655.932,
    "text": "So it's just not tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.033,
    "end": 1660.775,
    "text": "So we can't just apply Bayes' theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.475,
    "end": 1663.176,
    "text": "So we need a method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.524,
    "end": 1692.24,
    "text": " uh which given some variation sorry which given some some variational distribution q also called recognition density uh gives us uh i mean we want a meter that makes it as close as possible if not equal to the true distribution we want ultimately to compute namely p of eta given s",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.138,
    "end": 1717.598,
    "text": " and these two density so q our variational distribution and the true distribution p of eta given s are equal or are more or less equal if their divergence k divergence here is zero because this quantity here the k divergence basically measure the difference between two distributions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.775,
    "end": 1747.01,
    "text": " so that's what i wrote here on the top of the slides finding an accurate distribution queue in the sense of finding a queue as close as possible if not equal to the true target density is equal to minimize to minimizing this divergence however this divergence i mean there is the target density appearing here we can't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.665,
    "end": 1768.52,
    "text": " do anything directly with it we can't compute it or whatever we need a proxy for this target divergence and there is a proxy called variational free energy f in green in my in my slide here so f is is equal to this divergence here between q and the generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.027,
    "end": 1792.277,
    "text": " and the idea here is that you can decompose this divergence into the true the targets sorry into the target divergence in red here plus something so it is indeed a proxy for the target divergence and note that interestingly enough the second term here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.115,
    "end": 1816.903,
    "text": " is the surprise over sensory data or negative log p of s so that f is it can be viewed as an upper bound or lower bound depending on how you define it on surprise okay so what i just said here is that minimizing the target divergence just means minimizing f",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1818.622,
    "end": 1823.929,
    "text": " So that's basically what variational inference is all about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.749,
    "end": 1833.4,
    "text": "And note that usually algorithms require Q to be Gaussian or require a mean field approximation or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.677,
    "end": 1848.03,
    "text": " And if Q is required to be Gaussian, even though the target density is not Gaussian, we would end up with the best Gaussian approximation of the target density, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.53,
    "end": 1855.937,
    "text": "And in practice, it would mean working with a so-called Laplace-encoded free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.259,
    "end": 1857.359,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.266,
    "end": 1870.878,
    "text": " So before moving on, I just want to say that this quantity, the variational free energy, is in itself a quite rich and interesting quantity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.358,
    "end": 1878.765,
    "text": "So you can decompose it in many ways, and each decompose provides interesting interpretations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.345,
    "end": 1884.39,
    "text": "For instance, if you look at the second line here, you can see that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.373,
    "end": 1893.115,
    "text": " Minimizing free energy means maximizing this accuracy term here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.155,
    "end": 1896.036,
    "text": "You basically want to explain the data, I would say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.616,
    "end": 1903.978,
    "text": "But at the same time, you want Q to differ the least possible from a prior distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.458,
    "end": 1907.199,
    "text": "So that's an interesting quantity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.779,
    "end": 1908.2,
    "text": "Anyway, now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.999,
    "end": 1918.304,
    "text": " Let's finally go back to our sparsely coupled random dynamical system and use everything we talked about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.544,
    "end": 1922.887,
    "text": "And finally, let's derive the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.768,
    "end": 1928.831,
    "text": "So here is our system and we have these four Langevin equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.232,
    "end": 1935.336,
    "text": "And the first thing to do is just to apply the decomposition we talked about in the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.816,
    "end": 1936.697,
    "text": "So basically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.028,
    "end": 1941.91,
    "text": " the flows of each of them can be written like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1942.21,
    "end": 1947.753,
    "text": "So I just directly applied the Helmholtz decomposition we talked about in the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.414,
    "end": 1956.858,
    "text": "Okay, so now let's try to understand how it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.919,
    "end": 1959.82,
    "text": "Let's talk about the dynamics of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.504,
    "end": 1968.327,
    "text": " Let's say that there is a momentary instantiated sensory state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.168,
    "end": 1972.189,
    "text": "And let's say that the sensory states are fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.889,
    "end": 1976.991,
    "text": "And there is a corresponding autonomous mode toward which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.494,
    "end": 1991.788,
    "text": " the autonomous states are going to converge and stay in the vicinity of their mode in the close vicinity if fluctuations are not too large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.91,
    "end": 1993.19,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.791,
    "end": 1998.136,
    "text": "But in fact, sensory state with time changes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.437,
    "end": 2028.309,
    "text": " uh so that the the modes of the autonomous state move as well and in fact it it moves on its corresponding autonomous manifold so i'm not going to go into the details but just have in mind that the autonomous mode moves on a so-called autonomous manifold which can be viewed as a statistical manifold and which can also be viewed as a so-called center or central manifold so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.588,
    "end": 2056.17,
    "text": " if i kind of rephrase what i am saying here is that the flow of the of the autonomous states can be decomposed into a off manifold flow and uh on manifold flow which corresponds to the path of the mode itself on the manifold okay so just to be a bit more clear let's say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.213,
    "end": 2064.638,
    "text": " in my bottom right illustration diagram here, the autonomous states are here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.238,
    "end": 2070.542,
    "text": "And I'm interested in the off manifold flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.283,
    "end": 2080.789,
    "text": "So basically, I have this component here, which corresponds to the gradient flow towards the manifold, towards the mode, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.529,
    "end": 2084.171,
    "text": "Here, it's pretty much like what we discussed in the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.226,
    "end": 2092.511,
    "text": " And at the same time, there is here this orthogonal component, which corresponds to the solenoidal flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.052,
    "end": 2102.358,
    "text": "So that's basically the way the autonomous states are going to reach their mode here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.778,
    "end": 2112.065,
    "text": "It can be viewed as this ever-decreasing cycle towards the manifold on which the autonomous mode move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.126,
    "end": 2113.266,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.412,
    "end": 2116.232,
    "text": " So that's a bit dense, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.472,
    "end": 2132.215,
    "text": "So I recommend to check the paper, the free energy principle made simpler, but not too simple, which kind of discuss all these ideas about center manifolds and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.595,
    "end": 2142.837,
    "text": "So here, the interesting point is that if you assume a separation of timescale between the fast flow of the manifold",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.082,
    "end": 2164.425,
    "text": " as opposed to the slow flow on the manifold basically the autonomous state always are always in the vicinity of their modes and if you want to characterize the overall dynamics of the autonomous states you can focus on the autonomous mode on the path of the mode and in the next slides",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.558,
    "end": 2183.607,
    "text": " we will indeed focus on the autonomous mode and and by definition as we already discussed the autonomous mode the autonomous mode is or corresponds to the autonomous states which minimize",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.918,
    "end": 2195.567,
    "text": " surprise here in the last two Langevin equations because the autonomous mode corresponds to the least surprise of autonomous states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.948,
    "end": 2204.935,
    "text": "Before moving on, I just want to say something we can maybe discuss afterwards because I'm not sure to fully understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.376,
    "end": 2210.48,
    "text": "But basically, if I'm here in my bottom right schematic,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.591,
    "end": 2217.556,
    "text": " And so I have this gradient flow towards the manifold and this solenoidal flow parallel to the manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.276,
    "end": 2227.223,
    "text": "And if I remove fluctuations, so the corresponding entries in the diffusion matrix go to zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.084,
    "end": 2234.849,
    "text": "As we saw in the beginning, it means that there is no gradient component anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.473,
    "end": 2247.543,
    "text": " And what the system will be doing is kind of orbiting or oscillating around a point which moves on the manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.923,
    "end": 2248.844,
    "text": "So that's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.584,
    "end": 2261.334,
    "text": "And I guess that if we do the exact same reasoning but starting already on the mode, then the whirl flow reduces to the on manifold flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.095,
    "end": 2263.696,
    "text": "And I guess that in that case,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.702,
    "end": 2292.348,
    "text": " the autonomous states follow and in fact coincide with their mode but anyway maybe we we can discuss about that afterwards so okay so let's use the various things we talked about and especially the notion of synchronization map we as we said the internal mode parameterize indeed a distribution over the external state so mu here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.528,
    "end": 2311.196,
    "text": " um parameterize a distribution which by construction coincides with the true distribution p of eta given b and in fact thanks to the conditional independence between external states and autonomous states you can just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.276,
    "end": 2327.501,
    "text": " drop the condition upon a and you just have q mu equal p of eta given f and equivalently you can you can write it p of eta given pi and the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.018,
    "end": 2358.147,
    "text": " idea here is that you can view q mu as a variational distribution if you want you can write its associated variational free energy so you have this um this formula here the free energy and because q mu is already um already coincide with the true posterior distribution if you will the first uh term here goes to zero",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.444,
    "end": 2367.349,
    "text": " And so that F here reduces, if you will, to the surprise over particular states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.549,
    "end": 2373.473,
    "text": "And surprise over particular states, they appear here in the equations of the autonomous states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.793,
    "end": 2387.642,
    "text": "So we can do this identification, and we realize that the autonomous mode not only minimizes surprise though, but free energy in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.613,
    "end": 2400.603,
    "text": " And the way mu, the internal states, will be updated when the sensory states will change will always be so that this divergence here is 0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.424,
    "end": 2409.911,
    "text": "So that mu always keeps track or synchronizes with or, in fact, infer the external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.431,
    "end": 2416.376,
    "text": "So that you can interpret that under a generative model, which is here p, the next density,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.341,
    "end": 2423.707,
    "text": " the internal states can be viewed as performing inference over external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.668,
    "end": 2431.474,
    "text": "And so, in fact, it's not only this divergence which is minimized, but it's also surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.195,
    "end": 2440.783,
    "text": "And it's not only the internal states which minimize free energy, but also the active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.303,
    "end": 2443.085,
    "text": "So let me give an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.449,
    "end": 2467.738,
    "text": " let's say that the actual uh instantiated sensory states are likely sensory states or unsurprising sensory states and by definition in general the instantiated sensory states will be likely sensory states so mu will will the corresponding mu will be so that this divergence will be zero as we just discussed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.613,
    "end": 2489.242,
    "text": " And at the same time, the corresponding active mode will be, so you can see in composition with the third term here, I of A given S and mu, A, the active mode, will just be the one the most consistent with this intensified sensory state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.402,
    "end": 2497.786,
    "text": "And in fact, you can view it the other way around and say that the active mode is the mode which gives unsurprising",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.877,
    "end": 2509.965,
    "text": " sensory states, so that the particle can be viewed as actively sampling unsurprising or likely sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.105,
    "end": 2518.11,
    "text": "Or equivalently, you can say that the particle kind of accumulates evidence for its own generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.791,
    "end": 2522.253,
    "text": "And I'm going to say something about the generative model in a sec.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.693,
    "end": 2527.957,
    "text": "But I just want first to, so yeah, this sentence here just sums up what we said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.786,
    "end": 2558.426,
    "text": " mu is updated so that q mu is always the the best distribution of our external states and we refer to this as perceptual inference and the idea to in addition trying to minimize surprise for action is called active inference so a brief note we said earlier that in order to have a synchronization map of closed form it could be necessary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.133,
    "end": 2561.514,
    "text": " to work under a Laplace approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.674,
    "end": 2570.877,
    "text": "So that in that case, Q mu is just the best Gaussian, for instance, of the target density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.818,
    "end": 2583.602,
    "text": "So that the divergence here would not be 0, but it still would be minimized so that the identification here between the two gradients",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.434,
    "end": 2589.998,
    "text": " still hold and nothing changes with respect to our discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.679,
    "end": 2595.282,
    "text": "So here I just want to say something about what we are doing here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.964,
    "end": 2608.693,
    "text": "Basically, we assume that we have our agents or organisms that survive, indeed exist or persist in a given environment, let's say, at a given timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.653,
    "end": 2611.355,
    "text": "And we end up with the fact that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.538,
    "end": 2638.708,
    "text": " our particle must be equipped with or must embody a generative model which may or may not exactly coincide with the true generative process and which encodes the causal structure of the world under which it tries to perform inference and to minimize surprise, to perform perceptual and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.662,
    "end": 2657.73,
    "text": " But the interesting thing as well is that, and I think that's something fundamental that people tend to misunderstood, I guess, maybe, I'm not sure, is that the generative model also encodes the preferences of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.31,
    "end": 2659.451,
    "text": "And let me explain why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.111,
    "end": 2666.534,
    "text": "If I tell you that an organism manages to survive, to exist, to persist, et cetera,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2667.845,
    "end": 2695.602,
    "text": " and so it means that such an organism manages to stay in its homeostatic life compatible states you would be of course it almost sounds like a tautology survive equal staying in it in in its homeostatic state that's obvious right and that's exactly what we are doing here we assume existence survival so that the likely state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.531,
    "end": 2702.674,
    "text": " in which the particle will persist, are preferred states per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.514,
    "end": 2724.183,
    "text": "So that, for instance, if I'm considering the prior of my generative model over sensory inputs, P , sensory outcomes as associated with high P , so likely or unsurprising sensory states, are preferred sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.402,
    "end": 2746.352,
    "text": " hence when i'm saying that the active states try to sample unsurprising sensory states it means trying to sample preferred sensory states and so basically the particle appears to kind of actively accumulate evidence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.761,
    "end": 2771.45,
    "text": " um like uh for its own existence in a way it kind of sample life compatible to send it kind of sample life compatible data if you will and that's exactly the definition of self-evident thing so i think we touch here something fundamental about agency is that agents are self-evident creatures in that sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.719,
    "end": 2781.143,
    "text": " Okay, anyway, so basically, I think that's the most interesting things of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.183,
    "end": 2802.112,
    "text": "We start from existence and we end up that such a particle, which is coupled to the world in that way, must embody a generative model which encodes the causal structure of the world and which encodes its preferences in terms of what is life compatible, if you will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.55,
    "end": 2831.708,
    "text": " okay so just to sum up what we did here this idea that free energy is minimized uh you can write it that way and this is in a way a variational principle for self-organization that's a free energy principle so here i just wrote what we just discussed the agent keeps tracks and acts on its external milieu through perceptual and active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.401,
    "end": 2850.513,
    "text": " And note that, interestingly enough, you can write such a principle as a principle of least or stationary action, where the Lagrangian, which is constantly minimized along the path, is variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.114,
    "end": 2856.637,
    "text": "So here are some concluding remarks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.01,
    "end": 2883.889,
    "text": " i'm not going to for all of them but the first one is basically what we just discussed this idea that the generative model encodes preferences if an agent maintains existence its likely states are its preferred ones per se hence the notion of stealthy dancing and i just also want to point out that this new approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.782,
    "end": 2897.478,
    "text": " or chapter of physics, let's say, consisting in describing physical systems as encoding probabilistic beliefs is called Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.1,
    "end": 2900.402,
    "text": "Okay, so having said that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.814,
    "end": 2928.276,
    "text": " uh thank you very much and especially thanks to all these guys who who helped me so much especially len uh and uh yeah thank you for um for your uh your attention coming back thank you richard",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.608,
    "end": 2959.574,
    "text": " okay well while we're settling back in and anyone is asking questions in live stream what is your phd research and if this is your side project what is your main project that this kind of relates to yes so well in fact um i kind of read about the free energy principle in my free time whenever i",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2960.649,
    "end": 2970.883,
    "text": " I had some time and what I'm doing in my PhD is so we have a couple of projects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.787,
    "end": 2992.869,
    "text": " the first project we did was really modeling bacterial evolution through so basically we model bacterial evolution as a bias random work on genotype space with successive mutations and and and successful fixations so that's what we are doing it's not related to the fep at all",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.03,
    "end": 3000.331,
    "text": " And the second thing we have been doing is modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.432,
    "end": 3011.934,
    "text": "So basically we had a system where you have bacteria which can kill each other thanks to a system which is called the T6 secretion system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.194,
    "end": 3020.576,
    "text": "They kind of have needles with which they can go through the membrane of other bacteria and liberate toxins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.716,
    "end": 3036.67,
    "text": " and they can also bind to each other so there is like a prey-predator kind of dynamics and we did like a lattice gas modeling of such systems so basically that's what I'm doing in my PhD which is not related to Bayesian mechanics but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.53,
    "end": 3052.9,
    "text": " I would like to to transition to to the field afterwards so yeah we'll see how it it goes I remember when I thought my PhD wasn't related to active inference okay cool well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.713,
    "end": 3078.849,
    "text": " the work built to an amazing crescendo that in its simplicity even though you highlighted it it's easy to fly by which is the coincidence of the preferences and the expectations so could you maybe give a little context how else has that Nexus of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.87,
    "end": 3102.781,
    "text": " preference and expectation been approached and is the FEP only and simply and always that coincidence is that coincidence upstream or downstream of some other commitment that we make like what are the commitments that we really make and is that um alignment the commitment or a resulting commitment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.406,
    "end": 3115.197,
    "text": " Yeah, so first of all, I think the notion of self-evidencing might be a bit refined with the next formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.618,
    "end": 3120.042,
    "text": "But anyway, I think that's a crucial point about the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.243,
    "end": 3122.265,
    "text": "And usually, it's kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3123.095,
    "end": 3147.829,
    "text": " confusing because when you're reading the papers and people are starting to write that the system um sample evidence for its own existence you're like what i mean i'm not sure to understand what's going on here um but in fact yeah it's i i think the the way i i introduced it this idea that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.929,
    "end": 3177.33,
    "text": " by definition um a living thing is a thing which which managed to sample life-compatible uh sensory data is really what uh allows this um align alignment story between the that the idea that between surprise and preferences uh basically and this idea that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.13,
    "end": 3205.877,
    "text": " actively sampling unsurprising data is in fact and it's not like a tricky wording it's in in a way that's really what's happening it is uh sampling uh life compatible or preferred in that sense data hence the notion of self-evidencing um but um yeah i think the whole idea here is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.091,
    "end": 3208.451,
    "text": " we start from existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.651,
    "end": 3229.795,
    "text": "We start from this sparse coupling architecture, where the particle managed to maintain its physical integrity, managed to display a Markov blanket, which allows the agent to have its own internal dynamics separated from the external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.835,
    "end": 3232.636,
    "text": "So somehow it managed to contour dissipation or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.416,
    "end": 3234.916,
    "text": "And so from there,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.089,
    "end": 3243.672,
    "text": " likely states are states consistent with the fact that it is existing indeed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.092,
    "end": 3247.474,
    "text": "So I think that's basically the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.534,
    "end": 3253.556,
    "text": "But yeah, in the beginning, this kind of line of reasoning can be a bit confusing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.596,
    "end": 3258.518,
    "text": "But in fact, I think that's very much what the FEP is all about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.658,
    "end": 3260.599,
    "text": "And actually, last remark,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.677,
    "end": 3290.084,
    "text": " um in a machine learning street talk interview of maxwell ramsted he it was titled the fep as a physics of survival if i remember well and i think that's that's very very much what what it is all about in a way awesome how would you relate what you just described to reward or to reinforcement type learning schemes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.369,
    "end": 3311.532,
    "text": " yeah so i i mean i'm not um an expert at all i could not uh make the bridge here but i know that um lens dacosta made several uh works and interviews about the the subject and actually i think there is a very new paper called",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.212,
    "end": 3335.461,
    "text": " active inference as a model of agency you just shared actually today um so i yeah i recommend the viewers to to check them out and as far as i know but here i'm just i'm just uh saying what i heard is that um any reinforcement learning algorithms can be um can be framed in terms of active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.342,
    "end": 3343.657,
    "text": " So I think active inference is a very fundamental scheme, but yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.798,
    "end": 3346.279,
    "text": " Yeah, it's all good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3346.299,
    "end": 3353.266,
    "text": "Like the reason I ask just with how you presented it is what kind of observations do we want to sample?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.946,
    "end": 3366.138,
    "text": "That could be the sensory embodied interface between the agent and the environment, or you can take a more cognitivist approach and sample internal observations, but those are just external, some other internal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.338,
    "end": 3368.079,
    "text": "So what do we want to really sample?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3368.7,
    "end": 3377.805,
    "text": " Well, if you're even in a position where you're talking about sampling from like a utility or a reward distribution, you've already specified a distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.446,
    "end": 3395.335,
    "text": "Why not just specify the existence distribution, the actual attractors and stationarities of the measurements, and then it's simpler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.703,
    "end": 3411.395,
    "text": " Because there's no proposal of a secondary intermediate between the temperature and how good different temperatures are by going and just saying it's not rewarding to be at 37 homeostatic temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3411.515,
    "end": 3414.578,
    "text": "It's just expected and likely and the ball runs downhill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.138,
    "end": 3417.721,
    "text": "It's actually a lot simpler and more general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.868,
    "end": 3440.479,
    "text": " Yeah, and I think that it's way more simpler to... I mean, the idea here is that the agent has a kind of world model which, as you said, specified what are the expectations with regards to just existing in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.517,
    "end": 3458.309,
    "text": " And as opposed to designing explicitly objective functions which incorporate the notions of utility and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.989,
    "end": 3461.231,
    "text": "So yeah, I very much agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.011,
    "end": 3475.783,
    "text": " Earlier when we were looking at the flows and we had the breakdown of a flow, um, could you maybe just, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.269,
    "end": 3486.338,
    "text": " What animal are you thinking about or what scenario can help us understand like what's the solid black line?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.578,
    "end": 3488.12,
    "text": "What's the small red line?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.521,
    "end": 3489.422,
    "text": "What's the spiral?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3489.962,
    "end": 3496.851,
    "text": "What's like a physiological setting that we could associate here to help us understand that kind of complex movement?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.757,
    "end": 3507.079,
    "text": " Yeah, so generally speaking, the first thing I could say is that this notion of solenoidal flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.679,
    "end": 3517.282,
    "text": "So it's like in the schematic in the first slide where you had this isocontour circulation on the nest density or here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3518.463,
    "end": 3536.884,
    "text": " the the the component of the flow which creates this sort of spiral here it can it so that um it's this sort of um oscillations are i think uh the sort of oscillations or cycles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.842,
    "end": 3562.354,
    "text": " that are ubiquitous in living systems um i mean i'm not a biologist but you can uh or not really a biologist but you can think of the circadian cycle or or anything in any sort of systems there is this thought of of um attractor where you're circulating along and so here specifically to this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.382,
    "end": 3580.696,
    "text": " to this schematic here, I think the idea is that you have, so you have, basically let's say that for a given sensory state, you have a corresponding autonomous mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.585,
    "end": 3605.556,
    "text": " and the when the sensory state change the autonomous mode mode changes as well and in fact move on its so-called manifold so basically i guess here you have the mode moving uh on its manifold and now if we take the perspective of this autonomous state here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.196,
    "end": 3611.097,
    "text": " we converge to the manifold, to the mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.738,
    "end": 3625.881,
    "text": "And because of the solenoidal component of this flow, the way we will reach it is with this kind of ever-decreasing cycles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.821,
    "end": 3629.642,
    "text": "So here's the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.662,
    "end": 3635.263,
    "text": "And I really recommend here the free energy principle simple paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.984,
    "end": 3649.306,
    "text": " you have the the flow on the manifold it's just the path of the mode itself let's say and you have the flow of the manifold was gradient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.347,
    "end": 3676.978,
    "text": " component is the flow towards the manifold in fact um so basically so that's basically how autonomous states kind of um reacts to to to sensory data which change the autonomous mode and i think the world uh an important idea here is to assume that the flow of the manifold is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.018,
    "end": 3688.747,
    "text": " fast as opposed to the flow on the manifold, so that basically the sensory states are always in the vicinity of their mode and move with their mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.008,
    "end": 3699.075,
    "text": "And yeah, I think that's pretty much the idea here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.347,
    "end": 3723.038,
    "text": " okay so let's just say that the black line is um our homeostatic body existence life compatible pH oxygen blood sugar and yeah we are that light blue dot that's off that manifold of course if we were far enough off to be dead",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.676,
    "end": 3731.522,
    "text": " it would be a moot question, but we're off, but within a life scaffolding or compatible zone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.302,
    "end": 3740.809,
    "text": "And now as time pushes us down into the right, there are different slices that we can trace",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3742.988,
    "end": 3748.754,
    "text": " we could take the shortest path, the gradient flow directly towards the manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.334,
    "end": 3763.809,
    "text": "So as that plays out through time, it would look like a linear line converging to the thick black line or pure solenoidal flow would just stay equally far away from the thick black line and continue to spiral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3763.849,
    "end": 3765.29,
    "text": "So that would look like a corkscrew",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.881,
    "end": 3790.929,
    "text": " through time and then here when you have the combined character of the linearized convergence towards the manifold and The corks grew out through time we get this kind of winding spiral so it reflects on me that the gradient flow is pragmatic and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3792.99,
    "end": 3810.743,
    "text": " value in that it aligns future observations with preferences and the solenoidal flow has an almost epistemic character in that it circulates amongst a set of equally valid outcomes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.256,
    "end": 3834.081,
    "text": " yet here we're not looking at the pragmatic plus epistemic decomposition of the expected free energy policy selection strategy like equation 2.6 in the 2022 textbook so is that just a concordance or where do you see some of those topics connecting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3838.931,
    "end": 3857.516,
    "text": " I'm not sure, maybe, but having said that, on the meaning of the solenoidal part here, I know that on the... I don't remember if it's in the free energy principle simpler paper or someone else,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.351,
    "end": 3883.58,
    "text": " but there is an analogy i mean they discuss the the meaning and the role of the solenoidal flow where they say that it it kind of help um it kind of helps mixing the systems and you can view and there they discuss the metaphor with where you want to dilute your um your um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.74,
    "end": 3912.576,
    "text": " your coffee for instance and you're going to have this sort of uh motion in order to reach the the as fast as possible the steady state where everything is diluted but I I um I'm not sure I didn't think enough myself to provide any sort of interesting insight all good just to have composed it it's very insightful um well you made",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.689,
    "end": 3915.57,
    "text": " choices, assembling things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3915.81,
    "end": 3923.776,
    "text": "Like what do you feel like would have been background, maybe a course or a skill?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3923.856,
    "end": 3929.059,
    "text": "What background do you feel like you kind of conditioned upon that somebody might want to check out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.079,
    "end": 3935.784,
    "text": "And then what do you feel like you would have wanted to include in the state-based formalism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3939.521,
    "end": 3960.105,
    "text": " um because to bring it into a under one hour timing is very concise so where do you feel like somebody could fill in some background to pick up with you at the beginning and then what else do you think would make a fuller presentation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.01,
    "end": 3971.797,
    "text": " I think there are a few aspects and details I didn't really fully discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.099,
    "end": 3989.391,
    "text": "Well, first of all, all these things here, which involves a center manifold theory and stuff like that, we kind of played qualitatively with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3989.451,
    "end": 3991.613,
    "text": "We didn't really go into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.594,
    "end": 4004.212,
    "text": " and also if we want to be like full really full formally speaking um let's see maybe um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.802,
    "end": 4035.974,
    "text": " uh well there are a couple of things where we that we kind of accept without really checking all the assumptions and also the revised derivation and i'm especially thinking of the of the helmholtz our decomposition of f because of course you need um a steady state an s density to exist to in order to have such uh a decomposition so here i think it's it's there is the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.154,
    "end": 4039.235,
    "text": " a lot of stuff to check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4039.835,
    "end": 4053.842,
    "text": "And I mean, there is a nice, I think it's in the Appendix B of the Bayesian Mechanics of Stationary Process paper by Lentz, where he derived the Helmholtz decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.884,
    "end": 4078.444,
    "text": " uh so yeah there are quite a few things we kind of state without um derive so it can if people are interested in in going further i think that's kind of interesting formal directions um and um um yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.404,
    "end": 4103.869,
    "text": " cool i think it'll be a really fun collaborative project to axiomatize and formalize and modularize using the active ontology and understand a lot of these um relationships and then the other piece that that made me think about is like what work is any of this math doing at all",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4105.182,
    "end": 4107.783,
    "text": " Just kind of like the ultimate existential question here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.223,
    "end": 4117.226,
    "text": "And when we condition upon existence, we've kind of like off-sourced a lot of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.846,
    "end": 4127.749,
    "text": "We don't need to make the jump or the walk or the miracle from axiom to embodied existence or to even measured hypothetical existence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.389,
    "end": 4129.55,
    "text": "So that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.638,
    "end": 4131.639,
    "text": " is left unaddressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.959,
    "end": 4134.801,
    "text": "The margin was not big enough, but it wasn't even addressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.901,
    "end": 4145.087,
    "text": "And maybe there are even advantages to leaving the, what happens before the conditioning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.881,
    "end": 4150.642,
    "text": " you don't want to take it with you after you condition upon it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4150.782,
    "end": 4152.802,
    "text": "That's the whole Markov blanket concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4152.922,
    "end": 4159.684,
    "text": "Like if you're like, well, I'm conditioning on five years ago in the present, but also I'm carrying five years with me today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.964,
    "end": 4162.024,
    "text": "Well, then it's like, well, then it wasn't conditioned upon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.644,
    "end": 4173.047,
    "text": "So to really condition upon measurements is an extremely radically simplifying maneuver.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4174.304,
    "end": 4187.86,
    "text": " That may change the scope or the applicability of the framework relative to a conception in which what the free energy principle does is describe how things come to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4189.346,
    "end": 4207.596,
    "text": " However, this rather conditioning upon it opens up that discussion and more circumscribes this very analytically tractable setting of the agent and the environment across a conditional interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.757,
    "end": 4209.937,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.804,
    "end": 4236.931,
    "text": " by the way about about the conditional thing there is now the notion of you know weak mark of blanket that dalton introduced which kind of lose the the the approach let's say and and um because indeed there is a question on uh i mean does it apart from the the the formal fitting we have here can we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.237,
    "end": 4252.609,
    "text": " really apply it to real systems and stuff like that and um and also i think it's a physics of survival uh in itself uh at a given survive at a given time scale there is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.95,
    "end": 4263.541,
    "text": " At a given time scale, we survive indeed in the sense that there is indeed this partition or conditional independence between the internal and external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.661,
    "end": 4271.029,
    "text": "Here is the physics you have to comply with, but it didn't tell you how the Markov blanket works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.629,
    "end": 4279.293,
    "text": " arise or whatever, it's just not what it is designed to explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.033,
    "end": 4290.578,
    "text": "But I think, generally speaking, it's really informative because, for instance, if you are considering the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.939,
    "end": 4293.94,
    "text": " I mean, this sort of approach in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.02,
    "end": 4305.267,
    "text": "I mean, for instance, if you consider the pendulum effect where you put pendulum oscillating on the table and they are going to synchronize with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4306.528,
    "end": 4309.87,
    "text": "And I think that Takuya Izumura did a paper about that recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.373,
    "end": 4332.556,
    "text": " in order to understand what is going on and why the pendulum synchronized at some point you just have to recycle all this line of reasoning with the synchronization maps that's very what is at play and what explains why the pendulum synchronized when they are both on the same table so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.557,
    "end": 4348.228,
    "text": " I think it is really informative in order to understand what is going on when we are talking about synchronization phenomena across sparsely coupled systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.649,
    "end": 4355.414,
    "text": "And also it gives you, I guess, the sort of recipe to understand what it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4356.244,
    "end": 4383.911,
    "text": " what it's um what it takes to be an agent if you want to design your uh an intelligence system um and um but uh yeah the question of how much useful it is uh beyond the fact that it's just some nice formal framework it's it's an interesting uh interesting discussion yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.856,
    "end": 4388.597,
    "text": " Just two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4389.298,
    "end": 4397.87,
    "text": "First, I would like to go back to your previous question about what sort of things could be discussed further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4399.008,
    "end": 4419.621,
    "text": " I think an interesting point we didn't really discuss fully is the notion of synchronization map, because we didn't necessarily really discuss the hypothesis and stuff about the synchronization map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.721,
    "end": 4426.506,
    "text": "And in fact, I think there is much things that can be said, for instance,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4427.186,
    "end": 4443.289,
    "text": " because we assume injectivity thanks to the rank nullity theorem it kind of constrain the dimension of the internal manifold here with respect to the blanket manifold here and it kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.17,
    "end": 4460.183,
    "text": " constrained in order to have injectivity thanks to the rank nullity theorem and so it kind of constrains the the the in order to say it in a qualitative fashion it kind of constrains the complexity or richness of the internal states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.884,
    "end": 4477.419,
    "text": " which speaks nicely to other frameworks like like ashby's laws of requisite variety where you want the regulator system to to be as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4478.54,
    "end": 4506.885,
    "text": " um as sophisticated or as rich to the regulated systems and here you need the internal states to be enough complex to uh or to constitute the sufficient statistics let's say to parametrize to be able to parametrize the density indeed um and this um and this uh richness let's say is constrained by the the cardinality of your sensory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.346,
    "end": 4516.959,
    "text": " channels, if you will, because basically you need the internal manifold to have the same dimensions as the blanket manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.135,
    "end": 4523.6,
    "text": " or the sensory manifold to have the same dimensions as the autonomous manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.601,
    "end": 4532.947,
    "text": "So I mean, I think there is many things to discuss about this aspect here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.988,
    "end": 4540.253,
    "text": "And the last thing I would like to say about your last question about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.515,
    "end": 4558.049,
    "text": " the applicability of the framework and how much it's useful as opposed to be a simple elegant formal framework i think so you know there is this um these papers about um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4560.892,
    "end": 4571.921,
    "text": " about the Markov Blanket trick and stuff like that, about how much difficult it is to identify what state corresponds to the Markov Blanket or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.556,
    "end": 4582.125,
    "text": " And personally, I'm not really convinced by these critiques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.726,
    "end": 4592.218,
    "text": "Because to me, it's like saying to Newton, yeah, I mean, I'm not sure that I can do anything with your framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.598,
    "end": 4593.54,
    "text": "It's complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.426,
    "end": 4621.841,
    "text": " if not impossible to model systems with clearly identified and separated roads and masses let's say uh okay fine but we're talking about newton mechanics here so i mean i think it's the the same here it's if you have a sparsely coupled random because systems that's the sort of behavior it will display it tells you fundamental things about the nature of living systems and the idea that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4622.961,
    "end": 4628.444,
    "text": " When it comes to a specific system, it can be quite tricky to model it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.584,
    "end": 4629.705,
    "text": "That's another question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.947,
    "end": 4638.73,
    "text": "And indeed, when it comes to the art of modeling complex systems, it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.85,
    "end": 4643.253,
    "text": "And we can discuss about how much complicated it can be to apply the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.853,
    "end": 4643.973,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.561,
    "end": 4645.941,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4646.161,
    "end": 4646.681,
    "text": "I love that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4646.702,
    "end": 4662.068,
    "text": "It's like the art of the science and the art of the modeling and the craft, especially in the kind of early hand-built, largely custom stage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4662.108,
    "end": 4673.072,
    "text": "Like one thing I even wondered looking through these slides, what fraction of these representations and formalisms exist only analytically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.204,
    "end": 4678.888,
    "text": " And is there a code representation of this exact scenario?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.189,
    "end": 4691.138,
    "text": "Or are some of these areas equations that don't have code realizations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4691.698,
    "end": 4693.86,
    "text": "They're just pure existing equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4696.162,
    "end": 4698.104,
    "text": "So, I mean, I think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.265,
    "end": 4724.154,
    "text": " um more or less everything here can be um can be simulated even this synchronization thing here you can perform simulations where you can really literally see within the simulations the synchronization um and i mean the the the whole thing here can be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.938,
    "end": 4737.003,
    "text": " You can simulate such partially coupled random numerical systems and kind of interpret the dynamics indeed as the way we frame it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.924,
    "end": 4745.446,
    "text": "But yes, that's also an interesting aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4745.806,
    "end": 4752.248,
    "text": "It could be cool in the GitHub repo, in the journal for this transcript or something like that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.554,
    "end": 4766.624,
    "text": " curate together the simulations that demonstrate or a minimal specification for it um yeah because it's it's actually there is um great",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4769.315,
    "end": 4781.658,
    "text": " Yeah, and actually there is, I mean, I think it's in Len's paper about synchronization map, the Bayesian mechanics of stationary processes paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.678,
    "end": 4793.902,
    "text": "There are some simulations where he shows that, I mean, he shows the synchronization map at play and it shows that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.782,
    "end": 4822.721,
    "text": " basically you can't go back to uh i mean if the the the map between the blanket states to the internal states is not injective uh and you apply the synchronization map to uh the actual sensory uh to the actual internet states it gives you like some not relevant things and there are some nice plots from simulations so that's yeah definitely a paper to to check out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.06,
    "end": 4849.066,
    "text": " so where do we land and then how do we leap exercise relax to prepare for part two yeah so i think here's the world point was i mean the the this world formulation is in a way about the momentary the short day the short term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.895,
    "end": 4878.565,
    "text": " and the momentary response to autonomous states to sensory stimuli let's say if there is this uh this um i mean the kind of instantiated active states are so that it comes whatever but in the next uh video where we will look at the path-based formulation of the framework the world idea",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.226,
    "end": 4887.808,
    "text": " would be to ask what about path and what about future path and what about the long-term behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.756,
    "end": 4912.331,
    "text": " uh and what about planning what about higher order cognitive abilities um and we we will kind of extend uh the scope of what we are doing in in that sense um but um yeah i mean i think from a formal point of view",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.819,
    "end": 4938.949,
    "text": " uh here i kind of introduced many things version of um rational inference synchronization map etc one after the other before actually deriving the free energy principle next time i think we will it will be more straightforward but the the main concepts to to which will be at the core of the of the framework and which can be confusing if it's the first time you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.669,
    "end": 4948.895,
    "text": " you look at it, it's the notion of generalized coordinates of motion when you relax, so white noise assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4949.844,
    "end": 4978.327,
    "text": " and that's something that can be confusing especially for the physicists because when you're starting saying yeah the generalized lagrangian he plays the role of an action or whatever they are like no but lagrangian is not an action what are you talking about etc but when you get acquainted with uh the world construction is very elegant but that definitely something uh people can started look at before prior to the the live stream yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.955,
    "end": 4980.315,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4980.555,
    "end": 4982.897,
    "text": "Yeah, well, it was excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4982.937,
    "end": 4998.907,
    "text": "You brought a lot together and a lot of trails leading off this trail and the citations and previous papers that also brought things together, Lance's work and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4999.688,
    "end": 5002.65,
    "text": "And it's going to be awesome to see part two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.33,
    "end": 5004.691,
    "text": "So thank you, Richard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5005.371,
    "end": 5006.472,
    "text": "Thank you very much, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5006.492,
    "end": 5006.772,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5006.792,
    "end": 5007.513,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5008.353,
    "end": 5008.613,
    "text": "See you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5009.294,
    "end": 5009.454,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5010.953,
    "end": 5011.217,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  }
]