[
  {
    "start": 7.443,
    "end": 30.642,
    "text": " hello and welcome everyone it's february 2nd 2024 and we are returning for active math stream 8.2 with richard servijan introduction to bayesian mechanics free energy principle and the paths based formalism thank you richard for joining for this part two looking forward to your presentation and then discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.342,
    "end": 37.423,
    "text": " I have a weird echo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.265,
    "end": 39.565,
    "text": "Wait.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.328,
    "end": 46.59,
    "text": "Are you in general synchrony with yourself on YouTube?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.172,
    "end": 50.493,
    "text": "Wait.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.633,
    "end": 51.553,
    "text": "Let me see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.495,
    "end": 54.756,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.376,
    "end": 55.716,
    "text": "Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.776,
    "end": 56.036,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.199,
    "end": 59.539,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.299,
    "end": 60.479,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.52,
    "end": 61.02,
    "text": "Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.088,
    "end": 64.71,
    "text": " Hi everyone and thank you again, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.771,
    "end": 71.617,
    "text": "So today I'm going to present the path-based formulation of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.478,
    "end": 79.424,
    "text": "And I'm going to start by a brief reminder of a couple of things we discussed last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.069,
    "end": 94.313,
    "text": " However, if you're not acquainted at all with the notions of synchronization map, of variational inference, or Langevin equations, it can be a good idea to watch the first video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.073,
    "end": 101.055,
    "text": "And if you do so, please check the comment I posted below where I precise and correct a few things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.815,
    "end": 106.256,
    "text": "So a quick reminder of where we started and where we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.667,
    "end": 129.654,
    "text": " so basically if you consider such sparsely coupled random dynamical system where mu corresponds to the internal states eta to the external states and a and s the blanket states to respectively the active and sensory states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.397,
    "end": 133.762,
    "text": " And they form together the so-called Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.427,
    "end": 142.439,
    "text": "And just a bit more vocabulary, A and mu form together the so-called autonomous states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.519,
    "end": 170.201,
    "text": " and finally if you add the sensory state to the autonomous state so you consider the wall mark of blanket plus the internal states you end up with the so-called particular states pi and the particular states defines or constitute a particle an agent bacteria in my schematic for instance so if you consider such sparsely coupled random dynamical system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.115,
    "end": 177.658,
    "text": " You can interpret the dynamics of the autonomous states in terms of perceptual and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.718,
    "end": 198.127,
    "text": "More precisely, you can see here in the bottom of my slide that the autonomous mode minimized a free energy function, which is defined under a generative model, which is typically the nest density, the non-equilibrium steady state density of your system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.812,
    "end": 225.872,
    "text": " so more precisely the internal states mu parameterize the density q mu over external states and if you look at the path of the internal mode it is so that the the pre-energy associated with your um variational density is always minimized and this license is an interpretation in terms of bayesian inference and about action because you can see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.593,
    "end": 252.308,
    "text": " here that the active mode is also a minimizer of the free energy in fact it minimizes the surprise term within free energy so that you can see the particle as actively sampling unsurprising or preferred sensory states sensory inputs which is active inference and yeah if you remember well the last video",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.015,
    "end": 258.859,
    "text": " we saw that the generative model encodes the preferences of your system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.359,
    "end": 264.202,
    "text": "So that was basically where we started and where we ended last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.162,
    "end": 270.966,
    "text": "And today, I want to relax a couple of hypotheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.506,
    "end": 276.989,
    "text": "So first of all, no steady state is assumed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.59,
    "end": 278.971,
    "text": "We could be at steady states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.151,
    "end": 280.592,
    "text": "We could have a well-defined",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.602,
    "end": 294.746,
    "text": " nest density uh but we do no we don't do any assumptions here there is no steady state assumed the second so it extends in a way the scope of the free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.419,
    "end": 300.261,
    "text": " The second thing we do is to relax the white noise assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.841,
    "end": 313.345,
    "text": "This means that we don't deal anymore with infinitely rough fluctuations, but we have fluctuations which are smooth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.786,
    "end": 318.107,
    "text": "So basically, we deal with colored or correlated noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.823,
    "end": 345.875,
    "text": " and this means that the fluctuations become differentiable up to a certain order so basically instead of dealing just with x and x prime let's say you have x prime prime and so on and so forth you have higher dynamical orders if you will note that this vector x here which precisely correspond to x x prime and so on is called the generalized states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.599,
    "end": 355.206,
    "text": " And a shifted vector, this one, where the first component is x prime, we refer to it as the generalized motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.287,
    "end": 367.055,
    "text": "And we also say that we work in so-called generalized coordinates of motion, not to be confused with generalized coordinates in analytical mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 367.825,
    "end": 390.841,
    "text": " so a lot of words but we just we are just saying that the fluctuations are smooth now and we can differentiate uh these fluctuations up to a certain order and this order is the order of generalized motion and it tells you how large the the correlation uh length of the fluctuations is basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.199,
    "end": 395.82,
    "text": " I also want to introduce the notion of generalized state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.32,
    "end": 402.581,
    "text": "So basically, you can augment state space with generalized motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.282,
    "end": 411.143,
    "text": "So instead of just looking at x, the state of your system, you look at x prime, x prime prime, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.004,
    "end": 417.585,
    "text": "And so basically, we consider the so-called generalized state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.974,
    "end": 448.045,
    "text": " okay so um a lot once again a lot of words just to say that fluctuations are smooth now so if you look at the equation below it seems that there there is dots and primes here which and it's it seems a bit redundant so in fact what we call x dot here you can view it as the actual time derivative that you can evaluate anywhere for instance at t equal to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.991,
    "end": 458.717,
    "text": " And the x prime here is just the second component of the momentary generalized states of your system, for instance, at t equal to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.477,
    "end": 464.72,
    "text": "So that if you evaluate your time derivative at t equal to, it equates indeed x prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.221,
    "end": 470.604,
    "text": "But the distinction between the two will become more clear later in the context of generalized filtering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.644,
    "end": 477.908,
    "text": "So the cool thing here is that if you perform a Taylor expansion of the state of your system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.74,
    "end": 480.16,
    "text": " So you have an equation like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 480.961,
    "end": 488.282,
    "text": "You can see that generalized states constitute the coefficients of your expansion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.562,
    "end": 494.584,
    "text": "Indeed, you can see in this formula here that you have x, x prime, x prime prime, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.024,
    "end": 502.846,
    "text": "So basically, you do a Taylor expansion around equal to, basically, and the coefficients of your expansions are generalized states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 503.621,
    "end": 515.165,
    "text": " So in a way, you can see generalized states are as encoding a path, as encoding the future of the state of your system thanks to this Taylor expansion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.185,
    "end": 518.146,
    "text": "And that's basically what I wrote here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.786,
    "end": 523.167,
    "text": "A point in generalized state space corresponds to a path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.307,
    "end": 528.929,
    "text": "That's exactly what I just said in virtue of this Taylor expansion here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.909,
    "end": 531.79,
    "text": "So a consequence of that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.555,
    "end": 550.46,
    "text": " is that if you look at the surprise over generalized state, the negative log p of vector x here, and we call it the generalized Lagrangian, it plays the role of an action scoring the likelihood of a local path over the correlation length of fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 550.86,
    "end": 553.201,
    "text": "So let me break down a bit this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.941,
    "end": 555.002,
    "text": "Once again, here, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.765,
    "end": 563.346,
    "text": " the order of generalized motion depends on how smooth the noise is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.967,
    "end": 571.45,
    "text": "So basically, when you do this Taylor expansion, the timescale considered here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.843,
    "end": 578.787,
    "text": " corresponds to the correlation length of your fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.287,
    "end": 589.874,
    "text": "The more correlated your noise is, the more dynamical orders you have in a way, the larger the path encoded by generalized states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.595,
    "end": 597.399,
    "text": "And the corresponding surprise, the corresponding generalized Lagrangian, negative log p of vector x,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.374,
    "end": 619.106,
    "text": " is a quantity that scores the likelihood of this path in virtue of the correspondence between points in generalized state space and paths so a last remark i want to to do in order to be sure that everything is clear here is the following you might be a bit confused especially if you have a physics background",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.28,
    "end": 643.196,
    "text": " uh because lagrangians and actions are two different things so let's take a let's take a step back and ask i have a path a trajectory in state space if you will and i want to compute a probability density associated with a path how should i do so the first thing to do is to discretize time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.807,
    "end": 647.267,
    "text": " So basically, you discretize your Langevin equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.547,
    "end": 657.549,
    "text": "So for the people acquainted with stochastic calculus, just notice that it means choosing your alpha discretization, either Ito or Satonovich, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 658.549,
    "end": 667.471,
    "text": "And from your discretized Langevin equation, you define an infinitesimal propagator, just like for path integrals in quantum mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.971,
    "end": 673.792,
    "text": "An infinitesimal propagator is just a transition density between one state to the next during a time window dt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 674.651,
    "end": 694.524,
    "text": " then you multiply the infinitesimal propagators and then you go to the continuous time limits and so in a nutshell that how you proceed to compute to write down a density associated with a path and if you do that for instance in the simple case of a winner process where the noise is a gaussian white noise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.31,
    "end": 701.879,
    "text": " you end up with the density of a path being proportional to the exponential of minus something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.44,
    "end": 704.603,
    "text": "And this something, we call it the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.184,
    "end": 709.49,
    "text": "So the smaller the action, the more likely the corresponding path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 710.971,
    "end": 719.993,
    "text": " And this action, in fact, corresponds to an integral over your path of something, and we call this something a Lagrangian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.413,
    "end": 728.694,
    "text": "So the Lagrangian is defined at any point in time while the action characterizes the path as a whole thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.094,
    "end": 733.935,
    "text": "So conceptually speaking, Lagrangians and actions are two very different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.295,
    "end": 736.876,
    "text": "But here, the key move is to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.988,
    "end": 761.97,
    "text": " uh kind of leverage the idea that a point in generalized state space encodes a path so that the surprise over generalized states this negative log p of x which is defined as a generalized lagrangian plays a role indeed of an action once again scoring the likelihood of a local path over the correlation length of fluctuations so that's really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.987,
    "end": 787.991,
    "text": " the core idea underlying the path-based formulation of the free energy principle so basically now that we have introduced these ideas let's look at the generalized lagrangian over autonomous states so i just want to point out that throughout the presentation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 789.005,
    "end": 806.592,
    "text": " in virtue of this correspondence between points in generalized states and path i will um i will call generalized states path for instance here i would say the lagrangian of autonomous path i use these words in a interchangeable way and similarly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.432,
    "end": 830.163,
    "text": " when i i'm dealing with an autonomous path minimizing a generalized lagrangian i will be talking of uh the the path of least action because lagrangians play the role of an action so be aware of this terminology so if i'm looking at this generalized lagrangian of autonomous path",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.043,
    "end": 854.757,
    "text": " so negative log p of alpha the cool thing here is that if i remove fluctuations noise on particular states or path so basically the particle respond deterministically to its environment i can rewrite this lagrangian like that and this formula coincides with unexpected free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.692,
    "end": 883.435,
    "text": " so what this formula is all about well we can reorganize it and if we do so you can for instance write it that way so what it means is basically that the path minimizing this lagrangian so the most likely autonomous path average over all possible sensory paths has to minimize these two terms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.053,
    "end": 892.479,
    "text": " And these two terms are very interesting because the first one, if you look at it, is it is an expected Lagrangian over sensory path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.779,
    "end": 905.007,
    "text": "So minimizing this Lagrangian means this expected Lagrangian means following an autonomous path which yields unsurprising or preferred sensory path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.467,
    "end": 910.471,
    "text": "And therefore, it can be viewed indeed as an expected cost you want to minimize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.776,
    "end": 937.322,
    "text": " and if you minimize also the the second term this negative expected information gain you can see that it is just an expected kyle divergence between two density and these two densities the difference between these two densities is just that the first one here is conditioned upon s so basically these two densities are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 937.938,
    "end": 941.619,
    "text": " different if the sensory path is informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.159,
    "end": 952.521,
    "text": "So maximizing this expected information gain means following an autonomous path, yielding an informative sensory path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.881,
    "end": 966.244,
    "text": "For instance, let's say you are in a dark room where there is an ambiguous mapping between the hidden external states and the sensory stimuli, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.304,
    "end": 975.468,
    "text": " you can turn on the lights and then this action would yield informative sensory inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 975.688,
    "end": 982.471,
    "text": "So that's the idea underlying the maximization of this expected information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.095,
    "end": 1006.232,
    "text": " so this quantity is very rich and in fact you can do connections and links with many established ideas for instance you can speak of um optimal bayesian decisions and optimal bayesian design or of pragmatic value and epistemic value etc the whole idea here is that this quantity entails the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.638,
    "end": 1015.881,
    "text": " preference-seeking imperatives of the particle, that's the first term, and the information-seeking imperatives of the particle, that's the second term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.662,
    "end": 1031.108,
    "text": "So the path minimizing this Lagrangian kind of constitutes the best direction of travel, the optimal direction of travel for the particle, so that you can view the particle as constantly engaging in an optimal behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.168,
    "end": 1033.869,
    "text": "Okay, so now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.09,
    "end": 1042.235,
    "text": " Having said that, I want to go back to the whole idea of synchronization map we talked about last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.375,
    "end": 1047.057,
    "text": "So in fact, in this setting, everything is exactly the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.097,
    "end": 1049.199,
    "text": "We just augmented state space, if you will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.019,
    "end": 1053.101,
    "text": "But you have mu parametrizing the density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.161,
    "end": 1054.442,
    "text": "Everything is the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1055.082,
    "end": 1062.727,
    "text": "And if we consider the internal path of least action, so the internal path minimizing this Lagrangian here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.616,
    "end": 1092.115,
    "text": " the corresponding parameterized density over external path coincide with the density over external path given sensory path so that if you write down the corresponding free energy you have the first term which vanishes in virtue of this above equality here and free energy reduces to surprise if you will to this lagrangian over particular path",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.159,
    "end": 1108.736,
    "text": " i'm going to so before using this to derive directly the free energy principle i need to briefly introduce the notion of generalized filtering so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.5,
    "end": 1112.242,
    "text": " In a nutshell, let's say that you have some data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.842,
    "end": 1116.004,
    "text": "You have the vector s here, a sensory path, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.524,
    "end": 1124.329,
    "text": "And you want to compute negative log p of s. That's the quantity you ultimately want to evaluate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1125.129,
    "end": 1126.37,
    "text": "But it's intractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1127.15,
    "end": 1135.155,
    "text": "Let's say that computing this p of s would require a monstrous marginalization, and you can't directly compute this guy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1136.906,
    "end": 1145.814,
    "text": " Instead, you define a proxy, you define an upper bound, this variational free energy, which is parametrized by mu, by vector mu.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.695,
    "end": 1160.707,
    "text": "And you just want to minimize this free energy so that it coincides with what you ultimately want to compute, namely, once again, negative log p of s. So in order to minimize, indeed, this free energy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.383,
    "end": 1169.706,
    "text": " You just follow a recognition or filtering dynamics, which is, in fact, a gradient descent on free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.686,
    "end": 1175.848,
    "text": "In fact, the exact dynamics at play here is this equation here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1176.609,
    "end": 1182.451,
    "text": "So you could ask, but why don't we just have the gradient term here, nabla f?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1182.551,
    "end": 1185.792,
    "text": "Why do we have a second term here, this d mu?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.747,
    "end": 1189.309,
    "text": " By the way, about this d mu here, what is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.849,
    "end": 1197.535,
    "text": "Well, the matrix d here is just this matrix with ones here in this line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.975,
    "end": 1214.607,
    "text": "So basically, if you have a vector x, let's say, x, x prime, x prime prime, and so on, and you want to get from this vector a shifted vector, x prime, the motion, if you will,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1215.259,
    "end": 1231.42,
    "text": " you just have to apply this matrix d here and on x and it gives you indeed x prime and so basically you can use this d mu here as being equal to mu prime basically and the idea is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.586,
    "end": 1260.912,
    "text": " you when once you the gradient term here is minimized when free energy is minimized so we we look at the stationary solution of this equation if you will mu dot coincide with d mu and let me just explain why we don't just have the gradient term here if we only had the gradient term without the d mu here we would go down on free energy until a minimum is reached and basically we would have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.898,
    "end": 1282.044,
    "text": " the first component of the vector mu being non-zero but all the higher dynamical orders would be zero because we are at the minimum of free energy and we don't move anymore but here it is a whole vector mu which parametrize free energy and we don't want all the entries to be zero",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.759,
    "end": 1291.305,
    "text": " And we want an equation which guarantees that, so that we add an additional term in the equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.365,
    "end": 1296.528,
    "text": "So that's basically, in a nutshell, what generalized filtering is all about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1298.209,
    "end": 1309.037,
    "text": "And by the way, note that if you consider the path of least action of some process x, you can write it in a very similar fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.177,
    "end": 1310.898,
    "text": "The only difference is that here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1311.593,
    "end": 1334.749,
    "text": " the quantity minimized is just the the this background generalized lagrangian here whereas it was free energy in the context of generalized filtering and by the way we just saw before that if uh we that if we consider the path the internal path of least action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.507,
    "end": 1356.873,
    "text": " the corresponding free energy here associated with the density the internal path of heat action parameterize it reduces to the lagrangian so that when we write down the equations here verified by the autonomous path of least action you can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1357.771,
    "end": 1360.972,
    "text": " directly identify free energy to the Lagrangian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.172,
    "end": 1365.713,
    "text": "And we basically have the same equations that in generalized filtering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1366.573,
    "end": 1379.877,
    "text": "So basically, if we look at the autonomous path of least action, you can interpret the dynamics of the internal path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1379.897,
    "end": 1384.618,
    "text": "So in terms of Bayesian inference, which takes the form here of a Bayesian filtering scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.965,
    "end": 1414.2,
    "text": " and note that if we remove fluctuations on particular states or paths that the definition of dealing with a conservative particle the autonomous path will coincide with the autonomous path of least action and note that ignoring fluctuations might be relevant when it comes to very large particles where you can so to very large particle you can cause grain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.28,
    "end": 1424.307,
    "text": " And you can check these papers here, where they try to average out fluctuations using a renormalization group approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.548,
    "end": 1431.192,
    "text": "So in the end, we find the free energy principle just as before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.613,
    "end": 1441.62,
    "text": "But the difference is that here, the Bayesian inference takes the form of a Bayesian filtering scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.705,
    "end": 1458.753,
    "text": " but otherwise we still end up with a variational principle accounting for the the for the perceptual and active inference that the particle do so okay now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.844,
    "end": 1478.042,
    "text": " i want to do a bit of zoology of typology let's say i said last time that this past coupling architecture here was a canonical sparse coping architecture but it was not a definitive feature of the free energy principle and that we could look at other sparse coupling architecture and i want",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.682,
    "end": 1481.824,
    "text": " now to look at various sparse coupling architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.304,
    "end": 1490.828,
    "text": "So the most simple ones you could imagine is one like that where you don't have active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.668,
    "end": 1499.992,
    "text": "So basically, the Markov blanket is only made of sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.332,
    "end": 1507.055,
    "text": "In the end, you can still write down the internal path of least action like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.975,
    "end": 1522.529,
    "text": " but it will the idea that the particle encodes beliefs about its external environment it will not manifest to an observer because by definition an observer has only access to the mark of blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.679,
    "end": 1548.144,
    "text": " and that's what this quote is all about when it says that whether internal paths of least action parameterized beliefs about external paths and therefore minimize operational free energy can only manifest via active states that is in active particles and of course no one would attribute any form of agency or a sentence to a simple piece of rock for instance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.784,
    "end": 1558.23,
    "text": " So if we move to the realm of active particles now, we basically have the equations we studied before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1558.771,
    "end": 1566.697,
    "text": "But the difference here is this fast coupling architecture is that the active states do not directly interact with the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.503,
    "end": 1593.358,
    "text": " and the sensory states do not directly interact with the internal states this sparse coupling architecture is quite interesting because it reminds i would say it reminds the the way a bacteria is coupled with its environment because you would have like the outer membrane with all the trans membrane proteins the receptors whatever which would correspond to the sensory states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.173,
    "end": 1616.963,
    "text": " and then you would have the underlying cortex filaments which mediate many many aspects of biotic actions so i liked i like very much this architecture here but we can even go further in the sophistication and consider the so-called strange particles the only move here is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.271,
    "end": 1620.933,
    "text": " we don't have any arrow from s to eta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.333,
    "end": 1626.076,
    "text": "But more importantly, we don't have any arrow from a to mu.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.276,
    "end": 1631.779,
    "text": "So the active states do not directly influence the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.12,
    "end": 1646.928,
    "text": "And this is interesting because it means that now the internal states alone are independent of both the active and the external states when conditioned upon the sensory state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.541,
    "end": 1659.768,
    "text": " So from the point of view of the internal states, the active states become a latent cause, just like the external states of the sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.009,
    "end": 1663.85,
    "text": "So basically, everything is the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.15,
    "end": 1669.653,
    "text": "You can write down a variational density parameterized by the internal states or path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.454,
    "end": 1675.797,
    "text": "But now, it is over both the external and the active path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1676.804,
    "end": 1680.087,
    "text": " And so we have this free energy here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.108,
    "end": 1686.753,
    "text": "We call it the generalized free energy G, but everything is the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.873,
    "end": 1695.019,
    "text": "It's just a variational free energy associated with our recognition density, which is over both external and active path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.301,
    "end": 1704.888,
    "text": "So that in the end, we have this equation here where you have in the equation of the internal path of least action,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.718,
    "end": 1715.707,
    "text": " the gradient on um on g here so it's very interesting because it basically means that the internal path",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.123,
    "end": 1746.458,
    "text": " in first in first and in fact cause uh the its own action um the the its own action which then cause its sensory uh inputs so and i'm quoting here the paper which introduced the notion of strange particles you can view the active particle the active path story as realizing the sensory consequences of the inferred action so basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.259,
    "end": 1752.242,
    "text": " Such a particle kind of auto its own action, its own action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.062,
    "end": 1759.806,
    "text": "And so the idea here is that the particle kind of infer its its own course of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1761.007,
    "end": 1768.912,
    "text": "Which will yield preferred sensory outcomes, so it's really a form of planning of inference, strange particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.091,
    "end": 1792.152,
    "text": " do planning as inference so that's that's uh quite cool and in fact we can even go go a bit further and assume a certain level of sparsity within internet states so you would have this mu1 here which influence mu2 but not the other way around so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.16,
    "end": 1797.402,
    "text": " From the point of view of the world internal states, everything is the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.462,
    "end": 1801.845,
    "text": "You have it parameterized altogether density Q mu.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.025,
    "end": 1810.289,
    "text": "And by the way, under a mean field approximation, you can write it that way, where you would have Q mu 1 and Q mu 2 here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.05,
    "end": 1816.212,
    "text": "But the very cool thing here is that from the point of view of mu 1 alone,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.223,
    "end": 1835.804,
    "text": " well mu1 is independent of mu2 a and eta when conditioned upon s and you can view mu1 alone as parametrizing a density over mu2 a and eta and we call it that way with the over script m",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.81,
    "end": 1852.721,
    "text": " so basically q mu 1 is a density or a belief about mu 2 and therefore about q mu 2 so that you can view this q mu 1 m as a metacognitive belief because it constitutes a belief about a belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.76,
    "end": 1877.328,
    "text": " because it's a belief about q mu 2. so that just by assuming this simple architecture within internal states we end up with a minimal bayesian mechanics let's say of metacognition and it also introduces the notion of metacognitive particles so i think that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.856,
    "end": 1894.685,
    "text": " uh what bayesian mechanics is all about meaning uh translating cognitive abilities in simple physical term it constitutes in a way a physics of cognition if you will so having said that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1896.331,
    "end": 1919.883,
    "text": " uh thank you very much and especially thanks to all these guys here which who helped me a lot uh understanding uh the free energy principle and especially the path-based formulation of the free energy principle thank you all right awesome great",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.311,
    "end": 1947.789,
    "text": " a lot of ways I could start but it's so interesting that um how smoothly the path based continues on so maybe could you give a remark on just the timeline in the literature which one of these state and path base were developed just roughly like in which ordering was one first or how did that happen yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.341,
    "end": 1963.032,
    "text": " Yeah, so I'm not an expert on the history of the free energy principle, but I know that thinking in terms of path and in terms of generalized filtering has been around for forever, in fact, in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.612,
    "end": 1974.621,
    "text": "But about the most, I would say, definitive formulation in such terms,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.181,
    "end": 1979.965,
    "text": " I would say that the most important paper is, well, I have it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.666,
    "end": 1983.868,
    "text": "It's called Path Integrals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.729,
    "end": 1989.272,
    "text": "Well, where it is, I can't see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.995,
    "end": 1993.255,
    "text": "Well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.256,
    "end": 1998.659,
    "text": "Friston, Physics of Life Review, 2023B, Path Integrals, Particular Kinds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.58,
    "end": 2000.16,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.26,
    "end": 2003.623,
    "text": "This paper here, Path Integrals, Particular Kinds, and Strange Things,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.306,
    "end": 2010.688,
    "text": " which is also the paper which introduced all this typology of particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.508,
    "end": 2016.589,
    "text": "And it kind of really formulated the free energy principle that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.389,
    "end": 2021.55,
    "text": "So I think that's pretty much a very, very important paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.23,
    "end": 2029.352,
    "text": "And actually, the one which introduced the notion of metacognitive particles, the one of Lenz and Lars,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.712,
    "end": 2054.325,
    "text": " um this one towards the bayesian mechanics of metacognitive particles the last one it is actually a commentary a short commentary very easily readable of the path integral paper we just mentioned and also i would say that in the 2022 paper the free energy principle makes it simpler but not too simple",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.196,
    "end": 2057.878,
    "text": " published in 2023, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.24,
    "end": 2071.291,
    "text": "It mainly focused on the state-based formulation, but it also talked about paths and generalized states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.692,
    "end": 2091.183,
    "text": " um so it it's also a very nice um very nice papers and it kind of derives the whole thing from scratch so i think this paper is also very very important and yeah i think basically in the last",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.843,
    "end": 2121.487,
    "text": " two or three years there have been many papers uh reformulating the free energy principle or grounding it in in in solid math and so on so it's i think currently and let's say the the few years which followed from the 2019 monography of carl friston it has been very important years about when it comes specifically to bayesian mechanics and the actual physics underlying the free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.356,
    "end": 2123.797,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.837,
    "end": 2125.94,
    "text": "Yeah, I'll just restate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.96,
    "end": 2128.123,
    "text": "I think there's a few great points to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.703,
    "end": 2139.358,
    "text": "So even as early as the early 2000s, there was the notion that there was like physics of consciousness, physics of cognitive systems, a free energy principle for the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.279,
    "end": 2145.303,
    "text": " There were physics-based equations in the 2010 Friston paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.343,
    "end": 2148.566,
    "text": "There's a big tree with all these different inference algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.446,
    "end": 2157.753,
    "text": "However, they were all just kind of branches on that tree, a little bit more evocatively or aspirationally, but not formally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.453,
    "end": 2159.934,
    "text": "Then, dot, dot, dot, 2019.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.136,
    "end": 2190.133,
    "text": " free energy principle for a particular physics and the reading group and all the work around that and then especially in the last year since then um i think that the the decision and the move that you made to lead with the state-based and then almost nothing had to be said today of course it was a great presentation but you said it all that we pointify the path we make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.632,
    "end": 2218.625,
    "text": " paths into points in a given space um and so i was thinking about like being in a car and then there's one path where like my first derivative is one for two seconds and then it stops and then that was that path and there's another path where my first derivative is one for four seconds and then i stopped and so all of those different paths which do take the car to different locations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.656,
    "end": 2224.837,
    "text": " they are also just points in this generalized space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.358,
    "end": 2241.562,
    "text": "And then there's this interpretation of those coefficients as the Taylor series expansion, but it just shows how versatile the formalism is because it can take",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.847,
    "end": 2269.778,
    "text": " points in arbitrary state spaces which means yes you can imagine arbitrary state spaces that correspond to taylor series expansions or potentially other kinds of constructs what do we get from paths so in fact i think there are um a couple of things which uh motivated such a formulation because when",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.231,
    "end": 2296.353,
    "text": " I mean, about the usual state-based formulation we talked about last time, there was many critics, many, I mean, it was, there was many debates, for instance, about the question about the nest density being at steady state, is it really relevant when it comes to real system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.02,
    "end": 2319.025,
    "text": " to real biological systems for instance so there was many uh things which are now um addressed by the path-based formula formulation uh because as we saw we relaxed a couple of hypotheses and also the second thing which is very very much at the core of the path-based formulation as you said is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.64,
    "end": 2339.32,
    "text": " I mean, the fact to move from states to path, to path which are in fact encoded by generalized states, it allows you to speak of the future, to speak to the future path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.08,
    "end": 2356.347,
    "text": " so that you can develop a physics of particles planning for instance which was not at all the case with the previous formulation so having such extension of the scope of the free energy principle it allows you to to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.081,
    "end": 2387.37,
    "text": " literally describe the bayesian mechanics of particles planning uh and and so it's the fact to think in terms of path as opposed to states it allows you to develop a physics of let's say higher order cognitive abilities i would say uh so it's it's definitely very very cool and uh a great achievement let's say responding to that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.598,
    "end": 2392.781,
    "text": " I would say planning is possible in the state-based formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.941,
    "end": 2398.666,
    "text": "It's just more of a brute force, tree-branching engineering problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.086,
    "end": 2411.236,
    "text": "So it's almost like in the state-based formalism, there was a physics of the perception-action loop, and then there were classical computer science ways to deal with the branching of planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.366,
    "end": 2422.393,
    "text": " just like a chess algorithm, like how many depth deep in the time horizon, and then there's all these secondary strategies for branching and pruning that search tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.054,
    "end": 2431.72,
    "text": "But there's kind of like few to none in terms of the guarantee of the time horizons of policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.08,
    "end": 2435.743,
    "text": "You just kind of had to enumerate all the possible options.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.824,
    "end": 2440.606,
    "text": "But the real-time kernel was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.684,
    "end": 2449.409,
    "text": " physically grounded and beautiful, and then planning had to be a little bit enumerated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.31,
    "end": 2462.278,
    "text": "But when we have the path as an atomic entity, then we can kind of extend the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.141,
    "end": 2473.25,
    "text": " the elegance or the simplicity that we were dealing with states in the moment, but now our state in the moment is like a Taylor expansion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.151,
    "end": 2484.541,
    "text": "And this comes up a lot in the distinction between the discrete time and the continuous time models like figure 4.3 in the textbook, where in a discrete time model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.092,
    "end": 2497.714,
    "text": " If you want to plan a hundred time steps in the future, there's some variable, you know, T sub 100, like you literally are making a prediction, but you have no prediction for T sub 99.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.354,
    "end": 2501.235,
    "text": "You're just making discrete predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.875,
    "end": 2514.597,
    "text": "Whereas a Taylor series, even a Taylor series for a super complex function, and you're only going to go two levels of differentiation in, you will have a prediction even for any points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2515.771,
    "end": 2529.273,
    "text": " it might be radically wrong, but you get the whole support from negative to positive infinity basically for free without guarantees of it being accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.713,
    "end": 2542.196,
    "text": "But it's like you've kind of pinned yourself to the timeline and then every single derivative that you take is giving you a better handle on that path for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.536,
    "end": 2543.496,
    "text": "You'll never do worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.117,
    "end": 2550.641,
    "text": " And so that is so similar, yet also very different setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.862,
    "end": 2560.848,
    "text": "It's true that I said that the time scale considered was basically the correlation length of fluctuations on the number of the order of generalized motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2561.368,
    "end": 2566.692,
    "text": "But in principle, your Taylor expansion applied to, I mean, it's infinite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.152,
    "end": 2573.016,
    "text": "But of course, above, beyond the correlation length of fluctuations, it becomes wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2573.696,
    "end": 2581.758,
    "text": " And I also want to say about what you said in the beginning about the state-based formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.798,
    "end": 2583.079,
    "text": "Yeah, it's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.339,
    "end": 2589.001,
    "text": "And actually, in the paper, the free energy principle is simpler, but not too simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2592.121,
    "end": 2593.082,
    "text": "So you can write down...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.418,
    "end": 2607.448,
    "text": " the action of a path so here we we have a gaussian white noise everything is is uh so we we are really in the state-based formulation of the fep you can write the action of a path",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.502,
    "end": 2634.743,
    "text": " and you realize that it coincides with an expected free energy as well so you don't need to be in the path-based formulation to uh go to to to get to the expected free energy thing um which equates the action of autonomous path or here in our path-based formulation it equates the generalized lagrangian of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.964,
    "end": 2659.544,
    "text": " uh autonomous path so so yeah could you come back to where there was the generalized lagrangian so this is a um okay maybe a one before this yes okay thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.51,
    "end": 2668.891,
    "text": " But those of us outside of the non-active physics world, how is action used?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.071,
    "end": 2677.533,
    "text": "What does action correspond to in physical systems when we're talking about action as generalized Lagrangian?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.033,
    "end": 2686.074,
    "text": "Is this the same thing as what we're talking about with policy selection and movement and embodied action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.274,
    "end": 2690.295,
    "text": "How is this physics concept of action being used?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.509,
    "end": 2698.492,
    "text": " So first of all, I would say that there is, I mean, it depends on what we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2699.713,
    "end": 2710.378,
    "text": "When it comes to actions in Lagrangian, we usually think of analytical mechanics, but here it would be more in the context of stochastic calculus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.198,
    "end": 2721.043,
    "text": "And in the context of stochastic calculus and path integrals in stochastic calculus, the action is just a quantity which scores the likelihood of a path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.65,
    "end": 2742.277,
    "text": " so if for instance the density of the path is uh the exponential of minus something you would call by identification this uh thing the action and basically the smaller the action the more likely the power because the higher the density of your path and vice versa",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.229,
    "end": 2752.132,
    "text": " So by the way, when we were saying, for instance, here that the action is equal to, I mean, we define it as negative log density of the path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.613,
    "end": 2769.919,
    "text": "In principle, if the density, I mean, when it comes to the usual definition of the action, if I write my density as a normalization factor times the exponential of minus the action, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.045,
    "end": 2795.963,
    "text": " if i take the negative log of this density i would have the regular action plus something and usually this uh constant is this is discarded we we just don't consider it so that the action reduces to negative log density of a path but conceptually speaking this action is very different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.624,
    "end": 2814.828,
    "text": " from the idea of lagrangian because basically the act i mean usually speaking the action is the integral over time over your path of um of a quantity called the lagrangian so at every point in time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.703,
    "end": 2826.693,
    "text": " there is a quantity defined, and this is the Lagrangian, which is defined at any point in time, while the action is a quantity which characterizes paths as whole things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.373,
    "end": 2832.858,
    "text": "So conceptually speaking, actions in Lagrangians are very different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.139,
    "end": 2837.743,
    "text": "Lagrangians, once again, are defined at any point in time, while the action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.154,
    "end": 2871.16,
    "text": " okay Lagrangian was defined at any point in time while the action okay I'll wait a few seconds for Richard to rejoin if you're watching live please feel free to write questions in the chat and we'll look at them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.063,
    "end": 2894.455,
    "text": " it you're back it's all good yeah lagrangian is defined at every point in time and then the action and basically um so in order to just uh answer what you well uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.33,
    "end": 2914.543,
    "text": " here yeah when you said that is it different from the notion of action when in the active in front uh literature for instance and so on here we use the word action uh but it has nothing to do with the notion of action like acting in the world etc so yeah for the people who never um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.443,
    "end": 2930.839,
    "text": " meets this concept, so it can be super confusing, I guess, when you read patient mechanics papers, you don't really know what action we are talking about, but yeah, they are very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.3,
    "end": 2938.167,
    "text": "I know, it's funny, like, each path has an action value, the negative log density,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.477,
    "end": 2944.922,
    "text": " that in a way summarizes what we could say are the actions that that path entails",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.286,
    "end": 2973.919,
    "text": " but yet the actions or the affordances that are taken on that path that are summarized by the physics action um so there's yeah yeah um also yeah very um cutting edge with reviewing the typology of particles and the dacosta and sanved smith metacognitive particle um that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.779,
    "end": 3002.294,
    "text": " shows i think a few things one that often there are implicit concepts and qualitative concepts that are built up like long have people said that there is a continuity of modeling between rocks and societies for example popes and plaintiffs and plankton all these other funny things that that friston at all say but not until this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.309,
    "end": 3008.714,
    "text": " Did we see the simple, the conservative, and the strange?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.795,
    "end": 3020.066,
    "text": "And then with that target article, just with the DaCosta and Sanford Smith work, they kind of take that in another level and compose...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.832,
    "end": 3044.916,
    "text": " off to the side and now we can go into a metacognitive depth combining back to like the hierarchical nested meta awareness work of Sam Ben Smith from 2021. so it's just very cool how there's like a kind of earlier first pass qualitative intuition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.607,
    "end": 3069.404,
    "text": " and then the empirical research question is like where can we build the high-speed rail lines and this is like the blueprint for the high-speed rail now and then the next level will be like actually making the simulations or whatever it is to kind of show that this is not just something that you can make in PowerPoint but this is actually something where the rabbit is going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.297,
    "end": 3099.857,
    "text": " evincing some kind of behavior that it couldn't otherwise but it's kind of like that's like in a way it's not the only way but it is like an agenda between the um intuitive to the sketched and just it builds forward in these ways that are being reviewed pretty clearly and changing on a month by month yeah and i think i mean this i i mean this agenda of translating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.548,
    "end": 3129.794,
    "text": " um concepts like cognitive abilities and stuff in simple physical terms is quite interesting and i i mean we we discussed it on by message on discord but it's it's um it would be cool and it's it's coming it's happening but uh it's cool it could be cool to for the this uh bayesian mechanics this field to be more known and recognized",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.518,
    "end": 3143.333,
    "text": " by the physics community because if you meet like a regular physicist working for instance in the physics of complex systems on or on in biological physics or biophysics and stuff like that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.719,
    "end": 3150.723,
    "text": " I mean, you have like a 0.999 probability that he never heard of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.744,
    "end": 3160.87,
    "text": "While we have a world agenda to follow, I think there is way more to be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.951,
    "end": 3165.173,
    "text": "It's like the down of this field of this agenda, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.914,
    "end": 3171.358,
    "text": "So I think the next years are quite exciting in that regard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.283,
    "end": 3174.624,
    "text": " I totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.964,
    "end": 3184.388,
    "text": "Like one meme or theme on that for me is like the base graph on the screen on the table, it is what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.928,
    "end": 3191.571,
    "text": "And then there's the second level where we annotate or assert that graph with cognitive phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.171,
    "end": 3193.672,
    "text": "Like, well, this graph is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.949,
    "end": 3201.771,
    "text": " reflects attention or awareness of attention or metacognition or regret or whatever we're modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.291,
    "end": 3205.012,
    "text": "We kind of make an assertion about the Bayes graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.893,
    "end": 3207.853,
    "text": "And like you said, it's the dawn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.453,
    "end": 3211.695,
    "text": "This isn't the answer on metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.195,
    "end": 3222.198,
    "text": "This is like one very snappy, very following in line way of modeling metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.57,
    "end": 3247.195,
    "text": " but there's no end there's no end to that question of how do you model metacognition and so then it's just like every time in a psychology paper or any we see like a cognitive phenomena which can include everything from anticipation you know past present future that's like our keyhole to bridge with this generalized unifying perspective on cognitive systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.993,
    "end": 3249.934,
    "text": " Yeah, I totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.954,
    "end": 3269.445,
    "text": "This work is really, this work here on the slide is very like a first work, but I mean, when it comes to metacognition, for instance, I mean, I'm not an expert at all, but there are many concepts, I don't know, mental actions, cognitive effort, whatever, there are many things, many layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.326,
    "end": 3276.91,
    "text": "And the, I think, like translating all of these concepts of these phenomena, processes, whatever,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3278.064,
    "end": 3294.25,
    "text": " into an actual bayesian mechanics is um is really like um what's coming in fact i think in the next years so and yeah we'll see and and as you said beyond the analytical work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.467,
    "end": 3308.48,
    "text": " there is also the simulations worked examples whatever um so yeah i think there are many many works to to be done and which are coming in the in the next years i totally agree",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3310.151,
    "end": 3327.357,
    "text": " Yeah, a kind of analogy that brings to mind is like early in the periodic table, not saying that we're studying material phenomena, or even that elements are material phenomena, but it's kind of like, well, the rabbit has vision, taste, and hearing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.357,
    "end": 3334.439,
    "text": " So if we've identified memory in vision and taste, there's like a missing element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.579,
    "end": 3336.219,
    "text": "Maybe it's not there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.479,
    "end": 3338.179,
    "text": "Maybe the memory for hearing is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.8,
    "end": 3343.181,
    "text": "Or maybe it's something very complex, but there's a space there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.361,
    "end": 3347.702,
    "text": "It's like there should be a rare earth metal in the fourth row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.422,
    "end": 3351.563,
    "text": "There should be an attention variable on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.583,
    "end": 3376.125,
    "text": " And so it's kind of like a higher dimensional periodic table where because we know about certain patterns that are either kind of convergently arising in the real world because of what is life or they're convergently arising because we choose to model things a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.115,
    "end": 3387.74,
    "text": " Then that brings a huge amount of concordance and juxtaposition to the field of chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.421,
    "end": 3393.644,
    "text": "Whereas previously there might have been air chemistry and water chemistry and fire chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.704,
    "end": 3398.286,
    "text": "And then there'd be like, oh, but what happens when you throw water on a fire?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.766,
    "end": 3400.627,
    "text": "Or what happens when the air in the room burns out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.667,
    "end": 3403.329,
    "text": "There'd be like these edge cases where it's like, oh, we don't do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.773,
    "end": 3409.037,
    "text": " But that's what's happening when we don't have the unified model for cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.797,
    "end": 3422.028,
    "text": "People will kind of study one phenomena or character of a system to its limits, but the limits of any phenomena in our highly woven life forms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.12,
    "end": 3424.881,
    "text": " Like, you don't chase it to the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.622,
    "end": 3430.365,
    "text": "If you're studying foraging in the ant colony, it's not like there's a, okay, that was the end of the rainbow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.026,
    "end": 3431.866,
    "text": "Foraging is over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.247,
    "end": 3434.268,
    "text": "It's like, oh, well, foraging's related to nursing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.809,
    "end": 3436.69,
    "text": "And then that's related to this and the weather.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.611,
    "end": 3443.034,
    "text": "It never just simply terminates with the inquiry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.375,
    "end": 3450.26,
    "text": "And possibly that could reflect the extremely early stage of this formalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.974,
    "end": 3460.501,
    "text": " Possibly there are fundamental unknowns and adjacencies in our epistemic situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.302,
    "end": 3476.874,
    "text": "Yeah, and I think, I mean, a few years ago, the idea of kind of extending physics to, in order to have an actual physics of cognition, it would be like crazy, like the Holy Grail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.914,
    "end": 3478.335,
    "text": "And the fact that we have this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.23,
    "end": 3499.808,
    "text": " early works is quite an achievement and I would also say that what's interesting here is that we already do have formal models of many of many cognitive phenomena for instance you were talking about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3500.749,
    "end": 3521.816,
    "text": " the paper of last about metacognition so we have very precise and formal active inference models for instance of many different phenomena like metacognition and so on so in a way we kind of already know what we should end up with and the idea is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.976,
    "end": 3547.811,
    "text": " uh how to do how to play for instance with the sparsity within internal states in order to go to get back to re-derive or refine what people are already modeled in a different literature earlier so that's kind of the dynamics i think um so yeah we will see in the next years how it goes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.812,
    "end": 3578.132,
    "text": " yeah that's a great point a few more thoughts on that like a lot of the uh adjacencies and generalizations mathematicians and physicists and statisticians they're experts in this like if it was a fixed number see if it could be variable if there wasn't a variance see if you can add a variance if it was this kind of distribution swap it out for like there are these kind of syntactic moves that barely require",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.232,
    "end": 3600.26,
    "text": " much more than just like yeah these are the swaps we make like this is what it looks like to generalize a theory it's like we could add a variance on it you know all so those kinds of um familiar moves and then um so much can be explored on this topic but when we think about a physics of cognitive systems or a physics of cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.58,
    "end": 3608.075,
    "text": " Sometimes I feel like I have one foot like is, it's like tied or somehow...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.767,
    "end": 3635.018,
    "text": " trailing with the reductionism like it's hard to escape the material basis and it's also not clear if we want to escape the material basis because of physics of cognitive systems on one hand it might address this kind of like thermo info negentropic schrodinger what is life question about persistence and order of kind of quasi crystals",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.801,
    "end": 3659.09,
    "text": " or leave all that mess separate mess and beauty the pure bayesian mechanics if we just say okay now we're in the map we're leaving the territory behind we're not going to talk about the actual calories and the thermodynamics we're just on the map and a massive prior with a little attention is like a piece of sand hitting a mountain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.09,
    "end": 3670.193,
    "text": " And a very loose prior with a highly attended to data point is like a bowling ball smashing through a small little heap of sand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.054,
    "end": 3680.697,
    "text": "So it's like there's a physics to the collision of incoming data and prior, which is the Bayesian setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.797,
    "end": 3684.578,
    "text": "So it's interesting that there's a sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.199,
    "end": 3707.502,
    "text": " map Bayesian mechanics that kind of non-controversially describes the collision of priors of different mass in a way and then the tantalizing question or connection is whether that is like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.493,
    "end": 3730.024,
    "text": " one and the same or an enabling factor or a downstream factor of this actual thermoinformational autopoiesis for living systems if if I may add something I think here the uh I mean an interesting point is that if you have for instance um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.741,
    "end": 3744.71,
    "text": " I mean, I don't want to go there really, but if I have a software which can be implemented by many sort of hardwares, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.332,
    "end": 3756.398,
    "text": "And this idea was actually a lot debated when it came to functionalism and stuff like that, but anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.663,
    "end": 3762.831,
    "text": " Here, such Bayesian mechanics, in a way, it's the physics of how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.456,
    "end": 3798.775,
    "text": " how the the overall system should behave but we so there is for instance the minimization of this uh free energy functional but we are not saying how the here we we do not um uh explicitly say how the system uh actually does the computations we just say that a spastic of a random radical system has somehow to do that stuff",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3800.137,
    "end": 3807.824,
    "text": " And in a way, it is neutral about what the actual system is made of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.825,
    "end": 3814.471,
    "text": "It's like when we say that the free energy principle is more a framework than a process theory or stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3816.512,
    "end": 3817.193,
    "text": "But I mean,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3821.276,
    "end": 3838.444,
    "text": " i don't know very much about these uh questions i i think that's that's a great point it's like that's why a program or an operating system can be run when a different processor is brought in just within a kind of classical computing setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.452,
    "end": 3861.475,
    "text": " um as a cognitive mapping or cognitive modeling framework like we don't know if that rabbit is a real biological rabbit that rabbit might be a deep fake rabbit and we're interacting with it through a video channel and we think that we're doing behavioral research on a real rabbit but it's just a really convincing synthetic data rabbit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.775,
    "end": 3881.411,
    "text": " we don't know because we're only getting the observations that we're getting and then we can tell any number of possibly compatible stories or interpretations about the data we're getting and to say more or to go further like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.785,
    "end": 3889.229,
    "text": " that's stepping past the boundary of the actual observations we're making, which is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3889.249,
    "end": 3893.791,
    "text": "Like we want to propose hypotheses for what we're not directly observing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.851,
    "end": 3896.573,
    "text": "That's the whole point of latent states and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.713,
    "end": 3907.679,
    "text": "And yet there is this line where it's like, you can kind of falsely push the known knowns beyond where they really are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.699,
    "end": 3907.739,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.899,
    "end": 3921.542,
    "text": " And it seems like one example of that is going down and specifying the actual mechanistic basis of a given computational function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.022,
    "end": 3927.364,
    "text": "And if that's important to specify, then the work itself is to specify it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.344,
    "end": 3939.187,
    "text": "However, at the framework level, the framework's absence of that kind of a material substrate, like that's the feature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.165,
    "end": 3943.206,
    "text": " That's not a lacuna in the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.267,
    "end": 3950.33,
    "text": "That is like, there's the USB stick and then there's where you can plug it in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.63,
    "end": 3952.891,
    "text": "That is the plugin to any system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.611,
    "end": 3966.617,
    "text": "And if there was something already pre-plugged in there, like, well, it has to happen on Turing computer or it can't happen on Turing computer, that would have just hobbled the scope of applicability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.289,
    "end": 3996.597,
    "text": " by welding together what doesn't need to be welded and i mean if anything this is a um journey and a a challenge about proper articulation and about how sparsity and nuancing which are connected to what brings us cognitive phenomena so it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.328,
    "end": 4025.164,
    "text": " many things to learn and reflect on yeah and if i may add a related remark um about the the question of having a top-down approach as opposed to bottom-up approach i think sociologically speaking and historically speaking it's very interesting that the people who started",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.891,
    "end": 4051.776,
    "text": " developing bayesian mechanics are people who are not like supposed to be professional physicists because i think when you it comes to like super emergent kind of phenomena like cognition whatever um the the the people who was training is precisely to learn",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.83,
    "end": 4061.125,
    "text": " uh about cognition about agencies the people who kind of know everything about what it takes to be an agent and so on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.402,
    "end": 4085.991,
    "text": " these guys are neuroscientists basically so they because they know what agency entails they can be the good ones to propose an actual bayesian mechanics which is a very uh top-down approach whereas if you go to the labs in like a physics of complex systems lab and stuff like that people are pretty much",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.171,
    "end": 4111.603,
    "text": " uh bottom up they will uh for instance oh i i want to study the brain so i'm going to write down the upfield model for instance so a kind of icing model where up is an activated neurons and down a non not activated neurons and so i will have this very this very much uh bottom-up approach and i can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.449,
    "end": 4139.5,
    "text": " which is super interesting and super important but when it comes to this very much uh emergent behavior uh this is a very emergent phenomena of the brain metacognition blah blah blah i can study for like five centuries the opfield model i will never get any insight about the emergent behavior of the brain and um and um so i think here's the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.28,
    "end": 4145.002,
    "text": " you have to have a top-down approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4145.042,
    "end": 4148.804,
    "text": "You have to write a very generic Langevin equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4149.324,
    "end": 4161.111,
    "text": "And because you're a neuroscientist and because you know what it takes to do an inference, to be an inference machine, you're like, ah, conditional independence is very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4161.371,
    "end": 4162.592,
    "text": "It's a very important theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.952,
    "end": 4168.315,
    "text": "So let's try to inject in my Langevin equation some level of sparse coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4168.735,
    "end": 4170.576,
    "text": "And then, boom, you have the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4171.275,
    "end": 4196.041,
    "text": " so even though sociologically speaking what's happening here might be super weird like these guys are not supposed originally at least to be physicists and they are supposed to like kind of generated the next chapter of physics how weird is that but in fact in fact i think there were precisely the good people to do that um so yeah it's it's quite interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.014,
    "end": 4198.657,
    "text": " I think there might be, oh, that's a great point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.098,
    "end": 4208.777,
    "text": "There might be a fun history with physician, physician heal thyself, and the alliance of medicine and physic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.79,
    "end": 4210.431,
    "text": " That's one point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.491,
    "end": 4212.612,
    "text": "Another point is low road and high road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.273,
    "end": 4218.137,
    "text": "And sometimes the disciplinary or the in-group conversation is like very low road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.697,
    "end": 4223.681,
    "text": "And then the idealistic and aspirational is like high road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4223.701,
    "end": 4229.225,
    "text": "It doesn't exactly map to those, but I'm thinking of like somebody says like, I want to drive somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4229.245,
    "end": 4230.326,
    "text": "I want to travel somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.887,
    "end": 4233.068,
    "text": "There is no material basis for that travel yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4233.769,
    "end": 4235.61,
    "text": " They're not there, there's no path, there's no car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.63,
    "end": 4255.363,
    "text": "And then in the mechanic shop, it's like, well, we have this tool, this object, we're so surrounded by the low road that it supports this incremental research agenda using the tools and approaches that we have and their materiality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.903,
    "end": 4257.984,
    "text": "Whereas someone from outside the field",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.095,
    "end": 4265.017,
    "text": " like comes to the ant researcher, it's like, have you had the ants build this new thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.037,
    "end": 4277.261,
    "text": "And it's like, well, we weren't even on that path, but now that's like a new North Star and that can now draw work in that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.281,
    "end": 4287.444,
    "text": "And so it's kind of like the low road building out and then like the kind of the draw of the adjacent possible and the imagination that the high road kind of grounds in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4288.82,
    "end": 4290.702,
    "text": " All right, I'll ask a question from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.523,
    "end": 4296.97,
    "text": "Susan asks, what can one equation contain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4298.071,
    "end": 4305.36,
    "text": "I'm imagining how to interpret and translate self-modeling, how to approach foraging resources and opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4309.176,
    "end": 4310.417,
    "text": " Can you repeat, please?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4310.737,
    "end": 4311.017,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4311.758,
    "end": 4315.5,
    "text": "It's an open-ended question, so feel free to, however you like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.96,
    "end": 4317.601,
    "text": "What can one equation contain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.221,
    "end": 4324.264,
    "text": "I'm imagining how to interpret and translate self-modeling, how to approach foraging resources and opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.066,
    "end": 4336.411,
    "text": "So I could not answer the second part of the question, but if I can pick up on about the question of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4338.957,
    "end": 4362.184,
    "text": " what what these equations are all about which is a bit what you asked last week like what works the do does the framework do what these equations contain or whatever um if you actually simulate a sparsely coupled random dynamic system and actually there are there already are examples out there for instance in the 2021 paper called um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.165,
    "end": 4392.171,
    "text": " uh uh uh stochastic chaos and markov blankets if i remember well with uh thomas paul and carl friston and others they simulate a coupled uh low-range um uh systems uh if i if i remember well and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.445,
    "end": 4411.157,
    "text": " if you do simulate such systems which verifies such fast coupling architecture you observe the behavior which is described by your equations and if for instance you remove fluctuations on particular states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.6,
    "end": 4434.211,
    "text": " so uh well your simulation which follows the path of this action which is given by your equation so it's it's um it's it's uh it does really work in the sense that it does describe indeed something it's really a physics in fact of such uh sparse couple systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4436.055,
    "end": 4458.628,
    "text": " great question i think we could explore more on what an equation can contain but i'm just kind of struck by that there's like a latent large set of um to be clarified axioms and conclusions and so on and when we see like one equation written here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.037,
    "end": 4479.763,
    "text": " it's kind of like we're just seeing like one glimpse or one facet it's not like the other equations aren't in effect but sometimes it's a little unclear which equations are relevant but in an equation we see a symbolic expression",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.121,
    "end": 4504.651,
    "text": " that within a given quantum reference frame otherwise the q and the a wouldn't mean anything like within a semantic reference frame the equation is just kind of like a check it's like if it's like it it's there's probably many ways that we can kind of explore what it does but it's true that i mean i think many people who",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4506.172,
    "end": 4532.962,
    "text": " in addition don't necessarily have a mathematical background or whatever they have been i mean i'm not an expert in the history of the free energy principle but a lot of people have been confused especially in the early steps where it was as lens say it many times worried when it was even more nutrition than a solid framework properly grounded in solid math so people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4534.344,
    "end": 4563.935,
    "text": " did get a bit confused i think by with the math but now it's we have more and more worked examples simulations um solid math etc so it's it's quite um quite nice okay in closing we have explain it like i'm a 10 year old now that that response may reveal more about what somebody thinks 10 year olds are like but now that we've been on this two-part journey",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.353,
    "end": 4568.874,
    "text": " you know, dot zip it and close it, Richard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.594,
    "end": 4575.295,
    "text": "So explaining you mean about what I just said, like before?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4577.456,
    "end": 4580.376,
    "text": "Just both sections or just our whole projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.337,
    "end": 4592.319,
    "text": "Now that now that we can look back at all the incredible quality summaries that we've provided, how do we just cap it and move forward with a child?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.419,
    "end": 4592.579,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4594.625,
    "end": 4615.918,
    "text": " i think everything we did here so both in this presentation and the previous one is um so basically we can so if i i i would so in order to say in the most um intuitive and simple ways i would say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4617.745,
    "end": 4620.594,
    "text": " Very simply put, a system is just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4627.326,
    "end": 4629.688,
    "text": " It's just some things interacting, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.028,
    "end": 4635.251,
    "text": "So it would literally correspond to a system as we use this word in a daily basis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4635.671,
    "end": 4647.779,
    "text": "A pen is a system, an organism, or any piece of, any collection of things interacting with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4648.739,
    "end": 4650.4,
    "text": "I can say this is a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4650.74,
    "end": 4653.042,
    "text": "I just have to precisely delimitate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.075,
    "end": 4670.888,
    "text": " uh and and say what are the boundary of my system and given a system which has a certain dynamics certain laws physical laws telling you how your system behave are the things move around and so on and now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.196,
    "end": 4699.584,
    "text": " so my system can be alone like an asteroid in space let's say or it can be connected to each to other things i recognize as other systems two things can collide two different things systems can collide with each other etc for instance and now if i assume several systems which are connected meaning that they causally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.564,
    "end": 4723.594,
    "text": " interact with each other in a certain sparsely way so basically in my schematic you would have for instance a system on the right a system on the left and a sub system in the middle so you have many subsystems causally interacting in a sparsely way for instance mu doesn't interact with eta",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4724.568,
    "end": 4731.852,
    "text": " If I take a bacteria, for instance, it does move around and interact with other things outside the bacteria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.012,
    "end": 4741.877,
    "text": "But at the same time, within the bacteria, under the outer membrane, there is also stuff which do not interact because they interact with the outside, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.937,
    "end": 4750.701,
    "text": "And so if you have such sparse coupling architecture, as we say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.997,
    "end": 4766.846,
    "text": " And in more technical terms, we would say that the inside is independent of the outside when conditioned on the intermediate system, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4767.927,
    "end": 4779.996,
    "text": "So if we have such sparsely coupled systems, dynamical system, we see, mathematically speaking, we derive the fact that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4781.284,
    "end": 4799.817,
    "text": " your system has to behave in a certain way and in fact when you do have such sparse couple dynamical system you realize that everything uh appears to uh i mean if you look at for instance the internal states mu here the dynamics of this system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.657,
    "end": 4825.689,
    "text": " uh can be interpreted in terms of bayesian inference meaning that this system can be viewed as encoding a density over its external states for instance and if i had to define in a very simple way what it means to parameterize or to encode a distribution i would say that um your um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4829.79,
    "end": 4858.198,
    "text": " the various parameters which define your system for instance i said earlier that a system could be anything a pen an asteroid whatever there are variables which specify its state for instance temperature pressure shape whatever i have a set of variables and i can view these variables these numbers literally as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.187,
    "end": 4868.833,
    "text": " I can take them and manipulate them as parameters of a mathematical quantity I can deal with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4871.214,
    "end": 4879.38,
    "text": "So I'm not sure if I failed in trying to put it in very simple terms, but I hope it makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.381,
    "end": 4883.022,
    "text": "It was awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.102,
    "end": 4884.182,
    "text": "Richard, thank you for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4886.656,
    "end": 4915.28,
    "text": " working to bring us these twin gems in the distillation work and really helping like consolidate and sediment on one hand a long history of dynamical systems and physics and on the other hand papers coming out two weeks ago as well so hopefully we'll continue the adventures and um see you around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.673,
    "end": 4920.519,
    "text": " Yeah, thank you, and thank you for the chat, the questions on the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4921.3,
    "end": 4921.561,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.262,
    "end": 4922.803,
    "text": "Peace, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4922.843,
    "end": 4923.063,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4924.425,
    "end": 4924.606,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4924.946,
    "end": 4925.207,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]