[
  {
    "start": 6.19,
    "end": 7.031,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.492,
    "end": 20.675,
    "text": "This is Active Inference guest stream number 86.1, Biological Neurons Compete with Deep Reinforcement Learning in Sample Efficiency in a Simulated Game World with Farouk Habibullahi and Moeen Khashnazad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.316,
    "end": 23.24,
    "text": "And thank you both for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.761,
    "end": 27.427,
    "text": "Really looking forward to the presentation and take it from here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.749,
    "end": 29.751,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 30.305,
    "end": 32.207,
    "text": " Yeah, thanks, Danielle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 32.487,
    "end": 34.969,
    "text": "I guess I'll just open up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.989,
    "end": 35.67,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.77,
    "end": 36.63,
    "text": "Thanks for joining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 36.79,
    "end": 40.033,
    "text": "I hope this will be interesting and fun for everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 41.054,
    "end": 50.002,
    "text": "So today we are going to talk about a collaboration between Cortical Labs here in Melbourne and Monash University.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 50.022,
    "end": 59.89,
    "text": "We will mostly emphasize on the details of the project as titled Biological Neurons Compete with Deep Reinforcement Learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 60.325,
    "end": 86.198,
    "text": " in sample efficiency in a simulated game world but before going into details of the findings that we had in this study i'm just gonna talk briefly to our setup our system of in vitro neuronal cultures that we are interacting with and we are embedding them in simulated game environments to be able to do all these cool tests and uh well which has led us to these findings",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 86.92,
    "end": 105.655,
    "text": " so to start with um i'm gonna just tell you uh what were our motivations in cortical labs and what led us to where we are here today uh without getting too philosophical though uh we can say that we as humans need",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 122.476,
    "end": 127.592,
    "text": " they froze i'll just wait",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.671,
    "end": 173.695,
    "text": " their own shortfalls, if you would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.715,
    "end": 182.306,
    "text": "For example... Yeah?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 182.326,
    "end": 184.189,
    "text": "Oh, yeah, sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 184.209,
    "end": 185.29,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 185.31,
    "end": 189.316,
    "text": "So... Re-share.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 189.336,
    "end": 190.517,
    "text": "So it stopped sharing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 193.161,
    "end": 194.222,
    "text": "Oh, no, no, that's okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 195.344,
    "end": 197.006,
    "text": "So it stopped sharing, maybe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.827,
    "end": 197.927,
    "text": "Yeah."
  },
  {
    "start": 235.218,
    "end": 260.837,
    "text": " so yeah without getting too philosophical here uh we can say that us as humans we need intelligence in some form to be able to distill meaning from the phenomena around us but to be able to make more intelligent decisions by computing more data faster and with better outcomes has actually become one of the major goals and the holy grounds of machine learning and ai in the past decades",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.201,
    "end": 279.14,
    "text": " Now, in search for different ways of intelligent computing, one way for us to categorize all of our recent efforts could be to talk about these categories, like machine learning and AI, quantum computing or neuromorphic chips.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.36,
    "end": 289.812,
    "text": "Obviously, there are other ways of looking at these and other tools that we've developed, and they are all the right tools for the right purposes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.18,
    "end": 313.707,
    "text": " They could all also have their own pros and cons, and what motivated us to look for new alternative ways of computing was that, for example, in machine learning and AI, we are facing challenges such as their high computational power, high power use, their catastrophic forgetfulness, or the fact that they require very large samples and very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.99,
    "end": 318.529,
    "text": " long training times and they were also very susceptible to errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 319.031,
    "end": 322.245,
    "text": "Or if you're talking about quantum computing,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 322.512,
    "end": 325.296,
    "text": " Again, we have extremely high power usage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 326.417,
    "end": 333.426,
    "text": "These are very isolated from the external world and very prone to errors, and they are not very adaptable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 334.407,
    "end": 345.381,
    "text": "And also, if you're looking at neuromorphic computing and the whole field around it, there's also limited error correction capabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 345.361,
    "end": 354.852,
    "text": " variability between circuits and also they still require some sort of programming to some capacity to be able to do what we are designing them to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 356.674,
    "end": 372.853,
    "text": "So basically in search for this alternative intelligent computing system that could actually solve some of these challenges that we have in these other categories, we thought that why not use the brain and the brain cells themselves",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.424,
    "end": 377.809,
    "text": " which are the most advanced intelligent systems that we know of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 378.21,
    "end": 385.999,
    "text": "And there's actually no need to prove that these brain cells are capable of doing very high order of computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 389.444,
    "end": 396.692,
    "text": "So I'm not going to go into too many details of our setup because I think many of you might have heard or read about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 396.833,
    "end": 401.338,
    "text": "But just to recap, firstly, what we do in cortical labs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 401.622,
    "end": 410.985,
    "text": " to basically design and develop our system is that we use human iPSC cells, which are then differentiated to a neuronal phenotype.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.647,
    "end": 418.905,
    "text": "For the studies that we're going to talk to you about today, we also had primary cortical neuronal cell cultures from mice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 419.037,
    "end": 441.99,
    "text": " and all of these cell cultures were then plated onto max one high density multi-electrode arrays which basically enables us to stimulate the neurons and also record from them at the same time from the same cultures and well we saw and we showed that these cultures could actually survive for even",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.139,
    "end": 445.462,
    "text": " more than six months on these multi-electrode arrays.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 446.403,
    "end": 457.154,
    "text": "With our new products, new systems in this brand, we can go even way beyond six months and keep them healthy, keep them alive, keep them active, which gives us the capability of studying them for longer terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.835,
    "end": 470.728,
    "text": "And for example, here is just a sample microscopy imaging, but you can see the dense interconnected population of these neurons that have been cultured and are active on the multi-electrode array.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 472.463,
    "end": 488.381,
    "text": " So then we designed what we called initially Dishbrain, which is this closed-loop real-time system to interact with these neuronal cultures and embed them in the environments of the arcade game of Pong, which you can see here on the right-hand side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 489.683,
    "end": 491.886,
    "text": "This is a famous arcade game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 492.066,
    "end": 498.353,
    "text": "You have one paddle and basically the paddle is playing against the wall, trying to hit the ball accurately.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 498.907,
    "end": 508.802,
    "text": " And the first published work that we explained the system and we showed, you know, basically all our findings of the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.264,
    "end": 528.711,
    "text": "I think you've seen it and you've talked about it before, but it basically explores the system in extensive detail, which I will not bore you with here with all of those details, but because it's important to know what's this closed-loop system that we're dealing with, I'm just gonna briefly talk you through,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.792,
    "end": 531.496,
    "text": " how it works and how it's designed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 531.937,
    "end": 551.745,
    "text": "Basically on each culture, which is integrated onto a multi-electrode array, we first predefined separate regions, one sensory region on top and two model regions on the bottom of this cartoon image that you can see on the left-hand side and the right-hand side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.333,
    "end": 561.194,
    "text": " First, using the sensory region, we feed information about these hypothetical balls, x and y-axis locations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 561.254,
    "end": 566.106,
    "text": "So imagine that game environment, you have the ball moving, you want to know where it is in that frame.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 566.66,
    "end": 587.773,
    "text": " so the x-axis location is actually uh encoded by rate coding between 4 and 40 hertz depending on how close the ball is to the paddle on the x-axis and also we use place coding where where we encode where the ball is on the y-axis",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 588.108,
    "end": 594.537,
    "text": " by only simulating one of the eight available sensory electrodes within the sensory region.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 594.697,
    "end": 598.803,
    "text": "And these eight electrodes are actually evenly distributed along the y-axis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.423,
    "end": 606.593,
    "text": "So whichever part or segment the ball falls into, that sensory electrode is activated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 607.555,
    "end": 611.5,
    "text": "Then we record from these two, again, predefined motor regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 611.767,
    "end": 625.028,
    "text": " and compare their activities of all the channels in those regions, which are some of them are representative of the up movement, as you can see the arrows on this figure, and some of them are responsible for downward movement of the paddle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.53,
    "end": 635.344,
    "text": "And then obviously comparing the activities of these two sub regions, we decide where the culture is moving the paddle in what direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 635.898,
    "end": 642.025,
    "text": " And then we need to close the loop by applying feedback to the same sensory region as we defined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.725,
    "end": 662.327,
    "text": "Again, this is another schematic, maybe to make things a bit more clear, but basically to explain our feedback loop, what happens is that if the ball is missed by the paddle, random unpredictable signal is applied for like four seconds at random sites in the sensory region.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 662.847,
    "end": 672.423,
    "text": " And then if the ball is hit accurately, a predictable repeated stimulation for a shorter amount of time is applied to all of the sensory electrodes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.584,
    "end": 686.506,
    "text": "So we then again record from these cells on top of these silicon chips, both during their rest state spontaneous activity for comparison reasons and during their embodiment in their gameplay environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.086,
    "end": 688.669,
    "text": "And I'm just going to briefly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 689.054,
    "end": 711.537,
    "text": " touch upon something you might all have been thinking of now that I have explained our feedback loop here that after designing the system and finding actual evidence that this particular type of feedback loop is actually enabling the neurons to be learning the game or to be performing the game better as we go on in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 713.058,
    "end": 717.863,
    "text": "You could think of this clearly as some evidence supporting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 718.214,
    "end": 738.902,
    "text": " the free energy principle that we've been talking about for a long time now, the fact that these neurons don't like surprise, don't like the unpredictable sensory feedback that they receive when they miss the ball is what seems to be driving them towards playing the game better and towards performing better in the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.823,
    "end": 747.293,
    "text": "So this was really cool evidence that we found that could be actually explained by FPP as we all know about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.931,
    "end": 760.185,
    "text": " We could definitely talk more in detail about this, but I'm just going to go to our basically newest findings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 760.745,
    "end": 766.692,
    "text": "This is again a quick illustration of the actual gameplay environments on one of our MEAs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 766.832,
    "end": 769.275,
    "text": "This is obviously the simulated environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 769.675,
    "end": 776.723,
    "text": "You can see the gameplay in the corner top right and how all the channels that we have on the MEA",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 777.884,
    "end": 789.64,
    "text": " have these activities that we're recording from, and then we are comparing the two sides of the motor region to actually decide what the culture is doing in this gameplay environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.665,
    "end": 799.274,
    "text": "Yeah, and then we evaluated their performance and whether these are learning using several metrics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.574,
    "end": 801.597,
    "text": "This is a very, very short summary,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.897,
    "end": 825.812,
    "text": " uh of how the mice cells and human cell cultures which we call mcc and hcc compared to our media only controls to our in silico models and to our neurons at rest and they all show that they perform much better with more significant improvements in several metrics including their average rally legs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.383,
    "end": 831.828,
    "text": " the percentage of aces or ace here is actually a bad thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.888,
    "end": 834.831,
    "text": "So ace means a ball is missed after the initial serve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 834.851,
    "end": 838.635,
    "text": "So the lower the number of aces gets, the better they're performing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.655,
    "end": 846.183,
    "text": "And also they showed a significant improvement in the percentage of long rallies, which we defined as rallies that have more than three accurate hits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 847.684,
    "end": 855.732,
    "text": "Again, we've got much more nuanced results and details that we have figured out from these systems,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.336,
    "end": 864.987,
    "text": " Here you can see the comparison between the first five minutes in green and the second 15 minutes of each gameplay session in orange.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.607,
    "end": 872.276,
    "text": "And you can see that's basically the only significant improvement occurred in our human and mice cortical sets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 874.639,
    "end": 881.567,
    "text": "Now, in our obviously never-ending search for the underlying mechanisms that could drive this behavior,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 881.918,
    "end": 890.932,
    "text": " In one of our more recent projects, we first wanted to compare the gameplay and rest sessions in terms of their connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.952,
    "end": 907.437,
    "text": "So the connectivity between the different channels that we are recording from and how actually these connectivities are changing over time and whether the evolution in these connectivities can capture parts of this learning or this basically the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.771,
    "end": 911.657,
    "text": " plasticity we assume that is happening during gameplay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.898,
    "end": 926.521,
    "text": "And Moin is going to take on from here, talk about our findings from this functional connectivity study, and then we're going to spend most of the time on the comparison with the reinforcement learning methods that we did in terms of their sample efficiency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.384,
    "end": 928.865,
    "text": "OK, great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 930.167,
    "end": 932.31,
    "text": "Hi, everyone, again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 933.05,
    "end": 948.393,
    "text": " Now to do this task that we've mentioned, first the challenge was that for every recording and for each channel we have a very very large time series of spiking activity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 948.413,
    "end": 962.854,
    "text": "So to make these sparse spiking patterns more interactable and easier to work with, first we decided to use a dimensionality reduction algorithm to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 963.475,
    "end": 967.4,
    "text": " bring each channel time series to a lower dimensional space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 968.521,
    "end": 976.911,
    "text": "We use and compared different algorithms, including TISNI and isomap that you see here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 977.011,
    "end": 992.689,
    "text": "And as we can observe, interestingly, even in a very low dimensional space, such as a 2D space here, the first and second half of the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 993.513,
    "end": 1001.123,
    "text": " of each recordings were easily distinguished during gameplay, but not clearly in the rest.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1002.505,
    "end": 1011.436,
    "text": "These figures are four sample cultures, and the two colors represent all the channels in each half of the recording.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1013.499,
    "end": 1022.811,
    "text": "So we were motivated to continue this study in this lower dimension for higher interpretability and lower computational power use.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1025.913,
    "end": 1034.624,
    "text": " But then also having 1024 recorded channels still meant high computational complexity in our problem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1035.625,
    "end": 1050.283,
    "text": "So we have this hypothesis that most probably a lot of these channels are highly correlated and we might be facing redundancy of information when looking at all the available channels in the recording.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1052.474,
    "end": 1062.973,
    "text": " So for that reason, we designed this pipeline to eventually study the functional connectivity of channels and compare between gameplay and rest.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1064.296,
    "end": 1074.735,
    "text": "Very briefly, we first used T-SNE algorithm to map all channels' recordings to the lower dimensions, which is selected to be three here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1075.795,
    "end": 1097.618,
    "text": " And then to select a smaller set of channels, which are good representatives among all the recordings, we stacked up the low dimensional representations of all gameplay sessions and using attacker decomposition, followed by K-Metroid clustering algorithm,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1098.02,
    "end": 1107.352,
    "text": " We chose the centroids of the channel clusters in this low dimensional space as the mutual representative channels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1109.355,
    "end": 1123.673,
    "text": "We tried different numbers of clusters and got the best results by choosing 30 clusters and higher numbers of clusters show no significant improvement in the results.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1124.918,
    "end": 1145.999,
    "text": " Finally, we built functional connectivity networks using these 30 channels as nodes and the Pearson correlation of their spiking activities as the weight of the edges between each pair of channels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1146.019,
    "end": 1153.727,
    "text": "But we were also interested in tracking the connectivity dynamics and changes in time",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1154.281,
    "end": 1156.405,
    "text": " as learning occurred in the culture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1158.289,
    "end": 1166.987,
    "text": "So what we looked at here was the changes in correlation between pairs of notes from the first two minutes to the last two minutes of the recordings.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1168.69,
    "end": 1175.344,
    "text": "And what we see here on the left,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1176.117,
    "end": 1185.112,
    "text": " And right are the average networks from all of our recordings, which is around 300 gameplay sessions and about 150 rest sessions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1186.595,
    "end": 1200.859,
    "text": "First of all, the extracted representative channels, which come from the sensor regions, are in green circles, and the ones from motor regions are in blue squares.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1201.497,
    "end": 1214.599,
    "text": " Now, the color of the edges indicates an increasing or decreasing correlation between nodes in red and black, respectively, and the edge thicknesses are related to the magnitude of these differences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1216.883,
    "end": 1220.569,
    "text": "Simply by visualizing the data,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1221.241,
    "end": 1233.546,
    "text": " we saw significant differences between rest and gameplay where we observe many more positive edges or increase in correlation between channels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1235.922,
    "end": 1244.394,
    "text": " And finally, to give you some more statistics of what we found happens as the network of channels evolves in time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1245.836,
    "end": 1263.482,
    "text": "Here we can see the same five measures of network dynamics compared between the first and last two minutes in pink and green and also gameplay on top versus",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1264.492,
    "end": 1267.095,
    "text": " rest session.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1268.176,
    "end": 1272.32,
    "text": "The gameplays are in pink and the rest are in green.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1273.722,
    "end": 1282.791,
    "text": "First, we have the average weight of the functional connectivity networks, which shows a significant increase during gameplay, but not at rest.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1284.113,
    "end": 1289.979,
    "text": "Next, the modularity index that decreases significantly, but only at gameplay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1290.6,
    "end": 1292.001,
    "text": "That basically means that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1292.335,
    "end": 1299.944,
    "text": " the different clusters or modules of the network become more interconnected during the gameplay as time goes on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1302.087,
    "end": 1316.824,
    "text": "The clustering coefficient also shows a significant increase only in gameplay, meaning that the neighbors of a given node have become more strongly connected between themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1318.036,
    "end": 1330.888,
    "text": " And finally, characteristic path lengths or the average shortest path between any pair of nodes in the network decreases significantly after 18 minutes or gameplay recording.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1335.793,
    "end": 1346.963,
    "text": "Now that we have found even more evidence of the dynamics of these networks, which could potentially give rise to the emergent learning that is observed in their behavior, in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1347.415,
    "end": 1364.952,
    "text": " Then in another study, a Nexus study, we were also interested to do a direct comparison between the deep reinforcement learning algorithms and our normal cultures in the same game environment of Pong, but clearly only during the gameplay sessions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1366.687,
    "end": 1386.265,
    "text": " We all know that RL algorithms that use deep neural networks in their structures have been developed to beat human experts in various games such as Atari games and have proven to be very strong players of these games given they have enough training.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1386.852,
    "end": 1402.971,
    "text": " But these algorithms suffer from different issues, such as modeling the rebar structure, sample inefficiency, reproducibility, as well as requiring high levels of computing power.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1403.221,
    "end": 1417.607,
    "text": " And these issues suggest that deep RL algorithms might actually differ fundamentally from human learning mechanisms and not be efficient to be a plausible model for human learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1418.448,
    "end": 1422.816,
    "text": "That's why we were motivated and interested to do this research and comparison.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1424.939,
    "end": 1442.608,
    "text": " In our work, we use three deep RL algorithms, DQN, A2C, and PPO, which are established to have good performance in Atari games and are robust tools in reinforcement tasks, particularly in games where the input is an image.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1444.912,
    "end": 1447.656,
    "text": "But apart from the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1448.176,
    "end": 1468.638,
    "text": " traditional gray scale image input of the game environment, we also take a step further aiming to account for potential adversaries resulting from the increased dimensionality of the image input to the deep RL algorithms or so-called Kerasov dimensionality in machine learning terminology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1469.759,
    "end": 1473.643,
    "text": "We designed two additional types of input information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1474.433,
    "end": 1489.472,
    "text": " first paddle and ball position design where we obtain a four-dimensional vector encoding the x and y coordinates of the ball and also the y coordinates of the paddles top and bottom",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1491.275,
    "end": 1512.456,
    "text": " And also the ball position design where we divide the y-axis of the gameplay environment to eight equal segments, each mimicking one of the sensory electrodes in the biological cultures that place code the information about the ball's y-axis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1513.432,
    "end": 1531.65,
    "text": " Then the ball's x-axis position is used as the second element of this input vector, similar to the rate-coded component of the stimulation applied to the biological cultures that we had.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1532.871,
    "end": 1539.658,
    "text": "This design is the most similar one to the cultures with the lowest dimension of the input vectors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1543.638,
    "end": 1573.24,
    "text": " Also, we found that using the same number of training game episodes for biological neural networks and deep reinforcement learning algorithms in the image input design, the average Raleigh lens is highest for the human and mice cell cultures here in orange and blue, while they also achieve the lowest percentage of ACEs",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1574.114,
    "end": 1576.739,
    "text": " and highest percentage of lung rallies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1578.081,
    "end": 1594.03,
    "text": "May I just add here that maybe if it's not being clear, we are training all of these for the same number of episodes that the biological neuronal networks had to be trained on, which was on average 70.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.499,
    "end": 1622.194,
    "text": " game episodes in 20 minutes so just to make things as fair as possible we train these RL algorithms also only for 70 episodes and that's why we're talking about sample efficiency here because we're going to show you and we know that training them for a very longer longer time would result different obviously performances in these different algorithms yeah right thanks",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1623.743,
    "end": 1640.976,
    "text": " Then comparing the first five minutes to the last 15 minutes of the game here in the third row in green and orange, we see that only the biological cultures show significant improvement in these metrics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1643.909,
    "end": 1673.427,
    "text": " next we repeated all the analyses for the paddle and ball position input design which revealed the fact that oil algorithms performances were not suffering from the curse of dimensionality and all the previous conclusions still hold and finally very similar comparisons were observed when using the last input design which was the most similar to the biological cultures input information structure",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1673.845,
    "end": 1683.816,
    "text": " Once again, the RL algorithms are outperformed or rarely match the polyurgical culture's performance at their best.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1687.381,
    "end": 1697.372,
    "text": "And lastly, we directly compared the relative improvement in the average value lengths of different groups over time, and these plots show that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1698.854,
    "end": 1711.751,
    "text": " In all the three designs, human cell cultures show the highest improvement, usually followed by the mouse cell cultures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1711.771,
    "end": 1724.288,
    "text": "We also compared the relative improvement in the average bit counts or average rallies between the first five minutes and the last 15 minutes for all the sessions, as well as the post-hoc tests.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1724.757,
    "end": 1732.126,
    "text": " in each separate group for different batch sizes and different hyperparameters, as we can see in the first two rows.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1733.327,
    "end": 1746.023,
    "text": "And additionally, as Prue mentioned, we'll look at the mean total reward of the RL algorithms with only the image input design using the same hyperparameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1746.779,
    "end": 1771.774,
    "text": " uh for an extended training period of uh 11 000 uh game episodes in the last uh or third row here and it showed improved performance across an extended number of training episodes this is while as it anticipated 70 game episodes or 20 minutes of reporting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1771.872,
    "end": 1779.12,
    "text": " which is the same number used to train the biological cultures, but not sufficient for any of the algorithms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1782.304,
    "end": 1796.26,
    "text": "So we could eventually conclude that the RL algorithms showed the lowest sample efficiency, having the lowest improvement in learning given the same number of training episodes provided for all the groups.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1796.999,
    "end": 1804.651,
    "text": " And this was even despite the fact that these methods receive a higher information density compared to cultures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1807.636,
    "end": 1818.012,
    "text": "Finally, we also explored a biologically inspired algorithm implementing an active inference agent that uses counterfactual learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1818.768,
    "end": 1846.227,
    "text": " um improved learning rates observed in this biologically inspired learning protocol supports the potential of active inference agents to provide valuable insights into optimized learning strategies so and they can enhance our understanding of these dynamics however these active inference algorithms are um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1846.645,
    "end": 1856.478,
    "text": " still highly dependent on the chosen hyperparameters and require relatively higher power consumption compared to biological systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1857.659,
    "end": 1871.117,
    "text": "However, these results highlight the value of further exploring biologically inspired systems of learning and support the notion that synthetic biological intelligence systems",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1871.823,
    "end": 1877.331,
    "text": " may offer a useful pathway to do this in the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1879.313,
    "end": 1895.836,
    "text": "So, yeah, I think I stop here and let us thank all of our internal and external collaborators, both in Monash University and Cortical Labs and in other institutes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1897.518,
    "end": 1897.999,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1900.662,
    "end": 1904.366,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1905.508,
    "end": 1905.868,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.21,
    "end": 1909.212,
    "text": "Okay, many places to jump in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.252,
    "end": 1912.095,
    "text": "Well, thank you for sharing the results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.916,
    "end": 1926.332,
    "text": "Maybe just while we're on this slide with the active inference, how was this agent constructed and how or was it the case that the neurons consider counterfactuals",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.223,
    "end": 1930.59,
    "text": " or how did the counterfactual come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.283,
    "end": 1943.456,
    "text": "So here, maybe this is actually a bit bad naming with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.476,
    "end": 1944.658,
    "text": "So CL here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1944.942,
    "end": 1947.228,
    "text": " is actually our counterfactual learning agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1947.248,
    "end": 1955.248,
    "text": "And the number you can see in front of it is its horizon, which is one of the parameters we've adjusted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1955.288,
    "end": 1961.584,
    "text": "Then for our search space, we have tried to mimic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1961.902,
    "end": 1963.145,
    "text": " as much as we could.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1964.027,
    "end": 1971.562,
    "text": "I should mention also here that Ashwin, Ashwin Paul was the person who has helped us with this analysis, worth mentioning again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1972.144,
    "end": 1977.495,
    "text": "So for the search space, we try to mimic what we have in the biological cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1977.715,
    "end": 1979.86,
    "text": "So the X axis",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1980.194,
    "end": 1997.41,
    "text": " which location of the ball which we encode using the frequency values between 4 and 40 hertz in our dish brain uh were mapped into basically a space of 37 that would be 37 different values along x-axis",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1997.39,
    "end": 2003.32,
    "text": " and our y-axis eight different values, which could be given as inputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2004.783,
    "end": 2008.89,
    "text": "So this would be our search space or environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2009.972,
    "end": 2016.563,
    "text": "And yeah, so we explored different values of the memory horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2016.643,
    "end": 2021.592,
    "text": "We could obviously go even further, but we were trying to find a model that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2021.96,
    "end": 2037.58,
    "text": " kind of matches the biological cultures the best, because as you all know, we are thinking of active inference as a plausible and possible model of what is actually happening in our brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2038.221,
    "end": 2047.753,
    "text": "So we wanted to see if we can actually reconstruct a model that is very close to the performance of these cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.133,
    "end": 2050.296,
    "text": "So the horizon memory of seven",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.715,
    "end": 2057.964,
    "text": " basically having the seven frames prior to the current step was what gave us the closest results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2059.005,
    "end": 2075.305,
    "text": "Yeah, I think, yeah, just to add, I think a recent active inference scheme is shown to be mathematically equivalent to a particular class of neural networks accompanied by some neuromodulations of synaptic plasticity",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2075.96,
    "end": 2084.893,
    "text": " It uses counterfactual learning to accumulate a measure of risk over time based on feedback from the environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2086.415,
    "end": 2096.85,
    "text": "Subsequent work that validates this scheme experimentally using in vitro neural network has also appeared recently in Isamuah et al.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2096.89,
    "end": 2099.554,
    "text": "paper in 2022.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2100.074,
    "end": 2108.545,
    "text": " So yeah, just to, I think, more clearly answer your question, this was just a counterfactual learning model on its own.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.268,
    "end": 2113.652,
    "text": "We are not using the neurons or the input from neurons in the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.692,
    "end": 2121.002,
    "text": "This is just a standalone model on its own, trying to mimic the performance of the in vitro cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2122.518,
    "end": 2149.268,
    "text": " cool like really interesting how the same kind of functional play or differing might arise from systems that are explicitly comparing alternatives and systems that at least are appearing to simulate counterfactuals yet somehow the instantaneous firing rate and the response comes to act as if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.45,
    "end": 2163.245,
    "text": " there is a counterfactual in the sense that the gradient is being compared and the gradient is more often than not going in the direction that is leading to less surprising sensory outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.047,
    "end": 2165.768,
    "text": "Exactly, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.729,
    "end": 2170.093,
    "text": "Okay, I'll ask a question from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.113,
    "end": 2177.601,
    "text": "Jeff asks, is there a noise or density limit to the matrix culture interconnect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.505,
    "end": 2184.714,
    "text": " So by matrix culture, I am assuming they mean the multi-electrode array.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2185.095,
    "end": 2185.816,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2187.379,
    "end": 2196.274,
    "text": "So for the results that we have talked about today and most of our publications up to date, we're using a maximum high density multi-electrode array.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2196.795,
    "end": 2199.821,
    "text": "And maybe we didn't state this clearly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2199.861,
    "end": 2203.487,
    "text": "We have 1024 channels that we are using for our design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2203.973,
    "end": 2227.973,
    "text": " uh there are thousands more channels but uh we are only interacting with 1024 of them so maybe our limit we could say was 1024 channels but we are designing new systems now that are actually less dense so we are using uh 64 channels in our own",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.29,
    "end": 2230.693,
    "text": " chips designed at home at Cortico Labs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.695,
    "end": 2256.188,
    "text": "This will, yes, limit us in the sense that we don't have as many channels to be working with, but also we are hoping to be able to get more interpretable results and let's see, interact more efficiently with the cultures with the 64, 8x8 matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.455,
    "end": 2259.74,
    "text": " They also asked about noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2261.803,
    "end": 2268.333,
    "text": "Yes, obviously, we are facing noise in any system, any experiment that we're doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.373,
    "end": 2272.079,
    "text": "We do have human induced noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2272.099,
    "end": 2278.429,
    "text": "We do have noise when obviously recording from these channels, but we have taken",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2278.696,
    "end": 2307.437,
    "text": " uh as many measures as we could in order to clean uh the recorded uh signals first obviously we do filtering we do spike sorting uh we have tried to do template matching with the waveforms with the spike waveforms that we extract in order to make sure we are not picking up any false positives and then after all these steps done we are facing these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2307.788,
    "end": 2334.69,
    "text": " rather sparse spiking time series for each of the recorded channels cool um another question how would you characterize why catastrophic forgetting catastrophic forgetting happens in rl and how do you feel that active inference generative models and or the embodied dish brain averts that or does it ever do forgetting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.092,
    "end": 2342.859,
    "text": " or what kind of forgetting and how does the dynamics there differ from the reasons why those phenomena happen in RL?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.52,
    "end": 2355.309,
    "text": "Yeah, this is a great question and one part of the ongoing project that we are doing now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2355.95,
    "end": 2361.555,
    "text": "Regarding this question, we are using lifelong learning or continual learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2361.835,
    "end": 2364.137,
    "text": "We are trying to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2364.826,
    "end": 2372.92,
    "text": " teach the DishBrain and train the DishBrain in different tasks, multiple tasks, instead of only one task so far on the plan game.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2372.94,
    "end": 2387.526,
    "text": "But we are planning to train the system on different tasks and see how they act in different consecutive tasks and without forgetting the previous ones.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2388.603,
    "end": 2406.308,
    "text": " um we are still doing the recordings we don't have the all the results yet but yeah as look as soon as we got the recordings we can start the analysis and see what happens so basically yeah we don't have a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2406.288,
    "end": 2410.934,
    "text": " evidence in our dish brain yet that catastrophic forgetting is not happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2411.014,
    "end": 2412.396,
    "text": "That is on our plan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2413.557,
    "end": 2424.271,
    "text": "But just in terms of comparison to RL, like why catastrophic forgetting happens in RL, do you have any insights on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2427.576,
    "end": 2428.197,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2428.217,
    "end": 2434.725,
    "text": "Maybe just one answer that I can say now is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2434.975,
    "end": 2440.103,
    "text": " Because most of the RL algorithms use backpropagation in their optimizations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2441.885,
    "end": 2457.709,
    "text": "And maybe because of, I'm not sure, but maybe because of the gradient vanishing and something like that happens in their training, we can relate that that's the catastrophe before getting to ANNs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2457.976,
    "end": 2459.678,
    "text": " because of these matters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2460.779,
    "end": 2471.433,
    "text": "Which is, again, exactly the point that is in contrast with what we have in an active inference model and the generative models that we use in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2471.673,
    "end": 2479.703,
    "text": "But when we have the multiple tasks in our framework, I think we can answer this question much better.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2479.903,
    "end": 2483.848,
    "text": "In terms of what's happening in biology and in the brain, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2485.229,
    "end": 2511.169,
    "text": " yeah just just to kind of highlight that when there's a training loss gradient in a neural network then different tasks can have performances that are at odds so even if you did epochs of training task a and task b you might end up following the gradient for task b so much that it deteriorates the performance on task a um so then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.723,
    "end": 2541.173,
    "text": " active inference angle would be well if you have a joint generative model and you're going down the free energy gradient on the performance of both at least you'd have the explicit frontier and you could explore like is there are these gradients at odds like will there be a trade-off with param tuning it one way or the other or is the architecture such that it could sustain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.288,
    "end": 2560.471,
    "text": " the both functions at once, and then that would just be how the generative model was parameterized, it wouldn't have invoked any kind of reward model, which especially as more and more tasks go into play, becomes more and more arbitrary to specify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.934,
    "end": 2569.101,
    "text": "And a huge amount of hyperparameters to be tuning, which can be again at odds with each other when",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2569.402,
    "end": 2588.98,
    "text": " we're trying training on more than one task yeah cool so about like the sense and the action cells that is spatially fixed on the chip so like how do those come to be associated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.635,
    "end": 2602.433,
    "text": " Is it just giving the sense region what and what is given to the action region such that it does self-organize into that kind of dynamic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2604.255,
    "end": 2604.656,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2604.676,
    "end": 2617.954,
    "text": "So again, the sensory and motor regions or action regions that we have were predefined during design of Dishbrain by us, by the founders of Dishbrain mostly, I would",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2618.238,
    "end": 2620.806,
    "text": " need to acknowledge here again, Han, Andy and Brett.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2621.258,
    "end": 2637.256,
    "text": " But the challenge that we were facing obviously is that we do not have any ground truth or any map or layout that the neurons give us to say, okay, yes, we are responsible of sensing, we are responsible of making an action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2638.317,
    "end": 2640.86,
    "text": "So, because these are all the same cell types.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2641.54,
    "end": 2649.409,
    "text": "So during the design of DishBrain, what we did was we did experiment trials and errors with different layouts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2649.777,
    "end": 2652.981,
    "text": " pre-defining different regions having different roles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2653.761,
    "end": 2661.07,
    "text": "And this is the design we came to just because of the fact that it showed better performance in the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2662.291,
    "end": 2668.158,
    "text": "The sensory region is the region that is receiving all the sensory input and feedback and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2668.178,
    "end": 2671.441,
    "text": "There is no input fed to the motor regions or the action regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2671.501,
    "end": 2673.844,
    "text": "They are only being recorded from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2674.094,
    "end": 2686.072,
    "text": " And this is actually what we are searching for to be able to come closer to an answer of how these are self-organizing themselves to be acting the way they are acting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2686.132,
    "end": 2695.405,
    "text": "One way of looking at it was looking at the functional connectivity networks, which we very briefly talked to you about here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2695.505,
    "end": 2703.477,
    "text": "But in another project that is ongoing here, we've actually implemented a framework",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.794,
    "end": 2724.081,
    "text": " which actually showed us that looking at different game episodes when the cultures are doing well or bad in the game and comparing an embedding or a lower dimensional representation of all the channels in these different episodes showed us that during the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.365,
    "end": 2735.387,
    "text": " better episodes when the game performance is high, there is actually a nice association or correlation between the activities of the sensory region",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.228,
    "end": 2761.847,
    "text": " and then the motor regions which are responsible for up movement and the motor regions which are responsible for down movement so they actually do make these nicely separated clusters when this does not happen during a bad game performance which was actually very nice for us because it showed us maybe this pre-definition of regions was towards the right direction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2762.198,
    "end": 2779.257,
    "text": " And more importantly, for our future designs, we can actually use this framework beforehand to see what are the channels that are clustering together, self-organizing to be more associated together, more correlated to then define the different rules for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.498,
    "end": 2788.307,
    "text": "We also looked at the criticality metrics actually in these cultures when they are doing well in the game in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2788.76,
    "end": 2802.82,
    "text": " Again, maybe they are self-organizing themselves in a specific matter that helps them process information better, have higher storage capacity, which is all that criticality is actually showing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2803.301,
    "end": 2814.177,
    "text": "And in one of our recent studies, which is already published, we did see that during gameplay, the whole population is actually self-organizing near a critical point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2814.798,
    "end": 2822.945,
    "text": " and the subregion separately as well, which is actually a hallmark of criticality being scale-free, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.965,
    "end": 2838.199,
    "text": "So we did see this scale-free pattern in their activity as well, the motor region separately and the sensory region separately, both also self-organized near criticality, which could be arising from a nice balance between excitation and inhibition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2839.32,
    "end": 2843.404,
    "text": "But again, there's lots to explore and lots to look at still.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2844.38,
    "end": 2863.448,
    "text": " Wow, very cool with the multi-scale criticality as those are the kinds of empirical patterns that in the biological systems maximize the signal intensity and its kind of first principle statistical properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.169,
    "end": 2873.543,
    "text": "Like it wouldn't be using the dynamical system to the full gain if it were falling far on one side or another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.586,
    "end": 2900.646,
    "text": " And then to show that even absent glia and all these other forcing or buffering elements that probably do play important roles in the criticality being maintained or useful organismally, but then even stripping out just the cells still has that pattern just for what they expect and prefer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.728,
    "end": 2902.99,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2903.273,
    "end": 2923.763,
    "text": " And we do hope in our future iterations of the system by the introduction of glial cells, astrocytes, we hope that this will actually be again helping and forcing how they are self-organizing your criticality to be performing the tasks, to be processing information, however we want to phrase that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2926.038,
    "end": 2951.016,
    "text": " what kinds of like computational or or system specific challenges do you think this kind of system would be useful for in like shorter and longer terms but what what do you think and how does that work with plugging in and co-evolving all of these like very material details with the kinds of settings that are useful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.363,
    "end": 2965.44,
    "text": " Yeah, so we do have this here as a short list of what we are thinking of as our short-term goals, long-term goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.602,
    "end": 2975.954,
    "text": "So as what we have ongoing as ongoing projects would be like what Moin mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.054,
    "end": 2981.982,
    "text": "So we are as a first step, because if we are aiming to have these computational",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2982.4,
    "end": 2997.675,
    "text": " units or biological intelligence units, we do want them to show memory, to have the ability to show this lifelong learning or continual learning, which we haven't fully shown yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2997.775,
    "end": 3003.481,
    "text": "So that's one of our ongoing projects to be able to train them in different tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3004.622,
    "end": 3009.387,
    "text": "We are working on different applications in drug discovery, meaning that we can have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3009.738,
    "end": 3030.025,
    "text": " in vitro models of different diseases, such as epileptic models, for example, and then testing the drugs on our cultures to see not only how the activity patterns are changing, but also even compare between drugs and how effective each of them are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3030.046,
    "end": 3035.593,
    "text": "Then... A recording capacity, actually,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3035.776,
    "end": 3037.258,
    "text": " with these projects.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3037.979,
    "end": 3047.594,
    "text": "Our previous recordings were just 20 minutes, but now we can have recordings up to a month, hours and hours.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3048.115,
    "end": 3054.425,
    "text": "And we have this ability to record from the cultures for, I don't know, up to 60 days.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3054.986,
    "end": 3056.308,
    "text": "Oh, way more than that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.348,
    "end": 3061.716,
    "text": "We can go up to even 8, 9, 10 months and ongoing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.78,
    "end": 3071.95,
    "text": " But definitely it's going to be a new challenge because we have a huge amount of data to analyze, but at least we have a good source of recordings.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3072.431,
    "end": 3086.725,
    "text": "Again, in terms of challenges, yes, just analyzing the data, the data storage for our purposes is going to be a challenge, but it's really nice to keep in mind that although it is a challenge for us to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3086.941,
    "end": 3091.905,
    "text": " maybe have all of these recordings and analyze them computationally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3091.946,
    "end": 3098.992,
    "text": "But these neurons, these cultures are still using very, very tiny amounts of power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3099.052,
    "end": 3115.767,
    "text": "So the power consumption by these computational units, if you want to call them, is still very efficient, which will hopefully in the future enable us to potentially use them as these closed loop",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3115.932,
    "end": 3122.058,
    "text": " intelligent systems with these inputs and outputs, obviously, design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3122.899,
    "end": 3126.782,
    "text": "And I think we can go wild in our imagination.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3126.923,
    "end": 3129.845,
    "text": "Maybe someday they can even replace silicon chips.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3134.189,
    "end": 3134.85,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.89,
    "end": 3135.811,
    "text": "Well, OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.933,
    "end": 3145.18,
    "text": "One question, I guess, to that is, how do you think about the resourcing and the benchmarking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.514,
    "end": 3170.998,
    "text": " like you could take the thermometer and give the temperature reading that's kind of cool that it does have this fundamental physical energy balance too so that's very interesting but in terms of the computation so here you explore some of the sample efficiency like how can these different computing substrates be compared when it comes to like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.299,
    "end": 3174.123,
    "text": " thinking about speed, but it doesn't have a clock speed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.143,
    "end": 3181.814,
    "text": "It's just unfolding, or it doesn't have a RAM memory or GPU measures for parallelization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.575,
    "end": 3189.966,
    "text": "So what are promising or useful ways to understand what these systems can do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.992,
    "end": 3194.913,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3195.294,
    "end": 3199.5,
    "text": "So one way that we are exploring now, again, is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3200.273,
    "end": 3225.538,
    "text": " If we are able to understand at least parts of the mechanisms that is driving this learning that's happening or the information processing that they're doing, one avenue could be actually to use those mechanisms, implement them in what we know as machine learning or AI methods, and actually help to improve those methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.923,
    "end": 3233.814,
    "text": " using these more biologically inspired and more intuitive mechanisms that we will be hopefully uncovering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3236.017,
    "end": 3245.15,
    "text": "But in terms of just comparing, this was our first effort, comparison to RL in terms of sample efficiency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3245.611,
    "end": 3248.975,
    "text": "It was challenging to make the comparison fair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3249.576,
    "end": 3254.563,
    "text": "We did have suggestions, we did have criticism in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3254.797,
    "end": 3262.988,
    "text": " As you saw, we showed results that if they are trained for longer durations of time, the RL methods, obviously they can even outperform our cultures at this state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3263.73,
    "end": 3270.539,
    "text": "But we all know that the power consumption now is like a huge issue, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3270.679,
    "end": 3276.568,
    "text": "Even in these LLMs, the new hot topic that everyone's talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.389,
    "end": 3284.078,
    "text": "If you just think about how much power they use, I think just comparing in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.564,
    "end": 3298.764,
    "text": " pictures like this, their power consumption, that could give the biological cultures a huge edge and a huge motivation for us to follow up on our designs and just continue with what we're doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3298.784,
    "end": 3302.71,
    "text": "Do you have any ideas on how to compare?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3302.73,
    "end": 3308.057,
    "text": "At this stage, honestly,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3308.273,
    "end": 3319.707,
    "text": " I think, again, the continual learning, the lifetime learning will be able to show us the actual capabilities that these biological neural networks can have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3321.169,
    "end": 3333.584,
    "text": "The memory, if they show the memory that you expect them to show, could be another point of comparison between whatever technology we have available now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.646,
    "end": 3336.508,
    "text": "But yeah, lots to explore still.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.653,
    "end": 3337.973,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.314,
    "end": 3343.621,
    "text": "I guess to a different side of it, it says ethical considerations like ongoing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.661,
    "end": 3353.955,
    "text": "I mean, even broadly, what does that look like or how does that really come into play and get stewarded in the research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.379,
    "end": 3365.972,
    "text": "So when we started the research, like the start of all of that, first of all, one of our challenge",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3366.256,
    "end": 3375.597,
    "text": " challenges was always just to put into words the phenomena that we are seeing, we are observing, that's what is happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3377.181,
    "end": 3382.493,
    "text": "Because if you're using terminologies like learning, cognition,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3383.182,
    "end": 3392.884,
    "text": " sentience and all of that, this could by itself be a huge area of discussion and even dispute in some cases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3394.367,
    "end": 3399.418,
    "text": "But to start with, our reason to do this was that there is no",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.719,
    "end": 3428.747,
    "text": " terminology like there is no set language to talk about predefined terminologies or language to talk about these systems or these phenomena so we decided to go with okay choose whatever best describes them but then as we moved on we realized that even the terminology that we use could have uh could have huge you know ethical um controversies or cause uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3428.896,
    "end": 3431.679,
    "text": " people to think about lots of ethical considerations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3432.46,
    "end": 3433.601,
    "text": "Are they sentient?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3433.701,
    "end": 3434.402,
    "text": "Do they feel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.023,
    "end": 3435.603,
    "text": "And all of these.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3436.264,
    "end": 3447.016,
    "text": "So all of our analysis that we're doing, we are using different metrics, different measures of, for example, measures that have been introduced to quantify consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3447.437,
    "end": 3449.939,
    "text": "Like for example, the PCI metric, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3451.882,
    "end": 3456.827,
    "text": "We can have all of these implemented for our cultures, which we are doing now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3457.263,
    "end": 3468.499,
    "text": " and then compare them against the findings, the state of the art research that are being done on consciousness, on cognitive abilities and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3469.32,
    "end": 3483.861,
    "text": "And so far to show that while these are capable computing units, they do not necessarily show or have the features that would qualify them as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3484.195,
    "end": 3486.937,
    "text": " conscious features or units.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.957,
    "end": 3514.0,
    "text": "So these are things, some parts of the things that we are doing, we are trying to address, to move in parallel with all of our computational studies in parallel, do all of these basically analysis as well to make sure that we are considerate enough of a phenomenon that we might not be aware of it happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3514.402,
    "end": 3536.983,
    "text": " underneath all of this but so far uh we are happy to say that we have published everything that we have found we have been very open with our findings and open to discussion open to everyone's opinions about whether there is an ethical angle that we have maybe missed wow very interesting like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3537.183,
    "end": 3560.997,
    "text": " how is that vector of different cognitive performance on different tasks associated with the different measures of consciousness and are those like maybe some implicitly or explicitly believe those are like the same vector or that they're orthogonal to each other and there's some other kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.449,
    "end": 3586.005,
    "text": " dimensionality where changing the the cognitive capacity like on any given task ends up not or even diminishing the performance in other ways so it's like a whole portfolio of evaluations because there's tasks but then these are other measures and yet it's like an opening up of these measures into the empirical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.525,
    "end": 3598.12,
    "text": " Whereas even before that, it was from the qualitative to the formal, but then all the equations on the piece of paper don't get to the sensor reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.16,
    "end": 3600.823,
    "text": "So that will be quite an exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.805,
    "end": 3604.508,
    "text": "Okay, I'll just ask like one or any last questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.469,
    "end": 3611.998,
    "text": "Jeff writes, have you compared results from cultures from different brain structures, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.138,
    "end": 3615.402,
    "text": "prefrontal cortex versus visual cortex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.343,
    "end": 3619.187,
    "text": " No, that we haven't done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.227,
    "end": 3626.757,
    "text": "All of our research is based on these iPSC cells, which are differentiated into cortical cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3627.658,
    "end": 3635.168,
    "text": "Again, in our future iterations of the system, we are introducing glial cells, astrocytes and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3635.188,
    "end": 3641.136,
    "text": "And we are trying to also move to 3D organoid intelligent systems or organoids.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3641.69,
    "end": 3665.925,
    "text": " but we have not implemented or compared between different brain structures yet what what attributes or were there any other things that correlated with like the human and the mouse difference i mean do they are they different sized or do they have different branching characters uh so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.002,
    "end": 3670.227,
    "text": " I'm not sure about the size, to be honest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3671.369,
    "end": 3676.458,
    "text": "I would love to have one of our biology team to be here to answer that, so I don't want to mislead anyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3677.059,
    "end": 3689.82,
    "text": "But in terms of their characteristics, we did study them in terms of their connectivity patterns, like the study we showed you about and the dynamics of the connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3689.969,
    "end": 3709.538,
    "text": " we do see, maybe we could call it slower plasticity mechanisms happening at a slower rate, which is what we saw in comparing mice and human cortical cells, which could explain parts of the difference in the performance that we saw.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3709.959,
    "end": 3718.812,
    "text": "But still, we shouldn't forget that even the mice cortical cells were performing quite well in the context of the tests that we defined for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3722.808,
    "end": 3724.792,
    "text": " Wow, very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3726.034,
    "end": 3729.32,
    "text": "Do you have any... Oh, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.34,
    "end": 3730.161,
    "text": "They're quite smart.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3731.684,
    "end": 3732.966,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.986,
    "end": 3744.867,
    "text": "Even when alone, it's like it reminds me of kind of a lot of the laboratory experiments in ant colonies, where even taking a Nesme out of its usual collective niche...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.032,
    "end": 3773.689,
    "text": " which is kind of it's analogous like other nestmate interactions that's like other neural connections um but with the more dynamic topology and then the glial niche is kind of like the nest architecture and then even stripping them of all of that and the pheromones and the tunnels and the nest mates interacting and then it's like still they could do the tea maze um okay one one last question from the live chat jeff wrote",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3774.023,
    "end": 3781.474,
    "text": " Could you see scaling this from a 2D grid to a 3D matrix, emulating cortical columns and interconnecting them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.515,
    "end": 3784.838,
    "text": "Yeah, I think I briefly mentioned that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3784.918,
    "end": 3787.502,
    "text": "Yeah, but we are actually doing it right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3788.223,
    "end": 3794.833,
    "text": "We are working on organoids, which is basically the 3D structure that Jeff is talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3794.873,
    "end": 3801.482,
    "text": "One major challenge of organoid studies is always...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3801.547,
    "end": 3803.33,
    "text": " Yes, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3803.39,
    "end": 3807.758,
    "text": "How do you record from the cells on the outer layer?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3807.878,
    "end": 3811.865,
    "text": "How do you make sure the inner layer cells are still alive and functioning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3812.366,
    "end": 3820.841,
    "text": "And how do you efficiently record from them without causing any damage or major interruption to the activity of the organoid of the outer layers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3821.623,
    "end": 3825.63,
    "text": "But I think those are challenges that everyone in this field",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3825.88,
    "end": 3851.382,
    "text": " are trying to solve now are facing we are also trying the same but we are doing that we already have some recordings of our organoids which are comparing against our 2ds right now no results to show unfortunately that is very new but yes that is on our to-do list cool do you have any last comments or questions or like anything else you want to ask",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3853.336,
    "end": 3875.108,
    "text": " no i think that was pretty much that yeah we wanted to discuss and talked about what could what could someone who's learning and applying active inference do in terms of their research and learning to kind of dovetail with these directions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.218,
    "end": 3879.222,
    "text": " to model them or biologically inspire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3879.543,
    "end": 3880.945,
    "text": "Yeah, I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3882.046,
    "end": 3897.147,
    "text": "So maybe if you would like to... It's still an open question for us to understand and realize the learning mechanism behind these biological cultures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3898.349,
    "end": 3902.575,
    "text": "And we need to find a way to somehow model the learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3903.656,
    "end": 3905.719,
    "text": "We were thinking about...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3906.037,
    "end": 3932.061,
    "text": " active inference for a long time as a biologically inspired algorithm but definitely there's a long path and lots of things that we can do yeah and for someone who is interested who's starting up I think although we have done this comparison that we showed you already but still we are looking for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3932.26,
    "end": 3942.71,
    "text": " for stronger evidence of these, for example, biological cultures actually following an active inference kind of framework, if you want to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3942.75,
    "end": 3957.644,
    "text": "So it could be a very nice starting point to actually model the exact game environment that these cultures, these biological cultures seem to be handling quite well in an active inference framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3957.744,
    "end": 3962.048,
    "text": "And later on, very soon for lifelong learning, actually, we need it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3962.399,
    "end": 3965.542,
    "text": " mathematical analysis to model the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3966.083,
    "end": 3966.783,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3966.803,
    "end": 3981.138,
    "text": "So to start with an environment or with a search space exactly similar to what the cultures are facing, trying to build a model upon that which matches the activity of our neurons of the biological cultures as we did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3982.259,
    "end": 3987.585,
    "text": "But still, again, starting from that point on, they will have a lot to explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3988.205,
    "end": 3990.027,
    "text": "We're happy to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.293,
    "end": 4015.17,
    "text": " discuss with anyone who's interested to contact us via email cortical labs we have discord channel we have all the means of communication that you can think of so if they're interested to you know get a sneak peek or have some some sample data to work with definitely happy to stay in touch with them awesome thank you both so much it's really fascinating so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4015.808,
    "end": 4036.787,
    "text": " hope people enjoyed it and learnt it was great and good luck thank you very much for inviting us yeah great and pleasure yeah thanks a lot for the invitation hope we had some you know new stuff to show people some good takeaways for the audience thanks a lot thank you see ya bye",
    "speaker": "SPEAKER_02"
  }
]