[
  {
    "start": 2.933,
    "end": 9.984,
    "text": " Okay, it's cohort four and July 25th, and we're in the second discussion of chapter three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.065,
    "end": 20.099,
    "text": "So before we look at the questions, is there anything that like anyone just wants to start anything about the reading or anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.882,
    "end": 31.236,
    "text": "Even maybe some recent live stream or course or anything or just what their reading is like now of chapter three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.505,
    "end": 47.306,
    "text": " Yeah, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.712,
    "end": 70.933,
    "text": "So I was thinking about this idea of synchronization between the inner model and the outer model, which another term for that could be adaptation to the environment, active adaptation, modifying the environment and building a model of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 70.953,
    "end": 74.858,
    "text": "But Bronwyn mentioned personality disorders and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 75.293,
    "end": 87.346,
    "text": " One of the features there, these are very fuzzy construct is being stuck in maladaptive patterns that don't really fit the environment and person is unable to change that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 87.546,
    "end": 94.333,
    "text": "Thus, their energies, they swim in free energy, so to speak, and they suffer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.553,
    "end": 97.356,
    "text": "And there's negative affect that is present all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.376,
    "end": 102.081,
    "text": "I do think that these models are a little too straight and narrow to account for psychopathology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 102.681,
    "end": 104.203,
    "text": "And I do think trying to explain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 104.487,
    "end": 111.756,
    "text": " something like that with sort of a need formula is just not ready yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 111.896,
    "end": 127.215,
    "text": "I mean, I think that these are not doing it justice because, you know, people exist who spend decades in maladaptive behavior and they don't do much about it to get better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.235,
    "end": 131.76,
    "text": "So I just find it that, you know, when we dictate and say this is the law,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 132.061,
    "end": 135.091,
    "text": " This is the first principle and this is how the living thing does it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.512,
    "end": 143.016,
    "text": "Bacteria perhaps, but in a person with like malignant narcissism, no, they don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 148.345,
    "end": 176.597,
    "text": " yeah so really good uh question like what is the role of the math in the science what's the role of the science quote science what's the role of the math in the science how just broadly extrapolative is it in its interpretation um and then what's the role of just any any any how is how is the math and science mobilized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.577,
    "end": 178.321,
    "text": " with personality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.787,
    "end": 183.734,
    "text": "What does a principle matter in the specific?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.437,
    "end": 187.482,
    "text": "What does a specific matter for a principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.404,
    "end": 190.89,
    "text": "Those are all huge questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.832,
    "end": 195.195,
    "text": " I think you'd be interested in a cybernetic Big Five theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 195.335,
    "end": 206.646,
    "text": "They have a few papers where they connect it to free energy principle to try to go at different psychopathologies and try to see how you can think of it in a cybernetic perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 207.106,
    "end": 208.968,
    "text": "It might be something you might be interested in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 208.988,
    "end": 211.791,
    "text": "I'm familiar with the Big Five theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.071,
    "end": 213.773,
    "text": "It's also statistics based.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 213.793,
    "end": 218.597,
    "text": "I'm a clinical psychologist, and I think it has nothing to do with personality disorders.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 218.697,
    "end": 221.62,
    "text": "I think it's, again, trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.701,
    "end": 222.422,
    "text": " one size.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.503,
    "end": 224.123,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.024,
    "end": 225.304,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.324,
    "end": 229.428,
    "text": "But but still, you know, we're going from mathematics trying to define.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 229.468,
    "end": 236.535,
    "text": "I mean, it would be good to to bring somebody in the room who has a borderline personality disorder and try to apply that theory to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.116,
    "end": 238.577,
    "text": "They're predictably unpredictable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.197,
    "end": 243.341,
    "text": "There's something missing, like, I don't know, field theory or case theory framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 243.361,
    "end": 250.408,
    "text": "It just it it it doesn't match my empirical data of interacting with these patients on a daily basis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.912,
    "end": 274.523,
    "text": " know and it doesn't come from papers comes from seeing what they do in life over and over and over again it doesn't work they still do it so uh yeah one way i i i might kind of ask this would be the personality traits are more about the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.672,
    "end": 281.003,
    "text": " characteristics of the paths in a cognitive model so it's like certain type of dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.827,
    "end": 307.227,
    "text": " in the map not the territory then in the you know maybe a clinical setting first off it's engagement directly rather than engagement with the model and also there's perhaps less of a focus on just like um in the in the short term about just population scale patterns and maybe more emphasis on a person's action patterns",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.207,
    "end": 336.572,
    "text": " and so then how can these two sides kind of support each other in an applied cognitive science rather than like disengaging color characteristic ends in uh cbtf cbft uh and cybernetic big five Theory as like another layer uh outside of just traits",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 339.353,
    "end": 367.065,
    "text": " what was the name of the thing outside of traits characteristic adaptations cool yeah also anyone of course can always be just clicking on the cursor and following and taking notes like people can have things just it's all good if people want to to discuss or just filling in other angles but thanks everybody who's sharing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.762,
    "end": 373.989,
    "text": " Any other thoughts before we look at any of the questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.009,
    "end": 374.91,
    "text": "It could be anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.975,
    "end": 388.552,
    "text": "Actually, yeah, just as a brief follow-up to the preceding conversation, I was just curious if anyone finds interest in the notion of hyper-precise priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.053,
    "end": 394.842,
    "text": "I see that come up very frequently in applications of active inference to psychopathology and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.21,
    "end": 421.757,
    "text": " um like basically the idea that there's a like a very strong belief that a certain model is correct to where it kind of skews and coming um you know sensory information and it kind of continues um to to impact future actions um despite like disconfirmatory sensory evidence i mean i just in response to the earlier conversation i found i've found that to be really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.058,
    "end": 451.103,
    "text": " interesting and i thought it dovetailed really nicely with with studying psychopathology actually yeah i i think it matches well to something like delusion because if i believe firmly that neighbor walks in my house and changes the furniture when i am outside then and it doesn't get updated based on me calling the police and calling you know installing cameras then that's sort of hyper precise priors exactly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 451.825,
    "end": 461.078,
    "text": " But I do think that, again, trying to stretch this approach to different kinds of psychopathology, like, as I've mentioned, say, personality disorders.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.279,
    "end": 474.816,
    "text": "So a lot of personality disorders are related to early experiences where the child or adolescent tried to adapt to the environment, which is very difficult to survive in emotionally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 475.157,
    "end": 481.225,
    "text": "And they've developed some habits that were not solutions back then, but there's nothing better that was available to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 481.475,
    "end": 483.358,
    "text": " and they carried it through into adulthood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 484.219,
    "end": 494.214,
    "text": "So for example, you know, a child often in a divorce of parents ends up thinking that he is the reason why they're divorcing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 494.694,
    "end": 497.559,
    "text": "They end up internalizing distress and saying, I'm the guilty party.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 498.079,
    "end": 502.025,
    "text": "And then they get in trouble because if I'm in trouble, then maybe these two knuckleheads will get together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 502.546,
    "end": 509.997,
    "text": "And then you see an adult patient in psychotherapy in their thirties that apologize every session for everything, you know, and that's an example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.247,
    "end": 523.59,
    "text": " kind of and it's not necessarily I mean it has a completely different flavor from delusion and I don't think the language is hyper precise priors is sufficient to distinguish between the two there's qualitative differences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.692,
    "end": 529.2,
    "text": "And so I guess that more stuff is needed to describe the difference of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.918,
    "end": 546.492,
    "text": " What about something like obsessive-impulsive disorder, where you could think of it from an ecological, psychological perspective as a low tolerance for affordances?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 547.033,
    "end": 549.555,
    "text": "So yeah, low tolerance for uncertainty, basically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 553.699,
    "end": 555.22,
    "text": "That would not do it justice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 555.24,
    "end": 558.343,
    "text": "That would be a very simplistic approach to OCD because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 558.593,
    "end": 559.635,
    "text": " There's different subtypes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.695,
    "end": 566.107,
    "text": "People who do washing and check-in are very different from whores.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 568.412,
    "end": 574.223,
    "text": "You could have people dysregulated and people with dysregulated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 574.827,
    "end": 580.595,
    "text": " Christoph Strobeler, Childhood OCD there's a lot of it all together, this is an example of trying to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 581.116,
    "end": 593.774,
    "text": "Christoph Strobeler, You know fit something very heterogeneous complex into a simple formula and just saying oh we've got this cool theory let's just explain OCD with it, no, I mean, I think, if we want to do the OCD justice, we need to start with a literature review.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 594.355,
    "end": 602.927,
    "text": "Christoph Strobeler, Go to PubMed and read all the theories about OCD genetic influence, you know environmental influence, you know chemistry everything else put it all together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 603.245,
    "end": 604.207,
    "text": " And then we should do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 604.247,
    "end": 609.577,
    "text": "So this approach from first principles to do something as complex as that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 609.758,
    "end": 611.121,
    "text": "Thomas Parr is a psychiatrist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 612.624,
    "end": 614.006,
    "text": "Carl Friston is a psychiatrist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 614.247,
    "end": 621.0,
    "text": "A lot of people who aren't, they want to just schlep a formula to OCD, and it just doesn't work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 624.338,
    "end": 629.203,
    "text": " Well, again, what is really the role of a specific model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.806,
    "end": 645.52,
    "text": "Construction of those models is usually not utilized as a full account, but maybe it can seem that way or be used that way in certain settings, like to guide action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.56,
    "end": 649.384,
    "text": "And then also, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.317,
    "end": 660.849,
    "text": " One good thing about generative modeling is that it allows really specific discussion of what has and hasn't been specifically modeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.869,
    "end": 670.242,
    "text": "So first principles, just because something feels like conciliant in one's own mind does not equate to an explanation, let alone useful in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.222,
    "end": 677.489,
    "text": " So then there can be a discussion of like, okay, what sensory modalities and interoceptive modalities are we taking into account?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.549,
    "end": 682.134,
    "text": "And how's childhood in this specific model of these people who have OCDs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.154,
    "end": 683.996,
    "text": "Like, oh, there's no generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.176,
    "end": 687.019,
    "text": "Well, we have chapter six, we have chapter nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.22,
    "end": 699.992,
    "text": "You can build the model, but definitely if it's just speculation about what inclusion or exclusion of variables you're just like kind of casually curious about or professionally curious about, it's all speculative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.563,
    "end": 713.697,
    "text": " So I think that kind of supports a more bright line because then people can just spitball a little more broadly, structurally, which everyone's going to have some expertise in some area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.198,
    "end": 721.726,
    "text": "But then also it's clear, like when someone's not referencing a specific generative model, it's just a pure hypothetical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.427,
    "end": 726.911,
    "text": "So what would a hypothetical linear regression account for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.971,
    "end": 727.412,
    "text": "Nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.432,
    "end": 727.532,
    "text": "Okay."
  },
  {
    "start": 728.778,
    "end": 730.846,
    "text": " So what would a hypothetical cognitive model account for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 731.549,
    "end": 736.729,
    "text": "Well, maybe something, but it doesn't have to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.151,
    "end": 765.94,
    "text": " So I have a question this more of an issue with how we're classifying psychopathologies, or is this as in like each classification is too broad, perhaps, and we need to be more specific, maybe, and because maybe like the same like you were saying like there's many different types of obsessive compulsive disorder.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 766.072,
    "end": 778.467,
    "text": " So maybe the ones that pertain to a low tolerance for uncertainty would need its own specific classification versus other ones that are different.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 781.65,
    "end": 784.113,
    "text": "Just a question there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 784.133,
    "end": 785.255,
    "text": "There's many issues there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 785.435,
    "end": 789.42,
    "text": "One is, you know, we apply mathematical apparatus to another field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 789.54,
    "end": 793.084,
    "text": "We're trying to either or cybernetic theories or something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.705,
    "end": 795.707,
    "text": "And it doesn't always work, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 796.075,
    "end": 800.461,
    "text": " In psychology, there's something we call ambivalence, which is hating and loving the person at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.322,
    "end": 806.649,
    "text": "That concept violates the logic of Aristotle, and all of mathematics is based on Aristotelian logic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 807.11,
    "end": 807.75,
    "text": "So there you go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 807.891,
    "end": 814.359,
    "text": "You can't use the absolutely fundamental framework while you're trying to use something more sophisticated like classifications and whatnot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 814.8,
    "end": 822.69,
    "text": "And there's many critiques of DSM classifications, ICT classifications, but the important thing is the construct is complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.092,
    "end": 831.941,
    "text": " And then, you know, before trying to model it or explain it, we should study the existing literature and go from there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.261,
    "end": 843.693,
    "text": "Because otherwise, we are trying to model our fantasy of OCD and what sort of the practical reality of OCD that is, you know, like, sadly, it's still very bad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.753,
    "end": 847.817,
    "text": "Like schizophrenia, we know about 14 possible causal factors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.101,
    "end": 852.926,
    "text": " but there is no coherent theory of schizophrenia that everybody exists on, nor depression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 853.387,
    "end": 860.195,
    "text": "It's the oldest condition in the history of medicine, but there is no integrated theory of depression still.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 860.395,
    "end": 861.036,
    "text": "It doesn't exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 862.137,
    "end": 868.504,
    "text": "And so this active inference is one of the attempts to do that, but it still falls short.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.684,
    "end": 877.534,
    "text": "Like if you use active inference and you try to explain everything from autism to, I don't know, motor disorders, it doesn't fit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.919,
    "end": 880.382,
    "text": " It doesn't capture the core of autism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.602,
    "end": 883.765,
    "text": "It just, it seems to fit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.086,
    "end": 885.007,
    "text": "You have this resonance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 885.027,
    "end": 886.148,
    "text": "You're like, oh, that's cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 886.508,
    "end": 887.85,
    "text": "I think I've explained it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.41,
    "end": 891.994,
    "text": "But if you actually see people with autism, you see that you're explaining something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 892.174,
    "end": 896.039,
    "text": "I mean, because the core of autism is mentalization deficit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.059,
    "end": 901.364,
    "text": "So I don't know if it's a good answer, but it's a very messy field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.424,
    "end": 902.045,
    "text": "It's very different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.285,
    "end": 906.61,
    "text": "Mathematics is very kind of, you either prove a theorem, it's either true or false.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.4,
    "end": 924.767,
    "text": " in clinical psych it's a very different yeah that's why uh modeling work is part of an integrated scientifically plural framework I mean you need to do both",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.287,
    "end": 927.532,
    "text": " Oh, just just it's it's a soup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.613,
    "end": 933.687,
    "text": "It's a super overfit like it's always about reading amongst and between the citations and everything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.048,
    "end": 936.675,
    "text": "It's not about one paper, one experiment, one data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.196,
    "end": 941.727,
    "text": "It's always about being explicit about the interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.707,
    "end": 943.99,
    "text": " and how the researchers model was made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.01,
    "end": 952.342,
    "text": "And so if somebody shows up talking to you with a lot of personal experience and or a lot of meta analysis, I'm sure that's a productive conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.382,
    "end": 957.57,
    "text": "Also can be productive with someone who might not be aware of some of those complexities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.511,
    "end": 963.118,
    "text": "But yeah, that's also there's also just like these are it's always like active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.839,
    "end": 967.444,
    "text": "Or is this about just like any kind of modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.424,
    "end": 996.385,
    "text": " numerical or statistical modeling because someone could also make I I believe in identical we're not linear regressions our health records aren't linear regressions that's not the body that's not decision making it's just linear regression so decades of insurance being calculated that way for example so if that ends up using cognitive modeling now that's kind of the gray zone slash question is what is that kind of cognitive digital twin",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.698,
    "end": 1022.237,
    "text": " not just the accumulation of information from a privacy perspective but that kind of like more decision-making representation which of course is still just mapping out territory that's a different area just one kind of modern connection I don't know do people have any thoughts on that or how this relates to um different machine learning like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.922,
    "end": 1028.592,
    "text": " How does it relate to machine learning or what's happening right now with synthetic intelligence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.439,
    "end": 1035.568,
    "text": "Well, I know that...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1035.903,
    "end": 1062.771,
    "text": " it seems like self-attention mechanisms are also trying to minimize perplexity and there was this recent paper that they're using called like evolutionary transformer architectures where they basically add like an evolutionary block to it which allows it to so you have multiple sort of models and they're also all trying to minimize perplexity",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1064.59,
    "end": 1075.9,
    "text": " And then I know like GPT, the latest with GPT was they, it was like leaked that they're using, um, they're using, uh,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1078.748,
    "end": 1099.018,
    "text": " I'll make sure of experts or yeah basically like a similar type of algorithm to just find what comes up with the best sort of output among many different models, so I just thought that's kind of similar to like some things that were mentioned in active inference, especially this chapter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1102.306,
    "end": 1125.951,
    "text": " that's one great connection also with collective behavior and um evolution and active but also attention i know holly and others have have kind of thought about this or or considered a little bit like attention mechanisms first off attention is just one of a huge variety of cognitive mechanisms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.167,
    "end": 1127.349,
    "text": " Danny Jauregui, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.049,
    "end": 1142.1,
    "text": ": anticipation, expectation, attention, so um this is, we can think about the regimes of attention, which is a concept from the cultural work with encultured patterns regimes of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.751,
    "end": 1172.88,
    "text": " uh to sensory and to different things and so there could be a transformer with a real cognitive model explicit semantically interpretable active figure 4.3 type cognitive model here's the explicit attention function for example and that and that there's a lot more say in that area but that's for those who are interested I feel like that's a cool you know thing to look into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.645,
    "end": 1178.803,
    "text": " Any other chapter three thought, or we can go to the questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.77,
    "end": 1213.397,
    "text": " All right, everyone can vote or just also open the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.278,
    "end": 1214.558,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.948,
    "end": 1232.044,
    "text": "Note that the resulting preferred course of action or policy is directly measurable in experimental settings, whereas a value function or prior belief needs to be inferred and hence is a more indirect, if not tautological measure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.104,
    "end": 1238.092,
    "text": " I'm not sure how or why the measure might be tautological in the case where the value function needs to be inferred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.294,
    "end": 1240.575,
    "text": "What is the tautology here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.489,
    "end": 1250.691,
    "text": "Anyone have a thought on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.174,
    "end": 1281.447,
    "text": " All right, well, I am not exactly sure, but we can contrast reward learning with active inference type generative modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.667,
    "end": 1288.656,
    "text": "So reward learning, you're going to assign some utility or value to different states and then pursue rewarding states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.696,
    "end": 1293.101,
    "text": "Like different chess pieces get a value, and then you want to maximize that expected value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.444,
    "end": 1297.907,
    "text": "That's the imperative for selecting different actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.322,
    "end": 1325.211,
    "text": " then in active actions going to be selected based upon it being the most uh basically it depends on the kind of agent because different agents have different kind of relationship with the future there's simple agents or just um kind of inert or have deterministic action policy but then there's the whole open-endedness of cognitive systems so um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.431,
    "end": 1335.419,
    "text": " They act to learn, but they also act to realize their preferred, their preferences about sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.621,
    "end": 1352.479,
    "text": "But however you look at their behavior, whatever you think about their behavior, whatever you propose as guiding their behavior, it is what is directly measurable in experimental settings, which is shown in figure 9.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.499,
    "end": 1355.603,
    "text": "9.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.363,
    "end": 1363.228,
    "text": " which we talked about actually in the other cohort earlier today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.248,
    "end": 1370.798,
    "text": "So we're talking about what we present as stimuli and what we observe as behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.799,
    "end": 1382.653,
    "text": "So that's what this modeling approach is tethered upon, that setting where a cognitive model is being projected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.249,
    "end": 1398.486,
    "text": " In contrast, if you propose some second order function about the behavior, like, well, it likes being in the light, not because it expects to be in the light, and that's the most likely thing, but because light is rewarding, and so then it's going to pursue reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.428,
    "end": 1412.725,
    "text": "You've basically proposed an ad hoc, potentially principled, but at the very least indirect, and possibly just self-describing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.438,
    "end": 1436.012,
    "text": " something that isn't this though maybe there's some specific case but it seems pretty vague i mean anyone else think about the tautology or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.847,
    "end": 1456.415,
    "text": " I sort of just took that quote as referring to preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.897,
    "end": 1462.623,
    "text": "Pardon me, I'm still trying to wrap my head around this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.663,
    "end": 1466.307,
    "text": "You're already starting with a set of preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.367,
    "end": 1471.233,
    "text": "I suppose that you're C matrix, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.253,
    "end": 1478.622,
    "text": "And the tautological aspect is that I suppose whenever you're modeling, you always have to start",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.378,
    "end": 1491.1,
    "text": " With some kind of see like we it's it's it's as if it's saying that active inference is not an origin story it's just like we're already there and so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.342,
    "end": 1502.922,
    "text": "Like there's no explanation for the starting point, we can only measure what maybe results following after our priors are already defined something along those lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.12,
    "end": 1507.501,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.581,
    "end": 1511.928,
    "text": "That's a great thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.473,
    "end": 1516.435,
    "text": "There's a few ways to look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.575,
    "end": 1530.057,
    "text": "One on the more formal side is like, if we think about things that don't plan, they're going to be, amongst other things like that, just the same and all like diffusing particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.88,
    "end": 1537.066,
    "text": " So like they have no preferred state in the gas box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.646,
    "end": 1545.794,
    "text": "So they're behaving like just kind of like classically from experimental perspective or like according to thermodynamic equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.415,
    "end": 1558.626,
    "text": "Whereas systems that have an attracting set, homeostasis or acting with a C to kind of anchor the attracting set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.142,
    "end": 1570.304,
    "text": " without any pragmatic value, policy selection is just, policies are driven by pure epistemic, which in abstracted settings may be an optimal situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.407,
    "end": 1574.674,
    "text": "But for embodied settings, that's not,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.008,
    "end": 1576.071,
    "text": " James Forrest, Norcal PTAC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.01,
    "end": 1577.033,
    "text": ": the general principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.053,
    "end": 1577.614,
    "text": "James Forrest, Norcal PTAC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.594,
    "end": 1582.727,
    "text": ": So that's why there's those two pragmatic and epistemic James Forrest, Norcal PTAC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.707,
    "end": 1592.511,
    "text": ": which helps give a lot of degrees of freedom, because this is a value that's calculated for the specific model that somebody constructs, like in chapter six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.491,
    "end": 1598.637,
    "text": " So it can't be just generically said like, well, the free energy of a nest mate goes down when it gets a seed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.718,
    "end": 1606.826,
    "text": "It's like, it's way, way speculative to say before having like the specific kind of model that's even being discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.211,
    "end": 1622.042,
    "text": "So, and it's just, it's explicitly what is being the attracting set itself, not a proposed second order variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.98,
    "end": 1625.662,
    "text": " Just one possibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.104,
    "end": 1632.851,
    "text": "But another approach is like, is like back to like, is it about modeling or is it about active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.891,
    "end": 1638.699,
    "text": "It's like, okay, what other approach can be taken in this setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.18,
    "end": 1642.904,
    "text": "Is this not a worthy setting or like, is there another way to approach this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.046,
    "end": 1647.41,
    "text": "And what would that kind of a variable or what would that model be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.792,
    "end": 1653.598,
    "text": "So it doesn't have to be all, only, every,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.232,
    "end": 1660.622,
    "text": " But that's kind of the golden hammer, golden nail or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.787,
    "end": 1676.413,
    "text": "Now that can be a simplifying cognitive heuristic, which has all the benefits and trade-offs of any cognitive system engaging in a similar heuristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.368,
    "end": 1698.638,
    "text": " we're in the textbook group so we can like learn and like scrutinize it or like use it in ways that that don't necessarily make specific sense in any given one person's experience of using it leaf blower any other thoughts on this question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.421,
    "end": 1720.667,
    "text": " What are the minimal contents of the model encoded within the internal states of an activation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.748,
    "end": 1734.946,
    "text": "I'm presuming that one, a statistical model of the hidden causes of the sensory data, and two, preferences about the state the generative model needs to be in order to ontologically persist through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.129,
    "end": 1741.615,
    "text": "I feel like one is specified in the section, but where in the generative model are the preferred states located?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.675,
    "end": 1745.28,
    "text": "Who has any thought on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.428,
    "end": 1760.945,
    "text": " So would this not be what they describe as like the motion of the action states as the prediction of the preferred states as well?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1764.55,
    "end": 1773.823,
    "text": "I don't know if that covers that aspect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1776.988,
    "end": 1779.351,
    "text": "Okay, possibly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.837,
    "end": 1786.767,
    "text": " Like in the action perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1786.787,
    "end": 1788.309,
    "text": "Can you say the relationship again?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.852,
    "end": 1790.112,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1790.132,
    "end": 1807.718,
    "text": "So in the book, they describe how the Markov blanket not only is predicting sensory states, it's also doing so for the action states as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1809.706,
    "end": 1812.01,
    "text": " I don't know if I'm phrasing that correctly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1813.252,
    "end": 1816.497,
    "text": "But if I can find it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1823.328,
    "end": 1831.14,
    "text": "One equation based way to look at this is so where in the generative model are preferred states located?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.647,
    "end": 1836.189,
    "text": " they're the C here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.25,
    "end": 1842.536,
    "text": "So they're used in the expected free energy calculation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.157,
    "end": 1860.216,
    "text": "So if we're talking about a kind of simple model, not a simple system, but a simple model where the cognitive states are just like a pass-through or a divide by two, or it's just a noise,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.196,
    "end": 1866.122,
    "text": " So the action policy and the sensor uncorrelated or uncaused or anything like that, like those are all special cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.842,
    "end": 1881.656,
    "text": "But action policy selectors, which might be one step selectors, like instantaneous selectors, doesn't have to be an explicit planner per se, could be like a gradient based system with bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.158,
    "end": 1886.541,
    "text": "Pragmatic value is where preferences are loaded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.027,
    "end": 1897.585,
    "text": " And pragmatic value reweights policies accordingly to how close you get to the preference vector slash variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.807,
    "end": 1901.611,
    "text": "And how relevant that is in the behavior is situational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.771,
    "end": 1905.137,
    "text": "There's no generic answer because the other component is about epistemic gains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.518,
    "end": 1912.086,
    "text": " And so this is the relationships that's described in all those special cases where this or that doesn't apply.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.807,
    "end": 1922.019,
    "text": "So it's a totally good question, but it's a very, you know, this is one of the key differences between reward learning and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.28,
    "end": 1927.767,
    "text": "In active inference, the preferences are explicit over sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.747,
    "end": 1936.415,
    "text": " That's a relationship with perceptual control theory, and it prevents overfitting because it's about the incoming sensory data, predictive processing, all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.616,
    "end": 1943.581,
    "text": "There's no proposition of a reward or a utility function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.702,
    "end": 1957.753,
    "text": "What the agent is proposed to be doing, what our inference does procedurally, is just these optimizations on the specific proposed generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.526,
    "end": 1966.451,
    "text": " So first principle may do less work generically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.473,
    "end": 1972.4,
    "text": "Principle of least action, people are not always bringing this out to talk about, well, this is why this plane did or didn't fly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.44,
    "end": 1975.424,
    "text": "Well, this one was just following its path of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.946,
    "end": 1980.291,
    "text": "So that's not an explanation or an account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.232,
    "end": 1989.824,
    "text": "And I think that that's echoed in what you shared, Lexi, like sort of about particulars and generics and everything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.864,
    "end": 1991.166,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.968,
    "end": 1997.433,
    "text": " First principle, less specific work done by the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.913,
    "end": 2002.077,
    "text": "Understanding the framework, very prerequisite for modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.158,
    "end": 2008.604,
    "text": "Understanding claims for, of course, just the joy and the fun, everything like that, all the fun we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.565,
    "end": 2019.735,
    "text": "But understanding claims, like evaluating whether a given usage of the active inference ontology is valid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.306,
    "end": 2039.766,
    "text": " But then to do the applied modeling and to understand it in the way like that a graduate student type might, then these are only kind of the enabling pieces, kind of like the L2 least sum of squares minimization has a relationship with linear modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.05,
    "end": 2045.988,
    "text": " But a more statistical student might learn more about the underlying basis of the linear regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.991,
    "end": 2052.709,
    "text": "More empirical statistics student might just apply data set modeling, not go too deep into the theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.107,
    "end": 2064.924,
    "text": " Just want to kind of provide some of that context, because, like first in at all, I've explicitly said this is for this textbook that that we're gathering around like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.944,
    "end": 2073.498,
    "text": "It's a kind of masters students again, take that for what it means, and there's always more variability like with them and then between all these other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.139,
    "end": 2076.182,
    "text": "But master students.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.517,
    "end": 2100.567,
    "text": " getting on the way to doing modeling in this approach based upon reading the epistemic first half of the book I don't know what pace of course we're um having fun figuring it out and then going into the modeling in parallel following along after the chapter six",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.205,
    "end": 2127.027,
    "text": " with one's own kind of specifications or just like explorations for different systems some stubs of which we have and we can collaboratively do too but it's kind of just a general comment because like the philosophy is is amazing it really is and people bring so much to these discussions that that I'm just so glad that that we have them and everything like that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.749,
    "end": 2149.825,
    "text": " And a lot of it is very general and important outside of just active inference, which is really like in the textbook sense, like comparatively can be narrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.323,
    "end": 2157.771,
    "text": " because it can feel like there's like a lot of like things to get like rabbit holes to get lost in and everything, crags to fall into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.811,
    "end": 2163.919,
    "text": "But I hope it provides a little context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2164.62,
    "end": 2175.154,
    "text": "Hence, just like regularly working with material and just broader sketches, natural language that is consistent with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.927,
    "end": 2198.357,
    "text": " the equations but you know there's only so much mystery in one's time in life with the mystery with the equations alexi yeah um thank you so much i mean i think you described it beautifully i just wanted to also comment that everything we're talking about only applies for systems just like when it says early in the chapter that have an attracting set",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2199.147,
    "end": 2207.96,
    "text": " This is fundamental quality of the systems we describe on this figure 3.3 when they show a system that doesn't have an attractor and the system that does have an attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2208.561,
    "end": 2212.667,
    "text": "Active inference models talk about the ones that do have an attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.787,
    "end": 2214.69,
    "text": "They kind of converge, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2215.931,
    "end": 2224.564,
    "text": "And so I recently asked Carl via email, and he asked Lancelot and DaCosta as well, what if the attracting set changes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2225.388,
    "end": 2228.051,
    "text": " For example, if I sleep, there's one attracting set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.071,
    "end": 2229.893,
    "text": "When I wake up, there's another attractive set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2230.354,
    "end": 2232.697,
    "text": "And my entire system bifurcates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.837,
    "end": 2237.623,
    "text": "It evolves from, let's say, periodic attractor to a strange attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2238.604,
    "end": 2240.626,
    "text": "And they are working on that right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.706,
    "end": 2254.703,
    "text": "I think this is a work in progress, but they will create a sort of a hierarchical structure where the attracting set itself is not kind of set, where you can describe it and say that's the attracting set, but it can actually change in and of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.953,
    "end": 2260.439,
    "text": " That's a new interesting development that may help.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2261.122,
    "end": 2262.448,
    "text": "I don't know how people feel about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2263.812,
    "end": 2285.398,
    "text": " yeah that's awesome that sounds really cool one one piece to bring in here this is axel constance like extremely um kind of uh girdle escherbach type uh description of fep which kind of just had to be said but he he laid it down and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.167,
    "end": 2300.046,
    "text": " The simple point I make in this paper is that the free energy principle is not concerned with the sufficient conditions of existence, but rather with what must have been the case given that you exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.066,
    "end": 2302.95,
    "text": "It's not about figuring out what it takes to be alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.03,
    "end": 2304.973,
    "text": "It's about figuring out what took you there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.388,
    "end": 2317.32,
    "text": " That's just so deep, and I think it gives a different account for a lot of settings, just like the surprise versus reward does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.38,
    "end": 2331.957,
    "text": "Now, that in place, I don't know exactly how they're related here because maybe this could be taken, but it's like saying we're making a measurement theory for measurable objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.358,
    "end": 2341.712,
    "text": " We have the blur, so we know when there's no signal, that's just noise, that's gonna be, that's the baseline informationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.813,
    "end": 2355.512,
    "text": "And then we're gonna have a theory of measurements, an analytic framework for measurements, cognitive measurements, observables and unobservables for measurable systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.894,
    "end": 2360.88,
    "text": "Or if you do a hypothetical, it doesn't have to be like an adaptive system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.704,
    "end": 2370.364,
    "text": " So that's, what's fun in the textbook group is like, we can imagine just like, okay, let's just imagine that the external state is just alternating between two states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.508,
    "end": 2378.077,
    "text": " It's just like, I mean, it's great to really wonder about these really contemporary examples and everything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.138,
    "end": 2384.927,
    "text": "But like pedagogically, a lot of these existentials are non-relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.408,
    "end": 2393.82,
    "text": "It's good to keep them in mind because I think a lot of the technical part, like people can study in the math learning group and hopefully like it's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.8,
    "end": 2417.023,
    "text": " you know there can be good math discussions but this is like i'll bring so much of the broader context in with what everyone shares but because the the math is not a metaphysic and this inversion of um of uh conditioning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.455,
    "end": 2446.977,
    "text": " like most people if they think about um a theory of everything they're going to think about it like from a sort of material up like how things came to be versus um so versus at least the measuring or modeling framework for signal versus noise which does a less slash different work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.121,
    "end": 2452.93,
    "text": " per se than the accounts of how something like comes to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.192,
    "end": 2464.932,
    "text": "Because different mechanisms for things coming to exist, they might have, for a given generative model, like they might have similar or different dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.223,
    "end": 2470.867,
    "text": " But the model is not going to, like, I think here to J.F.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.887,
    "end": 2493.231,
    "text": "Cloutier at the Institute and his work with the symbolic active inference robotics and about how we can have different implementation architectures that can be modeled from an active inference behavior perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.662,
    "end": 2499.827,
    "text": " But this doesn't mean that everything has to be like running this exact statistical model as a Colonel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.128,
    "end": 2506.994,
    "text": "That's like figure 4.3 is like super schematic, extremely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.475,
    "end": 2511.238,
    "text": "It's like, it's, it's not a claim about a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.579,
    "end": 2524.011,
    "text": "It's just super evocative about the kind of structure that can be expressed for in the most minimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.29,
    "end": 2551.247,
    "text": " way and then there's a lot there's a lot more to do and everything but that's why it gets kept it keeps on getting returned to because it helps give a first pass separation on like priors sense to hidden uh hidden state to sensing world model and action model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.51,
    "end": 2560.781,
    "text": " So these are some of the essential features of, as it turns out, inert and sentient creatures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.184,
    "end": 2569.032,
    "text": "But this is not like, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.052,
    "end": 2581.268,
    "text": "I hope that's not too contextual, but just want to clarify because I can imagine slash see that what the equations do is a primary...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.564,
    "end": 2609.061,
    "text": " concern slash awareness and uh so so I think that it's very um worthwhile for people who want to continue like learning and thinking about it like just um sharing their perspectives on what these maths actually do because then it's just parallel streams where one is just like like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.762,
    "end": 2636.061,
    "text": " it now i don't know just what do people think about that or how do we really connect up even just in these short discussions some of these mathematical details which are kind of just like just defined as true essentially and all these other systems of interests like ways of knowing that we all are interested in um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.07,
    "end": 2651.942,
    "text": " I hope i'm not too like far afield from the way that things are being framed a moment ago, but I mean as far as something like simultaneously or simultaneous like a tractor sets that might be competing with one another, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.663,
    "end": 2666.875,
    "text": "And the idea of like you know you have a series of preferences um i've i've not had too much trouble wrapping my mind around the idea that you can have you know competing tractor states are competing preferences, you need to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.513,
    "end": 2671.678,
    "text": " use the restroom and you're hungry and you're very sleepy all at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.319,
    "end": 2679.507,
    "text": "And so we have these models that, you know, whether it be the discrete version or the continuous version, they all happen in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.568,
    "end": 2683.092,
    "text": "And they all involve like policy selection over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.172,
    "end": 2694.005,
    "text": "So for example, if I decide, oh, like, you know, I'm very tired, but it's only 2 p.m., I could take a short nap and then I could get up and, you know, have a snack and use the restroom, what do I need to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2694.325,
    "end": 2696.608,
    "text": "But you can plan things out over time and,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.112,
    "end": 2712.613,
    "text": " And as far as the relationship between that and the math goes, we have that nice expected free energy equals epistemic value, the combination of the epistemic value and the pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2712.653,
    "end": 2720.503,
    "text": "And so your Cs, your preferences, are only in pragmatic value, as you mentioned earlier, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2720.939,
    "end": 2730.793,
    "text": " So whenever you aren't sure what to do, you have these competing preferences, like there's a almost like a uniform probability between them, like which one is going to win out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.873,
    "end": 2741.788,
    "text": "I'm not sure you would rely upon doing actions that involve gaining more epistemic value, like, oh, I'm going to have to spend a moment like planning and what makes the most sense here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.848,
    "end": 2748.617,
    "text": "Can I come up with a plan that helps me to like resolve some of this uncertainty going forward and do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.07,
    "end": 2754.356,
    "text": " You know, um, or maybe you have a certain belief that one of these things is just incredibly important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.557,
    "end": 2772.478,
    "text": "And so you, you stick with that one in the first place, or maybe you become conflicted not to, not to backtrack, but on the topic of psychopathology, I'd be interested to see someone just attempting to model decision-making and planning and so on in the context of someone who.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2773.083,
    "end": 2777.169,
    "text": " might have some kind of anxiety disorder, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.269,
    "end": 2788.905,
    "text": "Or in fact, maybe you have an additional emergent behavior that is spending five to 10 minutes or maybe a few hours ruminating, having issues about what to decide upon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.506,
    "end": 2792.29,
    "text": "I'll try to find it, but I found an interesting paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2792.455,
    "end": 2806.077,
    "text": " tries to get at you know modeling uh rumination in that kind of context so that those are all my comments here on the idea of like competing preferences in relationship to the mathematics yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.166,
    "end": 2809.288,
    "text": " Nice, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.328,
    "end": 2821.725,
    "text": "One other aspect, so whether it's the visual form, which is describing the sparsity of the base graph, like which nodes connect to which nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2821.845,
    "end": 2827.293,
    "text": "This is kind of like the skeleton of the model, generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.074,
    "end": 2831.018,
    "text": "This is where the time concept is embedded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.218,
    "end": 2836.806,
    "text": "This is where the action concept is embedded, sense-making concept, prior concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.452,
    "end": 2840.634,
    "text": " So it could be viewed this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.934,
    "end": 2846.682,
    "text": "And then the equations are describing like statistical operations on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.702,
    "end": 2865.207,
    "text": "And that's why it, but whatever structures proposed it to be applicable to any actual system, it's a parameterized data set, specific model, specific data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.267,
    "end": 2877.664,
    "text": " Like saying, let's imagine that childhood, just imagine the childhood experience one, two, and three are associated with cybernetic B5 or DSM, such, such, and such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.145,
    "end": 2879.647,
    "text": "Just imagine that they're that case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.667,
    "end": 2882.672,
    "text": "So what do you think about this being the case that this one's associated with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.344,
    "end": 2890.457,
    "text": " it's like, well, I don't know, you haven't specified the model or applied it to a dataset, but it's like, oh yeah, but you can like see that that would be a really important thing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.497,
    "end": 2894.704,
    "text": "It's like, okay, perhaps, but that's a purely verbal argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.884,
    "end": 2897.629,
    "text": "That's what I was referring to earlier as just speculative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.23,
    "end": 2899.593,
    "text": "And that can be an intuition pump.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.194,
    "end": 2905.403,
    "text": "And I believe sort of a lot of other functions and communication functions and other features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2905.383,
    "end": 2921.029,
    "text": " But that is not what a scientific account consists of, which is a much slower term pluralistic synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.009,
    "end": 2928.518,
    "text": " not to be like too old school on that topic, but I think it helps enable open-ended discourse, which I believe is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.319,
    "end": 2943.176,
    "text": "And when people have so many different backgrounds and familiarities, that of course everyone's going to be like thinking and saying things that we would not think and say, because we come from so many backgrounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.017,
    "end": 2947.962,
    "text": "But just what happens in a discussion around a textbook",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.942,
    "end": 2973.628,
    "text": " is not um is not it's in the continuum of communication but it's not of the type of a scientific account ajith yeah so um i have a question about something else but uh just kind of the idea that like our behavior is governed by a principle of least action so how does this affect like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2974.739,
    "end": 2984.125,
    "text": " um assumptions of like measurement independence so like some experiments uh for example like the one they use to sort of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2984.695,
    "end": 2985.556,
    "text": " even test.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2985.597,
    "end": 2987.72,
    "text": "So i'm not my background isn't physics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2987.76,
    "end": 2995.233,
    "text": "So if anyone knows, correct me if i'm wrong, but to test like bells inequality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2995.273,
    "end": 3005.591,
    "text": "There's an assumption of measurement independence that like you can actually make decisions, and it's not actually affected by sort of the environment or what's going on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3006.393,
    "end": 3009.538,
    "text": "And this is sort of a way to actually like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3009.518,
    "end": 3039.053,
    "text": " make it so you can actually test certain things and if you can assume measurement independence that kind of breaks science there are a lot of people think it breaks sort of science there so uh concepts like super determinism um is one that assumes that every sort of like behavior or action is something that uh kind of is dependent on sort of all the past states as well basically so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3039.86,
    "end": 3055.523,
    "text": " um yeah I was just wondering like I I don't know exactly how like active inference would play in that like does this go against measurement independence if it is a principle of least action because it's like going in the direction of like the most least effort basically",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3056.937,
    "end": 3075.672,
    "text": " yeah there's a ton of areas i'm not familiar with every single aspect there, this is as toby Smith Sinclair Smith called it in his recent dissertation which was a live stream 54 series he called it compositional cognitive cartography.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.204,
    "end": 3081.11,
    "text": " We're talking about maps, variational free energy, expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.13,
    "end": 3084.476,
    "text": "These are properties of maps that are human constructed and modeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.956,
    "end": 3085.918,
    "text": "Hashtag John Dewey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.278,
    "end": 3091.286,
    "text": "All of this other pragmatism and threads that are brought in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.346,
    "end": 3097.997,
    "text": "There's nothing generic to say about free energy or expected free energy, except for the truly generic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.977,
    "end": 3113.05,
    "text": " John Kane- Active ontology type expressions that's why we can like open up and have a lot of richness with the Chapter six type discussion about modeling because there's so far to go as people are encouraged to do in the textbook group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.502,
    "end": 3128.884,
    "text": " Matt Bolian- i'm in through time with just like whether you're coding is that this or that I hope we can develop better coding all these other things collaboratively anyone's welcome to do this a lot of these are questions about specific model settings and.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.904,
    "end": 3136.455,
    "text": "Matt Bolian- there's a big continuum between kind of touching the theory and touching the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.055,
    "end": 3144.784,
    "text": " But that's the inclusion that we get to cultivate with the right niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.605,
    "end": 3163.489,
    "text": "If we can create the right artifacts that support people who are different understandings, because like there's a lot of threads that were brought in relatively early in terms of like the connection to ecological psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.043,
    "end": 3180.588,
    "text": " and predictive coding, some of these things are only finding any empirical support, but with rapidly expanding amounts since like 1999 with kind of the classic Rowan Ballard type predictive coding models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.011,
    "end": 3191.485,
    "text": "So not that any given communities like acceptance of something matters or what is in the literature, because there's kind of like the timelessness of the ideas in a sense, but like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.73,
    "end": 3212.072,
    "text": " again I just there's a broad range between the mathematical and the engineering and all these other perspectives so it's very wide that's what makes it wide open in terms of like creating like oh what about accounting from this perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.381,
    "end": 3228.8,
    "text": " Jason Perez- that's those are almost always good directions to go if you're you know here and curious and what's so fun is as people continue to go deeper in their work that it can go from like kind of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.921,
    "end": 3232.204,
    "text": "Jason Perez- technologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.126,
    "end": 3237.992,
    "text": "Jason Perez- or just just just acting font ology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.002,
    "end": 3259.407,
    "text": " scaffolded to actually implemented which brings just a lot of um and entails many coats of paint and a lot of like hands-on and working with some of these questions that are that we may have surely the agent is a gendered model map territory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.099,
    "end": 3273.329,
    "text": " But then people sometimes do go beyond and go into the ontological, but that's definitely a secondary claim about a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.77,
    "end": 3278.654,
    "text": "One that might be merited or not, but it's a secondary claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.254,
    "end": 3292.347,
    "text": "To first approximation, we're just talking about the modeling apparatus that may describe something fundamental in a given system, but also literally may not, or just maybe one of many things that do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.115,
    "end": 3301.98,
    "text": " Any other thoughts or questions people have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.046,
    "end": 3311.672,
    "text": "Yeah, well, a few more things from Chapter 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.759,
    "end": 3318.141,
    "text": "And then into Chapter 4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.281,
    "end": 3321.805,
    "text": "Anyone who has read it before want to give a note on Chapter 4?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.947,
    "end": 3323.768,
    "text": "M. Carl 6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.337,
    "end": 3350.278,
    "text": " okay any other questions or or we'll end all right all right thank you see you all next time bye",
    "speaker": "SPEAKER_00"
  }
]