[
  {
    "start": 9.64,
    "end": 33.019,
    "text": " okay hello and welcome everyone to act in flap this is the act in flab live stream and i'm pretty sure we're live yes we are it's number 22.1 on may 18th 2021 and this is going to be really great discussion so i'm looking forward to it and thanks again everyone for joining live",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 34.704,
    "end": 36.505,
    "text": " Welcome to ACT-INF Lab.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 37.205,
    "end": 43.228,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 43.928,
    "end": 46.95,
    "text": "You can find us at the links that are here on this page.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 48.07,
    "end": 54.013,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 55.1,
    "end": 57.402,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 57.422,
    "end": 60.584,
    "text": "And we'll be following good live stream etiquette.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 60.684,
    "end": 61.284,
    "text": "Welcome, Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 62.065,
    "end": 68.75,
    "text": "And raising our hands to ask questions and hear from everybody because this is really going to be a special discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 70.299,
    "end": 74.521,
    "text": " We're here in paper number 22 and on May 18th today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 75.081,
    "end": 83.244,
    "text": "And next week on the 25th, we're going to be having two discussions on the paper, Psychophysical Identity and Free Energy by Alex Kiefer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 83.304,
    "end": 91.127,
    "text": "So thanks a lot, Alex, for joining us live and engaging with the .Zero video because we gained a lot as a lab working through that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 91.307,
    "end": 94.888,
    "text": "And so we're ready to take it to the next level through conversation with you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 95.769,
    "end": 96.089,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 96.109,
    "end": 96.609,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 96.963,
    "end": 99.606,
    "text": " And today we're going to be learning and discussing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 100.347,
    "end": 107.715,
    "text": "The papers link is here and the video is just us unpacking and exploring, raising questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 108.095,
    "end": 112.86,
    "text": "And we're going to be also taking notes so that in the dot two, we can be following up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 113.868,
    "end": 122.857,
    "text": " We're gonna start with some introductions just to introduce ourselves and also maybe to raise any thoughts or questions that we had at the outset about the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 122.997,
    "end": 128.562,
    "text": "So everyone can feel free to write down points or write down questions so they don't forget them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 129.623,
    "end": 139.872,
    "text": " And we're pretty much just going to jump around to any topic or question that drives us along and we'll flow with it as people join and leave.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 140.753,
    "end": 142.274,
    "text": "And there will be a follow-up discussion 22 next week.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 145.1,
    "end": 147.801,
    "text": " That brings us to the introductions and the warmups.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 148.601,
    "end": 158.865,
    "text": "So I'll start and we'll pass it around and then end up with Alex, who will provide, I think, a short introduction to the paper, and then we'll continue the discussion from there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 159.898,
    "end": 173.912,
    "text": " So I'm Daniel, I'm a postdoc in California, and something I'm excited about today was something we were just speaking about right before, was learning about a transparent code and understanding what that might mean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 174.572,
    "end": 176.074,
    "text": "I'll pass it to Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 180.553,
    "end": 181.834,
    "text": " Hello, I'm Scott David.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 182.074,
    "end": 191.64,
    "text": "I'm at the University of Washington Applied Physics Lab, where I run a program called the Information Risk and Synthetic Intelligence Research Initiative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 192.681,
    "end": 195.303,
    "text": "And I'm delighted to be here today, and I'll pass it to Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.093,
    "end": 198.034,
    "text": " Hello, I'm Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.054,
    "end": 199.255,
    "text": "I'm based in Toronto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.275,
    "end": 203.238,
    "text": "I'm doing a practice-based PhD at Canterbury Christ Church.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.578,
    "end": 212.064,
    "text": "And I'm really excited about the psychophysical areas being brought in with this process with energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 212.144,
    "end": 219.53,
    "text": "So I'm intrigued because that connects to some of the research I do with communities in their landscape and how to understand that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.59,
    "end": 220.891,
    "text": "So thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.951,
    "end": 222.492,
    "text": "And I'm going to pass it over to Alex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.595,
    "end": 225.855,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.462,
    "end": 227.182,
    "text": " Hi, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.743,
    "end": 228.743,
    "text": "I'm Alex Svyatkin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.044,
    "end": 238.93,
    "text": "I'm a researcher in Systems Management School in Moscow, Russia, and also co-organizer of Actinus Lab, and I pass it to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.512,
    "end": 242.612,
    "text": "Hi, I'm Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 242.652,
    "end": 244.433,
    "text": "I'm up here in Calgary, Canada.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 244.453,
    "end": 248.296,
    "text": "I'm retired, and I just try to keep up with everybody here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 249.036,
    "end": 249.717,
    "text": "I'll pass it to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 250.638,
    "end": 257.258,
    "text": " our special guest today alex is dave um no david has left sorry okay continue okay",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 258.53,
    "end": 258.97,
    "text": " Hey, thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 259.411,
    "end": 260.392,
    "text": "I'm Alex Kiefer.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 261.012,
    "end": 265.316,
    "text": "I'm a researcher in philosophy and cognitive science, and I do some modeling as well.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 265.596,
    "end": 268.058,
    "text": "I have an affiliation with Monash University.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 269.019,
    "end": 279.308,
    "text": "Currently, also, a lot of my time is devoted to working for Nested Minds Solutions, which is an enterprise started by Maxwell Ramstad and some other people.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 281.37,
    "end": 284.712,
    "text": "Just recently, we've already got a lot of work under our belt.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 286.104,
    "end": 288.425,
    "text": " So I'm really happy to be here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 288.825,
    "end": 289.926,
    "text": "Thanks for having me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 289.966,
    "end": 291.927,
    "text": "This is, I think, going to be a really fun discussion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 294.648,
    "end": 294.888,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 295.569,
    "end": 306.494,
    "text": "Maybe just while the other participants are preparing a thought or a question to lead off, Alex, just how did you come to writing this single author paper?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 306.914,
    "end": 309.275,
    "text": "What in your path led you to write it this way?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 310.496,
    "end": 310.956,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 310.976,
    "end": 311.016,
    "text": "So...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 313.573,
    "end": 320.175,
    "text": " So this is an idea that I think first sort of came up for me in 2015 or so.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 322.835,
    "end": 338.239,
    "text": "So I've been fascinated by this formal analogy between optimization and processes in thermodynamics and physics for a long time since, well, not that long, maybe 2012, 2013, when I started getting into the neural net literature on Holmes machines and things like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 340.819,
    "end": 348.105,
    "text": " So I think this analogy between physics and optimization has been tempting for a lot of people to want to collapse these.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 348.165,
    "end": 359.513,
    "text": "And this is something that people like my friend Mel Andrews constantly warn against, is just taking the physical informational description of a system to be the same as its physical description.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 359.914,
    "end": 363.136,
    "text": "But I thought that there was a compelling argument to be made here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 363.296,
    "end": 367.139,
    "text": "So I wanted to actually articulate, not necessarily endorse, and I think",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 368.339,
    "end": 390.74,
    "text": " the way I catch things in the paper is a bit cautious on this, but I wanted to articulate what is the most sort of, the simplest, most kind of perhaps radical perspective one could take on this, the relationship between the cognitive dynamics and the physical dynamics that you might be able to defend, right, from a sort of free energy principle-ish perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 392.05,
    "end": 401.154,
    "text": " So I wanted to just lay that one way of understanding this relationship out that was as clear as possible.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 402.574,
    "end": 406.616,
    "text": "I think in the process, I ended up writing a paper that many people find to be quite complicated.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 406.716,
    "end": 409.157,
    "text": "So this was supposed to be an exposition of a simple idea.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 409.757,
    "end": 411.198,
    "text": "So maybe we can see if we can get back to that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 413.576,
    "end": 413.856,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 414.437,
    "end": 416.919,
    "text": "So anyone can raise their hand and we'll just start.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 417.039,
    "end": 420.182,
    "text": "But I really liked how you said articulate, but not endorse.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 420.822,
    "end": 425.146,
    "text": "You've put out an artifact for us to interact with and to explore.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 425.726,
    "end": 431.111,
    "text": "And you have framed the psychophysical identity thesis as a hypothesis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 431.531,
    "end": 436.615,
    "text": "So it's something that evidence can now be used to support or to disprove.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 437.096,
    "end": 439.117,
    "text": "And that's sort of a nice example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 439.918,
    "end": 443.762,
    "text": " piece of work that now obviously we have started a discussion around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 444.342,
    "end": 447.866,
    "text": "So we'll go to Stephen and then Scott and then anyone else with a raised hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 449.994,
    "end": 458.321,
    "text": " Yeah, one thing I like about what you're doing here is you're sort of bringing it into the domains where the action is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.501,
    "end": 463.626,
    "text": "It's a bit like most of the physics around thermodynamics is really often used in chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.866,
    "end": 467.949,
    "text": "And a lot, like Niels Bohr was actually a chemist, wasn't a physicist per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.01,
    "end": 468.79,
    "text": "He used physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.411,
    "end": 471.232,
    "text": "So there's an interesting thing about how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.25,
    "end": 496.404,
    "text": " these areas get transposed over, you know, and maybe layered again to biochemistry, which maybe is trying to look at the mechanisms that sit on that and X, Y, Z. So I think that's quite relevant to some of the questions we've been wrestling with, with what happens when things start to transition to the ontology, like, and how can you keep a handle on that when you've got people from different backgrounds?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.484,
    "end": 498.585,
    "text": "So I think that's quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.325,
    "end": 500.625,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 500.845,
    "end": 504.187,
    "text": "Thank you, Steven, Scott, and then anyone else with a raised hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 506.228,
    "end": 513.653,
    "text": "Yeah, I'd like to just ask about your having written the paper and now contemplated it, discussed it with folks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 515.754,
    "end": 527.161,
    "text": "What's your impression of the role of the observer of difference, of gaps, of differences in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.576,
    "end": 555.389,
    "text": " identifying sources of free energy um exploitable sources let me let me back up one i did a paper in a presentation in um uh mit in 2013 called entropy accounting and i asserted that carnot's equation the hot and cold differentials that are reflected there are the same as arbitrage equations in markets",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.777,
    "end": 568.205,
    "text": " And I asserted that heat engines were produced by the human mind observing an attribute because it didn't matter that we thought we had a flow of caloric and it was flowing downhill.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 568.446,
    "end": 578.913,
    "text": "Actually, the notion of flow was what we asserted in order to convert random heat, random motion of particles, which we really only use for warmth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 580.254,
    "end": 585.818,
    "text": "Being able to put that into a cylinder, a combustion chamber, and then perform work took thousands of years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 587.395,
    "end": 596.691,
    "text": " I wonder if you could comment on it feels like we're using information like the cavemen as per warmth and not yet putting it in a combustion chamber.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 598.064,
    "end": 607.227,
    "text": " And the combustion, is it the fact that the processes where differentials are captured, exploited, utilized?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 607.327,
    "end": 608.628,
    "text": "I'm not sure what word to use here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 609.468,
    "end": 611.609,
    "text": "Is that like a reaction chamber?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 611.709,
    "end": 624.614,
    "text": "Are we reacting observations and data into inference in these reaction chambers of mind, similar to the differentials that we exploit in a heat engine for work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 624.674,
    "end": 625.054,
    "text": "Are we able to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.819,
    "end": 627.7,
    "text": " to capture, what are the devices of capture?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 627.84,
    "end": 632.963,
    "text": "Sorry for the long question, but your hand on your chin makes me think that maybe it's an intriguing question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.404,
    "end": 635.265,
    "text": "It's definitely intriguing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 635.285,
    "end": 638.107,
    "text": "I probably can't do justice to it, but I'll try.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 638.127,
    "end": 654.877,
    "text": "So just on the last point, I guess I think that the, well, actually, so first to take your question about information, whether we're using it, sort of like whether we're really exploiting it",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 655.603,
    "end": 679.781,
    "text": " up to its maximum possibilities right as information or just or just treating it as sort of you know uh something like warmth a source of warmth i mean i i take it that insofar as we're using information so i i right so it gets to the heart of my perspective into this perspective of this paper i guess so i said i floated this thesis as a possibility but i i do",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 681.294,
    "end": 690.96,
    "text": " kind of have some sort of deep-seated conviction that information can always be looked at sort of in terms of what it represents and physically, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 690.98,
    "end": 692.281,
    "text": "So any process of information",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 693.742,
    "end": 700.969,
    "text": " information is literally a process of physical change as well as a process of some system coming to know something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 701.75,
    "end": 711.599,
    "text": "So to take the etymology and just go back to Shannon's original framing, information is just the amount by which someone or something has been informed, in my view.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 712.02,
    "end": 716.944,
    "text": "So I think insofar as we're treating something as information, we are using it as information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 717.845,
    "end": 742.038,
    "text": " um right it's not now i don't know what the now maybe i'd love to hear more from you on this i don't know what the analogy would be to using information just as heat is it like we're aware of something but we're not really doing anything with it like in terms of inference or uh so so i guess my my view is that we are insofar as we're thinking and exploiting information sources for inference we're using it to its um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 743.177,
    "end": 748.598,
    "text": " maybe not maximally efficiently always, but we're using it in a way that's intelligent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 748.778,
    "end": 750.199,
    "text": "But just one more point on this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 752.219,
    "end": 769.163,
    "text": "The analogy to combustion engine, the idea of, I guess my thesis here is that any time we're performing an inference, any systems performing an inference, the physical aspect of that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 770.455,
    "end": 773.562,
    "text": " is something like, right, it is an actual physical reaction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 773.602,
    "end": 779.837,
    "text": "So there is always something that has precisely that nature behind any use of information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 781.122,
    "end": 785.344,
    "text": " But I think everything I just said sounds to me completely trivial as I'm saying it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 788.125,
    "end": 788.945,
    "text": "That's its power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 790.266,
    "end": 792.427,
    "text": "Yeah, Scott, what did you mean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 792.707,
    "end": 799.71,
    "text": "We can unpack that because it's known that heat is not just simply wasted, but where there's a heat differential, there can be work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 800.27,
    "end": 808.173,
    "text": "And potentially when there's an information differential, there can be an analogy to physical work, but in the informational regime.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 808.253,
    "end": 810.514,
    "text": "So what motivates that line of thinking for you?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 810.894,
    "end": 826.748,
    "text": " Yeah, and again, I'll send around the slides from 2013, but the idea was that it is not by analogy, it really is a capturing by the mind of an attribute of a system, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.768,
    "end": 834.515,
    "text": "You look at a block of iron, it has spin, it has temperature, it has color, there's all sorts of dimensions that it has that are unexploited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.665,
    "end": 841.87,
    "text": " And then we can look at them and exploit them for different, you know, magnetism with spin and then temperature or electronic electrons flow through iron.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.89,
    "end": 843.411,
    "text": "Same block iron is just sitting there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.851,
    "end": 845.132,
    "text": "But you measure different attributes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 845.172,
    "end": 848.294,
    "text": "And as you measure different attributes, you measure them into existence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.394,
    "end": 850.195,
    "text": "And that existence then can be exploited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.236,
    "end": 852.337,
    "text": "And so we did that with heat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 852.557,
    "end": 852.737,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 852.877,
    "end": 854.318,
    "text": "They thought that heat was caloric.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 854.338,
    "end": 855.539,
    "text": "They actually thought it was a fluid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.38,
    "end": 856.58,
    "text": " Right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 857.541,
    "end": 865.146,
    "text": "But then the guy who was the cannon borer, I forget which one, the guy who bored the brass cannons, he said, wait a second, it can't be a fluid because it's unlimited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.306,
    "end": 866.867,
    "text": "It's a quality of the material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.148,
    "end": 875.112,
    "text": "So I think what we're talking about in information, it's a quality not of the brain, it's a quality of the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 876.113,
    "end": 878.554,
    "text": "And the differential between the brain and the mind",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.452,
    "end": 882.753,
    "text": " There's a mind out there to be learned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 882.974,
    "end": 886.336,
    "text": "Let's call it an environment if it's animals, but if it's humans, it also involves language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 886.836,
    "end": 888.097,
    "text": "And when you're born, you don't know it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.677,
    "end": 889.577,
    "text": "And then you go learn it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.198,
    "end": 892.479,
    "text": "So your brain has to get tuned into the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 892.879,
    "end": 895.301,
    "text": "So to me, the mind is our combustion chamber.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.351,
    "end": 897.592,
    "text": " And you've got to learn the combustion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 897.632,
    "end": 904.117,
    "text": "Now, if you learn different things, if I'm a hunter-gatherer, I'm going to learn different things in my environment to combust.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.697,
    "end": 908.92,
    "text": "I'm going to have different cues, and I'm going to say, wow, this is relevant for me because I've got to do this and this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.4,
    "end": 914.104,
    "text": "So we train, I think, we train our combustion chamber.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 914.324,
    "end": 915.204,
    "text": "It's symbolic, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 915.284,
    "end": 924.411,
    "text": "And so we're training this thing in which to contain the differential accomplishment of the active inference, the Bayesian accomplishment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 925.239,
    "end": 926.32,
    "text": " And then we train.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.36,
    "end": 927.941,
    "text": "So it was an article in just the last thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.001,
    "end": 929.402,
    "text": "I'll shut up for a minute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 930.002,
    "end": 932.044,
    "text": "It was an article in Nature magazine a couple of years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 932.084,
    "end": 935.987,
    "text": "They said less than 12 month old human infants learn in a Bayesian way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.087,
    "end": 943.972,
    "text": "If you point to it, if you tell a baby a horse has four legs, the baby will point to a table, a coffee table and say horsey.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 944.552,
    "end": 945.073,
    "text": "Then you say no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 949.577,
    "end": 967.314,
    "text": " scott just disappeared it was too much of a truth drop with the table and the legs so steven to you and we'll return to scott when we can they freeze sorry okay scott's back anyway continue with okay continue from the table",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 969.878,
    "end": 972.34,
    "text": " Yeah, anyway, it's Bayesian, the Bayesian accumulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 972.36,
    "end": 975.303,
    "text": "You point to a table, then you say, no, it has to have hair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 975.363,
    "end": 976.944,
    "text": "They'll point to a dog and say horsey.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 976.984,
    "end": 978.645,
    "text": "Then you say, no, it has to have a mane.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.665,
    "end": 979.906,
    "text": "They'll point to a horse and say horsey.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 979.926,
    "end": 984.11,
    "text": "So it's a Bayesian, the article was about Bayesian assembly of human knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 984.891,
    "end": 991.936,
    "text": "And so what if the baby is not really assembling knowledge, but just tuning their brain into the mind and the mind's a combustion chamber.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 992.177,
    "end": 995.7,
    "text": "And the mind we teach, we have to learn the mind because that's the useful combustion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 995.74,
    "end": 996.881,
    "text": "We've already designed this brain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 998.632,
    "end": 1004.681,
    "text": " community mind to navigate space and we teach it to our offspring in order to make them more fit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.061,
    "end": 1005.482,
    "text": "Anyway else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.664,
    "end": 1006.924,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1007.244,
    "end": 1007.685,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1009.007,
    "end": 1010.149,
    "text": "Any thoughts on that, Alex?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1011.601,
    "end": 1012.361,
    "text": " Well, it's interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1012.441,
    "end": 1024.163,
    "text": "I don't know if I completely understand the way Scott's using the term mind here, but I think I kind of can see how something that deserves to be called the mind would emerge through this sort of learning process, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1024.203,
    "end": 1030.465,
    "text": "So I guess there's a trivial sense, I think, in which anything that has energetic properties has a mental side.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1030.885,
    "end": 1032.885,
    "text": "That's kind of what I'm saying in the paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1034.205,
    "end": 1035.165,
    "text": "But it's trivial.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1035.325,
    "end": 1037.966,
    "text": "And if you want something that really functions cognitively,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1038.456,
    "end": 1046.359,
    "text": " then you need to have internalized a lot of these regularities through the sorts of learning and inference schemes that we're all familiar with here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1046.439,
    "end": 1055.422,
    "text": "So if that's what you mean by learning the mind, I think, Scott, you analogized it to the environment at some point, or maybe it's more than an analogy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1056.543,
    "end": 1061.685,
    "text": "It's like the data, the source of the data, sensory data that you're interpreting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1063.165,
    "end": 1065.346,
    "text": "So yeah, I think it's a cool idea.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1066.462,
    "end": 1066.682,
    "text": " Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1067.002,
    "end": 1068.704,
    "text": "Stephen, welcome Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1069.565,
    "end": 1074.109,
    "text": "Stephen with a question and then anyone else with a question or Blue, you can say hello.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1075.984,
    "end": 1085.913,
    "text": " Yeah, one question I'd be interested in is, do you see maybe more than one type of information processing that maybe happened at different levels?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.213,
    "end": 1095.502,
    "text": "So maybe you've got because we've had people talking, say, at the quantum level, which could be happening, particularly, say, the photons coming in with the iris and things going up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.542,
    "end": 1100.747,
    "text": "And then you've got other levels where you've got these steady states going at different levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.107,
    "end": 1129.414,
    "text": " rates and then you've got some of the things you're talking about where maybe it goes into this sense of a a more averaged closed mind idea which would have to be somehow created maybe because the dynamical nature of the data and the noise is not necessarily exactly how it is when it first arrives at the organism but maybe you're you're bringing back some of that more averaged out heat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.675,
    "end": 1150.668,
    "text": " ideas um around how energy can be averaged over time in in some sort of heat form is that would that be accurate um i'm not sure about the heat piece i'm just genuinely not sure we can talk more about it but like as far as multiple types of information processing i mean i think that's",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1151.738,
    "end": 1165.527,
    "text": " Definitely what's happening in the brain, of course, there's all this literature on multi-scale active inference and stuff, which my paper isn't directly about active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1165.827,
    "end": 1169.869,
    "text": "So we tend to signal out certain processes in the brain as like processing information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1170.149,
    "end": 1177.814,
    "text": "But really, that's going on on fine grade levels and on larger scales, as you say.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1179.943,
    "end": 1182.384,
    "text": " I think we tend to just pick out one piece to analyze at a time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1182.404,
    "end": 1189.526,
    "text": "I guess the part of the question I don't know how to answer is, what are the types of information processing in question?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1189.626,
    "end": 1194.827,
    "text": "So I guess I'm skeptical of that type distinction, not against it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1194.847,
    "end": 1197.768,
    "text": "I'm just not sure what kind of types we have in mind.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1200.369,
    "end": 1203.372,
    "text": " Definitely, I think there's a role for averaging.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1203.773,
    "end": 1208.257,
    "text": "Even if we just stick to neurons and don't worry about underlying chemistry or physics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1208.477,
    "end": 1217.026,
    "text": "It can't just be that one neuron firing represents your grandmother, because then if that neuron's shot, then you can't represent your grandmother.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1217.386,
    "end": 1219.548,
    "text": "So I think there has to be a...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1221.027,
    "end": 1230.874,
    "text": " if we want to associate content with brain states, for example, those states are going to have to be couched at the level of averages in some sense, or some kind of statistical property.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1231.795,
    "end": 1242.463,
    "text": "And I think that comes out clearly also in the work that Carl Friston and Vanya and others have done on the whole Markovian monism idea.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1242.603,
    "end": 1244.264,
    "text": "So they talk about the fact that it's",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1246.005,
    "end": 1254.471,
    "text": " You know, it's not individual brain states that encode information on their view, it's the mean of the distribution, conditional distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1254.931,
    "end": 1259.674,
    "text": "Anyway, going a bit into the weeds on this, but I do think that that's important.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1260.415,
    "end": 1261.756,
    "text": "Heat, I don't know, let's talk more about it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1262.356,
    "end": 1262.576,
    "text": " Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1263.257,
    "end": 1268.06,
    "text": "Keith, we had the what is temperature slide, which I'll just switch to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1268.1,
    "end": 1269.521,
    "text": "Yeah, wait, Stephen, do you have any other thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1269.542,
    "end": 1270.822,
    "text": "No, go to that slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.963,
    "end": 1278.888,
    "text": "And maybe just following from that is maybe something about the mind and the level of the psychophysical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.149,
    "end": 1283.252,
    "text": "Maybe actually the mind is kind of a psychophysical level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.039,
    "end": 1294.294,
    "text": " We think of it as a brain level, but maybe what you're pointing to is something a bit more of a dynamic, which is kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.864,
    "end": 1295.084,
    "text": " Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1295.784,
    "end": 1300.427,
    "text": "I mean, I generally... Sorry, I generally have trouble seeing distinctions between levels.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1302.207,
    "end": 1307.19,
    "text": "So maybe that's what... You all could help point out why these things are not the same.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1308.27,
    "end": 1308.97,
    "text": "It would help me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1309.471,
    "end": 1309.971,
    "text": "Go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1310.211,
    "end": 1314.413,
    "text": "Hence the psychophysical identity thesis paper that you wrote.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1314.493,
    "end": 1314.693,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1315.193,
    "end": 1323.057,
    "text": "Because that's the entire topic of this discussion is what are those relationships and are they like each other or are they...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1324.572,
    "end": 1325.754,
    "text": " Are they isomorphic?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1325.774,
    "end": 1326.575,
    "text": "Are they one and the same?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1327.156,
    "end": 1329.979,
    "text": "So here on this temperature slide,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1330.839,
    "end": 1353.629,
    "text": " you wrote about how increases and decreases in temperature change the variance of distributions so maybe just what is temperature or in this psychophysical identity mapping what does temperature reflect because changing the temperature on the brain you're not just talking about going into a warmer room you're talking about something related to inference so what is happening there well",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1354.918,
    "end": 1355.118,
    "text": " Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1355.198,
    "end": 1368.766,
    "text": "I mean, I guess I am saying like, look, if you change the temperature in the room and that ends up changing the temperature of the brain, then it's kind of an implication of the thesis that you are changing the temperature of your statistical model as well to some degree.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1368.786,
    "end": 1368.986,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1369.106,
    "end": 1382.833,
    "text": "Probably usually to an imperceptible or insignificant degree when something like walking into a different room because the brain has its own internal homeostasis and it's not like we're going to drastically directly affect the brain's internal temperature.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1384.494,
    "end": 1386.636,
    "text": " by changing the room temperature one degree.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1386.876,
    "end": 1405.431,
    "text": "But I really am speculating, or I'm considering the consequences of, I mean, the overall theme here, and temperature is a special case, but the overall theme is that anything that you want, so any of the terms in the Helmholtz free energy from thermophysics, from thermodynamics,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1407.682,
    "end": 1417.714,
    "text": " should directly this is a transparent encoding idea should directly sort of be reflected in the cognitive dynamics and so that cognitively speaking what temperature means",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1418.806,
    "end": 1426.072,
    "text": " like it says here, is just temperature parameters in models, neural network models, and other sorts of models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1427.053,
    "end": 1430.796,
    "text": "I think I've heard this referred to in the active inference literature as the shaky hand parameter.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1431.557,
    "end": 1433.278,
    "text": "So it's like you're reaching for something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1433.298,
    "end": 1438.963,
    "text": "If you increase the temperature parameter, there's less certainty in exactly where the motor system will end up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1439.343,
    "end": 1442.125,
    "text": "So that's what it means cognitively speaking.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1442.966,
    "end": 1446.469,
    "text": "Or if you don't want to call low-level motor control cognitive, then",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1447.189,
    "end": 1456.452,
    "text": " In terms of these models of organisms, what it means is literally just the variability of the distribution, the variance.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1458.773,
    "end": 1468.277,
    "text": "I guess what I'm saying is, yes, I think if this thesis is true, then what encodes that is the actual temperature of the system that implements the model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1469.997,
    "end": 1471.158,
    "text": "Very interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1471.298,
    "end": 1471.658,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1471.878,
    "end": 1474.379,
    "text": "We'll go to Blue, and then Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1477.5,
    "end": 1478.961,
    "text": " Good morning, I'm Blue Knight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1479.021,
    "end": 1481.822,
    "text": "I'm a research consultant based out of New Mexico.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1481.842,
    "end": 1483.803,
    "text": "And I really enjoyed this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1483.883,
    "end": 1490.726,
    "text": "I really enjoyed the possibility of having a way to separate the mind from simulations of the mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1490.866,
    "end": 1495.668,
    "text": "I think that that's a really relevant and pertinent idea to put forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1496.848,
    "end": 1501.931,
    "text": "But so in relevance to temperature, and this is gonna like totally throw what I just said out the window.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1503.271,
    "end": 1506.853,
    "text": " You know, I dabble a little bit in retail investing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1506.893,
    "end": 1513.917,
    "text": "And so like the day before or like maybe in the morning, you might like what's called take the temperature of the market, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1514.297,
    "end": 1521.782,
    "text": "So you see kind of as things going up or things going down, like you just kind of put your feelers out there and take the temperature of what the market's going to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1522.402,
    "end": 1530.666,
    "text": "So I just wonder in terms of cognition, in terms of active inference, if there's a way to like take the temperature in maybe like more of a...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1532.344,
    "end": 1534.489,
    "text": " of a metaphorical sense, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1534.509,
    "end": 1535.591,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1540.321,
    "end": 1540.862,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1543.908,
    "end": 1546.169,
    "text": " So I can elaborate a little bit more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1547.15,
    "end": 1552.092,
    "text": "In the political system, we get a temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.332,
    "end": 1557.055,
    "text": "Is this a liberal environment, or is it a more conservative environment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.195,
    "end": 1559.996,
    "text": "And that might influence our actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.036,
    "end": 1566.139,
    "text": "The active inference loop might be influenced by the perception of temperature in the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1567.6,
    "end": 1567.78,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1568.877,
    "end": 1571.438,
    "text": " So, yeah, I mean, first of all, hi.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1571.658,
    "end": 1572.338,
    "text": "Thanks for joining.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1573.418,
    "end": 1578.199,
    "text": "You and Dean and Daniel, I really enjoyed your discussion in point zero.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1578.239,
    "end": 1585.661,
    "text": "And it made me excited to talk about it today because it's cool just how many different questions or, you know, anyway, whatever.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1585.721,
    "end": 1586.001,
    "text": "It's cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1586.461,
    "end": 1590.603,
    "text": "So, I mean, sure, you could use temperature in a metaphorical way as well.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1590.683,
    "end": 1595.424,
    "text": "Like, I think, like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1596.863,
    "end": 1598.589,
    "text": " I guess in this paper, I tend to like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1600.868,
    "end": 1606.051,
    "text": " I tend to assume that when people, that metaphors are not metaphors, but identities, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1606.151,
    "end": 1610.373,
    "text": "As the ground level assumption, and then see where that you're forced to distinguish between them.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1610.894,
    "end": 1625.062,
    "text": "So like, if we're talking about, again, if we're talking about a model of motor control where you're literally reaching for something, then I think in that case, it's plausible that there's some relationship between the actual temperature of the pieces of the system that are driving the motion and the temperature parameter in the model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1625.462,
    "end": 1626.863,
    "text": "But like, if you're talking about something like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1627.711,
    "end": 1635.393,
    "text": " taking the temperature of the market or the political, there still might be partial mappings there, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1636.794,
    "end": 1647.997,
    "text": "But if you're defining some arbitrary dimension, so if the temperature politically means one side of the scale is conservative and the other side is liberal, then I wouldn't expect that there'd be some physical component to that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1650.612,
    "end": 1671.907,
    "text": " But the same way that your paper was, as you said, just putting it out there, not endorsing the psychophysical identity, it's almost like an econophysical identity thesis would be asking whether the thermo-like dynamics of markets actually have some sort of mapping that's more than a metaphor, but it's something that can be stated and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1672.788,
    "end": 1680.993,
    "text": " blanketed or boxed off, and then can be understood as being adequate in certain situations, but maybe inadequate in other situations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1681.053,
    "end": 1689.657,
    "text": "But when we talk about the market heating up, people know what that means in a way where, you know, the market feeling happy doesn't really capture it heating up or cooling down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1690.078,
    "end": 1692.559,
    "text": "So Scott, and then anyone else with a raised hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1695.302,
    "end": 1698.144,
    "text": " Oops, I'm not sure if I should try to share my screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.184,
    "end": 1700.126,
    "text": "I may just screw up, so let's not do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.526,
    "end": 1702.087,
    "text": "So I just pulled up my slides from 2013.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.928,
    "end": 1707.811,
    "text": "And so I said, under the first law of thermodynamics, temperature has two roles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.972,
    "end": 1718.299,
    "text": "First, from the perspective of a party outside the system, temperature tells whether two or more systems are in thermal equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1719.2,
    "end": 1721.662,
    "text": "Same temperature equals equilibrium, OK?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1722.304,
    "end": 1732.252,
    "text": " From the perspective of a molecule in this system, temperature tells about the distribution of various molecules in the system over the possible energy states, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.673,
    "end": 1737.237,
    "text": "The higher temperature equals a broader distribution of molecules in different states and a higher Boltzmann distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.077,
    "end": 1748.326,
    "text": "So what I'm asserting in this context, in the context of those earlier slides, was analogously here, are we looking within this system of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.986,
    "end": 1754.159,
    "text": " cognitive system and the dynamics of components within it or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.109,
    "end": 1758.091,
    "text": " vis-a-vis an outside voice for that system?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1758.131,
    "end": 1773.121,
    "text": "I think that's a relevant question here because when we're talking about the first law in here, we don't, we have, this is, Maxwell's demon is actually a person now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1774.382,
    "end": 1776.183,
    "text": "Sorry, that obscure reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1776.423,
    "end": 1782.647,
    "text": "But Maxwell's demon was a convention to fuss with the second law of thermodynamics, a gating function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1784.0,
    "end": 1792.99,
    "text": " And now we actually have the notion of what does a molecule in the system think, in a sense, is what I'm inviting here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1793.49,
    "end": 1798.576,
    "text": "And so I think the assertion certainly I make in that context is we can capture",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1799.617,
    "end": 1828.819,
    "text": " either one of those dynamics and it's info dynamics you're not thermodynamics is what i call it but essentially first law tells you about interoperability is what my assertion is because you can have equilibrium in a symbolic way i assert is the equivalence of interoperability symbolic and so that's when you can have a meeting of the minds and you can have shared consciousness society shared language all that kind of stuff is my notion of where the first law takes you thanks",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.848,
    "end": 1831.848,
    "text": " That's very intriguing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1832.329,
    "end": 1835.91,
    "text": "I need to read your work on this, please.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1835.93,
    "end": 1846.435,
    "text": "I mean, not to give a too hand-wavy an answer, but I think since we're dealing with multiple scales here, we could talk about neurons performing active inference, people doing it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1846.896,
    "end": 1851.178,
    "text": "I think both of those uses of temperature are relevant.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1855.768,
    "end": 1859.329,
    "text": " Yeah, we'll get to Steven, but maybe just a general question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1859.59,
    "end": 1863.191,
    "text": "Where does active inference come into play and how does it come into play?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1863.211,
    "end": 1865.513,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1865.733,
    "end": 1866.213,
    "text": "So, right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1868.752,
    "end": 1871.974,
    "text": " you guys raised in the point zero that I didn't really talk about active inference that much.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1872.134,
    "end": 1874.435,
    "text": "In fact, I only referenced the literature on active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1876.016,
    "end": 1877.676,
    "text": "So this is, yeah, it's interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1877.696,
    "end": 1879.357,
    "text": "So this paper isn't really about active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1879.517,
    "end": 1882.019,
    "text": "It's not really directly about the FVP either.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1882.199,
    "end": 1883.96,
    "text": "So thank you for having me despite that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1885.42,
    "end": 1890.743,
    "text": "But it's, I mean, obviously it's in the very core, it's concerned with the same core issues, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1890.943,
    "end": 1891.103,
    "text": "But...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1893.084,
    "end": 1908.274,
    "text": " I don't want to take us on this if it's a tangent, but the reason that I don't write about active infants that much is that I think from a high enough or meaning abstract enough point of view, you don't need, I don't know that there's really a difference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1908.574,
    "end": 1919.041,
    "text": "To me, active infants kind of relates to this stuff the way that Dawkins' extended phenotype proposal relates to more traditional ways of thinking about evolution and genetics in that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1919.437,
    "end": 1920.218,
    "text": " It's a new paradigm.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1921.019,
    "end": 1930.071,
    "text": "But I don't think that there's a system that you can describe using active inference that you couldn't also describe using, say, traditional representationalist terminology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1930.171,
    "end": 1932.795,
    "text": "So that's obviously controversial, and we could talk about it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1935.137,
    "end": 1945.763,
    "text": " Insofar as you're concerned with analyzing or designing a system, even if you want to write an active inference agent as a model, you only have control over its internal states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1946.423,
    "end": 1947.543,
    "text": "You can't directly control.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1947.563,
    "end": 1948.424,
    "text": "Yes, it optimizes",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1950.985,
    "end": 1975.379,
    "text": " its situation by acting and intervening on the environment but you can't directly control how the intervention on the environment plays out you can only control the expectations for sensory data given that you've acted in such a way and so um that's why i tend to just default to you know it's what jerry fodder called methodological solipsism right which is a very different perspective from what people i think",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1976.219,
    "end": 2003.438,
    "text": " i love to talk about this maybe maybe they're more similar than i think too but um anyway so so uh like active inference is great i think in fact it leads to new ideas for technology and new models just because it's a different way of thinking about things but when you're doing like philosophical analysis like this um i don't find that it's for me often necessary to think in those terms but i would love for someone to point out something that i'm missing by not doing that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2005.063,
    "end": 2016.446,
    "text": " Well, what we love here in the Active Lab is hearing everyone's perspective on active inference and also adjacencies and synonyms and other languages and other ways of expressing it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2016.586,
    "end": 2018.387,
    "text": "So thanks for sharing it the way you did.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2019.287,
    "end": 2020.968,
    "text": "Stephen, if you wanted to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2020.988,
    "end": 2022.508,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.168,
    "end": 2023.628,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.128,
    "end": 2030.63,
    "text": "So building on that, you mentioned the Helmholtz free energy rather than the Gibbs free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.69,
    "end": 2032.591,
    "text": "So you sort of, the broader sort of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.726,
    "end": 2034.867,
    "text": " energy that's available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.929,
    "end": 2044.593,
    "text": "I suppose a question I've got here is, actually, go back to that diagram just one sec with the distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.653,
    "end": 2053.198,
    "text": "There you've got both the difference in the size of the distribution for the different size molecules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.039,
    "end": 2060.043,
    "text": "But you've got the average speed is higher for hydrogen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.109,
    "end": 2064.156,
    "text": " but yeah, hydrogen or oxygen it's, it's faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.757,
    "end": 2067.644,
    "text": "It's the speed is faster for something that's lighter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.704,
    "end": 2070.009,
    "text": "And that may have an impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.945,
    "end": 2076.75,
    "text": " at the local level when the actual atoms are hitting each other at the same temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.23,
    "end": 2082.354,
    "text": "But when you take the average, it's all around the same energy, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.894,
    "end": 2098.006,
    "text": "So I just wondered if there's any particular sort of relationship to the way that the speeds are happening and the way that might change something at a certain scale and just Helmholtz and Gibbs free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.092,
    "end": 2101.932,
    "text": " Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2102.373,
    "end": 2116.359,
    "text": "So to be honest, I mean, the reason I write about Helmholtz free energy is just because it's the thing that Jeff Hinton and others used when setting up things like the Helmholtz machine.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2117.059,
    "end": 2120.181,
    "text": "The Gibbs free energy, I'm just less familiar with.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2120.441,
    "end": 2122.742,
    "text": "It adds complications that I thought weren't relevant.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2122.782,
    "end": 2125.023,
    "text": "But if they are relevant, then let's talk about it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2126.841,
    "end": 2128.762,
    "text": " Yeah, could we maybe hear a little bit from you?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2128.862,
    "end": 2137.145,
    "text": "Just what is free energy in the senses that you used it, or how would you describe it to somebody who might be not very familiar with thermodynamics?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2138.325,
    "end": 2138.565,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2139.586,
    "end": 2140.726,
    "text": "Someone such as me, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2141.106,
    "end": 2151.37,
    "text": "So what I would say is, well, I mean, I'm a philosopher, but so free energy in the physical and thermodynamic sense, as I understand it, again, welcome, I welcome any",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2152.998,
    "end": 2153.981,
    "text": " hangs in the other direction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2155.003,
    "end": 2161.26,
    "text": "But as I understand it, it's just the energy that's available for doing work",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2161.86,
    "end": 2162.941,
    "text": " in the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2162.981,
    "end": 2183.2,
    "text": "So it's the internal energy, all the energy that the system harbors just in virtue of its configuration, its existence at that moment, minus all of the energy that's not usable because it's tied up with this disorder with entropy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2186.167,
    "end": 2193.029,
    "text": " So I'm sure that someone else here could maybe articulate that more gracefully than I just did, but that's the one term.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2193.549,
    "end": 2201.491,
    "text": "And the other term in the equation here is the variational free energy, which is just the difference between the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2205.046,
    "end": 2215.779,
    "text": " basically the generative model or the joint distribution that defines the system's generative model of some kind of statistical model, right, more generally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2216.5,
    "end": 2219.584,
    "text": "And the approximation to it",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2220.393,
    "end": 2223.234,
    "text": " that you've arrived at at a particular time step, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2223.274,
    "end": 2242.402,
    "text": "So if you're doing variational inference, you're trying to fit this Q distribution, which, I mean, you know, people, this has been talked about ad nauseum, so it's hard for me to get the energy to really launch into it, because I feel like we all are familiar with this concept, but it's just the difference between the approximating distribution, the recognition distribution or density, and the generative density.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2243.837,
    "end": 2251.002,
    "text": " So I guess the thing to underline there is that it's only defined in terms of these P's and Q's, Q recognition, P generative.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2251.482,
    "end": 2255.645,
    "text": "They're defined in terms of the generative model, which is a model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2256.565,
    "end": 2264.05,
    "text": "It's a mapping between hypotheses or hidden states and outcomes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2265.011,
    "end": 2269.194,
    "text": "So there's obviously no a priori connection between that and thermodynamics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2271.549,
    "end": 2281.115,
    "text": " So it's just important to keep in view that one of these is, in terms of how it's defined, is thoroughly cognitive, has to do with belief updating, and the other has to do with the physical states of the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2282.496,
    "end": 2294.704,
    "text": "And that mapping between the cognitive and the inferential and the physical is, again, the entire discussion and the entire point of putting out an artifact that is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2295.609,
    "end": 2307.763,
    "text": " critiquable or is extendable in the ways that you made it so scott then steven and then also anyone else who's watching live can just put a live chat in and we'll ask the question so scott and then steven",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2308.843,
    "end": 2311.664,
    "text": " So this is really, what a great conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2311.744,
    "end": 2312.025,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.045,
    "end": 2312.905,
    "text": "You've got a great paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2313.545,
    "end": 2314.646,
    "text": "So a couple of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.686,
    "end": 2327.632,
    "text": "First of all, you know, I wonder, we always talk about it being by analogy and it's not really thermodynamics, but von Neumann said to Shannon, use the second law of thermodynamics for your quantitative theory of information because, and his quote, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.652,
    "end": 2331.534,
    "text": "His quote was, because the math is identical, which tells you something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2332.014,
    "end": 2334.836,
    "text": "It at least tells you something about math and humans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2335.336,
    "end": 2338.717,
    "text": " But it may not tell you anything about the environment, but it tells you something about math and humans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2339.117,
    "end": 2343.999,
    "text": "But he also said, and if you use the word entropy in any argument, you'll win every time because no one will know what the hell you're talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2345.659,
    "end": 2348.961,
    "text": "So that's good advice on both of those points, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.361,
    "end": 2354.062,
    "text": "So I always look at it and I go, okay, so let's talk about those differentials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2354.262,
    "end": 2358.044,
    "text": "And, you know, that free energy question that we just answered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2358.864,
    "end": 2359.964,
    "text": "So I deal in policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2359.984,
    "end": 2360.965,
    "text": "I'm not a biologist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.005,
    "end": 2361.525,
    "text": "I'm a lawyer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2362.265,
    "end": 2363.286,
    "text": " OK, and a physics lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.746,
    "end": 2370.012,
    "text": "And the reason I'm interested in this stuff is I think you can access the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2370.513,
    "end": 2375.758,
    "text": "And in fact, I think that's all we do as social beings is we that's what rhetoric is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2376.518,
    "end": 2381.363,
    "text": "I am constantly trying to lasso external states of everyone else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2381.383,
    "end": 2382.404,
    "text": "That's what politics is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2382.424,
    "end": 2384.566,
    "text": "That's all the whole misinformation problem right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2385.185,
    "end": 2390.227,
    "text": " We're setting out now in a biological example, we kind of don't send around memos as much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2390.347,
    "end": 2395.69,
    "text": "Now there is, there are communications obviously in, in, in the sciences and in the nature and all that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.95,
    "end": 2404.453,
    "text": "But when you get into the human populations, we may have something more going on here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2404.593,
    "end": 2412.857,
    "text": "Maybe mind is an emergent phenomenon, merely of the attempts at harmonically coupling with other minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2414.181,
    "end": 2419.864,
    "text": " Maybe a break, if we're successful in tuning into that local mind, we survive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2420.084,
    "end": 2428.049,
    "text": "If I am dropped into France and I don't speak French, then am I going to survive?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2428.329,
    "end": 2432.031,
    "text": "Now, now I will, but what if it was 300 years ago or whatever, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.472,
    "end": 2441.897,
    "text": "So you need to, if the mind is feral and is trained, maybe that ability to affect the externality is everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2442.975,
    "end": 2450.201,
    "text": " maybe that's how we are humans in the way that we are, because we're pretty pathetic little organisms on our own, each one of us, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2450.221,
    "end": 2458.729,
    "text": "We don't have sharp fingernails, and our tooth and claw is not, we get bloody, but it would take a lot of biting, because we're kind of blunt, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2459.329,
    "end": 2465.855,
    "text": "So anyway, that's a bit of a tangent, but so the question is, are we, maybe if we look at the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.099,
    "end": 2468.76,
    "text": " Maybe we're not entering another brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2468.96,
    "end": 2471.501,
    "text": "Maybe the mind is where the action is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2472.341,
    "end": 2482.926,
    "text": "And when we're doing this in training, maybe we're merely tuning into something that exists already in our attempts here at this active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2483.066,
    "end": 2487.228,
    "text": "And we're just getting on board with the existing mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2487.488,
    "end": 2494.191,
    "text": "And so therefore, our steady state, our homeostatic state is the one that is most aligned with the externality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.182,
    "end": 2496.403,
    "text": " That's drawing us there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2496.723,
    "end": 2501.586,
    "text": "And as lawyers and as policy people, we create artificial externalities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.606,
    "end": 2504.088,
    "text": "That's why I use synthetic intelligence in our title.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2504.868,
    "end": 2507.95,
    "text": "We're creating synthetic externalities and saying, hey, come on over here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.971,
    "end": 2509.331,
    "text": "We got a good externality over here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2509.371,
    "end": 2509.892,
    "text": "Check it out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2510.172,
    "end": 2513.914,
    "text": "This one's resilient, sustainable, and the SDGs of the UN love it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2513.974,
    "end": 2515.916,
    "text": "So we're creating realities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2516.316,
    "end": 2519.178,
    "text": "What do you think about that in terms of the notion of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.208,
    "end": 2530.694,
    "text": " the efficacy of the possibility of harmonic coupling with other minds and that as another active activity and activity is not just changing your internal model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2531.485,
    "end": 2533.206,
    "text": " Yeah, that's extremely interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2533.266,
    "end": 2542.529,
    "text": "So I mean, I think this question of how exactly the external states get into the picture is pretty fundamental for a lot of people who are in this area.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2542.769,
    "end": 2549.751,
    "text": "And I think you're right that it's essential, but it's essential in a strange way where it's completely inessential too.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2549.851,
    "end": 2554.953,
    "text": "So it's essential in that the reason that your steady state is what it is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2556.073,
    "end": 2557.634,
    "text": " essentially involves the environment, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2557.694,
    "end": 2571.225,
    "text": "So, like, in the free energy principle, the NEST, the non-equilibrium steady state, is defined with respect to the sort of a subsystem that's embedded in an environment, and that steady state wouldn't exist without both pieces of that, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2571.605,
    "end": 2575.929,
    "text": "And it's the fact that you're doing gradient descent on that that guarantees that you're",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2576.601,
    "end": 2579.244,
    "text": " variational inference is going anywhere useful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2579.985,
    "end": 2592.577,
    "text": "And that's sort of the magical seeming connection between actual accuracy and all of this just churning that happens when you're minimizing free energy over time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2593.658,
    "end": 2597.522,
    "text": "But the way in which it's inessential is, of course,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2598.939,
    "end": 2602.563,
    "text": " I mean, I, I just, I guess maybe I'm, maybe I've been called a Cartesian before.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2602.624,
    "end": 2603.164,
    "text": "Maybe I am.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2603.224,
    "end": 2603.545,
    "text": "I don't know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2603.565,
    "end": 2610.233,
    "text": "I didn't mean to be, but, um, there's a sense in which simply just the datum here is just that I can get things wrong.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2611.127,
    "end": 2614.429,
    "text": " And I don't see that there's any obvious way of limiting the scope of that, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2614.489,
    "end": 2615.289,
    "text": "So just fallibilism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2616.55,
    "end": 2624.915,
    "text": "So I think there has to be some subset of states of the overall universe that you'd identify with you and your perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2625.776,
    "end": 2634.701,
    "text": "And otherwise, right, you have, sure, the external states are essential to the story, and they drive the dynamics de facto, but",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2635.162,
    "end": 2643.378,
    "text": " there has to be a difference between the actual external state at any moment and the external state that I represent by my hidden states or my internal states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2644.501,
    "end": 2645.383,
    "text": "And so I think",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2647.352,
    "end": 2656.701,
    "text": " You know, like, the reason any of this works in practice is because we've internalized the structure of the external environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2656.941,
    "end": 2661.406,
    "text": "And this whole point about harmonic coupling between minds is really cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2662.226,
    "end": 2664.329,
    "text": "There's something really cool and bootstrappy about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2664.369,
    "end": 2667.652,
    "text": "It's like, right, minds are things that harmonize with other minds, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2667.772,
    "end": 2669.894,
    "text": "And I don't,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2670.453,
    "end": 2678.056,
    "text": " Just to kind of pick out another piece of what you said, the way that I tend to think of this stuff is in terms of sort of imitation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2678.436,
    "end": 2688.8,
    "text": "So the fundamental term for a lot of people in this area is prediction, but I almost think it's more that we just learn to, our brains learn to imitate the sensory, right, the patterns of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2691.181,
    "end": 2701.052,
    "text": " The processes that produce patterns of sensory input, but the reason it's not just imitation is that also the world is just made up of a bunch of these generative models that each have their own driving right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2703.094,
    "end": 2711.624,
    "text": "signals so so that i'm not sure I don't know I don't know how to tie that up in a nice package but it's a cool set of questions and.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2715.7,
    "end": 2729.472,
    "text": " So the reason, though, that I stopped short of saying that the external states are as fundamental in understanding systems, biological systems, people, etc., as the internal states is simply things like Cartesian skepticism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2730.073,
    "end": 2731.053,
    "text": "So we could talk about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2731.073,
    "end": 2735.057,
    "text": "Yeah, go ahead, Scott.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2735.537,
    "end": 2736.198,
    "text": "Just to follow up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.618,
    "end": 2742.263,
    "text": "Well, it is interesting because our struggles in it, you know, I say on this podcast,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2742.734,
    "end": 2747.518,
    "text": " this group very often, the only time you see reality is when you see paradox, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2747.558,
    "end": 2752.061,
    "text": "If you're seeing an absence of paradox, you're intrinsically seeing a model of some sort.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2752.722,
    "end": 2759.387,
    "text": "And so we should embrace a confused state and know that that is a reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.947,
    "end": 2760.768,
    "text": "And so that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2761.374,
    "end": 2769.739,
    "text": " is not just a statement for this conversation, but in general, maybe what the mind is doing is the same thing that the body does when it's standing still.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2769.759,
    "end": 2770.94,
    "text": "You're actually never still.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2771.2,
    "end": 2778.124,
    "text": "You're always dynamically moving to maintain a semblance of stasis in a banded stillness, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2778.584,
    "end": 2780.305,
    "text": "So maybe we have a banded mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.385,
    "end": 2781.646,
    "text": "Maybe it's fully dynamic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2782.286,
    "end": 2788.33,
    "text": "And maybe what we think of as us, an existential kind of element of it, is within a band.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2789.181,
    "end": 2789.381,
    "text": " right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2789.461,
    "end": 2790.683,
    "text": "Do people change over time?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2790.723,
    "end": 2792.364,
    "text": "It's a ship theseus in a way, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.384,
    "end": 2796.729,
    "text": "You're still the same person, but some of the stuff has changed out, swapped out over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2798.13,
    "end": 2808.46,
    "text": "So maybe the embodiment helps us with mind as a fractal way at any level, because we can say, okay, if we have a system that's doing processing of dynamic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2809.477,
    "end": 2828.355,
    "text": " environment some of that processing may be internal some may be external i mean that's group formation and you know part of its genetic and consanguineous in terms of performance and some of it is people who are similarly situated right if you're in a disaster and everyone's all of a sudden has the same problems people band together all of a sudden very easily in their mind",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2828.935,
    "end": 2834.679,
    "text": " morphs into that organism that is needed for that acute situation in that stressful environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2835.179,
    "end": 2850.648,
    "text": "And so that maybe it's always dynamic, but that we don't see the dynamics as much and they seem more leisurely when we're studying them in the abstract, but maybe they're highly dynamic in both directions, especially as we become information beings and more dependent on symbols.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2852.381,
    "end": 2853.822,
    "text": " Thanks, Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2854.083,
    "end": 2867.476,
    "text": "Just one thought on the dynamics is anyone who's recorded a neuron or thought about that knows that just to keep an idea in your mind for a few seconds is being underwritten by vast numbers of dynamical processes that are quite rapid.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2868.117,
    "end": 2873.622,
    "text": "And the second point about the internalities and the externalities and the internal states and the external states",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2874.502,
    "end": 2889.317,
    "text": " The Helmholtz free energy has this U, internal energy, and that's like the configuration of the molecule, usually thought of as, and then this negative TS is sort of those vibratory modes that can't be as easily harnessed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2889.978,
    "end": 2897.505,
    "text": "But when you pointed to synthetic externalities, which is the same thing as saying reconstructing the internalities, it's like...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2898.453,
    "end": 2906.854,
    "text": " what if all of a sudden the organization of the system, we could partition it a little bit differently so that we had more U and a little bit less TS.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2907.295,
    "end": 2913.016,
    "text": "And when you think about a vibrating molecule, U makes it look like the covalent bonds and TS is the vibration.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2913.616,
    "end": 2921.257,
    "text": "But if you think about an ant colony, the movement of the pieces is still part of the internal dynamics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2921.977,
    "end": 2926.538,
    "text": "And so, especially when we're talking about information, which isn't covalently bonded atoms,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2927.774,
    "end": 2941.16,
    "text": " internal energy is something about the model it's not just about how things are touching and can be broken and reformed so there's a lot of awesome pieces in what you added there stephen and then anyone else with a raised hand",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2943.604,
    "end": 2946.826,
    "text": " Yeah, I think building on that, you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.106,
    "end": 2950.748,
    "text": "I think you're making the right choice here for this paper using the Helmholtz free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.768,
    "end": 2958.432,
    "text": "I think that's a... Even if Gibbs free energy is used more in active inference, that adds an extra level of complication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.752,
    "end": 2966.117,
    "text": "And I think this is actually useful then because you're able to look at some of these distribution questions and just how...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.097,
    "end": 2989.704,
    "text": " information is extracted but it's actually helpful for me to see you go back to the Helmholtz because it makes me realize well the Gibbs free energy which is more about how action happens how do you know what the internal energy change would have to do if it was trying to also keep within a certain constraint of volume and pressure which you don't have to worry about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.464,
    "end": 2994.387,
    "text": " with Helmholtz free energy, that would bring in action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.547,
    "end": 2997.709,
    "text": "That would bring in the action part of active inference in some ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.629,
    "end": 3002.152,
    "text": "But the underlying principles still hold for what you've got.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.712,
    "end": 3005.654,
    "text": "So I think that's helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.674,
    "end": 3008.456,
    "text": "So I don't know if you've got any thoughts on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.496,
    "end": 3010.357,
    "text": "Yeah, that is helpful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3010.377,
    "end": 3011.598,
    "text": "I would just say that that is helpful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3011.698,
    "end": 3014.32,
    "text": "And I would love if...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3015.549,
    "end": 3039.064,
    "text": " if in the future anyone worked on this same topic and unpacked the sort of, I was going to say generalization, but it's maybe the opposite, how this would work out in the case of action more specifically and using cubes-free energy and stuff, that would be really cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3040.754,
    "end": 3041.055,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3041.415,
    "end": 3051.029,
    "text": "And taking the temperature of a person in terms of going for a checkup to the doctor and they put the thermometer under your tongue and that's a thermal temperature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3051.35,
    "end": 3052.531,
    "text": "And how are you feeling?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3053.598,
    "end": 3057.382,
    "text": " What does it look like to take the temperature just like Blue had been suggesting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3057.962,
    "end": 3066.19,
    "text": "So maybe let's go to the transparent code slide that you added, Alex, because that was definitely something that we were curious about from the dot zero.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3066.891,
    "end": 3070.254,
    "text": "And we can just hear your thoughts on this, talk a little bit about this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3070.294,
    "end": 3075.399,
    "text": "And then also anyone else can just write down a question, raise their hand or ask in the live chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3075.459,
    "end": 3077.681,
    "text": "But we'd be really curious to hear what you thought about this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3079.332,
    "end": 3079.812,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3079.912,
    "end": 3091.255,
    "text": "So the reason, again, that I put this in was that Dean and maybe everybody in that point zero discussion had questions about this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3091.455,
    "end": 3100.697,
    "text": "And I think the transparent code, it ends up sounding like a slogan that invites speculation and it's a mystery or something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3100.737,
    "end": 3105.278,
    "text": "But this might be a case where I'm trying to say something so simple that it's like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3106.255,
    "end": 3107.156,
    "text": " it's easy to miss, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3107.957,
    "end": 3112.461,
    "text": "So I'll, um, the role, let me just first frame this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3112.501,
    "end": 3126.974,
    "text": "The role that this plays in the paper is that if you want it to be that variational free energy and, um, Helmholtz free energy in the thermodynamic sense, um, are the same quantity, then you're going to have to, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3129.395,
    "end": 3133.057,
    "text": " explain how, well, both of them are sort of made up of probabilities, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3133.617,
    "end": 3136.878,
    "text": "So you need to have a mapping from one set of probabilities to the other.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3138.219,
    "end": 3144.782,
    "text": "So there has to be a way of understanding how the probabilities of states, this is a big distinction in the literature, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3145.022,
    "end": 3158.748,
    "text": "How the probabilities of states could represent, could represent, so the probabilities of states in the system, the cognitive system that you're analyzing, which is also a physical system, how is it that those could represent",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3160.298,
    "end": 3167.72,
    "text": " the probabilities that are assigned by that system to the external states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3168.0,
    "end": 3179.103,
    "text": "So the idea of a transparent neuronal code or any code is just that the probability of, for example, so on the left hand of the diagram here,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3181.094,
    "end": 3189.6,
    "text": " If we had a transparent code in the sense in which I'm using that term, then, for example, the probability of neuron B firing, given that neuron A fires, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3189.62,
    "end": 3200.328,
    "text": "So if B is a postsynaptic neuron and A sends a signal to B, or A fires and there's a certain probability of B firing subsequent to A firing, that would represent...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3202.274,
    "end": 3213.325,
    "text": " the probability of some state of affairs Q obtaining, given that some state of affairs P obtains, where A, and this, we can talk about where this mapping comes from, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3213.405,
    "end": 3219.131,
    "text": "But the assumption is A represents P occurring and B represents Q occurring.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3220.132,
    "end": 3245.28,
    "text": " um so so that's really all i meant by a transparent code and it's it's not it's a simple idea but it's it's definitely controversial right like that that would mean that if you think that there's a certain conditional probability of you know the cat being on the mat given that the cat uh lives in the apartment um then you're sort of the probability that you would represent those things has to be tied up",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3246.55,
    "end": 3250.833,
    "text": " with the probability that you assign to those things occurring.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3250.893,
    "end": 3258.019,
    "text": "And that's not at all a sort of uncontroversial statement, but it's a simple idea.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3259.099,
    "end": 3267.626,
    "text": "And this is an idea, by the way, again, that's used in some of the early connectionist literature on who mentioned Boltzmann machines, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3267.666,
    "end": 3273.03,
    "text": "So there's an early paper on Boltzmann machines where this kind of stochastic code is proposed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3274.366,
    "end": 3289.408,
    "text": " And the basic, one more sentence on this, the basic idea is that the objective probability, sort of measurable probability of events within the system, maps onto the subjective probability that the system assigns to the states of affairs that are represented by those internal states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3291.707,
    "end": 3307.855,
    "text": " interesting and in the context of the cognitive system of interest we're talking about the brain it's like we know that we're not going to get the transparent coding from the photons hitting the retina to what is the probability of the cat being on the mat",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3308.715,
    "end": 3334.757,
    "text": " so with this multi-level processing as you've kind of hinted at with the multiple layers here it could be possible that at some neuronal stage or at some level of processing there is a pattern that maybe represents the cat being on the mat probabilistically which also invoked the whole representation questions which we had talked about months ago",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3336.439,
    "end": 3345.546,
    "text": " So it's so fun to see how you delineated where there's controversy, sometimes even both sides of the discussion around a controversy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3346.106,
    "end": 3348.288,
    "text": "And then it's like, great, here's the artifact.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3348.308,
    "end": 3349.649,
    "text": "Let's see which way we're going to push it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3350.089,
    "end": 3354.833,
    "text": "If there turns out to be more evidence for transparent coding, then we'll push it that way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3354.933,
    "end": 3357.154,
    "text": "And if there turns out to be less, then we can push it a different way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3358.035,
    "end": 3366.632,
    "text": " so um scott uh if you're there i don't see you yet so stephen first and then okay scott go ahead and then steven",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3367.688,
    "end": 3379.011,
    "text": " I just wanted to mention there was an article in Nature a couple years ago where there was an assertion made that consciousness, this is what caught my eye, consciousness, they asserted, arose 520 million years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3379.671,
    "end": 3381.212,
    "text": "And I was like, well, that's interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3381.232,
    "end": 3381.912,
    "text": "What's the evidence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3382.232,
    "end": 3388.033,
    "text": "And what they found was some structures for, I think they were proto-noto cords or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3388.353,
    "end": 3392.375,
    "text": "But basically it was a ganglia kind of thing, a secondary processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3392.915,
    "end": 3393.915,
    "text": "And their assertion was,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3394.673,
    "end": 3421.191,
    "text": " that because they found physical evidence of a neuronal structure, again, in fossils, it was some structure that was able to be preserved in shale or something, but because it was secondary processing beyond the eyeball or the ear or the perceptual apparatus, that secondary processing they suggested meant there was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.453,
    "end": 3431.961,
    "text": " Consciousness because that's was their definition, but it was interesting reason I raise it here is It's interesting that notion of embodiment Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3432.001,
    "end": 3432.782,
    "text": "So we're talking again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3432.902,
    "end": 3434.303,
    "text": "Let's talk about reaction chambers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3434.343,
    "end": 3445.993,
    "text": "We have there's stimuli all over the world there's things happening and then we have perceptions ability to stimuli right in our the afforded to us and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3447.094,
    "end": 3464.891,
    "text": " that comes in but we don't have the structure of it is tbd right and so then we the the organism embodies morphologically certain structures over time eyeballs and notochords and ganglia and things like that right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3466.182,
    "end": 3469.966,
    "text": " And those themselves are information structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3469.986,
    "end": 3471.888,
    "text": "They just haven't even embodied in the morphology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3471.928,
    "end": 3474.931,
    "text": "So it's morphological computing for biological organism, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3474.951,
    "end": 3476.553,
    "text": "Because they now can do that thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.573,
    "end": 3480.738,
    "text": "I can't see an ultraviolet, but bees can, that kind of thing, or infrared, that kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3482.019,
    "end": 3500.753,
    "text": " So I just wanted to raise that idea, that assertion that offended me originally that consciousness arose 520 million years ago is not so offensive in a way because what they're trying to do is grope at the notion of the layering on of morphology and embodiments and say, look, here was a ratchet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.993,
    "end": 3506.297,
    "text": "Here's something happened here and we think, we don't know how much more information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3506.317,
    "end": 3508.619,
    "text": "It's like Julian James when he went back and did the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.446,
    "end": 3514.85,
    "text": " Origin of Consciousness and the Evolution of the Bicameral Mind book in the 70s, J-A-Y-N-E-S.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3515.35,
    "end": 3521.854,
    "text": "And he was asserting from a literature search that the Wernicke's area flashed on at one point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3521.994,
    "end": 3525.016,
    "text": "It was equivalent of Broca's area, language center in the other side of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3525.577,
    "end": 3533.102,
    "text": "And his literature search, he looked at Joan of Arc, he looked at the Iliad, and he said that morphologically, literature embodied",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3533.82,
    "end": 3536.403,
    "text": " that notion of the mind actually changing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3536.443,
    "end": 3540.608,
    "text": "In ancient literature, you can see the mind turning on an internal voice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.768,
    "end": 3548.997,
    "text": "And so I just wanted to raise that notion, those embodiments of the external and internal states lying around all over the place, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3549.217,
    "end": 3552.942,
    "text": "And so your paper does a nice job of inviting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3553.939,
    "end": 3566.918,
    "text": " the treatment of those or those as candidates for looking at the mind being assembled, particularly if the mind is external to the brain and the brain is just an antenna tuned into the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3567.158,
    "end": 3567.359,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3569.551,
    "end": 3579.334,
    "text": " One funny little synchronicity there is that Julian Jaynes wrote the book that Scott mentioned, Origin of Consciousness in the Breakdown of the Bicameral Mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3579.734,
    "end": 3589.437,
    "text": "But Edwin Jaynes was a very famous thermodynamics researcher who introduced the maximum entropy interpretation of thermodynamics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3590.118,
    "end": 3590.218,
    "text": "So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3591.195,
    "end": 3592.577,
    "text": " Related like we all are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3593.198,
    "end": 3596.183,
    "text": "Were they related by the blood?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3596.964,
    "end": 3597.465,
    "text": "Aren't we all?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3598.327,
    "end": 3599.809,
    "text": "Come on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.65,
    "end": 3601.913,
    "text": "Stephen and then anyone else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3604.83,
    "end": 3608.491,
    "text": " Yeah, just sort of coming to this diagram that you've got here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.392,
    "end": 3616.194,
    "text": "So I think one thing I'd be interested in, I know she's saying neuronal or other internal systemic states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.214,
    "end": 3620.436,
    "text": "So you sort of give a little bit of latitude to dynamical aspects of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.976,
    "end": 3623.317,
    "text": "Goes to cognitive states of the system beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.977,
    "end": 3629.399,
    "text": "And I'm wondering how much you're tied to those beliefs being...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.0,
    "end": 3639.406,
    "text": " statistical computational sort of separate things or how much is it beliefs on action policies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.767,
    "end": 3645.171,
    "text": "I mean, I know I'm pushing active influence again, but yeah, what's your thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.852,
    "end": 3646.092,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3646.172,
    "end": 3655.48,
    "text": "I mean, there's all sorts of questions here about how we individuate representations and such, but I wouldn't think, I don't even, I don't really think of these as detachable, uh, separate entities at all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3655.9,
    "end": 3657.342,
    "text": "So that note is labeled P.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3658.022,
    "end": 3662.443,
    "text": " But I'm one of these functionalists who thinks that the reason that the label itself does nothing, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3662.684,
    "end": 3669.106,
    "text": "The label is a useful indicator for people outside the system to understand what it represents.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3669.606,
    "end": 3673.067,
    "text": "But the representational function is just the role that that node plays in the network.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3674.073,
    "end": 3680.176,
    "text": " So, and that would, I think that it subsumes and includes connections to action, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3680.496,
    "end": 3687.96,
    "text": "I just tend to think of connections to action as the special case where what you're generating, what your generative model is generating are states of the motor effectors.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3688.82,
    "end": 3693.622,
    "text": "So, right, I just, and I think any kind of planning that,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3695.522,
    "end": 3713.151,
    "text": " organism learns to do can also be understood as learning sort of sensory motor contingencies which will influence how states of the motor effectors are generated in tandem with states of the perceptual system right how perceptual biases occur so um basically",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3714.505,
    "end": 3722.709,
    "text": " Yeah, I don't think that there's any... These don't need to be cognitive separable features of the... These don't need to be separable features of the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3722.729,
    "end": 3739.476,
    "text": "They're just... When I say that a state represents P, because represents for me has sort of a functionalist meaning, I just mean that's just sort of a label for a set of ways in which the system can behave because of its internal structure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3739.596,
    "end": 3741.217,
    "text": "So including sort of internal...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3742.177,
    "end": 3769.7,
    "text": " um dynamics right but it's really just a label for a property of the dynamics of the system cool and also beyond the action being at the gross organismal motor level potentially internal representations or states could be like hormonal or neurosecretory so the neuron can fire but neurons have other affordances like the little micro motor behavior with the motor proteins like releasing a vesicle of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3771.158,
    "end": 3780.064,
    "text": " of a protein that's been transcribed and translated, also tiny little motor behaviors of nested smaller agents inside of that neuronal interface.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3780.764,
    "end": 3782.765,
    "text": "So Steven, and then anyone else with a raised hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3784.867,
    "end": 3790.41,
    "text": "Actually, just what you were saying there, Daniel, does that mean that you can almost release hormones through the brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.45,
    "end": 3794.493,
    "text": "It doesn't have to be like through a gland in the body, but you've got smaller scale",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.683,
    "end": 3819.712,
    "text": " releases neuro secretory cells and neuroendocrine biology are large areas so yes many kinds of cells pull in and secrete molecules and neurons are of various subtypes secreting specific hormones neuropeptides all kinds of hormones and signaling molecules short range and into the circulation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3820.646,
    "end": 3820.966,
    "text": " Got you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.206,
    "end": 3821.846,
    "text": "OK, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.447,
    "end": 3825.088,
    "text": "And I let that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.248,
    "end": 3826.048,
    "text": "And that's really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3826.068,
    "end": 3826.728,
    "text": "I didn't know about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.208,
    "end": 3847.196,
    "text": "And I suppose just adding on to this, when you mentioned about sensory motor contingencies and being able to, so I'm wondering that the scale of consciousness and things entering into consciousness or the phenomenological sort of awareness,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.257,
    "end": 3866.836,
    "text": " Do you sense that there may be, even if active influence is underwriting it all, other types of, like it doesn't have to be as pure active inference at that scale, and it could be working with other types of sort of architectures or process architectures?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.452,
    "end": 3874.895,
    "text": " I mean, well, one thing is that consciousness, so I think Scott brought up consciousness for the first time here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3875.256,
    "end": 3876.156,
    "text": "That's really interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3878.137,
    "end": 3884.0,
    "text": "I sort of deliberately didn't say anything about it in my paper because I find that it's a very thorny topic for me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3884.06,
    "end": 3886.561,
    "text": "Of course, for many people, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3886.761,
    "end": 3890.683,
    "text": "It's notoriously not an easy problem, or maybe it is, and it looks like a hard problem.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3890.783,
    "end": 3891.163,
    "text": "But anyway...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3892.944,
    "end": 3894.405,
    "text": " Yeah, so I'm not sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3894.425,
    "end": 3901.269,
    "text": "I do think that all of the cognitive dynamics I'm talking about are probably more fine-grained than what shows up in consciousness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3901.729,
    "end": 3910.554,
    "text": "So I wouldn't say that there's some transparent mapping from whatever you believe in the sense of belief that's implicitly defined here and what you are consciously aware of.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3912.735,
    "end": 3915.977,
    "text": "So there's all sorts of theories of how consciousness relates to this stuff.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3918.476,
    "end": 3923.02,
    "text": " There was a second piece to what you said that I wanted to address, but I don't remember what it was.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3923.7,
    "end": 3927.403,
    "text": "Well, I suppose it's a scale, but I think you kind of addressed it a little bit there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.843,
    "end": 3928.984,
    "text": "Sorry, Daniel, were you going to say something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3929.024,
    "end": 3931.606,
    "text": "Yeah, we'll come back to it if you remember what it was.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3932.127,
    "end": 3934.388,
    "text": "Yeah, Scott, and then anyone else with a raised hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3934.989,
    "end": 3940.453,
    "text": "Yeah, I wanted to go back to the notion of neurotransmitters for a minute ago when you were talking about endocrine neural function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3940.473,
    "end": 3941.274,
    "text": "A couple of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3941.294,
    "end": 3942.695,
    "text": "There's a couple of books here I just want to hold up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3942.735,
    "end": 3945.377,
    "text": "There's Cognitive Archaeological...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3947.182,
    "end": 3950.904,
    "text": " The cognitive archaeology and human evolution, kind of an interesting notion there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3950.924,
    "end": 3952.105,
    "text": "A couple of authors there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.385,
    "end": 3953.046,
    "text": "And here's another one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3953.986,
    "end": 3956.127,
    "text": "Archaeology and memory, kind of an interesting one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.648,
    "end": 3958.509,
    "text": "The reason I raise these is kind of interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3958.529,
    "end": 3966.874,
    "text": "When you talk about neurotransmitters, I remember reading an article a few years ago that suggested that among all the animals in the animal kingdom, now the animal kingdom isn't old.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3967.219,
    "end": 3990.042,
    "text": " representation Corollas Linnaeus thing I get it but in any event there's only one animal that doesn't share any of the neurotransmitters with the rest of the animals like the box jellyfish or some kind of jellyfish I forget which one it was and I thought that was interesting just what we were just talking about a minute ago Daniel was noting about neurotransmitters well again it's morphological computing those are artifacts of earlier solutions their practices",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.903,
    "end": 4013.359,
    "text": " of processing of information by these organisms right and so the fact that we can go back and say wow i wonder if these things were related given the fact that these don't share any neurotransmitters that's kind of an ethereal element it's not something that you get like bones and you know doesn't fossilize well but isn't it interesting that we can find the morphology of neurotransmission",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4014.318,
    "end": 4043.083,
    "text": " in current organisms and use that to understand lineage and relationship so in fact that's a it's a morphological artifact and it's not epigenetic right but it's interesting the relationship of the the uh homeostatic state of uh thinking or cognition of a certain line of organisms and the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4044.457,
    "end": 4046.938,
    "text": " morphology of its neurotransmitters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4047.378,
    "end": 4050.579,
    "text": "I'm interested in eusocial insects, for instance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4051.299,
    "end": 4052.52,
    "text": "Do people do profiles?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4052.74,
    "end": 4057.241,
    "text": "If anybody here knows anything about eusocial insects, please type in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4057.341,
    "end": 4062.543,
    "text": "What's the story with neurotransmitter analysis among eusocial insects?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4062.603,
    "end": 4071.726,
    "text": "Is the neurotransmitter specially invoked, and is the morphology of neurotransmitters perhaps where the organism resides more than other physicalities?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4071.946,
    "end": 4072.186,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4073.268,
    "end": 4074.469,
    "text": " Great question, Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4074.509,
    "end": 4077.51,
    "text": "So first on the tenofor point, and then the eusocial.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4077.83,
    "end": 4094.357,
    "text": "So the tenofor, indeed, it did suggest new evolutionary hypotheses when people investigated which neurotransmitters tenofors used, and they convergently utilized some of the same simple charged amino acid derivatives, but they used them in different ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4094.437,
    "end": 4099.019,
    "text": "For example, glutamate is not used in muscle contraction in vertebrates.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4099.459,
    "end": 4100.7,
    "text": "We have acetylcholinergic",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4101.724,
    "end": 4108.248,
    "text": " receptors at the muscle, but glutamate was used, which supports Alex's point about functional representation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4108.488,
    "end": 4111.549,
    "text": "There's nothing that says glutamate means muscle contraction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4111.97,
    "end": 4117.032,
    "text": "It's a functional context with a receptor and a muscle cell and a neuron that generates the contraction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4118.533,
    "end": 4122.574,
    "text": " potentially for a later day, maybe when we discuss active inference, the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4122.994,
    "end": 4129.656,
    "text": "But we've done multiple studies measuring neurotransmitter metabolism and gene expression in ants.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4130.176,
    "end": 4132.556,
    "text": "And there's been a lot of work on honeybees as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4133.096,
    "end": 4143.239,
    "text": "And just the one point I'll make here, since it is a large area and people can look at the papers if they want, is that the neurotransmitters that are involved in the regulation of foraging",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4144.019,
    "end": 4157.136,
    "text": " in ants and bees are inherited from the neurotransmitters that regulate foraging in solitary insects, like dopamine and octopamine in fruit flies, where it's been investigated in the context of solitary foraging.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4157.932,
    "end": 4162.714,
    "text": " But the inputs and the outputs of foraging for the eusocial insects are different.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4163.034,
    "end": 4172.639,
    "text": "So whereas in Drosophila, it's like internal hunger signals, representations, maybe some sort of neural hormonal encoding leads to foraging behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4173.099,
    "end": 4176.821,
    "text": "And then that results in the acquisition of food that reenters that bodily system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4177.501,
    "end": 4184.545,
    "text": "But in ant forager is foraging essentially food for the larva, a different part of the colony organism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4185.325,
    "end": 4206.772,
    "text": " So the inputs like the stimuli that lead to induced foraging behavior and the outputs like where the food goes are different, but the foraging motor behavior is conserved and it's that rewiring of the motor motif of foraging via the same neurotransmitters, octopamine and dopamine and others that actually enable the colony life cycle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4207.312,
    "end": 4208.493,
    "text": "So it's a really awesome area.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4208.513,
    "end": 4211.234,
    "text": "I hope we can talk more about how that relates to active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4212.358,
    "end": 4216.043,
    "text": " So Steven, and then Scott, and then anyone else who raises their hands.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4218.464,
    "end": 4223.206,
    "text": " Yeah, I'd like to ask a question about, which sort of links to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4223.266,
    "end": 4243.513,
    "text": "It's a kind of a semi-theory I've got, but is it feasible with this that the brain, like an organism basically, the cells that become the brain effectively, they mutate and they transform into the unique form that the brain and the nervous system are basically like another organism growing into the main body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4244.668,
    "end": 4268.406,
    "text": " organism right so you've got two organisms once they differentiate and their brain is like the control and the nervous system is like the control organization growing into and with the other the fascia of the other organism well in a human's fascia but obviously i just wondered if that would be plausible and that that would do anything with this brain organism boundary question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.363,
    "end": 4275.845,
    "text": " that I know you are kind of connected to in terms of wanting to maybe maintain more of that potential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.865,
    "end": 4289.609,
    "text": "I don't know if that's something that other people are talking about or whether it's a little bit out there and just, um, yeah, biologically or from the sort of cognitive philosophical sense, how that pans out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.27,
    "end": 4292.45,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4292.99,
    "end": 4293.39,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4293.531,
    "end": 4294.471,
    "text": "I love, I love the, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4295.287,
    "end": 4305.074,
    "text": " like biology and biochemistry and stuff and all this wonderful fine-grained scientific life sciences stuff that you guys are bringing to the table on this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4305.715,
    "end": 4308.817,
    "text": "That's not as much where I'm coming from, but I think it's really, really cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4309.597,
    "end": 4312.459,
    "text": "But so, Stephen, the idea that you just articulated sounds",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4313.3,
    "end": 4314.881,
    "text": " Sounds out there and plausible to me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4315.081,
    "end": 4324.784,
    "text": "So I think that like that's kind of what I would expect is that the same story can be told on multiple scales internal to the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4325.104,
    "end": 4325.284,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4325.384,
    "end": 4328.585,
    "text": "And so the brain learning sort of learning growing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4328.605,
    "end": 4334.266,
    "text": "I guess I've just been conditioned to think of all this as one type of process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4334.306,
    "end": 4334.427,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4334.447,
    "end": 4335.287,
    "text": "So I said learning, but.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4336.391,
    "end": 4341.833,
    "text": " morphological development and growing into its mature shape is a form of learning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4342.133,
    "end": 4350.416,
    "text": "But so anyway, that happening and interfacing with the rest of the organism, I mean, I definitely don't see any reason that we need to draw a like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4351.431,
    "end": 4359.997,
    "text": " joint in nature around the physically, right, the organism that we can perceive, there are going to be many similar joints that we could delineate within.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4360.918,
    "end": 4362.359,
    "text": "So I think that's a cool idea.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4362.839,
    "end": 4368.103,
    "text": "I don't know much about the details of that process, so I can't, like, check that and validate it, but it sounds plausible to me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4369.284,
    "end": 4369.804,
    "text": "Thanks, Alex.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4370.565,
    "end": 4371.686,
    "text": "Blue, and then Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4374.15,
    "end": 4378.774,
    "text": " So just to kind of maybe ask Stephen to unpack a little bit what he said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4378.834,
    "end": 4389.304,
    "text": "So I think in terms of a brain-organism separation or duality, do you maybe mean mind-organism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4389.364,
    "end": 4392.467,
    "text": "Because in my experience, it's like the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4394.088,
    "end": 4395.989,
    "text": " like the brain is like the control center, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4396.009,
    "end": 4404.996,
    "text": "Like, I don't know that there's necessarily like a division between the brain and the organism, but definitely like the mind is kind of like this ethereal concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4405.076,
    "end": 4406.737,
    "text": "So maybe could you just unpack that a little bit?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4407.738,
    "end": 4414.202,
    "text": "Well, I was actually thinking, partly thinking about the work of Mike Levin, Mike Levina or Mike Levin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.382,
    "end": 4422.408,
    "text": "And so in a way, my understanding is that once a cell becomes a neuronal cell, there's no going back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4423.075,
    "end": 4424.938,
    "text": " Like it's kind of like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.478,
    "end": 4439.237,
    "text": "So it's in some ways it's it's it's I was curious whether that whole structure, be it from a small organism, is effectively like we basically have two organisms in our body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.404,
    "end": 4445.85,
    "text": " because our cells are differentiated into the bodily organisms and the neuronal ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.31,
    "end": 4452.437,
    "text": "And they've sort of, they work together in this symbiotic kind of cybernetic loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.998,
    "end": 4457.482,
    "text": "So that's the kind of thinking, but how it pans out, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.795,
    "end": 4461.217,
    "text": " so I just, if I could just like speak to that a little bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4462.038,
    "end": 4470.706,
    "text": "So the neurons can de-differentiate and do in like, especially like in neural cancer types.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4471.006,
    "end": 4473.889,
    "text": "So we do see some, some de-differentiation there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4474.009,
    "end": 4476.671,
    "text": "It's not as committal as we've thought before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4477.092,
    "end": 4480.655,
    "text": "I mean, this it's kind of a budding field and the, the, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4481.776,
    "end": 4487.779,
    "text": " antique way of thinking is that it's a set lineage, but there's ways that you can convince them to do otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4488.22,
    "end": 4492.982,
    "text": "I think Mike Levin's thing is the bioelectric field, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4493.002,
    "end": 4499.606,
    "text": "And so he separates the bioelectricity of the organism as maybe...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4500.626,
    "end": 4504.068,
    "text": " the overarching control center there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4504.108,
    "end": 4509.252,
    "text": "But I've not seen like a neural, like a neuron body distinction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4509.292,
    "end": 4510.312,
    "text": "That's why I was just like, what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4510.332,
    "end": 4511.473,
    "text": "Sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4511.693,
    "end": 4516.917,
    "text": "Well, one thought on that and also to Scott's point about the emergence of a second level of the nervous system",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4517.717,
    "end": 4532.126,
    "text": " is to remember from developmental biology that ectoderm, the outer layer of the developing embryo, turns into neuroectoderm, which is the tissue that gives rise to the nervous system and gastrulation and the neural tube.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4532.206,
    "end": 4541.191,
    "text": "So the nervous system developmentally, neurons, share an affinity and a developmental proximity to the external layer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4541.872,
    "end": 4546.755,
    "text": "And so when you start nesting internal layers inside of that tube that's closed,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4547.355,
    "end": 4549.878,
    "text": " you start getting higher order nervous systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4550.499,
    "end": 4562.712,
    "text": "And then also the pituitary gland to sort of close this with a neuroendocrine discussion, the pituitary gland is actually amalgamated from multiple developmental sources.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4563.453,
    "end": 4570.579,
    "text": " And so it's interesting that it has such a pivotal hormonal position, integrating hormones and the brain's function.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4571.18,
    "end": 4579.506,
    "text": "And it itself is like a refusion from a tissue perspective of multiple branches of the ectoderm that had branched.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4579.587,
    "end": 4587.333,
    "text": "And then they reformulate a new organ, which is the pituitary gland that serves a very coordinating role in organismal development.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4588.634,
    "end": 4590.716,
    "text": "So Scott, and then anyone else with a question?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4592.819,
    "end": 4621.982,
    "text": " know this is the best way i can spend my day with people who say the quote the pituitary gland is amalgamated from multiple ectoderm sources there i'm in the right place man you know when you you know this is the place for me i can tell you that hey um a couple things let's go back to this part in holland dynamic and cancer as an organism stuff for a second this is uh this is good stuff so you know the cancer analysis where they start to treat cancer as an organism in an ecosystem you know some of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4622.442,
    "end": 4630.327,
    "text": " framings to think of it that way, a recruitment of a kind of chaotic, kind of like having a drunk uncle stay at your house is one way of looking at cancer, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4630.687,
    "end": 4633.149,
    "text": "It's a chaotic use of resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4633.909,
    "end": 4636.451,
    "text": "So that is kind of interesting, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4637.011,
    "end": 4647.598,
    "text": "So we're talking, and going back to Stephen's point about the mind being different, so I'm thinking of symbiogenesis here, Lynn Margulis stuff and the chloroplasts in all plant cells and the mitochondria in all",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4648.118,
    "end": 4671.353,
    "text": " animal cells were once their artifacts of once free existing bacteria right they migrated on board with eukaryotes because it was a better deal right more leverage more de-risking higher levels of engagement with the outside right they change their internal physicality and morphology so they could think at way higher levels they could access way more complex levels of engagement than single cell organisms",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4672.628,
    "end": 4677.51,
    "text": " including the engagements they could get through sexual reproduction, which introduced additional symbolic novelty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4678.03,
    "end": 4680.991,
    "text": "So they could be more dynamically engaged with environments, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4681.051,
    "end": 4683.732,
    "text": "Clonal reproduction does not introduce a lot of novelty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4684.133,
    "end": 4687.274,
    "text": "So it's hard to keep up with dynamic environments if you're clonal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4688.218,
    "end": 4690.239,
    "text": " This is sounding like intelligent design, but it's not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4690.879,
    "end": 4701.142,
    "text": "So it's interesting, Stephen, in your notion of the mind being separate, because in a way, the mind is formed by the social environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4701.162,
    "end": 4712.386,
    "text": "You know, I've told the story before, my sister adopting a five month old Chinese child who is now 22, who was raised in central Pennsylvania, speaks Spanish and English, does not speak Chinese, does not like Chinese food, does not like Chinese music.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4713.103,
    "end": 4714.904,
    "text": " And basically looks like a Chinese person, but is not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4715.564,
    "end": 4717.985,
    "text": "So is that mind a Chinese mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4718.406,
    "end": 4722.608,
    "text": "The problem is we don't have any control groups on the mind formation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4722.688,
    "end": 4724.589,
    "text": "Once you're formed, you are who you are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4725.149,
    "end": 4726.21,
    "text": "And we say, okay, that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4726.67,
    "end": 4729.191,
    "text": "But I like, Stephen, where you're going on that notion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.771,
    "end": 4732.092,
    "text": "Maybe the mind is an independent quantity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4732.773,
    "end": 4735.534,
    "text": "And again, the brain is an antenna to the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4735.554,
    "end": 4739.216,
    "text": "So maybe the body contains the antenna components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4739.256,
    "end": 4740.997,
    "text": "Again, I don't mean a real antenna, but sort of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4742.628,
    "end": 4760.526,
    "text": " and it needs to be tuned it's feral and so maybe what's happening is the tuning actually creates a mind maybe the mind is not resident in the brain in a child and maybe Bayesian inferences construct a mind it's like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4761.846,
    "end": 4769.169,
    "text": " And to maybe direct it to Alex before we go to Stephen's question, Dean, you really focused on this sentence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4769.95,
    "end": 4778.534,
    "text": "It may be, for example, that biological systems run an algorithm closer to contrastive divergence than to simulated annealing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4779.574,
    "end": 4784.456,
    "text": "So what does that mean or what does that reflect on?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4785.837,
    "end": 4786.197,
    "text": "Can I ask?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4786.237,
    "end": 4789.418,
    "text": "Yeah, and Dean, maybe you want to give a little extra info on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4789.538,
    "end": 4790.399,
    "text": "Just a quick thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4791.178,
    "end": 4795.82,
    "text": " I want to hear Stephen and I want to hear everybody else, but I have a question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4796.721,
    "end": 4801.223,
    "text": "In the background, sorry, I have to say this, in the background, I've got people taking the front of my house off.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4801.663,
    "end": 4805.786,
    "text": "So I haven't been able to do much other than try to control my ADD.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4806.206,
    "end": 4815.01,
    "text": "But I have a big question for Alex once we get through the part that Stephen and Scott want to have addressed, and it's specifically to what you just raised.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4815.431,
    "end": 4815.971,
    "text": "So thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4816.553,
    "end": 4816.754,
    "text": " Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4816.854,
    "end": 4821.244,
    "text": "Let's go to Stephen, and then we'll return to Dean and the contrast of divergence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4823.168,
    "end": 4824.19,
    "text": "Yeah, maybe this will...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.199,
    "end": 4848.175,
    "text": " bring this together is I suppose what I'm just proposing is that there is some structural biological differentiation which is will have an impact in some ways and how we think about extended cognition but if we I'm very much of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.821,
    "end": 4873.857,
    "text": " mind body environment dynamical system kind of idea so i suppose i'm i'm talking about there being a difference biologically but probably at the macro level i'm i'm trying anyway to formulate approaches which talk about a whole system and not anything else than that but i recognize that it may open up some other cans of worms but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4875.037,
    "end": 4891.043,
    "text": " I know that... I wonder if that's something that you're... Does this annealing relate to the mind-body-environment dynamic in playing out within that, or is it a little bit more separate or different to that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4891.904,
    "end": 4892.204,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4892.744,
    "end": 4902.227,
    "text": "I mean, the use I was making of this contrast between contrast of divergence and simulated annealing here was just... was kind of more specific...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4905.202,
    "end": 4915.372,
    "text": " I was just thinking of so annealing the process of gradually lowering the temperature and simulated annealing was an optimization technique that mirrors that process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4915.933,
    "end": 4923.5,
    "text": "And so, I mean, I guess the answer to your question, Stephen, is I wasn't really thinking about system environment relations here at all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4923.52,
    "end": 4924.241,
    "text": "I was just thinking of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4925.542,
    "end": 4934.526,
    "text": " two different sort of internal processes and how they might be mapped onto these learning algorithms and processes in physics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4934.586,
    "end": 4941.469,
    "text": "But so, I mean, I can wait to go on to that, to take Dean's question or whatever.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4941.489,
    "end": 4944.371,
    "text": "Yeah, maybe Dean, let's go for the divergence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4945.191,
    "end": 4948.573,
    "text": "Yeah, I'm not predictable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4949.053,
    "end": 4953.315,
    "text": "I'm going to pull up the paper because I need to explain this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4954.17,
    "end": 4960.011,
    "text": " Alex, in the paper, you talked in the subsection one to the role of internal energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4960.031,
    "end": 4963.092,
    "text": "Let me just find it here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4963.952,
    "end": 4973.675,
    "text": "You talked about the inverse relationship between probability and energy is exploited in most uses of energy as a cost function and optimization problems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4973.715,
    "end": 4974.735,
    "text": "So you made that clear.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4975.995,
    "end": 4983.757,
    "text": "And then a little further down in the paper, you talked about contrastive divergence, which in equilibrium distribution of a restricted Boltzmann machine.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4984.451,
    "end": 4989.932,
    "text": " And then you got into a little bit more about the comparison to the simulated annealing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4989.972,
    "end": 4996.454,
    "text": "And then you got into section two, and I've just got to try to find it here, the ensemble piece.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4996.774,
    "end": 5000.275,
    "text": "So here's my question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5001.815,
    "end": 5013.958,
    "text": "If I were to bring three things and cast the widest, largest frist and blanket yet around your paper, because I think that's what your paper does.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5014.693,
    "end": 5042.61,
    "text": " if I were to bring a Polaroid picture, a sprinkler, and an astronaut together, so if I were to bring identity, which was the primary attractor of your paper to me, identity, astronaut, that distribution piece and the first one, the Polaroid, the isomorphism, could you explain how",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5043.395,
    "end": 5046.805,
    "text": " You brought these things that are so seemingly",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5048.393,
    "end": 5051.094,
    "text": " distal into some sort of a coherence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5051.634,
    "end": 5066.621,
    "text": "How did, when you were sitting down, because I know you did this on a very proximal level, but it has far reaching implications based on the kinds of questions that Steven has asked, ones that Scott's asked, the points that Lou and Daniel have made.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5067.261,
    "end": 5068.842,
    "text": "It doesn't just seem to be local.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5069.342,
    "end": 5071.663,
    "text": "It seems to be really distributed as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5072.243,
    "end": 5074.304,
    "text": "And so I'm just really curious,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5075.692,
    "end": 5093.649,
    "text": " You wrote the paper, but now that you've kind of been able to step back from it and sort of take it in in a perspective, that distance must have you really looking at this maybe in interesting ways, because there isn't just the stuff on the paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5094.27,
    "end": 5099.795,
    "text": "There's the stuff now that you've kind of reflected on and seen the inversion and wondered,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5100.131,
    "end": 5103.834,
    "text": " holy mackerel, did I open up a can of worms, or what have I done?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5103.894,
    "end": 5106.416,
    "text": "I'm curious about that on a personal level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5107.076,
    "end": 5108.437,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5109.458,
    "end": 5117.604,
    "text": "Well, just in general, the most striking thing about how this has played out is that people are really interested.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5117.624,
    "end": 5128.632,
    "text": "So Blue mentioned this in the discussion, and I had emails about it too, are really interested in the distinction between genuine minds and simulations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5130.032,
    "end": 5132.234,
    "text": " which was completely an afterthought when I wrote this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5132.574,
    "end": 5136.936,
    "text": "It was just like, oh, yeah, I better deal with the scope of this, and so I should put a sentence about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5137.036,
    "end": 5138.817,
    "text": "And I did put care into it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5138.897,
    "end": 5141.919,
    "text": "You know, I put the best sentence I could in, but it wasn't my focus.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5142.619,
    "end": 5157.547,
    "text": "But, yeah, I mean, the thing, I guess the thing that strikes me about this, so it was, right, I mean, it was intended to be this thing",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5159.201,
    "end": 5162.704,
    "text": " It was intended to be a very fundamental thesis that I'm considering here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5162.784,
    "end": 5164.785,
    "text": "So I do think it has far-reaching implications.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5164.825,
    "end": 5166.827,
    "text": "I have no idea whether it's true.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5166.907,
    "end": 5169.95,
    "text": "But if it did, it would have at least far-reaching implications.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5170.05,
    "end": 5176.575,
    "text": "I guess what I'm less clear on is I'm still waiting for the other shoe to drop.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5176.595,
    "end": 5184.461,
    "text": "I'm waiting for someone to say, here's an example of a biological system in which there's no way that you can map the cognitive interpretation directly onto the physical interpretation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5186.222,
    "end": 5190.286,
    "text": " If that's the case, and if I think it's a compelling example, then I guess I'm wrong.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5190.947,
    "end": 5192.848,
    "text": "So far, that hasn't happened.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5192.868,
    "end": 5196.091,
    "text": "There have been some interesting suggestions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5196.252,
    "end": 5200.916,
    "text": "So I guess I'm... I don't know if I'm directly answering your question, Dean.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5200.996,
    "end": 5204.92,
    "text": "I'm just... To me, the devil is still very much in the details.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5205.02,
    "end": 5208.143,
    "text": "And this is essentially a defense of a... I was trying to...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5209.485,
    "end": 5219.828,
    "text": " I was trying to show that maybe some a priori prima facie objections to this kind of thesis were not compelling.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5220.248,
    "end": 5225.75,
    "text": "But there could be all sorts of details that emerge that might question it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5229.271,
    "end": 5230.711,
    "text": "So I don't know if that really answers your question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5230.731,
    "end": 5231.131,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5231.871,
    "end": 5232.072,
    "text": "No.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5232.572,
    "end": 5236.973,
    "text": "And again, it was kind of like when I was talking with Blue and Daniel in the point O, and I",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5237.506,
    "end": 5252.67,
    "text": " I brought up, so I talked to people who very much are in an activist camp and they wanna see that realistic and then there's the statistical camp and they really wanna have that sort of top down, where's the channel, what's going on?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5253.03,
    "end": 5259.492,
    "text": "And I just kind of thought what your paper did is it opened both of those perspectives.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5260.092,
    "end": 5263.453,
    "text": "I don't know that they even have to necessarily merge or overlap.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5263.513,
    "end": 5265.714,
    "text": "I think the fact that we can",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5267.39,
    "end": 5268.511,
    "text": " use both and see both.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5268.931,
    "end": 5270.291,
    "text": "It's just a really interesting thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5270.331,
    "end": 5273.853,
    "text": "Now, I don't know whether that is disprovable or it should be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5275.194,
    "end": 5281.696,
    "text": "I guess that would mean that inactivism is not a thing or statistical modeling is not a thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5281.736,
    "end": 5282.997,
    "text": "And yet we use these things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5283.037,
    "end": 5287.819,
    "text": "So I mean, I guess they can be discounted, but I don't know that they'll go away.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5289.02,
    "end": 5289.5,
    "text": "That's all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5289.78,
    "end": 5292.561,
    "text": "So I guess you have answered my question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5292.601,
    "end": 5296.643,
    "text": "We can leave things open and up and not necessarily have them",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5297.594,
    "end": 5327.274,
    "text": " provide everything but but we can't just sort of discount something and throw it away until somebody as you said comes along and and says no right it doesn't work yeah and just one quick follow-up on this this the one reason i wrote this paper is that i think what a lot of people find compelling about the free energy principle and the literature around that is the idea that there might be a link between physics and cognition right that there is a fundamental theory kind of emerging but",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5328.672,
    "end": 5334.334,
    "text": " I think it's very hard to pin down what the precise relationship... It's hard for different people at different times.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5334.394,
    "end": 5336.395,
    "text": "It's becoming clearer.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5336.555,
    "end": 5339.116,
    "text": "This has been worked out a little bit in the pre-energy principle literature.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5339.296,
    "end": 5354.802,
    "text": "But it's difficult to articulate exactly what the deep connection is between variational inference on the one hand and the behavior of physical systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5355.042,
    "end": 5356.323,
    "text": "So I just wanted to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5358.366,
    "end": 5367.868,
    "text": " I wanted to throw out, here's one version, one possibility of what the, supposed to be a clean, precise, brief statement of what that relationship could be.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5369.288,
    "end": 5377.63,
    "text": "So that, yeah, it's open-ended, but so that it can be falsified, juxtaposed to other interpretations of that relation, et cetera.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5378.85,
    "end": 5379.41,
    "text": "Thanks, Alex.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5379.69,
    "end": 5384.691,
    "text": "We'll go to Blue, and then if anyone in the chat or if Dave has a comment, then feel free.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5384.751,
    "end": 5385.351,
    "text": "But first, Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5387.523,
    "end": 5393.29,
    "text": " So Alex, I think that this goes back to what you were saying in the very beginning about scale, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5393.33,
    "end": 5398.476,
    "text": "So it's hard right now even to map like cognition onto like neural activation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5398.516,
    "end": 5407.186,
    "text": "I mean, right now we don't know too much, like too many components in the system are murky for it to really be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5407.826,
    "end": 5430.548,
    "text": " clear what's happening and i think you know as we talk about information going from a cell you know to from a brain to a neuron to cognition to action to bodily regulation and these kinds of things we don't really know is information compressed is it integrated like what is happening to scale a system up or down right i think that that's a hard hard problem",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5432.216,
    "end": 5435.637,
    "text": " Yeah, I mean, maybe I'm not sure what you mean by scaling the system up or down.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5439.238,
    "end": 5454.901,
    "text": "In this section, you talk about the scale-free nature of free energy dynamics and about how global and local free energy minimization could be understood as subsystems that are undergoing some sort of akin process at their own scales.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5455.722,
    "end": 5455.942,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5459.162,
    "end": 5461.123,
    "text": "Yeah, so I mean, the thing that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5462.904,
    "end": 5470.695,
    "text": " So I mean, the thing that I wanted to react to in what Blue said was the idea that we don't really know what's going on in the brain still.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5470.735,
    "end": 5471.376,
    "text": "It's very murky.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5471.436,
    "end": 5472.517,
    "text": "I mean, I think that's true.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5472.578,
    "end": 5473.799,
    "text": "It's always relative, right, to some",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5474.969,
    "end": 5476.53,
    "text": " ideal of how much we could know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5476.89,
    "end": 5492.46,
    "text": "But what got me into this whole literature in the first place was, again, starting with the machine learning literature around 2012, 2013, I started to feel like we actually were getting a grasp on some of these principles, how this works quite generally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5492.56,
    "end": 5497.703,
    "text": "So like the Helmholtz machine, for example, you talked about that in the point zero.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5499.69,
    "end": 5500.591,
    "text": " I think that's a model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5500.671,
    "end": 5515.339,
    "text": "Now, if the model is accurate, then it seems like what's happening is as signals are sent from one neuronal population to another further from the sensory motor periphery, the information is being compressed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5515.46,
    "end": 5526.986,
    "text": "So that's a particular hypothesis that there's successive compression of information, meaning that things are represented using lower dimensional",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5529.076,
    "end": 5533.207,
    "text": " Well, vector spaces, if you want to translate between vector spaces and neuronal populations, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5536.593,
    "end": 5538.034,
    "text": " and that we have a pretty good idea, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5538.114,
    "end": 5541.715,
    "text": "Like this sort of architecture explains so many things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5541.735,
    "end": 5555.821,
    "text": "I mean, this is what got people so excited about the predictive brain or the Bayesian brain type hypotheses is that there are just so many different things from different domains in psychology and neuroscience that this kind of perspective seems to unify.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5555.841,
    "end": 5562.264,
    "text": "It's to be expected in a sort of Helmholtzian architecture that like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5563.135,
    "end": 5582.43,
    "text": " know uh the you can always sort of endogenous endogenously cause the same sorts of states that you could be in as a result of perception right and that imagination and internal generation of states has a particular role to play in learning and things like this so i'm kind of rambling but um my my my sense is that this um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5583.84,
    "end": 5595.192,
    "text": " this sort of Bayesian, Helmholtzian revolution or whatever you want to call it in recent years has shown that we do understand many principles of how the brain functions at the level of like at the human scale.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5596.213,
    "end": 5600.477,
    "text": "If the question is about like how do other scales fold into this, I mean,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5602.119,
    "end": 5612.497,
    "text": " There's some work that Maxwell Remsted and Kasper Hesp and people like that have done on understanding neuronal population dynamics in terms of active inference at that scale.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5612.798,
    "end": 5613.779,
    "text": "And so that's really interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5616.526,
    "end": 5629.271,
    "text": " So what I would think of as a structural representation from the point of view of me or you, like a human being, you can also think of as a process of neurons performing active inference at their own scale.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5629.971,
    "end": 5638.034,
    "text": "But I think there's, to me, the hard question there is how do you relate the contents of the representation at the higher scale to the contents of the lower scale?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5639.054,
    "end": 5641.555,
    "text": "That's the thing that bothers me in this area.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5643.853,
    "end": 5645.074,
    "text": " If I could just respond really quick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5645.114,
    "end": 5646.736,
    "text": "Yeah, that's exactly the thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5646.776,
    "end": 5652.541,
    "text": "I mean, we can see how this act of inference is happening at different scales, for sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5652.701,
    "end": 5660.388,
    "text": "But how scaling up and scaling down or the translation from one scale to another happens is very mysterious still.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5661.229,
    "end": 5661.75,
    "text": "Yeah, totally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5661.77,
    "end": 5661.85,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5662.756,
    "end": 5663.096,
    "text": " Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5663.617,
    "end": 5666.298,
    "text": "So we have about 20 minutes left.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5666.378,
    "end": 5675.004,
    "text": "So if anyone has a question in live chat, otherwise, we'll go to Scott, and then Steven and be preparing our thoughts for what to continue discussing in point two.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5675.424,
    "end": 5675.944,
    "text": "So Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5677.305,
    "end": 5686.491,
    "text": "So picking up on the last couple of points really interesting the I was thinking of what was the gentleman's name who Barrett sin who said information is the difference that makes a difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5686.511,
    "end": 5687.412,
    "text": "What was that guy's name?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5687.472,
    "end": 5687.672,
    "text": "Is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5688.272,
    "end": 5688.652,
    "text": "Anyway,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5690.229,
    "end": 5691.31,
    "text": " the difference that makes a difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5691.35,
    "end": 5699.774,
    "text": "And I always thought the first difference that he's talking about is a perceptual change in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5700.135,
    "end": 5703.396,
    "text": "And the second difference is, is that perceptual change relevant to you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5704.137,
    "end": 5714.783,
    "text": "And so I want to unpack that a little bit here because contents, one of the things that I was talking about in my MIT presentation, one of the things I noted is Shannon tells us signal versus noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5715.563,
    "end": 5723.265,
    "text": " But I think but it doesn't tell us if the signal is a cancer cure or a chocolate chip cookie recipe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5724.365,
    "end": 5724.585,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5724.986,
    "end": 5728.327,
    "text": "And so the content is left undefined there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5728.607,
    "end": 5731.107,
    "text": "Now, what if so?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5731.487,
    "end": 5737.009,
    "text": "So I define living systems as autocatalytic entropy secreting structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5738.641,
    "end": 5741.864,
    "text": " Notice I don't say they have to be embodied in any particular embodiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5741.885,
    "end": 5746.71,
    "text": "My son said the only reason I came up with the definition is I wanted to use the word secretion because it was juicy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5748.552,
    "end": 5749.633,
    "text": "But he's right in part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5750.013,
    "end": 5750.874,
    "text": "I wanted to make it juicy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5751.194,
    "end": 5759.924,
    "text": "But the reason I raise that here is when you look at Berenson or whoever it was, Berenson, anyway, the difference that makes a difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5761.499,
    "end": 5770.402,
    "text": " Info, information really maybe is what we cognitive beings call relevant differentials that we perceive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5771.482,
    "end": 5773.443,
    "text": "Irrelevant differentials are just noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5774.603,
    "end": 5779.605,
    "text": "And so the difference that makes a difference, we call it information, but there's a lot of differentials out there in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5780.425,
    "end": 5787.627,
    "text": "And that's the reason I'm going there is since we're talking to a philosopher today and what I deal in as a lawyer is rhetoric.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5788.61,
    "end": 5793.392,
    "text": " And rhetoric is what you do to bring together incommensurables, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5793.493,
    "end": 5796.274,
    "text": "And rhetoric is not like crazy glue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5796.454,
    "end": 5798.315,
    "text": "It's like epoxy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5798.355,
    "end": 5799.876,
    "text": "It doesn't just bring things together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5799.976,
    "end": 5802.017,
    "text": "It also brings them together and fills gaps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5803.358,
    "end": 5811.402,
    "text": "So the rhetoric of information is our storytelling about relevant differentials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5812.361,
    "end": 5818.365,
    "text": " And we seek to sculpt our internal model and entrain other people's internal models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5819.185,
    "end": 5829.652,
    "text": "Because when we entrain other people's internal models with our rhetoric, then it de-risks our externality because other people's internal models are my externality, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5831.078,
    "end": 5843.902,
    "text": " So the rhetoric is the tool that we use to reduce differentials or to increase relevance alignment among cognitive systems running cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5844.642,
    "end": 5845.002,
    "text": "How's that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5845.122,
    "end": 5846.282,
    "text": "I wanted to try to integrate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5847.023,
    "end": 5854.745,
    "text": "That seemed to me, that last couple of comments, it felt like maybe information is an article when we put too much in seeking information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5855.425,
    "end": 5862.771,
    "text": " Maybe information, the difference that makes a difference, after the fact we can tell that because before the fact we can't tell what's relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5863.211,
    "end": 5869.576,
    "text": "For instance, suntan lotion never existed because we didn't know that photons cause skin cancer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5870.097,
    "end": 5875.641,
    "text": "Now there's an entire commercial factories and areas in the grocery store that sell suntan lotion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5876.442,
    "end": 5879.484,
    "text": "Now, it doesn't mean that the sun became carcinogenic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5879.704,
    "end": 5881.125,
    "text": "We just learned that it did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5882.068,
    "end": 5894.24,
    "text": " So we were able to make that inference at large scales and now influence buying behavior, which leverages and de-risks future behaviors, which is the reason that we care about information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5894.28,
    "end": 5895.922,
    "text": "That's the difference that makes a difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5896.082,
    "end": 5897.984,
    "text": "Anyway, a couple of thoughts on this last couple of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5898.685,
    "end": 5900.346,
    "text": "That's really cool stuff.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5900.446,
    "end": 5904.29,
    "text": "I mean, I really see things similarly, I think, on a lot of fronts there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5904.55,
    "end": 5904.771,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5907.082,
    "end": 5923.055,
    "text": " I think, so the question of, it sounds to me like you're kind of saying, like, we don't have to be too fixated on this term information, because it really, it means differences that make a difference, or being aware of differentials.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5923.295,
    "end": 5924.456,
    "text": "So, I mean, I...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5927.145,
    "end": 5927.845,
    "text": " I agree with that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5928.205,
    "end": 5933.087,
    "text": "I mean, again, I always go back to just the sort of bedrock stuff.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5933.107,
    "end": 5938.789,
    "text": "So I think Shannon's interpretation of information was actually a little bit unnecessarily epistemic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5939.049,
    "end": 5940.589,
    "text": "I think it could have been just doxastic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5941.129,
    "end": 5943.95,
    "text": "So he says, you know, it's coming to know something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5943.97,
    "end": 5948.291,
    "text": "It's like, well, but we could generalize that and just talk about what one comes to believe.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5948.692,
    "end": 5953.413,
    "text": "And then I think if we work with that notion, which isn't information anymore, as Shannon defined it,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5953.786,
    "end": 5954.826,
    "text": " because he talked about knowledge.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5955.427,
    "end": 5961.849,
    "text": "But whatever that generalization of information is called, I think that would really conduct logic things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5963.81,
    "end": 5969.512,
    "text": "Yeah, so that's all that I think we're getting at with the concept of information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5969.552,
    "end": 5977.054,
    "text": "But what I think is really interesting and difficult philosophically is, OK, so obviously there's self-information, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5977.134,
    "end": 5981.216,
    "text": "So there's just like something pings my retina and or, you know,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5982.958,
    "end": 5986.839,
    "text": " something downstream from that and I notice a little flip in my visual field, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5987.119,
    "end": 5988.66,
    "text": "And that's something I'm aware of.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5988.74,
    "end": 5990.781,
    "text": "So that's information about itself anyway.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5991.161,
    "end": 6000.084,
    "text": "But then the more important signals carry all sorts of information about other things, meaning I guess they lead us to predict and expect other differences beyond themselves.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6000.824,
    "end": 6003.125,
    "text": "And so the tricky thing to me is, okay, so",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6004.005,
    "end": 6013.273,
    "text": " I take myself to be this system of interacting parts, neurons and also other things, obviously, that sort of embodies a perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6014.074,
    "end": 6021.58,
    "text": "And the information that a signal carries depends on that whole system and how this signal impacts it, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6022.581,
    "end": 6025.964,
    "text": "And, you know, one of my neurons is an entirely different type of system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6027.345,
    "end": 6028.746,
    "text": "Here's my daughter who has to tell me something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6028.766,
    "end": 6029.066,
    "text": "What's up?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6029.887,
    "end": 6030.628,
    "text": "You got ice cream?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6031.168,
    "end": 6031.588,
    "text": "Awesome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6031.969,
    "end": 6032.169,
    "text": "Sorry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6034.23,
    "end": 6039.253,
    "text": " Um, sorry, that's cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6041.254,
    "end": 6041.915,
    "text": "That's awesome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6042.295,
    "end": 6046.337,
    "text": "Um, yeah, so your generative models on a live stream right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6046.458,
    "end": 6046.918,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6046.938,
    "end": 6049.099,
    "text": "That's cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6049.659,
    "end": 6049.96,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6050.7,
    "end": 6051.921,
    "text": "Um, I don't know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6052.141,
    "end": 6054.482,
    "text": "So I was saying something about neurons and then now I'm thinking about ice cream.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6055.183,
    "end": 6055.303,
    "text": "Um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6056.598,
    "end": 6068.463,
    "text": " Basically, yeah, so the question for me is, so I think of content or the information content of a signal or a person as relative to the person, to the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6069.263,
    "end": 6077.226,
    "text": "And so if you've got a completely different system with a different structure, I think you can sort of compare the structures of the systems to see how similar the content is, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6077.906,
    "end": 6084.249,
    "text": "But I think it has to be at that whole level of the sort of holistic entire system level that you need to make these content comparisons.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6086.152,
    "end": 6090.364,
    "text": " So I don't remember whether that directly links back to where we started this, but...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6092.742,
    "end": 6120.339,
    "text": " nice yeah one one quick thought on that is the the difference that makes a difference which is also a big key term in the philosophy of biology like the mutation is the difference that makes a difference for something um in active inference it's the difference in observation that makes a difference for either the generative model updating that's inference or the difference that makes a difference for action so we have a way to talk about it and then also um the doxastic note",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6121.829,
    "end": 6127.971,
    "text": " not my total area, but it looks like this is how we can work towards pluralism across perspectives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6128.392,
    "end": 6137.275,
    "text": "Because if it's framed as one person believes that it's hot and one person believes that it's cold, if there's only one truth and we're gonna play tug of war, then we have to fight.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6137.935,
    "end": 6141.857,
    "text": "But if it's true that one person believes it's hot and it's true that one person believes it's cold,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6142.725,
    "end": 6143.365,
    "text": " there's no problem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6143.906,
    "end": 6155.732,
    "text": "There still might be differences on what temperature the people want the room, but by framing things about what a perspective or a system or an agent believes to be true or just believes period, it could be an ironic belief.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6156.292,
    "end": 6163.956,
    "text": "All of a sudden we can interact with multi-agent systems and deal with them in a way that still has local logic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6164.777,
    "end": 6166.958,
    "text": "So Steven, and then anyone else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6171.877,
    "end": 6173.238,
    "text": " So thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6173.578,
    "end": 6194.194,
    "text": "Just sort of closing out, I suppose, in a way, I'd be curious how this work with beliefs that has a nice, as Daniel said, it bridges action-orientated approaches and pragmatic approaches with more epistemic approaches, because beliefs tend to be beliefs about what will happen when something happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6194.714,
    "end": 6220.266,
    "text": " done in the world often not necessarily and I'm curious how this paper and this kind of underpinning relates or helped to inform where you were going with a new paper that was intriguing about the folk psychology and how maybe that that there's some sort of that's where one of the bridges out from this paper into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6221.246,
    "end": 6228.211,
    "text": " you know, folk psychology being how we kind of intuitively believe the world is based on our experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6228.691,
    "end": 6239.739,
    "text": "So there is a certain element of like, whether that's how it's structured in the brain, it's kind of how we might structure it before science tells us something else, in a certainly in a socio cultural sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6239.759,
    "end": 6243.742,
    "text": "So I'd be interested in how that extension plays out with this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6244.912,
    "end": 6249.098,
    "text": " Yeah, so there's definitely a direct connection between this paper and that one.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6249.118,
    "end": 6255.908,
    "text": "I mean, I wanted to write a sort of sequel to this paper where I talked about specifically desires and how those sort of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6257.768,
    "end": 6265.014,
    "text": " the way those would be grounded in thermodynamics, according to this picture, or co-native states in general, like the states with a world-to-mind direction of fit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6266.655,
    "end": 6280.266,
    "text": "And so then I started talking to Ryan Smith and others about this, and we ended up co-authoring a quite different paper that has some commonality, but I still want to write one that's more on the thermodynamic side of things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6280.687,
    "end": 6286.992,
    "text": "But the connection is, in this sort of identity thesis at the end of this paper,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6287.772,
    "end": 6297.677,
    "text": " I argue for it by way of David Lewis, who one of the terms in the identity is the implicit definition that folk psychology gives us of mental states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6299.357,
    "end": 6301.818,
    "text": "So we haven't really gotten into that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6302.118,
    "end": 6303.679,
    "text": "Maybe we will next week or something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6303.739,
    "end": 6304.039,
    "text": "I don't know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6304.079,
    "end": 6305.26,
    "text": "There's Ramsey sentences.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6305.28,
    "end": 6307.881,
    "text": "I'd love to talk about those.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6308.061,
    "end": 6309.882,
    "text": "We got the Ramsey sentences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6310.182,
    "end": 6312.203,
    "text": "We got the sleep-wake simulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6312.223,
    "end": 6316.745,
    "text": "We have a few other topics that we will really look forward to exploring.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6317.185,
    "end": 6318.426,
    "text": " Yeah, let's please get into that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6318.486,
    "end": 6328.074,
    "text": "But like, basically, I mean, I don't know, as usual, I always feel like I'm not doing an adequate job of answering questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6328.154,
    "end": 6328.475,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6329.075,
    "end": 6335.541,
    "text": "But by folk psychology in this context, I'm really thinking of just our, it's sort of like theory of mind, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6335.561,
    "end": 6341.866,
    "text": "It's like our implicit theory of the way people, including ourselves, function.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6341.986,
    "end": 6343.627,
    "text": "So I think that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6344.804,
    "end": 6371.626,
    "text": " that's essential even though it's not highlighted until the end that's essential to what i'm doing in this paper because if you don't have mental states to define then you don't have any identity relation because that's one of the terms in the identity relation although you could also i guess maybe if you're doing pure bayesian modeling you could just write down a bunch of states and equations for how they update um without thinking about folk psychology at all but but i guess the point of this is that um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6372.884,
    "end": 6378.19,
    "text": " if one of the terms in this relation is the mind, well, I think folk psychology, I don't actually love that term.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6378.21,
    "end": 6379.551,
    "text": "I mean, it's okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6379.732,
    "end": 6381.273,
    "text": "It's a philosopher's term of art, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6381.694,
    "end": 6387.38,
    "text": "I just mean intuitive human psychology, I think is one of the terms in this relation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6389.073,
    "end": 6391.074,
    "text": " Ooh, scientists are folk too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6391.834,
    "end": 6405.021,
    "text": "So cognitive diversity means that we have all different ways of knowing and there may not be one default or simply intuitive way of working or knowing because what's intuitive to one person will be out of the groove for somebody else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6405.561,
    "end": 6415.906,
    "text": "And that's why the movement towards pluralism in terms of our understanding of ideas and of ecosystems is so interesting to talk about and see connected to active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6417.273,
    "end": 6427.192,
    "text": " Any thoughts or what would be something that somebody is excited from the conversation today or thinking about how we could resolve or at least introduce again next week?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6429.17,
    "end": 6453.139,
    "text": " think a few of the things we have written down is the sleep wake simulation what is that agent doing what does it do in terms of your model we have the ramsey sentences and where does that style of logical representation come into play we have empirical validity what kind of experiments are you interested in or curious about what what else could be interesting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6455.368,
    "end": 6459.495,
    "text": " we could still talk about the contrastive divergence versus simulated annealing thing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6461.879,
    "end": 6466.287,
    "text": "I just really briefly wanted to follow up and say I think when I say intuitive",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6467.093,
    "end": 6470.294,
    "text": " psychology, I mean, I don't mean to suggest that there's just one of those.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6470.534,
    "end": 6474.615,
    "text": "I think that but I do think we can sort of average over different perspectives to get that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6475.295,
    "end": 6478.856,
    "text": "So like the individual perspectives ultimately are what's real.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6479.276,
    "end": 6483.358,
    "text": "But if we want to talk about things at an abstract level, we could average over those.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6483.398,
    "end": 6485.038,
    "text": "And I think that's kind of what Lewis tries to do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6485.138,
    "end": 6487.219,
    "text": "So maybe this is something we'll get into next week.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6488.519,
    "end": 6500.688,
    "text": " But really, when he talks about folk psychology, he engineers it so that it doesn't have to be that there's just one set of statements that embodies what people think about psychology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6500.788,
    "end": 6505.291,
    "text": "It's like a disjunction of different sets that mostly overlap.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6508.526,
    "end": 6514.71,
    "text": " And just, yeah, I mean, pluralism is really, I think, is a good ideal in many contexts.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6515.631,
    "end": 6517.512,
    "text": "I actually think this would be interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6517.532,
    "end": 6518.392,
    "text": "This might be controversial.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6518.412,
    "end": 6526.157,
    "text": "I think it's not always the goal in science, because if you start out with pluralism, then you just don't do anything, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6526.397,
    "end": 6527.998,
    "text": "It's like, okay, everything's fine as it is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6528.339,
    "end": 6532.161,
    "text": "But I think sometimes we're seeking a unifying underlying explanation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6532.761,
    "end": 6535.043,
    "text": "And if you accept pluralism at the start, then you won't get there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6536.027,
    "end": 6564.774,
    "text": " that tension which is okay pluralism everybody must be pluralist and this is the only way it's actually absolutist and singular at a higher level and so pluralism means that we each do have our perspectives and yet there is a way of working it's not just the same thing as saying we have an absolute answer and it's that there's no answer that's the kind of local logical paradoxes that we see all around us that's a great point stephen and then anyone else",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6565.939,
    "end": 6569.42,
    "text": " Yeah, that's the rabbit hole of postmodernism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6569.44,
    "end": 6572.562,
    "text": "We don't want to go, but it's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6573.262,
    "end": 6574.962,
    "text": "This is a really rich conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6575.223,
    "end": 6587.127,
    "text": "And I think, like you say, to be able to jump from Helmholtz to some of these transcultural things is, you know, it shows you that it's pretty foundational, some of the stuff we're touching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6587.187,
    "end": 6587.947,
    "text": "So that's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6588.047,
    "end": 6591.029,
    "text": "So thanks for a lovely talk today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6591.049,
    "end": 6591.689,
    "text": "I really enjoyed it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6591.709,
    "end": 6592.029,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6592.429,
    "end": 6594.149,
    "text": " Yeah, thanks a lot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6594.309,
    "end": 6595.77,
    "text": "Any closing notes there, Alex?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6595.91,
    "end": 6601.371,
    "text": "Otherwise, we're all going to probably re-listen and re-read and think about what would be good to ask next week.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6602.571,
    "end": 6604.152,
    "text": "Yeah, no, thank you all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6604.272,
    "end": 6608.232,
    "text": "It's really fascinating and fun, and I just want to do more of it next week.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6608.493,
    "end": 6615.874,
    "text": "I'm very... I didn't have anything else to say, but I kept speaking.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6616.534,
    "end": 6619.195,
    "text": "I'm not sure why some of you do that sometimes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6620.723,
    "end": 6621.184,
    "text": " It happens.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6621.865,
    "end": 6625.471,
    "text": "So thanks again, everybody who's participating live and on live stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6626.012,
    "end": 6627.614,
    "text": "And we will see you next week.",
    "speaker": "SPEAKER_04"
  }
]