[
  {
    "start": 7.093,
    "end": 31.959,
    "text": " hello and welcome everyone to actin flab this is actin flab live stream number palindromic 22.0 it's may 13th 2021 and this should be a really fun discussion just to introduce ourselves at the beginning i'm daniel i'm a postdoctoral researcher in california and i am joined by dean go ahead oh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 32.896,
    "end": 33.337,
    "text": " I'm Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 33.397,
    "end": 34.318,
    "text": "I'm from Calgary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.778,
    "end": 35.339,
    "text": "I'm retired.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 36.12,
    "end": 41.265,
    "text": "And I'm kind of new to this active difference thing, but I'm trying to keep up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.227,
    "end": 43.888,
    "text": "I'm Blue Knight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.968,
    "end": 46.992,
    "text": "I'm an independent research consultant based out of New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.14,
    "end": 48.38,
    "text": " Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.68,
    "end": 53.541,
    "text": "So thanks to both of you so much for helping a lot on the slides and giving insights.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 53.941,
    "end": 60.042,
    "text": "And we're all going to be sort of working through this together because there's a lot of big ideas that are going to come up in this discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 60.363,
    "end": 67.724,
    "text": "And then we're going to have the next two weeks with Alex Kiefer, the author, and other participants on the .1 and .2 streams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 68.244,
    "end": 71.825,
    "text": "So we're just going to be surfacing probably more questions than answers today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 73.291,
    "end": 74.492,
    "text": " Welcome to ActifLab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 74.873,
    "end": 81.039,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 81.679,
    "end": 83.541,
    "text": "You can find more information at these links.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 84.162,
    "end": 89.707,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 90.628,
    "end": 95.093,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good livestream etiquette.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 96.343,
    "end": 111.447,
    "text": " We're preparing and setting the context for the discussions on May 18th and May 25th, 2021, where we'll be discussing the paper, Psychophysical Identity and Free Energy, which is a paper in 2020 by Alex Kiefer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 112.267,
    "end": 117.769,
    "text": "And just like the other .zeros, this is a context and a background and just an initial stab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 118.109,
    "end": 119.329,
    "text": "It's not a review paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 119.409,
    "end": 120.49,
    "text": "It's not authoritative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 120.81,
    "end": 124.311,
    "text": "This is us unpacking and exploring as we read the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.151,
    "end": 144.751,
    "text": " in preparation for the group discussions and similar to some of the other dot zeros we're going to start out with in the author's own words what are the aims and claims as well as abstract and roadmap and then we're going to ask some big questions we're going to talk about why it matters which is hopefully a discussion that includes everyone",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 145.311,
    "end": 158.839,
    "text": " And then we're going to meander through some quotes from the paper, some formalisms, some related reading, just a few ideas that we actually brought in during our learning process to help connect the dots.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 159.219,
    "end": 168.165,
    "text": "Because the paper is really like the tip of an iceberg, and there's a long history of information and thermodynamics, and that's even before you get to everything with the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 169.025,
    "end": 178.412,
    "text": " So we hope that this will be a educational experience, whether you're familiar with active inference and just learning about thermo or vice versa, or not familiar with either.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 179.113,
    "end": 182.675,
    "text": "Any overarching thoughts that either of you would like to bring up before we jump in?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 185.337,
    "end": 185.537,
    "text": "Nope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.379,
    "end": 187.699,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 188.119,
    "end": 192.503,
    "text": "So I'll read the first aim of the paper and then either of you would be welcome to give a thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 193.581,
    "end": 209.017,
    "text": " The target thesis of the paper is the claim that biological systems whose internal states come to encode statistical models as a result of spontaneous self-organization in response to environmental pressures, learn and make use of these models by minimizing their physical free energies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 209.798,
    "end": 220.867,
    "text": " The identity thesis, which is that yellow highlighted section, does not specify precisely which approach to variational inference is thereby implemented or the minimum value the variational free energy must take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 221.627,
    "end": 229.273,
    "text": "It may be, for example, that biological systems run an algorithm closer to contrastive divergence than simulated annealing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 231.495,
    "end": 238.941,
    "text": "So, a lot of terms, maybe first time hearing it or not, but what's something that draws either of you or made you curious to read about the paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 243.075,
    "end": 246.057,
    "text": " Well, for me, it was a contrastive piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 246.177,
    "end": 254.982,
    "text": "It was the idea that in order for this, any kind of a modeling effort to work, you can't start out by knowing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 255.022,
    "end": 259.804,
    "text": "You have to kind of have a bit of a fuzzy idea before there's anything that's edgy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 263.166,
    "end": 263.466,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.187,
    "end": 265.948,
    "text": "And the second, Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 267.551,
    "end": 280.981,
    "text": " Yeah, so the second piece of the aims and claims here, and very timely, what is exciting about an identity thesis in 2020, and we also hope in 2021 and probably beyond, is not so much its opposition to Cartesian dualism,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 282.011,
    "end": 283.832,
    "text": " because many people are that way today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 284.092,
    "end": 285.392,
    "text": "But what does make it exciting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 285.832,
    "end": 294.275,
    "text": "Well, one, the fact the connection between mind and body is drawn at the level of physics undercutting even neuroscience as a reduction base.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 294.515,
    "end": 296.836,
    "text": "So strength for some, weakness for others probably.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 297.496,
    "end": 306.979,
    "text": "Two, that the reasons for which and the precise way in which identity is realized can be discerned at least in broad strokes on the basis of current science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 308.081,
    "end": 312.525,
    "text": " And three, that the theory is accordingly expressed in quantitative terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 313.186,
    "end": 316.269,
    "text": "So this is not your run-of-the-mill anti-Cartesian dualism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 316.529,
    "end": 319.913,
    "text": "This is that 2020 flavor, and it has more science now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 322.702,
    "end": 324.783,
    "text": " So this for me was really awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.903,
    "end": 337.527,
    "text": "I mean, I am always looking for the expansion of the mind-brain duality to incorporate the body, because I think that it's been overlooked for quite a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.847,
    "end": 341.048,
    "text": "And it's nice to see that incorporation in this thesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.029,
    "end": 342.289,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 342.829,
    "end": 344.709,
    "text": "We'll definitely be able to return to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 346.01,
    "end": 346.37,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 346.73,
    "end": 348.871,
    "text": "So let's turn to the abstract.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 349.847,
    "end": 351.008,
    "text": " It's three sentences long.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 351.288,
    "end": 352.409,
    "text": "Would either of you like to read it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 355.971,
    "end": 356.291,
    "text": "I can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 358.412,
    "end": 370.639,
    "text": "An approach to implementing variational Bayesian inference in biological systems is considered under which the thermodynamic free energy of a system directly encodes its variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 372.58,
    "end": 378.524,
    "text": "In the case of the brain, this assumption, I like that, places constraints on the neuronal encoding of generative",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.358,
    "end": 385.099,
    "text": " and recognition densities, in particular requiring a stochastic population code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 385.559,
    "end": 390.861,
    "text": "And some people may know what that means, but I'm sure we'll parse that in a minute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 391.081,
    "end": 403.984,
    "text": "And the resulting relationship between thermodynamic and variation of free energies is prefigured in mind-brain identity, theses, in philosophy, and in the Gestalt hypothesis,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 405.035,
    "end": 425.997,
    "text": " psychophysical isomorphism and i didn't know anything about gestalt before i read this paper yep this paper it's like relating the relations because the little kernel down there at the root is mind brain identity theses and we'll return to this but that's the relationship between mind and brain between the physical and the mental",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 426.838,
    "end": 445.824,
    "text": " and then how is that as a kernel the mind-brain identity thesis related to on one hand qualitative areas like the gestalt theorizing which we'll talk about and then on the other hand more quantitative areas like the formalisms related to information dynamics and thermodynamics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 447.964,
    "end": 449.325,
    "text": " let's go to the roadmap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 450.065,
    "end": 456.948,
    "text": "So the roadmap, it's nice because first off, there's only a few stops on the roadmap, but there's a lot of freeway between each stop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 458.649,
    "end": 468.094,
    "text": "On the right are the sections that were in the paper, and on the left is how Alex wrote out in a narrative way, the roadmap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 468.114,
    "end": 475.938,
    "text": "So we kind of have the turn by turn on the right side, and then we have a little bit of the expert giving you a guidebook on the left.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 476.678,
    "end": 482.042,
    "text": " And it starts with an introduction and goes straight to formal equivalences between what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 482.382,
    "end": 484.964,
    "text": "Well, between free energy and a lot of other things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 485.924,
    "end": 489.066,
    "text": "A transparent code, a little bit of an oxymoron there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 489.266,
    "end": 491.628,
    "text": "I thought codes were supposed to be oblique.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 492.428,
    "end": 493.989,
    "text": "But what is a transparent code?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 494.53,
    "end": 503.356,
    "text": "And eventually, how does it lead to this free energy identity thesis being proposed in 3.2 and then discussed more in Section 4?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 505.031,
    "end": 505.932,
    "text": " Then there's a conclusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 506.713,
    "end": 510.177,
    "text": "So it's a pretty dense paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 511.138,
    "end": 515.643,
    "text": "And what did anyone think about just the roadmap or just getting from A to Z?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 520.428,
    "end": 521.549,
    "text": "Can I speak to that for a sec?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 522.09,
    "end": 522.31,
    "text": "Please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 522.971,
    "end": 523.752,
    "text": "Yeah, so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.81,
    "end": 533.015,
    "text": " The first reading of this, when I saw transparent code, I wondered about that as well, a lot, because I didn't even see it as oxymoronic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 533.095,
    "end": 536.077,
    "text": "I just wanted to know how that was going to get unpacked.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.898,
    "end": 547.183,
    "text": "And the other thing I've found really interesting on first reading, and both of those sections three and four changed by the time I'd read through the paper a third time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.963,
    "end": 551.786,
    "text": "But then the whole idea of isomorphism to identity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 553.829,
    "end": 567.794,
    "text": " I came around to the idea that I think he was talking a little bit about the ability to be an identifier as one of those measures of sort of quantitative measure of what an identity could look like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.834,
    "end": 576.358,
    "text": "He doesn't really get into, he still throws possible in there quite often in the paper, which I think is really a good thing to do because he doesn't try to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 577.762,
    "end": 587.312,
    "text": " Doesn't try to bring it down to absolutes, which I think is smart, given, as you said, the density of the stuff he's trying to look at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.775,
    "end": 590.055,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 591.076,
    "end": 591.677,
    "text": "Blue, anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 591.757,
    "end": 593.599,
    "text": "Otherwise, we'll go to the big questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 595.54,
    "end": 606.512,
    "text": " Other than it was a really pretty rocky road to get from A to Z. And it, you know, I just kind of had no idea really where this was going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.572,
    "end": 609.375,
    "text": "So it was nice to see it evolve as it unfolded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.563,
    "end": 612.906,
    "text": " I just always keep in mind the paper's finite.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.186,
    "end": 621.696,
    "text": "I will get to the end if I just crunch line by line and somebody who knows way more than me on this topic thought way more than me on the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 621.997,
    "end": 628.184,
    "text": "So let's just trust the author, not in every single claim, but at least in the structure and go from there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 628.965,
    "end": 630.847,
    "text": " Well, why does it matter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 631.408,
    "end": 642.36,
    "text": "Why are we spending our regime of attention reading this paper clearly multiple times each and digesting it and turning it around and having discussions on a chat forum?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 642.76,
    "end": 650.228,
    "text": "What is bringing us to the table from very different backgrounds and hopefully you as well to think about and be curious about this paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 651.409,
    "end": 673.386,
    "text": " um the three things we wrote down here and then either of you feel free to unpack one or any why does it matter well continuing existence depends on efficient energy use it's important to understand what life is as well as how we model it and it's interesting to think about information identity and physics what brought any of you to the table",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 674.622,
    "end": 680.01,
    "text": " Well, so just to comment on the distinction between life and how we model it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.11,
    "end": 691.666,
    "text": "I mean, I think this is very relevant to the discussions that we've been having on realism and instrumentalism and really a fundamental way to clarify that distinction, I think, which was nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.749,
    "end": 694.029,
    "text": " Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 694.89,
    "end": 703.233,
    "text": "And the big questions of the paper, which are sort of a little bit drawing from quotes from Alex, other times us linking the questions together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 704.214,
    "end": 714.698,
    "text": "One is how might models of psychology action and perception such as Gestalt, but basically just psychological theories that might have no math involved at the first pass.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 715.178,
    "end": 720.421,
    "text": "How could those math free ideas be connected to formal equations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 721.061,
    "end": 724.363,
    "text": " potentially those related to certain kinds of statistical inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 724.843,
    "end": 727.465,
    "text": "So how are we going to connect psychology to equations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 727.965,
    "end": 728.686,
    "text": "Big question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 729.567,
    "end": 740.754,
    "text": "Two, after realizing some of these resonances between certain types of statistical inference and information and thermodynamics, as well as potentially mind and the brain,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 741.969,
    "end": 744.851,
    "text": " is there any way to bring that all together?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 745.231,
    "end": 752.456,
    "text": "You know, we have apples and oranges, but maybe we can make a still life that has apples and oranges and they're each in their own place and it kind of makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 753.717,
    "end": 760.522,
    "text": " And then the third point here is the biggest question perhaps, which is where does identity come from or what is identity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 761.162,
    "end": 764.544,
    "text": "How would we measure that or characterize it or determine it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 765.645,
    "end": 774.411,
    "text": "And I think one hint perhaps from Dean was to start with identity formation, what it is not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 775.812,
    "end": 781.236,
    "text": "So then there was a quote there about comparing with neuronal networks and computers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 783.652,
    "end": 785.434,
    "text": " Any other thoughts here before we jump into keywords?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.435,
    "end": 794.164,
    "text": "So this quote, the difference between living systems and computers, I think it would have been nice to see that up front.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.045,
    "end": 804.876,
    "text": "I kind of had no idea where the paper was going and that it was going to come to this really solid kernel of meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.356,
    "end": 805.596,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.917,
    "end": 811.423,
    "text": "And so it would have been nice to have some hint of that, like foreshadowing, maybe like an introduction or the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.463,
    "end": 818.772,
    "text": "But I was like, had no idea where this was going and actually pleasantly surprised, like wrapping a gift wrapped in, you know, 10 different boxes at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.577,
    "end": 822.199,
    "text": " It went better than expected, you know, in active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 822.319,
    "end": 823.96,
    "text": "What could we want other than that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 824.74,
    "end": 829.863,
    "text": "But it does say that it provides a criterion for distinguishing minds from relatively crude simulations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 830.304,
    "end": 838.509,
    "text": "Like, Blue's alive and was just speaking, but if it was just the voice being played from a speaker, is that going to be counted as alive because it's making noise as well?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 839.129,
    "end": 842.291,
    "text": "Well, if not, we want something richer than just making noise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.451,
    "end": 843.052,
    "text": "What is that going to be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 843.772,
    "end": 844.612,
    "text": " How are we gonna get there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 844.933,
    "end": 846.373,
    "text": "We're gonna start with some of the keywords.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 847.074,
    "end": 853.117,
    "text": "And just like there was only three sentences in the abstract and in the final paragraph, there was only three given keywords.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 853.998,
    "end": 861.301,
    "text": "And so rather than do a keyword driven intro and then walk through the paper, we're gonna kind of do a little bit of both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 861.502,
    "end": 866.344,
    "text": "We're gonna give some background information and some frame setting on the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 866.664,
    "end": 870.947,
    "text": "And then we're going to walk through the paper and where we need to introduce a formalism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 871.567,
    "end": 874.2,
    "text": " will just kind of unpack it there and share resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.359,
    "end": 875.599,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.219,
    "end": 880.462,
    "text": "So earlier we were talking about how it's kind of relating different relationships.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 881.442,
    "end": 889.066,
    "text": "And this slide, a little bit abstractly, a little bit provocatively, a little bit ambiguously, is relating those relationships.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 889.686,
    "end": 893.228,
    "text": "So at the top... Yeah, Dee, what... Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 893.849,
    "end": 894.749,
    "text": "Because of the twist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.069,
    "end": 901.132,
    "text": "And I think when I saw it, I mean, I didn't anticipate ants, which is cool too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.073,
    "end": 903.594,
    "text": "But the fact that there's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.474,
    "end": 920.864,
    "text": " there's a twist in it i actually think is is what we're talking about it's i i think i think that will i think that will again surface as we go deeper into today's conversation but actually i was like whoa",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 922.079,
    "end": 922.519,
    "text": " Very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.12,
    "end": 923.4,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 923.9,
    "end": 931.426,
    "text": "So what we were trying to get at here is to link the topics and then see how those topic linkages are linked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 932.187,
    "end": 935.129,
    "text": "So the mind and the brain are these two nodes on top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 935.97,
    "end": 939.333,
    "text": "And the question is, how are the mind and the brain related?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 939.853,
    "end": 945.901,
    "text": " And you can check out the mind-brain identity thesis to learn more about what a few previous perspectives have been.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 946.281,
    "end": 948.464,
    "text": "But one can imagine there's all kinds of takes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 948.704,
    "end": 949.505,
    "text": "They're the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 949.545,
    "end": 950.487,
    "text": "They're totally different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 950.507,
    "end": 951.708,
    "text": "They're a little bit related.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 952.069,
    "end": 954.131,
    "text": "So that's how the mind and the brain are linked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 954.972,
    "end": 957.733,
    "text": " And then on the bottom, we have these two nodes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 958.073,
    "end": 960.594,
    "text": "One of them is actual thermophysics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 960.954,
    "end": 965.696,
    "text": "So candles actually burning, balls actually rolling to the bottom of a hill.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 966.276,
    "end": 972.218,
    "text": "And then on the right side, we have human models resembling patterns that we see in thermophysics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 973.098,
    "end": 991.413,
    "text": " And the question of the linkage here is, how are, just like how are the mind and the brain related, how are actual thermodynamics, so instead of skin in the game, ATP in the game, actual thermo, related to maybe some equations in other domains that make us think about information dynamics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 992.154,
    "end": 1000.001,
    "text": "So those are the level one linkages, first between mind and brain, and second between actual thermo and models that are akin to thermo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1001.258,
    "end": 1028.342,
    "text": " then this next slide is a little bit of a multi-play but it's saying maybe by juxtaposing these relationships also with a nod to gestalt and illusions with the arrow illusion maybe by us as the observer juxtaposing these relationships we gain new insight and maybe fep which is sort of the little ants crawling all around the sides",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1028.982,
    "end": 1043.078,
    "text": " Maybe the FEP is that permeable membrane or it's the framework that's strong enough for us to build within and subspecify, but it's also permeable in that it allows us to be open to new ideas coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1044.079,
    "end": 1048.38,
    "text": " And the psychophysical identity thesis is kind of smack dab in the middle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1048.92,
    "end": 1050.761,
    "text": "It's relating these relationships.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1051.361,
    "end": 1059.603,
    "text": "So if there were four things that get brought together, I think it would be these four, mind and brain, and then actual thermo and models of thermo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1060.043,
    "end": 1066.865,
    "text": "And the way to link them is to first make the pairs and connect the pairs and then see how those linkages are contrasting or similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1068.868,
    "end": 1074.071,
    "text": " Danny, would you say that part of this too, though, is the fact that they are parallel and apart?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.191,
    "end": 1076.232,
    "text": "I mean, we build a relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.672,
    "end": 1078.714,
    "text": "We've already sort of confirmed that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1080.134,
    "end": 1082.176,
    "text": "But is it a connection?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1082.336,
    "end": 1084.557,
    "text": "And I'm not saying that in a questioning way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1085.798,
    "end": 1087.399,
    "text": "I think it's a legitimate question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1087.439,
    "end": 1092.201,
    "text": "I'm not sure that the way that we quantify that confirms it or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1092.301,
    "end": 1092.922,
    "text": "But maybe I'm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1094.482,
    "end": 1096.422,
    "text": " grasping at something that isn't there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1097.123,
    "end": 1104.144,
    "text": "I agree that this relationship exists, but I'm not sure if it's a connection, but that's just me wondering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1106.285,
    "end": 1111.786,
    "text": "Perhaps it's reflective of the instrumentalism versus realism debate, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.846,
    "end": 1122.989,
    "text": "Like, so thermophysics is a model and the human system is like an alive system with some kind of concrete existential purpose, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.029,
    "end": 1123.509,
    "text": "So we assume.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.554,
    "end": 1142.265,
    "text": " yeah it's almost like real on the left side and then more like an instrument on the right side because the brain does have thermodynamic constraints it generates heat it takes in glucose it's doing metabolism if you cool it down it stops so that's like a candle and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1143.286,
    "end": 1144.267,
    "text": " what is the mind?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1144.827,
    "end": 1151.892,
    "text": "Especially if the mind is kind of higher order and reflexively making a model of itself in an interesting way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1152.332,
    "end": 1163.4,
    "text": "But if the brain, like a physical energy consuming object, is like a candle, that's this left side, people might draw a link between those two, draw an edge between the brain and actual thermo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1163.54,
    "end": 1165.481,
    "text": "And we're going to get to that in just a few slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.121,
    "end": 1172.466,
    "text": "And then the question is, well, what's the relationship then between these thermo-inspired models on the bottom right and the mind?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1173.286,
    "end": 1191.172,
    "text": " is it that the brain is actually minimizing free energy or is it that we can model it as minimizing free energy what is happening here let's go to the psychophysical isomorphism i'll play this video and um blue what made you interested in this video",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1192.008,
    "end": 1198.273,
    "text": " So I saw the term psychophysical isomorphism in the abstract, and I was like, what is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.293,
    "end": 1205.378,
    "text": "It's the Gestalt hypothesis of psychophysical isomorphism, and I was like, those are really big words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.898,
    "end": 1207.319,
    "text": "I just don't have the background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.64,
    "end": 1212.303,
    "text": "So I wanted to look up the concept, and it comes from the expression that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.484,
    "end": 1221.249,
    "text": " The properties of the mind and the consciousness are a direct consequence of the electrochemical interactions within the physical brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.809,
    "end": 1225.672,
    "text": "And so this is the phi phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.712,
    "end": 1226.592,
    "text": "The video, did it work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.012,
    "end": 1228.213,
    "text": "It's not playing on my end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.513,
    "end": 1234.857,
    "text": "So this phi phenomenon is an example of where the patterning of a stimulus and the activity in the brain is similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.137,
    "end": 1237.499,
    "text": "And that's why it makes this like illusion of motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.81,
    "end": 1240.07,
    "text": " Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1240.631,
    "end": 1245.918,
    "text": "It's almost like we're connecting the dots, but here it's shown with negative space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1245.978,
    "end": 1252.727,
    "text": "That's an entry point into thinking about Gestalt more broadly, or is there anything else you want to add on this slide?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1252.747,
    "end": 1253.748,
    "text": "That's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1254.901,
    "end": 1278.534,
    "text": " what is gestalt well people live their life teaching it so we're not going to cover it in one slide but we can cover some of the ways in which it was used in the paper as well as just a few little tidbits which kind of on our active inference foragers path were cool so first just as a design principle on the slide you visually and this is a culturally uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1280.282,
    "end": 1287.151,
    "text": " scaffolded process separate, for example, if you're not colorblind, the red shape out from the black text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.631,
    "end": 1291.576,
    "text": "And so it's almost like there's this organization that arises when we're viewing material.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1292.377,
    "end": 1298.184,
    "text": "And that turns out to be patterns that we can study, like reification on the left side here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1299.025,
    "end": 1324.816,
    "text": " we do see quote a triangle like a white triangle in a even though it's the negative space of these other pac-man type shapes and so gestalt is this big area of theory so check out the word itself terms like figure and ground and all these related fields and what are we getting at that's bigger than all of these examples what does reification of shapes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1325.996,
    "end": 1331.955,
    "text": " and multi-stability like illusions have to do with this notion of invariance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1332.881,
    "end": 1340.908,
    "text": " Like the idea that by looking at different angles of a shape, we can recognize that an object is invariant, even though computers often have trouble with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1341.629,
    "end": 1350.176,
    "text": "So it's almost like if you're working towards grasping it or you're seeing that there's something bigger behind these examples, that's kind of gestalt.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1350.696,
    "end": 1352.138,
    "text": "It's hinting at the whole.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1352.798,
    "end": 1355.681,
    "text": "And so it's very related to holism and relational thinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1356.681,
    "end": 1362.663,
    "text": " but we can dig one more level into Gestalt and just look at how Alex used it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1363.763,
    "end": 1376.168,
    "text": "And in the paper, it says, this work, the paper that we're reading and other work by Carl Fristen and collaborators confirms a systematic link between variational free energy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1377.168,
    "end": 1403.394,
    "text": " even if it's your first time hearing it it's all good variational free energy and thermodynamic potential energy interestingly this view is presaged not only by the identity theorists in philosophy but also quite precisely by the gestalt psychologists who suppose that the perceptual phenomena as subjectively experienced had structures isomorphic same shape to their underlying physiological correlates",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1404.714,
    "end": 1432.302,
    "text": " and does that mean when you're looking at a triangle that there's another triangle that's the same exact thing in your head well not the same exact thing but maybe something that's structurally isomorphic or the same shape and so to unpack that and to also evaluate the author's claim is it really true that this area of science that we think is super awesome and advanced in 2021 is it really true that it was pre-saged so we can go to these citations like this 1935 citation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1434.002,
    "end": 1439.823,
    "text": " and just copying out the contents and doing a little color coding, look at the titles of the sections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1441.001,
    "end": 1449.346,
    "text": " Chapter two has to do with behavior and sets up the problem, but chapter three through seven, it's about the environmental field, the field of affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1449.866,
    "end": 1453.388,
    "text": "This is what we've been talking about with a lot of our different discussions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1453.949,
    "end": 1463.134,
    "text": "And then action, memory, learning, and at the end, a little bit of a closing note on even society and personality and probably what it means to be a person and an individual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1463.735,
    "end": 1466.736,
    "text": "So we are seeing a lot of these terms, which should really,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1467.717,
    "end": 1495.747,
    "text": " bring us to slow down and think about how we can tie different knowledge traditions and perspectives together in the way that alex has done and hopefully in a way that we can also do when we come together to discuss any thoughts on gestalt okay now we're gonna switch gears from the ecological field and psychology to thinking a little bit more quantitatively about statistical inference and metabolism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1497.307,
    "end": 1507.715,
    "text": " Alex wrote that the argument at hand is meant to support a slightly less abstract isomorphism or identity directly between variational and thermodynamic free energy descriptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1508.415,
    "end": 1516.421,
    "text": "This argument is consistent with a detailed treatment of metabolic efficiency of variational inference given in 45, which is a Sengupta et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1517.242,
    "end": 1519.284,
    "text": " paper with Carl Fristen in 2013.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1519.725,
    "end": 1528.553,
    "text": "So for those who are interested in active inference, check out where active inference was in 2013 and think about how what has happened since then changes our understanding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1529.394,
    "end": 1538.162,
    "text": "But just to pull one figure from this paper, which is thinking about energy use in nervous systems, it's showing how the sensory environment, whatever's out there,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.903,
    "end": 1547.293,
    "text": " is going to get encoded, this is where that transparent code is going to come into play, into a format that allows control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1547.974,
    "end": 1551.118,
    "text": "Gain control of the sensory input as well as action control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1551.879,
    "end": 1555.022,
    "text": "And it has to be done in a way that's thermodynamically viable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1555.723,
    "end": 1563.588,
    "text": " So you'll often hear things like the brain processes this much information or it uses that much energy as if it were just like some sort of desktop computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1564.229,
    "end": 1571.374,
    "text": "But it's pretty clear from just a first pass understanding that it's not just doing what my video card is doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1572.014,
    "end": 1577.0,
    "text": " Vision isn't just the RAM going back to the video card and back and forth with a processor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1577.54,
    "end": 1589.874,
    "text": "So how is it that brains and cells and all kinds of biological systems are able to act effectively when it's pretty clear that they're not doing it like our heat producing computers are doing it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1591.345,
    "end": 1593.447,
    "text": " So this is sort of where we're looking at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1593.647,
    "end": 1611.22,
    "text": "How do biological organisms do good inference on the very complicated sensory environment and represent all of these wild stimuli in a way that allows for effective control of the inputs and do that without overheating or requiring just a ton of energy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1613.442,
    "end": 1614.603,
    "text": "Let's go to free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1617.205,
    "end": 1619.147,
    "text": "Want to start here, Blue, or I can start?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1619.447,
    "end": 1619.567,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1623.874,
    "end": 1648.576,
    "text": " Free energy in the context of variational Bayesian inference is a functional of a probability distribution or density Q used to approximate the, in practice, typically intractable joint posterior distribution P of H V of data V together with the unobserved causes of those data H under a statistical model whose parameters may also be unknown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.756,
    "end": 1652.616,
    "text": " Sorry, go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1652.696,
    "end": 1657.378,
    "text": "Just that Q is the one that we can control, and Q is our guy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1658.138,
    "end": 1665.521,
    "text": "Then the one that we can't get at is the actual distribution, P, of two different things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1666.101,
    "end": 1687.584,
    "text": " the data which is what we definitely have so that's good but then the unobserved causes of the data h and sometimes h is hypotheses like i hypothesize that it's raining and so what are the data that you get well maybe it's visual or maybe it's tactile data but you're going to be able to control your estimate of whether it's raining q",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1689.105,
    "end": 1716.452,
    "text": " And then what you're trying to get at is that total distribution P, part of which you can get at with H and V. So we're going to be trying to talk about a way to bring what we can control, our internal generative model, and align that distribution through optimization to really complicated distributions in the world that might have many more degrees of freedom or a lot more variability than we could possibly handle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1718.007,
    "end": 1727.697,
    "text": " And another nice quote on the bottom in yellow is, free energy captures the discrepancy between the organism's generative model of the world and the current environmental conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1729.025,
    "end": 1741.69,
    "text": " So that's kind of cool, and we've seen that come into play in the context of the predictive processing or the hierarchical predictive processing framework, which is shown here from Ramsted et al, answering Schrodinger's question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1742.33,
    "end": 1753.195,
    "text": "It's a figure that's showing how there's sort of a bottom-up, which is sometimes associated with sensory input, and a top-down, sometimes associated with priors about the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1753.695,
    "end": 1755.116,
    "text": "These two interacting streams",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1755.956,
    "end": 1758.718,
    "text": " And they're in a multi-level way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1759.038,
    "end": 1762.5,
    "text": "So each level is only getting past up or down one level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.201,
    "end": 1768.464,
    "text": "And what's going up are these sensory inputs and unaccounted for errors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1768.885,
    "end": 1771.166,
    "text": "And what's coming down is expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1771.687,
    "end": 1776.27,
    "text": "So if the bottom up is exactly what you expect, it's almost like the system is resting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1776.85,
    "end": 1780.012,
    "text": "So in other words, if the model is perfect, given the visual data coming up,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1781.673,
    "end": 1797.172,
    "text": " everything is very chill and things are not chill to the extent that the bottom-up information is surprising so what is getting passed up and under the free energy principle maybe it's free energy but what is free energy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1800.02,
    "end": 1818.575,
    "text": " Another way to look at this question about the relationship between the observations in the world, which are called data in many cases, and the generative model of the world is with the paper that we discussed in ACT-INF number six, Tale of Two Densities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1821.405,
    "end": 1828.734,
    "text": " Variables and parameters, they're used often loosely because when you're dealing with programs, everything's a variable, everything's a parameter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1829.255,
    "end": 1835.542,
    "text": "So it can be a little bit confusing to which kind is which, but the data parameters are the observables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1836.123,
    "end": 1838.966,
    "text": "And the recognition model in Bayesian statistics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1839.807,
    "end": 1862.57,
    "text": " is the model that recognizes the data and forms hyper parameters about the data for example um the hyper parameter might be like the location of an object and the data might be the actual retinal cells giving raw input and so the recognition model is going from that retinal input to a hyper parameter of where is the object located and then that can be used",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1863.371,
    "end": 1873.115,
    "text": " in an invertible way with a generative model that goes from, okay, given where it is in the estimated location, what kind of data would be generated from that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1873.916,
    "end": 1891.884,
    "text": "So this is a Bayesian model fitting approach that's related to expectation maximization, where you take what you have as far as data and you update what you think about the generative process of the data, and then you crank it the other way and you ask, given what we know about the world, what kind of data might it generate?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1893.337,
    "end": 1915.186,
    "text": " And Tale of Two Densities contrasted that sort of Bayesian approach with a lot of the theory of the inactive researchers who are interested in this relationship between agents in the world and seeing that incoming data as analogous to perception and then the outgoing generative model as generative model of action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1915.687,
    "end": 1918.008,
    "text": "So that's what we discussed in Tale of Two Densities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1918.548,
    "end": 1918.688,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1919.585,
    "end": 1922.226,
    "text": " Yeah, I wasn't there for that, but I'm just going to ask the two of you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1922.246,
    "end": 1933.89,
    "text": "I really like the diagram, but one of the things I was curious about is I've had lots of conversations with people who have taken an activist stance or an activist perspective on things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.13,
    "end": 1947.294,
    "text": "I'm wondering from your guys' perspective, is this ability to ask and then what happens, how is it fundamentally different on either side of that diagram?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1947.975,
    "end": 1949.055,
    "text": "Fundamentally different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1951.55,
    "end": 1954.431,
    "text": " So you're asking the ability to ask and then what happens?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1954.791,
    "end": 1956.672,
    "text": "So the ability to ask a counterfactual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1957.392,
    "end": 1957.632,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1958.432,
    "end": 1964.575,
    "text": "How is it different between the statistical basis and the here I am in reality basis?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1965.435,
    "end": 1972.837,
    "text": "Cause I've asked this question and every time I ask it of people on either side of that, of that diagram, they kind of go on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1973.038,
    "end": 1974.318,
    "text": "I, I'm not really sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1974.338,
    "end": 1977.059,
    "text": "Do you have any thoughts blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1981.377,
    "end": 1995.829,
    "text": " Yeah, I, you know, I think that this paper kind of really tries to get at it, actually, like getting at the what's different, you know, in maybe not this inactivist sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.85,
    "end": 2000.233,
    "text": "But yeah, I really don't have the background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.293,
    "end": 2002.995,
    "text": "But I think, you know, a lot of times there are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.136,
    "end": 2008.923,
    "text": " layers that seem like they should overlap, but maybe don't have a direct correlate, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.344,
    "end": 2010.786,
    "text": "And I think that that's what's happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.906,
    "end": 2019.238,
    "text": "And I think that that's what Alex tries to address in his paper in like a thermodynamic, free energy, statistical thermodynamic kind of way, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.643,
    "end": 2020.903,
    "text": " Fair.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2021.244,
    "end": 2022.485,
    "text": "I'll give another thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2022.725,
    "end": 2029.911,
    "text": "So, and then what happens in the context of Bayesian statistics, it's like a question about counterfactuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2030.411,
    "end": 2032.673,
    "text": "So if you're asking, and then what happened differently with the data?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2033.373,
    "end": 2037.377,
    "text": "Well, from the point of view of the hyperparameters, either the data would be better fitting or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2038.237,
    "end": 2040.599,
    "text": "If you ask, and then what happens to the hyperparameter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2041.1,
    "end": 2043.061,
    "text": "Well, it might generate a different kind of data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2043.522,
    "end": 2045.643,
    "text": "What would happen if the sun were in a different location?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2045.703,
    "end": 2046.964,
    "text": "Well, the shadow would be different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2047.985,
    "end": 2061.489,
    "text": " So as opposed to that sort of cut and dry sense of counterfactual, either on the data or the generative side, in the inactive frame, perhaps, and then what, is more of an invitation to play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2062.21,
    "end": 2065.671,
    "text": "So just at a very first pass, the inactivist perspective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2066.411,
    "end": 2084.064,
    "text": " gives more of a affordance for negotiating that counterfactual as um play rather than just coercing it into a statistical crank it's like well what happens if we jam this gear it's like well then the wheel is going to stop turning next question but in activism is a little bit more playful with that blue",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2086.644,
    "end": 2089.305,
    "text": " So I didn't see this in terms of counterfactual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.465,
    "end": 2093.547,
    "text": "I was looking at it in terms of a predictive standpoint, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.607,
    "end": 2096.448,
    "text": "And then what happens is in my mind, a prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.808,
    "end": 2106.551,
    "text": "And so making a statistical prediction versus making like a prediction on the side of the organism or from like an inactive standpoint to me, like, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.611,
    "end": 2111.173,
    "text": "I mean, I still think like it just, you predict and then either you're right or you're wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.493,
    "end": 2112.853,
    "text": "And then you update your model accordingly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.894,
    "end": 2114.134,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2114.154,
    "end": 2114.274,
    "text": "Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2116.169,
    "end": 2122.753,
    "text": " So because I've sort of come at this from the wayfaring and the wayfinding perspective,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2123.155,
    "end": 2125.636,
    "text": " of how do I orient myself to this stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2125.696,
    "end": 2148.448,
    "text": "I've wondered, I don't even have the confidence to sort of put this out there and stand by it, but I've wondered if part of it is the statistical gives us a bit of an allocentric, a bit of a detached, kind of back to what both of you have said, and Daniel, you know, there is a personal piece, an egocentric part on the inaction side that doesn't necessarily exist on the allocentric side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2148.948,
    "end": 2152.151,
    "text": " But that doesn't make one or the other more or less real.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.791,
    "end": 2167.764,
    "text": "But I think it's whether you can look down on something and see it in that kind of a relationship, because we're talking about relationship or relationships, or whether you're seeing it from the egocentric, oh, that snowball is now going to hit me, duck, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2168.985,
    "end": 2173.809,
    "text": "So I don't know if that's the explanation that Kiefer was going for here, but...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.572,
    "end": 2180.54,
    "text": " I think it's part of the conversation if we're going to quantify this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2183.05,
    "end": 2191.175,
    "text": " So perhaps the difference here really is, and then what happens in my model, and then what happens to me, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.656,
    "end": 2192.616,
    "text": "Very nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2193.156,
    "end": 2193.657,
    "text": "Very nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2193.717,
    "end": 2195.358,
    "text": "It has to do with agency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2195.558,
    "end": 2198.42,
    "text": "And there's an eye in that inactive side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2198.98,
    "end": 2211.128,
    "text": "There's what happens to me and what happens to my model, or how would I see it differently versus given this chessboard, how would it just play out, which is a little bit more like the impersonal Bayesian model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.775,
    "end": 2212.495,
    "text": " So pretty cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2212.575,
    "end": 2220.838,
    "text": "And the reason why we showed this slide was first off to highlight that even when we're talking about the hard, the soft is there and maybe even vice versa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2221.418,
    "end": 2229.621,
    "text": "And also because this approximating distribution that the free energy is being discussed in the context of is the recognition model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2230.261,
    "end": 2232.302,
    "text": "So that's why we're showing this mapping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2232.782,
    "end": 2233.102,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2233.502,
    "end": 2235.463,
    "text": "What is variational inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2236.343,
    "end": 2263.228,
    "text": " well it's something that i'm sure we all had to do a little bit of a dig to find out about and early in my digging last week i came across a really helpful pdf and i started with this quote from what alex wrote and then just started searching and the quote that alex wrote was that variational methods formalize statistical inference and learning in terms of the maximization of a lower bound on model evidence",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2264.068,
    "end": 2266.11,
    "text": " called the negative variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2266.771,
    "end": 2274.317,
    "text": "He describes them as state of the art approaches and also notes that the variational methods have a long history in unsupervised learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2274.998,
    "end": 2281.083,
    "text": "So cool, it sounds state of the art, but there's a long history and maybe it's a tractable way to get at some hard problems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2281.724,
    "end": 2282.644,
    "text": " Well, what is it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.085,
    "end": 2290.308,
    "text": "And this PDF started pretty early on, said, if you haven't seen Jensen's inequality, spend 15 minutes to learn about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2290.668,
    "end": 2294.73,
    "text": "But again, this person has thought about how to teach variational inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2294.87,
    "end": 2298.111,
    "text": "Maybe it's worthwhile thinking about Jensen's inequality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2299.072,
    "end": 2310.637,
    "text": "And one way of phrasing Jensen's inequality is a generalization of the statement that the secant line of a convex function, so kind of like a cord on a circle, like a cut through a circle,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2311.477,
    "end": 2338.122,
    "text": " lies above the graph of the function so it sounds like it might be a little bit obvious graphically and indeed there is a proof without words so that's just flipping to this next slide so yes it's kind of like if there's a bowl any slice that you take through the bowl it's gonna be able to have something roll underneath the slice that's really important",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2339.5,
    "end": 2352.433,
    "text": " And pulling a few quotes back from the variational inference by Blay PDF, what is written is that we can't minimize the KL divergence exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2353.073,
    "end": 2357.638,
    "text": "Maybe we'll talk more about KL later, but we can't minimize the divergence between KL",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2359.687,
    "end": 2361.328,
    "text": " the data we're getting in in the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2361.468,
    "end": 2362.869,
    "text": "We want to minimize our divergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2362.889,
    "end": 2364.57,
    "text": "So just we'll think about it at that level for now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2365.21,
    "end": 2372.194,
    "text": "It's hard to minimize that directly, but we can minimize a function that is equal to it up to a constant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2372.514,
    "end": 2374.915,
    "text": "This is the evidence lower bound or the elbow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2375.536,
    "end": 2382.5,
    "text": "So it's almost like, I can't tell you where the bottom of that bowl is, but if I can take a cut through the bowl,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2383.533,
    "end": 2385.994,
    "text": " then I know that it has to be lower than that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.534,
    "end": 2392.375,
    "text": "But if I cut as low as I can to the bottom of the bowl, maybe I'm gonna be just infinitesimally cutting above the bottom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2392.996,
    "end": 2400.698,
    "text": "So if I have a really easy way to figure out how that cut gets minimized, then maybe we'll do all right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2401.338,
    "end": 2407.44,
    "text": "Maybe we don't need to find out the true single bottom because we'll just make cuts that are lower and lower and we'll go from there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2408.7,
    "end": 2411.941,
    "text": "And it turns out that Jensen's inequality really comes into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2413.248,
    "end": 2421.853,
    "text": " And also part of the trick is that there's a choice of the investigator for which functions to use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2422.634,
    "end": 2428.417,
    "text": "And it turns out that some functions, it's easy to calculate them one way, but really hard to go the other way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2428.797,
    "end": 2441.045,
    "text": "And there's times where you want that, like when you're doing cryptography, but there's other times where you want functions that are very, very easy to go back and forth, like as easy to go from the input to the output",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2441.605,
    "end": 2461.955,
    "text": " it maps uniquely and quickly back and so it turns out this loop thinking kind of primes the pump but it turns out if you choose mathematical functions where it's really easy to go from input to output and back and you combine it with this idea that you can take a slice through a curve",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2463.191,
    "end": 2476.617,
    "text": " and find a tractable way to estimate basically the lower bound on the evidence, it's gonna be possible to set up some optimization problems so that we can solve them straightforwardly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2477.657,
    "end": 2481.679,
    "text": "And so in other words, highlighted here, minimizing the KL divergence",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2483.177,
    "end": 2485.338,
    "text": " is the same as maximizing the ELBO.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2485.578,
    "end": 2489.999,
    "text": "So maximizing the evidence lower bound means like we're pushing up the bottom bar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.539,
    "end": 2504.243,
    "text": "So we're getting more and more evidence, we're getting better optimization as we minimize the divergence between the data that we're getting and our generative model, but we picked a generative model that we can play really flexibly with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2506.564,
    "end": 2507.604,
    "text": "Any thoughts or we'll continue on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2510.307,
    "end": 2514.654,
    "text": " Just that it goes back to solving the problem once you know the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2515.175,
    "end": 2520.223,
    "text": "The process of solving the problem once you know the answer becomes very constrained and simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.243,
    "end": 2520.904,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.909,
    "end": 2525.491,
    "text": " And I just described this as then if then, which is exactly the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.012,
    "end": 2535.958,
    "text": "Then you have something that you already are aware of, the if, the unknown space below that line, and then you resurface to a new place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2536.759,
    "end": 2546.105,
    "text": "And below that line on that next slide is what I would describe as learning's unholy triad, the triangle under there, but I'll let you talk about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.84,
    "end": 2554.786,
    "text": " No, it's really interesting because outside of the chord, outside of that line, you have no guarantees.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2555.226,
    "end": 2564.333,
    "text": "And in fact, often you increase the precision of your guarantee within the frame at the cost of losing the generality beyond.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2564.353,
    "end": 2565.794,
    "text": "It doesn't make any generalizations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.494,
    "end": 2577.14,
    "text": " So the metaphor that, I don't know, somebody with more math, please correct or help us make this richer, but it's kind of like variational inference is doing inference on rails.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.961,
    "end": 2581.883,
    "text": "So the train operator can have a really complicated generative model of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2581.943,
    "end": 2583.804,
    "text": "Like what time should I be home for dinner?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2583.904,
    "end": 2585.065,
    "text": "And what's my favorite color?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2585.085,
    "end": 2587.427,
    "text": "It could be wild sensory input.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2587.607,
    "end": 2594.211,
    "text": "So you can have a really rich system, but the operator can tell from the local speed of the train",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.225,
    "end": 2623.006,
    "text": " that the train is going in the right direction and maybe even how fast it's going in the right direction given the structure of the problem go to the desired location now there's other times where you don't want to go as fast as possible but just taking it at a first pass going from a to b we want to structure the problem so that we're on rails we know that all we have to do no matter how much data we have in our generative model we want to have like a forward and break",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2624.066,
    "end": 2641.151,
    "text": " Variational inference helps us structure the problem so it's more like being a train on a track with a destination in mind, which is this minimization of the divergence, which we will get to, as opposed to this hill characterizing and just mapping all the hills.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2641.191,
    "end": 2644.872,
    "text": "That's like a map maker, but the train conductor is not map making.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.292,
    "end": 2649.973,
    "text": "They have exactly their tools at hand, and then they're just going as fast as they can in the right direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2651.778,
    "end": 2656.26,
    "text": " And this was just a technical slide from the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2657.0,
    "end": 2659.321,
    "text": "Any remarks on this, Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2659.541,
    "end": 2660.982,
    "text": "Otherwise, I think we could, yeah, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.162,
    "end": 2673.127,
    "text": "So this is for those who wanna see the technical details, read the paper, but this is equation 2.1, and it relates some of these terms that we're talking at, but we're just exploring today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2674.542,
    "end": 2684.009,
    "text": " This was another useful blog post and it plays into the fact that the KL divergence is asymmetric.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2684.97,
    "end": 2697.339,
    "text": "So the divergence between Q and P is not necessarily the same as P to Q. And so it's almost like there's two different ways that we might optimize.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2697.379,
    "end": 2702.764,
    "text": "It's kind of like finding a local maxima versus a more global maxima.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2703.524,
    "end": 2730.957,
    "text": " but q is a constrained type of distribution so for example here we might be picking q to be a gaussian so we know that q is going to be a bell curve and we're only going to be trying to maximize one thing about q which is its mean and its variance as well in the easy case what um the author of this blog post writes as easy is just like find me the highest point in p",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2731.937,
    "end": 2747.307,
    "text": " and then place q right on top of the highest point in p so that gets you to a local max it finds a local the global maxima and it just lays down your uh average there",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2748.368,
    "end": 2762.185,
    "text": " But it turns out that there's a hard direction as well, which is actually given the total distribution of P, I want the best overall fitting Q. And the author writes, well, why is this hard to compute?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2763.146,
    "end": 2766.53,
    "text": "Well, for most interesting models, we can't compute a complex model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2767.691,
    "end": 2792.374,
    "text": " example the real world or really complicated graphs or very complicated bayesian posteriors because remember a lot of this variational inference rested on the fact that we were choosing distributions that were easily reversible however when we're optimizing functions where there isn't a really easy reversible way it's harder to do inference and um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2793.424,
    "end": 2806.829,
    "text": " They also write down here on the bottom, the optimization problem is convex, so curved, hashtag Jensen's inequality, when Q is an exponential family, i.e.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2806.869,
    "end": 2811.411,
    "text": "for any P, looking at this bottom graph, the optimization problem is easy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2812.051,
    "end": 2821.835,
    "text": "So in other words, if we pick Q to be the right kind of distribution, then it'll be smooth sailing no matter what P looks like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2822.759,
    "end": 2830.61,
    "text": " But if we want Q to be the same type of distribution as P, and we don't know what kind of distribution P is, we're kind of setting up the problem to fail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.533,
    "end": 2842.836,
    "text": " However, if we say, hey, whatever kind of problem P is, whatever is generating P, we're going to make Q part of the exponential family, then it becomes easy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2843.597,
    "end": 2858.861,
    "text": "And so you can think of maximum likelihood estimation as a method which minimizes the KL divergence based upon sampling P. But in this case, P is the true data distribution rather than a model of the generating function, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2860.171,
    "end": 2877.665,
    "text": " Yeah, it was interesting because when I first looked at that, I wondered, is this a good way of quantifying the difference between the guy in the train who's looking at the world through deontological eyes and another train conductor who's looking at it through utilitarian eyes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2878.346,
    "end": 2881.528,
    "text": "Because that actually exists in those graphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2882.189,
    "end": 2883.35,
    "text": "It's kind of interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2885.871,
    "end": 2891.075,
    "text": " I'm thinking of who those different kinds of people would be or what they might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.535,
    "end": 2908.167,
    "text": "Which one is, if I'm going to run over somebody on the tracks, do I run over five people who I don't know or do I run over one person who I do versus I can't do anything that I wouldn't have something be done the equivalent to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.207,
    "end": 2913.831,
    "text": "But anyway, I just think it was interesting that the philosophical qualification ended up being",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.2,
    "end": 2919.008,
    "text": " visible in the representation of those graphs there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2921.673,
    "end": 2921.953,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2922.775,
    "end": 2925.28,
    "text": "And here is how Alex framed it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2926.109,
    "end": 2949.201,
    "text": " which is that f the free energy is useful as an optimization target so just a little reminder why are we going into all these details about statistics and about the kl divergence and the variational inference well because we're talking about variational free energy and doing optimization on variational free energy so that's why we had to pull back to asking what variational",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2949.941,
    "end": 2975.166,
    "text": " means and then when we think about where the energy comes in it will return so alex writes again that f is useful as an optimization target for several reasons that have been widely discussed and maybe those reasons are obvious to some or some people think that it's uh not enough of a good reason for f to be used but there are reasons to choose f as a function that you want to minimize",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2978.027,
    "end": 2989.116,
    "text": " 2.2 gets at that and it even uses the Q and the P. So if we look at 2.2 relative to 2.1, in 2.1, see how P is on top and then Q is on bottom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.337,
    "end": 2994.541,
    "text": "And then here, Q is on top and P is on bottom and there's this plus F.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.835,
    "end": 3017.857,
    "text": " you want to unpack the equations please do so and help teach to us but just note that things are flipping and it's being mirrored by what we saw here where on the top one the easy one cues on top right and then on the hard one cues on the bottom so also using that phv notation and then we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3018.94,
    "end": 3039.598,
    "text": " um what does that mean so let's just say that free energy is the thing that we're going to be optimizing on and variational free energy has a certain structure that's related to variational inference that means that maybe if we're trying to minimize variational free energy that's going to be like the right optimization path",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3040.822,
    "end": 3046.125,
    "text": " Okay, so we're going to be doing variational free energy minimization to do model fitting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3046.986,
    "end": 3049.887,
    "text": "Where does real energy come into play?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3050.368,
    "end": 3052.149,
    "text": "Where does thermodynamics come into play?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.789,
    "end": 3053.409,
    "text": "And it's right here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3054.29,
    "end": 3058.192,
    "text": "As is often remarked in discussions of variational inference, so e.g.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.332,
    "end": 3059.493,
    "text": "in the statistics literature,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.105,
    "end": 3082.322,
    "text": " f free energy has almost precisely the form of a negative helmholtz free energy from statistical mechanics in fact that's why we call it free energy because it has a really similar form and that free energy term or the energy term let's just call it f of t um it's uh has two parts to it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3083.427,
    "end": 3086.109,
    "text": " The first term on the right is the expectation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3086.169,
    "end": 3094.014,
    "text": "So that's E is for expectation here of the energy stored in the system at a given temperature due to internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3094.895,
    "end": 3101.94,
    "text": "So really complicated molecules with a lot of order like DNA, they have a lot of internal energy locked up in their structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3102.82,
    "end": 3106.983,
    "text": "And then the right term Ts is the temperature times the entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3107.544,
    "end": 3110.746,
    "text": "So that's what the term looks like for energy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3112.743,
    "end": 3116.505,
    "text": " and that's how you can look at whether an equation is going to be like endothermic or exothermic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3117.006,
    "end": 3124.11,
    "text": "Like if it creates a lot of disorder in the environment, it can locally order some stuff, but you know, you can't make or lose energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3125.211,
    "end": 3135.638,
    "text": "And so to get to this more chemical phrasing of F from variational inference, Alex writes, we rewrite equation 2.1 using an energy term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3136.939,
    "end": 3139.16,
    "text": "And so we get this equation 2.3",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3140.58,
    "end": 3154.147,
    "text": " which is analogous to this more statistical physics equation where we have basically VFE consists of the energy of the internal configuration minus the temperature times the entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3156.906,
    "end": 3161.308,
    "text": " part of the question is gonna be, okay, cool, it looks similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3162.029,
    "end": 3164.05,
    "text": "Might those things be isomorphic?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3164.13,
    "end": 3164.99,
    "text": "Might they be the same?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.69,
    "end": 3166.591,
    "text": "That's the thesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3167.371,
    "end": 3168.212,
    "text": "That's the question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.532,
    "end": 3170.013,
    "text": "Is it actually that way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.733,
    "end": 3173.254,
    "text": "Or is it just that we can think of it similarly?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3173.955,
    "end": 3178.217,
    "text": "And so this is where we got to 26, bringing back the train, two, two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3179.037,
    "end": 3182.199,
    "text": "Could we take well-structured optimization problems,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3183.536,
    "end": 3193.08,
    "text": " and connect them by resonance in the structure of the equations to the ways that downhill trains navigate or burning candles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3193.54,
    "end": 3199.782,
    "text": "Or if you put a ball into a bowl, it goes to the bottom every time, and it only goes to the bottom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3200.583,
    "end": 3210.887,
    "text": "So could optimization, variational optimization, not just be well-structured, not just have the gas and the brake so that we know that we're going in the right direction,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3211.747,
    "end": 3214.395,
    "text": " But could we be thermodynamically pulled",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3215.296,
    "end": 3241.845,
    "text": " in the right direction that would be like the candle where the candle always burns if you think where its higher state is with a candle and then the lower energy state is it's burnt and dissipated it always happens given the activation energy and if there were an isomorphism between the structuring of the statistical problem and the actual thermodynamics in the world that would be pretty interesting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3245.925,
    "end": 3247.566,
    "text": " So analogies are always partial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3247.966,
    "end": 3254.751,
    "text": "I know Dean's probably going to have a ton to say about analogies here, but this is what is written by Alex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3255.252,
    "end": 3269.842,
    "text": "If the connection between statistical mechanics and statistical modeling by the brain were merely one of analogy, it would be surprising to find that all the terms in the Helmholtz free energy play useful and interlocking representational roles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3271.718,
    "end": 3287.051,
    "text": " This coincidence between physical and representational descriptions is to be expected, however, if free energy simply measures how much useful representational work can be done by the internal elements of a system where work has physical meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3288.172,
    "end": 3298.841,
    "text": "In the remainder of section two, I consider how the physical interpretation of each term in the Helmholtz free energy can be related to a corresponding facet of the optimization process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3299.881,
    "end": 3314.578,
    "text": " it's like we have a dna molecule and there's the energy that's stored in the configuration of the bonds that's the internal energy and then there's the temperature dependent term which has to do with the dna snaking around and moving around in the environment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3315.439,
    "end": 3324.162,
    "text": " So now when we compare that to statistical models, it's almost like the internal energy is the complexity, not of the DNA molecule, but the complexity of the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3324.842,
    "end": 3331.205,
    "text": "And then that wiggle room is related to potentially the accuracy or the variability of the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3331.685,
    "end": 3332.865,
    "text": "But we'll see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3335.946,
    "end": 3337.047,
    "text": "Anything to add here on the candle?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3339.387,
    "end": 3342.108,
    "text": "Just that the focus is on the function, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3342.588,
    "end": 3344.109,
    "text": "The representation as function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3347.421,
    "end": 3348.903,
    "text": " Yep, that's really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3349.183,
    "end": 3355.589,
    "text": "So I hope Alex can clarify on a lot of these math points and also on the representational work side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3357.171,
    "end": 3361.355,
    "text": "So here's another piece that came up during preparing for this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3363.42,
    "end": 3377.894,
    "text": " gibbs free energy is g and the difference between the reactants and the products of a chemical reaction is often referred to as delta g and when the delta g is significantly low like it's a downhill",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3378.843,
    "end": 3387.39,
    "text": " Then if you can get over the activation energy with just thermal energy or with an enzyme lowering the barrier or whatever, it will flow downhill.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3387.83,
    "end": 3396.938,
    "text": "So if the delta G is negative, the reaction proceeds as surely as water flows downhill or in hill, should I say, because up and down are not real.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3397.859,
    "end": 3401.121,
    "text": "And so here's three different cases that are being shown.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3401.642,
    "end": 3406.165,
    "text": "So here is the downhill case where the reactants have a higher G than the products.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3407.082,
    "end": 3411.426,
    "text": " the reaction proceeds, but not all the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.586,
    "end": 3426.458,
    "text": "Sometimes it's functionally, it proceeds to completion, but actually all reactions have this K value where it's somewhere in between because at some point you'll have like 99% of the product and then the backwards reaction is 50-50.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3427.319,
    "end": 3431.403,
    "text": "So just like if you have a test that's 99% accurate, but the disease is really rare,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3432.679,
    "end": 3436.73,
    "text": " you might do the Bayesian statistics and find that actually contingent on a positive test",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3437.748,
    "end": 3442.75,
    "text": " it's actually not likely that the person has it because there's so many people who don't have it who get false positives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3443.19,
    "end": 3444.411,
    "text": "That's the Bayesian case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3444.791,
    "end": 3457.137,
    "text": "So in the chemical case, it's kind of like, even if the reaction is favored 20 to one, well, once it's 95% done, then for every one of those that goes forward, 20 come back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3457.557,
    "end": 3461.939,
    "text": "So it re-equilibrates at 95 to five if the overall difference is 20 to one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3463.666,
    "end": 3472.822,
    "text": " And then on the right side, on the top, if the products have a higher Delta G, they have more internal energy, then you need to add energy to make it happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3473.956,
    "end": 3479.258,
    "text": " And then on the bottom left is the special case where the reactants and the products have the same Gibbs energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3479.778,
    "end": 3482.579,
    "text": "So for example, like two isomers of a molecule.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3483.18,
    "end": 3485.04,
    "text": "And in that case, it's like a coin flip.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3485.721,
    "end": 3489.242,
    "text": "It's as energetic for the reactants and the products.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3489.982,
    "end": 3493.384,
    "text": "And so it ends up just jostling back and forth and getting completely mixed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3494.386,
    "end": 3502.61,
    "text": " So those are the little bit of the thermal intuitions that people might have heard related to kinetics and thermodynamics of chemical reactions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3503.37,
    "end": 3506.352,
    "text": "But let's talk about inference and models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3507.072,
    "end": 3514.596,
    "text": "What does it look like to have a model that's going downhill on an energy landscape or two models that are as likely as each other?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3514.836,
    "end": 3516.477,
    "text": "So it's kind of like a coin flip between them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3517.54,
    "end": 3529.543,
    "text": " So that's just kind of, again, getting at this potential, certainly helpful, but potentially even physically real isomorphism between model inference and thermodynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3532.004,
    "end": 3532.244,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3533.404,
    "end": 3536.085,
    "text": "Lou, what could you tell us on this slide?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3537.856,
    "end": 3545.281,
    "text": " So I think this is stuff that Alex put in here talking about the role of internal energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.701,
    "end": 3551.725,
    "text": "And so these two equations, the Helmholtz free energy you talked about already first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.386,
    "end": 3563.013,
    "text": "So where U is the internal energy, the top equation is A equals U delta S. And so U is the internal energy combining the kinetic and potential energy total in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.193,
    "end": 3563.473,
    "text": "And then...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.634,
    "end": 3567.996,
    "text": " The T is the temperature and then the S is entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.196,
    "end": 3580.642,
    "text": "And he writes, an intuitive explanation of the minus TS term is that insofar as the properties of the particles in the system are uncertain, the kinetic energy constitutes irregular motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.123,
    "end": 3589.087,
    "text": "So the impact on the free energy of entropy, a measure of the irregularity, is scaled by temperature, roughly average molecular kinetic energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.953,
    "end": 3591.915,
    "text": " I thought that was a neat explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3591.935,
    "end": 3603.724,
    "text": "And then the Boltzmann distribution is this bottom probability and it's the probability of a state at a given temperature in relation to the energy in a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.654,
    "end": 3615.537,
    "text": " And he says here, low energies are associated with good or desired configurations of the system, which are often interpretable as assigning high probability to what they represent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.578,
    "end": 3623.84,
    "text": "And the analogy to physics is closer that the energy can be directly related to the probability of the internal state of the network occurring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.241,
    "end": 3626.441,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3627.816,
    "end": 3646.614,
    "text": " so how exactly are these different flavors of thermodynamics and math related alex teach us and and help us understand where other researchers can contribute how about on 30 blue what was interesting to you about this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3647.712,
    "end": 3653.235,
    "text": " I threw these in because these are both different kind of neural network setups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.375,
    "end": 3655.396,
    "text": "And so I'll start with the bottom one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.897,
    "end": 3664.621,
    "text": "The Boltzmann machine isn't really practical or used a lot to solve problems because it really takes a lot of energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.661,
    "end": 3666.983,
    "text": "As you can see, the connections in the network, there's a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.363,
    "end": 3669.184,
    "text": "It's like a fully connected network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.524,
    "end": 3674.387,
    "text": "But they use this restricted Boltzmann machine to kind of solve problems instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.747,
    "end": 3676.348,
    "text": "It's a neural network architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.168,
    "end": 3680.47,
    "text": " And it's simpler than the Helmholtz machine, which is above it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.57,
    "end": 3690.034,
    "text": "It's just divided into the visible units in green, which is like you can see the data going in, and then the hidden layers, which are the blue nodes in the network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.694,
    "end": 3696.437,
    "text": "And it's, anyway, it just uses Gibbs sampling to recognize and generate inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.277,
    "end": 3701.019,
    "text": " not like what goes on in the Helmholtz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.139,
    "end": 3706.822,
    "text": "In the Helmholtz model, which is the top one, there's this recognition layer and a generative layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.982,
    "end": 3710.443,
    "text": "And so the hidden layers are behind it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.543,
    "end": 3712.524,
    "text": "So when you see the visible layer,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.366,
    "end": 3716.809,
    "text": " This is the input in the recognition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.289,
    "end": 3719.593,
    "text": "And then in the generative model, this is the output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.693,
    "end": 3729.346,
    "text": "And so I think that it's really kind of cool that there's this recognition layer and the generative layer because it just relates so closely to active inference and how that's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.367,
    "end": 3753.263,
    "text": " all done and uh there can be multiple layers so you can have like a deeper um you know structure than this and also these helmholtz machines are i think alex talks about in the paper he doesn't show it um or maybe say it explicit explicitly but the helmholtz machines literally are doing sleep wake sleep wake and so how you train train the model is that like the the generative tr or the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3753.803,
    "end": 3763.174,
    "text": " Generative traces the recognition by definition, and so it's constantly chasing each other, versus a Boltzmann machine that's just all kind of happening at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.235,
    "end": 3765.857,
    "text": "Thanks, that's really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3766.818,
    "end": 3770.402,
    "text": "Also, these names like Boltzmann and Gibbs,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3771.485,
    "end": 3780.475,
    "text": " it's almost like there's equations that are named after them in thermodynamics, like Gibbs free energy, but also this is an inference machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3780.595,
    "end": 3782.237,
    "text": "The Boltzmann machine is an inference machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3782.758,
    "end": 3783.919,
    "text": "And I just looked it up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3784.98,
    "end": 3790.106,
    "text": "Some may find this interesting, some may not, but this is the Wikipedia page for Gibbs sampling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3790.406,
    "end": 3791.367,
    "text": "What is Gibbs sampling?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3792.068,
    "end": 3804.379,
    "text": " Gibbs sampling is a Markov chain Monte Carlo algorithm for obtaining a sequence of observations which are approximated from a specific multivariate probability distribution when direct sampling is difficult.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3805.279,
    "end": 3814.547,
    "text": "So that comes into play in Blue and I's area of genomics or in phylogenomics where we don't have the generative model, but we have a ton of data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3815.248,
    "end": 3821.031,
    "text": " And part of the way that we fit Bayesian models in phylogenomics is by using these sampling approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3821.572,
    "end": 3836.661,
    "text": "And so it's kind of like sampling, but that stochastic way that we're sampling, where like you kind of go in the direction of informative samples, but also you want to sample broadly from a distribution that you don't know the real underlying truth, but you just have a ton of data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3837.947,
    "end": 3841.448,
    "text": " That is just very interesting to see how it comes back here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3841.908,
    "end": 3845.95,
    "text": "So thermo and info have been presaged for a long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3847.15,
    "end": 3851.572,
    "text": "That's what Alex does an awesome job of bringing back some of the literature from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3851.592,
    "end": 3855.593,
    "text": "Okay, what is temperature?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3856.694,
    "end": 3862.956,
    "text": "So there's temperature in the physical world, which is related to the speed of molecules",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3864.557,
    "end": 3889.577,
    "text": " and just before we quote alex on the left just a reminder that even at a given temperature that the speed distribution of different molecules is really different because they have different masses so what's conserved at a given temperature like zero degrees celsius or something is actually an energy value per molecule and lighter molecules are moving faster than larger molecules",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3890.632,
    "end": 3909.277,
    "text": " And what Alex writes is that the meaning of temperature within statistical modeling, so that's what it means in physics, statistical physics, but in statistical modeling is illustrated in the example of simulated annealing, where increasing the temperature increases the variance of the distribution over configurations of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3910.097,
    "end": 3914.821,
    "text": " And lowering it collapses the distribution to a small range of states near the ground state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3915.402,
    "end": 3923.429,
    "text": "So like when you have DNA, the lowest energy state is when the two strands are annealed all the way together and just resting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3924.11,
    "end": 3930.035,
    "text": "And then when you crank up the temperature in that reaction, there's more and more wiggling of the double helix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3930.155,
    "end": 3936.141,
    "text": "And then for any given stretch of DNA, there's a temperature where there's so much wiggling that they separate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3937.133,
    "end": 3939.975,
    "text": " And so then you cool it down and they reanneal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3940.095,
    "end": 3941.777,
    "text": "So that's kind of how PCR works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3942.297,
    "end": 3944.859,
    "text": "But it also has a statistical interpretation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3945.399,
    "end": 3949.102,
    "text": "As you turn it up, everything is wiggling around more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3949.863,
    "end": 3956.048,
    "text": "And then as you cool it down, things converge to small ranges of states near their ground state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3957.199,
    "end": 3960.823,
    "text": " and controlling the variance of a distribution is useful in many applications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3961.583,
    "end": 3971.233,
    "text": "I'm sure we can all think of many times where there's a need for looseness or tightness or flexibility to tune a given model from loose to tight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3971.973,
    "end": 3974.376,
    "text": "But what does that make you think about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3977.33,
    "end": 3980.292,
    "text": " So I just want to talk about temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.412,
    "end": 3990.719,
    "text": "There's temperature in this thermodynamic sense that controls so much about the energy of the particles and all these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.819,
    "end": 3993.261,
    "text": "And I just read a really interesting model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.321,
    "end": 3995.622,
    "text": "And so I would have added the reference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.003,
    "end": 3997.063,
    "text": "I just looked it up really quick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.123,
    "end": 4003.868,
    "text": "So it's a paper called Dynamics of Collective Action to Conserve a Large Common Pole Resource.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4003.908,
    "end": 4005.189,
    "text": "It's a paper that just came out in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.829,
    "end": 4008.451,
    "text": " scientific reports by Anderson et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.792,
    "end": 4024.064,
    "text": "But in this paper, they use this, it's this five metric and they use it to like talk about the temperature, but it's not really like a temperature, but it's just like the influence of all of the external surroundings on the behavior of the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.104,
    "end": 4034.993,
    "text": "So I think about in the terms of active inference, like what, like the political arena, the news, you know, like all of these things have influence on our perception and our action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.653,
    "end": 4044.22,
    "text": " And so can we have a temperature in terms of having this in an active inference sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4044.5,
    "end": 4049.384,
    "text": "And they did kind of a really nice job baking that into that agent-based model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4049.404,
    "end": 4049.804,
    "text": "It was nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.805,
    "end": 4051.125,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4051.605,
    "end": 4057.19,
    "text": "Also thinking about action, it reminds me of a golf swing or chopping a knife.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4058.052,
    "end": 4061.897,
    "text": " The low temperature action is the variance in the action is very low.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4062.437,
    "end": 4066.682,
    "text": "And so you might see that reflected by a groove that's very entrenched.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4067.81,
    "end": 4071.613,
    "text": " but then the high variance, the higher temperature action is kind of all over the place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4072.554,
    "end": 4079.0,
    "text": "And so we can imagine that, especially when we're learning, we don't know where the right place to put the average is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4079.741,
    "end": 4082.923,
    "text": "So you don't wanna have a tight distribution too early.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4083.464,
    "end": 4087.347,
    "text": "You wanna start with a very high temperature and a broad distribution,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4088.288,
    "end": 4108.031,
    "text": " and then you want to hone in maybe like there's a few ways that you might a few successful endpoints you might get to but ironically if you start there too tightly then you'll fail so that's kind of interesting to think about how about organisms that have to minimize their free energy to stay alive",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4108.851,
    "end": 4122.497,
    "text": " Well, Alex writes that free energy minimizing has been used to explain how organisms manage to keep themselves away from thermodynamic equilibrium, the ultimate equilibrium of dissipation with respect to the external environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4123.397,
    "end": 4131.641,
    "text": "In other words, you have to maintain that non-equilibrium steady state because if you descend into total equilibrium, it's equivalent to death.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4132.87,
    "end": 4138.391,
    "text": " And so using a candle analogy, you know, the flame is out, out, out flame.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4139.332,
    "end": 4143.035,
    "text": " there's a point where the system is no longer lit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4143.715,
    "end": 4144.616,
    "text": "The flame is out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4145.296,
    "end": 4156.424,
    "text": "And then it's not just that, it's like a zero to one with life and death, even though we're not going to the human case or anything like that, just taking it thermodynamically with a candle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4157.025,
    "end": 4158.966,
    "text": "And then it's just like volume.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4159.126,
    "end": 4168.313,
    "text": "You can just get more and more and more dissipation of energy from a candle to a flame to just a complete inferno, more and more dissipation of energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4169.013,
    "end": 4172.776,
    "text": " And then there's some value where you're not dissipating energy as a system, you're dead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4174.256,
    "end": 4177.298,
    "text": "Well, let's map that on two organisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4177.759,
    "end": 4180.32,
    "text": "So there's some point where the organism dies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4180.441,
    "end": 4190.627,
    "text": "Not saying there's a moment where it happens or a clean break, but there is a difference between something that is no longer actively maintaining a non-equilibrium steady state versus something that isn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4191.788,
    "end": 4194.49,
    "text": "And here is like a dog that's sick, but it's alive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4195.15,
    "end": 4197.832,
    "text": "And this is like a more vital and healthy organism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4198.325,
    "end": 4217.319,
    "text": " dog and so the question would be do species really minimize their free energy or do they just oh oh wait that's a little bit more of a generalization as long as the organism is maintaining it's not equilibrium steady state it's fair to say that it is acting as if it's minimizing its free energy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4218.513,
    "end": 4241.421,
    "text": " then the question is maybe for other levels of organization like a species do higher levels of organization actually minimize free energy in their own right or are they just more like a collection of agents that are seeking to stay alive and then the group stays alive as long as you have individuals that are staying alive thermodynamically um so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4242.561,
    "end": 4248.905,
    "text": " I think that's partly where the mapping is going with this whole energy and information and life and death.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4249.145,
    "end": 4251.407,
    "text": "But again, Alex, that'd be awesome spot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4251.847,
    "end": 4252.627,
    "text": "You know, what is life?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4252.687,
    "end": 4253.308,
    "text": "What is death?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4253.748,
    "end": 4259.091,
    "text": "These would be great things for you to address any thoughts or we'll continue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4259.111,
    "end": 4262.373,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4262.453,
    "end": 4268.057,
    "text": "So in the free energy principle and metaphysics section, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4272.56,
    "end": 4282.542,
    "text": " We pulled out a few quotes related to where all of these predictive coding and free energy principle ideas come together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4283.522,
    "end": 4287.703,
    "text": "It's a little bit rehashing, so we're not going to read anything, but people should check out the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4288.323,
    "end": 4296.084,
    "text": "And sometimes with these dense papers, we end up just getting a lot on the slides just to get it out there and unpack it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4296.344,
    "end": 4300.625,
    "text": "And there's many ways we could have probably reordered stuff or thought differently about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4302.042,
    "end": 4302.963,
    "text": " What about this slide, Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4305.746,
    "end": 4306.246,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4309.149,
    "end": 4312.533,
    "text": "Just that it's just, yeah, we're not going to read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.553,
    "end": 4313.253,
    "text": "We're not going to read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4313.274,
    "end": 4314.875,
    "text": "The paper was really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.075,
    "end": 4315.276,
    "text": "Good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4315.876,
    "end": 4316.457,
    "text": "Good there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4316.977,
    "end": 4322.863,
    "text": "Let's consider the thought experiment that was done in the paper, which is this sleeping and waking agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4323.857,
    "end": 4330.38,
    "text": " And so we're going to have these, an agent that has two different phases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4330.84,
    "end": 4339.404,
    "text": "There's a wake phase of the algorithm where the activity is driven bottom up by the recognition weights.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4339.744,
    "end": 4343.486,
    "text": "So like when you're awake, it's driven by the visual input coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4344.44,
    "end": 4357.287,
    "text": " And then there's a sleep phase where you can imagine the opposite is true, like the model updating is being driven by the generative model in the absence of being driven by stimuli.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4358.539,
    "end": 4367.285,
    "text": " And then you take those two phases of the model and combine them into this R equation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4367.866,
    "end": 4373.41,
    "text": "So it's like you have night and day, light and wake, and then the agent is gonna be modeling that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4374.25,
    "end": 4380.014,
    "text": "And I think Dean, you had a nice take or interpretation on what this sleep wake meant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4380.715,
    "end": 4385.158,
    "text": "What did this example show or where did you see it in the context of the paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4386.806,
    "end": 4391.51,
    "text": " Well, sort of going back to this being an example of this stochastic channel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4392.511,
    "end": 4408.044,
    "text": "So I wondered whether or not recognition is a recognition, which is then consolidated is a two way establishment of what sort of we've taken to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4410.322,
    "end": 4412.224,
    "text": " what we now know versus what we don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4412.524,
    "end": 4423.372,
    "text": "So is there two parts to this, being it's a two-way establishment, is there a buildup in terms of the generative model as probabilities are confirmed and is there a build-in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4423.453,
    "end": 4437.584,
    "text": "Is there a way to be able to, in that, I guess it would be in the sleep phase or the non-wake phase, is there a way for us to be able to sort of purge the error units and then sort of discard them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4437.744,
    "end": 4438.565,
    "text": "But again,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4439.989,
    "end": 4450.374,
    "text": " I'm saying this not knowing my negative F from my D sub KL in terms of what this actually means, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4451.475,
    "end": 4457.298,
    "text": "But I do like the idea that you can try to take a shot at it, a guess at it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4457.758,
    "end": 4459.479,
    "text": "And if you're completely off, well, fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4460.179,
    "end": 4463.381,
    "text": "But it's not so unreachable that you can't take a good guess at it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.062,
    "end": 4467.083,
    "text": "Thanks for really...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4468.624,
    "end": 4473.147,
    "text": " doing awesome on the .0 and bringing your perspective because I totally agree with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4473.828,
    "end": 4476.47,
    "text": "I'm not even sure what the agent is modeling here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4476.87,
    "end": 4478.331,
    "text": "It's like R of what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4479.492,
    "end": 4483.735,
    "text": "Let's find out what this agent is doing and what it means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4484.376,
    "end": 4492.922,
    "text": "But it is playing a role in the paper, which is using the model as just a minimal experiment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4494.011,
    "end": 4515.285,
    "text": " to illustrate the identity thesis which is the claim that the variational free energy so doing the variational statistical inference that model fitting is going to be equal to the thermodynamic free energy of the system so definitely alex help us um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4516.346,
    "end": 4544.135,
    "text": " understand what the model is showing here and also what maybe empirical system could we actually look at like can we collect data from a wake person or a sleeping person or another system to see if this is the case in equation 3.2 there's more unpacking of the f in terms of a kl divergence and then another term if you want to learn more of the mathematical details",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4545.31,
    "end": 4574.236,
    "text": " unpack that and work through it in the discussion there is some uh connection to the work of lewis and others how is the bayesian brain and the position of lewis uh relating to folk psychology how do these terms come together section four later in section four",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4575.939,
    "end": 4581.442,
    "text": " there's some formal logic, Ramsey sentences, predicate logics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4582.583,
    "end": 4605.075,
    "text": "Also, it'd be very interesting to learn about what is being done here, because we were talking a lot about the mind and the brain, that sounded like statistical, I mean, and philosophical, and then there's things burning and thermodynamics, and then here's a logical sentence that is actually, yeah, Blue, what did you see here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4606.246,
    "end": 4611.248,
    "text": " So I put a lot of these little comments into the slides because I was like, what is a Ramsey sentence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4611.528,
    "end": 4613.309,
    "text": "And what are these like weird symbols?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4613.389,
    "end": 4618.432,
    "text": "Like I can do regular math, but like when you start to get into these like, I don't know, tricky symbols, it baffles me always.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4618.792,
    "end": 4629.357,
    "text": "So a Ramsey sentence is a formal logic reconstruction of a theoretical proposition that attempts to draw a line between science and metaphysics, which I didn't know that, I've never heard of these before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4630.777,
    "end": 4638.682,
    "text": " And so I just couldn't really figure out, like, and so this backwards E, I was trying to read this, like, you know, equal this equation here down at the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.762,
    "end": 4642.865,
    "text": "And so this backwards E is called the existential quantifier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.185,
    "end": 4651.69,
    "text": "So, like, there exists a. X. There exists an X. And then this upside down A is a universal quantifier for all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.97,
    "end": 4656.813,
    "text": "So there exists an X for all Y. And then the T, I guess, is the predicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.519,
    "end": 4659.24,
    "text": " I don't know what that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.46,
    "end": 4663.424,
    "text": "So that Y, and then this is a material biconditional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.444,
    "end": 4667.248,
    "text": "So I was really grateful for the triple equal unpacking because I had no idea what that meant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4667.969,
    "end": 4669.25,
    "text": "And then the identity relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.27,
    "end": 4671.512,
    "text": "So I couldn't even get all the way through reading this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4671.592,
    "end": 4673.334,
    "text": "So if someone would read it to me, that'd be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.715,
    "end": 4674.935,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4675.256,
    "end": 4678.699,
    "text": "Perhaps there exists X for all Y.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4681.636,
    "end": 4694.24,
    "text": " And then the claim is of that or that relationship is that the predicate, which it's the part of a sentence or a clause with a verb stating something about the object, like went home in John went home.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4694.9,
    "end": 4701.643,
    "text": "And then just to see the three and the two, like the three is saying the material by condition, that's the psychophysical part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4702.503,
    "end": 4716.608,
    "text": " it's like saying there's you know something t of y and x those are the parts that are actually materially bi-conditional and then there's an equal sign and those are the identity or let's hear it from alex red in different languages",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4718.587,
    "end": 4733.256,
    "text": " Another topic that came up in this paper, as well as was in 16, is what's the difference between a real mind-brain system versus a simulated mind-brain system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4734.216,
    "end": 4739.279,
    "text": "Like, is every chess-playing algorithm alive just because it can play chess just because people play chess?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4740.099,
    "end": 4743.962,
    "text": "Or does there have to be some other aspect to the information dynamics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4744.642,
    "end": 4745.463,
    "text": "And it's something that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4746.482,
    "end": 4753.85,
    "text": " Both this paper and, again, 16 with Wanda Weiss went in two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4756.553,
    "end": 4757.774,
    "text": "Any thoughts on Real Simulated?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4757.795,
    "end": 4763.921,
    "text": "I really thought this was, like, the crux of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.358,
    "end": 4774.483,
    "text": " So that's my only thought, this identity thesis and the criterion for distinguishing a neural network versus an actual neural network in my brain, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.703,
    "end": 4777.965,
    "text": "Or a person with a neural network or an organism somehow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.267,
    "end": 4786.61,
    "text": "Plankton or whatever, it doesn't have to be a brain because Alex did make that distinction in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.27,
    "end": 4787.571,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4788.211,
    "end": 4793.034,
    "text": "So just a few more last notes for those who stick around to the end to listen to the good stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4794.136,
    "end": 4797.198,
    "text": " First, how does the cell do more with less?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4798.158,
    "end": 4803.481,
    "text": "It's kind of like asking, how does the brain do more with less from a model fitting perspective?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4804.001,
    "end": 4811.786,
    "text": "If you were to train the computer on tracing a baseball, it might use like 100 hamburgers worth of energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4812.406,
    "end": 4817.451,
    "text": " but then you can trace the baseball for a fraction of that one centi hamburger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4818.092,
    "end": 4821.595,
    "text": "So that's the brain doing more with less for model fitting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4822.056,
    "end": 4826.2,
    "text": "How does the cell do more with less in the biochemistry realm?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4827.021,
    "end": 4831.805,
    "text": "And this helps us get an intuition for how the brain might do more with less in the information realm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4833.041,
    "end": 4856.958,
    "text": " and it relates to the hydrolysis or the cutting with water of atp which is a molecule with a high internal energy so you can use some of that internal energy to do other work and also release heat in other words split atp into adp and a free phosphate and extra energy free energy energy you can use and this is what was one of the most fascinating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4858.544,
    "end": 4868.274,
    "text": " probably facts that I learned in my biochem education, exactly how much free energy is released with a hydrolysis of ATP, and how is that free energy used to do cellular work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4869.155,
    "end": 4875.562,
    "text": "The calculated delta G for the hydrolysis of one mole of ATP is negative 7.3 kcal per mole.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4875.942,
    "end": 4879.706,
    "text": "So if you just burn the candle, you get negative 7.3 units of energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4882.731,
    "end": 4883.973,
    "text": " That's under standard conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4884.554,
    "end": 4890.443,
    "text": "In fact, the delta G for the hydrolysis in a living cell is almost double that, negative 14 kcal a mole.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4891.604,
    "end": 4891.785,
    "text": "How?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4893.126,
    "end": 4893.886,
    "text": " Is it vitalism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4894.006,
    "end": 4894.587,
    "text": "Is it magic?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4894.947,
    "end": 4901.749,
    "text": "Well, can't rule that out, but there's a lot of tricks that can be played with localizing reactions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4902.189,
    "end": 4914.274,
    "text": "So you can have a little tiny bubble where the pH is ridiculously acidic, like one proton vibrating around, but it's so small that the proton's local acidity is unreal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4915.194,
    "end": 4928.122,
    "text": " And so there's all kinds of tricks that can be played with how things are combined and separated and connected to each other and related that help you get more energy out of just the hydrolysis of an ATP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4928.803,
    "end": 4939.91,
    "text": "So just think, if you can get 2x on burning the candle in a cell, probably you can do a lot more than 2x on the information in the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4941.252,
    "end": 4942.432,
    "text": " Is that physical?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4943.173,
    "end": 4944.393,
    "text": "Is it just statistical?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4944.893,
    "end": 4945.633,
    "text": "That's the question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4946.614,
    "end": 4949.094,
    "text": "But it certainly is happening physically with a cell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4949.394,
    "end": 4951.675,
    "text": "So it seems like it probably could be happening in the brain as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4953.695,
    "end": 4954.496,
    "text": "Biochemistry, Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4955.356,
    "end": 4956.956,
    "text": "No, the cell has the demon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.777,
    "end": 4963.158,
    "text": "So when we were putting these slides together, it's like, where's Maxwell's demon in here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4963.658,
    "end": 4965.139,
    "text": "The cell has the demon, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.239,
    "end": 4965.559,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4968.28,
    "end": 4971.363,
    "text": " Then where does active inference come into play?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4972.023,
    "end": 4973.265,
    "text": "Hashtag actinflab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4973.965,
    "end": 4977.328,
    "text": "And so we searched for the term and it's used twice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4978.269,
    "end": 4985.956,
    "text": "Both times it's used a little bit indirectly referring to the literature on active inference and the literature on the FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4987.248,
    "end": 4994.35,
    "text": " And also it's related to topics we've talked about like top-down priors, the umwelt of the organism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4994.93,
    "end": 5007.953,
    "text": "So it'd be super interesting to hear from Alex, where does active inference come into play in your agent as you had the thought experiment or just where does active inference come into play?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5010.313,
    "end": 5013.054,
    "text": "And then a key test and prediction, although",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5014.715,
    "end": 5024.561,
    "text": " in another sort of classic three-sentence paragraph, Alex does take it both ways, which is basically to ask whether the identity thesis can be tested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5025.641,
    "end": 5031.024,
    "text": "And he suggests that you could look for a stochastic code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5031.545,
    "end": 5040.21,
    "text": "So in encoding, just like we saw earlier on with that Sengupa 2013 paper, the encoding that's going to be like the sort of trade-off between",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5041.07,
    "end": 5048.974,
    "text": " only giving a little information but making it the right info so that the model can be updated appropriately, is to see if that is empirically plausible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5050.095,
    "end": 5065.623,
    "text": "And this is an interesting philosophical point, which is that the conjunction of the identity thesis with FEP, free energy principle, is a falsifiable hypothesis, even if the FEP is not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5066.423,
    "end": 5082.898,
    "text": " so in actin 14 15 20 we talked a lot about this what is falsification and relationship with the fep and so it's almost like fep is a carrier like it is deployed in really clearly falsifiable ways",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5084.013,
    "end": 5106.778,
    "text": " yet it is more of that carrier wave that isn't directly falsifiable or i'm not sure where what he was getting at here but i thought that was really fascinating to think about not just oh well it's a corollary that's falsifiable it's like we're taking the fep and another field and now that is going to be something that we can both formalize and falsify",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5107.759,
    "end": 5115.266,
    "text": " But here we just had falsification, here we just had formalization, and we had to amalgamate them in order to make something that would take the best of both worlds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5116.947,
    "end": 5117.648,
    "text": "So let's hear from that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5118.891,
    "end": 5128.359,
    "text": " And then this is where I said he has it both ways, which is not that something is true and false, but actually that the evidence is gonna run backwards to us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5128.879,
    "end": 5139.247,
    "text": "He's saying strong empirical evidence for the right type of encoding together with a formulation of cognitive dynamics in terms of that variational Bayesian inference supports the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5139.948,
    "end": 5144.191,
    "text": "So maybe there'd be so much evidence for some kind of encoding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5145.211,
    "end": 5167.942,
    "text": " kind of encoding how much evidence how would we know but we'll find out maybe it would be overwhelming positive evidence for the identity thesis and then as always then what what then then if then all these cool learning terms that dean has been helping us understand what would happen then what would happen if the identity thesis",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5169.184,
    "end": 5189.728,
    "text": " is true or not and then what would we be then so pretty fun thank you both for participating any last thoughts we'll have just a closing section if anyone wants to ask a question to live chat they can otherwise we'll just close it out can i ask one quick question oh yes yeah so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5191.687,
    "end": 5195.729,
    "text": " I'm glad Blue brought up the thing that she thought was really important about the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5196.649,
    "end": 5204.932,
    "text": "So I want to kind of swing all the way back to the beginning, because I think identity as proximal formalisms is really important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5205.452,
    "end": 5210.174,
    "text": "And I want to just read part of what he wrote right directly under this section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5210.754,
    "end": 5216.321,
    "text": " for a transparent code, because he never really does get into this too much, but I think it kind of matters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5216.381,
    "end": 5219.344,
    "text": "He wrote stochastic encoding and variational inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5219.384,
    "end": 5225.952,
    "text": "In order for the thesis of this paper to make sense, it must be kept in view that the generative and recognition densities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5226.821,
    "end": 5253.522,
    "text": " variational inference or densities over and then he puts in brackets possible external causes of the sensory input that is to say in the parlance of most philosophers and nearly all cognitive scientists they are representations and it is their representational function that defines them as statistical models fixing the encoding of the recognition generative densities allows us to directly relate the representational work in quotes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5254.38,
    "end": 5260.545,
    "text": " done as the divergence between the densities is decreased, decreased mind you to physical work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5261.386,
    "end": 5283.583,
    "text": "That to me would be amazing for him to be able to give that to me in real terms, real examples of people doing that on a sort of ad hoc basis, because that would be lovely to turn the what is, because I understand, appreciate the down the train track thing, but the what if.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5284.417,
    "end": 5293.008,
    "text": " to be able to sort of translate that, what he wrote there in terms of a transparent code around what if would make my day and not just my model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5295.971,
    "end": 5297.573,
    "text": "It would make my model of my day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5299.155,
    "end": 5300.577,
    "text": "Make my model of my day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5302.499,
    "end": 5302.599,
    "text": "But...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5304.076,
    "end": 5305.537,
    "text": " That sounds super interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5305.957,
    "end": 5320.288,
    "text": "And that part, first about representations, we didn't even tackle the representation question because also in several other streams, we've asked about what is a representation, internal representation, where are these representations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5320.328,
    "end": 5323.251,
    "text": "What if they're distributed in the environment or among agents?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5323.771,
    "end": 5324.812,
    "text": "Is that still a representation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5325.172,
    "end": 5326.773,
    "text": "But also that adjacent possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5327.694,
    "end": 5333.318,
    "text": "That's kind of like, whoa, if our perception is actually just the tip of the iceberg,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5334.341,
    "end": 5336.542,
    "text": " of a really deeper generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5336.923,
    "end": 5338.904,
    "text": "And there's cases where it seems intuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5338.944,
    "end": 5342.146,
    "text": "Like, oh, well, I guess daytime is contingent on having a model of night.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5343.267,
    "end": 5355.455,
    "text": "Or thinking A is contingent on knowing that it could be A or not A. But even that whole framework for thinking is still just part of a bigger process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5356.415,
    "end": 5361.699,
    "text": "And that's what I think a lot of philosophy tries to grasp at from a lot of sides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5363.305,
    "end": 5367.288,
    "text": " We're working with a kind of forceps, but there's like a bigger picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5368.428,
    "end": 5377.774,
    "text": "Well, it sounds like we're also working with something called the transparent code, which blows me up because, oh, okay, well, if that's all it was, can you just tell me, show me what that is?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5378.134,
    "end": 5381.637,
    "text": "And I know it's going to be hard because it's transparent, but hey, let's go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5381.657,
    "end": 5381.737,
    "text": "Luke?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5387.645,
    "end": 5388.045,
    "text": " I'm good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.426,
    "end": 5388.926,
    "text": "Thanks, guys.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5389.307,
    "end": 5393.13,
    "text": "Well, thanks to those who watched this live or in replay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5393.15,
    "end": 5399.435,
    "text": "We hope that you'll join us for the discussion when it happens or after.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5400.376,
    "end": 5400.797,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5401.077,
    "end": 5401.477,
    "text": "Great times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5401.497,
    "end": 5402.258,
    "text": "Talk to you later, Dean.",
    "speaker": "SPEAKER_03"
  }
]