[
  {
    "start": 6.848,
    "end": 28.789,
    "text": " hello and welcome everybody it is october 18th 2023 and we're here in active inference guest stream 59.1 with david tuckett on conviction narrative theory so david thank you for joining very much looking forward to this presentation and discussion so to you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.153,
    "end": 31.014,
    "text": " Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.595,
    "end": 43.149,
    "text": "Just perhaps a bit of useful background is that I'm someone who started out as an economist in the days when economists were taught more than they are now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.209,
    "end": 46.193,
    "text": "That is to say, also sociology, even a bit of politics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.114,
    "end": 50.558,
    "text": "And then I became a medical sociologist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.673,
    "end": 57.202,
    "text": " while at the same time becoming a psychoanalyst, which I won't attempt to explain, but is obviously different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.943,
    "end": 74.925,
    "text": "And then in more recent years, I've tried to put those things together with going back to economics and trying to understand particularly financial markets, but more generally decision making and how it works on the big scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.496,
    "end": 82.067,
    "text": " So conviction narrative theory is the outcome of this kind of exercise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.048,
    "end": 94.146,
    "text": "I suppose it most immediately started from the fact that I began a series of interviews, but perhaps I'll just come to that in a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.666,
    "end": 97.41,
    "text": " So what is conviction narrative theory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.931,
    "end": 107.225,
    "text": "The purpose of it is that it tries to characterize the social and informational context in which decision making occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.046,
    "end": 111.952,
    "text": "And secondly, the cognitive and affective processes governing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.573,
    "end": 117.18,
    "text": "So it's about how people actually take decisions, not how they ought to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.573,
    "end": 130.444,
    "text": " This book here, Minding the Markets, was a book I published in 2011 and was the outcome of 52 interviews with fund managers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.984,
    "end": 142.776,
    "text": "Those are people who work for some of the large firms like Goldman Sachs or others and were responsible for investing at least $500,000 into the world stock market.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.856,
    "end": 146.48,
    "text": "Some of them invested as much as 20 billion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.6,
    "end": 148.382,
    "text": "So they range.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.362,
    "end": 155.853,
    "text": " And when I was talking to them, I became aware that they were very intelligent people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.354,
    "end": 161.202,
    "text": "They often had up to 20 people supporting them who were also very intelligent and able.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.803,
    "end": 167.471,
    "text": "They had lots and lots of computer power and programs and analytic schemes and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 168.152,
    "end": 175.804,
    "text": "But when it came down to it, what they had to do was to make a judgment and they had to be convinced about that judgment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.037,
    "end": 183.79,
    "text": " And not only that, they had to hold to that judgment over time, which is something that's not often discussed in decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.271,
    "end": 194.528,
    "text": "So if you decide to sell or buy or even hold any kind of investment, that's a decision you make at point one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.129,
    "end": 199.817,
    "text": "But usually it's not going to pay off for you or the whole idea is it won't pay off for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.185,
    "end": 219.612,
    "text": " three five ten years and so you've got to be willing to stick with your decision for quite a long period of time or if you decide you've got it wrong to back out and all of this requires what i realized requires what i call conviction so that's the basis of where this theory started from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.79,
    "end": 228.559,
    "text": " So real world decision making, which is what we're trying to understand here, is best understood by example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.099,
    "end": 239.39,
    "text": "For example, the one I've just given, how to manage an investment portfolio, but also a question like what level of reserves does a bank need to be safe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.41,
    "end": 245.397,
    "text": "A decision like, should you expand your company into a new product or a new technology or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.714,
    "end": 251.662,
    "text": " How much funding should a university or a company allocate to cybersecurity threats?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.423,
    "end": 256.188,
    "text": "What resilience standards should be adopted by government regulation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.829,
    "end": 261.616,
    "text": "Precisely what should we prepare to do to prevent catastrophic climate change?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.176,
    "end": 266.102,
    "text": "How should we anticipate and prevent future potential financial crisis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.823,
    "end": 273.231,
    "text": "Or how do you level up regions of your country or the world which are currently unequal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.592,
    "end": 274.573,
    "text": "These are all pretty big",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.144,
    "end": 279.418,
    "text": " big questions, and I would argue all of them involve uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.438,
    "end": 283.029,
    "text": "So they're massively consequential choices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 283.11,
    "end": 284.013,
    "text": "That's the first point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 284.655,
    "end": 287.263,
    "text": "The data is always going to be incomplete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 287.885,
    "end": 304.221,
    "text": " The options are ambiguous and the future, that is what you know has happened so far, not only may not resemble the past, but in our modern world, which is changing rapidly, is actually unlikely to resemble the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 304.741,
    "end": 309.766,
    "text": "Or you could put it another way, which bits of the past will it resemble and which it won't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.288,
    "end": 317.554,
    "text": "For all these reasons, the axioms of standard decision theory are not satisfied in this situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.293,
    "end": 329.468,
    "text": " Now, the choices that require to make choice in this situation require both commitment and monitoring so as to adapt smartly over time as events unfold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.809,
    "end": 336.117,
    "text": "So in the investment example I began with, you have to be willing not just to make the decision, but to stay with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.498,
    "end": 338.04,
    "text": "It's a bit like a marriage or.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.02,
    "end": 359.691,
    "text": " any other kind of long-term choice of course you can get out of it but the point of doing it is to is to try and stay with it and then it'll also involve monitoring that is trying to assess if in fact you've made the wrong decision so you adapt pretty quickly over time as events unfold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.7,
    "end": 371.433,
    "text": " The context for such choices can be labelled as radically uncertain, because data may or may not be useful and could even mislead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 372.274,
    "end": 376.96,
    "text": "We should be able to say just uncertain, or even we should be able to say risky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.581,
    "end": 390.336,
    "text": "But the problem is these words, uncertain, uncertainty, risky, have all become given very specific meanings in different disciplines, which makes it extremely confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.278,
    "end": 397.973,
    "text": " But the underlying point here is that I'm talking about a situation where the future is yet to be made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.013,
    "end": 399.917,
    "text": "And so it must be imagined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.978,
    "end": 401.1,
    "text": "However, you're going to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.826,
    "end": 404.207,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.795,
    "end": 423.411,
    "text": " Now, conviction narrative theory, which tries to address this situation, is designed as an alternative cross-disciplinary theory of decision making that starts from the proposition that human cognitive, affective and social capacities are well adapted for uncertain contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 423.83,
    "end": 432.94,
    "text": " A great deal of the existing research, at least in psychology, has tended to demonstrate that humans are not very good at decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.98,
    "end": 436.924,
    "text": "Do all kinds of experiments which show that they have biases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.024,
    "end": 438.726,
    "text": "They frame things incorrectly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.746,
    "end": 440.548,
    "text": "They don't use statistics properly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.588,
    "end": 443.191,
    "text": "They get emotional, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.711,
    "end": 448.116,
    "text": "But by the time you finish reading all that research, you wonder, well, how do we get where we are?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.096,
    "end": 452.942,
    "text": " Now, you might be a bit say, yeah, well, look where we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.323,
    "end": 463.456,
    "text": "But if you look at the advances that have been made by humankind, clearly, we're rather good at making new decisions and developing new things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.016,
    "end": 468.642,
    "text": "And there must be something wrong with a theory which fundamentally talks about bias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.083,
    "end": 476.112,
    "text": "And one of the ways of thinking about that is to think that perhaps we're adapted to the real world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.092,
    "end": 486.884,
    "text": " better than we are adapted to the kind of world we set up in labs or the kind of gambling decisions that typically decision making theory tries to start with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.285,
    "end": 498.437,
    "text": "So in both labs and gambling decisions, there is a right answer, or at least there's an answer that consensually people would tend to say was the best the best choice to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.417,
    "end": 524.509,
    "text": " so what conviction narrative theory does and i'll come to it in a moment is it turns the core issue from how to make best decisions which is typically what research has been looking up to now to how to make any decisions at all given the need to act when in fact there's a possibility of facing loss or failure real loss or real failure real disasters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.489,
    "end": 532.853,
    "text": " So how do people do it when they can't, so to speak, be certain or feel there's a really good chance of things working?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.335,
    "end": 537.908,
    "text": "And the answer is that they adopt a conviction narrative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.462,
    "end": 540.086,
    "text": " And I'll try to explain that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 540.186,
    "end": 556.943,
    "text": "But the basic idea is they adopt, of course, a course of action, which they believe to be supported by a narrative, which convinces them that by adopting that course of action, they will get to the outcome they want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.075,
    "end": 579.673,
    "text": " on the whole people don't invent conviction narratives just out of thin air what they actually do is they adapt narratives that is ideas about what actions are effective for the particular thing they're trying to do from those already circulating in their networks could be in their company in their social group etc",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.615,
    "end": 599.08,
    "text": " Now, one of the key things that conviction narrative theory is designed to direct you towards is that if you accept that the basic way people make decisions is by trying to adopt a conviction narrative because of the need to act, then what becomes interesting is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.836,
    "end": 600.878,
    "text": " How do they do this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.579,
    "end": 615.82,
    "text": "And in order to begin thinking about that, the theory postulates two particular states of people or of organisations, which I'll come back to, in which this conviction is generated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.421,
    "end": 619.266,
    "text": "One is called divided and the other integrated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.606,
    "end": 627.278,
    "text": "I'll try and explain in more detail, but integrated basically means where people bring all the information available",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.258,
    "end": 630.985,
    "text": " to bear and they're as sensible as they can about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.005,
    "end": 632.648,
    "text": "They realise what they're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.688,
    "end": 637.616,
    "text": "They know it's uncertain, but they're still able to make major commitments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.057,
    "end": 642.505,
    "text": "So it's kind of academic nirvana if I should make decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.346,
    "end": 651.561,
    "text": "Divided is where for one reason or another, people only consider part of the story, part of the outcomes, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.195,
    "end": 667.221,
    "text": " And what conviction narrative theory is designed to do is to kind of alter the way we approach these problems and so identify different kinds of ways for doing research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 668.939,
    "end": 676.29,
    "text": " OK, now a central idea that follows from all this is the idea of ambivalence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.871,
    "end": 681.798,
    "text": "And this is an idea that I do get from psychoanalysis, though it's also used otherwise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.439,
    "end": 688.508,
    "text": "And ambivalence is an intrinsic property of any human relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.069,
    "end": 696.28,
    "text": "If you consider a marriage, an employment contract, or just about anything which lasts for any length of time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.26,
    "end": 704.668,
    "text": " you will tend to have at any given time feelings in favor of doing it and feelings against doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.208,
    "end": 706.229,
    "text": "It's pretty normal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.729,
    "end": 709.992,
    "text": "That is, feelings generate approach or avoidance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 710.613,
    "end": 714.777,
    "text": "But of course, there'll be an overall level at any one time of one or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.797,
    "end": 717.079,
    "text": "Once you get avoidance, you get out of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.279,
    "end": 720.482,
    "text": "Once you have approach, then you basically go on doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.822,
    "end": 726.267,
    "text": "And this is based on work going back to Freud or the sociologist Neil Smelson.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.247,
    "end": 735.002,
    "text": " Now, decision making in radical uncertainty necessarily evokes, causes people potentially to be ambivalent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.623,
    "end": 745.4,
    "text": "Because while time is unfolding, once you've made the decision, the outcome of your actions continues to be uncertain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.941,
    "end": 749.487,
    "text": "And ex ante, you quite simply cannot know the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.26,
    "end": 755.469,
    "text": " And that inevitably creates anxiety and anxiety creates avoidance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 755.489,
    "end": 759.476,
    "text": "There's always a tendency to want to stop what you're doing, perhaps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.597,
    "end": 767.509,
    "text": "Or if it's the other way around and you decided not to do something, the argument that maybe you should have can come back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.198,
    "end": 778.672,
    "text": " So consequently, contemplating action to exploit a perceived opportunity must stimulate a greater feeling of approach than avoidance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.992,
    "end": 780.354,
    "text": "Pretty simplistic theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.935,
    "end": 794.313,
    "text": "But in other words, approach feelings generate lots of let's do it kind of feelings and avoidance feelings trigger loss aversion, inhibition and withdrawal or a defence against that, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.353,
    "end": 795.454,
    "text": "just being blind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 796.514,
    "end": 808.589,
    "text": " Conviction narrative theory, CNT, focus attention really on how this ambivalent situation, which I want to stress is both affective and cognitive, is dealt with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 809.63,
    "end": 815.738,
    "text": "And as I mentioned before, the divided state or the integrated state are two ways of thinking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 816.579,
    "end": 825.39,
    "text": "You could think that if you accept radical uncertainty, then most decisions really are experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.37,
    "end": 849.032,
    "text": " and if you play with that idea it's quite interesting because making decisions in so to speak experimental mode is rather different than making decisions in in other modes because if you're doing it in experimental modes it means that from the start you would perhaps build into the situation as you do with an experiment ways of measuring",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 849.012,
    "end": 864.007,
    "text": " what's going on, giving you feedback, formalizing your hypotheses as to why you think things are going to work out and then getting some sort of feedback as to what's actually happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.708,
    "end": 875.138,
    "text": "Now, obviously, one trick here, the trick that's which most disastrous potentially is you simply eviscerate doubt so that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.118,
    "end": 888.993,
    "text": " And one of the problems is that a lot of modeling decision, a lot of modeling that is called for in public decision making is often used, whatever the modelers might have intended to actually get rid of doubt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.073,
    "end": 893.999,
    "text": "Oh, well, my model tells me it's all right to do it sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.019,
    "end": 898.483,
    "text": "OK, so to say a little bit more, I've used the term narrative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.724,
    "end": 901.767,
    "text": "And so it's worth trying to say what is actually meant by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.759,
    "end": 908.567,
    "text": " In our theory, narratives are structured, higher order mental representations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.61,
    "end": 926.29,
    "text": " which incorporate all of causal, temporal, analogical and valence information about agents and events, which serve to explain data, imagine and evaluate possible futures and motivate action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.891,
    "end": 938.284,
    "text": "So there are quite a lot of things that look like narratives, which aren't narratives unless they have the potential to do all those things that I've just read out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 938.45,
    "end": 943.996,
    "text": " It may not always be in the narrative, but it is there potentially for it to be a narrative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.397,
    "end": 948.982,
    "text": "So, you know, you would tell a story about what would be the effect of giving this talk, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.064,
    "end": 957.432,
    "text": "Now, narrative fragments are subsets of the elements in a narrative which can be readily communicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.953,
    "end": 965.942,
    "text": "So it doesn't seem to us after a lot of thinking about it and study that there's very much to be gained",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.922,
    "end": 974.053,
    "text": " from trying to decide when is it a big narrative, when it's a small narrative, when it's a narrative, when it's a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.534,
    "end": 984.167,
    "text": "They have to recognise that narratives tend to be made up of other narratives, of smaller fragments on which the main narrative depends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.278,
    "end": 988.162,
    "text": " The second important concept is shared narratives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.464,
    "end": 998.177,
    "text": "What I'm getting at here is that there are narratives that are shared within social networks, which are, so to speak, dominant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.197,
    "end": 1001.362,
    "text": "So in a particular group, this is the way we do things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.422,
    "end": 1003.245,
    "text": "This is the way we understand things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1003.845,
    "end": 1008.973,
    "text": "Science has lots of shared narratives which govern scientific methodology, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.957,
    "end": 1014.76,
    "text": " Third important term is explanatory models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.181,
    "end": 1026.573,
    "text": "This is taken from social anthropology and explanatory models are culturally valid systems of understanding, often expressed as narratives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.174,
    "end": 1037.205,
    "text": "So, for example, a theory of economic growth is explaining how economic growth takes place, a theory of COVID infection and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.075,
    "end": 1042.441,
    "text": " Finally, a crucial concept is feelings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.022,
    "end": 1053.88,
    "text": "And this is based on the idea that feelings, and modern neuroscience is demonstrating this pretty strongly, that feelings are at the centre of all brain activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.301,
    "end": 1064.779,
    "text": "That is, most things you can observe when you look at brain scans and things like that, you typically see movements between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.759,
    "end": 1073.228,
    "text": " different parts of the brain and often going through parts of the lower brain, except for the amygdala and areas of that kind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1074.249,
    "end": 1085.721,
    "text": "The function of feelings, it seems, is that they force their way to consciousness in the human brain and they prioritize conflict resolution in context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.222,
    "end": 1087.683,
    "text": "And this is particularly important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.743,
    "end": 1093.129,
    "text": "It's especially important for economists who, for example, have a theory of utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.109,
    "end": 1102.341,
    "text": " Because I think what we learn from what we know about feelings in the brain is that your utility function alters according to context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.782,
    "end": 1105.425,
    "text": "And the brain is sort of set up to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.046,
    "end": 1113.516,
    "text": "So we actually have a number of conflicting aims, which where one or other is turned on according to the particular context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.596,
    "end": 1121.547,
    "text": "For example, to look after people, caring as opposed to enjoy ourselves and so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.231,
    "end": 1130.942,
    "text": " The overall effect is we feel we want to approach or avoid, including when you're listening to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.003,
    "end": 1138.714,
    "text": "Some of what I'm saying may be sort of switching you off completely, where you may be struggling to listen or even not want to listen at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.754,
    "end": 1141.518,
    "text": "Other bits may be making you feel, yes, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.859,
    "end": 1145.885,
    "text": "And this is going along with whatever cognitive judgments you're making as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.426,
    "end": 1148.749,
    "text": "So to summarize, I don't see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.729,
    "end": 1156.105,
    "text": " although it's useful to talk about cognition and feelings maybe separately, they always operate together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.648,
    "end": 1164.443,
    "text": "That's a picture of the brain to show the point I made, which I won't develop now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.743,
    "end": 1171.51,
    "text": " The fundamental point is that for a long time in the 19th century, the brain was understood the wrong way around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.65,
    "end": 1177.396,
    "text": "That is to say, just because the cortex is on the top there and information comes through the core.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.776,
    "end": 1184.122,
    "text": "Actually, it's the lower parts of the brain which are fundamental to conscious decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.623,
    "end": 1189.688,
    "text": "And the cortical function is kind of added on top.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.22,
    "end": 1199.599,
    "text": " Now, there are four functions of conviction narrative theory as to which explain why conviction narratives work as they do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.639,
    "end": 1201.944,
    "text": "This slide doesn't seem to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.964,
    "end": 1209.381,
    "text": "So the first function of a narrative in conviction narrative is explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.361,
    "end": 1217.189,
    "text": " that the narrative imposes structure on the current situation that yields a sense of understanding and emotional satisfaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.629,
    "end": 1225.777,
    "text": "So, for instance, typically when people do science, they do all the stuff they do with the methodology and so forth, and they present results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.017,
    "end": 1231.883,
    "text": "But in doing so, they tell a story about explaining the situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.384,
    "end": 1233.164,
    "text": "And that we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.224,
    "end": 1236.988,
    "text": "Most stories have an explanatory quality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.964,
    "end": 1243.792,
    "text": " The second element in a conviction narrative is it allows a mental simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.493,
    "end": 1253.185,
    "text": "So, for example, if you are thinking about, shall I adopt this particular way of trying to do climate mitigation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.087,
    "end": 1261.457,
    "text": "I can think of the actions, I can imagine, I can get all sorts of spreadsheets and proper hard information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.437,
    "end": 1268.905,
    "text": " And I can try and look at what I think will be the outcome of that particular activity in 20 years time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.945,
    "end": 1277.814,
    "text": "And as I do it in some way or other, I'll be forming at least implicitly pictures in my mind of what the Earth looks like when I finish doing all this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.455,
    "end": 1282.419,
    "text": "And then you can compare an alternative or many alternative narratives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.819,
    "end": 1290.347,
    "text": "And so to speak, you run the narrative forward to generate imagined futures associated with a particular choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.508,
    "end": 1301.704,
    "text": " The third, which follows from what I said about feelings, is that these explanations and mental simulations are evaluated affectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.123,
    "end": 1311.661,
    "text": " So you react emotionally to the futures you imagine to evaluate their desirability and that helps to manage commitment over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.283,
    "end": 1317.713,
    "text": "And the fourth and really important function of narrative in a conviction narrative is communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.334,
    "end": 1322.342,
    "text": "Most important big decisions of the kind I'm interested in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.322,
    "end": 1325.226,
    "text": " involve a number of people working together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.246,
    "end": 1334.379,
    "text": "It could be several labs, for instance, or it could be people working to a particular aim in regard to climate or many other problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.9,
    "end": 1345.474,
    "text": "And so when you work together with other people, you have to motivate them and you have to explain to them and you have to give them an idea of where you're going and what the point is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.855,
    "end": 1350.321,
    "text": "And we use narratives for that and narratives that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.301,
    "end": 1366.858,
    "text": " propagate across social networks and become in that way maybe shared narratives so the other thing i'd like to stress is the conviction narrative is not any old narrative it's a narrative that sets out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.159,
    "end": 1373.391,
    "text": " how you're going to change the current situation by an action to lead to a desired outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.612,
    "end": 1381.708,
    "text": "And to do that, you draw on narratives in your context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.701,
    "end": 1410.885,
    "text": " the narratives solve uh two particular uh or there are two sets of problems in decision making if you think about it we call this the logic of decision so that decisions reflect both data picked up from the external world including the social environment and internally derived goals so to make a decision you've got to do both things you've got to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.865,
    "end": 1414.43,
    "text": " pick up data and then add it to your goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.15,
    "end": 1420.677,
    "text": "The first aspect of this you can call the mediation problem, which in the diagram is the dashed lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.919,
    "end": 1436.097,
    "text": "It reflects the need for an internal representation, what in our paper we call a currency of thought, that can mediate between data from the external world and actions decided internally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.262,
    "end": 1444.916,
    "text": " And one of the things about economics, for those who are economists, is that economics actually has, as far as I can tell, no theory of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.657,
    "end": 1450.666,
    "text": "Models in economics, you just write down, you know, R for real rates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.146,
    "end": 1455.474,
    "text": "It doesn't have a theory of how people come to know what the real rates are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1455.794,
    "end": 1463.046,
    "text": "And of course, as soon as you do have to fix such a theory, you've got lots of room for disagreement and differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.207,
    "end": 1480.748,
    "text": " Second is the combination problem, which is the grey lines, and that reflects the need for a process, a driver of action, something to get you actually doing something that combines beliefs and goals to yield actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.217,
    "end": 1491.932,
    "text": " And in classical theory, classical decision theory, the currency of thought is probability and the driver of action is expected utility maximization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.452,
    "end": 1502.105,
    "text": "So if you've got a probability of 70% of success and that's good enough, then what you're supposed to do is to choose the highest thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.646,
    "end": 1506.972,
    "text": "And that is a very seductive and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.952,
    "end": 1536.705,
    "text": " sensible way to make decisions provided you think you've got probabilities in behavioral economics the main emphasis is on how people get the wrong probabilities they make decisions based on biases and so on that they don't take the probabilities properly into account in radical uncertainty that the argument is there aren't probabilities or at least there aren't probabilities for the kinds of questions that i've been trying to talk about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.052,
    "end": 1549.868,
    "text": " So in CNT, the currency of thought we propose is narratives, and the driver of action is affective evaluation of narratives in a social context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.907,
    "end": 1556.572,
    "text": " And this is a rather complicated slide to say something about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.032,
    "end": 1571.548,
    "text": "You see that we have data, we have the narratives, we have this explanation and simulation, there's affective evaluation leading either to approach or avoidance, link with your goals, and then you take action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.188,
    "end": 1576.733,
    "text": "So that representation and processes in conviction narrative theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1576.814,
    "end": 1606.821,
    "text": " narratives supplied in part by the social environment is a very important part of the theory that we're picking up narratives from around us all the time are used to explain data they can then be run forward in time to simulate imagined future outcomes of action which are then evaluated effectively considering the decision makers goals and these appraisals of narratives then govern our choice to approach or to avoid these imagined futures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.801,
    "end": 1610.926,
    "text": " And you see from the figure there's lots of feedback loops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.187,
    "end": 1616.292,
    "text": "Okay, and I'll just talk a little bit about divided and integrated states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.293,
    "end": 1633.332,
    "text": "So, as I mentioned, this diagram is supposed to illustrate narrative prediction, that is, what your narrative is going to tell you to do as you get new information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.733,
    "end": 1636.216,
    "text": " based on where you started your prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.857,
    "end": 1648.933,
    "text": "So insofar as the new information you get creates congruent feelings to where you were before, you can pay attention to that data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1649.654,
    "end": 1656.923,
    "text": "In an integrated state, you pay attention whether it's congruent or not congruent with your existing narrative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1657.24,
    "end": 1687.028,
    "text": " in a group feel or divided state how it works is you only pay attention to the things that you already agree with in other words confirmation bias and incongruent fee information that produces incongruent feelings is ignored so this is how you get bubbles in finance and bubbles in lots of areas of activity in society because if you don't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.497,
    "end": 1692.544,
    "text": " If you don't attend to the negative information, then that's the only way you can go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.185,
    "end": 1695.227,
    "text": "Bear in mind, this can also work the other way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.268,
    "end": 1704.019,
    "text": "If, for example, you're in a depressed or in a state where we're not doing anything, you can continue to there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.039,
    "end": 1706.202,
    "text": "You discount the positive information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.543,
    "end": 1709.607,
    "text": "And so you stay in a repetitive bubble.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.312,
    "end": 1739.661,
    "text": " So an integrated state of affairs is that envisaged in normative theories of science based on experimentation and or inference, strategic actors are curious, a broad range of information and perspectives, both supporting and challenging plans and actions are considered, and it's recognized that there are uncertainties and contradictions within the preferred conviction narrative supporting a strategy or policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.641,
    "end": 1749.621,
    "text": " And crucial to the integrated state is the idea you know that although you're making a decision, it could be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.102,
    "end": 1753.168,
    "text": "So you're open to new information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.909,
    "end": 1758.358,
    "text": "The divided state, I won't go through it again, is just the opposite of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1760.228,
    "end": 1777.444,
    "text": " OK, and this is just a last slide to just give a quick link to work that's been done, particularly in psychology, where you can see that this whole theory is very dependent on what's going on in your local social environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.424,
    "end": 1785.217,
    "text": " Because in your local social environment, there are various narrative elements influencing your evaluation of narratives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.778,
    "end": 1796.715,
    "text": "So the stories that are around, the shared history of the group, various heuristics or logics or frames or conventions, beliefs and so on, which are all there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.477,
    "end": 1799.5,
    "text": "But these interact with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1799.48,
    "end": 1812.994,
    "text": " The three things which have been found very significant in lots of psychology, what are called content effects, that is ways in which different content tends to be picked up positively or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1813.034,
    "end": 1818.06,
    "text": "Trustworthiness effects that there are all sorts of effects about listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.1,
    "end": 1826.989,
    "text": "You can dress somebody up to look like a professor and people are supposed to believe them more as opposed to a tramp or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.969,
    "end": 1849.872,
    "text": " uh and presentational effects which has to do with the way things are presented and so on this can influence whether a narrative is convincing or not and overall you get the the usual thing that it all leads to a narrative which either generates approach or avoidance and only if there's a positive balance do you go for action okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.97,
    "end": 1851.833,
    "text": " So that's roughly the theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.873,
    "end": 1856.941,
    "text": "I hope it makes some sense and generates some questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.433,
    "end": 1864.853,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.114,
    "end": 1866.055,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.558,
    "end": 1875.859,
    "text": " Okay, well, while I am cropping and returning everything to normalcy visually, how did you come to this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.879,
    "end": 1882.795,
    "text": "I mean, what brought you through the warps and the weaves to want to highlight this perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.395,
    "end": 1895.457,
    "text": " Well, so first of all, I think when I was I was lucky enough to study economics at King's College, Cambridge had been the College of John Maynard Keynes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.477,
    "end": 1905.357,
    "text": "And when I was there, it was still very much we were taught by Keynes pupils and they saw economics as very much to do with the management of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.337,
    "end": 1929.808,
    "text": " economics today has defined uncertainty in such a way that doesn't have to take it into account and so everything can have a probability and so on so I I've always felt uncomfortable with what's happened in economics because the real world seems to me uncertain as I said earlier um you know there's the whole point about human",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.43,
    "end": 1954.648,
    "text": " innovation and and the way in which new companies are formed in an economy or new scientific theories come about etc is is there new they may be recombinations of the past but they are they're new and and it it's not helpful to have a kind of equilibrium theory but for those sorts of problems however useful it might be for other things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1954.932,
    "end": 1956.615,
    "text": " And so that was a general background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.118,
    "end": 1962.487,
    "text": "It was through psychoanalysis that I came to see the importance of feelings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.749,
    "end": 1971.765,
    "text": "Most people, when they think about psychoanalysis, probably haven't don't know much about it or had a rather half baked explanation given.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.286,
    "end": 1977.075,
    "text": "But actually, what Freud's major contribution is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.055,
    "end": 1999.182,
    "text": " uh was that he understood that so to speak feelings and thoughts are intricately linked that if the thoughts you're having make you feel bad you'll do all kinds of things not to have them or even not to need to have have them in the first place so this link between thoughts and feelings has always been around",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.162,
    "end": 2001.725,
    "text": " It actually came in part from his neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.166,
    "end": 2008.915,
    "text": "But in more recent times, it's now become, I think, a largely accepted view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.935,
    "end": 2018.528,
    "text": "I gave this theory, the outlines of this theory to, I tried out on Carl Friston, who probably most of you know, about 10 or 11 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.648,
    "end": 2020.47,
    "text": "And Carl is a great listener.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.49,
    "end": 2025.156,
    "text": "He sat there and he listened for about 15 minutes and he looked very thoughtful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.196,
    "end": 2026.418,
    "text": "And then he said,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.398,
    "end": 2032.392,
    "text": " Well, there's nothing you've said which is in opposition to current neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.412,
    "end": 2033.435,
    "text": "And so that was nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.716,
    "end": 2035.36,
    "text": "That encouraged me to go on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.38,
    "end": 2042.196,
    "text": "Anyway, so also, as I've mentioned, when I began trying to understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.497,
    "end": 2057.48,
    "text": " how could the dot-com crisis in financial markets have come about, which I was studying just as the global financial crisis was actually not happening, but about to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.9,
    "end": 2066.293,
    "text": "It was then that I realized, and I think quite a lot of people have realized it afterwards, that this kind of thing in which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.273,
    "end": 2086.915,
    "text": " people make decisions based on convictions they do the best they can with the information they've got but by its nature that what they do is uncertain and therefore fragile awesome yeah definitely while there wasn't any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.958,
    "end": 2101.668,
    "text": " active inference generative models in the talk, you brought up so many motifs that I think we can explore a little bit because they're the kinds of things that as you pointed towards, necessitate a cognitive account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.67,
    "end": 2106.118,
    "text": "So first, how would you see cognitive modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.74,
    "end": 2111.928,
    "text": " playing a role in microeconomics or macroeconomics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.069,
    "end": 2120.122,
    "text": "What kind of cognitive model, what kind of explanation, prediction or intervenability do you seek?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.587,
    "end": 2129.777,
    "text": "There's no doubt that as we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.926,
    "end": 2137.423,
    "text": " As we go about our business, we form cognitive models of the world around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.366,
    "end": 2145.522,
    "text": "And in my opinion, that's a useful way to think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.502,
    "end": 2151.457,
    "text": " And I really call them explanatory models because I first encountered them in anthropology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.778,
    "end": 2161.823,
    "text": "This was when I did a big study in the late in the mid 80s of a thousand patients going to their doctors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.921,
    "end": 2187.945,
    "text": " and looking at what they'd understood and to cut a long story short although at the time it was widely thought that patients didn't understand most of what their doctors said and therefore it wasn't really worth their doctors spending much time talking to them in fact what we found was that most patients did understand what their doctors were saying but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2187.925,
    "end": 2213.292,
    "text": " that where they didn't it was because the model of understanding what was wrong with them that the patient had say had their own model was not the same as the model the doctor had and they hadn't established the the two explanatory models and then you know put them together and in fact very often it would have been quite easy for the doctor if he knew what the patient was thinking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.272,
    "end": 2238.672,
    "text": " to point out that this that or the other assumption or processes as we would say you know wasn't how things worked and then that would have helped the patient to understand as it was the patient just went away not quite understanding what had gone on and often didn't follow the treatment so that's how I got into if you like cognitive models now when you try to formalize them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.563,
    "end": 2262.364,
    "text": " uh uh you know i think it's extreme it's extremely interesting to try and formalize them but i always have the reservation that um you know where it's always where we're getting the information from and how robust is it to changing circumstances i mean that's that's the that's i think the key problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.52,
    "end": 2268.9,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.461,
    "end": 2279.654,
    "text": "So I was very interested by that provocative example of the person making financial decisions with a 20 person team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.196,
    "end": 2291.329,
    "text": "That's a lot of attention and energy, a lot of skin in the game just for that kind of an organization to deploy that kind of a decision support setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.13,
    "end": 2297.076,
    "text": "So how do we think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.866,
    "end": 2316.027,
    "text": " works or doesn't when there's group decision making and then how does that integrated divided dialectic within an individual relate to the status of the integrated or divided understanding that might arise at a group",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.007,
    "end": 2341.288,
    "text": " level especially if it's a decision where like it's obvious from the get-go that no no one of those people know whether the stock is going to go up or down so then what does that 20th person or the 21st person or the 22nd person do on that team to actually empirically lead to better outcomes that's a really it's a really good question uh uh so and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.977,
    "end": 2347.764,
    "text": " In order to think around it, there are certain background facts that are important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.944,
    "end": 2366.888,
    "text": "One is that these people doing that work are on the whole the most highly paid people in our society, which adds a level of fascination to your question, because we know from academic research that no one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.863,
    "end": 2376.914,
    "text": " there's no published data anywhere to suggest that anyone can consistently do better than the average, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.934,
    "end": 2378.496,
    "text": "And the reasons are obvious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.318,
    "end": 2383.622,
    "text": "Nonetheless, there's always hope, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.343,
    "end": 2388.247,
    "text": "And so one of the ways you could start to think about it is this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.589,
    "end": 2396.537,
    "text": "Supposing it's your pension and you've got a choice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.787,
    "end": 2412.957,
    "text": " to put the money in something which will just get you the average which of course will mean that at times it'll go down at times it'll go up except you'll just get the average versus somebody who says well you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.033,
    "end": 2415.756,
    "text": " I can do better than the average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.377,
    "end": 2418.06,
    "text": "Look at my last year's results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.12,
    "end": 2426.534,
    "text": "And last year's results will show better than the average because obviously by statistics, some people do better than the average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2427.455,
    "end": 2435.428,
    "text": "So then it's quite difficult for people, it seems, to say no to the possibility of doing better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2435.488,
    "end": 2437.071,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.726,
    "end": 2452.684,
    "text": " That might be one part of the story here, but at the level of the people with 20 teams, they essentially are paid to do this work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.704,
    "end": 2457.53,
    "text": "We know that they do it better than you or I could do it on average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2457.65,
    "end": 2467.041,
    "text": "So there are studies that show that individual investors don't do as well as professional investors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.223,
    "end": 2492.067,
    "text": " But there are increasingly studies that active investors, that is people doing sort of what I did, you know, who look over the data and try and decide what to do, that active investors in fund management don't on average beat some form of more computer based automated way of doing it, which just looks at averages and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2492.367,
    "end": 2496.291,
    "text": " Of course, all of these methods fall apart under certain situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.432,
    "end": 2503.898,
    "text": "Computer-based methods did terribly badly at certain times, and they have done recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.939,
    "end": 2520.535,
    "text": "And we also know that if you know what private equity, if you've heard of private equity or venture capital, this is another level which ordinary people aren't allowed to invest in because it's supposed to be risky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.544,
    "end": 2535.159,
    "text": " but where actually they often do do better though because they've got less money to play with and they can use expert knowledge in particular areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.279,
    "end": 2538.343,
    "text": "Again, it's subject to all the problems I've talked about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.363,
    "end": 2543.629,
    "text": "So what is all this about and why are there all these people engaged in it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.729,
    "end": 2545.611,
    "text": "And I think the answer is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.591,
    "end": 2564.46,
    "text": " that there's a constant attempt to support the narrative that you know what do you do with your money so I mean the university's got the university pension funds got to invest right your pension it's got to be done somehow and uh uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.845,
    "end": 2571.313,
    "text": " Yeah, I could go on a great deal because I think the conclusion from this is that it doesn't work very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.353,
    "end": 2579.103,
    "text": "And that's because what people do is they pursue what I call in the book fantastic objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.784,
    "end": 2591.038,
    "text": "That is, they become convinced that the new way of doing hydrogen technology or the new way of doing this, that or the other, which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.018,
    "end": 2609.972,
    "text": " is a way which is promising but which nobody knows enough about to be sure about that's going to be the thing to make you your millions and that's what you'll invest in or there's abc person who's a fantastic investor he becomes a fantastic object okay so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.952,
    "end": 2627.37,
    "text": " What a fantastic object works with groupthink in a divided state to get rid of doubt and then create this process I described earlier, which is a sort of self-fulfilling prophecy process, which works until it doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.535,
    "end": 2631.896,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.639,
    "end": 2641.174,
    "text": "Another piece I found really interesting is the laboratory decision-making setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.323,
    "end": 2647.353,
    "text": " whether it's reductionist or however we want to characterize it, it focuses on certain kinds of decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.734,
    "end": 2663.882,
    "text": "First off, ones that align well with the axioms of standard decision theory, but just pragmatically, they tend to be these one-shot gambling decisions or game theory decisions that are really amenable to the kinds of matrix calculations and the Nash game theory and all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.625,
    "end": 2666.166,
    "text": "And yet...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2667.192,
    "end": 2671.557,
    "text": " that is not how it feels to be making decisions day to day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.617,
    "end": 2676.002,
    "text": "And then you brought in the approach avoid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.563,
    "end": 2693.182,
    "text": "So when the gambling is in front of us and we only have the decision-making alternatives, it kind of removes this meta on the decision, like whether one even approaches that slot machine or not, which is a much more nebulous decision because everybody starts in a different position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.923,
    "end": 2696.946,
    "text": "And then also this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.044,
    "end": 2718.597,
    "text": " consistency which is really where conviction comes into play within with the marriage or with the investing which is even a decision at one time point is really more like an agentic event in a broader tapestry or narrative whereas in the gambling setting it can lead one to make models that are sort of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.062,
    "end": 2722.525,
    "text": " Decision, next, next, next, next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.725,
    "end": 2726.63,
    "text": "And it's like blank slate every single time that a new decision is made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.71,
    "end": 2748.557,
    "text": "And then that has limited ability to transfer in to all kinds of other situations that you describe as having that radical uncertainty, like to the root, rather than a superficial uncertainty, like whether in this one narrow decision, something should happen one way or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.698,
    "end": 2749.798,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.977,
    "end": 2765.678,
    "text": " exactly i i think that's that's exactly right and of course the i mean it's not really to be negative about all the stuff that's been done because it's shown very interesting things but i think the the main",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.282,
    "end": 2771.73,
    "text": " The main issue is, have you identified your context correctly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.83,
    "end": 2791.839,
    "text": "Because we kind of know, I mean, to go to sort of Bayesian stuff, as I understand it, although I don't fully understand how it's really done, there's an argument that we're good samplers, that we sample well locally, people do, on the whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2792.8,
    "end": 2796.205,
    "text": "But of course, the problem comes when you get out of your context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.961,
    "end": 2809.154,
    "text": " And so I think the key issue is sort of the transferability of information or knowledge from one context to the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.075,
    "end": 2821.568,
    "text": "Some friends of mine, Lenny Smith and Erica Thompson, have written a paper called Escape from Model Land, which is all about how, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2821.885,
    "end": 2823.067,
    "text": " They're modelers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.467,
    "end": 2827.854,
    "text": "They do weather forecasting and climate models and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.214,
    "end": 2836.867,
    "text": "But the question is, how do you get out of the model into the real world and what challenges do you then face?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.528,
    "end": 2844.298,
    "text": "I mean, and that's much more, of course, economic models are much weaker than those kind of models they're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2844.278,
    "end": 2854.356,
    "text": " But it's a context thing and how can you assess whether you've got the right things in your model, you've got the right data, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.497,
    "end": 2861.89,
    "text": "And these are the things where you tend to, I mean, the financial crisis was partly caused by people having the wrong models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.254,
    "end": 2866.759,
    "text": "But they'd seen right at the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.684,
    "end": 2895.7,
    "text": " yeah well the active sampling a good sampler is exactly what active inference is about our isocades are in the business of doing good sampling good epistemic value and when the context shifts like if you have a book and you flip it upside down your isocating is not going to be making as good sampling and that's why it's hard to read let me ask some questions from the chat all right bert asks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.405,
    "end": 2915.038,
    "text": " are many similarities with scenario planning in transport policy how could policy planning move from cost benefit analyses to the use of narratives well that's that's a very that's a very good question there's a there's a paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.098,
    "end": 2922.826,
    "text": " on the second paper down that deals with futures and foresight and convictionality theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2922.846,
    "end": 2941.549,
    "text": "But so the problem with cost benefit analysis is kind of a logically sensible idea in which you try to work out the costs of a project and you try to work out the benefits and then you work out whether it's worth doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.529,
    "end": 2955.486,
    "text": " The problem is with all the assumptions, as obviously the questioner realises, and in a formal cost benefit analysis, you have to make up lots and lots of numbers in order to make it formally work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.506,
    "end": 2961.934,
    "text": "So I think the question is whether you're using the cost benefit analysis to have a discussion,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.184,
    "end": 2988.276,
    "text": " about making a decision and to open up ways of thinking and question assumptions and all that kind of thing or whether you're using it to come up with an answer which then you aren't responsible for and you can say you know the model told me this i mean putting it bluntly but obviously the major problem is with with uh cost benefit analysis in transport",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.256,
    "end": 3007.633,
    "text": " is you have to make all kinds of assumptions about the benefit of going half an hour quicker or of having fewer people in your railway carriage or over what period of time you're going to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.693,
    "end": 3011.26,
    "text": "We know that most major projects",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.24,
    "end": 3037.483,
    "text": " have always overrun costs have always been heavily criticized at the time uh the sydney opera house is quite a good example in a completely uh iconic building that was a total disaster when when it people first played music in it etc and and obviously we have things closer to home in the uk at the moment which have this problem so i think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.75,
    "end": 3057.801,
    "text": " where conviction narrative theory can can help you with that process is by first of all helping you to look at try to dissect your narrative where are you getting your conviction from and which bits of the information you're getting which narratives",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.933,
    "end": 3061.539,
    "text": " are being considered compelling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3061.899,
    "end": 3064.644,
    "text": "Which narratives are not being discussed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.664,
    "end": 3075.081,
    "text": "What points of view, for example, the working class people through whom the freeway goes, are not being taken into account?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.061,
    "end": 3076.423,
    "text": " etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.545,
    "end": 3095.736,
    "text": "So I think it can assist with thinking around decisions and with using formal methods, which I'm absolutely not against using formal methodologies, but using them properly and checking out their work in the context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.125,
    "end": 3099.487,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.688,
    "end": 3100.01,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.795,
    "end": 3103.269,
    "text": "Another question from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.033,
    "end": 3105.743,
    "text": "So Shagor writes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.55,
    "end": 3133.131,
    "text": " even if on average generating alpha returns are not possible is there work that identifies selected investors such as warren buffett and others that have consistently identified asset mispricing wouldn't identifying investors that are able to consistently spot mispricing support conviction narrative theory i.e sophisticated or successful investors might understand how the narrative could change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.119,
    "end": 3146.179,
    "text": " Well, I haven't done the research on whether or not there are consistently successful investors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.7,
    "end": 3152.571,
    "text": "But as I understand the literature, and it's pretty consistent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3152.551,
    "end": 3162.546,
    "text": " The answer is no, there aren't any consistently successful investors, and those who are successful eventually aren't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.586,
    "end": 3171.218,
    "text": "I mean, I happen to have quite a close friend of mine, George Soros, who is one of the people who did very well, but he also failed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.438,
    "end": 3174.723,
    "text": "If you talk to him, he failed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.044,
    "end": 3180.111,
    "text": "And of course, once you get like Warren Buffett,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.091,
    "end": 3188.26,
    "text": " It's complicated there because if Warren Buffett does something, you know, other people do it and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.56,
    "end": 3200.033,
    "text": "But it's, of course, possible as all the statisticians on the listening to this will tell you, there's no problem having a few outliers statistically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.513,
    "end": 3204.578,
    "text": "It doesn't tell you that it's anything to do with those individual people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.678,
    "end": 3205.879,
    "text": "I mean, it might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.011,
    "end": 3230.432,
    "text": " So, conviction narrative theory would explain how people manage to persuade themselves and each other that their active form of investment works, and it would also help to be used to identify",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3231.121,
    "end": 3232.83,
    "text": " the basis of their claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.87,
    "end": 3238.6,
    "text": "But on the whole, I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.082,
    "end": 3259.856,
    "text": " You can understand a great deal of what goes on in the financial markets by deploying the concepts of fantastic object that I mentioned, integrated state and divided state, because in an integrated state, it's very difficult to do investment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3260.257,
    "end": 3261.499,
    "text": "Very difficult indeed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.475,
    "end": 3272.877,
    "text": " for the reason you said in your questions to me, you know, you said, well, obviously having 20 people in the room isn't necessarily help, but you can convince yourself it helps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.897,
    "end": 3279.851,
    "text": "And I can tell you there are some incredibly imaginative people out there who work incredibly hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.911,
    "end": 3282.677,
    "text": "So one person I interviewed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.657,
    "end": 3297.443,
    "text": " He had not only got his team of 20, but he'd assigned them different roles to be for and against things, to do this calculation, to play jokers when they wanted to make a particularly strong point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3297.503,
    "end": 3300.729,
    "text": "And he paid them according to the way they behaved and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.13,
    "end": 3304.075,
    "text": "He worked really hard to try and get it right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.342,
    "end": 3312.9,
    "text": " But it didn't end up, he was convinced, but it didn't end up over the long term being any better than any other way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.103,
    "end": 3316.804,
    "text": " Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.164,
    "end": 3343.579,
    "text": "So even from our Act Dymph post, we've seen some inroads into cognitive economics where people are drawing from the recent developments over the last decades in cognitive science, the pragmatic turn, extended, embedded, enacted, encultured, affective, all of these different features that are increasingly being understood in the context of human cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.559,
    "end": 3372.57,
    "text": " as well as non-human cognition biological or synthetic or otherwise so where where does economics go as it also takes this cognitive turn how have you seen economics play a role from what you've worked on over the decades and then like how would it have been different if there would have been this cognitive turn",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.702,
    "end": 3396.516,
    "text": " earlier or how will it be different going forward as there's more of a engagement with economics and cognitive science so i think so i i think first of all microeconomics uh it microeconomics in in its sort of best light",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.715,
    "end": 3418.2,
    "text": " uh has small models that tell um illuminating stories about the relationships between certain i mean simplest one is supply and demand um and it it tells useful stories however the question is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.222,
    "end": 3446.972,
    "text": " is that model working in any particular situation you're in so even supply and demand you know what if this i mean the model is still true but it may not explain the situation you're trying to deal with and it occurs to me while he was speaking actually one very interesting example so there is a there is a high level academic group that was set up to look at radical uncertainty",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.053,
    "end": 3455.003,
    "text": " which has on it many people much more eminent than me on both sides of the Atlantic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3455.063,
    "end": 3475.93,
    "text": "And on one occasion, a very well-known American behavioral economist presented the work on gambling that you alluded to and gave the group sort of the same test that he'd given to his Harvard economics class earlier that week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.382,
    "end": 3484.134,
    "text": " He was completely astonished when this group of people didn't give the answers that he was expecting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.174,
    "end": 3487.699,
    "text": "And he got out of his very intelligent Harvard graduate class.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.14,
    "end": 3499.757,
    "text": "And the reason was that people said things like, well, if that bet was available, I know the bank wouldn't pay out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3500.75,
    "end": 3518.978,
    "text": " And in other words, they thought round the problem for things like institutional constraints so that they didn't just think of the problem very narrowly framed, whereas obviously the graduate students were being trained to think narrowly, which can be useful, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.958,
    "end": 3545.337,
    "text": " um so i i think where the fundamental issue with economics since i studied it back in the late 60s is that it's become entirely nearly entirely model based there are of course exceptions but the the sort of high prestige of the discipline is in producing a model and if you read the papers they're often like this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.317,
    "end": 3547.54,
    "text": " Let's approach it with a simple model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.86,
    "end": 3551.325,
    "text": "We'll have one person, you know, and they're always simple models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.026,
    "end": 3554.069,
    "text": "They're always lots and lots of assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.73,
    "end": 3564.102,
    "text": "They work very nicely, but it's totally unclear how you apply them to the kind of world that I'm talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.487,
    "end": 3576.78,
    "text": " And meanwhile, what economics doesn't do very much of is actually go out into the real world and actually look at what happens, what people do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3577.16,
    "end": 3583.887,
    "text": "So the study I did of fund managers, you would have thought someone, I mean, I'm an amateur, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.228,
    "end": 3590.494,
    "text": "You would have thought someone in financial economics would have done this a long time before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.474,
    "end": 3618.996,
    "text": " uh but they haven't they they they write lots of papers they do lots of analysis of very large data sets and things like that but they don't actually look and see well how are people how are people doing it so i think one of my hopes would be that it would it's it's not that you don't want models but you need to understand a lot more about the human context in which they're being used and in particular i think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.617,
    "end": 3639.747,
    "text": " you know, typical discussions of behaviour economics, for example, is, you know, you compare rational and irrational behaviour, where rational means entirely model-based, right, which wouldn't necessarily be rational in ordinary terms, and irrational means anything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.348,
    "end": 3646.097,
    "text": "Now, if you can't apply probabilities, the whole model doesn't really start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.177,
    "end": 3646.958,
    "text": "I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.938,
    "end": 3672.507,
    "text": " that this restricts thinking about well how do how does emotion for example enter into decision making and and there's there are a lot of studies in the management literature of what happened to nokia you remember nokia were producing mobile phones and they were producing most of the no-go phones on the planet and then suddenly they weren't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3672.487,
    "end": 3674.451,
    "text": " And this happened pretty quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3674.491,
    "end": 3690.782,
    "text": "And some of the arguments about it concern complex emotional issues in the company where the people who had done very well for Nokia over many years were essentially engineers who built really good kit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3691.117,
    "end": 3714.508,
    "text": " but they didn't understand and hadn't they were neither listening to the market so they weren't like the people trying to sell the things and nor were they software engineers so they hadn't yet understood that actually the hardware doesn't matter much it's the software because you know if you compare many of those old Nokia phones to an Apple I mean the knockers were engineering",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3714.488,
    "end": 3737.644,
    "text": " superior things in many ways but the Apple of course won with all the things it could do so um I I think you can you know you need to there needs to be many more studies of this kind in my opinion yeah what you said there about there being Legacy Prestige in presenting model-based",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.08,
    "end": 3765.96,
    "text": " local decontextualized variability reduced analyses reminds me of ant foraging models where it seems like every single paper can present a simple model of a single context making many explicit and implicit assumptions and then the loop is not always closed by going back out there so i guess my question is how do narrative models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3766.075,
    "end": 3782.582,
    "text": " help us or what else do we need to supplement or complement potentially very sophisticated cognitive narrative modeling because if you point to that phenomena in the setting of matrix-based game theory modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.562,
    "end": 3804.351,
    "text": " and people think that just by constructing that model that it's an open and shut case well now here's a more shiny and feature-laden type of modeling that seems to cut closer to the real crux of the issue with sense making on the inbound and action selection on the outbound so how do we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.17,
    "end": 3833.157,
    "text": " work so that cognitive modeling or narrative modeling doesn't also fall into that trap where people just present a simplified cognitive model and then continue the same kind of epistemic gestalt in how it's deployed so what else is needed beyond the model or what sits beside the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3834.571,
    "end": 3844.785,
    "text": " Well, so I don't know whether this is really a very good answer, but I've never been more than a part-time academic, which is no doubt a bad thing in some ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.426,
    "end": 3857.423,
    "text": "But I think the really fascinating, so, you know, models can at least claim to give you a general truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.926,
    "end": 3863.131,
    "text": " And the problem about general truth is it may not apply to any specific situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3864.112,
    "end": 3866.775,
    "text": "But many people find it elegant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3867.956,
    "end": 3873.222,
    "text": "I actually find real interest in problem solving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.543,
    "end": 3882.111,
    "text": "And particularly when you've got I mean, I think interdisciplinary work is fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3882.563,
    "end": 3888.855,
    "text": " It's not fascinating when you all sit around and each person presents how their discipline does it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.875,
    "end": 3890.879,
    "text": "That tends to get boring after a while.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3891.48,
    "end": 3897.872,
    "text": "But if you've got a problem to solve for someone or a problem,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.852,
    "end": 3905.086,
    "text": " Then you start to really get to grips with what the different people can bring to the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.688,
    "end": 3916.89,
    "text": "You know, and I've been very impressed, for example, working with Lenny Smith and Erica Thompson, who are these weather forecasting mathematician modelers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.87,
    "end": 3941.427,
    "text": " um the way they manage to frame and formulate questions is just fantastic i mean i think models can help you think very clearly about things including thinking where the weaknesses in a particular system are and i think that that's what you could add to the narrative theory is really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3942.655,
    "end": 3962.875,
    "text": " doing research to try and unpick the detail of the narratives people are putting forward and to understand that diagram I put up is a very complex diagram, but actually digging into in any given case, such as the decision to abandon in the UK",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.855,
    "end": 3976.29,
    "text": " um particular railway project or or the decision whether or not to um you know what what we should be doing about heating and insulation over the you know these kind of big questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.422,
    "end": 3989.379,
    "text": " They're bound to be lots of narratives and could you actually look at them very carefully and subject them to the kind of rigorous thinking that you get in this cognitive modeling and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.459,
    "end": 3991.943,
    "text": "That I think is the way forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.323,
    "end": 3996.028,
    "text": "But I think to do that, you have to work actually together on the same problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.449,
    "end": 3997.57,
    "text": "Then you learn from each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4000.486,
    "end": 4028.198,
    "text": " cool and definitely a theme that on one hand doesn't seem to be the formal kernel of active inference yet we see it arising again and again like for pragmatism to blossom there has to be a real problem in a real situation in a real approach and it has to be iterated it's not a spectator sport to work um it's not a spectator sport to be on the field",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4029.089,
    "end": 4032.516,
    "text": " But I think that's a very cool topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.457,
    "end": 4037.044,
    "text": "Well, where do you go from here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.646,
    "end": 4045.1,
    "text": "Like what avenues of research with your with Carl Friston's via negativa endorsement?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.062,
    "end": 4049.308,
    "text": "Where do you see this line of work heading?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.487,
    "end": 4062.804,
    "text": " I think it's got quite a lot of, I mean, obviously there's room in economics, there's also room in what was mentioned about futures and foresight science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4065.727,
    "end": 4069.913,
    "text": "And what I hope is people will use the framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.281,
    "end": 4095.124,
    "text": " to do empirical work i mean i i don't think you can really ever imagine asking the question is conviction narrative theory true or false i mean it it seems to me with most high-level theories of that sort what it it usefully is an orientation onto a problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.425,
    "end": 4099.851,
    "text": " or a set of problems which is very different than standard theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.352,
    "end": 4112.929,
    "text": "It doesn't mean standard theory should be replaced by conviction narrative theory, but it means that the range of questions and research that people might be doing could be considerably broadened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.949,
    "end": 4124.385,
    "text": "I mean, that's not a wonderful answer, but that's basically, I think the other problem is that to do this stuff properly, you need, you know, I've had in my team",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.985,
    "end": 4133.747,
    "text": " two or three psychologists, a computer scientist, a mathematician and a social anthropologist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.288,
    "end": 4138.56,
    "text": "But I've never had enough resources to have them all at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4139.182,
    "end": 4142.546,
    "text": " And that's the problem of interdisciplinary research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.606,
    "end": 4150.035,
    "text": "You actually need a bigger team and then the team has to work together, which is also complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4150.596,
    "end": 4164.193,
    "text": "So I would say that's another very important implication that it's too easy at the moment to work in a dugout or in a silo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4167.599,
    "end": 4197.606,
    "text": " you said there about conviction narrative theory it can't be simply validated or invalidated by empirical evidence it's a lot like active inference active inference isn't waiting to be established or disestablished based upon a measurement from a real system however you described conviction narrative theory as an orienting tool we could even think about that in terms of the ooda loop like observe orient okay we observe the publication we've oriented to it we've updated our cognitive model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4197.586,
    "end": 4223.745,
    "text": " and now the decision and the action are where the specifics come into play because someone could deploy narrative conviction and then say that this entity has this conviction and that may be empirically true or false and so it's like all of the validation or invalidation is in the realization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.13,
    "end": 4253.513,
    "text": " but the concept is something that kind of sits before the realization and so that when when it is properly understood and respected for being theoretical then it can be like this fountain of real testable pragmatic hypotheses real value being layered over other results and models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4254.708,
    "end": 4260.655,
    "text": " yet not an account or an explanation in any specific setting by itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.236,
    "end": 4277.896,
    "text": "But it's something that lets us jump off of that orienting platform into all these settings that we've just discussed, ranging from the pure financial investing, which most people are not going to directly involve in, to the transport policy and climate issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.976,
    "end": 4280.479,
    "text": "So it has a real...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.64,
    "end": 4294.637,
    "text": " scope and it's really cool just to even hear a little bit about how it's developed over the years and during a time of uh at ucl and beyond development of the cognitive sciences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.41,
    "end": 4322.312,
    "text": " mean there's one other obvious application which may concern all of us is to research policy research applications and how how research funding is done um because i think it can be applied you know because basically as as we all know and if you're giving out the money you're the one giving out the money you've got to develop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.17,
    "end": 4340.2,
    "text": " a conviction narrative that giving money to x is going to do y is going to achieve whatever you're trying to achieve right and at the same time you can see that what x is doing is trying to develop a conviction narrative to persuade you right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.315,
    "end": 4350.168,
    "text": " Now, one of the things about many funding councils at the moment is that they typically talk about doing innovative work, high risk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.488,
    "end": 4354.193,
    "text": "You know, the various phrases, high risk, innovation, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4354.834,
    "end": 4361.783,
    "text": "And then what they basically do is give the money to people who look reliable with a good track record.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4362.32,
    "end": 4371.933,
    "text": " which are probably contradictions in a contradictory activity, which isn't to say you shouldn't give money to the usual people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.973,
    "end": 4374.356,
    "text": "But there's clearly a problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.456,
    "end": 4379.062,
    "text": "I mean, for example, on the book, I put my side up minding the markets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4379.803,
    "end": 4386.252,
    "text": "You'll see that it was very that George Akerlof was a Nobel Prize winning economist, was kind enough to endorse it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.713,
    "end": 4388.395,
    "text": "And when I was talking with him,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4389.455,
    "end": 4395.662,
    "text": " He said that his Nobel paper had been turned down by three journals, I think it was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.183,
    "end": 4404.092,
    "text": "And when he got to the dinner for the Nobel laureates, there were three or four others at the table who'd all had the same experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.112,
    "end": 4408.296,
    "text": "So, of course, there are lots of bad ideas that don't get funded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.877,
    "end": 4415.985,
    "text": "But the issue of how people develop conviction, which is really how do they manage doubt?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.59,
    "end": 4436.809,
    "text": " and doubt and possibly the possibility your reputation will you know if you if you give money to some incompetent group or waste it all right that your reputation will suffer and we know if you go to white or if you go to the government people are terribly worried about failing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4436.907,
    "end": 4447.43,
    "text": " And one of the things I hope conviction narrative theory will do is to help people to see that if you want to succeed, you've actually got to fail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4447.47,
    "end": 4453.262,
    "text": "If you're always succeeding, you can't be trying hard enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4456.06,
    "end": 4481.798,
    "text": " i really like this research funding or resource allocation setting there's like these nested conviction narratives like at the largest scale like we believe that funding basic research or fundamental research or translational research is going to be beneficial along these ways it's like we're convinced of that and we're gonna we're we're huddling on that and then at the program level we have a suspicion that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.778,
    "end": 4501.913,
    "text": " this or that aspect of this phenomena is something that the program manager is going to get behind and that the resources are all aligned and then like in the review itself we might as well directly ask like to the proposer what are you convinced of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.062,
    "end": 4527.613,
    "text": " and then not like just what are the risks or uncertainty or what makes you avoidance but like what are you convicted of that makes you charge into that uncertainty and super excited to carry out the research and we want to hear about the fuzziness and uncertainty because we don't even know simple things until after the fact so we don't expect you to have the whole plan but at the same time it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4527.593,
    "end": 4551.12,
    "text": " we do need to know that your team and context is convinced so that you'll continue the approach as uncertainty occurs rather than up front so much consideration of the uncertainty that you might never begin and then that sets up a narrative where even small",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.1,
    "end": 4578.61,
    "text": " experimental perturbations which might be on the path to transformative research that those have a negative valence rather than like an almost motivational valence and and that's just like that's one example that could come into play in funding allocation immediately yeah i think i think there's a lot of you know that's a very practical area where it can be really thought about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.796,
    "end": 4583.298,
    "text": " Do you have any final comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.239,
    "end": 4596.836,
    "text": "No, it's been nice talking to you and I do find Active Inference very interesting and it's at a feeling level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.876,
    "end": 4598.418,
    "text": "It feels right to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4602.784,
    "end": 4608.732,
    "text": "We may even use conviction narrative in the Active Inference education setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.64,
    "end": 4617.237,
    "text": " That's like, you could do a hundred PhDs in thermodynamics and you still wouldn't have some bar of gold waiting for you at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.277,
    "end": 4619.482,
    "text": "That's like, oh, now I understand equation 2.6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4619.522,
    "end": 4626.337,
    "text": "So what is it then that keeps us adding those layers of paint in our learning journey?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.357,
    "end": 4629.083,
    "text": "I think it's an excellent question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4630.109,
    "end": 4631.511,
    "text": " thought and approach and sentiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.353,
    "end": 4639.745,
    "text": "And also if you provide the slides, there are requests in the chat, then I can post them alongside the video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.066,
    "end": 4641.949,
    "text": "So thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.931,
    "end": 4644.013,
    "text": "Thank you very much, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4644.253,
    "end": 4644.934,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4646.156,
    "end": 4646.657,
    "text": "See you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.278,
    "end": 4647.679,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]