[
  {
    "start": 7.709,
    "end": 8.089,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.35,
    "end": 9.07,
    "text": "Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.871,
    "end": 15.917,
    "text": "It is February 5th, 2025, and we're in MathArt Stream 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.279,
    "end": 19.12,
    "text": "Feedback welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.141,
    "end": 23.925,
    "text": "So, Octopus, if you'd like to say hello, please begin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.965,
    "end": 28.309,
    "text": "Otherwise, we'll pick up where we were just seconds ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.951,
    "end": 31.432,
    "text": "Yeah, I'd like to say hello.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.573,
    "end": 32.393,
    "text": "So I'm Octopus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.574,
    "end": 33.474,
    "text": "Some of you may know me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.315,
    "end": 37.058,
    "text": "I'm a mathematician, security researcher,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.645,
    "end": 43.056,
    "text": " and Chaos Magician, my different titles and roles that I play at different times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.058,
    "end": 50.791,
    "text": "And I've collaborated with Daniel and with Active Inference Institute in the past, excited to do so again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.851,
    "end": 59.468,
    "text": "To give you an idea of what we're going for, this is my current setup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.983,
    "end": 65.107,
    "text": " I have, I'm on two different accounts in Zoom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.148,
    "end": 70.632,
    "text": "I have two cameras here, two web cameras plus the internal camera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.353,
    "end": 73.815,
    "text": "So two accounts, four cameras.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.636,
    "end": 77.379,
    "text": "I have two screens that are behind each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.539,
    "end": 80.161,
    "text": "One is a television screen and one is a laptop screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.002,
    "end": 85.546,
    "text": "And I have a mirror behind me that may or may not be able to be used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 86.407,
    "end": 88.189,
    "text": "So I don't have any,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.372,
    "end": 93.578,
    "text": " preconceived patterns of how we use these things, but I just think it'd be fun to play with different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.74,
    "end": 96.04,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.802,
    "end": 113.839,
    "text": "We have a few tools, few links ready, got some slides, some active inference, possible visualizations, and some really interesting work that you're involved in with multi-agent modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.819,
    "end": 121.37,
    "text": " Also, there is the YouTube live chat operator panel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.332,
    "end": 129.102,
    "text": "So the live chat, and I'm continuing to rearrange the windows, but I won't always be shared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.502,
    "end": 133.228,
    "text": "I'll just be reorganizing the windows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.208,
    "end": 158.102,
    "text": " bringing obs on which can kind of always yield this terminating static feedback loop infinite static and also the live chat where i hope we will have a interesting feedback welcome so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.437,
    "end": 177.154,
    "text": " with that uh and i'm going to be continuing to get the views and everything so bear with us we were paused and began on this idea of feedback and delayed re-entry and with a question about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.433,
    "end": 184.139,
    "text": " where and why and how is audio feedback different than visual feedback?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.159,
    "end": 185.88,
    "text": "So maybe where does that take you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.92,
    "end": 189.564,
    "text": "And I'll put up what I can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.065,
    "end": 194.028,
    "text": "Yeah, so a couple of things that brings up for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.349,
    "end": 199.734,
    "text": "One is that I've done those experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.274,
    "end": 202.296,
    "text": "I've done those experiments since.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.797,
    "end": 207.141,
    "text": "And right now I'm doing that experiment because I'm hearing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.543,
    "end": 210.787,
    "text": " audio feedback from the phone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 212.329,
    "end": 216.454,
    "text": "But it's it is extremely disorienting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.474,
    "end": 228.148,
    "text": "So if you see the video feedback, you can probably hear the audio feedback from my phone as I'm hearing the echo on myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.869,
    "end": 229.77,
    "text": "And I find it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.155,
    "end": 259.217,
    "text": " very very difficult like like i couldn't can i could not produce a coherent stream of thought in this type of environment i don't feel my only strategy right now uh is to delay so there's a chance for the feedback to die out um and i'm not doing it directly in my ear which i think would also greatly uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.699,
    "end": 287.652,
    "text": " The strategy that I found that I can use sometimes and have used in the past when I did similar experience was to speak very slowly so that it almost sounded like the feedback I was receiving was occurring at a clearer delay from the signal that I was generating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.222,
    "end": 293.972,
    "text": " So when I speak very slowly like this, I don't find it as disorienting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.853,
    "end": 307.795,
    "text": "And in fact, I tried to record a song this way back when I was recording music as something I was pursuing, and I found that it produced something of a very interesting effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.917,
    "end": 314.466,
    "text": "The other thing that I found helpful was to intentionally adjust my timbre.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.581,
    "end": 341.787,
    "text": " so that the body resonance gave me a different kind of signal beyond what i was hearing on the audio itself but i agree with you that it is extremely disorienting however i've i've heard some different perspectives on that and one of the perspectives is that if you're playing an instrument it's actually a very intriguing experiment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 341.851,
    "end": 356.997,
    "text": " to hook a synthesizer up to an audio output and to put it through a delay so that you're hearing something different than what you're playing at that moment is not what you're hearing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 357.277,
    "end": 359.281,
    "text": "You're hearing what you played a few seconds ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.301,
    "end": 367.555,
    "text": "And people who do this often find, based on what I remember being told, I need to find sources for this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.294,
    "end": 375.3,
    "text": " But that can feel very natural and freeing because it lets you out, like it lets the critic out of your feedback loop of your playing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 376.702,
    "end": 397.44,
    "text": "So I think that the experience of time and the fact that I wonder if it's connected to the fact that audio hallucinations are so common because it feels to me like there is a hallucinatory effect that we're having to fight through and we're having to fight through like our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.825,
    "end": 405.714,
    "text": " our cognitive systems interest in, in not being fooled by hallucinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 416.106,
    "end": 427.258,
    "text": "So visual feedback is kind of more interesting, but it doesn't some, I don't think I'm visually generating in the same way that I am",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.09,
    "end": 431.953,
    "text": " auditorily generating when I'm speaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.615,
    "end": 443.009,
    "text": "So when I have the visual aspect of this, like I'm not physically producing the visual directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.369,
    "end": 444.13,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.594,
    "end": 460.013,
    "text": "So that feels different to me because with the audio feedback, I'm speaking and I'm hearing basically through the same sort of circuitry, like they're very close physically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.988,
    "end": 470.222,
    "text": " And so the belief that I'm hearing voices that aren't mine is a little disorienting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.023,
    "end": 475.21,
    "text": "But visually, when I see visual feedback, I know there's something artificial about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.532,
    "end": 478.875,
    "text": "And again, I'm not speaking as a neuroscientist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.915,
    "end": 488.43,
    "text": "Let's not say I'm an expert in any of this, but I don't have any... I guess I'm experienced enough as a psychonaut to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.997,
    "end": 496.684,
    "text": " have some experience and to have some read some things about it from a non-scientific, more experiential perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 499.787,
    "end": 506.054,
    "text": "One of the first things we look for in signs of insanity is the idea that the person is hearing voices, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.675,
    "end": 518.367,
    "text": "So I also think there's a civilizational aspect of it where if you're hearing voices as something you were taught not to do,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.802,
    "end": 525.533,
    "text": " where you know that there's the potential feedback of social judgment and that that can have negative consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.695,
    "end": 545.805,
    "text": "I don't know if that's connected at all to the physiological and neurological aspects of the experience, but it's another kind of interesting perspective to consider because I think ultimately what feedback is giving us is a different perspective on an experience that we've recently had",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.865,
    "end": 553.375,
    "text": " So it's not disorienting if we're hearing a tape of our own speech, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.475,
    "end": 560.766,
    "text": "If you put on a recording of me saying this and I had to talk over it, I would not find that difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 561.787,
    "end": 573.885,
    "text": "So I think it has to be about the actual physiological aspect of the circuitry involved and something about the time delay and distortion aspect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.835,
    "end": 584.872,
    "text": " This can be used for, for instance, electronic music production.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.635,
    "end": 597.578,
    "text": "There are algorithms that intentionally create these feedback loops for synthesizing the sounds of stringed instruments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.638,
    "end": 610.067,
    "text": " I learned about this, I think, in Julia Smith's book on signals and filters, because this is like feedback loops are useful in design of filters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.391,
    "end": 614.318,
    "text": "I think it's called the Strong Carp Luce algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.783,
    "end": 643.63,
    "text": " and k-a-r-p-l-u-s and the whole point is that to to make a an excited sound like a violin that string is being excited or a string that's being plucked um you give it a very brief initial signal and then use a delay line to let the feedback create this emphasized sound",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.234,
    "end": 658.252,
    "text": " So I think that audio feedback is also different when it's not, when there's not such a strong semantic or semiotic aspect to it, where we're not trying to make sense of what we're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.333,
    "end": 662.017,
    "text": "If I were to, here's an interesting experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.798,
    "end": 670.748,
    "text": "I will speak nonsense syllables and see if I find it difficult to generate those extemporaneously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.04,
    "end": 681.671,
    "text": " So I didn't feel anything difficult about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.791,
    "end": 687.558,
    "text": "And it could be open label placebo where I didn't, you know, it's self-fulfilling prophecy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.339,
    "end": 695.989,
    "text": "But that makes me wonder if the difficulty and the disorientation comes from the fact that typically we're working with words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.73,
    "end": 702.237,
    "text": "And so there's a meaning aspect there, expecting it to mean something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.853,
    "end": 708.794,
    "text": " What do you think, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.195,
    "end": 710.257,
    "text": "I welcome your feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.483,
    "end": 715.685,
    "text": "Yeah, thank you, Octopus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.705,
    "end": 737.337,
    "text": "Well, you began with this directly empirically verifiable and also I'm sure many neuroscience papers on which kinds of feedback reentry for audio stymie natural speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.493,
    "end": 743.479,
    "text": " And then you talked about different ways to change the rhythm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.34,
    "end": 748.566,
    "text": "And that's kind of like a different feedback producing setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.467,
    "end": 765.13,
    "text": "So visually like having this with the OBS, but because Zoom with its special above OBS even, so here even what, but if Zoom weren't, if we're in a different screen share mode,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.228,
    "end": 794.205,
    "text": " then or if i pull the zoom off to the other screen then there's the fixed so here with the frame rate and then with obs with the video settings i don't think the frame rate can be changed during the stream yeah but a lot of configurable video settings and then this kind of comes to those those uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.206,
    "end": 825.762,
    "text": " different kinds of feedback just to even set some of the uh possible types that are really important for the generalized cybernetics that I'm sure will be interesting to hear about and you can share your screen too we have different sensory interfaces visual and audio everything is through time in that sense OBS too and but again that that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.851,
    "end": 851.023,
    "text": " way in which the visual interface possibly feeling at a distance compared with sound which is kind of an ongoing probably more proximate event and just the controllability of the visual and the putting it in a box on our computers uh and then that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 852.691,
    "end": 874.193,
    "text": " opens up this well there's a live chat so if we're thinking about feedback we want a generic definition of feedback agent thing all these different research directions on generalized dynamical systems generalized cybernetics all these kinds of things how do we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.877,
    "end": 889.396,
    "text": " scope and survey and layout, where are we dealing with a 200 millisecond speech delay with the audio and then sound and noise?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.917,
    "end": 905.158,
    "text": "How do we reconcile that gripping and symbolic nature of both audio and visual as to available streams?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.282,
    "end": 926.772,
    "text": " but not exhausting this bigger research question of generalized feedback systems and a ton of practicalities about feedback and reentrant loops in any kind of offline or purely online system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.216,
    "end": 933.222,
    "text": "So I'd like to propose an angle here that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.315,
    "end": 956.555,
    "text": " probably not what might traditionally be expected, but I think is very relevant, especially for like management cybernetics and for learning, which is the construction of grades in a pedagogical setting, specifically the construction of student work that has been given instructor feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.097,
    "end": 963.141,
    "text": "And this is something that I have experience with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 963.593,
    "end": 973.768,
    "text": " And I think it might be a good jumping off point for discussion of other types of feedback systems, because it doesn't presuppose any knowledge of engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.151,
    "end": 980.517,
    "text": "And I thought you were going to just copy paste the same thing down the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.798,
    "end": 985.264,
    "text": "Oh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.577,
    "end": 1004.101,
    "text": " So this is actually something that undid me in teaching on Zoom is I got way too much into the specifics of rectangles and the idea that you can make all these different rectangles appear on the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.222,
    "end": 1014.795,
    "text": "But the grading aspect of this is really important because there's this interactive process at some time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.568,
    "end": 1033.37,
    "text": " One of the things I learned when I was teaching calculus was students were understandably concerned about their grades, but if I gave any type of automatic feedback system to reduce work for myself, that could create an emotional feedback loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.39,
    "end": 1043.702,
    "text": "So the example here is something like WebWork, where you can go in and the instructor can assign questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.767,
    "end": 1047.292,
    "text": " as a homework set, and there are many other systems that do the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.094,
    "end": 1059.411,
    "text": "But then, you know, the student types in their answer and gets immediate correct or incorrect feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.715,
    "end": 1071.85,
    "text": "Well, this could produce a feedback loop where a distressed student on a short timeframe keeps getting back the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.707,
    "end": 1076.652,
    "text": " And as they type in the answer and get it wrong, they become more and more frustrated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.894,
    "end": 1087.165,
    "text": "As they become more and more frustrated, their capacity for rational thought decreases, and a sense of desperation kicks in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1088.607,
    "end": 1098.9,
    "text": "As the sense of desperation increases, and they're worse at doing math in this frame of mind, they now are more likely to get the answer incorrect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.285,
    "end": 1107.895,
    "text": " And now suddenly, without any limit on the number of attempts, they can just go forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.915,
    "end": 1115.984,
    "text": "And it can actually be a very negative emotional spiral to get kind of trapped in a question close to midnight where you've waited a while.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.466,
    "end": 1126.356,
    "text": "And so that's the type of spiral feedback loop of reinforcing negative emotion, less capable logical thought,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.758,
    "end": 1153.153,
    "text": " incorrect answer negative feedback in terms of you did not get this correct was one of the first feedback loops that i think i really understood and needed to take action in some way to to stop essentially because i did not want to create a classroom where all the students had been up late the night before so the different instructors have different strategies for this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1153.201,
    "end": 1181.115,
    "text": " one is you can be available whatever you choose to make the deadline close to so for instance you could um you know you don't go to bed till late if you admit if the deadline is midnight or you set the deadline at 2pm when you're going to be around to give last minute help or you set the number of attempts you don't let students have unlimited attempts",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.382,
    "end": 1188.91,
    "text": " or you create like a practice set that has unlimited attempts and then a graded set that has three attempts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.871,
    "end": 1196.678,
    "text": "Because the other type of feedback is that students can just begin to engage in rampant guess and check.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.698,
    "end": 1199.221,
    "text": "And you don't really want that either, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.241,
    "end": 1210.393,
    "text": "That they just start typing in one, two, three, four, five, six, start guessing numbers and taking advantage of the unlimited attempts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.259,
    "end": 1229.283,
    "text": " And then the third type of feedback is to introduce another participant, which students would often do, which is to just take the question to Wolfram Alpha or ChatGPT, which is likely to give them the correct answer if they become skilled at that process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.064,
    "end": 1239.999,
    "text": "But then at that point, the calculus class just becomes about translation, the student's skill at translating between two artificial intelligences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.961,
    "end": 1242.523,
    "text": "And while that might be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.976,
    "end": 1258.478,
    "text": " a direction that humans need to go, that's not where you want the primary rewards in calculus class to be, that the best grades are those who have given the most thought to how to get Wolfram Alpha to answer WebWorks questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.639,
    "end": 1264.807,
    "text": "And it doesn't, the precise computational engines here are not too important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.827,
    "end": 1268.713,
    "text": "It's more about how do you create a system where the rewards come from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.875,
    "end": 1274.381,
    "text": " the activity that you're actually hoping to reward and are not easily gameable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.411,
    "end": 1294.65,
    "text": "And so what's needed is some type of control, something that prevents the infinite feedback loop from happening, something that stops it, something that lessens some part of the amplification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.305,
    "end": 1300.647,
    "text": " I see there's something here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1308.181,
    "end": 1310.265,
    "text": "So true about feedback and education.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.345,
    "end": 1313.651,
    "text": "We can really influence approaches to studying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.843,
    "end": 1321.965,
    "text": "Bring it in a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.248,
    "end": 1323.388,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.748,
    "end": 1348.532,
    "text": " going into the browser bar make it plain text make it into a string reward shaping yeah a lot to say about the landscape of epistemic and pragmatic value in terms of how we think about that in active inference and expected free energy and then where is there a stepwise change in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.512,
    "end": 1355.242,
    "text": " epistemic and or pragmatic value, like a well opening in the middle of a flat plane?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.882,
    "end": 1368.701,
    "text": "And then where is their so-called dense reward function with a broad basin of attraction and a lot of learnable targets, not just rugged stabs in the dark?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.522,
    "end": 1372.987,
    "text": "And so that's part of this broader motivation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.187,
    "end": 1378.114,
    "text": "Take the challenging approximation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.094,
    "end": 1386.008,
    "text": " and relate it to a tractable, incrementally optimizable procedure or operation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.33,
    "end": 1388.552,
    "text": "What do you think about that first part?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.046,
    "end": 1398.209,
    "text": "Sorry, can you say it again?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.229,
    "end": 1399.191,
    "text": "I didn't capture all of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.892,
    "end": 1406.12,
    "text": " Like there's some statistical landscapes where the ball rolls downhill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.401,
    "end": 1417.298,
    "text": "Convex optimization, star anywhere and following the local gradient is going to be maximally efficacious to find a global optima.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.278,
    "end": 1440.349,
    "text": " then contrast that with kind of the other extreme setting high dimensional flatness no local gradient or signposting and then just there's one point but even chaotically close to it you could end up infinitely far away which is a desired property for a cryptographic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.683,
    "end": 1454.085,
    "text": " algorithms where you want like the next nonce or next piece of salt to take you to undetectable place in a space and then we have this optimization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.449,
    "end": 1468.903,
    "text": " characteristic with the gradients and the way that local free energy or statistical learning or loss function, reward learning or more energy based, that local optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.963,
    "end": 1472.747,
    "text": "And it's like, as cool and interesting and we can go into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.907,
    "end": 1477.572,
    "text": "It's a practical question when doing machine learning and statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.196,
    "end": 1485.0,
    "text": "So there are actually two questions there, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.824,
    "end": 1500.758,
    "text": " Um, the first is thinking about the fitness landscape and where agents will find rewards, but kind of in physical systems, there's in physical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.28,
    "end": 1505.043,
    "text": "We don't like an engineering physical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.284,
    "end": 1513.671,
    "text": "There isn't initially, at least I don't think it's important to think about the danger of simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.95,
    "end": 1531.474,
    "text": " So if you have a signal that you want to control, you want to filter out part of it, the component is not active and can't try to fool you into setting parameter settings that will then make it so that it can let the undesired signal through later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.556,
    "end": 1544.113,
    "text": "Whereas if you're dealing with active agents like college students or potentially AI agents or humans interacting with AI systems, we do have the ability to think through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.735,
    "end": 1557.107,
    "text": " how simulating something initially might lead to a response, which then the response itself can be exploited like a trap, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1558.269,
    "end": 1560.871,
    "text": "So physics doesn't set traps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.632,
    "end": 1566.517,
    "text": "At least simple physical signals like a sine wave isn't going to set a trap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.577,
    "end": 1572.403,
    "text": "It doesn't have that type of cognition or strategic thinking, but a college student does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.483,
    "end": 1574.725,
    "text": "A college student can optimize for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.975,
    "end": 1584.949,
    "text": " If what really matters is the grade and not the learning, how can I optimize the grade with minimal learning with the understanding that then there's a snowball effect?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.69,
    "end": 1592.48,
    "text": "Getting an A in this class increases my social status among the gossip network of the faculty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.5,
    "end": 1600.07,
    "text": "It will improve my GPA, which is like a terminal metric essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.11,
    "end": 1604.256,
    "text": "And the fitness landscape for learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.692,
    "end": 1615.984,
    "text": " is also made difficult by the fact that the epistemic feedback of how do I know that you know what I want you to know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.809,
    "end": 1626.074,
    "text": "Already there's a feedback loop that I have to kind of, I don't know, it made me crazy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.255,
    "end": 1629.758,
    "text": "So I stepped out of doing it for a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.778,
    "end": 1634.243,
    "text": "But still the thoughts I think are valuable and they're like these patterns that we could look for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.311,
    "end": 1658.847,
    "text": " yeah two thoughts on that one this is a inverted image color on a usually white pdf however it's showing this particular kinds path intervals particular kinds and strange things strange furry things like needing to accept cookies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.827,
    "end": 1679.383,
    "text": " um and it coming up in the textbook group which you did awesome and and fun math work for and that question of from sine wave or or just like y equals two the it's a number it's also a function through time for all time steps do two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.363,
    "end": 1699.296,
    "text": " so those sorts of pedagogical where the essences and the patterns can sometimes be distilled and fractionated on through more sophisticated strange cognitive modeling and all that entails",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.592,
    "end": 1711.139,
    "text": " And then also the... I think it's an apocryphal story, but some... Okay, so we're going to play a game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.799,
    "end": 1716.004,
    "text": "Everybody's going to send a letter to the editor picking a number between 0 and 100.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.005,
    "end": 1724.512,
    "text": "And then you want to guess the number that's two-thirds of the average of all other people's choices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.493,
    "end": 1727.936,
    "text": "So it's like, if everybody picks 100, I could take 67.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.596,
    "end": 1731.479,
    "text": "But then people will definitely take 67 then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.88,
    "end": 1734.042,
    "text": "So then I'll guess...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.224,
    "end": 1760.839,
    "text": " 43 and then oh everyone's going to do that though so then where do people bottom out even in that very reduced setting with would people really pick like point zero zero zero zero zero two and then if they would really do that why wouldn't i also go lower and then some people pick like 17 or you know they pick some finite number",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.135,
    "end": 1789.442,
    "text": " even though the the game theory kind of open-ended simplified game theory might have these mathematical properties like convergence of sampling performance on a test or a given training data set all these different features but just because they're one way then the causal structure of the worlds could change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.49,
    "end": 1803.803,
    "text": " And that could be even better anticipated by the causal model of the agent, or could just absolutely flip the signal orthogonally and just reduce the efficacy of that model low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.533,
    "end": 1809.197,
    "text": " I like the simplicity of that game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.237,
    "end": 1822.938,
    "text": "I think that's one of the difficulties in these types of very complex systems is if all you can study is something with overwhelming intricacy and complexity, then you basically have no hope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1823.358,
    "end": 1826.022,
    "text": "You need something to stay stable or repeatable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.965,
    "end": 1832.592,
    "text": "And of course, there is the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.736,
    "end": 1856.942,
    "text": " idea that in psychology people who are aware of certain research effects become immune to the impact of that effect like if you tell people the expected outcome of an experiment they may take that information and they may take that information and then be immune to the experiment essentially because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.53,
    "end": 1870.324,
    "text": " They know that they're not supposed to become prison guards or they're horrified at the thought that people could become, uh, you know, induced by authority to engage in sadistic behavior against a stranger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.384,
    "end": 1881.476,
    "text": "So that's another thing is there's this metagame aspect of playing a game, but you see how other people have played the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.617,
    "end": 1884.499,
    "text": "The game itself evolves over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1885.745,
    "end": 1889.91,
    "text": " often in a co-evolutionary way or a cyclic evolutionary way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.632,
    "end": 1894.615,
    "text": "You see this in professional football, the National Football League.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.697,
    "end": 1903.506,
    "text": "There was a movement towards throwing the ball more with lighter, faster players and being more mobile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.507,
    "end": 1911.195,
    "text": "So defenses adjusted for that and made their players also lighter and faster and more mobile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.407,
    "end": 1929.864,
    "text": " Well, now the counter evolution on offense is to go back to heavier, stronger players and force the ball over these lighter, stronger defenders with a run action rather than because as they have evolved, they have evolved to a weak state, which you can then swing back and exploit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1933.968,
    "end": 1939.613,
    "text": "As we see the game repeatedly played, we learn something about how to play it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.656,
    "end": 1955.475,
    "text": " What we learn about how to play it may or may not ultimately make us better players, or it may just become another level of the game where signaling a specific strategy can be part of the strategy itself, which may not be the actual strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.125,
    "end": 1986.222,
    "text": " this is the first figure from the 2022 academic textbook and we could even unpack why an arrow is graphically how it is and chase that however the action perception interface question is often called a loop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.362,
    "end": 2011.129,
    "text": " And certainly from a program perspective, like a Turing tape perspective, not that that's everything, but from a procedural engineer's perspective, there can be like two ongoing processes, but on a single thread, it gets bottlenecked to like something happening procedurally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.251,
    "end": 2016.816,
    "text": "And so it's so interesting how the instantaneous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.028,
    "end": 2041.993,
    "text": " nature of the organism environment interface like there's no feedback from that this patch of skin to to that patch of skin a month later but yet a model making a measurement from that location might be able to have an arrow and a number",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.29,
    "end": 2072.706,
    "text": " that we call feedback from the math perspective like this kind of causal gravity that flows around the horn and and it has a kind of statistical force and we call it a feedback loop like others there's a feedback loop between the the supply and the demand or the lack of Volterra ecology models those are also called feedback cycles but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.137,
    "end": 2078.349,
    "text": " They're instantaneous all along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.369,
    "end": 2088.096,
    "text": "They don't necessarily see 11 time steps ago with an arrow influencing them in the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.438,
    "end": 2096.086,
    "text": " And outside of time weaving and looping and all that, it doesn't even necessarily happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.126,
    "end": 2099.071,
    "text": "That's kind of the Markovian property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.812,
    "end": 2102.656,
    "text": "Like past only influences the future through the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.938,
    "end": 2113.031,
    "text": "But if everything's passed through the constraint of the present, then it's like, huh, that is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.171,
    "end": 2114.573,
    "text": "There are these feedback loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.181,
    "end": 2146.838,
    "text": " it's also true that an objectively incorrect belief about the world can be advantageous as a strategic choice this is basically hyperstition this is also why you know historical the constant renegotiation of history is really powerful because we kind of step into this world that has this history of how the game was played",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.797,
    "end": 2151.842,
    "text": " And part of our strategy for the game is based on the outcome of previous games.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.084,
    "end": 2168.505,
    "text": "So when we come to some dispute about how games were played in the past and what the outcome was and the interpretation of that, it has a powerful influence on how we currently play the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2171.303,
    "end": 2181.6,
    "text": " Could you share a bit about this series and where is it fitting in today with your broader research in this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.86,
    "end": 2187.489,
    "text": "And what is this sequence of workshops get at specifically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.533,
    "end": 2189.873,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.913,
    "end": 2196.484,
    "text": "And after we do that, we wound up in a very kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.839,
    "end": 2227.585,
    "text": " sober focused and intellectual place which i'm happy to be in um but after we do the the discussion of that research i was wondering if we could go back to uh focused and free exploration of the actual patterns as they exist i'm not making an explicit deal but i'm just kind of setting for myself on uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.573,
    "end": 2255.597,
    "text": " what we can pre-feedback yeah free feedback hyperstition the planning planning is a type of feedback right because then if we plan we now have something to have feedback about over behind schedule for instance I mean the schedule was arbitrary and made with no cognition behind it but still we now have a schedule which is telling us where we were supposed to be so now we can uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.999,
    "end": 2283.323,
    "text": " the setting of expectations is a form of feedback it's the past belief about where you should be now and then that can be actually be very powerful in the form of but yeah i'm happy to talk about this research and um so this is a series that i did working with block science uh originally i was working off of some notes written by dr michael zargon the ceo and senior engineer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.893,
    "end": 2294.774,
    "text": " at Block Science on this idea of research he had done into a type of dynamical system called generalized dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.896,
    "end": 2305.615,
    "text": "And essentially dynamical systems usually are advanced by the application of a single specific rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.017,
    "end": 2321.057,
    "text": " So for instance, the logistic map where you just take x sub n plus one and it's equal to alpha times x sub n times one minus x sub n all in parentheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.519,
    "end": 2325.043,
    "text": "They advanced by a singular rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.323,
    "end": 2335.737,
    "text": "Whereas in generalized dynamical systems, these were created initially with the idea that you were dealing with systems where there would be some type of switch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.307,
    "end": 2339.751,
    "text": " or some type of input at a given point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.532,
    "end": 2349.663,
    "text": "And so you needed a way where not only were you applying a single rule, but you were actually responding to actions that were taken within the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.124,
    "end": 2360.216,
    "text": "And naturally that sort of branches out into the idea that there need to be agents that the system now has components that have agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.636,
    "end": 2366.263,
    "text": "So it's moving from a purely deterministic dynamical system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.463,
    "end": 2378.953,
    "text": " where the components proceed according to a completely pre-described mechanism and moving towards a system where the components have agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.052,
    "end": 2383.92,
    "text": " And that naturally acts, that naturally intersects with the idea of agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.14,
    "end": 2398.843,
    "text": "So agents are, you know, multi-agent systems are a very vast area of research that are especially important in economics and biology and other places, any type of social system where agents interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.644,
    "end": 2403.791,
    "text": "I came to them via cellular automata.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.811,
    "end": 2407.236,
    "text": "But again, the agents there are cells who are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.334,
    "end": 2411.821,
    "text": " engaged in behavior that's mechanistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.941,
    "end": 2416.909,
    "text": "The cells in a cellular automaton don't have individual choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.949,
    "end": 2420.475,
    "text": "They follow the same rule, and yet you still see emergent behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.515,
    "end": 2434.337,
    "text": "So when you add in agency and the type of feedback loops that are emphasized in active inference, now you're going to see the possibility of different types of emergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.587,
    "end": 2438.456,
    "text": " based on the choices that the agents make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.339,
    "end": 2451.448,
    "text": "And so there's a computational tool called CAD-CAD or computer aided design of complex adaptive dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.985,
    "end": 2461.115,
    "text": " which is working with the CAD framework from engineering where you're using computer-aided design to work with mechanical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.036,
    "end": 2472.929,
    "text": "But now you're using computer-aided design to look at complex systems according to a well-defined syntax that lets you define what happens at different stages of an interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2474.951,
    "end": 2480.237,
    "text": "And this connects to a type of economic model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.369,
    "end": 2505.972,
    "text": " called multi-agent influence diagrams which are a type of causal inference structure in economics that were introduced by color and milch and all three of these there are maps between these things i think of these as a mathematician sometimes i think in terms of category theory or categories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.627,
    "end": 2525.547,
    "text": " For me, it was like there are obvious morphisms between these categories that they're not three distinct things that are just because it's not too hard to translate between the three different realizations of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.568,
    "end": 2530.812,
    "text": "And so I was exploring that and playing with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.568,
    "end": 2533.891,
    "text": " It improved my understanding of CADCAD a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.051,
    "end": 2544.485,
    "text": "I appreciated the elegance of CADCAD a lot more as a tool after kind of translating it into terms that my brain was more comfortable with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.406,
    "end": 2548.01,
    "text": "But yeah, it's a good series of workshops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.09,
    "end": 2556.581,
    "text": "I enjoyed doing it and I don't think I'm happy to get feedback on from people and engage in conversations with people about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.801,
    "end": 2558.824,
    "text": "I think the most interesting thing for me",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.12,
    "end": 2567.713,
    "text": " is that as soon as we now have structure, we can gain understanding through that structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.733,
    "end": 2585.284,
    "text": "So the point of introducing this notation is not to just look more formal, but if we have something and we say, oh, this is a directed graph, this is a labeled directed graph, like Dr. Zargum drew that image,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.787,
    "end": 2591.353,
    "text": " And so he has a label-directed graph with subgraph components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.373,
    "end": 2598.321,
    "text": "Well, now there are lots of systems that have a label-directed graph with subgraph components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.441,
    "end": 2603.186,
    "text": "And we know how to do things like add an edge, add a node, change a label.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.808,
    "end": 2610.394,
    "text": "We know these different structures and how we can study them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2610.61,
    "end": 2638.39,
    "text": " with these parameters like families of structures right and that's kind of where my brain is drawn i my neurotype is such that i tend to get overwhelmed with immense complexity at once and personally the research journeys where i've been the most successful were the ones where i could find a starting place and identify some specific parameters to kind of tune the knobs on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.618,
    "end": 2657.998,
    "text": " And so like giving this type of problem, this type of structure gives us an entry point where, from my perspective, now not only do we understand it better and translate it to ourselves better and can communicate it with interested non-technicians better,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2658.502,
    "end": 2687.445,
    "text": " communicate it amongst ourselves better but also we can look at specific aspects of the structure to see how specific structures behave in ways that we might be able to predict and this is this is the starting point of a lot of the complex systems research for instance the game of life when john conway was designing the game of life cellular automaton",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.117,
    "end": 2702.059,
    "text": " He tried several different rules just guessing and checking to see which ones might have which parameter values for birth and death might lead to interesting configurations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2702.596,
    "end": 2705.42,
    "text": " Now, of course, we can do that in a computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.48,
    "end": 2711.308,
    "text": "So the possibility of searching a parameter space is greatly amplified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.929,
    "end": 2722.684,
    "text": "But in order to be able to search a parameter space, we have to have an idea of what the parameters to the system are and then how we will refine our parameter search.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.724,
    "end": 2729.093,
    "text": "So that is, again, a feedback system where we know the parameters we want to work with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2729.613,
    "end": 2730.474,
    "text": " We generate them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.675,
    "end": 2732.838,
    "text": "We generate the system performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.399,
    "end": 2734.521,
    "text": "We assess the performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.541,
    "end": 2742.875,
    "text": "We can then go back and look at what parameter settings might be useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.219,
    "end": 2748.023,
    "text": "Gradient descent is a feedback system in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.507,
    "end": 2753.933,
    "text": "And there are lots of search and optimization procedures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.997,
    "end": 2756.841,
    "text": " which are basically generate and test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2757.061,
    "end": 2762.189,
    "text": "It's just a matter of how the potential solutions are generated and how they're tested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.209,
    "end": 2775.488,
    "text": "And then the testing hopefully hooks back up to the generation so that we have a better idea of where to look in the search space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.508,
    "end": 2778.773,
    "text": "And I realize that all of this is probably well familiar",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.854,
    "end": 2785.47,
    "text": " To the viewers here who are familiar with the active inference framework like they're familiar with lots of different systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.053,
    "end": 2791.384,
    "text": "That involve feedback loops and modifying behavior based on feedback loops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2792.626,
    "end": 2797.538,
    "text": "But for me it's always helpful to just go back to the beginning and see the basic patterns as a starting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.238,
    "end": 2808.5,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.52,
    "end": 2815.434,
    "text": "In our last descent, which might be still somewhat extended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.415,
    "end": 2825.753,
    "text": "First, if anyone has a feedback, comment, they can go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.154,
    "end": 2848.821,
    "text": " optimization as feedback or optimization in feedback whether it's the OODA loop or the TOTE test operate test exit all these different guess and check methods",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.775,
    "end": 2876.226,
    "text": " and you brought up planning earlier this is something that's come up in the philosophical and applied literature where is there a plan where does it look like from another's perspective it could also be modeled with a plan and then nested planning end to end what what are the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.813,
    "end": 2893.995,
    "text": " fiat by fiat design choice structurings for nested models and what open source tools and how to do this and all this and then where and how to identify those nesting boundaries",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.258,
    "end": 2909.672,
    "text": " and understand again where's their like true planning if such a thing exists in the sense of actually like a tree search but just let's call that classic planning tree rollout",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.277,
    "end": 2934.85,
    "text": " you get into the preferential pruning and different attention focus to different specific potentialities and there's a whole alternative that's like the instructionist and then that was contrasted in the skillful performance uh paper and discussions with the interactionist where you may have the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2936.112,
    "end": 2941.559,
    "text": " cognitive system acting in a locally heuristic way without time steps of planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.061,
    "end": 2948.668,
    "text": "But that doesn't mean that from the side it wouldn't look plans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.39,
    "end": 2952.012,
    "text": "So what is really a plan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.112,
    "end": 2957.799,
    "text": "And then how does that relate to the way these feedback loops roll forward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.201,
    "end": 2962.845,
    "text": "And then there's the sort of retrospective dynamic causal modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.682,
    "end": 2993.119,
    "text": " from the past and then the stepping into the procedurally into the future but again the role of time and where is it audio like with these coming out of nowhere and like a wave versus the the visuality which puts it in a in a certain kind of all at once frame that still has uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.466,
    "end": 3018.28,
    "text": " feedback or by analogy or by isomorphism mathematically yet it's just so gripping at least in this that any visual feedback still just doesn't have that gripping audio feedback direct time weaving",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.112,
    "end": 3037.568,
    "text": " maybe though if there was a visual generation task like draw this shape or try to do a blind contour drawing then the visual feedback would stymie that and with VR",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.016,
    "end": 3066.93,
    "text": " many of these things are being tested like moving your eyes with a saccade or with your head is let's just calibrate it to zero lag in the natural embodied and then what delay after a clicking of a button or moving ahead does it percolate back and then how did the timings and the the differentials on these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.91,
    "end": 3083.046,
    "text": " Cyber-physical feedback loops, waiting for the next LLM token to trickle out or waiting for someone to say something in live chat, those informationally return to us, like surfacing a journal entry from a year ago",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.026,
    "end": 3105.405,
    "text": " are all these different regular and sporadic or infrequent and the sort of like n equals one of every unique event and encounter never step in the same river twice all of that with these regularities and then how much there is to extract",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.385,
    "end": 3113.775,
    "text": " informationally from even that arima like time lag generalized linear model with an auto regression",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.734,
    "end": 3120.664,
    "text": " A lot of signal is in that or the Kalman filter, Bayesian equivalent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.684,
    "end": 3140.758,
    "text": "And so the emergence of these statistical extensions and computers directly, like in the data science case, or just in the video streaming case, which is underpinned by so many similar statistical video compression, etc.,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.059,
    "end": 3156.975,
    "text": " procedures too, just abstract it away to the point where it can be like, well, I'm just talking with you or live streaming, but that's on solid ground of the composability of all of these feedback loops within the software.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.297,
    "end": 3186.642,
    "text": " and how the concurrency of that whole architecture is orchestrated even without agentic ai in 2025 just from microservices or just a computer science perspective well it occurs to me um as we talked about destructive feedback or disorienting feedback and i see the examples in the chat of uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.178,
    "end": 3214.249,
    "text": " nausea seasickness which is certainly a disorienting type of visual feedback but there's a there's a highly generative type i would say highly constructive type of visual feedback which is young children looking in the mirror and making the connection that the person in the mirror is an image of them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.119,
    "end": 3226.691,
    "text": " And that type of visual feedback, which is partially preceded by face recognition of the mother, you know, that's a very positive feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.711,
    "end": 3235.602,
    "text": "I don't think we could become, I don't think intelligence is possible without feedback and the right type of feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.642,
    "end": 3240.287,
    "text": "That's why educational institutions are effective when they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3241.263,
    "end": 3252.498,
    "text": " is they provide a way for lots of different levels and mechanisms of feedback on what and how one is thinking about a given topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.518,
    "end": 3261.71,
    "text": "And in the absence of any type of feedback, we tend to, it tends to be difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.391,
    "end": 3270.021,
    "text": "So there's the opposite extreme, which is like the algorithmization of that feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.659,
    "end": 3295.722,
    "text": " where something like the YouTube algorithm is directing and gating attention based on its mechanisms and a video going viral is an effect of the reflexive feedback loop that just amplifies in the social network um but that can also be very destructive lots of people go viral for reasons that they don't want to and that's how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.41,
    "end": 3321.388,
    "text": " mob justice occurs it's the same type of amplifying feedback loop so by analogy everyone has experienced this i was recently reading the book um everything i need to know about business i learned from the grateful dead and it talked about the importance of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.056,
    "end": 3344.136,
    "text": " the Grateful Dead audience to the Grateful Dead performance that their recorded albums were never at the standard of their live performances and that the band really counted on an engaged audience to give them an energy flow they could not have played the same to a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3346.293,
    "end": 3348.516,
    "text": " They could not have played the same in the studio.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3348.537,
    "end": 3353.264,
    "text": "And that was how I felt when I was teaching and lecturing with a live classroom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.31,
    "end": 3368.428,
    "text": "There's a story told, I think it's apocryphal, of, people changed the name, but of a great mathematician who was giving a lecture series and one day none of the students showed up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.209,
    "end": 3373.836,
    "text": "And his colleague comes by and finds him still writing on the board and talking about the equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.744,
    "end": 3378.75,
    "text": " And his colleague says, you know, Professor X, what are you doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.631,
    "end": 3381.574,
    "text": "And the professor says, I'm teaching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.156,
    "end": 3385.179,
    "text": "And his colleague says, to whom?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3387.503,
    "end": 3390.507,
    "text": "And the professor says, what difference does that make?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.43,
    "end": 3397.818,
    "text": "And so you can have that type of open loop control where you're going to say whatever you're going to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3397.878,
    "end": 3402.304,
    "text": "But there's also, I think, tremendous power even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.01,
    "end": 3405.673,
    "text": " in the sense to felt understanding of the audience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.494,
    "end": 3426.52,
    "text": "You know, that's why it's so, that's why it helps so much when there's something in the chat or when you say something, because otherwise I don't want to spend time just talking for an hour about my thoughts with no expectation that it's generating any other thoughts for anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3427.394,
    "end": 3435.628,
    "text": " That's one idea of what makes a thought real, is that a thought that is real goes out and makes other thoughts occur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3435.688,
    "end": 3440.155,
    "text": "It makes other thoughts occur in people's heads.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.417,
    "end": 3447.748,
    "text": "The surrealist artist Keith Wigdor gave me that idea, and I've always thought it's a really powerful definition of real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3458.039,
    "end": 3478.748,
    "text": " rorik wrote when there are differences that are able to make a difference yeah that's a kind of classic philosophy of biology or information theory well on the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.668,
    "end": 3493.362,
    "text": " On the technical part, Octopus I think will have a really epistemic and collaborative and productive year connecting some of the dots with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.692,
    "end": 3503.627,
    "text": " Do generalized coordinates on a Bayes graph as per Bayesian mechanics equal generalized dynamical systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.128,
    "end": 3511.019,
    "text": "How are, how you all are exploring and implementing these questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.16,
    "end": 3514.405,
    "text": "Where in this stack",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.752,
    "end": 3539.532,
    "text": " from the symbolic choices that are used in the approximating and modeling on through the implementations it's quite a space so that's fun and i think for uh future discussions and works let's kind of just uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3541.722,
    "end": 3548.149,
    "text": " have a last piece here about where you want it to end up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.169,
    "end": 3566.65,
    "text": "Because I think we can pop into the Bayesian statistical, but pointing to bigger directions will continue to prompt and give these open learning opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.946,
    "end": 3591.861,
    "text": " experiences and and have feedback be something that's so rich that we continue to act and first serve with not just a homework problem that we're getting graded on like a true false and keep getting wrong keep getting red x's off",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3596.566,
    "end": 3599.55,
    "text": " If you keep getting wrong, red X is on the true false problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.59,
    "end": 3600.411,
    "text": "I don't know what to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.514,
    "end": 3604.336,
    "text": "Why not structure it by lifelines?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.059,
    "end": 3606.679,
    "text": "Stroopy wrote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3607.861,
    "end": 3610.324,
    "text": "Yeah, what I I'm intrigued.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.384,
    "end": 3616.012,
    "text": "I was intrigued by that question and wasn't sure what lifelines meant in that context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.695,
    "end": 3620.738,
    "text": "I assumed it was about structuring the.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.778,
    "end": 3624.463,
    "text": "The due dates of assignments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3625.844,
    "end": 3648.392,
    "text": " oh like is it like in who wants to be a millionaire where you add add more resources according to the difficulty of the question add more access to resources like you can call someone or give more hints or things like that is that what is meant by lifelines",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.942,
    "end": 3663.242,
    "text": " we will see in the chat also it makes me think of the trace that uh a ball on waddington's epigenetic landscape and this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3665.213,
    "end": 3690.107,
    "text": " energy landscape-like, ball optimization, ball rolling downhill, mechanical gradient descent, Newtonian mechanics, Bayesian mechanics, kind of this nomadic concept, and the field-like or distributional nature of this channel, be it narrow or wide, and the wobbles through procedural time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.087,
    "end": 3691.85,
    "text": " or through real embodied time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3691.89,
    "end": 3694.875,
    "text": "And then there's the slice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.397,
    "end": 3705.772,
    "text": "And this would give you a Gaussian distribution, like censored here, just focusing on that one part or a mixture of Gaussians or whatever it happened to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.934,
    "end": 3712.062,
    "text": "And that sort of statistical ensemble summary statistic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.358,
    "end": 3743.145,
    "text": " statistics modeling here we can summarize this channel with its mean and variance uh as can you know coin flip with this uh distribution and then the particularity and the historiosity of the balls lifeline trace pheromone trail journey actual you know where it actually is at any given time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.07,
    "end": 3752.376,
    "text": " in contrast with all of the lateral and antecedent and postcedent ghosts or alternatives",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.567,
    "end": 3775.973,
    "text": " that it could actually be enabled or constrained to do, like situational actual adjacencies, or just from a third-party modeling perspective, which could make a great ultra-efficient approximator for a complex thing, like a lot of factors influence height, but you still might be able to summarize it with a mean and a variance for a given adequacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.993,
    "end": 3784.523,
    "text": "And just like every other map territory, richness, and again, where's feedback and all that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.933,
    "end": 3806.066,
    "text": " Well, one thing that I think would be cool to do, I've kind of hit on the idea that broadly speaking, I'm interested in information processing systems, which is so broad that you can make it be anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.248,
    "end": 3811.455,
    "text": "But that includes like management cybernetics and how it was able to draw",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.992,
    "end": 3817.297,
    "text": " and useful analogies between engineering practices and the design of companies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.959,
    "end": 3831.551,
    "text": "It has a lot of implications for DAOs, decentralized autonomous organizations, like Alcoholics Anonymous, and how there's a decentralized structure to Alcoholics Anonymous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.191,
    "end": 3838.017,
    "text": "There's also a belief feedback loop about alcohol that is interrupted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3838.958,
    "end": 3844.947,
    "text": " Gregory Bateson did that analysis cybernetically, so there's an interesting connection there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.668,
    "end": 3868.881,
    "text": "What I think would be really cool is to begin to develop in the same way that there's a periodic table of elements, and we understand how basic elements create molecules, or in the same way that we know that there are 17 fundamental wallpaper groups of symmetries of the two-dimensional Euclidean plane, but to have a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3870.042,
    "end": 3898.581,
    "text": " basic experiential feedback patterns and to be able to predict the basic low-level mechanisms, things like analogous to capacitors, resistors, et cetera, in engineering, and to predictably create specific feedback patterns, both in terms of a theoretical knowledge where, okay, I can write it down on paper that if I move the camera this way through the screen, I know what the output will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.084,
    "end": 3908.601,
    "text": " but also in a practical way where there are people who can make the patterns reliably given a certain set of tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3908.821,
    "end": 3913.269,
    "text": "So right now I have access to three cameras and two monitors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.171,
    "end": 3920.101,
    "text": "My phone died, unfortunately, but that feels like a good playground to start with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3921.644,
    "end": 3924.028,
    "text": "What can we do with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3924.97,
    "end": 3939.405,
    "text": " three cameras and two screens and the different ways that we might arrange them, the different ways that we might move the cameras through the screens, the different ways that we might move the screens, and the different ways that we might put each of these things in geometric location to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3940.987,
    "end": 3946.552,
    "text": "I have a sense that this research is probably out there, that people have done these experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.373,
    "end": 3953.88,
    "text": "I have a vague memory of reading in a popular science book about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.468,
    "end": 3965.783,
    "text": " researchers and some open-minded place in like California or Santa Fe who did this and cataloged specific patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.984,
    "end": 3970.51,
    "text": "So if the research is already out there, it would just be awesome to find it again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.631,
    "end": 3980.844,
    "text": "And if it's not out there, then we can do it ourselves and say, I am moving the camera this way through the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3980.884,
    "end": 3982.686,
    "text": "Here's the effect I'm getting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.852,
    "end": 4008.37,
    "text": " as i move the camera faster it increases this effect and go back to exploring the parameter space through just play but play with records so that later we can go back and it's not like you know nobody nobody is able to use diphenhydramine very profitably as a psychedelic because it has such a strong memory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.075,
    "end": 4029.042,
    "text": " disinhibiting effect so you trip lots of interesting things happen but you can't remember anything that happened the next day and uh I don't want to do that we want to do these experiments but in a recorded way where we can then analyze it and come up with useful information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.373,
    "end": 4047.116,
    "text": " So I guess that would be my call to action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4047.537,
    "end": 4058.777,
    "text": "And we have 10 minutes where we could start or we could make this be the focus of future research at a different improvisation session or in some structured way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.797,
    "end": 4061.762,
    "text": "I'm incredibly open-minded generally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.449,
    "end": 4094.871,
    "text": " yeah i think uh modeling a couple of these real settings that we're in like i have two computer monitors and obs is capturing itself at 25 frames per second or we have an analog camera",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4094.851,
    "end": 4113.349,
    "text": " looking at an analog TV and they're exactly aligned and so it just this it doesn't get to this limited tractor and then is it a stable or does a little flicker of light destabilize what's the lyopinib exponent does it twist does it nest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.78,
    "end": 4136.535,
    "text": " what are those categories of patterns and what is their intersectional co-arising from necessity sufficiency identity where are they excluding or complementing each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.253,
    "end": 4140.997,
    "text": " Game of Life gives us a great grid world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.319,
    "end": 4157.663,
    "text": "And as we've alluded to, has some feedbacky elements, like the information content between something, every repeater numbers of cycles or distance in space-time might be tremendously informative for like information theory, statistical setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4157.643,
    "end": 4177.896,
    "text": " and what we truly have at hand in this experience too is cognitive modeling webcams live streaming what about one picture a day of a text file",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4179.918,
    "end": 4203.158,
    "text": " that sense on the other end of the sine wave just what what are the what are the base graphs what's the maids GDS how do different language models help us interpret and work with that as so many fun and and improvisational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.247,
    "end": 4235.035,
    "text": " experiences that that relate a lot to the process of cognitive modeling overall like once putting a finger on a fabric and then moving it to actively determine the roughness those kinds of examples isocade so a lot of primary embodied and then this is kind of like the drosophila or just a case that allows for really compositional lab experiments field experiments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.331,
    "end": 4264.752,
    "text": " field lab lab as a field field as a lab all of that with webcams and the cyber physical tools at hand and open source and and fun and interesting and with people's feedback welcome and if I would add one thing to that that like everything you said um and it occurs to me that if we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.542,
    "end": 4271.969,
    "text": " Generally speaking, it's been useful to begin with the physical and then cyberify it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.511,
    "end": 4283.763,
    "text": "So the first PID controllers were built after someone actually watched how a ship captain was choosing to steer the ship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.065,
    "end": 4293.034,
    "text": "The first pilot steering mechanisms came from watching how pilots tried to use their body to force the early plane somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.419,
    "end": 4321.992,
    "text": " and i think you know we have this tremendous advantage of being bespoke meat computers which is is an advantage in a lot of ways and once we have those experiences then we can translate them into something where the space can be explored algorithmically so once i've done the experiment a few times myself i can then say well here's what's basically happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.326,
    "end": 4329.475,
    "text": " with the visual sensor and the information source, and I can do things that would not be possible for me to do physically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4329.515,
    "end": 4351.641,
    "text": "I can go from my two-monitor, two-camera setup to an eight-monitor, eight-camera setup that I don't actually have, but that I can extrapolate algorithmically because I can reality check that I can produce in code what I am experiencing in my physical processing unit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4352.87,
    "end": 4355.053,
    "text": " And that's the advantage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4356.235,
    "end": 4363.004,
    "text": "Wolfram had about 15 years of computational advances from Conway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4363.044,
    "end": 4372.036,
    "text": "And so when Wolfram was exploring the space of parameters, he didn't have to use graph paper or a primitive seeming computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4372.777,
    "end": 4379.326,
    "text": "He could generate lots of rules at once and immediately see what was happening and decide which ones were interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.187,
    "end": 4382.05,
    "text": "So the tightening of the feedback loop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.688,
    "end": 4400.267,
    "text": " enabled the exploration of the parameter space to occur much more efficiently, which led to insight, like things like the four classification of cellular automata that Wolfram proposed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4401.049,
    "end": 4402.452,
    "text": "If he had to design",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4403.815,
    "end": 4408.18,
    "text": " analyze all the rules purely by hand, it probably would have been more difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.981,
    "end": 4412.525,
    "text": "Although, I mean, doing things slowly by hand certainly has value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4413.506,
    "end": 4423.997,
    "text": "The ability to get, to instantly generate, instantly test, and instantly generate again is a major cognitive tool for exploring parameter spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4426.36,
    "end": 4431.325,
    "text": "And I see already that you're playing with the different patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4433.903,
    "end": 4435.687,
    "text": " Yeah, this is the hotel room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4435.767,
    "end": 4437.691,
    "text": "And can you look into the infinite mirror?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.208,
    "end": 4446.37,
    "text": "How many layers deep?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.511,
    "end": 4448.976,
    "text": "What if I change the video resolution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.34,
    "end": 4464.015,
    "text": " Now that we can look at this traveling wave, what is making it... Can you seize that traveling wave in one fell swoop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.177,
    "end": 4467.499,
    "text": "Like the sandwich transaction on the blockchain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.441,
    "end": 4470.382,
    "text": "Or which of these?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4470.443,
    "end": 4476.049,
    "text": "And there's going to be so many awesome traveling waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.589,
    "end": 4478.912,
    "text": "This looks like a video game, doesn't it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.153,
    "end": 4481.754,
    "text": " It does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4481.794,
    "end": 4486.259,
    "text": "And then we can take this and do what we want to with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4488.582,
    "end": 4493.427,
    "text": "Like the ability to sample, which is a type of feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.488,
    "end": 4495.39,
    "text": "It's one with an extreme time delay, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.611,
    "end": 4500.115,
    "text": "But sampling as a type of feedback is very slow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.237,
    "end": 4503.579,
    "text": "But it's still feedback, still playback, at least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4504.08,
    "end": 4507.864,
    "text": "So I won't get too into the woo here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.485,
    "end": 4509.186,
    "text": "We have our own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4510.297,
    "end": 4536.726,
    "text": " have my own theories about whether or not the universe is a recording or a simulation or things like that but um and we didn't get on hyperstition either which is another powerful form of feedback so i think there's a lot more to do and i'm excited that i had this time to talk to you and anyone who tuned in um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4539.963,
    "end": 4565.548,
    "text": " my my x account link is in the description of the video i don't want to get bodied but um if you'll see it there so if you would if you're interested in this a good way to get in touch with me is to dm me there or or reach out publicly that's fine too and uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4568.043,
    "end": 4594.067,
    "text": " was so much fun i hope we get good feedback on the recording i hope so too thank you octopus really looking forward to exploring all these facets together and with others well so peace and then here's how i end the stream just while it's also still happening turn off the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4595.515,
    "end": 4602.032,
    "text": " audio's off mine's off mine's on yours is off so then even though i can hear it you won't then",
    "speaker": "SPEAKER_00"
  }
]