[
  {
    "start": 2.427,
    "end": 3.408,
    "text": " All right, welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.85,
    "end": 6.671,
    "text": "It's 7-11-23.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.172,
    "end": 12.177,
    "text": "We're in cohort three in our first discussion of chapter eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.258,
    "end": 21.105,
    "text": "So we'll head over to chapter eight and look at some questions and comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.265,
    "end": 27.912,
    "text": "But first, does anyone want to bring up any",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.972,
    "end": 33.158,
    "text": " Uh, just general or thoughts or reflections on chapter eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.44,
    "end": 48.921,
    "text": "Um, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.17,
    "end": 63.467,
    "text": " Uh, well, yes, um, actually chapter eight, um, as obviously the title suggests, uh, is, uh, kind of complimentary to, uh, chapter seven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 63.717,
    "end": 73.967,
    "text": " in terms of being the continuous time counterpart to the active inference formulation of discrete time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.808,
    "end": 89.742,
    "text": "As we saw previously in Chapter 4, we have both continuous time version and discrete time version of active inference employing different mathematical technologies and techniques.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.722,
    "end": 105.804,
    "text": " But of course, they can be regarded as kind of formulating the same or at least similar formulation just using different mathematical techniques.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 105.844,
    "end": 113.535,
    "text": "So namely, in discrete time case, we use matrices",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 113.684,
    "end": 117.691,
    "text": " to represent states, transitions, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 119.635,
    "end": 130.495,
    "text": "But in continuous time, we use generalized coordinates in order to describe the states and not just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 130.475,
    "end": 149.158,
    "text": " I mean discrete matrices for states, and also the starting point of formalizing active inference in continuous time also differs a bit, because in continuous time version we begin with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 149.138,
    "end": 175.416,
    "text": " a version or a variant of Ido's stochastic equation by representing a flow plus random variable and then trying to somehow formulate the flows in terms of increasingly granular wave and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 176.51,
    "end": 191.385,
    "text": " Yeah, tracing the trajectory through the state space, continuous time state space, employing that, I mean, Taylor expansions and other mathematical technologies and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.913,
    "end": 200.194,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.254,
    "end": 200.634,
    "text": "Olivier?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.517,
    "end": 205.639,
    "text": "Yeah, what do you mean by granular here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.77,
    "end": 225.568,
    "text": " So I mean it is a stochastic equation is a very general equation describing any kind of sorry differential stochastic phenomenon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.548,
    "end": 234.366,
    "text": " In this case, we focus on a particular kinds of state space with particular kinds of behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.328,
    "end": 244.266,
    "text": "So especially in active inference, we focus on active agents as opposed to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 244.246,
    "end": 265.952,
    "text": " a more general sense of the term, such as, I mean, describing the whole behavior of a self-organizing system or even a simple system that can be basically described with a simple statistical physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.893,
    "end": 272.7,
    "text": "So the focus of active inference, as I said, is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.68,
    "end": 280.148,
    "text": " the agents that don't have empty set of active states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 281.369,
    "end": 288.457,
    "text": "But of course, it can also be generalized to other agents with empty active states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 289.718,
    "end": 300.409,
    "text": "But the Active Inference Framework or FEP don't have anything particularly interesting to say about those other agents",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 300.389,
    "end": 329.367,
    "text": " uh that's uh what i meant uh of granular we focus on a subset of the systems that can be described through it was a stochastic um equation okay cool thank you we can come back to some of these uh and also ali we will be keeping in mind that we need to make the videos for seven eight nine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.338,
    "end": 351.135,
    "text": " or five sure yeah whatever you whatever you want um um okay anyone else want to just have any general thought or question raising their hand or or in the chat on on eight on and continuous time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.199,
    "end": 380.7,
    "text": " really like that chapters two and three give us the kind of uh two ways to get there to act inf the low road and the high road the how and the why and now it's like we're in the city and now there's two restaurants or there's like two doors to the restaurant with the discrete and the continuous time so it's another dyad of chapters with seven and eight",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.984,
    "end": 399.432,
    "text": " and another juxtaposition that gives us parallax and helps us understand more about each of these two methods by highlighting, on one hand, situations where they seem to apply more naturally,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.918,
    "end": 410.67,
    "text": " For example, the discrete time formulation seems to be a natural fit for discrete decision-making tasks, like which slot machine are you going to pull?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.651,
    "end": 426.027,
    "text": "Whereas the continuous time model seems to be a more natural fit for analog perception control systems like proprioception and sensory motor behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.137,
    "end": 432.042,
    "text": " And Chapter 8 is also going to get us to hybrid nested models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.063,
    "end": 439.189,
    "text": "For example, a model with two layers where the lower level is continuous time and the higher level is discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.97,
    "end": 452.402,
    "text": "So that kind of represents like a decision-making central nervous system that's dispatching commands to a continuous time sensory motor body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.382,
    "end": 465.883,
    "text": " And that is also explored in the sort of folk psychological active inference work, where you can kind of get the synthesis of continuous and discrete time models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.928,
    "end": 473.074,
    "text": "Anyone else want to add a comment on 8 before we start to look through it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.032,
    "end": 483.02,
    "text": " Yeah, I have a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 483.08,
    "end": 487.131,
    "text": "Wait, I'll just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 488.343,
    "end": 490.867,
    "text": " Maybe it's nicer if I have my video on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 491.928,
    "end": 493.01,
    "text": "Let's see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 493.29,
    "end": 506.029,
    "text": "I was wondering if there are any good resources on applications of continuous active inference, because up until now, I've worked on two projects with active inference, but only working with discrete state-based models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 506.31,
    "end": 516.004,
    "text": "And I was wondering if there is any good papers on continuous active inference and its sort of representative application.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 518.515,
    "end": 544.219,
    "text": " they in the citations yeah i think this table has some oh yeah yeah i'm so sorry for asking a redundant question no no it's it's it's all good these are not all the applications but let's just look at the topics that they have raised so the bird song is definitely a classic um single singing bird and uh two singing birds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.625,
    "end": 561.007,
    "text": " Ocular motor behavior, reflex behavior, more eye behavior, different cognitive states, more eye behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.027,
    "end": 565.674,
    "text": "This is one of the few papers on mirror neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.318,
    "end": 570.021,
    "text": "Attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.187,
    "end": 574.252,
    "text": " I believe this is attention being modeled in a slightly different approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.093,
    "end": 590.912,
    "text": "Um, this is a continuous time attentional framework, whereas the, um, Sanved Smith paper uses, um, discrete time attention, hybrid and self-organizing, but, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.183,
    "end": 608.589,
    "text": " There's other citations, and i'm sure you could come up with many more things, and also like one of the kind of model annotation tasks that I think would be super helpful in terms of meta analysis would be like for each paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.629,
    "end": 611.495,
    "text": "How could?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.635,
    "end": 612.536,
    "text": "How can we describe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.797,
    "end": 616.123,
    "text": "How can we describe the active inference models they used?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.576,
    "end": 618.378,
    "text": " So then we could just like filter a table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.618,
    "end": 620.04,
    "text": "Where are the discrete time models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.16,
    "end": 621.401,
    "text": "Where are the continuous time models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.522,
    "end": 622.603,
    "text": "Where are the nested models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.823,
    "end": 624.565,
    "text": "Where are the models that use empirical data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.406,
    "end": 625.686,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.109,
    "end": 628.349,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.97,
    "end": 629.43,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 629.45,
    "end": 630.772,
    "text": "Thank you for the overview.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 631.493,
    "end": 631.773,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.999,
    "end": 637.259,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.022,
    "end": 645.148,
    "text": "So from the figures,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.255,
    "end": 660.016,
    "text": " Figure 4.3, recall that the discrete time and the continuous time generative models have some structural similarities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.099,
    "end": 665.905,
    "text": "At the same time, they have important differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.121,
    "end": 683.252,
    "text": " And also partially this is signaled with a difference in notation so like hidden states are going to be reflected with X in continuous time not s observables are reflected with why not oh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.515,
    "end": 711.062,
    "text": " causal interventions in the system are reflected in v not pi and really the most important difference is that whereas in the discrete time you have past present and future explicit state predictions in the continuous time setting you're using the generalized coordinates of motion where x is the hidden state at a given time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.295,
    "end": 716.183,
    "text": " And X prime is the derivative of the hidden state, how it's changing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.984,
    "end": 735.092,
    "text": "So the B matrix, which is the transition matrix in discrete time, describing how states go from one time step to another, how the hidden states change, here is describing kind of like the derivative or the integration function, because it's describing how derivatives are linked to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.118,
    "end": 759.983,
    "text": " and what causes do in the model is they influence how derivatives change through time here's the um Edo calculus type um equations that Ali spoke to first we have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.515,
    "end": 791.303,
    "text": " observable states are a function g of hidden states that's the flow and some stochastic noise term about y sensor noise and then x dot rate of change in x is a function of the hidden state at the current time and the causal forces on the system at that time plus a fluctuation term on x",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.835,
    "end": 799.497,
    "text": " Action is absent in equation 8.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.758,
    "end": 805.182,
    "text": "This is because action is part of the generative process, not the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.885,
    "end": 811.708,
    "text": "Pending our definitions of generative process and generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.689,
    "end": 819.014,
    "text": "The generative model only deals with those variables directly influenced by states external to a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.079,
    "end": 825.34,
    "text": "What do you think about this, Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.002,
    "end": 860.895,
    "text": " Well, yeah, actually, this is one of the points that was kind of brought up in the discussion with Maxwell, because as we know, generative model, I mean, if we consider FEP as this kind of general framework or theoretical framework,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 860.875,
    "end": 887.642,
    "text": " to describe the behavior of the things, quote-unquote things, that persist through time, we can theoretically describe the generative model as containing any kinds of different situations, both containing activist states, or in other words, with activist states, and also with empty set of activist states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 887.96,
    "end": 900.856,
    "text": " Uh, so, uh, but, uh, as I, uh, said before, um, I believe active inference, uh, is more concerned with the situations that have non-empty set of activist states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.956,
    "end": 912.33,
    "text": "In other words, they have the ability to perform or to undertake, um, or, uh, to put, uh, to put it in, um, uh, more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 912.766,
    "end": 935.5,
    "text": " rigorous terms to kind of engage in a causal intervention with the environment, both in terms of updating the generative model and also effectuating some changes in the environment that can fit better with their",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 935.733,
    "end": 938.197,
    "text": " generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.078,
    "end": 963.715,
    "text": "So yeah, that's, I mean, what's meant here by directly influenced by states external to a Markov blanket means the states from the environment that can dynamically act upon the Markov blanket in order to make it more suitable or more adapted to the environment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 964.555,
    "end": 988.791,
    "text": " through the generation of the market blanket i'm sorry the generative model and also minimizing the free energy yeah thank you it it looks like the difference here between 8.1 and 8.2 other than the bolding of the um equations is like v a static variable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.615,
    "end": 994.721,
    "text": " is replaced by a controllable action parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.067,
    "end": 1011.039,
    "text": "So now a specific implementation of equations 8.1 and 8.2 are going to be described.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.16,
    "end": 1014.643,
    "text": "So now, Ali, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.374,
    "end": 1020.077,
    "text": " Sorry, I forgot to mention something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.298,
    "end": 1040.26,
    "text": "There was a debate on Twitter a couple of days ago about whether or not FEP can be applied to inert objects such as rocks, which is one of the debates that's been going on for a long time now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1040.24,
    "end": 1046.247,
    "text": " You see, theoretically, it can be applied to any kinds of object, even to a inert rock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1046.848,
    "end": 1053.876,
    "text": "But the only difference here is that inert rock has an empty set of active states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.997,
    "end": 1054.417,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.858,
    "end": 1065.15,
    "text": "So if we take a non-empty set of active states, such as, I don't know, biological organisms or sentience agents and so on,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1065.265,
    "end": 1091.965,
    "text": " that would also employ the same kind of mathematical technologies but the only difference would be uh the existence of non-empty set of activist states sure i i would almost also say though that it's not that the active states are empty for an inert or a classical or a conservative object",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1092.991,
    "end": 1097.839,
    "text": " that they're just trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.641,
    "end": 1102.746,
    "text": "For example, just outputting a stationary action state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.651,
    "end": 1115.787,
    "text": "Okay, so now they're going to give a specific example of what this pair of equations looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.029,
    "end": 1120.534,
    "text": "And there's a point attractor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.97,
    "end": 1136.29,
    "text": " So this is going to be kind of moving us towards a continuous time system where there's a fixed attracting point, where if the actuator is below the fixed point, it's going to go up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.31,
    "end": 1138.233,
    "text": "And if it's above the fixed point, it's going to go down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.954,
    "end": 1146.724,
    "text": "And so this is going to be the kind of model that's used for eye saccades and for like elbow movement and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.91,
    "end": 1152.613,
    "text": " generative process is specified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.955,
    "end": 1159.441,
    "text": "The hidden state is basically just passed through and the action is basically just passed through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.345,
    "end": 1165.448,
    "text": "V is in the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1170.213,
    "end": 1175.479,
    "text": "V. U is in the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.462,
    "end": 1209.786,
    "text": " this connects to the equilibrium point hypothesis again it relates to a proprioceptive prediction about expected proprioceptive feedback coming from for example the limbs or the eyes this enables action to be prediction fulfillment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.47,
    "end": 1216.296,
    "text": " rather than, for example, reward maximization or utility maximization directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.601,
    "end": 1230.315,
    "text": "This relates to an extensive discussion on forwards and inverse modeling and interactionism and instructionism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.277,
    "end": 1236.043,
    "text": "And some of that was explored in the skillful performance live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.542,
    "end": 1247.699,
    "text": " Now they're going to move from this fixed point attractor into a spring attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.221,
    "end": 1255.732,
    "text": "So now there's going to be an oscillatory attraction with dampening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.315,
    "end": 1262.503,
    "text": "And that is going to require not just a spring,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.737,
    "end": 1280.265,
    "text": " scalar description of the attractive point, but we're going to start moving into this generalized coordinate way of thinking where we're going to be tracking kind of a vector of position and velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.565,
    "end": 1289.419,
    "text": "And generalized coordinates, you can think of they keep going, like you could have position, velocity, acceleration, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.547,
    "end": 1307.389,
    "text": " So they kind of just work through that and say, yeah, you could also just write down the generative model where not just the elbow wants to be at 90 degrees and it's at 80, so it extends out to 90, but now you could have one where it goes and it overshoots 90 and then dampens back to 90.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.11,
    "end": 1313.918,
    "text": "And you could continue to develop these generalized coordinate-based systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.038,
    "end": 1319.305,
    "text": "Or you could think about the fixed points being attractors in a generalized coordinate space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.082,
    "end": 1329.328,
    "text": " this discussion connects us to consideration of dynamical systems more broadly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.376,
    "end": 1354.928,
    "text": " fixed point attractor the spring attractor those were both dynamical systems and so now we're kind of fully in this dynamical systems setting which is natural for continuous time discussions and stochastic differential equations and all of this some topics that are certainly relevant for the discrete time setting but are more naturally addressed in continuous time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.751,
    "end": 1377.439,
    "text": " So in chapter five, we looked at this spinal cord cross section, and it was discussed as a simple proprioceptive input descending fixed point prediction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.077,
    "end": 1386.438,
    "text": " And then the residual was being passed on, the error signal was being passed forward to engage bodily movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.1,
    "end": 1395.04,
    "text": "So like if the proprioceptive data and the descending prediction were identical, there's no discrepancy, no motion occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.56,
    "end": 1411.137,
    "text": " Whereas when there is a discrepancy between the expectation of proprioception and the incoming proprioception, this triggers a discrepancy and that discrepancy is resolved through movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.157,
    "end": 1423.39,
    "text": "So now that example from chapter five is being re-approached using the formalisms and the continuous time setting that we see in chapter eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.702,
    "end": 1435.712,
    "text": " Here we have a box on precision, attention, and sensory attenuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.536,
    "end": 1447.81,
    "text": "This is going to cover several different topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.811,
    "end": 1456.262,
    "text": "First, precision and attention are described as synonymous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.672,
    "end": 1463.167,
    "text": " That's a pretty general claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.311,
    "end": 1470.15,
    "text": "However, one can think of as something that's being attended to highly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.434,
    "end": 1497.471,
    "text": " is giving precise inputs and therefore is salient it's relevant it updates the model a lot if something is not being attended to in the limit that is equivalent to something that has zero precision it's infinitely ambiguous and therefore it doesn't update the model because it's not salient it's not relevant so it's kind of a general point about precision and attention",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.037,
    "end": 1525.433,
    "text": " And one way that this plays out in relationship to motor control and some extremely interesting and unique explanations and predictions arising about precision attention and motor control in a predictive processing setting is this topic of sensory attenuation in motor generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.818,
    "end": 1529.082,
    "text": " So attenuation means diminishment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.903,
    "end": 1535.731,
    "text": "And in some ways, attenuation, even though it sounds like basically the same word, is like the opposite of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.372,
    "end": 1541.839,
    "text": "It just means it's like dis-attention or like alleviation of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.681,
    "end": 1554.255,
    "text": "Does anyone want to like give a thought or explanation about what is the role of sensory attenuation in motor initiation and fulfillment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.462,
    "end": 1566.304,
    "text": " Okay, I'll just give a thought on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.788,
    "end": 1581.163,
    "text": "So, if one is sitting down in a chair, the accurate belief to have is I am sitting down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.366,
    "end": 1591.937,
    "text": "How, without invoking goals or explicit predictions about future time points,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.626,
    "end": 1602.485,
    "text": " How do we go from having an accurate belief I am sitting down to having an accurate belief that I am standing up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.785,
    "end": 1606.372,
    "text": "I mean, the transition between those two steps, basically two things have to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.873,
    "end": 1607.935,
    "text": "You have to change your mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.197,
    "end": 1613.181,
    "text": " thinking you're sitting down to thinking that you're standing up and you have to change the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.201,
    "end": 1616.365,
    "text": "You actually have to go from sitting down to standing up, that's action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.185,
    "end": 1619.107,
    "text": "And so how does that happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.628,
    "end": 1635.745,
    "text": "Well, the issue is that if you're sitting down and you have a high precision, accurate belief, I am sitting down, and then you change or you try to change your expectation or your preference or your fixed point or your set point to standing up,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.147,
    "end": 1639.092,
    "text": " It's going to be like, no, that's unlikely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.653,
    "end": 1642.718,
    "text": "All of our proprioceptive evidence is telling us that we're sitting down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.778,
    "end": 1655.64,
    "text": "And so in that way, like the body would kind of be like an anchor and it would pull the cognitive belief back to, no, actually we're sitting down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.722,
    "end": 1663.172,
    "text": " So if you just try to be like, we're sitting down and we know that we're sitting down and you just try to say, okay, now we're standing up, but the body's still sitting down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.232,
    "end": 1669.901,
    "text": "If you have high attention on the proprioceptive inputs, then that cognitive belief gets dragged back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.921,
    "end": 1672.384,
    "text": "And so you end up not initiating motor movements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.866,
    "end": 1679.454,
    "text": "And so the resolution of this challenge is you update your belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.714,
    "end": 1682.438,
    "text": "I am standing up while you're sitting down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.92,
    "end": 1687.187,
    "text": " Meanwhile, you engage in sensory attenuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.989,
    "end": 1692.539,
    "text": "You release the attention on the proprioceptive input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.581,
    "end": 1698.672,
    "text": "And during that alleviation of attention to proprioceptive input,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.462,
    "end": 1707.622,
    "text": " you can think about the distribution on proprioceptive inputs to actually include standing up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.404,
    "end": 1713.356,
    "text": "So now that is a more viable hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.396,
    "end": 1716.002,
    "text": "The posterior probability becomes higher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.282,
    "end": 1725.193,
    "text": " then action selection can be engaged to fulfill that expectation about standing up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.914,
    "end": 1740.395,
    "text": "And so voila, now you're standing up and you think you're standing up, and then you can re-engage precision so that now you can have that precise belief that you're standing up, whereas previously you had a precise belief that you were sitting down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.236,
    "end": 1745.702,
    "text": "And the key step was kind of like you're driving on the road,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.8,
    "end": 1747.442,
    "text": " it's like attention is like the gas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.263,
    "end": 1752.388,
    "text": "You pull off the gas, make the turn, and then re-engage the gas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.088,
    "end": 1757.574,
    "text": "And another example of this is in our eye saccades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.395,
    "end": 1762.94,
    "text": "When our gaze is fixed, we have high precision on our visual input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.221,
    "end": 1770.609,
    "text": "When we do an eye saccade, transiently, it suppresses visual precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.43,
    "end": 1775.014,
    "text": "And that's why during saccades, which happens several times a second,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.197,
    "end": 1780.545,
    "text": " we don't see like a big blur because it's almost like a blink.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.565,
    "end": 1800.934,
    "text": "Now it's not your eyelids coming over your eyes, but it's actually an attentional blink when you do a saccade, which is why the highly dynamic input during a saccade is suppressed or not attended to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.268,
    "end": 1821.973,
    "text": " so that we end up having the generative experience of fixed high precision vision, and then we blink into another fixed high precision visual input with a suppression of attention during the saccade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.994,
    "end": 1829.723,
    "text": "And different pathologies can be understood as challenges associated with initiating movements,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.631,
    "end": 1857.567,
    "text": " or with terminating movement or with continuing movement and so different different um pathologies have been associated with this so certain motor dyskinesias where somebody may have a challenge initiating a movement but once they are moving like they walk normally or on the other hand there are um different motor pathologies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.947,
    "end": 1860.309,
    "text": " Any thoughts or comments on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.79,
    "end": 1862.732,
    "text": "This is kind of an interesting topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.848,
    "end": 1886.946,
    "text": "Even just outside of this embodied or technical setting, just like this idea that in order for the possible to be actualized,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.854,
    "end": 1897.363,
    "text": " There has to be a relaxation on the actual to enable the movement to a different space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.39,
    "end": 1906.892,
    "text": "And here's the cyclical precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.874,
    "end": 1915.6,
    "text": "And this has been associated heavily with differences in the neurophysiology of vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.765,
    "end": 1921.086,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.106,
    "end": 1929.013,
    "text": "Again, just raise your hand or write anything in the chat if you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.033,
    "end": 1934.118,
    "text": "A classic dynamical systems model from ecology is going to be introduced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.198,
    "end": 1936.66,
    "text": "And this is the Locke-Volterra dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1939.122,
    "end": 1948.911,
    "text": "Sometimes it's called predator-prey dynamics, or especially in the context of neural Darwinism dynamics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.33,
    "end": 1951.678,
    "text": " and dynamical systems in neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.562,
    "end": 1957.72,
    "text": "Sometimes this is called winnerless competition, because as you can see here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.083,
    "end": 1989.09,
    "text": " this ecological example like it's not that the herbivores are trying to defeat the plants in fact they have a relationship where if the herbivores are transiently succeeding in decreasing the plant numbers then they will have this like demographic collapse and so this is the winnerless competition is you have dynamical oscillations and so this describes ecological dynamics but also it describes activity um patterns amongst brain regions like two um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.07,
    "end": 2017.491,
    "text": " systems that have an oscillatory repressive consequence on each other a repressilator that will have this kind of winnerless competition dynamic so um this is just a classic dynamical system and in the spm textbook the lock of volterra is used to describe these winnerless competitions neural darwinist dynamics um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.298,
    "end": 2047.495,
    "text": " these three traces plant herbivore and carnivore you can think of them as like in this graph like a plot happening through time or you could imagine a cube with like the x the y and the z axis being plant herbivore carnivore dynamics and so this system can be represented as three traces along the x-axis here or you can imagine it as like a movement in a three-dimensional cube",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.593,
    "end": 2052.381,
    "text": " And so if it was spending a lot of time up in this corner, you can think about what that would mean and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.223,
    "end": 2064.843,
    "text": "And then on that cube, just like the Gödel, Escher, Bach book cover, you can project from the three-dimensional cube down to a two-dimension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.883,
    "end": 2068.028,
    "text": "And that would be like putting a camera on one side of the cube and just taking a picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.79,
    "end": 2072.436,
    "text": "So here we're looking at the herbivore by plant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.361,
    "end": 2103.148,
    "text": " um projection of the cube and it has this kind of oscillatory cycle here it's approximately periodic because there's this dampening but you could design a system that has different behaviors now the lock of Volterra is going to be applied in a few different active inference contexts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.647,
    "end": 2111.375,
    "text": " The first is in the eye blink conditioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.476,
    "end": 2116.441,
    "text": "And so this is conditioned stimulus and unconditioned stimulus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.382,
    "end": 2133.321,
    "text": "So this is kind of like a classical Skinnerian behaviorist paradigm of behavior, action, blinking associated with conditioned and unconditioned stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.786,
    "end": 2137.512,
    "text": " using this dynamical systems framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.933,
    "end": 2143.084,
    "text": "Whereas in the discrete time, we'd have, okay, time step one, do we get this stimulus or that stimulus or neither?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.124,
    "end": 2145.549,
    "text": "And then what do we do and how do we make the decision?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.569,
    "end": 2147.152,
    "text": "And then the next time step, this happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.994,
    "end": 2154.027,
    "text": "All of that is happening in this kind of continuous unfolding winnerless competition setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.327,
    "end": 2157.151,
    "text": " So that's the first example on the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.832,
    "end": 2159.134,
    "text": "That's the blink.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.154,
    "end": 2164.843,
    "text": "The unconditioned stimulus produces a blink that's a learned association.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.365,
    "end": 2179.305,
    "text": "And the right example, which also listen to Thomas Parr's Bookstream 2.1 when he gives a little more of the history, or we...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.053,
    "end": 2185.596,
    "text": " We have a few in the Thomas Parr 227 page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.618,
    "end": 2198.687,
    "text": "He gave some great history here talking about how the generalized filtering and continuous state space approach was early on being the most developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.827,
    "end": 2204.552,
    "text": "People started wanting to get sequential dynamics, so they developed the kind of model that we're going to see right here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.313,
    "end": 2207.855,
    "text": "Like here, this is like sequential writing dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.035,
    "end": 2211.638,
    "text": "Clearly, there's a repetitive motif that's being repeated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.753,
    "end": 2231.331,
    "text": " sequentially but then the desire to explicitly sequentially encode beliefs and to engage in explicit planning as inference motivated the work in discrete state space models where planning as inference is a more natural fit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.745,
    "end": 2259.276,
    "text": " of course by the end of the chapter we're going to be kind of merging these two different kinds of models together but here's an example of Locke-Volterra dynamical systems dynamics in a handwriting setting so it's kind of like a sequence of points that are being targeted and driven through sequentially by hand",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.8,
    "end": 2291.372,
    "text": " short box 8.2 on learning in continuous models slightly technical note perhaps um Sanjeev's textbook will clarify some of these pieces um however using Laplace approximation so a quadratic approximator",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.483,
    "end": 2309.35,
    "text": " We're able to use integrals on continuous distributions to specify the attention weighted evidence great gradients, but this is just kind of little encapsulated box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.913,
    "end": 2311.133,
    "text": "Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.673,
    "end": 2319.661,
    "text": " I just wanted to mention a small typo in box 8.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2320.642,
    "end": 2331.118,
    "text": "So the third line in the second block of equations should be minus ds mu theta.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2331.759,
    "end": 2339.651,
    "text": "So yeah, minus in front of d, I suppose, should be added.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.713,
    "end": 2341.033,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.314,
    "end": 2341.934,
    "text": "Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.954,
    "end": 2342.976,
    "text": "Glad that we have this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.34,
    "end": 2344.741,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.301,
    "end": 2347.444,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.724,
    "end": 2350.949,
    "text": "Now we're going to move into a second class.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.969,
    "end": 2356.436,
    "text": "So just like the first, we saw like the simple point attractor and then the Hooke's law attractor, spring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.818,
    "end": 2365.207,
    "text": "Now in this dynamical setting, we're going to have kind of two levels of sophistication of dynamical systems models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.688,
    "end": 2369.453,
    "text": "The first one was the generalized Locke-Volterra system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.534,
    "end": 2378.884,
    "text": " The second one is the Lorenz system, or Lorenz attractor, which is a canonical example of a complex or of a chaotic system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.445,
    "end": 2384.09,
    "text": "And it's a super fascinating story with Lorenz and his work in weather prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.67,
    "end": 2394.681,
    "text": "And that was, of course, one of the most important moments of the complexity and the computational chaos research of the last hundred years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.778,
    "end": 2415.506,
    "text": " This is also explored a lot more in live stream 34 on Markov blankets and stochastic chaos, I believe, where solitary and coupled Lorenz attractors are modeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.427,
    "end": 2418.07,
    "text": "It's a super fascinating work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.429,
    "end": 2447.466,
    "text": " um generalized synchrony is going to be unpacked in the setting of birdsong which was a friston frith paper maybe one slightly earlier than this but the 2015 is kind of the classic citation and this is seen as a kind of exemplar of multi-agent inference problems when they are quote singing from the same hymn sheet as Carl always says",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.589,
    "end": 2467.857,
    "text": " And so the birdsong attractor is going to leverage the Lorenz attractor described above, and there's going to be two Lorenz attractors coupled through communication reflecting birdsong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.199,
    "end": 2477.031,
    "text": "And some details of those attractors are going to be described and simulated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.922,
    "end": 2488.019,
    "text": " And the kind of big takeaway here is that the generalized synchrony is accomplished through communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.04,
    "end": 2494.209,
    "text": "So here we have the first and the second bird on the X and on the Y axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.671,
    "end": 2502.883,
    "text": "We can think about this line, Y equals X line, as being a manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.42,
    "end": 2523.657,
    "text": " that would reflect perfect synchrony so if you could describe movement on this two-dimensional plane by appealing only to movement along a single line you would have reduced a two-dimensional setting into a one-dimensional setting and that's like a dimensional reduction and that's called a statistical manifold",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.493,
    "end": 2549.188,
    "text": " Before learning, while there is overall adherence towards this Y equals X line, we see that after learning, the manifold, the behavior is tightened immensely around the manifold that represents the learning to synchronize between these two birds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.02,
    "end": 2577.876,
    "text": " the two birds joint trajectories confined to an almost one-dimensional subspace indicating synchronization also it's kind of a cool nod to fractal dimensions like if it was perfectly on this line you'd only need one dimension if it was purely covering the whole 2D space you would need two dimensions so then you can think about this as being slightly higher than one dimensional",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.8,
    "end": 2608.285,
    "text": " this connects back to the earlier attention and attenuation and this alternation of listening and singing it's kind of like now this is not all communicative settings and there's more work on communications but it's kind of a fun Paradigm we're basically like the bird expects there to be singing both birds expect there to be singing it's like you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.26,
    "end": 2612.926,
    "text": " Insert your favorite cultural singing moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.688,
    "end": 2618.935,
    "text": "If you're going to sing, my preferences will be fulfilled through perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.836,
    "end": 2623.702,
    "text": "And if I'm going to sing, my preferences are going to be fulfilled through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.004,
    "end": 2634.898,
    "text": "Fulfilling my preferences through action is going to reduce my sensory attention to perception until eventually it's like, whoa, I'm not sure what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2634.919,
    "end": 2636.601,
    "text": "I'm going to stop singing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.733,
    "end": 2662.707,
    "text": " and then in that silence the other birds can go oh my preferences were being fulfilled by listening attentively I'm not hearing it anymore I better reduce this discrepancy by taking action because listening harder isn't going to help because that's not going to make the song happen and so that's singing from the same hymn sheet like Carl says um and it relates to um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.699,
    "end": 2670.789,
    "text": " Joint, you know, shared regimes of expectation and joint perception, action, and multi-agent systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.532,
    "end": 2675.696,
    "text": "And the generalized synchrony doesn't mean lockstep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.237,
    "end": 2681.405,
    "text": "Generalized synchrony doesn't mean both birds are singing identically and then they're both silent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.087,
    "end": 2691.9,
    "text": "Generalized synchrony means that there's mutual information between these two coupled systems and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2691.982,
    "end": 2697.534,
    "text": " such that there is an information geometric manifold that represents their joint movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.336,
    "end": 2704.148,
    "text": "But it doesn't have to be a lockstep, same behavior at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.89,
    "end": 2708.337,
    "text": "Turn-taking is also an example of generalized synchrony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.632,
    "end": 2717.964,
    "text": " 8.5 gets to hybrid, discrete, and continuous models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2718.786,
    "end": 2720.19,
    "text": "So here we see a nested model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.732,
    "end": 2724.141,
    "text": "There's a line that's supposed to be between pi and g, obviously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.124,
    "end": 2729.295,
    "text": "And in the top level, we see the discrete time generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.275,
    "end": 2731.359,
    "text": " T minus one, T and T plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.76,
    "end": 2749.596,
    "text": "We see all the letters that we know and love from chapter seven, A, B, D. But then within each time step of the higher order model, we see the continuous time model with the generalized coordinates of motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.01,
    "end": 2779.195,
    "text": " And so this was unpacked in Livestream 46, active inference does not contradict folk psychology, where the top level was called decision active inference, or DAI, and the bottom was called motor active inference, or MAI, because somebody can think about the discrete decision-making on the top can be like, am I going to raise my left hand or raise my right hand?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.428,
    "end": 2801.908,
    "text": " that's a discrete decision there's no need to um make it an uh um analog but then with the descending command that it's going to be okay raise my right hand then we can engage that whole motor fixed point apparatus of the continuous time model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.175,
    "end": 2810.422,
    "text": " whether we do it with a Lock of Volterra or Lorenz Attractor or the Hook's Law or just a simple point attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.064,
    "end": 2815.257,
    "text": "So all the kind of continuous time tools that we saw earlier in the chapter,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.388,
    "end": 2833.127,
    "text": " we can deploy in the setting of a nested model with a discrete time decision maker on top and a continuous time on the bottom, which may articulate better with the seemingly analog nature of perception and action in the last mile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.515,
    "end": 2857.944,
    "text": " This is a little bit of machinery that helps map between the discrete selection of target locations into the continuous setting where those target locations can be realized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.947,
    "end": 2864.835,
    "text": "And an example of this is using an isocate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.22,
    "end": 2874.774,
    "text": " where there's a discrete movement of a target location followed by a continuous time trajectory of the eye circuiting to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.701,
    "end": 2891.599,
    "text": "Box 8.3, again, raises just some sort of super curt analysis of a sophisticated topic, which is a Gaussian mixture model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.254,
    "end": 2903.968,
    "text": " And like we know the calcium we love the calcium and we know we contractively optimize it and so on and so on, it does an incredible job of approximating distributions that have a central mass tendency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2905.872,
    "end": 2915.782,
    "text": " a lot of statistical tools work incredibly for Gaussian, but of course not all Gaussians are going to describe given complex distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.442,
    "end": 2931.897,
    "text": "But the good news, whether you approach this from a Gaussian mixture model or a hierarchical Gaussian filter or just generalized filtering, is that it turns out that through composition of Gaussians, you can build complex distributions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.113,
    "end": 2956.163,
    "text": " that have almost arbitrary characteristics so that's kind of a way to get like the attractability of gaussians but also for example make a bimodal distribution or a trimodal distribution this engages the challenge of Bayesian model reduction Bayesian model selection structure learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.995,
    "end": 2981.982,
    "text": " table 8.1 closes with some um discussion of continuous time model Advances and that ends the relatively short but pretty dense chapter eight does anyone yeah Olivier",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.37,
    "end": 2987.394,
    "text": " Yeah, I have a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.414,
    "end": 3000.139,
    "text": "I'm not sure I can formulate it well, but the thing is, when we think in terms of discrete time model, usually we think in terms of regular time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.081,
    "end": 3023.806,
    "text": " And with this mixed continuous and discrete time model, is that possible to model a behavior in continuous time and to have the discrete time step to arrive at different, I would say, after different duration within the continuous time model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.527,
    "end": 3030.514,
    "text": "When you reach a criterion in the continuous time model, you get to a next step at the top level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3032.114,
    "end": 3039.206,
    "text": " Okay, just one thought on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.306,
    "end": 3047.44,
    "text": "Are you referring to a model where the discrete time steps are actually inhomogeneous?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.791,
    "end": 3052.158,
    "text": " Yeah, so no regular in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.219,
    "end": 3060.793,
    "text": "So for example, you will imagine a search task happening in continuous time and you reach a criterion at some point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3061.515,
    "end": 3066.203,
    "text": "And depending on the steps, you can reach that earlier or later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.044,
    "end": 3069.889,
    "text": "But when you reach this criterion, you jump at the top level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.231,
    "end": 3073.495,
    "text": "So you make your decision and you jump at the top level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.896,
    "end": 3105.709,
    "text": " yes so one interesting question is how could that logic be encoded into the generative model another way to view that setting would be you'd have a generative model um that does have like a real um regular um chronology but then you're modeling samples potentially like plus on distributed samples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.145,
    "end": 3131.089,
    "text": " from a regular continuous or discrete timeline so the Delta T of the samples is not necessarily homogeneous but the underlying substrate of the model would be so observations are not coming in regularly actions are potentially not being taken regularly but there is a clock that has regularity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.723,
    "end": 3138.029,
    "text": " That would be the sort of sampling-based approach to dealing with this time heterogeneity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.25,
    "end": 3160.053,
    "text": "Then the other approach would be somehow to figure out through composition of discrete and or continuous models, can you encode a temporal logic when this condition is met, then this happens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.393,
    "end": 3162.055,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.789,
    "end": 3194.877,
    "text": " yeah yeah it's an interesting area and i mean this this uh folk psychological or just nested um hybrid model i mean this is just a hint and so it would be really awesome i think to see the the the matlab or the other code implementations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.924,
    "end": 3197.588,
    "text": " So we could do, okay, now let's do, this is a two by two matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.469,
    "end": 3201.453,
    "text": "And this one is that, um, spring attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.134,
    "end": 3202.415,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.435,
    "end": 3205.859,
    "text": "Now this is a three by three matrix and this one's the lock of Volterra.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.32,
    "end": 3222.583,
    "text": "I think that if we could, um, unroll those systems a little bit, um, more clearly, I, I think we'd have some really, um, illustrative dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.603,
    "end": 3222.703,
    "text": "Okay."
  },
  {
    "start": 3223.257,
    "end": 3224.058,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.078,
    "end": 3227.982,
    "text": "Well, next week, we will return for a second discussion on Chapter 8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.883,
    "end": 3235.771,
    "text": "We'll just go straight to the questions, and Ali, I think we'll be ready to do our Chapter 8 review when the time is right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.193,
    "end": 3238.634,
    "text": "Sure, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.654,
    "end": 3239.655,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.675,
    "end": 3240.176,
    "text": "Thank you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.337,
    "end": 3242.018,
    "text": "See you next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.66,
    "end": 3244.281,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3245.122,
    "end": 3245.282,
    "text": "Goodbye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3245.302,
    "end": 3245.502,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  }
]