[
  {
    "start": 6.394,
    "end": 7.015,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.516,
    "end": 9.297,
    "text": "I think we are live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.817,
    "end": 11.919,
    "text": "This is Active Inference Livestream 13.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.959,
    "end": 12.76,
    "text": "It is January 3rd, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.8,
    "end": 16.143,
    "text": "Welcome to the Active Inference Lab, everyone, new and old listeners.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.15,
    "end": 29.354,
    "text": " We are an experiment in online team communication, learning, and practice related to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.014,
    "end": 38.42,
    "text": "You can find us at our website, on Twitter, our email address, YouTube page, or Keybase public team and username.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.861,
    "end": 46.788,
    "text": " This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work in the live chat or in comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.688,
    "end": 50.151,
    "text": "And all backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.751,
    "end": 57.217,
    "text": "Video etiquette for livestream, mute if there's noise in the background, raise your hand so we can hear from everyone, and use respectful speech behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.218,
    "end": 61.019,
    "text": " So happy 2021, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.939,
    "end": 68.961,
    "text": "For the scheduled Active Inference live streams in 2021, we're going to do every single Tuesday from 7 to 9 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.061,
    "end": 71.862,
    "text": "Pacific time, which will include daylight savings time changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.782,
    "end": 77.784,
    "text": "And for schedule and participation instructions, just go to this shortened link here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.664,
    "end": 106.18,
    "text": " also we're going to do several special sessions for example coding sessions or discussions with external people from the other communities and just if you have an idea for an event that you think could be interesting or you would like to moderate or just suggest you can let us know or you can send a tweet and tag that person if you know them and then we can set it up but the regular active inference live streams the group plan discussions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.14,
    "end": 129.515,
    "text": " are at again that shortened link and it has instructions for how to let us know you want to participate in any of these events and the first two weeks of january so these next two weeks we are going to be in uh reading this paper by adam saffron and colin de young and then you can see whatever papers are most updated for the next several months at that link",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.633,
    "end": 144.264,
    "text": " Today in Active Inference Livestream 13.0, the goal is really to set context for 13.1 and 13.2, so kind of like a read-along for the paper if you want to participate in the discussion or if you want more context on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.248,
    "end": 157.254,
    "text": " And the paper is Integrating Cybernetic Big Five Theory with a Free Energy Principle, A New Strategy for Modeling Personalities as Complex Systems by Saffron and DeYoung on October 16th, 2020 at this SciArchive link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.254,
    "end": 163.437,
    "text": "And the video, just like all the point zeros are, is just an introduction to the ideas and the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.497,
    "end": 164.798,
    "text": "It's not a review or a final work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.498,
    "end": 181.233,
    "text": " The punchline of the paper is that we can combine psychology with the cybernetic theories of CB5T, the Cybernetic Big Five Theory, which we'll discuss, and Free Energy Principle Active Inference to have a better understanding of psychobehavioral dynamics in humans and other systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.893,
    "end": 184.275,
    "text": "The sections of 13 will be as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.656,
    "end": 189.66,
    "text": "First will be the aims and claims of the paper, then the keywords abstract and roadmap,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.501,
    "end": 199.106,
    "text": " then go through the figures and the table, and then conclude with several questions that people can ask themselves, whatever level of familiarity they have with the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.986,
    "end": 208.011,
    "text": "So in 13.1 and 13.2, we're going to be discussing this paper as a group, so save and submit your questions and get in touch if you want to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.912,
    "end": 213.534,
    "text": "Okay, the paper is as said on the previous slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.094,
    "end": 218.277,
    "text": "The aims and claims of the paper in the author's words are, from the conclusion,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.769,
    "end": 234.278,
    "text": " We have begun to outline how artificial agents based upon free energy principle and active inference might be used to test cybernetic Big Five theories, theoretical propositions regarding the functional significance of the dimensions in the Big Five trait hierarchy, which is from psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.219,
    "end": 239.783,
    "text": " Here are the implications and why it matters from the author's conclusion as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.724,
    "end": 261.302,
    "text": "If deep correspondences can be found between CB5T and FEP AI, as we suggest is likely to be the case due to their common cybernetic foundations, then this integration may allow personality modelers to obtain new understanding with respect to functions and then to parlay that understanding of function into new hypotheses about mechanisms in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.263,
    "end": 280.28,
    "text": " And, finally, identifying the configurations of personality mechanisms that correspond to effective cybernetic function may yield insights into how personality imbalances can lead to mental disorders, thereby furthering the aims of computational psychiatry and other attempts at developing theories of human mental health and well-being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.821,
    "end": 285.545,
    "text": "So that is what they have set out to do, and by the conclusion, that's where they want to have gotten.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.366,
    "end": 292.808,
    "text": " And these .zero videos are meant to be a sort of bi-directional on and off ramp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.068,
    "end": 298.81,
    "text": "For those in the Active Inference community, it's a chance to see the fields that Active Inference is adjacent to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.17,
    "end": 301.871,
    "text": "And for those who might be learning about Active Inference for even the first time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.711,
    "end": 318.283,
    "text": " it could still possibly be a way to learn about this broad area from wherever you are as far as familiarity with these keywords, which include active inference and the free energy principle, but also generative models, cybernetics and the cybernetic big five theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.323,
    "end": 319.984,
    "text": "And then there's a few related keywords as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.805,
    "end": 350.085,
    "text": " so first active inference and i uh got some interesting feedback and just thought about it over the new year and i think it's a great exercise to always start with just what active inference is just like how evolutionary biology which is in the area i'm in often talks will begin with the principles of natural selection because they're then going to be demonstrated in the subsequent sections so even just having a high level summarization allows an individual to personalize their approach to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.845,
    "end": 362.433,
    "text": " portraying what active inference is in the context of a specific system or question, just like an evolutionary biologist doesn't need to re-justify all of natural selection, they just draw upon those principles and outlines and then apply them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.374,
    "end": 367.456,
    "text": "I'm going to start with active inference in the words of the author whose paper we're reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.097,
    "end": 375.522,
    "text": "And they wrote, work within the free energy principle paradigm has yielded a normative model of behavior called active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.718,
    "end": 384.703,
    "text": " The active inference framework describes processes by which free energy is minimized and provides close ties to other frameworks such as expected utility theory and risk sensitive control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 385.583,
    "end": 396.35,
    "text": "Further, advances in deep reinforcement learning appear to be converging on the kinds of solutions that are predicted to be necessary for bounded optimal decision-making and learning in the free energy principle and active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.444,
    "end": 426.31,
    "text": " and another quotation that they have about active inference is the development of the active inference framework has made connections between free energy principle and cybernetics more obvious as it highlights that organisms are motivated not only to predict their perceptions accurately but also to influence states of the world in order to ensure that perceptions correspond to goal attainment so that's two really nice quotes on active inference from the authors and here's just a way that i kind of laid it out here maybe we can even try",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.23,
    "end": 430.471,
    "text": " a new one every single time, or something similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.611,
    "end": 442.954,
    "text": "Active inference is a framework, which means that it's a cluster of scientific theories, which are ideas that make specific testable predictions, hypotheses about the world, that's a theory, and tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.294,
    "end": 448.015,
    "text": "So that includes software toolkits and vocabularies and shared narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.195,
    "end": 448.895,
    "text": "So it's a framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.275,
    "end": 456.117,
    "text": "It's beyond just a single hypothesis, but there are important hypotheses that are more or less central to what it says in specific cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.475,
    "end": 460.076,
    "text": " It's a framework that integrates action and perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.757,
    "end": 463.919,
    "text": "So action is whatever the behavior of the system of interest is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.939,
    "end": 478.066,
    "text": "So if we're talking about a certain bacterial possibility and affordance that a bacteria can undertake, then we're talking about action being our measurement of something that's, for example, moving or being secreted in the world or emitted from a hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.687,
    "end": 485.651,
    "text": "And perception is sort of the obverse of action in some way, and it relates to the sensory capacity of the system of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.471,
    "end": 515.483,
    "text": " and as we've talked about in other discussions there's something like a interface being defined with the organism and the environment so that's how we're integrating internalism and externalism reductionism and holism all these things are coming together because by defining the interface that one is studying the blanket of some type you're at the same time delimiting the system from the external part so you're not assuming that there's another level of boundedness like a closed system beyond the refrigerator and the kitchen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.303,
    "end": 538.45,
    "text": " you can now just model it as your inference on a certain boundedness given the measurements and the structure of the system little digression it integrates action and perception downstream of the free energy principle free energy principle is a statistical physics approach to modeling complex multi-scale systems so it uses several different threads of physics and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.17,
    "end": 554.221,
    "text": " For those who are just learning about it, there are a lot better resources than here to hear specifically about the mathematical details in this discussion, but we hope to be able to provide easy entry points for this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.521,
    "end": 576.524,
    "text": " aspect of the discussion as well and it's about how far from equilibrium systems work so things that are passive like let's just say a cloud of gas accreting in some galaxy somewhere it can appeal to just gravitational forces to describe the dynamics through time however there are systems whose dynamics through time like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.105,
    "end": 581.749,
    "text": " organisms, their dynamics through time do not resemble that of passive bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.869,
    "end": 583.41,
    "text": "And so there's these active systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.85,
    "end": 590.315,
    "text": "And what is it that these active systems, these negantropic systems, organization in the world, how is this happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.555,
    "end": 591.076,
    "text": "What is life?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.556,
    "end": 592.697,
    "text": "That's where that element comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.297,
    "end": 595.999,
    "text": "But those are the systems that we want to understand, design, predict, and control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.159,
    "end": 602.624,
    "text": "So active inference is a framework that integrates action and perception downstream of the free energy principle to explain how far from equilibrium systems work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.445,
    "end": 604.626,
    "text": "What about generative models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.297,
    "end": 608.64,
    "text": " Generative models can be contrasted with descriptive models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.96,
    "end": 618.49,
    "text": "Descriptive models go from data, which are observations about the world, or results of an experiment, and go from data to then the modeling of parameters about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.991,
    "end": 624.576,
    "text": "So given the height of these 50 children, what is the mean and the variance of height in the classroom?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.137,
    "end": 630.221,
    "text": " And so statistics can be seen as a specific kind of dimensional reduction about measurements in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.661,
    "end": 632.703,
    "text": "For example, you have 50 measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.883,
    "end": 634.284,
    "text": "That's a 50 dimensional vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.724,
    "end": 638.427,
    "text": "And then it's being reduced onto a mean and a variance component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.567,
    "end": 639.328,
    "text": "So two numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.408,
    "end": 641.79,
    "text": "It's like a bottleneck that only two numbers get to pass through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.25,
    "end": 643.471,
    "text": "So it's a dimensional reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.551,
    "end": 647.614,
    "text": "And then you hope that those dimensions capture the average variance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.914,
    "end": 662.246,
    "text": " uh value of the trait or whatever and the variability so that's going from data to the model dimensional reduction generative models go the other direction which is from the model's parameters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.007,
    "end": 665.749,
    "text": " for example, the mean and the variance, to the expected data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.189,
    "end": 672.174,
    "text": "Given a mean and a variance estimate for height, the two numbers, can we generate sets of predicted measurements that are consistent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.554,
    "end": 675.416,
    "text": "So generate a draw of 50 children.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.817,
    "end": 688.826,
    "text": "And so even if it's 51, it's going to be just changing it a little bit, and the average is going to recapitulate those two numbers, but it's going to be possible to generate hundreds or thousands or counterfactual worlds given this generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.967,
    "end": 700.363,
    "text": " Generative models are useful for statisticians for a lot of the same, but also some of the different reasons that they're different or that they're useful for organisms to have generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.803,
    "end": 704.829,
    "text": "So here's some of the similarities is that in both the statistician and the organismal case,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.45,
    "end": 717.672,
    "text": " it allows the system to use a lot of its previous knowledge on sparse data sets, because generative models might only need a slight cue to tip their likelihood from something being very unlikely to totally likely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.792,
    "end": 727.074,
    "text": "For example, hearing the sound of an ambulance outside your window means that it's extremely likely that there is an ambulance there, even though it's also possible that there's one at other times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.254,
    "end": 728.355,
    "text": "It makes it extremely likely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.931,
    "end": 742.118,
    "text": " And one kind of model that's used that's a generative model in a way just to understand without the control theory, without the cybernetics, how a generative model is useful statistically is what's called expectation maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.819,
    "end": 745.401,
    "text": "And this cycle, expectation maximization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.201,
    "end": 754.267,
    "text": " The data or initial estimates are input into what can be thought of as one layer of the model, which is just the estimator of the observed data parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.928,
    "end": 759.651,
    "text": "And parameter is just, in the computational sense, any single variable that's going to be stored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.671,
    "end": 760.992,
    "text": "So these are the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.032,
    "end": 763.974,
    "text": "This is the actual 50 children and their heights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.515,
    "end": 772.401,
    "text": "And then there's a maximization step, which asks what is the maximum likelihood of those underlying hidden parameters, which can be a different dimension than this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.041,
    "end": 786.05,
    "text": " And then there's a generation step, which is the expectation step, which data are expected or expectable, I guess, I don't think that's a word, but that's kind of it, given the hidden parameters that are in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.55,
    "end": 789.552,
    "text": "And so this can continue until it converges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.353,
    "end": 796.437,
    "text": "And this could be about static things in the world, or it could be about dynamic things in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.017,
    "end": 802.421,
    "text": "And the expectation maximization could also be on causal things in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.261,
    "end": 816.886,
    "text": " And when that inference is going to be about action, that's where action enters into the loop, because instead of just having a data set and trying to converge on the best descriptor, it's trying to converge on a policy that could involve hidden aspects of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.326,
    "end": 832.272,
    "text": "So let's go a little bit more into detail in this generative models and processes, generative models and generative processes and active inference idea, because I don't think this person's blog has been on here, Solopchuk, tutorial on active inference, some really nice images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.012,
    "end": 856.222,
    "text": " So here on the left is this idea that a generative process which has a true hidden state s is emitting observations which are modeled by some p function but its observations are being emitted from the world and the niche is really the generative process that leads to those observations like the sky emits the sun and the moon or the ecology emits this rainfall or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.475,
    "end": 866.523,
    "text": " Then on the other side of the blanket, we have the organism, which is embodying and enacting a generative model of those observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.164,
    "end": 871.328,
    "text": "So that's like your brain predicting what the retina would see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.848,
    "end": 875.371,
    "text": "Well, how do we know that the brain is predicting what we would see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.451,
    "end": 876.332,
    "text": "There's no blind spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.792,
    "end": 882.297,
    "text": "It has usual, under healthy conditions, equal clarity everywhere and equal color vision everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.158,
    "end": 888.579,
    "text": " And that's just not concordant with the actual distribution of cells on the retina.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.999,
    "end": 899.922,
    "text": "So really, it's like upgraded resolution at your periphery that's an illusion based upon the generation of the assumption that things are actually equally clear outside of your perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.982,
    "end": 904.383,
    "text": "So it doesn't have the same actual experienced...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.052,
    "end": 908.434,
    "text": " characteristics as what you'd expect in the retina.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.694,
    "end": 911.836,
    "text": "Just, you know, interesting things, and you can imagine that for other senses too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.396,
    "end": 922.203,
    "text": "So the organism's enacting this generative model of those observations, and then the surprise or the residual of those predictions is kind of getting passed upwards into these models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.583,
    "end": 927.046,
    "text": "And that's changing how the model of the organism in this Bayesian framework here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.701,
    "end": 931.824,
    "text": " is modeling these observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.144,
    "end": 938.79,
    "text": "So the organism has a generative model or is a generative model, depending on how you think about it, of the niche, which is what facilitates action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.15,
    "end": 951.881,
    "text": "If your model of the circadian rhythm is 18 hours and it's 24 hours for the real thing to happen, then your niche, your temporal modeling is off and it's going to be pathological and maladaptive, or potentially not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.141,
    "end": 954.103,
    "text": "That's where selection comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.771,
    "end": 969.037,
    "text": " So here's another representation from that same blog that shows how now from that inference process described here, where the organism has a generative model of inference on those observations in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.377,
    "end": 974.939,
    "text": "So I'm predicting what observations on Bitcoin price I'm going to see emitted by the true generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.959,
    "end": 978.161,
    "text": "Now, I don't know what the generative model is, but I can see the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.309,
    "end": 982.59,
    "text": " The organism has preferences for certain observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.87,
    "end": 986.971,
    "text": "So here the darker circle is representing preferable observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.531,
    "end": 991.972,
    "text": "So the observations in this case are interoceptive, which is really nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.133,
    "end": 1001.735,
    "text": "And the organism has a preference for, let's just say in this categorical example, one outcome of the observations over the other, the gray one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.677,
    "end": 1015.644,
    "text": " And now we can make a 2x2 matrix with the two possible observations of the world with a preference over them and the state of the world which can't be directly perceived, which is whether the stomach is empty or full.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.884,
    "end": 1020.827,
    "text": "This isn't a physiological debate, it's just that's the simple case here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.667,
    "end": 1027.551,
    "text": "And that relies on this A matrix, which is the probability of observations of the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.51,
    "end": 1033.633,
    "text": " which is the data given the states which can't be directly experienced, which is the stomach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.153,
    "end": 1034.913,
    "text": "That's the A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.754,
    "end": 1046.399,
    "text": "Then the B matrix maps a policy and the prior states to the way in which the hidden states are expected to change through time, and you can evaluate it for different Bs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.88,
    "end": 1050.782,
    "text": "So here there's two possible U's, which are policies, eat,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.809,
    "end": 1052.369,
    "text": " or do nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.289,
    "end": 1068.833,
    "text": "So under each policy, eating or doing nothing, which are represented by two different matrices, B1 and B2, the state at time t is like the current moment, and the state at time t plus one is the state at the next moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.513,
    "end": 1072.754,
    "text": "So there can be mappings between the present and the future",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.008,
    "end": 1087.286,
    "text": " conditioned on policy that's the probability basically of the state uh right now given the state in the past and a policy so that's phrased from like past to now and this is about now to the next step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.151,
    "end": 1092.613,
    "text": " And here is the graphical representation through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.693,
    "end": 1096.436,
    "text": "So t minus one is the past, t is the present moment, and t plus one is the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.136,
    "end": 1113.067,
    "text": "So the actual state of the world is evolving under a certain dynamic, and it's emitting observations, and then under multiple possible policy trajectories, policy parameters or different policies that can be enacted and embodied,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.068,
    "end": 1142.366,
    "text": " what is being estimated is this relationship from how previous states of the policy influenced or were associated with this true state of the role of the current moment in this layout and how that observation then influences the updating of the policies in relative comparison for the current moment moving forward under a generative model of action in the niche by the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.126,
    "end": 1144.426,
    "text": " All right, big five, psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.307,
    "end": 1155.749,
    "text": "So the big five are dimensions of variation that are statistical and usually from self-reported surveys that are based upon basically personality differences in the population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.509,
    "end": 1162.671,
    "text": "So it's a dimension of variability in populations, kind of like the trait of heritability from quantitative genetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.331,
    "end": 1166.574,
    "text": " So it's a measure of variance explained on a certain population sample.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.894,
    "end": 1174.201,
    "text": "It's not a causal model of traits, nor is it a fraction due to genetic causes, even though that fallacy is made throughout the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.182,
    "end": 1186.292,
    "text": "So the Big Five is based upon the use of statistical methods, basically correlation matrices and principal component analyses, on survey data that finds patterns across questions and participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1186.812,
    "end": 1189.455,
    "text": "And the acronym for Big Five is OCEAN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.546,
    "end": 1195.791,
    "text": " So here's an example of how the big five are calculated and then what the oceans stand for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.512,
    "end": 1203.9,
    "text": "So what will happen will be that a bunch of participants are asked a survey or are scored through some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.601,
    "end": 1208.545,
    "text": "And this survey may have a hundred questions or a certain different number of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.005,
    "end": 1212.748,
    "text": " And that corresponds to a hundred dimensions of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.049,
    "end": 1215.171,
    "text": "It's an a hundred dimensional vector per person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.611,
    "end": 1224.319,
    "text": "So the total survey study design can be just the columns are the people and the rows are the questions and how they answered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.659,
    "end": 1229.803,
    "text": "And so that's a simple matrix that can be given all the data of that entire survey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.624,
    "end": 1235.208,
    "text": "And some statistical techniques are used on that matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.329,
    "end": 1257.462,
    "text": " and like a principal component analysis and it according to the psychology literature falls out into these five large axes of variation so when we do the pca the algorithm is not told specifically which questions are expected to be correlated with or negatively or positively with other questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.479,
    "end": 1282.137,
    "text": " But because there are actual statistical regularities in certain pairs of questions or sets of questions in the real world in terms of how people answer things, for example, a question and its negation should have a negative correlation, as well as other relationships in the world, it's possible to find the structure of some of these dimensions that map very well on these dimensions of variability in the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.897,
    "end": 1286.22,
    "text": "And so the five big axes of variation are openness to experience,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.29,
    "end": 1313.473,
    "text": " the axis between inventive and curious versus consistent cautiousness conscientiousness extroversion agreeableness and neuroticism or ocean and uh i uh hesitate to go too much into the adjective side because those are always very english language dependent and really it's about the structure of the data in the real observations and here's just a few other issues with uh the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.81,
    "end": 1338.969,
    "text": " topic of big five which is that there's often population and survey specific covariance structures though some structures are quite well correlated across different surveys there's often a normative or a culturally narrow understanding of what personality is or how it manifests and how it represents itself and also there's just this fundamental difficulty in attaching the natural language words to these differences in the manifold",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.389,
    "end": 1348.295,
    "text": " One way though that we can kind of get at what these dimensions really are is by looking at the questions that are very highly correlated with each of these axes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.515,
    "end": 1353.119,
    "text": "So for openness, a few questions, I drew three questions from each of the letters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.959,
    "end": 1355.921,
    "text": "Is I'm quick to understand things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.261,
    "end": 1357.562,
    "text": "I like to try new things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.742,
    "end": 1358.723,
    "text": "I have a good imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.483,
    "end": 1386.234,
    "text": " c conscientiousness is i'm always prepared i pay attention to details i like order extraversion e is i am the life of the party i feel comfortable around people i start conversations a agreeableness is i take time out for others i feel others emotions i make people feel at ease neuroticism n is i get upset easily i have frequent mood swings and i worry about things such as in my life and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.185,
    "end": 1393.631,
    "text": " One interesting note on this paper and definitely a little fun fact is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.683,
    "end": 1403.328,
    "text": " one can do a vector decomposition on the big five to reveal these additional aspects of personality beyond those five principal structurings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.368,
    "end": 1411.293,
    "text": "That's a coarse graining to a very high degree, and this is going to go one layer chiseling down into the statistical variability structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.934,
    "end": 1421.2,
    "text": "And this paper, I was searching in my library for it because I thought it was an interesting one and I remembered it, and it turned out that it was actually the author of this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.96,
    "end": 1448.88,
    "text": " um from 13 14 years ago with jordan peterson yes that jordan peterson and it draws somewhat on this idea of vector decomposition but statistical vector decomposition and just as refresher uh two vectors can be added kind of head to tail and they end up at the same place no matter which way you add them just like regular numbers like two plus three equals five and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.7,
    "end": 1450.3,
    "text": " 3 plus 2 equals 5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.121,
    "end": 1457.164,
    "text": "So they took the five big dimensions and broke them down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.184,
    "end": 1462.567,
    "text": "The blue and the red arrows, the up and the down, they don't represent anything about the trait characteristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.587,
    "end": 1464.828,
    "text": "It's just using the same example of vector addition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.948,
    "end": 1472.632,
    "text": "It's breaking down a statistical dimension into another axis of variability, which is a pretty cool technique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.352,
    "end": 1483.864,
    "text": " And it's going to relate in the paper that we're going to discuss to the ways to get at very fine grained aspects of the high dimensional space that represents action propensities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.58,
    "end": 1494.344,
    "text": " Cybernetics is, it's not the first time we've had cybernetics as a keyword on the ACT-IMP stream, but each time we do want to kind of see it a little bit differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.964,
    "end": 1501.106,
    "text": "So the image on the left is a brain with a bunch of wires and kind of represents this crossover mind machine mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.206,
    "end": 1502.227,
    "text": "Is it an analogy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.347,
    "end": 1503.307,
    "text": "Is it an interface?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.928,
    "end": 1504.628,
    "text": "Is it a vision?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.508,
    "end": 1506.709,
    "text": " Is it a prophecy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.91,
    "end": 1511.293,
    "text": "All these different things that mind and machine can be is kind of captured in cybernetics culturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.353,
    "end": 1519.84,
    "text": "But also on the right side is a more formal systems diagram approach to cybernetics, which describes kind of first and second order cybernetic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.781,
    "end": 1524.384,
    "text": "And here is from this CyberSoft post down on the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.425,
    "end": 1547.17,
    "text": " um they wrote the basic idea of cybernetics is that complex systems such as living organisms societies and brains are self-regulated by the feedback of information by systematically analyzing the feedback mechanisms which regulate complex systems cybernetics hopes to discover the means of controlling these systems technologically and to develop the capability of synthesizing artificial systems with similar capacities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.83,
    "end": 1558.556,
    "text": " There's a few other parts about cybernetics that are interesting because it has had quite its own history and it's related to complex system study, but there's some interesting history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.576,
    "end": 1560.858,
    "text": "So here's a few more quotes from this article.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.877,
    "end": 1573.55,
    "text": " They write, the word cybernetics was coined by the MIT mathematician Norbert Wiener in the summer of 1947 to refer to the new science of command and control in animals and machines, which he helped to establish and develop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.071,
    "end": 1578.816,
    "text": "The word was derived from the Greek kubernetes, meaning steersman or ship pilot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.396,
    "end": 1583.08,
    "text": "Unknown to Wiener at the time, Plato had used the adjective kubernetes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.881,
    "end": 1586.323,
    "text": " in the Gorgias to refer to the science of piloting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.783,
    "end": 1596.309,
    "text": "And the French physicist Marie Ampere had derived the French word cybernetique directly from the Greek to refer to the science of government in his classification of sciences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.989,
    "end": 1602.892,
    "text": "And so the word cuber leads us straight to governor, the regulator, guide, and pilot of steam engines and states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.573,
    "end": 1611.798,
    "text": "It thus lies at a powerful metaphorical intersection of political economy and technology, social and material order, and the regulation of animals and machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.518,
    "end": 1625.464,
    "text": " And then another quotation that was pretty interesting from the end of this article was, When Donna Haraway challenged feminists and leftists to embrace the language and metaphysics of cybernetics, what was she aiming at?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.405,
    "end": 1629.126,
    "text": "Was the cyborg just another metaphor for hybridity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.846,
    "end": 1636.849,
    "text": "If it was, then why was she so insistent on adopting not only the terminology of cybernetics systems and information, but its whole ontology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.39,
    "end": 1638.85,
    "text": "No, this was not mere rhetoric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.331,
    "end": 1639.671,
    "text": "This was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.924,
    "end": 1644.985,
    "text": " This move was political, and it was savvy, wise, and insightful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.625,
    "end": 1650.147,
    "text": "For Haraway shows us it is not just the world, the environment, that is cybernetic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.547,
    "end": 1651.407,
    "text": "We are cybernetic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.847,
    "end": 1653.928,
    "text": "We are cyborgs, cybernetic organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.308,
    "end": 1657.389,
    "text": "We are hybrids made up of organic beings and mechanical parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.969,
    "end": 1662.671,
    "text": "And the only thing that ties us all together, you and me, you and other parts of you, is information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.151,
    "end": 1665.512,
    "text": "Fundamentally, cybernetics is a new ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.172,
    "end": 1669.173,
    "text": " Andy Pickering has called it an ontology of becoming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.193,
    "end": 1670.053,
    "text": "So pretty cool quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.051,
    "end": 1707.427,
    "text": " Cybernetic Big Five Theory, CB5T, is a line of research pursued by one of the co-authors of this paper, primarily Colin DeYoung, and it uses cybernetics, as the name might suggest, to integrate the dynamics of personality and get at potential mechanisms amongst other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.027,
    "end": 1711.25,
    "text": "And the highlights from the 2015 paper, which is cited in the 2020 paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.611,
    "end": 1717.334,
    "text": " They write, cybernetic Big Five theory is a new integrative theory of personality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.754,
    "end": 1721.257,
    "text": "Personality traits reflect parameters of evolved cybernetic mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.777,
    "end": 1728.141,
    "text": "Characteristic adaptations, which is a term from cybernetics, are goals, interpretations, and strategies in updatable memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.461,
    "end": 1731.643,
    "text": "Specific mechanisms are identified for traits in the Big Five hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.124,
    "end": 1736.867,
    "text": "Implications for pathophysiology, psychophysiology, and well-being are discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.288,
    "end": 1746.294,
    "text": " And this was a figure from the DeYoung 2015 paper, but it's actually drawn from Jordan Peterson's 1999 book, Maps of Meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.215,
    "end": 1760.584,
    "text": "And here's how it is in the book slash paper, where at any given state, there's the current state of the world and strategies are being implemented to attain desired states or goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.565,
    "end": 1766.349,
    "text": "Then anomalous information is always entering the picture from chaos, entropy, the unknown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.532,
    "end": 1776.797,
    "text": " At some point, the current state of the world, given the strategies and the desired goals, can no longer keep the integration process maintained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.437,
    "end": 1781.039,
    "text": "The center cannot hodl, and there's a disintegration process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.579,
    "end": 1785.281,
    "text": "That leads to a state of chaos and entropy in the unknown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.294,
    "end": 1793.717,
    "text": " followed by a reintegration, because you can only have a reintegration from disorder to order, you can only reintegrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.837,
    "end": 1799.86,
    "text": "Even if it's a very similar state, because it's still an accessible one, even if it's a similar one, it still is a reintegration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.32,
    "end": 1804.782,
    "text": "And if the world state has changed, that means the niche is different, which means the reintegration must be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.342,
    "end": 1812.848,
    "text": " So I thought it was kind of interesting to map this onto a few other ideas from Act-Inf and other things that we've talked about in the streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1813.428,
    "end": 1823.235,
    "text": "So first, there's the dividing line between order and disorder, which correlates to basically the blanket, the interface, the whole thing we're talking about with the self-organizational systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.736,
    "end": 1830.821,
    "text": "Because that boundary between the agent and the niche, again, is not just an informational one, it's also an info-thermodynamic one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.301,
    "end": 1834.022,
    "text": " So the agent is where organization is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.282,
    "end": 1841.425,
    "text": "For example, the person in their apartment is eating food and they're organizing biological matter, radiating heat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.485,
    "end": 1847.327,
    "text": "They could be getting more organized, making more organized tissue of any kind, depending on their hormonal state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.987,
    "end": 1853.469,
    "text": "And then depending on that, the room is going to be warming up and there's going to be heat released in the supply chain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.589,
    "end": 1856.51,
    "text": "So that's actually like a thermodynamic boundary as well as an information one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.21,
    "end": 1864.934,
    "text": " And we can think about these preferences over different observed outcomes of the world as being akin to goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.395,
    "end": 1870.878,
    "text": "Peterson's framework here is still very reward oriented rather than precision oriented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.918,
    "end": 1871.898,
    "text": "That does enter the picture here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.938,
    "end": 1872.679,
    "text": "We'll get to that in a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.399,
    "end": 1886.487,
    "text": " The strategy is like policies, which truly are strategies, and the current state of the world and the interpretation are like hidden state estimates, which could be like, is my career stable or will things be okay with this thing of the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.968,
    "end": 1902.298,
    "text": "So given current understandings of the world, which can be accurate or not, helpful or not, two by two, and given strategies being implemented, which is like the field of affordances and active inference, are organisms attaining their preferred states, their desired states of the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.198,
    "end": 1932.063,
    "text": " and in the framework of peterson as well as an active inference anomalous information is continually not just occasionally entering into the picture so it's always a question of resiliency and of self-organization around anomalous information being integrated because no model is going to be perfectly predicting it's about incorporating the variability into a healthy and resilient model and here it's like surprise being passed from the environment through the interface to the organism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.032,
    "end": 1954.392,
    "text": " and the organism can disintegrate and enter into potentially a pathological region or a strange attractor state that could reintegrate or re-stabilize in a new or a different niche into another different state policy preference combination and this encounter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.379,
    "end": 1972.712,
    "text": " with chaos which could be the dark night of the soul or the hero's journey or alchemy or phase transitions of the self that's an interesting thing to think about with the self-organization and the reorganization reintegration of societies cities teams relationships individuals",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.461,
    "end": 1983.087,
    "text": " Another thing that is mentioned in the paper, but it wasn't a keyword, was SPM, which is Statistical Parametric Mapping, SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.888,
    "end": 1986.53,
    "text": "So here's from the SPM website, whose URL is on the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.55,
    "end": 1999.56,
    "text": "It says, SPM 12, first released 1st of October, 2014, but previous versions of SPM have been released for many years, and last updated on the 13th of January, 2020, so almost one year old at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.2,
    "end": 2007.255,
    "text": " is a major update to the SPM software containing substantial theoretical algorithmic structural and interface enhancements over previous versions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.496,
    "end": 2007.796,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.997,
    "end": 2008.939,
    "text": "What is SPM?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.203,
    "end": 2021.487,
    "text": " SPM is a software package that has been designed for the analysis of basically brain imaging data sequences, but it turns out that that's a quite general question for a lot of reasons, which we'll discuss a few of right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.147,
    "end": 2029.25,
    "text": "So what SPM does is it starts with a series of images that are from various types of experimental designs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.59,
    "end": 2034.932,
    "text": "It could be from similar or different cohorts, or it could be different kinds of time series from one subject.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.652,
    "end": 2061.058,
    "text": " um and the current release is designed for the integrated analysis of fmri pet spect eeg and meg so the most common interfaces for neuro imaging are incorporated uh despite their usually extremely different error profile and actually uh representing quite different aspects of the tissue being imaged and over different time scales with different accuracies so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.878,
    "end": 2069.461,
    "text": " It's quite a general question to integrate different kinds of time series into underlying generative models of extremely specific types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.201,
    "end": 2073.182,
    "text": "What is the statistical parametric map?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.042,
    "end": 2079.984,
    "text": "It is the construction and the assessment of a spatially extended statistical process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.024,
    "end": 2083.686,
    "text": "So a statistical process that happens through time and space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.426,
    "end": 2088.067,
    "text": " that is used to test hypotheses about functional imaging data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.487,
    "end": 2094.788,
    "text": "So there's like the map and the territory, that's the mapping, is kind of that two layer, the data to the underlying model, that's the mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.328,
    "end": 2097.968,
    "text": "And then it's a statistical parametric mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.349,
    "end": 2105.17,
    "text": "So like a p-value comes from a z-score or a t-score or some other type of variable, that's a statistical parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.47,
    "end": 2111.311,
    "text": "And so it's going to be like an underlying statistical test, and it's related to a lot of different kinds of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.111,
    "end": 2123.758,
    "text": " And this SPM textbook from 2007 is quite a mathematical read, maybe it or a later Wikipedia version of the SPM toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.438,
    "end": 2130.562,
    "text": "Could be interesting to have a math set of discussions, but we have this one at home and it's a classic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.682,
    "end": 2132.023,
    "text": "It's a true, true classic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.134,
    "end": 2138.898,
    "text": " Here's just a summary of what SPM does so that the key aspects can be seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.958,
    "end": 2149.286,
    "text": "And this is what, for years before becoming more popular in the machine learning and theory of everything and philosophy of everything,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.066,
    "end": 2174.371,
    "text": " universe uh many years before that he was and still is the most cited neuroscientist and the huge reason for that is the many many papers that have gone into this type of development and then also its use as a toolkit broadly by many communities so the way that it begins with the spm is taking in the data which represents slices of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.811,
    "end": 2177.332,
    "text": " different underlying objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.592,
    "end": 2185.755,
    "text": "So it can be measured in various different ways, whether it's all the measurements simultaneously, or whether the slices take time as they slice through a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.695,
    "end": 2198.299,
    "text": "And that is first done, there's a first processing step that's basically a realignment to a standardized brain atlas or a person-specific brain atlas, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.579,
    "end": 2203.781,
    "text": "So you can take a static image that has much higher resolution and align dynamical images, or not,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.201,
    "end": 2207.485,
    "text": " to this more static high resolution image, which can help a huge amount.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.446,
    "end": 2220.121,
    "text": "That is then processed through smoothing, which is like this thing called a kernel, which is like, you have a fabric, which is the data, and there's gonna be like a finger and it's gonna move across the data and reweight the data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.002,
    "end": 2242.001,
    "text": " according to some smoothing technique and this represents a gaussian kernel so this is just blurring the image to ease out a little bit over the noise at a certain spatial and temporal scale that can also be related to specific instrumentation related biases that are known like non-linearities in the response",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.581,
    "end": 2252.769,
    "text": " And that is this process where the data are processed into a cleanly comparable format, spatially and temporally and statistically renormalized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2253.69,
    "end": 2258.954,
    "text": "Then there is the specification of a design matrix, which there's so many of these in the SPM textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.014,
    "end": 2260.855,
    "text": "It's really awesome and they look really beautiful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.576,
    "end": 2263.397,
    "text": "And the design matrices are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.433,
    "end": 2280.279,
    "text": " very broadly types of things that you want to consider in your analysis, whether it's something you know about the patients, like their age or their pathological diagnosis, whether it's something you know about them and you want to include it in the model or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.139,
    "end": 2298.931,
    "text": " uh as in as something you're predicting or including in your prediction of something else or whether the design matrix includes other more esoteric components that are often discussed in this spm textbook like these time kernels that design matrix and the smooth brain image sequences are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.491,
    "end": 2312.656,
    "text": " put together into a general linear model and it's funny because you hear a lot of uh disdain for linear models but this is linear models in a extremely rigorous and non-linear way that can lead to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.752,
    "end": 2324.677,
    "text": " these parameter estimates because it's like a linear model on a space that's been warped by this prior and updates in a multi-scale way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.357,
    "end": 2336.803,
    "text": "So that's really the interesting part is it takes renormalization to the next level and then applies general linear models in an extremely specific way, though I don't understand all the details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.603,
    "end": 2349.492,
    "text": " That relates to what is called a statistical parametric map, which is here like a heat map of the score of that voxel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.932,
    "end": 2351.473,
    "text": "So that's like the Z score.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.853,
    "end": 2355.055,
    "text": "So like a Z score of two or two standard deviations above the mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.936,
    "end": 2357.438,
    "text": " or one or whatever it happens to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.458,
    "end": 2359.461,
    "text": "It's like a z-score, positive and negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.222,
    "end": 2367.431,
    "text": "And then there's a variety of approaches that can be used to then, on this statistical parametric map,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.45,
    "end": 2389.608,
    "text": " draw p-value distinctions on this and it turns out that that process of setting a p-value threshold and saying whether 80 of the brain is used in a task or one percent or correct for one person's structure but you're trying to detect the structure that area is an extremely nuanced field",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.817,
    "end": 2412.93,
    "text": " pun intended and it draws on this random field theory and there's several chapters in the spm textbook that do random field theory and it was just like quite an interesting approach to statistics that is uh really being implemented here all right the abstract of the paper is that cybernetics is a study of goal-directed systems that self-regulate via feedback a category that includes human beings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.013,
    "end": 2426.104,
    "text": " Cybernetic Big Five Theory attempts to explain personality in cybernetic terms, conceptualizing personality traits as manifestations of variation in parameters of the neural mechanisms that evolve to facilitate cybernetic control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.059,
    "end": 2439.849,
    "text": " The Free Energy Principle and Active Inference Framework, FEPAI, is an overarching approach for understanding how it is that complex systems manage to persist in a world governed by the second law of thermodynamics, the inevitable tendency towards entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.45,
    "end": 2445.894,
    "text": "So the authors have framed the conversation as being firstly about cybernetics, first word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.254,
    "end": 2451.498,
    "text": "That's about action selection in complex systems that self-regulate and use feedback, big field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.279,
    "end": 2480.04,
    "text": " then within the context of the cybernetic big five theory which this is a psychological theory that draws heavily on cybernetics we are going to consider the neural mechanisms that facilitate and have evolved to facilitate this kind of cybernetic control then the free energy principle and active inference framework are introduced to explain a similar set of topics behavior as well as this resistance of dissolution far from equilibrium systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.189,
    "end": 2490.135,
    "text": " Although these two cybernetic theories were developed independently, they overlap in their theoretical foundations and implications and are complementary in their approaches to understanding persons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.016,
    "end": 2499.701,
    "text": "FEP AI contributes a potentially valuable formal modeling framework for CB5T, while CB5T provides details about the science and structure of personality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.282,
    "end": 2508.467,
    "text": "In this chapter, we explore how CB5T and FEP AI may begin to be integrated into a unified approach to modeling persons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.847,
    "end": 2510.429,
    "text": "We'll need another acronym, won't we?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.669,
    "end": 2513.091,
    "text": " So, the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.131,
    "end": 2524.46,
    "text": "The first section is a cybernetic approach to personality and has the first figure, which shows some of the causal processes that are related to the functioning of personality of the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.661,
    "end": 2529.704,
    "text": "The second section is the free energy principle and CB5T.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.124,
    "end": 2538.129,
    "text": " Third is predictive processing and personality neuroscience, active inference, generative models, and personality modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.65,
    "end": 2547.756,
    "text": "There's two figures in that section which draw upon the graphical models, some of which we've seen some of the structure before, and also the SPM demo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.597,
    "end": 2552.98,
    "text": "Then in section six talks about personality traits from the perspectives of CB5T and FEPAI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.562,
    "end": 2558.686,
    "text": " And there's a representation of the personality trait hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.286,
    "end": 2569.478,
    "text": "And then the final three sections are the meta traits, the big five personality traits, then a conclusion on the levels of analysis in personality modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.078,
    "end": 2575.484,
    "text": "Table one then has some of the analogies between or mappings between CB5T and FEP AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.089,
    "end": 2591.9,
    "text": " so figure one in the paper is a drawn from another paper and it relates to the causal processes that are involved in the functioning of personality within an individual and so it's a pretty uh loose",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.345,
    "end": 2620.666,
    "text": " chart saying that both genes and environment play into these relatively stable parameters of cybernetic mechanisms so that's saying somebody who has uh these are uh cybernetic underlying features like given a certain attractor state some people may spiral towards it or spiral away from it or stay in a certain stable orbit to it and that is the cybernetics of biological systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.727,
    "end": 2631.336,
    "text": " that maps onto personality trait architectures statistically in matrices because there's this underlying statistical regularity in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.776,
    "end": 2638.242,
    "text": "And that leads to a feedback system, with Stigma G perhaps, of characteristic adaptations and life outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.282,
    "end": 2642.005,
    "text": "And that's why there's correlations between life outcomes and personality traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.045,
    "end": 2645.929,
    "text": "And it's hard to determine cause and effect and all these other aspects of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.271,
    "end": 2650.312,
    "text": " Figure two is pretty nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.493,
    "end": 2655.976,
    "text": "It's the author's redrawing, I believe, of the graphical model structure that we've seen a lot of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.617,
    "end": 2661.5,
    "text": "But I wanted to read a quotation from page 21 because they laid it out very nicely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.9,
    "end": 2662.2,
    "text": "They wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.243,
    "end": 2672.349,
    "text": " Generative modeling in FEP AI can be complex, but the basic setup involves specifying agents and their situations as systems of interacting variables and parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.889,
    "end": 2680.794,
    "text": "These variables take the form of mutually referencing matrices, whose entries specify probabilistic mappings between different portions of the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.115,
    "end": 2681.315,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.671,
    "end": 2695.791,
    "text": " as we previously described a single objective function of expected free energy is used that's g to determine which policies are selected according to whichever actions are in to determine which policies are selected that's pi",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.489,
    "end": 2701.635,
    "text": " according to whichever actions are anticipated to minimize overall prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.195,
    "end": 2709.866,
    "text": "An example FEP AI generative model may include the following matrices where each mapping is conditional upon the probabilistic mappings from preceding matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.808,
    "end": 2713.071,
    "text": "A matrix is the likelihood mapping",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.252,
    "end": 2720.056,
    "text": " from latent world states to sensory observations, or how sensations are interpreted via perception and imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.436,
    "end": 2725.621,
    "text": "From the agent's perspective, this would correspond to answering the question, what is likely to have caused my sensations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.441,
    "end": 2733.007,
    "text": "The B matrix is the transition probabilities, or how dynamics are expected to evolve from one moment to the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.247,
    "end": 2738.031,
    "text": "From the agent's perspective, this would correspond to answering the question, how do I believe things are likely to change through time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.391,
    "end": 2739.672,
    "text": "Three, C matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.413,
    "end": 2745.736,
    "text": " The C matrix is the prior beliefs over policies or outcomes or which states an agent predicts itself occupying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.316,
    "end": 2753.581,
    "text": "Via mechanisms of prediction error minimization, these prior expectations constitute the attracting states of the system and function as preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.441,
    "end": 2759.724,
    "text": "From the agent's perspective, this would correspond to answering the question, what do I want to happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.144,
    "end": 2764.347,
    "text": "And thereby doing slash enacting it through active inference in the ways described above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.907,
    "end": 2767.709,
    "text": "From a CB5T, these preferences are an agent's high-level goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.329,
    "end": 2769.33,
    "text": "Four, the D matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.643,
    "end": 2774.651,
    "text": " The dematrix is an agent's belief regarding its initial position within the decision environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.092,
    "end": 2780.042,
    "text": "From the agent's perspective, this would correspond to answering the question, where am I likely to be in this kind of situation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.223,
    "end": 2781.265,
    "text": "Or where am I likely to have started?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.724,
    "end": 2783.864,
    "text": " And five, the E-matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.305,
    "end": 2790.606,
    "text": "The E-matrix is the baseline prior over policies governing policy selection in a habitual or a heuristic fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.726,
    "end": 2795.607,
    "text": "From the agent's perspective, this would correspond to answering the question, what am I likely to be doing right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.047,
    "end": 2804.969,
    "text": "And thereby doing slash enacting through active inference, but with actions deployed in a fashion that ignores uncertainty with respect to the likelihood of goal attainment in a particular situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.729,
    "end": 2811.47,
    "text": "From a CB5C perspective, these habit priors would constitute a major class of characteristic adaptations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.455,
    "end": 2813.015,
    "text": " Pretty nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.516,
    "end": 2823.263,
    "text": "Then you have the states and observations, and then the beta and the gamma, which is the precision estimators, which is the confidence and the temperature parameter over that confidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.603,
    "end": 2834.991,
    "text": "So very nicely laid out by the authors and always cool to hear it a different way and framed as a catechism, which is actually like, what does each matrix represent the question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.212,
    "end": 2840.875,
    "text": "What is the question that reflects how each matrix is answering something in the model, doing something in the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.52,
    "end": 2847.744,
    "text": " Figure 3 is an illustrative figure accompanying a generative modeling demo that is prepackaged with SPM 12.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.684,
    "end": 2859.552,
    "text": "This particular simulation involved modeling curiosity with respect to a task with unknown rules, where agents attempted to maximize valued outcomes while also needing to discover the latent task structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.473,
    "end": 2868.298,
    "text": "And the generative patterns of the data that are part of this integrated generative model in SPM include the inferred rules of the world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.139,
    "end": 2890.552,
    "text": " the top left the patterns of the task choices here and the neuronal activity anticipated to occur based upon mechanistic process theories associated with fep ai bottom left and all these three so unit firing firing rates local field potentials and dopamine responses as a function of these things happening under this rule and choice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.132,
    "end": 2902.54,
    "text": " So it's policy, behavior, and neural or underlying responses, which can be of various categories, from the neurometabolic, like dopamine, to the firing, the local field potentials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.26,
    "end": 2905.702,
    "text": "So it's quite a broad modeling framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.988,
    "end": 2909.63,
    "text": " Figure four is the personality trait hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.31,
    "end": 2917.816,
    "text": "And they write, note that the structure indicated here is the between person covariance structure of traits in the population, not a within person causal structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.376,
    "end": 2927.022,
    "text": "So in other words, these connections reflect ways that you can partition axes of variability, not like there's some sort of downward cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.402,
    "end": 2934.547,
    "text": "So that's sort of the challenge with this naming of these things is that they're all kind of like adjectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.667,
    "end": 2936.529,
    "text": "They all seem like they're equal adjectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.67,
    "end": 2944.137,
    "text": " I mean, some might have a more negative or positive connotation or preference for some people, but they're all just adjectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.878,
    "end": 2952.066,
    "text": "And yet, really, it's a specific statistical structure where the connections don't really reflect relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.407,
    "end": 2953.568,
    "text": "They're subcomponents that are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.489,
    "end": 2959.396,
    "text": " distinct under another subcomponent of a population variability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.997,
    "end": 2971.512,
    "text": "So it's really better just to think about what the real question is and what this statistical structure is doing because the adjective part, I just don't really know how good of an approach that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.253,
    "end": 2982.023,
    "text": " And then also the piece of the niche is that eco, evo, devo, so ecology, evolution, and development are what structure those stability and plasticity metatrates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.584,
    "end": 2990.972,
    "text": "Because the ants that we see today, for example, they've been on a lineage that's been successful since the beginning of ants and back even further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.673,
    "end": 2999.319,
    "text": " So it has had to maintain some parameter values which have kept pace with changing local context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.879,
    "end": 3009.606,
    "text": "So that's what structures these really specific top level traits because it's actually the process that structures the entire landscape that all these things are playing out upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.155,
    "end": 3024.824,
    "text": " Table one shows some mappings between the key concepts in CB5T and their definitions and the free energy principle or active inference terms or related topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.465,
    "end": 3037.813,
    "text": "So cybernetics itself is about governing systems that self-regulate via feedback, and that's related to many of the cybernetic underpinnings and also information theory and entropic aspects of FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.44,
    "end": 3046.007,
    "text": " Psychological goals are representations in cybernetics that get enacted through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.587,
    "end": 3056.378,
    "text": "And FEP, they would say that that is a Bayesian belief about the expectations of how prediction errors are gonna be minimized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.258,
    "end": 3058.98,
    "text": "So that's preferences via policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.918,
    "end": 3070.751,
    "text": " Psychopathology is a persistent or maybe a self-diagnosed or not failure to move towards one's psychological goals due to failure to generate effective new goals over different timescales, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.312,
    "end": 3076.418,
    "text": "And that could map in the FEP to a persistent inability to minimize prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.159,
    "end": 3078.841,
    "text": "And there's a lot of interesting work on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.827,
    "end": 3092.457,
    "text": " In the second part of table one, personality are the reasonably enduring psychological individual differences, although also it would have to do with the ecological niche because it can't be defined abstract from the relationships and the experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3093.378,
    "end": 3097.501,
    "text": "And then the FEP active inference correspondence would be these enduring attractors,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.921,
    "end": 3100.203,
    "text": " that defines systems as weakly ergodic processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.243,
    "end": 3102.925,
    "text": "So states that some systems revisit, but others don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3103.265,
    "end": 3108.209,
    "text": "So some people return to a YouTube channel or a TV channel or whatever, and some people don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.569,
    "end": 3110.531,
    "text": "And some people never enters into their orbit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.611,
    "end": 3113.453,
    "text": "And so that's why it's always conditional on what is being received from the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.334,
    "end": 3120.339,
    "text": "Those personality traits are those probabilistic descriptions of stable patterns within personality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.24,
    "end": 3125.203,
    "text": "And their correspondence suggested for the FEP is the minimal message length",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.463,
    "end": 3130.467,
    "text": " or the maximally informative descriptions of agents as generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.507,
    "end": 3134.891,
    "text": "So this is like the parsimonious description of the agents representing their niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.652,
    "end": 3146.762,
    "text": "The characteristic adaptations are the stable goals, interpretations, and strategies specified in relation to basically the niche, and that relates to this whole policy and adaptive component of FEP AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.895,
    "end": 3151.617,
    "text": " So that's basically it for this video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.478,
    "end": 3156.92,
    "text": "And a few questions to return to at the end, questions that are often asked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.461,
    "end": 3160.623,
    "text": "What would we really get at with a good framework here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.703,
    "end": 3162.404,
    "text": "So what would a good framework enable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.624,
    "end": 3186.697,
    "text": " what are the unique predictions and experiments of this model so what is our knowledge gain what are we getting out of this specific integration paper and how is it going to influence not just how we think about the world but how we act in the world in terms of which experiments are now optimally informative even if those experiments the data already exists maybe it's just an analysis but that's still an experiment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.28,
    "end": 3191.342,
    "text": " Another question is what's the next step for active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.782,
    "end": 3208.75,
    "text": "Maybe we could bring active inference models to bear using some of these new tutorials that are becoming available on large psychological databases and see if there's an active inference or a cybernetic descriptor behavior that explains more variants more parsimoniously than the big five structure does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.151,
    "end": 3213.953,
    "text": "Another question is what is the goals of this research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.453,
    "end": 3217.415,
    "text": "What do different people want to see happen and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.444,
    "end": 3219.485,
    "text": " What are the goals of the research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.446,
    "end": 3224.07,
    "text": "And also, very importantly, what are we still curious about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.61,
    "end": 3231.497,
    "text": "Because there's going to be 13.1 and 13.2 where we, as a group, discuss this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.958,
    "end": 3234.961,
    "text": "And then we'll have more papers to come, so it's okay to be curious about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.161,
    "end": 3239.285,
    "text": "Any level, anytime you're listening to this, live or in replay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.026,
    "end": 3241.067,
    "text": "But yeah, just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.389,
    "end": 3265.15,
    "text": " leave a comment on the video or join us in the discussion if you listen to this at the right time and it's good to hear about what you're curious about because in this video I really just tried to run through the figures and give some background or some definitions so maybe some parts were a bit too much or too little for some people so as always it's just throwing it out there and let me know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.96,
    "end": 3288.526,
    "text": " can improve so thanks for participating even listening is participating we provide follow-up forums to live participants and we request your feedback suggestions or questions and just stay in communication and hopefully we will see you another time so thanks for listening and i'm going to stop the live stream",
    "speaker": "SPEAKER_00"
  }
]