[
  {
    "start": 2.377,
    "end": 13.787,
    "text": " All right, welcome cohort five it's march 11 and Andrew thanks for taking us on to Chapter eight part two so go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 18.644,
    "end": 20.908,
    "text": " Okay, it's our second week on chapter eight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.112,
    "end": 30.465,
    "text": "And just a brief refresher that this chapter is in the second part of the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.485,
    "end": 42.205,
    "text": "And so we're now focusing more upon building our own models and getting a sense of how to draw relationships between phenomena of interest and how to actually map them to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.185,
    "end": 45.008,
    "text": " variables and active inference models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 45.809,
    "end": 50.215,
    "text": "Chapter seven, we saw discrete state space models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.275,
    "end": 67.956,
    "text": "And so we were looking at POMDPs and now chapter eight now transitions to continuous state space models, which are sort of the foundation, the starting point for historically for developing active inference models, a lot of the earlier work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 67.936,
    "end": 72.863,
    "text": " of Fristen, Parr and others was on continuous models first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.145,
    "end": 92.61,
    "text": "So here we're looking at continuous state space models, which are well suited for modeling, let's say physical fluctuations impinging on sensory receptors and for the continuous motion of the effectors or muscles we use to change the world around us is a quote from the chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.945,
    "end": 109.097,
    "text": " um here we have model examples for dynamical systems involved in motor control as well as the concept of generalized synchrony with the birdsong example and finally constructing hybrid models near the end which would actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.077,
    "end": 125.415,
    "text": " combine discrete and continuous variables so kind of almost add mixture of what we confronted in chapter seven now with continuous variables being situated as well for example at a lower level of the model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.395,
    "end": 129.302,
    "text": " Since it's our second week from there, I think we could just jump in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.362,
    "end": 135.012,
    "text": "Does anyone have any thoughts on this chapter?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.032,
    "end": 143.067,
    "text": "Any questions, anything they're still kind of crunching through in their mind about how a lot of this works?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.772,
    "end": 175.913,
    "text": " I'll add one point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 175.953,
    "end": 178.657,
    "text": "Thank you, Andrew, for the quick opening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 178.917,
    "end": 189.831,
    "text": "I think it's an interesting point that, like you said, it was initially with the earlier Friston and Parr models in continuous time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 189.851,
    "end": 195.478,
    "text": "And now the continuous time is being revisited in the Bayesian mechanics setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 195.498,
    "end": 201.285,
    "text": "So it's kind of like a purely dynamical systems justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.839,
    "end": 216.608,
    "text": " which is very similar to the SPM textbook, so kind of classical equations of motion, which kind of turns out to be like the classical Newtonian-Bayesian mechanic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 222.88,
    "end": 223.02,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 230.425,
    "end": 254.903,
    "text": " So the kind of pre-2015 continuous time, which is where most of this chapter is focused, like including just the differential equations, including the chaotic deterministic systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 255.724,
    "end": 258.508,
    "text": "That's just the kind of pure dynamical systems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 259.265,
    "end": 259.805,
    "text": " approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 260.786,
    "end": 263.569,
    "text": "Again, very similar to SPM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.051,
    "end": 271.496,
    "text": "And then this textbook doesn't really go into Bayesian mechanics because this textbook was published March 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 272.737,
    "end": 285.429,
    "text": "So probably was written between Princeton's 2019 free energy principle for a particular physics and then obviously the book being published 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 286.61,
    "end": 287.01,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 293.032,
    "end": 306.712,
    "text": " It's mentioned, but many of the works that made it clear are only after the book, just to kind of give a little more context on the continuous time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.481,
    "end": 312.581,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.601,
    "end": 322.195,
    "text": "So we start with continuous, we move to discrete, and then we're back to continuous, but it's kind of using what's been developed since then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.883,
    "end": 328.049,
    "text": " And also being able to combine the two as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.354,
    "end": 347.532,
    "text": "Yeah, and the nested hybrid model at the end of Chapter 8 is basically picked up on by this paper, which we discussed in Livestream 46.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 348.994,
    "end": 352.198,
    "text": "And they basically pick up on that exact",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 352.567,
    "end": 372.955,
    "text": " hybrid model i don't know if they use a figure let's see the hybrid model on page 166 oh sorry sorry yeah yeah you're looking at the paper yeah just the the but i don't know they didn't include it there but uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 384.207,
    "end": 412.948,
    "text": " yeah figure 8.6 so here continuous time on the bottom because of the derivatives and then discrete time on the top because of the transition Matrix and the explicit time and then in this paper they say okay with a belief desire intention like BDI model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 413.637,
    "end": 432.561,
    "text": " Including discussion of like whether that is folk psychology etc, etc, but within that commonly used like, can you talk about belief desires and intentions and all these things they it it's not that it does better or any different even per se it just it's non contradictory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 434.163,
    "end": 436.546,
    "text": "So it's kind of an interesting first way to put it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 439.65,
    "end": 440.151,
    "text": "hey ollie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 443.202,
    "end": 451.312,
    "text": " Is that particular paper, does it discuss much like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.354,
    "end": 465.629,
    "text": "Well, I'm not sure how deeply you want to go into that or maybe another example, but it seems like maybe a nice way of like finding them for week two here, like another application of what we find in chapter eight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.751,
    "end": 472.517,
    "text": "What's what's going on in that paper as far as like distinguishing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.852,
    "end": 478.458,
    "text": " discrete from continuous variables, do you have a recollection of like the model set up there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.983,
    "end": 497.057,
    "text": "Let's look at another time, but I think they all they mainly explored like differences in the belief, desire, intention, not into the model and not sure how much they focused on that sensory motor part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 497.097,
    "end": 498.218,
    "text": "But yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 503.615,
    "end": 507.499,
    "text": " Yeah, Prakash.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.399,
    "end": 509.16,
    "text": "Yes, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.661,
    "end": 515.926,
    "text": "Could you please go to that desire part which they're mentioning in that paper, the desire thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.067,
    "end": 516.347,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.867,
    "end": 518.489,
    "text": "Can you please spend some time on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 525.135,
    "end": 530.78,
    "text": "Yeah, I think you noticed it in the figure, probably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.8,
    "end": 532.862,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.973,
    "end": 537.197,
    "text": " Yeah, DAI, they're using for discrete.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 538.579,
    "end": 542.004,
    "text": "And MAI, I think, for motor AI.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 543.666,
    "end": 553.44,
    "text": "So here they're looking at the C preference distribution, which is a distribution over observables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 555.863,
    "end": 562.512,
    "text": "And then contrasting the observation of tasting ice cream and not tasting ice cream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 564.348,
    "end": 573.139,
    "text": " So these two alternative ways you could parameterize that, like in a program or an equation, here's 0.7.3, like a coin flip, 0.7.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 573.159,
    "end": 576.963,
    "text": "70% of the time I expect to be tasting ice cream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 577.884,
    "end": 581.289,
    "text": "Here it's 99% expecting to be tasting ice cream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.211,
    "end": 585.854,
    "text": "So then that C is stronger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 587.136,
    "end": 593.123,
    "text": "And so it entails a stronger motivational force through pragmatic value in EFE.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 594.976,
    "end": 596.378,
    "text": " So that's one way to kind of look at it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 597.119,
    "end": 602.386,
    "text": "And then there's the other, the way that the textbook kind of talked about it is with the C scaling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 603.908,
    "end": 611.018,
    "text": "But so depending on the program, sometimes you're working in the scaled C or unscaled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 611.218,
    "end": 614.703,
    "text": "Scaled meaning to the statistical distribution or like here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 615.604,
    "end": 624.797,
    "text": "So that here, ice cream versus no is being described summing to one, like a coin flip, like a real distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 625.722,
    "end": 628.385,
    "text": " So then you could have 99.99999999.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 629.947,
    "end": 632.631,
    "text": "Or that could be represented as like 1 million to 1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 636.275,
    "end": 646.007,
    "text": "So it just depends on the exact situation, whether you're working in the kind of setting where you can learn by counting through experience or do other modifications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 646.828,
    "end": 653.316,
    "text": "And then when that's used as a distribution for pragmatic value, it's transformed into something that sums to 1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 656.789,
    "end": 657.611,
    "text": " Rafal Dittwald, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.591,
    "end": 660.778,
    "text": ": Could you please send a link to this paper in the chat box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.883,
    "end": 663.384,
    "text": "Rafal Dittwald, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 663.324,
    "end": 664.988,
    "text": ": yeah just be on chapter eight page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 665.008,
    "end": 668.356,
    "text": "Rafal Dittwald, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 668.336,
    "end": 669.178,
    "text": ": yeah i'll put there to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 687.333,
    "end": 711.602,
    "text": " so if there are no um anyone please feel free to bring up any other questions you might have along the way or you know toggle the reaction to raise your hand um but so in in this chapter along the way where we're introduced to things like attractors um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.953,
    "end": 718.458,
    "text": " were introduced as well to the concept of generalized synchrony comes up a bit later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 718.478,
    "end": 723.617,
    "text": "And that's a particular notion that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.728,
    "end": 732.995,
    "text": " As we know, active inference agents are attempting to model the hidden states of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.196,
    "end": 737.459,
    "text": "So they're attempting to model their environment, what's going on around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.36,
    "end": 753.874,
    "text": "Generalized synchrony is this notion that the agent is basically their internal states are modeling or in certain ways beginning to synchronize with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.36,
    "end": 756.343,
    "text": " the states around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 756.563,
    "end": 768.722,
    "text": "We have no proof, of course, like the agent itself has no pure objective proof that it's somehow perfectly understanding the environment and all variables around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.742,
    "end": 772.347,
    "text": "But nonetheless, there's a kind of synchronizing going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.928,
    "end": 775.872,
    "text": "And this can be applied to a kind of multi-agent setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 776.533,
    "end": 777.735,
    "text": "And so here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.306,
    "end": 796.323,
    "text": " later on in the chapter, we're given this like birdsong example, which, you know, the textbook is published in 2022, but the birdsong example goes back to at least 2015 and potentially sooner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 796.343,
    "end": 807.874,
    "text": "But there are a couple of 2015 papers by Friston and Parr who are basically investigating using continuous variables",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 808.242,
    "end": 819.13,
    "text": " um they simulate uh two songbirds singing songs right and what they do is that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.498,
    "end": 830.781,
    "text": " there's a we start to see this kind of emergent phenomena, of course, with with active inference models, one of the big aims here of doing modeling is to like set up your variables set up your model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.084,
    "end": 839.7,
    "text": "run a simulation and then see what kind of emergent phenomena arise with the bird summit song example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.832,
    "end": 844.599,
    "text": " they first set up two birds that have identical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.64,
    "end": 861.081,
    "text": "So not too not too surprising to find, okay, they have identical models, they have the two songbirds, like quote, unquote, within earshot, like they can the two songbirds have actions where they can sing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.061,
    "end": 867.289,
    "text": " And then they can take in sensory observations, that being of continuous auditory signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.79,
    "end": 872.716,
    "text": "And so it's like the birds are singing to each other and listening to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.756,
    "end": 877.422,
    "text": "The emergent phenomena that begins to happen is we start to see them taking turns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.983,
    "end": 883.169,
    "text": "It's as if they're singing from the same hymn sheet or the same script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.151,
    "end": 886.714,
    "text": "And the generalized synchrony",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.694,
    "end": 895.074,
    "text": " Interestingly, even occurs whenever they set up the model, the simulation a second time around where the birds actually have different starting models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.455,
    "end": 903.454,
    "text": "So the birds start in different spots as far as they're like state space, like coordinates go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.434,
    "end": 910.803,
    "text": " And over time, the birds models actually began through perceptual learning to to mirror one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.443,
    "end": 915.288,
    "text": "So even though we start off with two different agents, they start to synchronize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.669,
    "end": 922.857,
    "text": "Now they're seeing the same hem sheet again, even though they're two, you know, very different birds as far as starting points go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.101,
    "end": 929.965,
    "text": "The way that's modeled is through using attractors and a Lawrence system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.198,
    "end": 938.875,
    "text": " And so in this case, there's something that's called a synchronization of chaos, which is rather interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.035,
    "end": 947.532,
    "text": "Because with a chaotic system, if you have two chaotic systems, presumably, even if you put them at the same starting point,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.512,
    "end": 977.063,
    "text": " um their trajectories will very quickly diverge um you know with infinite infinitesimally small chance that they will just magically line up but whenever you have two agents who are able to act um and listen uh to one another and they start to do this thing where they're following the same hymn sheet suddenly you have a kind of synchronization of these two chaotic systems and we see those kinds of um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 977.178,
    "end": 984.133,
    "text": " dynamics illustrated in the in the chapter is kind of orbiting on figures 8.4 and 8.5.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.173,
    "end": 992.852,
    "text": "And so yeah, kind of a lining up between different agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.173,
    "end": 996.3,
    "text": "I think it's interesting for anyone who's curious about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.803,
    "end": 1012.838,
    "text": " Matt Pinyan, Trying to set up systems or do multi agent settings where they're trying to see you know how a joint action begins to play out between agents saying how agents can work together to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.818,
    "end": 1028.278,
    "text": " ultimately minimize their own distinct you know free energy um but by in order to do that they actually have to like yeah entrainment is a good word like one of them entrains the other um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.102,
    "end": 1032.688,
    "text": " so that they can stay on the same page, minimize prediction errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.63,
    "end": 1042.686,
    "text": "And it's fascinating because there are all kinds of rich behaviors and dynamics that occur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.968,
    "end": 1052.764,
    "text": "Like the songs that are being sung, presumably they have like vocal glides and brief pauses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.048,
    "end": 1058.497,
    "text": " So it's not just a super simple behavior that's being synchronized here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1058.738,
    "end": 1059.76,
    "text": "But nonetheless, it occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.462,
    "end": 1076.829,
    "text": "Let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.849,
    "end": 1076.929,
    "text": "Hmm."
  },
  {
    "start": 1084.739,
    "end": 1085.801,
    "text": " the birdsong also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.901,
    "end": 1088.485,
    "text": "I like how this chapter brings up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1088.645,
    "end": 1090.969,
    "text": "Oh, Prakash, is that your hand up again?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.01,
    "end": 1092.571,
    "text": "Yeah, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.711,
    "end": 1096.217,
    "text": "I may be wrong, actually, but just correct me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.438,
    "end": 1100.163,
    "text": "So for synchrony, there needs to be some kind of a coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.603,
    "end": 1106.292,
    "text": "I'm just wondering, is it anyway related with the generative process and the generative models, like the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.272,
    "end": 1129.63,
    "text": " like we have the like the generative process is in a way uh complementary to the generative model is it possible that that plays an impact sure so so in this example there's not too much going on in terms of uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.099,
    "end": 1131.341,
    "text": " So just as a starting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.682,
    "end": 1138.013,
    "text": "So with modeling, you're going to be defining a generative model and you're going to be defining a generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.775,
    "end": 1145.768,
    "text": "In this example, there's not too much distinct going on whenever a generative process is defined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.968,
    "end": 1152.58,
    "text": "In fact, here it's like we have two generative models, so two agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.998,
    "end": 1156.124,
    "text": " And they're coming into contact with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.445,
    "end": 1162.697,
    "text": "So it's like for bird number one, its model is itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.32,
    "end": 1168.729,
    "text": "Its process that it's coming into contact with is just the other bird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.709,
    "end": 1173.5,
    "text": " So you can think about the observations that bird number one is taking in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.021,
    "end": 1183.083,
    "text": "They're all being generated by by bird number two as part of the environment, the process that's around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.466,
    "end": 1185.368,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.322,
    "end": 1189.005,
    "text": " I think you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.066,
    "end": 1203.254,
    "text": "I think instead of thinking in terms of generative process altogether, like two different agents, and they have like similar kind of internal models, and that is kind of causing some kind of coupling mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.334,
    "end": 1205.719,
    "text": "And so over a long period of time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.699,
    "end": 1234.93,
    "text": " uh they may start to have behaviors which are similar to each other no like you mentioned that hymn sheet right so one person may say the starting lines and then after some time the second person will say the second thing then the third will say first we'll say third like that observations might happen yeah it's like a pendulum example which i think uh was mentioned last week like we have these two pendulums which are swinging and over a very long period of time they'll kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.129,
    "end": 1236.364,
    "text": " Um, oscillate together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.385,
    "end": 1236.567,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.701,
    "end": 1237.883,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.791,
    "end": 1266.098,
    "text": " yeah no that's exactly right and uh that's that's also referenced in the birdsong paper so yeah just basically being able to start two different in that yeah in that case your pendulums are kind of like your agents um and yeah via you know via physics via the the general logic that we're looking at here like attractors yeah they begin to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.078,
    "end": 1292.642,
    "text": " kind of move towards attracting points but they're acting as each other's attracting points so to speak um such that yeah their their behaviors start to to synchronize and so with the the birds the bird song is an interesting example versus the pendulums because the pendulums they just like continue moving for the birds um we have this turn taking dynamic that begins to occur",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.622,
    "end": 1302.317,
    "text": " Because the birds are trying to, in terms of active inference and the free energy principle, they're actively trying to minimize their prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.678,
    "end": 1309.669,
    "text": "And the way they do that here is that they want to hear a song, like they want to take in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.594,
    "end": 1337.344,
    "text": " uh sensory observations that show that are realizing the preference of hearing a song and the two ways they can do that of course are perception changing their mind their own mind or uh action which is changing the world and so this turn-taking dynamic involves a combination of sensory attention and sensory attenuation uh is how it's phrased here and these are also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.324,
    "end": 1364.074,
    "text": " um interesting mechanics that we find in in just about any active inference model where action is involved um you have to so the birds take turns because like how do you keep a song going well one uh you need to hear that it's going on so they attenuate or or kind of like pause um their um their incoming sensory signals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.442,
    "end": 1384.51,
    "text": " uh to uh commit actions that realize hearing the song it's like oh I don't hear a song I need to sing that's that's realizing my preference um okay I've sung um now I pause I hear the other birds singing I take that in as a sensory signal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.384,
    "end": 1387.848,
    "text": " The other bird begins to sing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.908,
    "end": 1391.072,
    "text": "Maybe it sings notes that I expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.393,
    "end": 1391.653,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.154,
    "end": 1394.116,
    "text": "Maybe it sings notes that I don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.978,
    "end": 1398.623,
    "text": "Now we have prediction error starting to jump up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.003,
    "end": 1399.805,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.825,
    "end": 1406.094,
    "text": "And so whenever that happens, of course, the bird number one has to minimize its prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.414,
    "end": 1409.198,
    "text": "And so it starts to sing itself again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.296,
    "end": 1426.555,
    "text": " And because these two birds are basically doing this back and forth, there's a kind of synchrony, because they're both trying to minimize the prediction error, the way that they sing, the actions that they take, the specific ways that they sing, they start to synchronize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.776,
    "end": 1430.3,
    "text": "They start to match notes, start matching expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.82,
    "end": 1438.729,
    "text": "And that's the kind of thing that we see playing out in the graphs and the figures and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.709,
    "end": 1443.077,
    "text": " textbook, especially figure 8.5.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.117,
    "end": 1453.495,
    "text": "On the right, the authors here, you know, Friston and everyone, they're trying to show like a before learning and after learning for these two birds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1454.167,
    "end": 1459.512,
    "text": " On the left-hand side, it's like, okay, these are the dynamics playing out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.712,
    "end": 1461.914,
    "text": "Here are the dynamical equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.055,
    "end": 1469.181,
    "text": "And then on the right, you can see the upper graph before learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.421,
    "end": 1472.764,
    "text": "These are kind of like the state spaces of each bird's expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.184,
    "end": 1474.685,
    "text": "They're top-down predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1475.566,
    "end": 1477.508,
    "text": "And then a little bit more all over the place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.548,
    "end": 1483.093,
    "text": "Whenever they start, they begin to synchronize so that, you know, whenever...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.546,
    "end": 1493.298,
    "text": " Whenever bird one and recall these are continuous state spaces, which is why we are able to do this as coordinates rather than having to look at like discrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.723,
    "end": 1496.83,
    "text": "Point masses or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.89,
    "end": 1514.925,
    "text": " So where bird number ones, or excuse me, yeah, the first bird's expectations in that lower right graph, whenever they're around 10, you know, whenever we plot them, the second bird's expectations are also around a value of 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.365,
    "end": 1521.41,
    "text": "Whenever bird number one's expectations or predictions are around 50, same case for the second bird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.771,
    "end": 1526.715,
    "text": "So that's what they're trying to get at with these graphs is, yeah, they begin to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.864,
    "end": 1531.192,
    "text": " even though they're dynamically shifting around, we're never always at zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.593,
    "end": 1535.399,
    "text": "We could be at 50 this moment, we could be at negative five this moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1537.483,
    "end": 1549.665,
    "text": "The important point is that the first bird's predictions and the second bird's predictions are basically both lining up at just about any given moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.839,
    "end": 1559.737,
    "text": " One interesting thing I hadn't seen before is like here it's going between at least 60.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1562.544,
    "end": 1563.927,
    "text": "But here it's only going to 40.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1569.119,
    "end": 1570.422,
    "text": "Yeah, presumably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.768,
    "end": 1575.212,
    "text": " I mean, we have before learning and after learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.432,
    "end": 1584.882,
    "text": "So presumably they maybe just before learning haven't explored quite as much of the state space yet, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.222,
    "end": 1589.727,
    "text": "Like we have this much more exploration after learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.787,
    "end": 1595.953,
    "text": "You've run more trials or at least extended the time horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.575,
    "end": 1610.871,
    "text": " And then, here they are like starting to sync up singing new notes that they'd never sung before or however you'd like to phrase that and yeah the scale starts expanding because they're trying new things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.91,
    "end": 1615.654,
    "text": " Not sure nice nice interpretation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1616.475,
    "end": 1622.363,
    "text": "Yeah, it's it's it's a thought in any case and I also notice it looks on the after learning graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.443,
    "end": 1630.153,
    "text": "It looks slightly more chaotic or just messy, not quite as synced up once you get past 50 on the after learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1630.934,
    "end": 1636.281,
    "text": "My guess is that like oh, this is a new the new terrain that they're exploring here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.303,
    "end": 1642.63,
    "text": "Yeah, these little micro little micro densities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.42,
    "end": 1648.865,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.885,
    "end": 1657.914,
    "text": "So presumably after more trials, like we'll see an even finer kind of line or syncing up between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1659.836,
    "end": 1661.358,
    "text": "We should find them at lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1661.818,
    "end": 1665.762,
    "text": "It might, it may even be an SPM example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1667.404,
    "end": 1670.507,
    "text": "There's also a kind of mini standalone SPM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1672.715,
    "end": 1686.168,
    "text": " Like while it is a MATLAB package, there's a, uh, kind of like compiled standalone SPM, all the, or, or other people like it's worth a try.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1687.069,
    "end": 1687.489,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.91,
    "end": 1700.562,
    "text": "And the bird song, I, I, I could check or we could check together because it's kind of been around long enough to probably be included in the DEM demo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1702.752,
    "end": 1704.614,
    "text": " Yeah, actually, that's right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.855,
    "end": 1708.198,
    "text": "I was just having a look at the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.218,
    "end": 1712.543,
    "text": "I think I dropped in the chat there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1712.643,
    "end": 1728.0,
    "text": "But yeah, just about any of these Friston co-authored papers, at least prior to maybe the past couple of years, it's like go into a paper, Control-F, SPM, see if they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.048,
    "end": 1734.183,
    "text": " you know, have a script there that they're, you know, they'll always mention in the paper, of course, there you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.126,
    "end": 1738.935,
    "text": "And yeah, it looks like it is contained in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.569,
    "end": 1763.674,
    "text": " yeah for for better or worse of course matlab still requires um a license to use but but i myself have downloaded the the spm standalone before um you just you know unfortunately of course you cannot run dot m matlab scripts if you don't have matlab so spm is nice as far as like you get this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.413,
    "end": 1777.195,
    "text": " Um, this like graphical system with all of these different options of demos, you can click, you can look at the graphical outputs and yeah, it looks like this one, um, is included in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.215,
    "end": 1786.973,
    "text": "It's like that, um, bird song underscore, um, Oh no, D E M underscore demo underscore duet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.654,
    "end": 1788.936,
    "text": "Um, so it can run.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.253,
    "end": 1801.044,
    "text": " Scott Luxenberg- dot m scripts in the background, you just can't hop in and access them and modify them yourself to tweak the parameters or anything like that, unfortunately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.064,
    "end": 1811.574,
    "text": "Scott Luxenberg- But yeah it's nice it's like they're they're like literally dozens of pre loaded scripts in there, if you just download the SPM standalone you just click one and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.614,
    "end": 1816.459,
    "text": "Scott Luxenberg- You can you can watch what kind of graphical outputs it comes up with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.568,
    "end": 1853.112,
    "text": " yeah and we can also explore bringing it into rx infer and everything yeah yeah definitely um for anyone here who's not familiar um the institute has an ongoing project thursday mornings well sorry i'm in the us some advice to that but um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.543,
    "end": 1855.645,
    "text": " early on Thursdays.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.907,
    "end": 1872.653,
    "text": "There's an RX inferred project for anyone who's interested in adapting the logic of active inference that we're reading about here to direct application in the Julia programming language and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.751,
    "end": 1882.385,
    "text": " Right now we're going over different examples that are already provided by the developers, BIAS Labs, of this RxInfer package.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.266,
    "end": 1886.09,
    "text": "But we'll be expanding from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.051,
    "end": 1898.387,
    "text": "Different people are proposing their own community projects, different kinds of use cases they're coming up with, and that we could try emulating as a group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.059,
    "end": 1909.716,
    "text": " And then another focus is that we would like to be able to reproduce some of these existing projects or topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.136,
    "end": 1916.887,
    "text": "For example, here we could try and take the MATLAB script for the birdsong example and recreate it in Julia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.367,
    "end": 1922.215,
    "text": "And finally, just final note, is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.195,
    "end": 1931.873,
    "text": " Julia programming language, as well as the way that bias labs is developing the arcs and for package it's just it's nice that it's it's using this more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.953,
    "end": 1937.082,
    "text": "kind of sophisticated but also highly efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.213,
    "end": 1964.185,
    "text": " method for the computation and message passing, as we saw in the textbook back around chapter five, to really just like being able to scale up these kinds of processes and being able to just basically better use your computational resources, save on some time, efficiency, all that good stuff that we in the programming world care about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.206,
    "end": 1966.528,
    "text": "Yeah, Francis, you have your hand up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.095,
    "end": 1971.959,
    "text": " Yeah, I just wondered if there's two questions, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1972.279,
    "end": 1982.689,
    "text": "Firstly, if there's likely to be any support for a PyMDP group, because I'm already having to learn Python.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.969,
    "end": 1990.096,
    "text": "I can't really commit to learning a second programming, new programming language from scratch at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.358,
    "end": 1996.482,
    "text": "So I've been kind of slowly working through that nice",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.799,
    "end": 2003.228,
    "text": " PyMDP tutorial book running it on the, is it Colab?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2003.849,
    "end": 2024.359,
    "text": "And the other question is, is there anything to be learnt or is it not a really helpful parallel between the idea of the birdsong example as a kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.149,
    "end": 2052.928,
    "text": " autocomplete and how does Active Inference's success here compare in any way to LLM's success at GPT-4, the world's smartest autocomplete?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2055.389,
    "end": 2055.79,
    "text": " Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2056.39,
    "end": 2057.612,
    "text": "Just to quickly address it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2057.632,
    "end": 2063.641,
    "text": "So right now, we do not have any active PyMDP specific group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2064.702,
    "end": 2069.73,
    "text": "We could do a similar kind of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2071.412,
    "end": 2076.439,
    "text": "Right now, the Rx and Fur is really, it is kind of interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2076.72,
    "end": 2085.092,
    "text": "It's just from knowing PyMDP to medium degree, it is different syntactically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2085.393,
    "end": 2113.442,
    "text": " however like it is it's very different and it's a more general than pi mdp in several ways not to say that that that one can't have other you know things the other doesn't have but just the that um RX and fur pulls way back like to the coin flip",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2114.333,
    "end": 2118.419,
    "text": " which was really helpful and then builds up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2119.34,
    "end": 2128.133,
    "text": "Whereas PyMDP wraps, it focuses on just kind of getting you to the discrete time active agent POMDP as fast as possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2129.295,
    "end": 2136.346,
    "text": "Because that's like not every use case, but that's like many use cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2137.447,
    "end": 2140.972,
    "text": "And then it can kind of be modularized from there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2141.714,
    "end": 2144.037,
    "text": "But RxInfer is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2144.978,
    "end": 2170.362,
    "text": " it's a it's a very promising effort that's a lot broader so i i think it's a good way to go i'm kind of excited to learn it a lot ollie is very good at it oh then the second piece about the the um llms well one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2172.063,
    "end": 2199.285,
    "text": " we we um we haven't had a a streamer discussion on with these authors but this is one interesting paper recently um and then yeah like it's almost like a question of what what is perceived as a um computing benchmark especially if other considerations like interpretability or energy it's like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2200.379,
    "end": 2226.268,
    "text": " is it a challenge is it a computing advance to open a larger file with a computer with more ram it's like yes but maybe it's not proportionally or differently a kind of benchmark so then what what are benchmarks for active models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2228.813,
    "end": 2255.648,
    "text": " And like, or even kind of in another setting, like with the morph streamed with Sarah Hamburg, different guests, it's been interesting to like hear how they talk about like the different characteristics of the biomimetic computing systems, because they are not, it's not simply just like the CPU, RAM,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2259.391,
    "end": 2284.183,
    "text": " descriptions thanks so much that's so it looks like a really um interesting uh paper um yeah and only six pages oh no comments of six pages yes yeah it's a short it's definitely a starter so I and I think that they and many other people are interested and and a big um um like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2284.602,
    "end": 2312.938,
    "text": " of course the models are different if you look at the transformer architecture um or um but there's some interesting with the state space models like the mamba there's there's a few people like matt perkowski who have um talked a little bit about the relationship between the state space models and active inference so that may be actually a closer relationship but um just in terms of how the transformers are different than active inference models i mean in the textbook group",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2314.032,
    "end": 2314.553,
    "text": " Matthew T Brooks, St.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2314.653,
    "end": 2324.186,
    "text": "Paul MN, He, These chapters are showing us what the active model is you can then just look at the transformer architecture and just see how they are different architecturally but then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2324.827,
    "end": 2326.209,
    "text": "Matthew T Brooks, St.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2326.229,
    "end": 2329.173,
    "text": "Paul MN, He, In in this paper they kind of highlight this kind of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2329.593,
    "end": 2331.175,
    "text": "Matthew T Brooks, St.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2331.195,
    "end": 2338.926,
    "text": "Paul MN, He, Ongoing there's various aspects to highlight there's the epistemic value there's the um.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2340.273,
    "end": 2368.525,
    "text": " reinforcement and but there's also a lot of overlaps as these are just large statistical models yeah oh thanks that's great oh and this is another good one where um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2369.23,
    "end": 2394.984,
    "text": " they talk about how in active inference, you can construct the causal graph to be like that there is an uncertainty parameter or like a temperature parameter on some other parameter, or there's like introspective access that using the classic Lars live stream 28 figures with a meta awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2395.645,
    "end": 2397.668,
    "text": "So if you construct the model to be this way,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2397.867,
    "end": 2402.092,
    "text": " then this parameter actually has that role in the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2403.093,
    "end": 2420.314,
    "text": "Whereas if you ask a prompt, no matter what you ask or how you ask it to a transformer architecture, what is it like to be you and all these kinds of questions that people are very interested in,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2420.817,
    "end": 2427.523,
    "text": " it's only ever giving that semantic space, fuzzy statistics of words answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2428.143,
    "end": 2433.888,
    "text": "So it could say, I'm very sure that it's this way, or very sure it's that way, or I'm not sure, or I feel this way when it's that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2434.289,
    "end": 2440.574,
    "text": "But those are all just words generated from texts, statistics of texts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2441.795,
    "end": 2444.878,
    "text": "So they will never approach an actual introspection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2446.679,
    "end": 2449.862,
    "text": "So here they raise the possibility of the actual introspection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2452.677,
    "end": 2454.2,
    "text": " That's very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2454.661,
    "end": 2456.445,
    "text": "A totally different author list.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2459.352,
    "end": 2463.842,
    "text": "Can we have that link on the encoder as well?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2470.456,
    "end": 2471.158,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2486.596,
    "end": 2495.411,
    "text": " This is all interesting with the comparison to LLMs, because I'm no expert on that topic, but I've been looking into it more myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.471,
    "end": 2511.878,
    "text": "And yeah, there is this kind of notion that, OK, LLMs are great as far as performance goes with accuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2512.33,
    "end": 2514.113,
    "text": " and all of the computation there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.133,
    "end": 2528.894,
    "text": "And nonetheless, yeah, major, the kind of criticisms and the sort of debate or contrasting between LLMs and ACT-INF is just more generally like, oh, it takes a ton of computational resources to train an LLM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2529.415,
    "end": 2533.661,
    "text": "And then once you're kind of finished training it, it's like, OK, well, there it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.881,
    "end": 2539.249,
    "text": "It's not conceived as an agent who's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2539.803,
    "end": 2542.748,
    "text": " who's able to engage in action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.808,
    "end": 2564.022,
    "text": "The idea would be you'd have to have an LLM that had the capacity to actually go and explore information itself, and then presumably it'd have from an active inference take, it would have to have its own preferences of how to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.002,
    "end": 2574.617,
    "text": " that it wants to realize, so to speak, or a C matrix or a C vector in the POMDP scheme or however you would like to think of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.937,
    "end": 2580.605,
    "text": "And so it boils down to the idea that an LLM is passive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2582.227,
    "end": 2589.537,
    "text": "It can't go explore, it can't update information and expand its state space dynamically or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.517,
    "end": 2617.701,
    "text": " or do things that maybe a more active uh agent could um it's kind of like okay well once you've trained it like that's what you've got uh nonetheless i'm very curious about the paper that yeah because that looks like it it's it's actually saying no llms are not entirely passive but let's talk about it yeah that that's all true and also what's really interesting though is the um i mean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.12,
    "end": 2640.482,
    "text": " what what we might call ecosystems of shared intelligence or just the multi-agents prompting they're like when you on perplexity ai or on um any internet enabled like cloud provider um or even if even in the uh local retrieval augmented generation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2641.205,
    "end": 2669.17,
    "text": " where it's like you have a library of documents and then the it pre um assembles into the context window what's relevant like that's an information forging so this is kind of like um is it active inference like low road like has it been constructed according to chapter six using like forked code from an active repo or is it just being described as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2670.297,
    "end": 2685.496,
    "text": " in terms of having particular states, like figure 9.1 with the kind of rat in the maze, like making a cognitive model of another language model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2687.999,
    "end": 2697.891,
    "text": "That doesn't mean it will be useful to do that, but these models are prompting each other in ways that makes them have epistemic value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2698.546,
    "end": 2723.052,
    "text": " like they do do web searches even if one language model locally doesn't have certain properties so there's a lot of thumb interactions which is kind of only to be expected and even these other these systems are are basically multi-agent models like like the large ones that are closed source",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2727.301,
    "end": 2732.306,
    "text": " but not in the kind of spatial mobility way probably, just like in the combining inputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2737.852,
    "end": 2738.213,
    "text": "Gotcha.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.273,
    "end": 2745.38,
    "text": "I was actually personally not familiar with the fact that these are technically multi-agent setups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.423,
    "end": 2748.284,
    "text": "That's really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2748.304,
    "end": 2751.547,
    "text": "It also makes an immense amount of sense actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.509,
    "end": 2754.27,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.537,
    "end": 2756.119,
    "text": " And they're working off of one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.139,
    "end": 2771.695,
    "text": "I'm not trying to over relate, but just given this is the textbook group, of course, it's like, you know, we had the bird song example where the birds are trying to help each other, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.956,
    "end": 2777.661,
    "text": "Not, you can't, that's an interpretation to say that they're trying to help each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.741,
    "end": 2782.306,
    "text": "But the point being that they're both trying to minimize their prediction errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.406,
    "end": 2783.127,
    "text": "And so they're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.647,
    "end": 2809.738,
    "text": " playing off of one another sharing information with one another or in this case a song i guess with ellen llms in a certain sense of course i'm being constructed very differently we're talking about this right now that they're kind of working off of one another too yeah yeah i think another good uh point there in the context of building the models is like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.972,
    "end": 2839.084,
    "text": " it's not necessarily about building like one Megatron agent that has every property it's about like what things are there and then starting to describe their interfaces which are usually less ambiguous and then describing the things and and their interfaces and interactions then maybe all you need is a oscillator",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.819,
    "end": 2863.57,
    "text": " versus like a lot of times the kind of speculation about very advanced kinds of models but as we're putting on rx and fur like which is awesome too the um the the philosophy far outruns simple models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2870.367,
    "end": 2900.222,
    "text": " so depending on what we're really trying to explore just you know describing and then having and then having the modularity of the model so we could start with a pendulum but then know that the interface would be described like in a stable way in rx infer so that would have made large progress towards different kinds of phenomena without necessarily getting caught up in trying to locate it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2900.962,
    "end": 2904.125,
    "text": " too early in a given architecture for a single agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2910.312,
    "end": 2911.893,
    "text": "Can I do one more question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.294,
    "end": 2927.61,
    "text": "Does this idea of the synchronization refer back to the phrase you used earlier about, was it community of something or a shared?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.552,
    "end": 2957.513,
    "text": " something yeah yeah i think here's here's a good citation okay good this one's that it was on archive for some time and then it was published here here's the ecosystems of intelligence or share intelligence and this kind of lays out i guess other people can also give their summaries i see it it doesn't make any technical advances or descriptions there's only one figure",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2957.881,
    "end": 2987.179,
    "text": " um it's just laying out this idea of the interacting things through message passing this is the figure here's some manifolds and then belief updating interesting reading format and then um then they just talk about how message passing amongst diverse intelligences in ecosystems of shared intelligence",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2989.083,
    "end": 2990.885,
    "text": " That's kind of the frame.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.945,
    "end": 2994.73,
    "text": "Then they describe these stages of development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2997.894,
    "end": 3007.266,
    "text": "Kind of an interesting read in terms of their timelines, descriptors, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3013.554,
    "end": 3013.774,
    "text": "Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.275,
    "end": 3014.555,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.675,
    "end": 3016.778,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.023,
    "end": 3044.082,
    "text": " So it looks like in that paper they're describing like certain aspects of one agent's own model act as points of reference for other agents and vice versa so that you end up with this kind of like ecology of belief sharing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.209,
    "end": 3050.901,
    "text": " A kind of collective intelligent intelligence resting on shared narratives and goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.943,
    "end": 3059.438,
    "text": "Again, not to to over relate everything here, but with the bird song example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.042,
    "end": 3071.625,
    "text": " I had actually this past week took some time to actually read that paper itself, the birdsong one, not just its briefer description in the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.286,
    "end": 3078.619,
    "text": "And there's a lot of interesting things actually going on in that 2015 birdsong paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.979,
    "end": 3080.903,
    "text": "In some ways, this might be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3081.288,
    "end": 3111.244,
    "text": " is designing ecosystems of intelligence for first principles more than likely has some relationship there because the birdsong example, it's not just of course, it's not just about trying to talk about distinctly birds and songbirds and like, you know, as interesting as that could be from a biological or zoological or otherwise standpoint, it's really trying to get at something like how do agents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.253,
    "end": 3117.104,
    "text": " share information with one another and kind of entrain one another?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.124,
    "end": 3123.698,
    "text": "How and why do we see things like convergence of beliefs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.252,
    "end": 3130.018,
    "text": " As far as biological organisms go, we can see synchronization of things beyond the words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.36,
    "end": 3145.035,
    "text": "We can see whenever two people are talking to each other, the rate of their speech tends to begin to converge over time or exhibit near identical characteristics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.717,
    "end": 3153.364,
    "text": "The kind of vocabulary that people use tends to kind of sync over time as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.344,
    "end": 3171.825,
    "text": " And then, yeah, there's so there's this kind of shared narrative, a kind of, you know, from a single agent perspective, the single agent is starting to model the behavior of the world around it, the process as well as its own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.565,
    "end": 3194.32,
    "text": " two agents might start to model each other and in a sense uh they're the birdsong paper claims it's not just that once you get to this multi-agent setting where where the agents are in training one another and starting to show identical behaviors and internal model mappings and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.89,
    "end": 3196.953,
    "text": " modeling of the world of each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.934,
    "end": 3203.06,
    "text": "It's not just that they're modeling the other bird's behavior or their own behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.501,
    "end": 3212.933,
    "text": "They phrase it as they're beginning to model like our behavior, like there's a kind of collective behavior on the horizon here that they're starting to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.755,
    "end": 3221.404,
    "text": "Yeah, I just think that's a very, very interesting and potentially one of the core aspects of trying to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.076,
    "end": 3228.589,
    "text": " to get into this kind of collective intelligence synchronization kind of logic here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.609,
    "end": 3228.969,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.43,
    "end": 3231.695,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3231.735,
    "end": 3232.256,
    "text": "Great point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3232.296,
    "end": 3241.333,
    "text": "I mean, when it's on a one dimensional manifold, like in the extreme case or even just as a heuristic, like if 80% of the variability is captured by one number,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3241.313,
    "end": 3264.267,
    "text": " like you're on a one-dimensional manifold on the two-dimensional space that's the that's what a manifold is and then yeah you're totally right this is not really a uh it's not an ornithology paper in the traditional sense because it is about hermeneutics and it is with this other joint paper that they reference that's like a twin paper",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3266.137,
    "end": 3274.144,
    "text": " And so it's totally interesting that it has a lot to do, like you said, with narrative and with interpretation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3274.184,
    "end": 3282.932,
    "text": "Here, they take a dynamical systems approach to interpretation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3284.313,
    "end": 3296.143,
    "text": "Later, that is also expanded and complemented by the quantum reference frame, Chris Field's syntax and semantics work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3297.22,
    "end": 3305.409,
    "text": " but this is like a perception action grounded dynamical hermeneutics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3308.553,
    "end": 3320.687,
    "text": "So not addressing all semantic or semiotic questions, but like how dynamical systems can have general synchrony, which doesn't mean doing the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3321.568,
    "end": 3325.472,
    "text": "It can mean mutual information increases",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3326.718,
    "end": 3350.43,
    "text": " through differences like or in um in the chris fields setting like the the principle of unitarity and likes that systems um come into entanglement with each other and then that was discussed like does that mean that they go to the same states like no not necessarily can i say as a counselor",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3350.9,
    "end": 3356.589,
    "text": " who goes into conversations with people where they know their world, but maybe they're stuck.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3356.769,
    "end": 3360.515,
    "text": "And I don't know their world, but I have models of how to get unstuck.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3362.979,
    "end": 3366.604,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3369.949,
    "end": 3371.191,
    "text": "Very, very, very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3371.231,
    "end": 3371.592,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3373.529,
    "end": 3377.358,
    "text": " yeah no super super interesting, I mean, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.922,
    "end": 3384.976,
    "text": "I think there's enough to go off of here at least theoretically that potentially one of the key.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3386.178,
    "end": 3388.163,
    "text": "aspects of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.56,
    "end": 3403.907,
    "text": " counseling as well as other things, clinical therapy and so on, is that just basically a so-called talking cure or some such things for someone who's having a kind of repetitive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.343,
    "end": 3426.992,
    "text": " uh you know behaviors or thoughts or you know whether you want to view them from a symptomatic perspective in the cases of like i don't know depressive rumination or a variety of other kind of things that come up like in one sense from an active inference perspective it might be that someone is having something like difficulty with belief updating and that by talking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3427.698,
    "end": 3436.329,
    "text": " like actually just talking with another human being, you might see the person who's who's the client.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3436.509,
    "end": 3456.355,
    "text": "You might start to see them like, you know, not not to be too theoretical or kind of philosophical here, but there's almost a kind of potential sinking to some degree of what we might call their internal states or their behaviors or otherwise with that of the counselor or the therapist, you know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.398,
    "end": 3486.865,
    "text": " whole different set of questions and and research to be done or research that's already been done just try and claim like that that can have a long-term impact of course like in counseling or therapy like there are regular sessions so you're getting like repeated instances of these these temporary sinking uh syncing up episodes going on and then another aspect of course is that the counselor or therapist they don't want to actually themselves",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.845,
    "end": 3516.261,
    "text": " imitate um the behaviors being seen by the client they want to help not match um but yeah just you know just try and extrapolate a little bit here that's why we have a fairly precise definition of empathy it's as if we were feeling the same as our client as if we were in their world but not actually being in their world",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3517.81,
    "end": 3528.917,
    "text": " i have to leave thank you so much all right sure next time towards chapter nine thank you andrew so see you all next time bye take care",
    "speaker": "SPEAKER_03"
  }
]