[
  {
    "start": 3.085,
    "end": 6.45,
    "text": " Okay, welcome back, Cohort 7.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7.492,
    "end": 26.139,
    "text": "We're discussing Chapter 4, so anyone can bring up any comment or anything they remembered or a question from 4 or some other comment from earlier on, or we'll look at the chapter or look at questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 26.24,
    "end": 31.928,
    "text": "But first, does anyone have a comment or just anything else they want to kick it off with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.249,
    "end": 35.642,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.881,
    "end": 97.842,
    "text": " okay type in the chat or raise your hand or anything um chapter four has two roads leading into it with chapter two and three so this is really where we see active inference generative models after the more general context of one and then the low and the high road in in chapters two and three um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 101.298,
    "end": 108.225,
    "text": " Anyone, like, is there a part of four that anyone wants to go to or just a quote that's interesting just to begin with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.563,
    "end": 126.884,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.085,
    "end": 129.246,
    "text": "4.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 130.12,
    "end": 140.756,
    "text": " single paragraph describes in very concise kind of LLM-like style what the next sections are going to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 144.782,
    "end": 148.247,
    "text": "Section 4.2 goes from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 149.375,
    "end": 159.4,
    "text": " Bayes equation, Bayes theorem, exact Bayes, which is exactly how you update the prior into the posterior given an observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.46,
    "end": 164.633,
    "text": "That's a calculation that is done like in one fell swoop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 165.862,
    "end": 195.801,
    "text": " idea of using some bound on exact bayesian inference so the idea of doing approximate bayesian inference using some other proxy not surprise exactly but a bound on surprise like variational free energy the idea here is that that bound could be picked to have certain properties like be able to optimize it incrementally with gradient descent like in machine learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.552,
    "end": 206.537,
    "text": " Like the title of the section, they do start with Bayes' theorem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 210.861,
    "end": 229.298,
    "text": "Though this chapter also says that it will present the active inference generative models, and it does, there are a few kind of background detours or interludes, like Jensen's inequality,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 233.378,
    "end": 259.825,
    "text": " towards equation 4.2 uh they use the definition of surprise as log likelihood and then through the usage of that log or just any function that has like a decreasing uh rate of decrease of the slope but never turning back negative um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 259.99,
    "end": 276.868,
    "text": " the log surprisal allows like a um strict bound to be described which is called the free energy or negative free energy like just depending on the negative sign",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 293.96,
    "end": 319.495,
    "text": " um okay jonathan shock a previous uh participant in a math teacher i think professor has written this document let's just see it for a second some of these it's like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.963,
    "end": 347.625,
    "text": " okay I think this date is automatically chosen but that would be interesting if he updated it so recently let's look through this while there are some superb explanations in the book there are important details left out in the derivations which may not be that important on the first pass but I think make things much clearer when you want to understand it in detail",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 354.997,
    "end": 357.36,
    "text": " Our general aim will be to observe things that we expect to observe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 357.601,
    "end": 361.106,
    "text": "We will come on later to the things that we want to observe when we think about preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 361.807,
    "end": 366.754,
    "text": "But for now, we can just think about the things that our model predicts that we are likely to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 371.821,
    "end": 373.604,
    "text": "Here's the part with Jensen's inequality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.085,
    "end": 376.628,
    "text": "So exact base, 2.1, just like in the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 377.409,
    "end": 378.591,
    "text": "Jensen's inequality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 383.583,
    "end": 387.89,
    "text": " This is going into more lines of detail from what is in the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 393.859,
    "end": 399.047,
    "text": "This gives some lines to follow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 399.107,
    "end": 405.878,
    "text": "This bottom line here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 406.668,
    "end": 410.213,
    "text": " Here's surprisal, log likelihood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 410.594,
    "end": 435.51,
    "text": "This is the likelihood of that observation, and then log likelihood for a variety of reasons, to get some zero one interval properties, to get that boundedness, to be able to compare multiple, like orders of magnitude of probability,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.317,
    "end": 438.001,
    "text": " So this is whatever it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 439.464,
    "end": 452.014,
    "text": "Here's the KL divergence between the distribution that you can control your surprisal from and the empirical distribution peak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 461.191,
    "end": 485.578,
    "text": " um chapter 2.5 or chapter 2 equation 2.5 had the variational free energy and there's multiple lines it seems like he's going into more detail here connecting how free energy is described in chapter two and and then expected free energy in equation 2.6 and then connecting it more to chapter four",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 499.835,
    "end": 514.097,
    "text": " so that's that's also kind of a background math like a standalone math thing any ideas or questions on 4.1 or 4.2",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 541.297,
    "end": 545.501,
    "text": " Okay, so 4.1, again, single paragraph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.682,
    "end": 547.604,
    "text": "Yeah, Jeff, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.624,
    "end": 570.207,
    "text": "Yeah, no, I was recently reading a paper and actually talking to Hector Dean and Magdalena about how the decision making process, you know, binary tree branching, it doesn't scale",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 572.009,
    "end": 576.816,
    "text": " It needs to be bounded, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 576.896,
    "end": 590.616,
    "text": "Like we can only make one decision at one point in time, but we're limited by our, you know, by the body that we inhabit and our signal processing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 594.221,
    "end": 594.321,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.54,
    "end": 629.505,
    "text": " when you have when you have systems of systems who are you know a scale free right uh nested agents right who are interdependent their their loss and compression there in order to isolate the signal from the noise",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 631.595,
    "end": 641.568,
    "text": " and also have a pruning function for that decision tree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 641.608,
    "end": 650.7,
    "text": "That's just where my mind is right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.702,
    "end": 653.244,
    "text": "Thanks, Jeff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.264,
    "end": 655.847,
    "text": "Yeah, these are good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 656.637,
    "end": 674.397,
    "text": " you point to these kind of constraints on the inbound with the signal processing, and then the constraints on the outbound, I mean, the ultimate constraint on the outbound, one embodied body being able to only do one posture at once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 675.478,
    "end": 684.889,
    "text": "So it's this tension between, okay, you could plan out all these multi-joint actions, a couple of joints, a couple of affordances, a couple of time steps, that could be like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 685.055,
    "end": 686.557,
    "text": " all the atoms of the universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.598,
    "end": 710.446,
    "text": "And then so it's, it's, it's really interesting because Seth Lloyd and program in the universe, which she wrote back in 2006, he shows very clearly that like, you know, a game board, not big, not much bigger than a, than a go set has more potential states than all the, all the matter and energy in the universe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 711.367,
    "end": 711.687,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 711.903,
    "end": 734.586,
    "text": " so like you know in one run of the universe you will not explore all the potential states that could possibly exist yeah and i i don't know about the branching uh like multiverse but sometimes it's like that's just like saying it's kind of acceptance of that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.663,
    "end": 745.499,
    "text": " whether that's an epistemically strong stance or whether that's a cope, but it's just like saying, yeah, that much branching really does happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 745.599,
    "end": 752.45,
    "text": "It's like, okay, but it doesn't really get around that like chessboard explosion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 752.51,
    "end": 762.666,
    "text": "And then, I mean, that just is essentially an empirical validation that cognitive heuristics are used for sense-making and decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 763.878,
    "end": 773.51,
    "text": " Even when you model very small sequential domains, it becomes very unwieldy, very quick as you scale the board.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 781.981,
    "end": 786.527,
    "text": "One active connection there is this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.929,
    "end": 793.288,
    "text": " branching time, active inference direction, and maybe a little bit of more recent work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 794.05,
    "end": 797.58,
    "text": "This is drawing methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 797.999,
    "end": 825.947,
    "text": " from dealing with these tree and combinatoric explosions whether that's whether you think about that in the combinatoric explosions of interpretations on the inbound or like action select joint action planning uh or time or plan that kind of tree search has been a classic problem like chess algorithms and and deep blue and beyond",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.568,
    "end": 832.835,
    "text": " Yeah, and AlphaGo and AlphaStar and whatnot, they've solved these for a specific domain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 832.855,
    "end": 838.602,
    "text": "Exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 839.043,
    "end": 844.409,
    "text": "And broadly, some of those approaches are Monte Carlo based.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 844.469,
    "end": 846.912,
    "text": "Monte Carlo is like a city where gambling happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 847.653,
    "end": 851.057,
    "text": "So these are the gambling sampling based approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.594,
    "end": 858.322,
    "text": " And then an alternative complementary approach, like some problems where both, neither one or the other do well, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.382,
    "end": 875.241,
    "text": "But another approach is to cast that as a variational inference or as a Bayesian inference problem, and then use variational methods to approximate the posterior, whereas Monte Carlo samples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 876.162,
    "end": 881.027,
    "text": "And Lance da Costa has done a lot of work on the sampling and the variational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 881.125,
    "end": 897.177,
    "text": " uh approaches but that that's uh yeah a few other random thoughts like it's it's easy to make a cognitive behavioral model that's like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 897.815,
    "end": 901.319,
    "text": " it's just like maps that don't map to territory as well for one reason or another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.339,
    "end": 903.661,
    "text": "I mean, you could make it wildly overpowered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 903.721,
    "end": 911.85,
    "text": "Like you could have it be a mouse foraging model with a gigabyte of short-term memory of the GPS location.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.95,
    "end": 918.377,
    "text": "It's like the model won't complain that mice don't actually remember the GPS coordinates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.779,
    "end": 925.645,
    "text": "So taking into account those constraints,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.975,
    "end": 949.0,
    "text": " is often like the hard or a hard part of empirical modeling whereas if one is just more interested in like a looser like bio-inspired approach and then is seeking performance or some other attribute just loosely based upon biology then of course there's there's nothing holding back",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 949.385,
    "end": 969.402,
    "text": " but to actually connect and make useful predictions for a given like biological system then how how um that gets represented becomes challenging because it isn't just about making like the highest performance model because it's more about fitting to empirical data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 985.177,
    "end": 1014.002,
    "text": " There's many ways in practice to deal with this, ranging from coarse-graining data to picking simpler variational distributions using different kinds of model architectures so that there aren't like wide computations like the all by all by all, like you just figure out other ways",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1015.484,
    "end": 1020.816,
    "text": " to structure the problem so that the computational properties are not so disadvantageous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1022.059,
    "end": 1030.658,
    "text": "If it really even is a problem at that scale, there can be major heuristics like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1031.262,
    "end": 1038.414,
    "text": " If the input data were 4K video, I mean, one approach you could take that in as a huge matrix with like millions of numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1039.275,
    "end": 1041.699,
    "text": "And then in that case, maybe it is hard to run on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.819,
    "end": 1053.979,
    "text": "But then maybe another approach like passes the video frame to an LLM and then gets back an estimate on which items are in it and then takes in that list of items.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.55,
    "end": 1057.896,
    "text": " So there's a lot of ways to deal with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.838,
    "end": 1067.174,
    "text": "And also just to study, okay, how does the runtime change as a function of like the size of the input or the number of sensors?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1067.234,
    "end": 1073.706,
    "text": "Like, is it linear as adding more sensors or sublinear or is it super linear?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.871,
    "end": 1084.099,
    "text": " 4.2 is another background, but a really important intuition figure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1085.06,
    "end": 1094.491,
    "text": "This sets us up to look at the Bayes graphs that will be like the POMDP and represent the perception and action components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1095.272,
    "end": 1107.507,
    "text": "But happily, this is not unlike a systems dynamic or systems modeling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.027,
    "end": 1111.791,
    "text": " or just kind of like mind map or flow chart representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1111.811,
    "end": 1123.865,
    "text": "I mean, just talking about day-to-day situations, like there was a lightning strike and then there was light and sound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1125.206,
    "end": 1136.599,
    "text": "I mean, maybe somebody wouldn't draw the two and the three boxes, just draw X directly connected to Y and to W, but topologically, this is pretty much",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1138.013,
    "end": 1160.376,
    "text": " what is is conversationally described when people are talking about um observed and unobserved phenomena any random thoughts on that or or like just things people seeing this or about these base graphs overall I saw the muzzle muzzle flash and then I saw the impact",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1165.25,
    "end": 1187.848,
    "text": " that's similar yeah here that's like this one yeah that same idea that okay nodes are going to represent distributions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.318,
    "end": 1205.761,
    "text": " being between zero and one, like probability distributions, or just random variables, like it could be a number between one and 10, or it could be just different kinds of support for those variables, different values that they could take on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1206.823,
    "end": 1209.887,
    "text": "So it's kind of just like a variable in a program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1210.137,
    "end": 1235.267,
    "text": " um that same idea that variables are declared and then their their connections and influences are represented with edges and some of these are observables the o's meaning that they're kind of taken even if they're understood to be a noisy sensor still the observation is taken as it is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.703,
    "end": 1260.85,
    "text": " um and then unobserved variables like the latent states and then the the sort of connection between signal processing on the bottom and control theory on the top and then that work is done with the b matrix with three",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.994,
    "end": 1281.792,
    "text": " which is the probability function that maps the hidden state like the real temperature in the room at the next time point conditioned upon the current time point and the current behavior so this is a uh action conditions Markov transition Matrix",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.455,
    "end": 1285.923,
    "text": " S is like a vector.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.983,
    "end": 1292.237,
    "text": "It could be like one temperature data point in the room, or it could be like a vector of thermometers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1292.723,
    "end": 1319.929,
    "text": " this b is like a stack of index cards each card is s by s dimensions it just describes from and two so if you don't have any affordances or if there's just one affordance like this the just this downstairs part of the system is unfolding with with no action selection then it's just like from and two and that's like a markov transition matrix",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.112,
    "end": 1334.866,
    "text": " And then policy selection is just selecting which of those index cards is going to be used for picking the transition to the next time point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1334.886,
    "end": 1346.457,
    "text": "And then kind of a simpler but analogous role is played by the A matrix, which can be used to go from a given hidden state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1346.572,
    "end": 1348.294,
    "text": " to a distribution over outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1349.115,
    "end": 1355.021,
    "text": "So it's like, I know that my thermometer has plus or minus one measurement noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.682,
    "end": 1362.149,
    "text": "So if it were really 81, then I would expect this distribution between 80 and 82.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.169,
    "end": 1369.017,
    "text": "That's using it in the forward direction, like generating synthetic data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1369.878,
    "end": 1376.545,
    "text": "And then also there's taking in a point measurement and then updating your prior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1377.976,
    "end": 1401.3,
    "text": " to what your best belief is now not shown here but that's basically where attention comes into play if you are not attending to the observation then it has no impact if you have complete attention to the observation then it overrules your prior and you update your belief to the observation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1402.343,
    "end": 1411.697,
    "text": " So that's like the precision or the kind of sharpness on A and how it relates to the strength of the product.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.481,
    "end": 1424.255,
    "text": "Figure 4.3 shows on the top the discrete time setting and on the bottom, the continuous time setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1424.275,
    "end": 1427.76,
    "text": "The kind of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1429.597,
    "end": 1456.971,
    "text": " structural similarity is highlighted like with using the same box numbering for the action selection state transition and the sense making component one one three and two boxes at the same time different notation letters are used like o for the observations industry time and y um for continuous time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1457.204,
    "end": 1470.838,
    "text": " highlighting structural similarity with generative models, whether they used discrete time or continuous time, while also highlighting their differences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.098,
    "end": 1484.612,
    "text": "And the major difference is that in discrete time, discrete specific time steps are considered, like S of T, T plus one, T plus two, for a given horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.048,
    "end": 1505.029,
    "text": " Whereas in the continuous time setting, which is less about like transitions between states, discrete states, and more about like a continuous differentiable line passing through the present, this is more analogous to the Taylor series expansion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.391,
    "end": 1511.376,
    "text": "So there are not actually future time points specifically predicted,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1511.508,
    "end": 1522.119,
    "text": " The only specific evaluation of the function is at the current time point, and then the past and the future get fit with the Taylor series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1538.517,
    "end": 1541.38,
    "text": "Being able to fit further and further out",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.967,
    "end": 1543.689,
    "text": " with more and more approximations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.542,
    "end": 1563.358,
    "text": "So plus here for one low cost, you do have a prediction for every past and future data point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1564.92,
    "end": 1569.747,
    "text": "The downside is it's hard to even know how relevant",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1570.52,
    "end": 1591.397,
    "text": " that prediction is so like here we take the first uh we take the first pass which is just evaluating it at the current moment that's just this point then you take the first derivative that point and you get the red line so it's like okay so it's going up in the in the right and it's going down to the left",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1591.934,
    "end": 1599.667,
    "text": " But then let's say you expand your approximation and now you're in the third powering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.87,
    "end": 1606.839,
    "text": "But even though in the area around zero, it still has the same slope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1607.82,
    "end": 1614.491,
    "text": "But now there's a totally different story with it going off to infinity quickly to the left and then down to the right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1615.413,
    "end": 1617.857,
    "text": "And then go into the fourth powering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1619.221,
    "end": 1621.605,
    "text": " And maybe it's a different story again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1621.625,
    "end": 1639.853,
    "text": "So even though, again, it's all being guaranteed to get more and more accurate in the neighborhood, but knowing, even getting a precision on, well, how close is my prediction to the real one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.334,
    "end": 1643.018,
    "text": "That can be challenging to know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1643.082,
    "end": 1671.098,
    "text": " then it is an empirical question like how good of approximation is this taylor series expansion this gets revisited in chapter seven and eight so i mean this is kind of the main generative model description of the book since two and three get us to the generative models and six is about how to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1672.732,
    "end": 1690.011,
    "text": " design them, and five is about some specific ones that are used, and then nine about getting connected with the data, this figure, and then chapter seven and eight, which it sort of anticipates, are the main generative model descriptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1694.336,
    "end": 1696.518,
    "text": "So this is like a micro chapter seven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.883,
    "end": 1702.705,
    "text": "Yeah, go for it, Carlos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.123,
    "end": 1708.29,
    "text": " Yeah, so that applies also to the action of doing nothing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.198,
    "end": 1714.364,
    "text": " Among the different potential policies, one is always doing nothing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.384,
    "end": 1733.265,
    "text": "So that if I do nothing, for instance, it doesn't matter if it's in the continuous or the discrete approximation, you can refine your inference either by making continuous observations by doing nothing, even if you don't interact with the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.768,
    "end": 1746.69,
    "text": " Right or or the system itself could could without doing anything from your side could evolve and they naturally evolve so that applies also to that policy to the policy of doing nothing right is this correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.052,
    "end": 1754.443,
    "text": "yeah great great comment like um how is doing nothing dealt with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1757.191,
    "end": 1763.457,
    "text": " So sometimes, let's just say we're in a grid world movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1763.477,
    "end": 1768.242,
    "text": "Sometimes do nothing is incorporated as an affordance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1769.023,
    "end": 1774.108,
    "text": "So there's like up, down, left, right, stay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1776.51,
    "end": 1786.54,
    "text": "Another approach would be higher level, stay or move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1787.92,
    "end": 1816.02,
    "text": " then lower level up down left right so those either those could be used um and i mean you you point to a really important question which is the control theory and game theory it's often just framed like it's obvious when action should be taken and so in the turn-taking game like chess",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1816.405,
    "end": 1821.75,
    "text": " You could talk about like, well, you know, when should this pawn, you know, advance or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1822.391,
    "end": 1825.134,
    "text": "But that's within the game time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1827.176,
    "end": 1829.138,
    "text": "It's an alternating turn taking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1829.818,
    "end": 1843.392,
    "text": "But then when there's a system that's changing external, then like, I mean, like an economic market, it's like timing the market.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.671,
    "end": 1863.227,
    "text": " there might be way broader changes that your actions are less influential on such that for achieving like pragmatic or epistemic value, it almost matters less which action is done, but more about like when it's done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.47,
    "end": 1873.176,
    "text": "So that's like kind of another flavor of control theoretic question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1873.561,
    "end": 1878.548,
    "text": " but it's not really so easy to address in the turn-taking game setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1879.75,
    "end": 1885.618,
    "text": "But it is more kind of amenable to ecosystems where things are really happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.98,
    "end": 1887.221,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.062,
    "end": 1894.811,
    "text": "More dynamic ones in which, you know, you cannot infer the state just by one observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.851,
    "end": 1902.943,
    "text": "You need to wait for a number of observations that come along in order to be able to make a good inference of the current state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.337,
    "end": 1914.146,
    "text": " Yeah, I mean, that's, that's even another angle, which is like, let's just say that measurements cost us one, like there's just a cost per measurement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.093,
    "end": 1917.979,
    "text": "Um, so we have a budget.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1918.82,
    "end": 1946.818,
    "text": " so we can't just you know get a million measurements in a split second but then also there's like a rate of change of the underlying system this is like buying stock Market trading data or like planning and experimental data so then there it's this assessment of like well for deciding on what to do that's like the actionable side what is the trade-off of like which measurements and when to make those measurements yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.87,
    "end": 1966.754,
    "text": " Some of these would be really interesting to kind of sketch out and just show how different heuristics would lead to different kind of biases in the sense-making and decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1967.735,
    "end": 1976.367,
    "text": "If you have a certain number of credits for how much measurements you can make,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1976.414,
    "end": 2001.696,
    "text": " well if you immediately pursue the highest precision then you're initially even if it is initially accurate then that assessment would become inaccurate if you wait until the very end you cross the finish line like with the highest accuracy but then for for most of the time you had the least of an idea well if you if you space it out then like you may have a lower level but but above nothing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2004.427,
    "end": 2016.299,
    "text": " So then like that kind of comes back to this constraints topic and how the interesting pieces about how do you model those constraints?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2019.242,
    "end": 2028.932,
    "text": "Because that's where the decision, like the kind of wide open space, that's why it's so hard to predict what an E. coli, I mean, or a mouse will do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2037.029,
    "end": 2042.235,
    "text": " Yeah, but yeah, definitely about doing nothing is as that's that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2059.915,
    "end": 2066.462,
    "text": "Or I'm just thinking of in like an agent based model, sometimes there even is no stay option.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2066.881,
    "end": 2094.373,
    "text": " so then there's like a lot of movement just moving between two squares back and forth like if they're already on kind of a local Maxima or something but it's like but that that kind of behavior isn't really seen but that just because there isn't a stay option but just like walking around like the bird is just like sitting on the tree not like spending not resting by hopping back and forth",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2096.159,
    "end": 2119.787,
    "text": " that's like a that's a that's a huge difference but that's just about having that's just about the structure of the model and how it's being fit yeah understood thanks yeah also it highlights how like free energy is very model specific so just whether thinking of the the perceptual",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2120.037,
    "end": 2148.255,
    "text": " variational free energy calculation, like just the sense-making from noisy and partial data, or the action selection as an inference problem, that free energy calculation is based upon the data, the family of variational distributions, the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2149.231,
    "end": 2172.37,
    "text": " then that it yes that's an instrumentalist perspective but it highlights why like well what's the free energy of that squirrel why is it sitting on the ground like that it's like you're quite a ways off but if you described okay the data or the squirrel's location the variational distributions the gaussian that i'm making and the prior and the likelihood on location for the squirrel",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.514,
    "end": 2181.022,
    "text": " Here's why it is or isn't surprising to me why my model is returning a higher low free energy for the squirrel being there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2183.044,
    "end": 2201.344,
    "text": "But that's more of just describing your statistical model, but just a sort of qualitative description of free energy as if it was just naturally an unambiguous part of a biological system's kind of a stretch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2204.125,
    "end": 2205.687,
    "text": " I'm reminded of the halting problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2207.489,
    "end": 2207.97,
    "text": "Like how?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2210.133,
    "end": 2211.875,
    "text": "Like you can, you know, write endless loops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2217.602,
    "end": 2226.353,
    "text": "Kind of, kind of reminds me of, uh, you know, Hofstetter too, you know, good Lesher and Bach and, uh, uh, I am a strange loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2238.128,
    "end": 2266.617,
    "text": " while at uh I'm gonna welcome back to the this was uh uh in this this workshop over the previous days Chris Fields gave this talk I'll put it in our in our uh page and I'll put it in the chat and it just sort of there's it was just some interesting discussions like well you know never step in the same River twice we're we're never the same",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.318,
    "end": 2288.149,
    "text": " we're we're whether you take that from a material like breathing co2 and oxygen on food um or just information and like planning and stuff like that it's like we're never the same so then what this part was really interesting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2290.441,
    "end": 2313.58,
    "text": " the neural like the i don't know if this comes from the isochade or from the motor like analogy function or something like that but the embodied math and and just the the way that the category theory and i think other equations get um interpreted",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2313.745,
    "end": 2315.927,
    "text": " And then it's like, so then what is the same?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2315.987,
    "end": 2320.131,
    "text": "It's like, well, the identity is what is the sameness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2320.172,
    "end": 2326.318,
    "text": "But then it's like, but then your identity when you're 15, when you're 30, that is different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2328.14,
    "end": 2339.331,
    "text": "So it's just like, I don't think his talk answers it per se, but it gives some interesting stick drawings to begin with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.728,
    "end": 2361.775,
    "text": " exploring like that sameness and differentness which is one of the most kind of pervasive cross-modal aspects of experience yet at the same time it's it's really not so simple when the our identity materially and cognitively and metacognitively is changing but it does have a sameness too",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2371.289,
    "end": 2381.341,
    "text": " And he mentions Act-Inf and connects a little bit to the, he doesn't mention it, but the physics is information processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2392.513,
    "end": 2400.823,
    "text": "But just showing like the sort of usage of a variational free energy or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2401.073,
    "end": 2426.676,
    "text": " for like a phenomenological human state this is just prompted by the the girdle Escherbach it's like the whole point is that's a strange system it can't just be taken for granted like even what direction what layer of what was it that's why there isn't like an open source kernel for for the human minds it just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2427.871,
    "end": 2432.297,
    "text": " It seems to be so baffling and strange.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2444.093,
    "end": 2446.857,
    "text": "Again, revisiting equation 2.5 and 2.6.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2448.739,
    "end": 2453.085,
    "text": "Variational free energy, F of Q and Y,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2454.027,
    "end": 2478.921,
    "text": " it's with a belief distribution and a new data point so it's just like a real time um real time through time minimization it can include it could be a sense making only or it can include like instantaneous action inference so without explicit planning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.048,
    "end": 2508.402,
    "text": " single time step updating of beliefs including beliefs about action whereas if you want to get into explicit planning then expected free energy is used this is a lot like equation 2.6 still in the discrete time section this is just going through more details of stuff that's going to come back in chapter seven",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2508.955,
    "end": 2538.253,
    "text": " 4.5 continuous time, box, a blanketed off box on Markov blanket with its definition, upstream causes of X, downstream effects of X, and the co-parents of the children of X.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2541.119,
    "end": 2561.659,
    "text": " After that short definition, immediately going into these two methods, kind of like network propagation or percolation methods for having messages passed among nodes that implement this variational gradient descent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.608,
    "end": 2576.796,
    "text": " Here, it's shown with kind of another notation set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2581.18,
    "end": 2587.986,
    "text": "The left is showing a sort of classical predictive processing hierarchical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2589.067,
    "end": 2593.592,
    "text": "So observations through time are coming in, O tilde.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2593.612,
    "end": 2596.995,
    "text": "Each of these four that look closer together,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2597.465,
    "end": 2603.874,
    "text": " are one layer of the hierarchical predictive processing hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2605.897,
    "end": 2620.619,
    "text": "At each level, there's a descending prediction that's getting contrasted with the ascending observation, and then that is getting turned into an error residual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2621.099,
    "end": 2623.042,
    "text": "It's getting passed back up to a higher level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.726,
    "end": 2626.948,
    "text": "So here's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2627.266,
    "end": 2633.718,
    "text": " like primary sensory processing level, another nested level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.379,
    "end": 2638.066,
    "text": "And then I think just the error unit for like an overall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2638.747,
    "end": 2640.831,
    "text": "So this is like measurement coming in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2640.931,
    "end": 2642.133,
    "text": "This is like the ones place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2642.895,
    "end": 2644.197,
    "text": "This is like the tens place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.758,
    "end": 2648.425,
    "text": "And then this is just like green light, yellow light, or red light.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2648.585,
    "end": 2651.13,
    "text": "How accurate is the tens place prediction?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2652.308,
    "end": 2661.321,
    "text": " That's a snapshot or kind of through time emphasizing the hierarchical predictive processing architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2663.044,
    "end": 2666.609,
    "text": "Whether or how the brain does it is secondary to here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2666.669,
    "end": 2669.954,
    "text": "It's just, this is a modeling motif that's used in the Bayesian systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2671.256,
    "end": 2673.76,
    "text": "Here on the right,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2674.212,
    "end": 2701.333,
    "text": " is looking more through time so here just like in the top of figure 4.3 it's observations coming at the current time point and the past and the present uh the past and the future time point and then just showing a little bit of like kind of the information flow of how those updates get passed um in order to update beliefs about policy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2705.718,
    "end": 2733.987,
    "text": " including like and updating hidden states conditioned on policies it it says it omits some intermediate connection so it's like not exactly sure um how much to look into the edge connections but that it is fully described but here they they don't show all the edges",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.868,
    "end": 2744.534,
    "text": " Here, now we're kind of back into this continuous time case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2745.515,
    "end": 2747.498,
    "text": "This is a really important set of equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2748.319,
    "end": 2756.371,
    "text": "The SPM, statistical parametric mapping, or like anything involving neuroimaging, this is kind of a classic pair, as well as in physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2756.952,
    "end": 2762.661,
    "text": "So in neuroimaging, this is the observations coming in with like a signal and a noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.001,
    "end": 2765.325,
    "text": "Could be a sensor noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.345,
    "end": 2770.032,
    "text": "And then x dot is like a spatialized",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2770.737,
    "end": 2776.951,
    "text": " flow landscape of an underlying state like neural activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2777.893,
    "end": 2786.531,
    "text": "So the measurement of fMRI might be like just the intensity of the signal coming from a given voxel at a time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2786.571,
    "end": 2789.117,
    "text": "That's the observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2789.317,
    "end": 2794.765,
    "text": " which is due to underlying like blood flow changes and also noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2795.787,
    "end": 2801.495,
    "text": "And then there's this underlying neural activity landscape, which is x dot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2805.902,
    "end": 2810.869,
    "text": "So here's a situation where they're both normal distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2817.751,
    "end": 2821.556,
    "text": " 4.2, generalized coordinates of motion is the Taylor series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.842,
    "end": 2837.095,
    "text": "You can take the Taylor series or generalized coordinate motions on the observation and on the latent state x dot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2837.115,
    "end": 2842.442,
    "text": "So these are derivatives, first, second, et cetera, derivatives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2846.624,
    "end": 2856.035,
    "text": " And again, in the kind of classic hierarchical predictive processing scheme that the precision comes into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.045,
    "end": 2870.893,
    "text": "Laplace approximation, free energy may be approximated by a quadratic expansion around the posterior mode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.565,
    "end": 2877.841,
    "text": " So the mode is the most common, like the highest point on the probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2878.623,
    "end": 2882.172,
    "text": "The median is the 50th percentile data point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2883.115,
    "end": 2887.245,
    "text": "The mean is like the average value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2888.12,
    "end": 2892.188,
    "text": " The mode is just picking the highest point, which is like the single maximum likelihood estimate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2892.949,
    "end": 2899.822,
    "text": "And then the Laplace approximation is taking to the second power around that point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.583,
    "end": 2908.137,
    "text": "So you have a quadratic curvature and then fitting that quadratic distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.652,
    "end": 2917.003,
    "text": " So if, if, if it's not a, if there's not a central tendency, then of course, this will still only be able to fit a quadratic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2917.083,
    "end": 2927.138,
    "text": "So if it's like three humps, then you're either going to have a really over dispersed quadratic or have one that just fits over one, but it's an approximation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2933.918,
    "end": 2954.577,
    "text": " now it's again the hierarchical and the through time but instead of the o's it's the y's so now it's kind of swapped into the notation set of the continuous time that's chapter four",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.875,
    "end": 2994.52,
    "text": " five is gonna gonna do some reviews on neural systems which is where these models have been applied most but yeah four is where the degenerative models at least the simple motifs for discrete and continuous time aren't shown and there's there's other motifs and patterns like hierarchical and things like that but um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2997.554,
    "end": 3007.024,
    "text": " they highlight the difference and the similarities between the continuous and discrete time and that's like a big structuring element of the book with chapter seven and eight",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3036.907,
    "end": 3040.012,
    "text": " Daniel, just a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.773,
    "end": 3050.267,
    "text": "I haven't seen yet any real world problem that has been using this type of hierarchical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.988,
    "end": 3052.931,
    "text": "Everything I've seen so far is flat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.512,
    "end": 3062.205,
    "text": "Can you give me some examples or references, links to works that use hierarchical model, please?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.663,
    "end": 3083.187,
    "text": " Yeah, good, good question for forum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3083.247,
    "end": 3095.447,
    "text": "This robot navigation paper describes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3097.129,
    "end": 3098.892,
    "text": "Okay, it's not an open access paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3113.519,
    "end": 3133.435,
    "text": " here's their hierarchical model so this is one setting in a multi-scale movement like locations in a warehouse and then robot body postures that's that's like one where the higher and lower level are both um like mechanical and positional um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3136.807,
    "end": 3160.57,
    "text": " the hierarchical hybrid model with continuous on the lower level and discrete on the top is kind of the folk psychological template that's that's that um in this smith at all paper i mean they argue this is basically the um implicit or explicit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.343,
    "end": 3168.11,
    "text": " generative model when people talk about, in a folk psychological sense, let's see if they have any.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3173.176,
    "end": 3174.878,
    "text": "I don't know if they have the visualization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.678,
    "end": 3180.884,
    "text": "And then I think, okay, those are a few.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3180.904,
    "end": 3190.995,
    "text": "In the implementations, I agree, they're usually single layer,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3192.663,
    "end": 3219.767,
    "text": " uh it could be a range of things ranging from advanced models um happening uh proprietarily another option is that a model like um for example alex aurorbia's work and uh these kind of the neural uh generative coding this this does make hierarchical models",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.832,
    "end": 3228.024,
    "text": " So there's a flatness because it's like a neural topology, a neuromorphic system, but then the calculation it implements could still be hierarchical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3232.19,
    "end": 3238.178,
    "text": "And I think another interesting direction to explore",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3257.834,
    "end": 3260.919,
    "text": " Danajar Hafner, Dream to Control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3260.979,
    "end": 3273.557,
    "text": "Information gain in the planning objective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3275.56,
    "end": 3279.586,
    "text": "Carl Fursten mentioned sometimes dreamers like some variation of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3282.991,
    "end": 3286.997,
    "text": "I think the textbook clearly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3287.585,
    "end": 3315.972,
    "text": " shows the model doesn't have to be hierarchical like architecturally or functionally for it to be active inference even for for perhaps interesting or multi-scale behavior to arise definitely showing more clear nested models that will be interesting and understanding like okay if you have to do 100 time steps let's see the 100 time step planner the 10 time step planner",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3316.508,
    "end": 3333.741,
    "text": " the decade and then the ones place planner, the no planner, the single times, like kind of creating all of those alternative ways to parse the problem, I think would be very informative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.463,
    "end": 3341.154,
    "text": " Because there's probably niches and inputs and sense-making and action problems for which like, but there's no free lunch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3342.035,
    "end": 3348.926,
    "text": "But on some data set, each of those you could imagine could be effective or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3350.569,
    "end": 3354.936,
    "text": "But for real world settings, it's definitely an empirical question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3356.705,
    "end": 3380.333,
    "text": " how because if it's just about like well the world the systems are hierarchical or they're nested but then that's just getting into the the map being the territory um has anybody ever framed it in such a way of the so reinforcement learning and deep learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3380.667,
    "end": 3402.456,
    "text": " right we're getting these massive data sets and we're trying to figure out how to make an agent move about the world and it feels to me like the framing of active active inference as a way for an agent to move the world around it almost like comes to mind",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3407.077,
    "end": 3432.73,
    "text": " instead of moving moving around a bounded environment right the the the agent is like moving the whole like the agent is the central foci of existence i i don't know what's been done but sometimes that's called like egocentric navigation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3433.3,
    "end": 3444.66,
    "text": " where the reference point is, where it's like in the grid ruled examples that we look at in PyMDP, the agent's like two comma two, but it's like, but how'd you know you were in a three by three maze?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3444.961,
    "end": 3473.938,
    "text": " Whereas for an open space, then the egocentric navigation, and then it also connects like to this, to the action and non-action earlier, because it's like, I mean, one heuristic of movement and plausibly something that is done for movement or like being in the car, it's like, well, you could think about that the world and its causes are fixed and then you're moving over that, or...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3474.577,
    "end": 3502.98,
    "text": " it's like being on a treadmill it's like yeah the freeway is like passing forward so then from the egocentric frame that's why it feels stationary even like being on a train but then from an allocentric frame you might think about yourself moving positionally across a fixed space so and again that goes to like making these animal behavioral models that are just like wildly off base",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3504.209,
    "end": 3528.411,
    "text": " like people will for example set up an L-shaped wall and then they'll test okay well do animals have an internal space representation like will they take the hypotenuse because it's shorter to get to the food or or will they just follow the edge but it's like but the animal may not even have the vision to see across the diagonal or they may just have a habit to stay up against a wall because it's safer so it's like you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.522,
    "end": 3557.942,
    "text": " but so then having made a made a um allocentric model where it's like okay it's going to calculate a hypotenuse and then it's going to minimize the path distance it's like it's just has nothing to do with the heuristics of the animal so then then then what whatever the p value you get there is it's just kind of like it's a model output but it doesn't help address like an interesting question about the animal in in such a clean way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3560.2,
    "end": 3583.086,
    "text": " You know, it'd be really interesting to explore this in terms of the interior changes that occur in the predictive models of animals that undergo metamorphosis, like, you know, a caterpillar to a butterfly, or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3583.505,
    "end": 3611.622,
    "text": " the uh spawn of um barnacles right like they start as a uh mobile little you know and they can swim around the ocean and then they fix onto something and then like they're fixed and the world then is anchored for them yeah also like the i mean the multi-generation like monarch butterfly",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3613.424,
    "end": 3642.655,
    "text": " are they using a are they just you could imagine all of the you could put a gps tracker etc and think of them moving through space or it could be a pure heuristic based upon like light and magnetism and seasonality all these things that doesn't require planning but then back again back to this combinatorics of planning it's like well if it's combinatorics of every muscle twitch it's like well if that's how if if if",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3643.563,
    "end": 3669.908,
    "text": " know that's maybe not what is happening but this is this is the other map territory what and the the butterfly is able to do that but but can't necessarily emulate chess so even just getting the trick of the turn complete computer to get constraints and capacities that even resemble the biological system is totally not a given",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3676.064,
    "end": 3679.371,
    "text": " And the model won't throw up a flag.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3679.491,
    "end": 3691.997,
    "text": "Again, if you give the butterfly a GPS coordinate and Bluetooth communication with the rest, it's like you can make that model, but it doesn't have the biological plausibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3710.438,
    "end": 3710.819,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.305,
    "end": 3712.686,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3713.188,
    "end": 3714.694,
    "text": "See you next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.199,
    "end": 3716.481,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.327,
    "end": 3718.508,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]