[
  {
    "start": 2.815,
    "end": 3.075,
    "text": " All right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4.057,
    "end": 4.758,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5.459,
    "end": 12.809,
    "text": "Today it's February 5th, 2024, and Ali will be facilitating this discussion on chapter one for cohort six.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 13.41,
    "end": 14.291,
    "text": "So thanks, Ali.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 16.955,
    "end": 17.716,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 18.037,
    "end": 18.597,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 19.158,
    "end": 22.923,
    "text": "Thanks for joining for our first discussion for chapter one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 24.045,
    "end": 31.776,
    "text": "Well, as you might have read in the content and also for the introduction in chapter one,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 32.077,
    "end": 34.763,
    "text": " This is, sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 35.013,
    "end": 55.121,
    "text": " This chapter gives a kind of overall picture of what kind of theory active inference is and specifically what kind of approach the textbook is going to take explaining different aspects of active inference theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 56.223,
    "end": 62.151,
    "text": "Well, one of the main themes of this chapter and also",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 62.671,
    "end": 77.909,
    "text": " the overall organizational scheme of the textbook is the difference between two kind of approach to active inference literature, namely the high road and the low road.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 78.63,
    "end": 91.885,
    "text": "So basically for high road, the prior assumption is the existence of code-unquote thing and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 92.135,
    "end": 110.042,
    "text": " explaining from that um seemingly obvious assumption into what uh what requirements that code unquote thing uh should have in order for it to have uh many various uh aspects such as",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 110.022,
    "end": 114.509,
    "text": " agency, as a kind of decision maker and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 114.589,
    "end": 137.363,
    "text": "So basically, it's not something specific to cognitive agents, but the whole framework can also be applied to many other agents as long as it can be described in terms of its internal and external dynamics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 138.423,
    "end": 142.049,
    "text": " So that's one approach to active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 142.109,
    "end": 156.313,
    "text": "The other one, which is usually called low road in the literature, is beginning from some of the concepts developed from back in the 19th century",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 156.293,
    "end": 181.002,
    "text": " for example, by people such as Helmholtz, in which it tries to generalize the Bayesian reasoning into developing the notion of free energy and specifically variation of free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 182.095,
    "end": 202.551,
    "text": " for which we can formulate the way that the organisms or agents can perceive the world and also the related variable or related so-called parameter",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 202.919,
    "end": 210.859,
    "text": " So for perception, we need a kind of lower boundary, which is the variational free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 211.58,
    "end": 220.422,
    "text": "And for control or for decision making, we need another boundary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 220.79,
    "end": 224.175,
    "text": " variable or parameter, namely expected free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 224.195,
    "end": 243.921,
    "text": "So by describing these two parameters as kind of lower bound of certainty, we can again formulate how organisms or cognitive agents can engage in both perception and also action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 244.442,
    "end": 248.147,
    "text": "So basically, when we say active inference,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 248.701,
    "end": 273.527,
    "text": " it's uh it implies a kind of integration of these two um these two aspects of perception and action so they're not uh essentially distinct from each other uh both of them both of them kind of um follow a similar trajectory or similar mathematical uh technology but uh in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 273.507,
    "end": 277.043,
    "text": " somewhat mirror or reversed way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 277.706,
    "end": 282.589,
    "text": "So I hope I could give a kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 283.598,
    "end": 312.34,
    "text": " overall meaning of what high road and low road uh mean but obviously we'll uh we'll get to see much more detail of both of these approaches so the uh the chapter two deals with um the introduction of low road approach and then beginning from chapter three we'll see how high road approach differs from uh the low road one so um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 313.197,
    "end": 324.776,
    "text": " if anyone has any thought or comments or question on these two concepts, or we can go to the question section and see and discuss some of the questions positive there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 334.813,
    "end": 338.8,
    "text": "Okay, so maybe we can open the question section or",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 345.614,
    "end": 349.719,
    "text": " And by the way, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 349.739,
    "end": 350.941,
    "text": "No, on that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 351.181,
    "end": 364.259,
    "text": "Um, so in the, in the chapter, it talks about the fact that organisms or just agents can not, the motivation is to reduce surprise, but they may be not able to act on surprise directly, but instead on what's called proxies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 364.98,
    "end": 368.424,
    "text": "Could you, and they see that's a variation, the free end of variation, free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 368.805,
    "end": 372.109,
    "text": "Could you clarify what we mean by that or to give me some examples of that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.531,
    "end": 373.731,
    "text": "Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 374.065,
    "end": 389.307,
    "text": " So, yeah, the concept of surprise actually is a little bit different than the psychological conception of surprise that we're familiar with in everyday parlance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 389.287,
    "end": 416.037,
    "text": " basically what we mean at inactive inference by surprise is it's uh statistic in its statistical sense so uh it's surprisal as a functional uh and uh yes so variation of free energy is a kind of upper bound of this function or this surprise of this parameter uh in which uh so the the agent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 416.017,
    "end": 433.857,
    "text": " when it engages in the act of perception, it tries to minimize this upper bound, or at least to somehow optimize its error so that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 433.837,
    "end": 462.645,
    "text": " the uh kl divergence of its error wouldn't exceed this uh bound to this variational free energy so basically uh by specifying this upper bound or or this bound as an optimization parameter we can deal with approximate bayesian inference instead of exact bayesian inference so we don't",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 463.03,
    "end": 473.327,
    "text": " need to exactly or precisely specify the divergence of the perception from the input data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 474.288,
    "end": 488.852,
    "text": "Instead, we can specify a kind of bound to approximately minimize that error in order for the perception to have some meaningful",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 489.575,
    "end": 490.196,
    "text": " C Sinan Gunturk, Ph.D.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 490.176,
    "end": 496.264,
    "text": ": To have any kind of meaning for us in terms of its action or any subsequent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 496.284,
    "end": 498.387,
    "text": "C Sinan Gunturk, Ph.D.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 498.347,
    "end": 509.642,
    "text": ": Subsequent message passing and so on, so yes here variation free energy again is parameter is an optimum optimization parameter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 510.112,
    "end": 534.82,
    "text": " So the agent in active inference framework will try to somehow minimize this or actually optimize this parameter based on the divergence, more specifically the KL, callback Leibler divergence, between the input data and its generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 536.791,
    "end": 552.053,
    "text": " We'll see how it works more precisely and more rigorously in chapter two, but free energy, yes, is the surprisal or the parameter the agent tries to minimize.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 554.036,
    "end": 562.208,
    "text": "And variational free energy is a kind of get around so that instead of engaging in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 562.694,
    "end": 581.04,
    "text": " exact Bayesian inference, we just need to do the approximate Bayesian inference, which is much more tractable than the exact Bayesian inference, because as we know, Bayesian inference for anything more than very, very simple cases are extremely intractable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 592.681,
    "end": 594.684,
    "text": " I had a quick question about that, if that's OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.866,
    "end": 596.286,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.107,
    "end": 603.657,
    "text": "And by the way, it's OK if we need to put a pin in this and perhaps address it in a later chapter as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.717,
    "end": 611.468,
    "text": "I am interested in not being super familiar with that intractability problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.548,
    "end": 616.295,
    "text": "Do you know what it is that makes that straight up Bayesian computation intractable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.395,
    "end": 619.92,
    "text": "And how does variational free energy get around that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.06,
    "end": 622.063,
    "text": "Or should we save that for later time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.95,
    "end": 637.47,
    "text": " So a preliminary answer would be, so in order to do an exact Bayesian inference, we need to account for every single parameter, every single variable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 637.703,
    "end": 644.977,
    "text": " that is relevant for any kind of real-world situation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 645.798,
    "end": 661.247,
    "text": "So as we know, when we want to model any kind of real-world situation, basically the sheer number of variables we need to account",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 661.227,
    "end": 684.062,
    "text": " uh are is extremely uh i mean uh say for some very very simple cases in other cases we need to account for many many more variables so it makes the situation much more complicated so and also",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 684.515,
    "end": 693.871,
    "text": " we might not also know the exact value for every parameter, or even what parameters to account for, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 694.492,
    "end": 710.539,
    "text": "But when we want, as a way to get around this problem, we might want to engage in approximate Bayesian inference, in which instead of,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 710.519,
    "end": 726.267,
    "text": " uh computing the exact value of a prior we approximate it by doing a kind of marginalization on uh the variables we know the value of of them and so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 726.247,
    "end": 740.592,
    "text": " it kind of gives a much more realistic way to compute those those posteriors in any kind of situation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 740.712,
    "end": 747.343,
    "text": "So that's a much more tractable situation than or basically",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 747.323,
    "end": 770.58,
    "text": " we can say that computing exact Bayesian inference in most situations can be seen not only intractable but almost impossible as I said we might not know the exact value of the parameters we want to model so yes that's one of the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 771.725,
    "end": 793.75,
    "text": " essential issues of doing any kind of Bayesian statistics, Bayesian inference, and almost always the number here in the parameter, in the denominator PY is almost always marginalized in real work situations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 795.113,
    "end": 806.828,
    "text": " So that marginalization over PY instead of the exact value of PY is basically called approximate Bayesian inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 807.702,
    "end": 828.445,
    "text": " fantastic it was very clear thank you just to add like one more point there because it's a great question so like in the setting of bayesian phylogenetics x the hidden state was the real relationship among species unobserved and then y is a huge data set so it might be millions of lines or something like that um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 828.425,
    "end": 835.262,
    "text": " the likelihood of that dataset being observed, like Ali said, like if you knew that you'd kind of have already known.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 835.282,
    "end": 844.425,
    "text": "So not only is it a massive dataset, but but it's this question seems to require you to know what you already want to know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 844.405,
    "end": 854.76,
    "text": " And then the variational inference, which is a computational heuristic approach that's existed long before active inference, like variational autoencoders.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 855.481,
    "end": 863.053,
    "text": "And the technique here is kind of like reducing to a certain family of models that only have a few knobs to fiddle with.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 863.734,
    "end": 868.04,
    "text": "Like, I'm going to fiddle with the mean and the variance of this distribution, and that's it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 868.701,
    "end": 873.568,
    "text": "And then there are smoothly, incrementally optimizable paths",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 873.835,
    "end": 888.513,
    "text": " for this kind of a problem that you can take in time incrementally versus this, which is just like a massive static problem that is intractable for sometimes a number of reasons.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 889.415,
    "end": 893.7,
    "text": "And so the approach taken to the action perception loop in active inference",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 893.68,
    "end": 916.531,
    "text": " just at a first pass is to treat it like this kind of structurally fixed, though, you know, asterisk, later developments, but just at the core level is to treat it like a structurally fixed optimization problem, rather than this sort of static number crunch.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 916.551,
    "end": 917.252,
    "text": "Much appreciated.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 917.272,
    "end": 917.713,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 919.769,
    "end": 930.826,
    "text": " And also as a side note, there's this fascinating preprint, which was, I think, released a couple of weeks ago, namely Naturalizing Relevance Realization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 930.946,
    "end": 938.537,
    "text": "So the concept of relevance realization by John Verbeke is very relevant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 938.517,
    "end": 965.352,
    "text": " here so basically what they claim in that paper is cognition is fundamentally uncomputable in its in a very well-defined algorithmic sense but predictive processing via using a probabilistic modeling instead of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 965.332,
    "end": 980.792,
    "text": " using the exact values for parameters they can actually provide a much more realistic way to in order to model the information processing nature of any kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 981.025,
    "end": 986.36,
    "text": " biological organisms, obviously, including the brains.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 986.902,
    "end": 992.779,
    "text": "So I highly recommend reading this paper too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 992.799,
    "end": 995.507,
    "text": "I think, yeah, it is this one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 996.331,
    "end": 1020.027,
    "text": " So yeah, so basically relevance realization, so what John Bereke means by relevance is exactly the parameters we need to model or we need to account for in order to meaningfully model the behavior of the organism, which is huge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1046.213,
    "end": 1073.031,
    "text": " okay so any other comments questions or you can look at some of the questions on the coda page",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1083.71,
    "end": 1095.818,
    "text": " All right, so we may dwell a little bit on the distinction between the low road and high road and ask for your opinions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1096.94,
    "end": 1102.613,
    "text": "I mean, before reading the book, for those of you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1102.93,
    "end": 1123.639,
    "text": " we're approaching this book for the first time, what do you think the advantages or disadvantages of using each of these approaches to active inference literature based on this preliminary understanding of the distinction between these two approaches?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1127.483,
    "end": 1130.647,
    "text": " or which one would you find more meaningful?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1131.108,
    "end": 1135.674,
    "text": "I don't know, more logical and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1135.975,
    "end": 1153.879,
    "text": "I would say I was struck by the way that the high road provides this sort of like great overview, you know, like a very elegant explanation that just begins with this simple fundamental predicament of self organizing systems.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1153.859,
    "end": 1175.496,
    "text": " um so i find it very useful conceptually in that sense i was explaining trying to explain active inference to someone who's not familiar with it recently and uh i was kind of talking about some of these concepts and he said uh yeah but that's you're you're using mentalizing concepts right um and uh",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1176.353,
    "end": 1183.942,
    "text": " the agentic perspective that's introduced by the high road model, I think is interesting.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1183.962,
    "end": 1204.065,
    "text": "And I'd like to learn more about how this relates to the sort of ontology, like what the ontology behind it is, because it seems to really go against a lot of the sort of, you know, the approach, the sort of deterministic,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1206.948,
    "end": 1222.529,
    "text": " you know, traditional approach where there's this gap between kind of agents and consciousness and mentalizing concepts, and then a world that's purely determined, like, is there formal causation because creatures have evolved?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1223.33,
    "end": 1226.594,
    "text": "You know, that's a little mysterious to me.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1227.295,
    "end": 1229.698,
    "text": "So that's what struck me.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1232.547,
    "end": 1233.248,
    "text": " Great, thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1234.289,
    "end": 1236.351,
    "text": "Yeah, that's a great point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1236.491,
    "end": 1257.812,
    "text": "I mean, actually, as far as I know, one of the main discussion points of all active inference literature is exactly focused on kind of unentangling what kind of metaphors they use and making them more precise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1258.315,
    "end": 1278.4,
    "text": " I agree that some of the metaphors used in active inference can seem at first kind of, I don't know, appealing to a kind of panpsychism kind of approach or, I don't know, make them a bit,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1278.38,
    "end": 1298.818,
    "text": " uh more anthropocentric than it than it really is but it's important to keep this point in mind that some of the terms used in active inference are used in their",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1298.798,
    "end": 1303.311,
    "text": " very technical and mathematically rigorous sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1304.093,
    "end": 1313.5,
    "text": "For instance, there was a debate around the use of the word sentience in one of the papers which was published a few months ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1313.935,
    "end": 1325.64,
    "text": " So the way active inference literature uses this word sentence is actually specifically and rigorously defined in some of the papers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1326.723,
    "end": 1333.277,
    "text": "And it's not necessarily something that perfectly maps on to the everyday conception of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1333.257,
    "end": 1344.731,
    "text": " of this word, or even in the sense of this word that's used in some other relevant disciplines or other related areas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1345.392,
    "end": 1346.833,
    "text": "But yes, that's a great point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1347.014,
    "end": 1349.577,
    "text": "And by the way, I almost forgot it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1350.598,
    "end": 1356.565,
    "text": "I usually refer to this great paper or rather essay by Carl Friston,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1356.545,
    "end": 1378.772,
    "text": " namely Beyond the Desert Landscape from the book Andy Clark and His Critics, in which he beautifully explains the difference between low road and high road and why active inference literature relies more recently on developing the high road approach instead of the low road one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1379.053,
    "end": 1382.257,
    "text": "So I highly recommend reading that essay as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1382.797,
    "end": 1383.278,
    "text": "Thomas?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1387.443,
    "end": 1389.565,
    "text": " Yeah, I mean, kind of piggyback on that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1389.645,
    "end": 1391.327,
    "text": "On the high road, I had a lot of interest in that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.108,
    "end": 1395.251,
    "text": "I don't have experience knowing about Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.472,
    "end": 1399.035,
    "text": "I think that seems very clearly one of the major definitions of what we're getting at there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1399.115,
    "end": 1400.757,
    "text": "So I can't make a comment about that yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1401.078,
    "end": 1403.64,
    "text": "I imagine we're going to talk about that in future chapters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.961,
    "end": 1410.868,
    "text": "When I was reading that, I'm reminded from Plato's Mino, there's a discourse about the definition of figure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1411.051,
    "end": 1418.845,
    "text": " And it's the in using a very particular mode of discussion about to talk about defining what color coming as a follow up a figure so and it's a discussion of limit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1419.726,
    "end": 1432.789,
    "text": "Effective Plato's character has a very particular kind of nuance discussion that I can even challenge the discussion what limit is so best is more just meditating on it it's very i'm interested in hearing more about that at this point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1434.862,
    "end": 1438.969,
    "text": " It will definitely come to markup blanket in chapter three.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1439.71,
    "end": 1444.619,
    "text": "And hopefully, we'll have an extensive discussion around that essential concept.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1444.799,
    "end": 1446.542,
    "text": "I agree, markup blanket.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1447.463,
    "end": 1452.973,
    "text": "I mean, holds central central place in all active inference literature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1453.073,
    "end": 1459.063,
    "text": "So thanks, Jeff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1460.63,
    "end": 1465.683,
    "text": " Yeah, I'm just reminded, not from the last bit of conversation, but just a little bit before that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1465.723,
    "end": 1467.447,
    "text": "And I'm sorry, I'm jumping in the middle here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1468.149,
    "end": 1470.736,
    "text": "But I'm just reminded of Wheeler's Participatory Universe.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1474.224,
    "end": 1475.668,
    "text": "Wheeler's Participatory Universe.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1477.91,
    "end": 1504.17,
    "text": " okay so uh interesting uh you see uh i'm not uh very familiar with wheeler's work but uh as far as i know uh i mean some of the ideas from um i mean uh some of wheeler's ideas and specifically uh the uh bestowing a kind of fundamentality to the concept of information",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1504.572,
    "end": 1513.22,
    "text": " which is one of the Wheeler's, as far as I know, main arguments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1513.24,
    "end": 1525.091,
    "text": "Is very similar to what Bayesian mechanics way of modeling the physics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1526.292,
    "end": 1530.796,
    "text": "I don't mean just physics of belief, but actually physics of everything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1531.076,
    "end": 1534.039,
    "text": "I'm not sure if you've heard",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1534.61,
    "end": 1551.191,
    "text": " for Bayesian mechanics, but it's a kind of new way of doing even fundamental physics, not only as a way to model cognitive agents, but it is much more fundamental than that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1551.952,
    "end": 1556.297,
    "text": "So as the work, the works of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1556.277,
    "end": 1571.468,
    "text": " people like um dalton's active adebell would show this new kind of approach to doing physics is in some sense perfectly congruent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1571.549,
    "end": 1594.62,
    "text": " with everything uh that has come so far in in the history of fundamental physics in terms of its uh classical i mean classical physics quantum physics and even for modeling uh dynamical chaotic systems so uh yes um the uh the notion of uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1594.921,
    "end": 1605.724,
    "text": " fundamentality of information or rather the fundamentality of beliefs, belief in its statistical sense, which is a kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1605.991,
    "end": 1606.752,
    "text": " C Sinan Gunturk, Ph.D.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1606.692,
    "end": 1616.003,
    "text": ": A much modulated information is a kind of is a kind of information that has a specific probability distribution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1616.023,
    "end": 1617.605,
    "text": "C Sinan Gunturk, Ph.D.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1617.585,
    "end": 1627.257,
    "text": ": is central to I mean almost everything active inference related or fp related So yes, I think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1627.608,
    "end": 1631.274,
    "text": " They're closely related to Wheeler's work as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1631.294,
    "end": 1643.052,
    "text": "And also, obviously, Chris Fields, great course in physics as information processing, has some great discussions around that point as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1644.695,
    "end": 1646.157,
    "text": "I'm editing the journal right now.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1647.605,
    "end": 1651.309,
    "text": " Yeah, Jeff, that'll be awesome to see some connections with Chris Fields.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1651.529,
    "end": 1668.229,
    "text": "And to make a comment on this, I think cognitive science in a way is looking for that kind of qualified description of things in their environment, figure and ground and agent and environment, ecological psychology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1668.249,
    "end": 1675.637,
    "text": "And there are various like seemingly",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1675.972,
    "end": 1691.787,
    "text": " overly simplistic to the point of losing their epistemic or pragmatic value theories like um theories that might be criticized as um like for example even in this discussion words that have been brought up like mentalizing or anthropocentric",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1691.767,
    "end": 1712.273,
    "text": " so clearly those could be taken to a level where it's like yeah it we you know out mentalize where it's not even useful and it's anthropocentric where it doesn't even apply to this or that um or the other way around and then also anything that's part of our behavior and experience it is coming in some way through the apparatus of the person",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1712.253,
    "end": 1715.219,
    "text": " So it can only be escaped so fundamentally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1715.239,
    "end": 1726.263,
    "text": "And so sometimes there's a movement away from so-called anthropocentrism, but then it's like, if it doesn't have us doing that theory, then what is that really even trying to describe then?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1728.287,
    "end": 1728.588,
    "text": "David?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1729.309,
    "end": 1729.57,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1731.052,
    "end": 1731.734,
    "text": " Hi, good morning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1731.754,
    "end": 1742.743,
    "text": "Yes, I just wanted to see if the mouse utopia studies would fall into this dynamic as well, performed by john Calhoun in the 60s.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1742.924,
    "end": 1745.23,
    "text": "I'm not sure if you're familiar with the studies themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1748.163,
    "end": 1753.731,
    "text": " in terms of the behavioral modeling, because they do describe it as a collapse in behavior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1753.791,
    "end": 1773.158,
    "text": "And in terms of predetermined utopia from a different experiential point of view, and then seeing how that deteriorated despite the constraints on the model itself, wanted to know how that might speak towards the behavioral modeling itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1773.138,
    "end": 1803.145,
    "text": " and uh the collapse function how that might be related to the bayesian mechanics as well in terms of uh defining an environmental space you know for another active group of agents for example thanks david i'm not familiar with this work at all so thanks for bringing it up and introducing it um i don't know if anyone is familiar with",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1803.715,
    "end": 1827.175,
    "text": " uh mouse utopia experiments and um yeah jeff go for it no i i that that leads directly into i think um uh markov blankets and the holographic principle um and and um layers of separation between agents and the translation that has to occur at every hop",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1827.155,
    "end": 1857.162,
    "text": " right um for example we're not going to be able to empathize with what it's like to be a bacteria in a bacterial colony but for the bacteria they take a very bacteriocentric view of the world so i think it's very natural for us and it's right for us to take an anthropocentric uh approach right because that's our lived experience and i think there's definite overlap with with with psychology and social the social sciences in general there",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1857.142,
    "end": 1860.688,
    "text": " We can't imagine what it's like to be a sun.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1861.309,
    "end": 1866.859,
    "text": "But if you look at Teilhard's complexity theory, like anything with sufficient complexity has consciousness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1867.38,
    "end": 1870.265,
    "text": "So the sun knows what it's like to be a sun, the sun.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1870.646,
    "end": 1878.981,
    "text": "But it's building that translators in the steps between the different systems is really what I'm interested in getting after.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1879.147,
    "end": 1906.302,
    "text": " right so it's kind of like the rock being able to imagine it's a rock but not interact with another rock for example yeah yeah yeah exactly yeah I just found it interesting because the uh the mouse study itself where they they tiered the different areas and then they kind of segregated it so you know they had you know different levels but you know that's also coming from my background which is sociology so I mean there's a little bit of prior from myself there as well so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1907.547,
    "end": 1932.272,
    "text": " so i'd also have to learn more about the experiment specifically but i think one phenomena it speaks to is the unified nature of cognitive phenomena in the developmental and the evolutionary setting like you could study just working memory and you go down the rabbit hole and then working memory is going to bleed off into some other cognitive phenomena because it's all happening in part of this",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1932.657,
    "end": 1958.682,
    "text": " integrated unit of of organismal function and then when we take that view out to like the intergenerational and the social so they're like vertical and horizontal transmission all all these different kinds of inheritance mechanisms then um oh let's just invent a pencil to offload this and then there's non-linear effects or let's just make this well make this thing that was clear now let's paint over that like",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1958.662,
    "end": 1985.445,
    "text": " changes to what what can um influence one cognitive phenomena or one kind of intervention or change in the game can lead to like these cascading effects all these different kinds of ecological dynamics so that kind of motivates that kind of motivates at least the integrated framework to prepare for the um proper analysis of these complex situations",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1988.935,
    "end": 1990.217,
    "text": " Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1994.222,
    "end": 2017.896,
    "text": "Do you think those non self motivated in that sense, you know, where, um, you know, something that's single cellular might, you know, that has two flagella, for example, it's going to drop one, um, because it may not be able to exist with two in that, in that, you know, environment itself, but is that necessarily a choice or is that a product of the environment itself?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2022.314,
    "end": 2030.842,
    "text": " And also, I mean, the whole burgeoning field of basal cognition also deals with these kinds of questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2031.302,
    "end": 2050.06,
    "text": "I mean, whether those single-celled organisms actually possess kind of primitive cognition in terms of memory, learning, decision making, and so on, and how it's implemented biologically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2050.394,
    "end": 2076.688,
    "text": " uh, one, uh, strong candidate for, um, for the way, uh, I mean, for, uh, the, uh, implementation of, uh, the basal cognition in, uh, any, uh, even if the single celled organisms, uh, is through the, uh, gap junction distribution of their, of their bioelectric and network, uh, which is the main.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2077.09,
    "end": 2085.863,
    "text": " research, one of the main areas of research, people such as Michael Levin and his colleagues.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2086.724,
    "end": 2093.915,
    "text": "So yeah, it's a very interesting developments in recent biology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2094.636,
    "end": 2100.364,
    "text": "So the whole area of basal cognition, as far as I know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2100.58,
    "end": 2102.343,
    "text": " officially started from 2021.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2103.525,
    "end": 2123.803,
    "text": "So they're very new questions, and obviously with the mainstream biology concerned on the modern synthesis approach, it's a long way to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2124.307,
    "end": 2134.462,
    "text": " some how nudge nudge the paradigm and to make it through true paradigm shift in biology, but it's happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2135.183,
    "end": 2143.034,
    "text": "And I, I believe they can lead to some really exciting new work in this area.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2143.535,
    "end": 2150.365,
    "text": "Once we escape the traditional gene centered view of the organisms",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2150.345,
    "end": 2156.1,
    "text": " to the more holistic and organism-centered ontology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2156.862,
    "end": 2163.139,
    "text": "So that can also apply to even",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2163.524,
    "end": 2182.782,
    "text": " non-biological agents if we want to uh think of the continuum between uh biological things and non-biological ones as a true continuum not not not uh something that uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2182.762,
    "end": 2192.215,
    "text": " that something that has any kind of fundamental difference between them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2192.275,
    "end": 2206.795,
    "text": "So Bayesian mechanics is one of the approaches that somehow dismantles this discrepancy, this fundamental discrepancy between biological and non-biological",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2207.062,
    "end": 2223.096,
    "text": " agents uh so yeah i believe uh it's a much more interesting world view to look at things this way in a kind of continuum as a kind of process and so on instead of uh aristotelian essentialism",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2224.375,
    "end": 2224.916,
    "text": " That's great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2225.236,
    "end": 2226.418,
    "text": "I'll just add one more thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2226.438,
    "end": 2246.923,
    "text": "I don't want to give too much input, but you jogged my memory on something related to something I was thinking about with Levin's work as well, in terms of, you know, if you have a more macro level, like a human being, for example, and you have, you know, an accident or something and a limb needs to be removed, we have this, you know, phantom limb, we call it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2246.903,
    "end": 2271.696,
    "text": " where the individual still feels like they can move the limb the limb might still be there but you know it has been removed so obviously there is some memory there but we also know that we have neurons you know and extremities in our bodies you know to what extent is that you know mechanic of just cognition or is it also a mechanic of the potential energy that was lost in that space for example and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2271.676,
    "end": 2291.176,
    "text": " would we be able to pinpoint that kind of thing with the technology we have now to try and replicate that on a smaller scale to kind of find that, you know, bioelectric signal or whatever else might be going on in terms of, you know, the interconnectivity between the micro and the macro and that dynamic?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2295.2,
    "end": 2297.262,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2297.562,
    "end": 2303.632,
    "text": " Okay, Cohen, I noticed you had your hand raised, if I'm not mistaken.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2304.673,
    "end": 2305.715,
    "text": "You want to add anything or?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2306.036,
    "end": 2310.944,
    "text": "Or Jan?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2320.138,
    "end": 2322.662,
    "text": "If I had my hand raised, that was my mistake, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2323.143,
    "end": 2324.245,
    "text": "But I",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2324.647,
    "end": 2329.892,
    "text": " Jone Peter Reistadler, Yesterday, I listened to the first and and and 11 talk and.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2330.172,
    "end": 2334.155,
    "text": "Jone Peter Reistadler, It seemed super interesting to me that living things that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2334.195,
    "end": 2353.692,
    "text": "Jone Peter Reistadler, Like he has simulated some systems were like some genotypes understand that other agents share that you know type and they fare much better and they like communicate much better with agents that are very similar to themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2360.0,
    "end": 2360.32,
    "text": " Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2360.34,
    "end": 2360.801,
    "text": "Interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2363.244,
    "end": 2368.489,
    "text": "Uh, actually we'll have a lot more to talk about, uh, all of these things in the coming chapters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2368.75,
    "end": 2380.603,
    "text": "And, uh, as I said, it's, uh, one of the, uh, main focuses of, uh, active inference, uh, especially, uh, from it's high level approach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2380.683,
    "end": 2389.112,
    "text": "So, um, I'm excited to hear all of the, I mean, your opinions on all of these matters, uh, as we come.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2389.868,
    "end": 2397.043,
    "text": " uh to those points as well so jeff uh did you want to add anything or",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2397.867,
    "end": 2408.599,
    "text": " Yeah, my background is national security, military, and intelligence community, and working overseas for the US military.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2409.44,
    "end": 2417.268,
    "text": "And there's a massive problem right now with security classification, also with enterprise IT and cybersecurity.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2418.49,
    "end": 2425.157,
    "text": "Massive problem with information classification, controlling classified information,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2426.015,
    "end": 2431.1,
    "text": " and zero trust and protecting information on the internet, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2431.14,
    "end": 2432.762,
    "text": "The internet is a scale-free system.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2433.483,
    "end": 2442.753,
    "text": "So I think there's a practical applicability here to fundamentally redesigning the way that we look at protecting our information on the internet.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2442.773,
    "end": 2444.775,
    "text": "And this really could be a practicum.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2445.316,
    "end": 2454.165,
    "text": "And I've got about 6,000 words in a paper, if anybody's interested in collaborating, a short deadline, I'm targeting it for a conference called",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2454.145,
    "end": 2458.593,
    "text": " HammerCon, which is one of the biggest national security conferences in the country.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2459.054,
    "end": 2460.616,
    "text": "It's right outside the NSA headquarters.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2461.518,
    "end": 2465.385,
    "text": "And yeah, so I'm actively working on that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2465.645,
    "end": 2475.563,
    "text": "And I think it's a very, very salient point and timely point to our current conversation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2481.196,
    "end": 2481.937,
    "text": " Very interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2483.12,
    "end": 2485.444,
    "text": "Thanks for bringing it up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2485.464,
    "end": 2494.902,
    "text": "If anyone is interested in collaboration, that would be exciting and great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2495.506,
    "end": 2504.185,
    "text": " Okay, so good question sorry Elliot what would be the best way through this group to be in touch about things like that in the future i'm not sure Jeff if if.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2504.887,
    "end": 2511.642,
    "text": "My background would be would be especially helpful on that, but i'm just curious about like what's the sort of best practice on how to link up for that kind of thing if so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.187,
    "end": 2517.152,
    "text": " I'll just answer it on the cohort six page.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2517.232,
    "end": 2519.395,
    "text": "You can add like a row with your contact info.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2520.577,
    "end": 2528.53,
    "text": "You could also message someone in Zoom if you're synchronously here or just find any other way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2528.95,
    "end": 2533.798,
    "text": "Another option is to write on the projects page.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2534.96,
    "end": 2536.803,
    "text": " And that can include your contact information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2536.823,
    "end": 2560.438,
    "text": "So if you want to kind of check out other people's projects or plant your own here, if you want to kind of just do it more personally at this page, also understanding that everything that's in the textbook group document is like open essentially, and just contact each other and enjoy beyond the halls of the Institute.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2560.458,
    "end": 2560.738,
    "text": "Awesome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2560.799,
    "end": 2561.119,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2570.566,
    "end": 2575.632,
    "text": " I'm like, curious, just any anyone else?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2576.332,
    "end": 2580.577,
    "text": "Even if they haven't added anything, like just how was chapter one?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2583.54,
    "end": 2585.642,
    "text": "How did they feel like it opened the book?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2585.723,
    "end": 2587.745,
    "text": "Or what did it leave them with?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2598.356,
    "end": 2599.037,
    "text": "Yes, Petra.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2601.076,
    "end": 2606.245,
    "text": " Hi, I have a question about normative framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.628,
    "end": 2623.776,
    "text": "I'm just thinking, is it like the framework describes a healthy functioning organism when we are looking at a human as an agent or is it meant differently?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.756,
    "end": 2641.592,
    "text": " I'm thinking in the context of psychopathology, when we are talking that the agent's model, generative model, is somehow suboptimized, whether it is connected with this normative aspect of framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.474,
    "end": 2643.235,
    "text": "Does it make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.676,
    "end": 2644.498,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.951,
    "end": 2646.633,
    "text": " Great question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2646.733,
    "end": 2647.293,
    "text": "Great question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2647.353,
    "end": 2647.694,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2648.354,
    "end": 2651.297,
    "text": "So I'll take the first step.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2651.317,
    "end": 2671.718,
    "text": "So you see, the use of this word normative here in active inference literature and also in the textbook is somewhat, I think, defined in the notes if I'm yes, it was in page on page 267.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2673.048,
    "end": 2698.144,
    "text": " so here it says the term normative means there is some evaluative standard against which behavior can be scored active inference is normative in the sense that perception and action are scored by free energy a quantity we will unpack throughout this and the next chapters so as i said again uh it's more technical uh sense of the word normative and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2698.124,
    "end": 2726.055,
    "text": " it's not necessarily congruent with other connotations or meanings of this word so basically the reason it's I mean the word normative used in active inference is to refer to this central parameter namely free energy as the main optimization parameter around which all the other",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2726.035,
    "end": 2731.022,
    "text": " formulation and I mean, mathematical formalism revolves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2731.683,
    "end": 2746.305,
    "text": "So that's basically, as far as I understand, the meaning of the word, the adjective normative in active inference literature, but I'd be happy to hear any other opinion on that matter as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2748.04,
    "end": 2748.841,
    "text": " Thanks, Ali.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2749.062,
    "end": 2749.763,
    "text": "Thank you, Petra.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2749.963,
    "end": 2754.951,
    "text": "I'll just add a few other points, especially in the social and human.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2755.812,
    "end": 2767.269,
    "text": "There was some great discussion on this question of normativity in the social sciences course with Mal Albarasen and Ben White and others and Avel last year.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2767.29,
    "end": 2770.234,
    "text": "So especially in the end,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2770.214,
    "end": 2783.888,
    "text": " It is an interesting question and one that also people have specifically looked at in the psychopathology sense, like Carl Friston and Thomas Parr, two of the three authors on the textbook, are clinicians.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2784.809,
    "end": 2792.777,
    "text": "And so there's a lot of discussion about like, well, what does it mean if it's base optimal, but it's DSM diagnosed?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2792.797,
    "end": 2793.938,
    "text": "Like, how is it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2794.459,
    "end": 2796.841,
    "text": "What is it that's going right or wrong?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2796.981,
    "end": 2799.664,
    "text": "What's optimal or non-optimal?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2799.644,
    "end": 2820.69,
    "text": " and just different ways to talk about like well it is optimal like under this um memory parameter this behavior can be understood as optimal and so that's a kind of like narrow base optimal but then that's just what prepares for the discussion like but then the context this is not aligning with their preferences so",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2821.261,
    "end": 2822.744,
    "text": " It's a great question, though.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2823.445,
    "end": 2826.39,
    "text": "And also, like, just the is and the ought.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2827.251,
    "end": 2830.477,
    "text": "And, oh, well, active inference can be applied to this system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2830.757,
    "end": 2832.2,
    "text": "We know it can be applied to any system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2832.62,
    "end": 2834.003,
    "text": "Oh, it can be applied to a company.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2834.564,
    "end": 2835.846,
    "text": "So it ought to be this way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2836.928,
    "end": 2842.898,
    "text": "But a framework that just describes how things are, how do you go from that to how it ought to be?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2846.219,
    "end": 2861.342,
    "text": " And also, again, as a side note, I will refer to Mark Pickard's work as well, because much of his research is concentrated on, again, the development of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2861.322,
    "end": 2870.353,
    "text": " what it actually means for an organism or an agent to have a normative perception or normative action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2870.873,
    "end": 2888.815,
    "text": "And what it means is a kind of goal-directedness action or a kind of intentional action or as what Terence Deacon would call intentional, not necessarily intentional.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2888.795,
    "end": 2903.817,
    "text": " This kind of normative perception or normative action as Bickert develops in many of his papers is the sense that this kind of intentionality is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2903.797,
    "end": 2909.769,
    "text": " inseparable from the perception and obviously the action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2909.829,
    "end": 2925.079,
    "text": "But in the so-called teleophobic community of biologists, this kind of discourse",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2925.278,
    "end": 2946.122,
    "text": " somehow, sometimes would raise eyebrows because as we know from, I don't know, around 1950s onward, there's this kind of phobia around this teleology and any kind of, I mean, goal-directedness and to put intentionality",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2946.406,
    "end": 2948.93,
    "text": " and mechanistic explanations and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2949.431,
    "end": 2971.485,
    "text": "But as Terence Deacon also shows in Incomplete Nature, and as I said, Mark Bickert's work, this intentionality and normativity are essential aspects of any sentient and cognitive agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2971.786,
    "end": 2983.011,
    "text": " And by agent, I mean anything from single-celled organism to, I don't know, much more complex ones.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2985.303,
    "end": 3003.278,
    "text": " uh thanks for your question yeah oh yeah great points all in to kind of connect the like what you described earlier about the the teleology and teleophobia and the deacon and the absential nature the idea that there are systems",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3003.258,
    "end": 3012.043,
    "text": " For whom deterministic accounting of their connections accounts for their behavior, like a pendulum or something like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3012.083,
    "end": 3019.022,
    "text": "But even a system like a pendulum could be described as like this absential movement towards something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3019.002,
    "end": 3028.212,
    "text": " And so there are fundamental parts of especially symbolic knowledge-based systems that have a teleological cause.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3028.673,
    "end": 3032.678,
    "text": "Like the cause of the house is that there was a desire to build a house in that place.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3033.799,
    "end": 3041.027,
    "text": "And so active inference, especially in this chapter one setting, it just like...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3041.463,
    "end": 3043.005,
    "text": " brings it all out on the table.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3043.565,
    "end": 3046.048,
    "text": "The chapter does and the discussions do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3047.39,
    "end": 3053.797,
    "text": "And there's a lot in the chapter and also a lot that's kind of like a adjacency that's always fun to bring out.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3054.658,
    "end": 3070.575,
    "text": "And this is kind of just like calibrating to the scope of the kinds of things that that are our starting point for continuing with the journey and just seeing about like some of the heuristics and tools and frames that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3070.555,
    "end": 3097.288,
    "text": " have been brought um up previously and then in this first half of the textbook we kind of like get through one worked example with the mammalian nervous system by chapter five of like this is kind of the sketch of what it looks like to start applying this to a system but here's how much work it takes to get to this stage and here's what the model does and doesn't say at that stage",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3102.415,
    "end": 3103.016,
    "text": " Thanks, Daniel.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3104.317,
    "end": 3121.634,
    "text": "Okay, so at our final minutes, I'd be interested to hear, now that you've read chapter one, what do you anticipate or what do you hope to gain from reading the textbook all the way through?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3121.654,
    "end": 3132.304,
    "text": "I mean, does reading chapter one",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3133.195,
    "end": 3137.359,
    "text": " change your anticipation for better or worse or?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3146.388,
    "end": 3154.736,
    "text": "Yes, Esmail.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3154.756,
    "end": 3160.401,
    "text": "Yeah, I think Thomas raised his hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.95,
    "end": 3165.575,
    "text": " Oh, sorry, I have some problems seeing the reset.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3165.595,
    "end": 3167.658,
    "text": "Okay, Thomas, thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3167.678,
    "end": 3167.999,
    "text": "Oh, sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3170.302,
    "end": 3176.772,
    "text": "No, this chapter didn't really change my anticipations, mainly because Daniel was so generous when I talked with him in the Discord chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3177.052,
    "end": 3179.916,
    "text": "He sent me that paper on order and change in his art.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3180.377,
    "end": 3184.843,
    "text": "Basically, how to give the active inference account could apply to aesthetic experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3185.705,
    "end": 3186.125,
    "text": "Phenomenal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3186.145,
    "end": 3190.692,
    "text": "I mean, my research and writings for Plato's account of aesthetics lines up perfectly to what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3190.958,
    "end": 3192.139,
    "text": " that paper was talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3192.88,
    "end": 3195.744,
    "text": "And if anything, I'm just more interested, I'm excited to move forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3195.884,
    "end": 3198.447,
    "text": "I think the idea that we I think the account really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3199.408,
    "end": 3207.277,
    "text": "I think the fact that person does a great job making an argument that aesthetic experience is not being suppressed or kind of decomposed down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3208.758,
    "end": 3214.785,
    "text": "But statistically, on the account of epistemic arcs, I think that's outstanding as an account for the aesthetic experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3216.087,
    "end": 3216.207,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3216.457,
    "end": 3226.51,
    "text": " I think the fact that this can be rigorously discussed is that's the area why i'm even here in the first place, because I try for anyone doesn't remember or never call it see meaning me i'm a lecturer in visual art at university.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.231,
    "end": 3236.743,
    "text": "And the biggest challenge I have with pupils students is to rigorously demonstrate how do we know something more successful or not, so this kind of normative measure kind of approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3237.027,
    "end": 3260.723,
    "text": " um the fact that that can be demonstrated in such rigorous ways i'm very interested um but also the mystery of basically heidegger has a whole paper on the question of what the thing this whole question of that so the kind of high road even question of how to answer what is a thing uh is just i'm very fascinated nothing's really been changed i'm more just i'm enjoying the meal i'm looking forward to the next course that'd be my summary so far",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3262.39,
    "end": 3263.552,
    "text": " Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3263.572,
    "end": 3283.251,
    "text": "And on the point of aesthetics, actually there's this recent exciting special issue, and I think it was in the Philosophical Transactions of Royal Society on the subject of aesthetics from the viewpoint of predictive processing, which",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3285.104,
    "end": 3306.218,
    "text": " okay yes also exactly it was in this issue also tomorrow um with uh karen kukkonen the guest stream um about literature and predictive processing that should be super exciting too i'll put this in the notes yeah",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3307.818,
    "end": 3312.244,
    "text": " She uses predictive processing as applied.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3313.927,
    "end": 3331.411,
    "text": "She applies predictive processing to literary studies and somehow uses literature as a kind of experimental hub for investigating many facets of consciousness from the viewpoint of predictive processing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3331.431,
    "end": 3332.593,
    "text": "It's really fascinating work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3340.201,
    "end": 3368.267,
    "text": " awesome cool all right well thank you ollie for the facilitation and thank you everyone um next week we'll continue to discuss chapter one in the later time period or feel free to come at this time again and we'll be um talking about chapter six the recipe for generative modeling so thank you all farewell thanks for joining everyone bye",
    "speaker": "SPEAKER_06"
  }
]