[
  {
    "start": 7.726,
    "end": 29.008,
    "text": " all right hello and welcome to active inference model stream number 13.1 it's August 23rd 2024. we're here with two of the authors of the paper synthesizing the born rule with reinforcement learning so thank you both for joining for this presentation and discussion to you Josh for the presentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.064,
    "end": 31.485,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.505,
    "end": 32.767,
    "text": "Thanks for inviting me, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.308,
    "end": 41.101,
    "text": "And yeah, it's really fun to learn about the Active Inference community and to speak to you guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.121,
    "end": 48.533,
    "text": "So I think there'll be as many questions from us to you as there will be from you guys to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.513,
    "end": 74.588,
    "text": " um so i'm not going to take up too much time i hope with my slides i wanted to just give a kind of high level overview of this article which hopefully many of you have already had time to look over but i'll give you a high level overview and that shouldn't take more than about 30 minutes i guess and after that we'll have plenty of time for discussion um there will be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.568,
    "end": 80.376,
    "text": " many points where you might feel that you want more information, more technical details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.017,
    "end": 88.828,
    "text": "But since I couldn't really predict which points might strike you as the most interesting, I'll leave it to you to ask at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.088,
    "end": 95.918,
    "text": "And as necessary, I might be able to pull up the article and point to the relevant parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.898,
    "end": 118.007,
    "text": " oh yeah uh let's dive into it oh and one last thing you might hear some background noises of either drilling or uh baby screaming that's just uh because i'm at home at the moment and uh it's part of the domestic atmosphere okay let's go so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 117.987,
    "end": 125.498,
    "text": " This is a very busy slide, sorry for that, but we do have a lot of people involved in this from many different institutions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.299,
    "end": 147.471,
    "text": "I'll put this slide also at the end of the talk in case you're curious, but it's important to mention we've got five people based at the Institute of Physics in Lab Q Rio, Rio de Janeiro, and that's where I'm currently based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.463,
    "end": 164.355,
    "text": " Although before this, during the time that this paper was mostly written, I was at the University of Massachusetts, Boston, together with two other co-authors on this paper are from there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.456,
    "end": 167.181,
    "text": "And we're all part of the Cubism group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 168.022,
    "end": 169.525,
    "text": " run by Chris Fuchs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.886,
    "end": 178.646,
    "text": "So I'll speak a little bit about cubism, which is an interpretation of quantum theory based on subjective Bayesian decision theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.588,
    "end": 183.617,
    "text": "A bit of a mouthful, but if you're curious about that, we can talk about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.492,
    "end": 184.892,
    "text": " at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.974,
    "end": 192.26,
    "text": "And John has since gone on to the University of New Mexico.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.58,
    "end": 198.546,
    "text": "And the lead author of this work is Rodrigo Piero, who is a PhD student at the time of this work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.567,
    "end": 203.852,
    "text": "And he's now at the Technology Innovation Institute in Abu Dhabi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.795,
    "end": 211.68,
    "text": "So this is another paper that was published",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 212.133,
    "end": 219.645,
    "text": " Some years ago now, just during the pandemic or towards the end of the pandemic,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.081,
    "end": 222.944,
    "text": " And this was by us at the Cubism group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.024,
    "end": 224.747,
    "text": "So you can see John and I are there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.008,
    "end": 226.989,
    "text": "Chris Fuchs is there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.51,
    "end": 235.119,
    "text": "This was a purely theoretical paper, but it contains the seeds for the article that I'm going to talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.139,
    "end": 245.471,
    "text": "So I'm going to just take a little diversion to explain what we did in this paper as a motivation for the article that I'll talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.933,
    "end": 248.755,
    "text": "Here's a little excerpt from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.562,
    "end": 250.603,
    "text": " from the abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.025,
    "end": 256.591,
    "text": "The title of the paper is Born's Rule as a Quantum Extension of Bayesian Coherence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.233,
    "end": 274.613,
    "text": "And explaining that a little bit from the abstract, the subjective Bayesian interpretation of quantum mechanics that we're calling cubism asserts that the Born rule is a normative rule in analogy to Dutch book coherence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.633,
    "end": 279.079,
    "text": "I'll explain what Born rule and Dutch book coherence are, don't worry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.363,
    "end": 287.454,
    "text": " but with the addition of one or more empirical assumptions characterizing the particularities of the physical world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.275,
    "end": 299.569,
    "text": "So the idea is that we're taking this rule called the Born Rule from quantum physics and we're saying that you can understand that rule as coming from decision theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.589,
    "end": 304.155,
    "text": "Decision theory plus certain empirical assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.277,
    "end": 308.661,
    "text": "Okay, so let me explain what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.805,
    "end": 310.926,
    "text": " bit of terminology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.609,
    "end": 316.814,
    "text": "What is this interpretation, the subject of Bayesian interpretation of quantum theory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.595,
    "end": 339.745,
    "text": "Well, there's a lot I could say about it, but for the purposes of this paper, decision theory, in other words, the theory of agents who are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.147,
    "end": 347.113,
    "text": " trying their best to make good decisions in the world, and they use probability theory in order to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.135,
    "end": 359.884,
    "text": "And quantum theory takes into account certain empirical facts, things that we've learned from experiments, and gives us an upgrade to our decision theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.165,
    "end": 363.728,
    "text": "And that's what we call quantum mechanics, according to Cubism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.23,
    "end": 368.432,
    "text": "And when I talk about Born's theory,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.475,
    "end": 372.9,
    "text": " You might have come across it in what I'm calling the legacy form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.722,
    "end": 391.089,
    "text": "It's the rule that tells you when you have some quantum state and you do a measurement on it, which traditionally is an observable that has some set of eigenstates labeled with, I've just labeled them abstractly with an index j. I'm assuming a discrete spectrum here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.451,
    "end": 396.698,
    "text": "Then to find out the probability for getting some outcome j,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.049,
    "end": 400.68,
    "text": " You just have to take the overlap",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.947,
    "end": 404.371,
    "text": " of the quantum state with the relevant eigenprojector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.732,
    "end": 408.276,
    "text": "And you take the modulus squared of that to give you a positive real number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.877,
    "end": 409.978,
    "text": "And that's the probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.739,
    "end": 413.984,
    "text": "But nowadays, we've generalized the rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.004,
    "end": 423.215,
    "text": "So from the literature on open systems and information theory, we have accommodated more general measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 423.436,
    "end": 430.144,
    "text": "So you don't just have to measure observables, which kind of project you into an eigenbasis",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.124,
    "end": 433.834,
    "text": " where each projector is orthogonal to the other ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.376,
    "end": 440.232,
    "text": "You have these things called positive operator value measures, which is a horrible name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.674,
    "end": 445.146,
    "text": "We just call them POVMs and everyone even forgets what they stand for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.126,
    "end": 452.635,
    "text": " But you can basically think about them as a generalization of observables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.875,
    "end": 459.042,
    "text": "They're the most general thing, the most general kind of measurement you could possibly do in quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.623,
    "end": 462.527,
    "text": "So that's what that D subscript J stands for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.588,
    "end": 469.615,
    "text": "It's an element corresponding to outcome J of the most general quantum measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.595,
    "end": 478.063,
    "text": " And then in that case, the quantum state is represented by a density matrix, which is that little Greek letter rho under the trace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.585,
    "end": 489.114,
    "text": "And if you take the trace of the state with the POVM element dj, then that will give you the probability for the outcome j in that quantum state rho.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.136,
    "end": 497.982,
    "text": "I hope that's familiar to at least some people watching this, but if not, feel free to quiz us on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.788,
    "end": 501.032,
    "text": " It's not super important to the rest of the talk, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.433,
    "end": 518.923,
    "text": "The important thing is Born's rule is you can think of it like a piece of the machinery of quantum mechanics that takes your quantum state and measurement as input, and it outputs the probability that you should assign for each outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.225,
    "end": 523.851,
    "text": "So it's a very important piece of the quantum formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.135,
    "end": 531.988,
    "text": " And what we found in this paper, which is the motivation for all of this, is the following.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.248,
    "end": 536.134,
    "text": "Imagine that you have a perfectly rational decision-making agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.216,
    "end": 545.769,
    "text": "Okay, perfectly rational agents don't exist in reality, but they're useful to contemplate in the abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.392,
    "end": 550.497,
    "text": "And by perfectly rational, I just mean that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 551.675,
    "end": 554.78,
    "text": " it respects the basic laws of probability theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.84,
    "end": 570.183,
    "text": "So it assigns probabilities to events which add up to one complete mutually exclusive set of events that the probabilities are positive between zero one and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 570.203,
    "end": 574.189,
    "text": "And in particular, it assigns probabilities in a consistent way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.57,
    "end": 577.835,
    "text": " And I'll explain a bit more what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.156,
    "end": 587.737,
    "text": "So suppose this agent is placing bets on the outcomes of measurements on some physical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 587.757,
    "end": 593.59,
    "text": "And we're going to assume that they hold certain beliefs about how the system responds to those measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.61,
    "end": 595.654,
    "text": "The first set of beliefs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.288,
    "end": 599.11,
    "text": " Again, this is a high level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.15,
    "end": 604.757,
    "text": "If you want to know the actual assumptions, you'll have to look at the paper or ask me about it afterwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 605.558,
    "end": 608.041,
    "text": "But there's a set of assumptions that are generic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.061,
    "end": 611.184,
    "text": "So they are things we would expect to hold in any physical theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.304,
    "end": 614.588,
    "text": "And they include things like the possibility of state tomography.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.668,
    "end": 625.641,
    "text": "In other words, you should be able to reconstruct the physical state of the system by doing a sufficiently complete measurement on it and looking at the statistics of the outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.498,
    "end": 633.649,
    "text": " And maximality is just a principle we use in any situation where there is ambiguity about how to choose things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.709,
    "end": 645.288,
    "text": "We'll just use a maximality principle, which kind of assumes the least structure necessary in order to draw conclusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.089,
    "end": 648.192,
    "text": "You could also call it a minimality assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 648.212,
    "end": 649.955,
    "text": "I mean, these things can always be flipped around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.337,
    "end": 653.08,
    "text": "It's a kind of all else being equal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.578,
    "end": 677.262,
    "text": " assumption so generic stuff but then there's an empirically inspired I call it a proto-quantum assumption why proto-quantum because this assumption actually itself is not sufficient to imply quantum theory but it's also something which you would not expect to hold in a classical theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.271,
    "end": 692.063,
    "text": " So this is the key assumption which takes us outside of the domain of classical physics and takes the first step in the direction of quantum theory without actually presuming the full quantum formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.605,
    "end": 697.729,
    "text": "And this assumption is defined purely at the operational level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 697.789,
    "end": 708.278,
    "text": "So using information theory, you can consider things like how much data can I reliably store and retrieve in my system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.068,
    "end": 714.874,
    "text": " And that gives you a concept that I'll call the informational dimension of your system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.434,
    "end": 736.155,
    "text": "So if you have a quantum bit, for example, even though a quantum bit is in a certain sense more informationally rich than a classical bit, ultimately you can only store a single classical bit of information in a way that can be reliably, perfectly encoded and retrieved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.523,
    "end": 741.472,
    "text": " So the informational dimension of a classical bit and a qubit is two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.577,
    "end": 750.47,
    "text": "But then there's another concept of dimension, which this is not conventional usage of this term, but I find it convenient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.051,
    "end": 753.756,
    "text": "I call it the tomographic dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.006,
    "end": 758.553,
    "text": " which basically says, remember, I'm assuming state tomography.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.573,
    "end": 761.517,
    "text": "So there's some measurement you could do on the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.298,
    "end": 770.97,
    "text": "This is an assumption such that if you knew the statistics for the measurement outcomes, you could perfectly reconstruct what the state of the system was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.832,
    "end": 776.939,
    "text": "And then you can ask the question, well, what's the minimum number of outcomes which that measurement needs to have?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.261,
    "end": 781.245,
    "text": "So that's what I'm calling the tomographic dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.546,
    "end": 789.608,
    "text": " And essentially our proto-quantum assumption is that the tomographic dimension is equal to the square of the informational dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.653,
    "end": 793.378,
    "text": "I know that's a lot to take in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.882,
    "end": 817.476,
    "text": " um if you want we can come back to it it's not super important for what follows but i thought it's worth mentioning that this assumption is is inspired by experiment there's no reason why out of the blue somebody would believe that this should be true in fact in classical physics it's not true classically the tomographic dimension is exactly equal to the informational dimension",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.587,
    "end": 835.05,
    "text": " So the only reasons an agent would believe in this particular assumption would be because of trying to explain statistics which we have from measuring quantum systems, among other reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.833,
    "end": 841.86,
    "text": "And our main finding in this old paper is that if the agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.009,
    "end": 856.618,
    "text": " assigns their probabilities according to these two sets of assumptions, then on pain of inconsistency, in other words, in order to be perfectly rational and consistent, they would have to assign their probabilities according to the Born rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.88,
    "end": 864.253,
    "text": "So even though we haven't assumed the mathematical formalism of quantum theory,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.638,
    "end": 877.634,
    "text": " We have found that just a minimal non-classical assumption is already enough to get you the Born rule, exactly the quantum Born rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.654,
    "end": 878.776,
    "text": "So that's quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.036,
    "end": 880.358,
    "text": "I mentioned here a Dutch book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.139,
    "end": 886.445,
    "text": "If you're wondering what that is, it's part of what we mean by a rational agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.086,
    "end": 891.051,
    "text": "In the Bayesian literature, a Dutch book is a series of bits",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.183,
    "end": 895.189,
    "text": " which the agent would agree to anyone taking individually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.229,
    "end": 900.677,
    "text": "But if you consider them together, they would be irrational to accept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 900.858,
    "end": 906.907,
    "text": "So it's kind of a litmus test for whether an agent's beliefs are internally consistent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.968,
    "end": 912.655,
    "text": "The point is just that the agent would be irrational unless they use the born rule in this case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.417,
    "end": 914.518,
    "text": "So what does this mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.799,
    "end": 917.022,
    "text": "What's the upshot of this result?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 919.145,
    "end": 937.828,
    "text": " Well, putting it in context, it's important to emphasize that this is the first time that I know of that the Born Rule is derived from essentially pure decision theory plus some pretty minimal empirical assumptions without presupposing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 937.808,
    "end": 960.475,
    "text": " uh the quantum mechanical formalism by which i mean things like hilbert spaces unitary maps and so on you know complex numbers all of that previously in the literature the born rule has been assumed as an axiom um just posited uh that was how it was first introduced by max born himself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.096,
    "end": 972.417,
    "text": " And there have been attempts to derive it from decision theory, but they usually need to invoke some of the formal structure of quantum mechanics, such as unitary dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.799,
    "end": 978.568,
    "text": "So we've really made significant progress compared to that literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.309,
    "end": 985.18,
    "text": "But I think the deeper point is that this shows that Born's rule is far more universal than quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.987,
    "end": 995.763,
    "text": " it actually applies in a range of settings where your theory might not be quantum theory, it might be some more general theory that's just not classical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.785,
    "end": 1004.417,
    "text": "And it really just stems from some fairly basic assumptions about what the agent believes about the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1006.22,
    "end": 1032.899,
    "text": " And you could say one conclusion to draw from this is that a perfectly rational agent who has the right kind of perceptual apparatus in order for them to see these empirical quantum effects in the right kind of environment would essentially be forced to use Born's rule to make their decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.78,
    "end": 1035.062,
    "text": "Well, that's nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.088,
    "end": 1040.392,
    "text": " And it got us thinking, just how universal is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1040.733,
    "end": 1046.238,
    "text": "So we've been talking about rational agents who explicitly make decisions using probability theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.779,
    "end": 1048.48,
    "text": "That's pretty advanced for an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.64,
    "end": 1053.005,
    "text": "That means that they can think, they can reason explicitly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.045,
    "end": 1059.391,
    "text": "They have minds and consciousness and not just consciousness, but mathematics, formal mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.332,
    "end": 1063.395,
    "text": "They can write down probabilities and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.27,
    "end": 1070.687,
    "text": " And we were wondering, well, but the elements here are so simple that it seems like you might not even need that much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1071.348,
    "end": 1073.835,
    "text": "Firstly, what if the agent wasn't perfectly rational?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.995,
    "end": 1080.372,
    "text": "There's a lot of literature studying deviations from perfect rationality in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1080.622,
    "end": 1085.132,
    "text": " in conscious reasoning agents, which is super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.034,
    "end": 1099.744,
    "text": "But we went to an even more basic level, and we were kind of inspired by the act of inference, the ant colony paper, which is why we cited it in that work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.213,
    "end": 1120.136,
    "text": " because that work kind of inspired us to wonder whether simple organisms like ants, which definitely don't have any explicit representation of mathematics, are nevertheless able to behave in a way which conforms to some fairly sophisticated abstract rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.518,
    "end": 1129.326,
    "text": "So we set out to discover whether a really simple simulation of an agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.998,
    "end": 1143.179,
    "text": " could end up behaving in a way that would conform to the quantum born rule without having any explicit knowledge of quantum theory or even being able to explicitly use probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.425,
    "end": 1153.356,
    "text": "So in order to actually carry out this research,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.332,
    "end": 1157.097,
    "text": " There's a lot of things that one has to decide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.157,
    "end": 1162.967,
    "text": "So there's so many ways that you might think of modeling the simple agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.489,
    "end": 1169.057,
    "text": "And to say nothing of the question of how to model the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.077,
    "end": 1171.201,
    "text": "So I'll talk about both of those in turn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.923,
    "end": 1180.356,
    "text": "First of all, we want our agent to be ignorant of quantum mechanics, as I said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.488,
    "end": 1194.727,
    "text": " But it's survival or there should be some success parameter which depends on how well it's able to predict the outcome of a measurement on some quantum system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.809,
    "end": 1210.208,
    "text": "The idea being that it's through its measurements on quantum systems that it will ensure its own survival and that's why it will ultimately, we hope, learn to behave in a way that respects the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1210.492,
    "end": 1212.835,
    "text": " the born rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.855,
    "end": 1218.403,
    "text": "And so our agent will learn from its experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.423,
    "end": 1223.27,
    "text": "And to do that, we will use the kind of action response feedback loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.29,
    "end": 1232.423,
    "text": "So at each moment, the agent will place bets in which it kind of tries to guess the probability for some outcome to occur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.903,
    "end": 1240.414,
    "text": "And then depending on what happens and what the actual outcome is, it will get some reward slash penalty",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.356,
    "end": 1246.244,
    "text": " And that will then cause it to adjust its behavior for future vetting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.347,
    "end": 1251.071,
    "text": "And we made some additional simplifying assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1252.633,
    "end": 1259.904,
    "text": "We really wanted to start with the simplest thing we could possibly think of just as a preliminary test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.387,
    "end": 1264.832,
    "text": "And in many ways, we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.825,
    "end": 1279.971,
    "text": " perhaps oversimplified, but we also did quite a lot to, you know, even though our algorithm you'll see is not very sophisticated, we also helped it quite a lot in other ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1280.031,
    "end": 1281.353,
    "text": "So I'll explain that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.379,
    "end": 1284.662,
    "text": " So we assume firstly that it's Markovian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.203,
    "end": 1296.1,
    "text": "In other words, the decision it makes at any given moment should only depend on the average expected reward for each of the possible actions it could take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.362,
    "end": 1301.949,
    "text": "So it doesn't remember exactly the sequence of rewards that it obtained for a given action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1301.989,
    "end": 1309.18,
    "text": "It just remembers the relative, the average expected reward for each one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.206,
    "end": 1320.57,
    "text": " So it kind of has a memory just in terms of its state at a given time, but that state only keeps the information of the relative weightings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.052,
    "end": 1325.358,
    "text": " And I call it a proto-Bayesian agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.919,
    "end": 1329.766,
    "text": "It can't be a Bayesian agent because it's not using probability theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1330.227,
    "end": 1334.034,
    "text": "It's just reacting in a kind of a dumb, simplistic way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.875,
    "end": 1345.815,
    "text": "But it's proto-Bayesian in the sense that if you give it enough data, so if you take the limit as the data goes to infinity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.93,
    "end": 1354.121,
    "text": " you want to find that it will behave exactly the same way that an intelligent conscious rational Bayesian agent would.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.543,
    "end": 1363.673,
    "text": "So that would kind of be the limit of, you know, the limit of large data corresponds to the limit of perfect rationality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.174,
    "end": 1372.765,
    "text": "And when you look to lower amounts of data, you can think of that as a weakening of perfect rationality due to the finite resources of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.15,
    "end": 1374.852,
    "text": " And that's what we wanted to investigate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.932,
    "end": 1382.099,
    "text": "What happens when you go to smaller amounts of data, which is what you would expect for a real organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.68,
    "end": 1388.605,
    "text": "Can't sit around collecting data without paying some kind of cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.645,
    "end": 1390.687,
    "text": "It doesn't have infinite time or energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.091,
    "end": 1400.237,
    "text": "And a very natural way to implement this kind of algorithm is a reinforcement learning algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.297,
    "end": 1407.364,
    "text": " And this is a sketch of how it runs in our implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.424,
    "end": 1425.364,
    "text": "So at each step s, and for each possible outcome j of whatever measurement we consider, I'll get to that, the agent has to choose a bet B of j from a discrete set of n options.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.238,
    "end": 1430.745,
    "text": " which take values in the interval between zero and one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.765,
    "end": 1445.59,
    "text": "So the idea here is that the agents, when in choosing a bet, they are guessing essentially what the probability is for the outcome J. Of course, they don't use probabilities explicitly for the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.271,
    "end": 1447.673,
    "text": "This is just an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.547,
    "end": 1467.452,
    "text": " The reason for us putting it in this interval is because we know as outsiders that at the level of analysis, these things will, in the limit of large numbers of steps S, these bets should correspond exactly to probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.656,
    "end": 1477.305,
    "text": "But it's from the agent's point of view, if you like, this is just a discrete set of N possible actions that it could take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.927,
    "end": 1480.049,
    "text": " And that's really all it means to the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.172,
    "end": 1497.108,
    "text": "And there is an interesting issue here because you would say, well, if these things are supposed to correspond to bets on probabilities, we're kind of fundamentally limiting the agents because we're not allowing them to pick any real number between zero and one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.969,
    "end": 1499.251,
    "text": "And that's an interesting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1499.812,
    "end": 1506.499,
    "text": "We had to do that because you can imagine that if the agent were allowed to pick any real number,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.631,
    "end": 1511.865,
    "text": " And they would start with, say, uniform prior on the unit interval.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.571,
    "end": 1516.457,
    "text": " then they would never actually choose the same action more than once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.958,
    "end": 1522.487,
    "text": "The probability would be vanishingly small that they would ever repeat an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.188,
    "end": 1526.334,
    "text": "And an agent that behaves like that just has no hope of surviving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.237,
    "end": 1529.499,
    "text": "You can't really work with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.12,
    "end": 1538.173,
    "text": "So it's important that the agent is able to repeatedly choose the same action so that they can learn what kind of responses they get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.93,
    "end": 1550.622,
    "text": " There might be more sophisticated ways to deal with this, but we found that actually beyond a certain threshold of the number of choices n, the value of n doesn't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.723,
    "end": 1563.815,
    "text": "So as long as you have kind of a fine enough splitting up of the interval that gets you approximately close to whatever probabilities you want to give, it works well enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.557,
    "end": 1567.519,
    "text": "So the agent chooses the bet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.634,
    "end": 1571.103,
    "text": " And then the measurement happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.123,
    "end": 1575.555,
    "text": "So again, I'll discuss the implementation of the measurement next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1576.337,
    "end": 1581.39,
    "text": "But the measurement results in some outcome, which I'm calling J prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.619,
    "end": 1589.469,
    "text": " And then we check whether the current outcome that we're making bets on is equal to J prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.25,
    "end": 1597.16,
    "text": "And we define this parameter E. So E is one, if we're looking at J prime and zero, if we're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.981,
    "end": 1606.753,
    "text": "And then the reward is basically just the difference between the agent's bet and E, which is zero or one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.573,
    "end": 1613.099,
    "text": " and you take that to the square and subtract it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.54,
    "end": 1614.361,
    "text": "So why do you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.922,
    "end": 1616.944,
    "text": "This is called the quadratic loss function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.146,
    "end": 1637.652,
    "text": "And the usual motivation is that this is the reward function, which guarantees that if you were actually a Bayesian rational agent assigning probabilities explicitly, this reward function guarantees that the bets that you place",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.969,
    "end": 1642.559,
    "text": " will match your subjective probability assignments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.06,
    "end": 1646.949,
    "text": "So again, this comes from our demand that the agent be a proto-abation agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.53,
    "end": 1655.809,
    "text": "Basically, choosing this reward function guarantees that in the limit of many steps, the relative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.789,
    "end": 1664.404,
    "text": " the weightings that the agent assigns to the bets that it chooses will correspond exactly to the actual probabilities for the outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.145,
    "end": 1673.359,
    "text": "So that's why we picked it also because it is mathematically the simplest possible reward function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.521,
    "end": 1678.888,
    "text": "Yeah, I mean, I call it a reward function, but it's negative reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.908,
    "end": 1681.172,
    "text": "So it's actually a loss function technically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.692,
    "end": 1685.797,
    "text": " and the agent is just going to optimize that to try to minimize its losses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1689.903,
    "end": 1690.964,
    "text": "How does the agent do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.244,
    "end": 1692.866,
    "text": "What strategy does it use?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.966,
    "end": 1698.994,
    "text": "Now it's made a bet, some outcome happens and it receives some feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.296,
    "end": 1705.843,
    "text": "How does it then choose what to do on the next step?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.752,
    "end": 1713.039,
    "text": " And we use a pretty standard algorithm for that called an epsilon greedy algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.059,
    "end": 1724.091,
    "text": "Basically, there's some parameter epsilon, which is supposed to be small, meaning significantly smaller than one, but not infinitesimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1724.131,
    "end": 1726.273,
    "text": "You can kind of play around to make it what you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.594,
    "end": 1732.06,
    "text": "And with probability epsilon, the agent just chooses randomly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.08,
    "end": 1733.181,
    "text": "So it kind of just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.747,
    "end": 1739.981,
    "text": " chooses to see what will happen without any particular reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.582,
    "end": 1745.314,
    "text": "But then most of the time, probability one minus epsilon, it will go with the safe bet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.495,
    "end": 1749.786,
    "text": "So it'll pick the action which in the past has given it the highest return.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.407,
    "end": 1766.425,
    "text": " And this is a pretty intuitive algorithm when you're thinking about actual organisms, because if you just imagine in everyday life, you're picking what restaurant to go to is a classic example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1767.097,
    "end": 1775.135,
    "text": " Some of the time you want to just go with a safe bet, the restaurant which you've been to before and you know that it's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.515,
    "end": 1782.591,
    "text": "But if you were to just do that, you would never actually find potentially better restaurants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.723,
    "end": 1790.234,
    "text": " So sometimes it's worth taking a risk and just trying a random new restaurant just to see if there might be something better out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.815,
    "end": 1801.53,
    "text": "So this is a classic exploration versus exploitation balance and the parameter epsilon tunes how much the agent favors one or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.893,
    "end": 1810.603,
    "text": "And again, it's a very natural thing to pick in the context of models of actual organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.406,
    "end": 1817.874,
    "text": " So finally, let's talk about the environment, because this is in a way where the action happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.976,
    "end": 1834.498,
    "text": "If our agent is going to have any hope of learning to behave in a way that's sensitive to quantum mechanics, at least that conforms to the Born Rule, then there has to be something special about the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.288,
    "end": 1855.626,
    "text": " If we just dumped it in a thermal bath or in some environment that could be perfectly explained by some classical physical model, there would be no reason to expect the agent to behave in a way that follows the Born rule, because the Born rule is inherently a non-classical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.927,
    "end": 1861.12,
    "text": " It applies outside the domain of classical experimental physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.942,
    "end": 1869.582,
    "text": "So what do we need for our environment to have that sufficiently rich structure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.523,
    "end": 1882.721,
    "text": " Basically, we need to make sure that the measurement statistics, whatever measurement we pick on a quantum system has to be a rich enough measurement that it exhibits quantum structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.002,
    "end": 1888.991,
    "text": "Well, it has to exhibit enough structure that it can't be explained classically by some classical model of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.873,
    "end": 1899.366,
    "text": "And that led us to use something called an informationally complete quantum measurement, POVM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.342,
    "end": 1905.315,
    "text": " And you also need to consider states of the system that are being measured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.535,
    "end": 1911.31,
    "text": "You need a variety of different environmental states, and that also should be informationally complete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.533,
    "end": 1916.443,
    "text": "So together, this is often called a tomographically complete set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.828,
    "end": 1927.84,
    "text": " because the idea is that if you know the statistics for the measurements for all of these states, you can reconstruct the mathematical form of the quantum state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.5,
    "end": 1930.222,
    "text": "So it's kind of a safe bet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.422,
    "end": 1939.932,
    "text": "If you have an informationally complete measurement and set of states, you can be sure that the structure of quantum theory is represented within the statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.273,
    "end": 1944.557,
    "text": "Now, this may be a stronger assumption than we needed to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.908,
    "end": 1947.231,
    "text": " But as I said, it's definitely sufficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.353,
    "end": 1969.144,
    "text": "And this is one of the ways that we helped out our agent, made their life easier, because realistically, we don't make any claim that a hypothetical agent that was evolving in a quantum environment would actually be doing this kind of measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.833,
    "end": 1975.263,
    "text": " And indeed, it's not even clear what that would even mean, what kind of measurements they would be doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.784,
    "end": 1986.985,
    "text": "So we're just avoiding that whole thicket of questions and just saying, okay, let's just do whatever would make it easiest for the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.147,
    "end": 1993.697,
    "text": "And we go even a little bit further just to simplify our own lives as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.183,
    "end": 1999.873,
    "text": " We assume that this measurement has a certain mathematical symmetry property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.954,
    "end": 2004.56,
    "text": "It's what they call symmetric information complete POVM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.161,
    "end": 2007.225,
    "text": "We like to call it a SIC, S-I-C.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.086,
    "end": 2009.148,
    "text": "Please don't call it a SIC.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.193,
    "end": 2014.237,
    "text": "They're really interesting mathematical objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.399,
    "end": 2020.427,
    "text": "John knows all about them, and I'm sure we'll be happy to tell you anything you want to know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.694,
    "end": 2028.848,
    "text": " But for our purposes, what's great about them is that they really simplify the form of our equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.031,
    "end": 2042.112,
    "text": "And it turns out that at least in the lowest number of dimensions where this is interesting, you can actually implement them experimentally, which I'll talk about soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.138,
    "end": 2047.004,
    "text": " So in this article, we actually didn't do an experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.124,
    "end": 2048.126,
    "text": "We just proposed one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.247,
    "end": 2050.329,
    "text": "We did a simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.13,
    "end": 2054.896,
    "text": "And that's another way in which we made life easier for the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.936,
    "end": 2062.227,
    "text": "Because in a simulation, you can assume that your quantum states are exactly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.207,
    "end": 2067.952,
    "text": " what you want them to be, pure states, no noise, measurements you can assume are perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2068.813,
    "end": 2074.859,
    "text": "And again, realistically, if this were an organism, the kinds of measurements that we'd be doing would be completely messy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.279,
    "end": 2078.542,
    "text": "The kind of states describing the variant would not be pure states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.022,
    "end": 2080.704,
    "text": "They would be thermal, they would be mixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.985,
    "end": 2090.813,
    "text": "Again, we're just sidestepping that and saying, let's just see what makes it easiest for the agent, even in that best case scenario, how well would the agent perform?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.434,
    "end": 2097.243,
    "text": " in a simulation and we can propose an experiment to kind of see how that would play out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.726,
    "end": 2108.659,
    "text": "I wanted to just show you this slide to give you an idea of what it would look like to do a symmetric information complete measurement in the lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.442,
    "end": 2114.488,
    "text": "So this is something that they can do here in Rio.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.127,
    "end": 2138.772,
    "text": " um actually have done um it's a really neat way of implementing uh this kind of um actually not just a metric but any uh kind of four outcome povm so this is the an apparatus called the displaced sagnac interferometer in quantum optics um the idea is that you um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.422,
    "end": 2152.845,
    "text": " So that's a laser beam going through there that, well, it's actually not laser, it's the path of a single photon that's coming from spontaneous parametric down conversion, which produces pairs of entangled photons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.266,
    "end": 2156.892,
    "text": "And you send one photon into this apparatus following that red line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.475,
    "end": 2163.865,
    "text": "And the other one goes to a detector, which will indicate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.013,
    "end": 2166.016,
    "text": " whether its partner photon is present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.877,
    "end": 2169.34,
    "text": "That's important because it's a spontaneous process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.801,
    "end": 2175.528,
    "text": "You don't actually know when there's a photon in there unless you grab the partner photon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2175.909,
    "end": 2180.435,
    "text": "So the presence of the partner photon tells you, yep, now there's a photon in the apparatus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.035,
    "end": 2184.099,
    "text": "OK, so the other photon goes into this complicated looking thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.119,
    "end": 2191.489,
    "text": "I won't walk you through it, but you can see there that there are four different output ports.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.672,
    "end": 2193.656,
    "text": " which label the four possible outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.497,
    "end": 2203.754,
    "text": "So here we're talking about a system that has informational dimension two, but it has tomographic dimension four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.814,
    "end": 2209.545,
    "text": "And since the seek is information complete, it needs to have four outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.588,
    "end": 2222.082,
    "text": " The reason that it's informational dimension is two is because here we're using essentially as a qubit, we're using the polarization degrees of a single photon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2222.102,
    "end": 2226.007,
    "text": "So that photon will go in there and it will pop out at one of these four detectors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.568,
    "end": 2231.434,
    "text": "And depending which one it pops out at, that gives you the outcome of your measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.954,
    "end": 2239.043,
    "text": "And the quantum system, which is kind of representing the states of our environment, is the single photon itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.63,
    "end": 2243.375,
    "text": " which can be in different quantum superpositions of polarization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.196,
    "end": 2251.545,
    "text": "So it's a very contrived implementation, but again, it's like the simplest thing you might possibly consider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2251.605,
    "end": 2263.841,
    "text": "And you can imagine that your agent somehow depends on its livelihood, depends on predicting where these photons will, where the photon will pop out in each step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.702,
    "end": 2269.468,
    "text": "So every time you send a photon through, the agent tries to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.617,
    "end": 2273.061,
    "text": " bet on the likelihood that it will pop out at each of these ports.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.822,
    "end": 2283.935,
    "text": "And every time the photon pops out somewhere, then depending on what bets the agent place, they will get rewarded accordingly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.717,
    "end": 2288.981,
    "text": "So this is how one could implement this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.924,
    "end": 2296.57,
    "text": "Now, we ran our simulation and we simulated exactly that setup",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.731,
    "end": 2301.217,
    "text": " as a kind of prelude to see what we should expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.437,
    "end": 2308.769,
    "text": "And we had a working hypothesis going in, which is that the agent should loan the bond rule fairly easily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.591,
    "end": 2317.584,
    "text": "And our reasoning was that we've gone to a lot of trouble to make this experiment, this proposal as ideal as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.624,
    "end": 2319.267,
    "text": "We're assuming",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.247,
    "end": 2321.433,
    "text": " pure states, perfect measurements and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.473,
    "end": 2322.777,
    "text": "So how hard can it be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.499,
    "end": 2329.857,
    "text": "This is like the most quantum thing that you could possibly do in dimension two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.478,
    "end": 2332.564,
    "text": "You cannot get more quantum than this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.253,
    "end": 2338.802,
    "text": " If you like, it's like you're saying this is an environment where we've dialed up the quantumness to maximum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.404,
    "end": 2342.407,
    "text": "So come on, it can't be that hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2342.988,
    "end": 2349.198,
    "text": "But it turns out it is pretty hard for the agent to learn to behave according to the Born rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.298,
    "end": 2355.548,
    "text": "In other words, if you do an analysis of its betting strategy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.507,
    "end": 2363.417,
    "text": " you can measure how close its bedding strategy is to the quantum rule, the Born rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.06,
    "end": 2383.206,
    "text": "There's a bit of math involved in how you do that comparison, but basically you can formulate it as a comparison between two matrices, and you can compute something called the Hilbert-Schmidt distance of the two matrices, and you want to see that distance basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.114,
    "end": 2412.315,
    "text": " getting down to zero ideally as the agent gets closer and closer to making bets according to the quantum the optimal quantum strategy now indeed if you go up to more than 10 to the power of five steps the agent starts to approximate um the born rule which is but that's what you would expect at that number of steps you're in the regime of large data",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.363,
    "end": 2420.417,
    "text": " At that point, the agent should be by construction, it should be behaving like a perfectly rational agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.837,
    "end": 2422.22,
    "text": "So there's no surprises there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.302,
    "end": 2430.854,
    "text": "What did surprise us is that it couldn't get such good performance without such a large amount of data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.075,
    "end": 2437.746,
    "text": "So it seemed that no matter how we fiddled with the parameters, we just couldn't get it to perform better than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.857,
    "end": 2440.942,
    "text": " And this is an open question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.982,
    "end": 2447.777,
    "text": "I mean, whether we could think of more clever algorithms, more sophisticated algorithms that could get it there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.818,
    "end": 2454.132,
    "text": "But there's a subtlety because you can't just pick any algorithm that would give you optimal performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2454.466,
    "end": 2457.29,
    "text": " because your algorithm's doing double duty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.093,
    "end": 2474.556,
    "text": "On the one hand, it has to be good at detecting the quantum effects in the statistics, but it also has to be a plausible representation of an information-gathering organism that's concerned with its own survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.597,
    "end": 2479.984,
    "text": "And it's that second point that makes this all interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.044,
    "end": 2486.75,
    "text": " because it's not super well defined what class of agents meet that description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.332,
    "end": 2507.213,
    "text": "So I'll just mention that somewhat frustratingly, we found that at relatively low numbers of steps, like 500 steps, the value of n, like the number of possible bets the agent can make, doesn't seem to matter much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2507.813,
    "end": 2509.515,
    "text": "So I mentioned that earlier on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.187,
    "end": 2521.086,
    "text": " And I guess that's kind of intuitive because realistically, when we make bets, we don't make bets of values below one cent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.426,
    "end": 2529.18,
    "text": "Our decimal places all terminate at two when it comes to placing bets, unless you're using Bitcoin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2529.22,
    "end": 2532.786,
    "text": "But let's not talk about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.492,
    "end": 2543.445,
    "text": " So the idea is it's natural to have a kind of coarse graining of your bets, aka probabilities for the rational agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.807,
    "end": 2549.774,
    "text": "And that shouldn't really matter as long as they're finely grained enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.655,
    "end": 2551.456,
    "text": "And indeed they don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.037,
    "end": 2559.206,
    "text": "Something that was more of a surprise is that epsilon doesn't matter at relatively low step counts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.827,
    "end": 2562.25,
    "text": "You can see why at very large",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.685,
    "end": 2565.028,
    "text": " data sets, epsilon shouldn't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2565.088,
    "end": 2570.013,
    "text": "Remember, epsilon is the probability for exploration, trying new things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.016,
    "end": 2587.073,
    "text": "The reason is that as long as you have some non-zero epsilon, when you run enough steps, that will be sufficient for the agent to explore the whole space of possible actions many times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.858,
    "end": 2596.185,
    "text": " So you would expect that for sufficiently large data, epsilon should stop being important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.386,
    "end": 2600.57,
    "text": "But we didn't quite expect that it would stop being important so soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2602.872,
    "end": 2604.093,
    "text": "So that's kind of interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.054,
    "end": 2617.026,
    "text": "But what the upshot of this means is just that the main limiting factor on the agent's performance turned out to be just the amount of data itself, just the sheer number of steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.272,
    "end": 2636.567,
    "text": " So the lesson that we drew from that is that unless the agent could afford the time and energy needed to acquire this much data, and think 10 to the five steps, depending what field of science you're coming from, that may or may not seem like a large number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.868,
    "end": 2654.927,
    "text": " But if you think of things that an organism has to do in order to take an action and get a response from the world, eat a piece of fruit and see if it kills you or not, that kind of thing, 10 to the 5 is pretty demanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.38,
    "end": 2674.924,
    "text": " And so if we grant the 10 to the 5 is an unfeasibly large number for a typical, a reasonable model of an agent, then we would have to conclude that it's just not going to learn to behave in a manner that reflects",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.208,
    "end": 2681.898,
    "text": " the finer quantum structure of its environment, even when that environment is explicitly quite strongly quantum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.559,
    "end": 2683.841,
    "text": "And this was surprising to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.822,
    "end": 2686.164,
    "text": "We really didn't expect that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.646,
    "end": 2700.866,
    "text": "Now, it's difficult to draw a definitive conclusion from this, but we are tempted to say something like the following, inspired by some work by cognitive scientist Donald Hoffman.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2702.508,
    "end": 2704.371,
    "text": "Some of you might know of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.195,
    "end": 2722.585,
    "text": " who he argues that in general, there's a selection pressure against organisms evolving to perceive the world as it is truly, that in fact organisms which are too accurate in their perceptions of the world will be selected out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.607,
    "end": 2726.612,
    "text": "It's just not an adaptive advantage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.812,
    "end": 2741.899,
    "text": " And he argues essentially that true information is not necessarily useful information, that what we're evolved to perceive should definitely not be expected to be what's true, but rather what's relevant to our survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.821,
    "end": 2743.903,
    "text": "And that made us wonder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.125,
    "end": 2749.613,
    "text": "We posed the following question based on these preliminary results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.69,
    "end": 2757.259,
    "text": " Could quantum sensitive behavior ever be beneficial to an organism's survival?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.801,
    "end": 2761.024,
    "text": "Or is it just too hard to learn?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.044,
    "end": 2771.618,
    "text": "If we could make more formal and well-defined and rigorous definitions of these terms, this would be a really interesting question to answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.273,
    "end": 2788.75,
    "text": " The problem is that to really decide the issue, it seems that we need a generally accepted criteria for what we mean by life and what we mean by viability of an organism that would then constrain the space of allowed agent models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.871,
    "end": 2801.824,
    "text": "As I said, there's a subtlety in making sure that you're not just picking an optimal model from a performance point of view, but choosing a model that plausibly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2802.074,
    "end": 2805.179,
    "text": " represents an actual living agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.042,
    "end": 2813.092,
    "text": "And as I said, our model, in some ways, it's too constrained because our algorithm is so simplistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.713,
    "end": 2827.575,
    "text": "You might think that there might be algorithms which are still realistic models of agents, but which might perform better because they just have more possible decision making machinery available to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.382,
    "end": 2836.757,
    "text": " But in other ways, our model is not really constrained enough because, as I said, we're assuming ideal measurements and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2836.877,
    "end": 2840.664,
    "text": "So a more general approach is needed to be decisive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.526,
    "end": 2847.336,
    "text": "Our preliminary results are suggestive, but I wouldn't say they're conclusive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2849.003,
    "end": 2852.05,
    "text": " So this is the conjecture, just to put it up on the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.152,
    "end": 2861.57,
    "text": "Even if quantum effects are strong in the environment, quantum sensitive life is generally selected against by survival pressures, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.651,
    "end": 2862.793,
    "text": "is not viable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2863.499,
    "end": 2873.75,
    "text": " In other words, maybe, conjecture, maybe the only route to quantum sensitive behavior is via higher order cognition like us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.79,
    "end": 2876.774,
    "text": "We humans, we're building quantum computers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.814,
    "end": 2882.78,
    "text": "We're definitely behaving in a way that's sensitive to quantum mechanics, but that's through explicit reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.283,
    "end": 2892.291,
    "text": "The conjecture is that there's no shortcut, that there's no way a mindless agent could evolve adaptively",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.811,
    "end": 2898.459,
    "text": " to become sensitive to quantum effects at the behavioral level just through evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.881,
    "end": 2906.491,
    "text": "Somehow, knowing quantum mechanics has to be like an accident of cognition, a bit like appreciating music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2907.652,
    "end": 2909.875,
    "text": "I mean, it's a pipe dream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.976,
    "end": 2914.943,
    "text": "I don't know if we'll ever be able to resolve this conjecture, but I put it there to stimulate discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2916.285,
    "end": 2921.552,
    "text": "So thanks again for listening, and I will open for questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2923.473,
    "end": 2923.914,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.795,
    "end": 2930.442,
    "text": "Perhaps, John, if you'd like to give a first comment, and then Ander, welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.863,
    "end": 2932.104,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2933.185,
    "end": 2933.746,
    "text": "Thanks, Jack.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2934.226,
    "end": 2936.209,
    "text": "I think you pretty much covered all the bases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2936.709,
    "end": 2947.202,
    "text": "And somehow I feel like I learned a little bit about our paper just hearing you sketch it just now, even though I'm one of the authors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2948.104,
    "end": 2951.708,
    "text": "But yeah, maybe I'll just reiterate a few of the things you said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2952.059,
    "end": 2966.493,
    "text": " because maybe the points that I think are most important to really take away, because there's a lot of quantum detailing here that doesn't matter for the kind of conclusion that we want to talk about maybe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2967.114,
    "end": 2977.905,
    "text": "And so I guess the main thing is that if you really had an ideal Bayesian agent, well, they would do what they do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2977.965,
    "end": 2979.406,
    "text": "Also, you teach them quantum mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2979.967,
    "end": 2982.049,
    "text": "And then they behave in a certain way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2982.4,
    "end": 2984.744,
    "text": " The key then ultimately is that behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2985.165,
    "end": 2987.929,
    "text": "What we want to figure out is whether there could be a shortcut, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2988.13,
    "end": 2997.005,
    "text": "So we came to cubism from the idea that decision theory can explain the born rule, like you said in our previous paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2997.966,
    "end": 3001.512,
    "text": "But real agents are part of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.572,
    "end": 3002.574,
    "text": "They're not ideal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3002.634,
    "end": 3003.395,
    "text": "They are limited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3003.435,
    "end": 3005.539,
    "text": "And so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3006.025,
    "end": 3015.498,
    "text": " You know, the question is whether there's a shortcut to the same behavior so that from the outside, it's sort of approximately indistinguishable from an ideal Bayesian agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3016.659,
    "end": 3029.997,
    "text": "And again, we thought it was really cool that, you know, you can model things like an ant colony as a Bayesian agent, even though of course it's not writing down probabilities and utilities and maximizing expected utility and all of those things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3030.598,
    "end": 3035.745,
    "text": "It's just that it takes behaviors that are sort of indistinguishable from that whole general process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3036.62,
    "end": 3045.933,
    "text": " Um, so if there were a shortcut, then, um, then you don't really need full blown Bayesian agent concept, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.514,
    "end": 3047.435,
    "text": "That would be the idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3047.476,
    "end": 3052.463,
    "text": "So, and then, okay, so that that's, that's the motivation as Jacques already covered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3052.483,
    "end": 3053.744,
    "text": "I'm not really saying anything new.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.726,
    "end": 3066.002,
    "text": "Um, but we came at this in just the very first order kind of way, I think, because what we did was we took the Bayesian agent concept and weakened it in pretty much the weakest way that you could weaken it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3066.455,
    "end": 3070.241,
    "text": " We have agents here that are making bets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3070.281,
    "end": 3074.307,
    "text": "They don't know probability theory, but it's very thinly veiled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3075.108,
    "end": 3083.281,
    "text": "We basically arranged so that in the infinite data and continuous limit, then their bets are probabilities, full stop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3083.962,
    "end": 3092.875,
    "text": "And in order to be coherent, they need to obey probability theory and they need to obey the Born rule and that infinite data would just inevitably lead them there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3093.056,
    "end": 3095.179,
    "text": "And indeed, we do get there when we get enough data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3095.615,
    "end": 3110.063,
    "text": " Um, but if it had been the case that sort of a low amount of exposure to their environment allowed them to get pretty close to the born rule, that would have made us think, okay, well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3110.38,
    "end": 3130.853,
    "text": " uh maybe the the whole idea of these higher order thinking beings that kind of can implement something like bayesian decision theory and tilbert spaces and so forth that's overkill and what you really get you can really get all of this behaviorally and what actually matters just from a simple agent-based model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3131.407,
    "end": 3133.991,
    "text": " And we found the opposite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3134.091,
    "end": 3151.116,
    "text": "Basically, we found that it took a lot of data and a lot of jerry rigging and helping and idealizations and, you know, simulating things without noise or anything like that before we can actually get the agent to behave in a way that is close enough to the born role to be meaningful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3152.598,
    "end": 3161.11,
    "text": "So that is some evidence, as Jacques said, in the direction of, well, maybe we really do need these higher order agents that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.545,
    "end": 3169.077,
    "text": " have to use Bayesian decision theory and actually think and abstract and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3169.898,
    "end": 3182.237,
    "text": "But it's also, I think we shouldn't forget that it's definitely possible, in fact, maybe even likely that we didn't weaken the Bayesian agent framework idea enough in our simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3182.656,
    "end": 3187.601,
    "text": " And I say that because the bets here are sort of different probability values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.783,
    "end": 3192.707,
    "text": "What if we had something far more heuristic?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3193.427,
    "end": 3197.672,
    "text": "And it's hard for me to think about how we would actually compare it to the real born rule in that case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3197.912,
    "end": 3211.887,
    "text": "But we've certainly not ruled out the possibility that a different kind of simple agent model could effectively learn to behave in a way that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3212.238,
    "end": 3217.665,
    "text": " aligns with quantum theory with lower resource cost.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.907,
    "end": 3227.979,
    "text": "In the way we did generalize it, it's sort of the goalpost is still you get everything that you get in the Bayesian agent setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3228.019,
    "end": 3234.488,
    "text": "And so maybe by definition, it requires a lot of resources to win that game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3234.708,
    "end": 3235.269,
    "text": "It's not clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3235.91,
    "end": 3241.738,
    "text": "But anyway, those are pretty much my comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3245.532,
    "end": 3245.953,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.133,
    "end": 3246.553,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.593,
    "end": 3249.037,
    "text": "Thank you, Andrew, for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.297,
    "end": 3250.939,
    "text": "Would you like to give an initial comment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.959,
    "end": 3252.101,
    "text": "And then I'll read any questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.161,
    "end": 3253.543,
    "text": "So then we'll continue the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.844,
    "end": 3259.611,
    "text": "Yeah, I'm not really in a position to comment much because I didn't get to read the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3259.731,
    "end": 3261.053,
    "text": "But it was a very interesting talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3261.694,
    "end": 3266.84,
    "text": "The one thing I want to ask is, could you show the slide on the Dutch book again?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3266.901,
    "end": 3270.305,
    "text": "That's around the time I showed up, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3271.887,
    "end": 3272.468,
    "text": "And then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3282.202,
    "end": 3282.462,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.163,
    "end": 3285.705,
    "text": "Was it a couple of slides later, or was it this one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.085,
    "end": 3287.627,
    "text": "Maybe a bit later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3287.707,
    "end": 3289.168,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3289.788,
    "end": 3289.969,
    "text": "Here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3289.989,
    "end": 3291.41,
    "text": "Can we recall what was going on here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3291.43,
    "end": 3296.354,
    "text": "Because it reminded me of something else that we've seen with Chris Fields, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3296.474,
    "end": 3298.936,
    "text": "But I think I missed the explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3299.096,
    "end": 3306.823,
    "text": "So it reminds me of contextuality in Chris's work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3307.944,
    "end": 3309.085,
    "text": "But I might be messing it up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3309.345,
    "end": 3311.567,
    "text": "I didn't hear the entire explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3314.23,
    "end": 3319.435,
    "text": " Do you want to know how do we use the Dutch book here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.676,
    "end": 3320.777,
    "text": "Like, what role is it playing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.817,
    "end": 3321.597,
    "text": "Is that what you're asking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3321.618,
    "end": 3322.799,
    "text": "Yeah, no, I sort of got it right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3322.979,
    "end": 3332.729,
    "text": "I think any one decision here on its own, you could approach optimality, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3332.749,
    "end": 3338.915,
    "text": "But when you start taking into account several possibilities, that's when you have the Dutch book phenomenon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3338.955,
    "end": 3339.816,
    "text": "Is that right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3342.293,
    "end": 3345.578,
    "text": " Yeah, I think so, if I understood you right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3346.179,
    "end": 3368.672,
    "text": "Basically, anytime you have an agent who has a set of beliefs expressed as probability assignments to some set of events that they're concerned with, then there's always going to be a question of whether those different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.036,
    "end": 3393.107,
    "text": " constraints so their beliefs will generally be expressed as some constraint on their probability assignments right and they might have a bunch of constraints and you want to make sure that those are all consistent with each other so the dutch book is is just mathematically a really nice way of testing that basically if you can find a dutch book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3393.34,
    "end": 3406.039,
    "text": " Using the agent's own probability assignments, that means that their set of beliefs, like the set of constraints that they're trying to adhere to, are mutually inconsistent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.483,
    "end": 3409.965,
    "text": "Did I explain it well, John?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.927,
    "end": 3413.11,
    "text": "Yeah, that's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.13,
    "end": 3421.002,
    "text": "I think one other thing to point out here, maybe, that Ander might be asking about is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3421.64,
    "end": 3428.393,
    "text": " So the two things you've emphasized here, essentially, well, actually, you only really emphasized one of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3428.413,
    "end": 3435.447,
    "text": "But in general, the Dutch book idea is like a logical consistency between the different beliefs that you have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3436.203,
    "end": 3444.976,
    "text": " And like, for instance, if I said there's a 60% chance it's going to rain today and a 50% chance it won't rain today, well, I can't hold both of those beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3445.216,
    "end": 3458.335,
    "text": "And the idea of a Dutch book is that I could ask you to pay a certain amount for one ticket that would pay the dollar if it rains and a certain amount for a ticket that would pay 50 cents if it doesn't rain, and then you just lose money for sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.355,
    "end": 3461.099,
    "text": "The Dutch book idea is you're vulnerable to a sure loss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3462.481,
    "end": 3464.944,
    "text": "So that's a purely logical constraint on your beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3465.565,
    "end": 3481.404,
    "text": " But the idea that was motivating this previous work was that what if that's, you have that, of course, being consistent is important, but you also perhaps need to be consistent with some particular kind of characteristic of the physical world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3481.544,
    "end": 3486.45,
    "text": "So there's a sort of coherence that's imposed logically and a coherence that's imposed physically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3487.651,
    "end": 3491.556,
    "text": "And in the context of informationally complete measurements,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3492.143,
    "end": 3495.387,
    "text": " Just consider a single measurement and just your probability for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3496.027,
    "end": 3506.82,
    "text": "Well, logically, the only constraint there is that you have a probability simplex and you don't assign something like probability 110% to some event or below 0.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3507.0,
    "end": 3509.362,
    "text": "So it has to be between 0 and 1 inclusive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3510.183,
    "end": 3517.932,
    "text": "But for an informationally complete measurement, physically, we just notice empirically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3518.603,
    "end": 3530.78,
    "text": " quantum mechanics implies a restriction of the probabilities that are valid for full stop for the assignment for a minimal informationally complete measurement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3530.8,
    "end": 3540.373,
    "text": "And so quantum state space, the set of valid quantum states you can have corresponds to a proper subset of a big informationally complete probability simplex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3541.754,
    "end": 3544.358,
    "text": "So that's another kind of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3545.131,
    "end": 3552.812,
    "text": " consistency you need to keep in mind if you want to actually be consistent with logic and with sort of physics in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3554.699,
    "end": 3579.357,
    "text": " i see thank you yeah so i i think i think i sort of get it and and it the point is well taken right because um the whole i don't know if you guys are aware of the course that happened last year but one of the things that chris mentioned with uh the quantum framework of active inference is that you have this this idea of contextuality which happens whenever you have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3579.877,
    "end": 3589.429,
    "text": " non-commuting QRFs, the quantum reference frames, which is what an active inference agent deploys to perform measurements and actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3590.57,
    "end": 3602.005,
    "text": "And whenever you have non-commuting QRFs deployed, I think basically the idea is that you cannot have a well-defined joint probability on the boundary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3603.466,
    "end": 3606.771,
    "text": "So it's morally very related, but I will have to check the details.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3607.191,
    "end": 3607.892,
    "text": "Thank you, guys.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3608.21,
    "end": 3611.836,
    "text": " Actually, now I get what you're aiming at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.856,
    "end": 3613.96,
    "text": "Yeah, it's not just morally related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.0,
    "end": 3629.205,
    "text": "I think it is the same thing or closely related, like formally, because actually the way that our co-author on the paper, Blake Stacey, put it is that it's an assumption of no hidden variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3629.185,
    "end": 3637.275,
    "text": " which amounts to contextuality basically saying that there can't be a joint probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.916,
    "end": 3643.904,
    "text": "I mean let me try to say something that is both precise and probably correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.925,
    "end": 3650.012,
    "text": "If you believe that you're dealing with a contextual phenomenon",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.853,
    "end": 3660.315,
    "text": " that you have measurements which are non-commuting in the relevant sense, then I think you would need to have something like our assumption two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.335,
    "end": 3669.115,
    "text": "There is, although I'm not sure that it would give you, in quantum theory, then two would definitely hold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3669.466,
    "end": 3672.552,
    "text": " So this tomographic dimension is information dimension squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.173,
    "end": 3684.015,
    "text": "Because in quantum theory, the minimal number of outcomes for an information and complete measurement is d squared, the Hilbert space dimension squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3684.468,
    "end": 3695.464,
    "text": " But if you look in a more general probabilistic framework, if you have some definition of contextuality, it's not clear to me if that would give you the squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3696.445,
    "end": 3699.27,
    "text": "It would give you something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.29,
    "end": 3703.235,
    "text": "So I would expect you to have a non equality here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.297,
    "end": 3712.669,
    "text": "So it would be non classical in the sense that your tomographic dimension should not be equal to the information dimension when you have contextuality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3713.695,
    "end": 3715.678,
    "text": " proof pending.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.599,
    "end": 3718.382,
    "text": "I bet that that's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.923,
    "end": 3733.645,
    "text": "I believe it is the case that the assumption of the possibility of a non-contextual hidden variable model is possible to formulate in terms of these proper subsets of quantum state space that I was talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3733.665,
    "end": 3737.591,
    "text": "I mean, of the informationally complete simplex that I was talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3737.871,
    "end": 3741.036,
    "text": "It just so happens that quantum state space itself pokes outside of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3741.32,
    "end": 3747.069,
    "text": " And so that means that in general, it's not compatible with the idea of a non-contextual hidden variable model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3747.41,
    "end": 3755.903,
    "text": "Or to put it more positively, if you want to talk about hidden variables, which we don't personally, but if you do, then you have to have a contextual model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3763.956,
    "end": 3764.577,
    "text": "Well, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3765.569,
    "end": 3789.315,
    "text": " that's very good awesome okay I'll read some of the comments in the live chat um and then I'll I'll have a few things I wrote down so um the text a little small but rev says is the agent always trying to guess the same quantum state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.43,
    "end": 3801.567,
    "text": " Well, so first the point of clarification, the agent isn't really trying to guess a quantum state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.587,
    "end": 3804.373,
    "text": "They're doing something much more basic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.393,
    "end": 3810.105,
    "text": "They're just trying to guess what the outcome of the measurement will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.473,
    "end": 3838.708,
    "text": " and well they're trying to guess the probability for for each outcome is it a fixed coin flip with a static or changing yeah so i mean those those probabilities will be different for different quantum states uh you know of that for instance in our implementation you your environment is is just a single photon with some polarization state and that polarization state depending what it is will give you different probabilities to get the outcomes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3838.688,
    "end": 3842.732,
    "text": " And the answer is yes, we do need to consider different quantum states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3844.114,
    "end": 3853.804,
    "text": "The reason is because if you just hold the quantum state fixed, your statistics will not be rich enough to be distinctively quantum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.464,
    "end": 3865.996,
    "text": "So in that case, you would be able to explain those statistics with a classical model and you would not expect your agent to be able to learn anything quantum in that situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3866.116,
    "end": 3867.818,
    "text": "So you need to have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3867.798,
    "end": 3891.22,
    "text": " not just several quantum states, but quantum states which are sufficiently varied across state space that it... Yeah, but when an agent is trying to learn a certain probability, though, we assume that they're in the same context where they have the same state and the same measurement, and they repeat that a bunch of times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3891.9,
    "end": 3893.482,
    "text": "So that might have been the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3893.522,
    "end": 3894.282,
    "text": "I just want to make sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3894.302,
    "end": 3895.163,
    "text": "Oh, yeah, good point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3895.604,
    "end": 3897.045,
    "text": "Yeah, I didn't clarify that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.751,
    "end": 3909.849,
    "text": " Yeah, so the agent is allowed to know when it's in a different environmental context corresponding to a different state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.75,
    "end": 3914.215,
    "text": "So it can put the relevant labels on its bedding behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3915.077,
    "end": 3915.397,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3915.718,
    "end": 3918.662,
    "text": "Very connected with context switching and attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.423,
    "end": 3922.748,
    "text": "I'll read a question or a comment in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.768,
    "end": 3924.13,
    "text": "Andrew Peshea wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.021,
    "end": 3951.552,
    "text": " actinth agents priors over observations their preferences which is what generalizes and includes the reward maximization in the pragmatic value and then expected free energy adds in the epistemic value actinth agents priors over observation their preferences as survival related homeostats expected free energy drops the need for defining an epsilon for random slash exploratory behavior hmm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.514,
    "end": 3962.941,
    "text": " I have difficulty in responding to that because I'm not sure how free energy connects with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.381,
    "end": 3967.165,
    "text": "But this is something I wanted to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.205,
    "end": 3973.731,
    "text": "Maybe this might be exactly the kind of reason why we need to talk with you guys because I didn't even understand the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3974.091,
    "end": 3982.939,
    "text": "But clearly, you're coming from a background that knows more about the agent modeling side of things than we do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3984.32,
    "end": 3995.727,
    "text": " Let me pull back in just a few of the things that I wrote, because there's kind of a triple intersection that's funny and led to this through citation letters, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.309,
    "end": 3998.093,
    "text": "So kind of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.782,
    "end": 4014.895,
    "text": " from how I understood the journey and the generalization slash weakening, but experimentally designed and the constraints of the real experimental setup and the more generic equations and also weakening those or figuring out how they could change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.915,
    "end": 4028.687,
    "text": "So you set out from the quantum born across the real experimental interfaces and got to some of these multi-scale, possibly adaptive dynamics like reward, surprise, fitness,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.667,
    "end": 4048.387,
    "text": " that are tautological about situations, then in active inference, there's kind of a dual origin, which is like one of the figures in chapter one of the 2022 textbook with this idea of active inference in the middle or coming from or to the low road and the high road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4048.907,
    "end": 4053.932,
    "text": "So the low road is like the generalized sensory motor loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4054.553,
    "end": 4059.901,
    "text": " So kind of like cybernetics or with the embodied connection like robotics or embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.623,
    "end": 4070.839,
    "text": "And then also the high road is the Bayesian mechanics, free energy principle, principle of least action for Bayesian, all of those kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.139,
    "end": 4081.776,
    "text": "So those are the first two threads with the quantum born empirical setting and then the active inference kind of, well, there is this sequentiality to behavioral updating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.756,
    "end": 4109.502,
    "text": " on the inbound sensory and on the outbound action which is like selecting a bet is like an action and chris field takes that into the quantum fvp which is like more of a recent development and then the third element is like the ants in for ants which was the paper from 2021 so a lot to say about ants but the colony for analyzing the colony as a phenomena it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4109.87,
    "end": 4130.713,
    "text": " it highlights and it starts from the lateral interactions amongst nest mates like the collective behavior and the interactions with the niche including like different kinds of pheromone decay or something like that like a sunny context might have a higher rate of decay and then also there's this kind of pragmatism of measuring anything",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.082,
    "end": 4155.958,
    "text": " which you have in the laboratory in the quantum setting and then also there's that experimental constraint in the laboratory for ants and also in the field for ants so it's kind of like the pragmatism and the real finite constraint and kind of our experimental reality and then it's just interesting that you came at this from the best",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.073,
    "end": 4184.173,
    "text": " experimental and updating process about systems that that many might say are non-cognitive or subcognitive or something like that or just differently and then also but from the more generalized cognitive side that has led into quantum bays whether or not there's like a mechanistically quantum effect in the brain that doesn't mean that the decision theory isn't already transferable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.376,
    "end": 4192.342,
    "text": " What do you think?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4192.363,
    "end": 4193.591,
    "text": "A lot of things in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.671,
    "end": 4195.0,
    "text": "I'm busy absorbing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4195.604,
    "end": 4196.188,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.755,
    "end": 4204.185,
    "text": " You know, you mentioned, I mean, one of the things about this work on active inference is the multi-scale structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.205,
    "end": 4224.117,
    "text": "And this was something that in our paper, we kind of hand wave towards the end about our work really focusing on, I guess, what you were calling the low road, which in the sense that we thought of our little proto agent as more like an ant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4224.805,
    "end": 4251.572,
    "text": " But then we kind of posed the question of whether if you got a lot of these guys together and have them interacting or somehow working together, you could kind of look at the whole system and get an emergent behavior to which you could attribute, you could model from a kind of Bayesian rational agent point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.025,
    "end": 4266.843,
    "text": " Um, but that, you know, we didn't really get as far as addressing the, the kind of multi-scale stuff, I think, because we're still trying to work out the fundamentals, you know, pure action response dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4267.243,
    "end": 4273.991,
    "text": "I mean, maybe we need the multi-scale thing in order to meaningfully generalize or to weaken.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4274.211,
    "end": 4275.813,
    "text": "Like that might be the right thing to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4276.814,
    "end": 4279.838,
    "text": "Um, and it may maybe make sense that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4280.324,
    "end": 4290.486,
    "text": " It's so hard to make a simplified sort of non-cognitive approximation of the Bayesian agent model in the way that we did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4291.067,
    "end": 4297.742,
    "text": "But we did it this way because we didn't know any better, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4298.043,
    "end": 4299.606,
    "text": " It's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4300.007,
    "end": 4315.275,
    "text": "Two of the things from Chris Fields' course, the physics as information processing, was also relaxing sometimes constraints about space and time, like having agents make their own spatial temporal reference frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.306,
    "end": 4322.595,
    "text": " So rather than just plugging in agents into kind of a grid work that's defined by an observer, whether or not they're modeling themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4323.416,
    "end": 4337.693,
    "text": "And then also just the environments and the partition, the interface, the blanket, all those different ways to describe the interface between internal and external states or whatever notation or variables are used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4337.793,
    "end": 4341.938,
    "text": "So that's kind of like the communication setting, like Alice and Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4342.087,
    "end": 4352.458,
    "text": " But then maybe Bob is the ground and it's pheromone distributions as actions, but then it's not about like whether or not that's like an action of the ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.478,
    "end": 4356.803,
    "text": "It's like, well, that's being modeled by a person making another finite model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.223,
    "end": 4360.507,
    "text": "So it's a map territory for how they're drawing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4362.189,
    "end": 4367.935,
    "text": "So there's a lot of interesting pieces and great, great topics to go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4368.555,
    "end": 4369.056,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.989,
    "end": 4400.258,
    "text": " one other connection is you said something about the general born extending into the unobservables and this is like one of the key moves with the separation of observations and latent or hidden or external states so there's like a the ambiguity matrix which is just a bi-directional mapping what would the measurement distribution be from a hidden state what does this observation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.305,
    "end": 4428.642,
    "text": " then the observations can be attached with epistemic value and a pragmatic value related like the cost of sampling and just the preferences against expected future observations those are all kind of like cognitive motifs like we could explore what experiments do or do not show that a nestmate plans can you falsify or put a probability distribution over the idea that it's doing something beyond its immediate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4428.74,
    "end": 4429.661,
    "text": " sensory blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.701,
    "end": 4431.184,
    "text": "How many time steps of memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.224,
    "end": 4432.826,
    "text": "How many time steps of anticipation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.886,
    "end": 4439.576,
    "text": "That's a model selection question with a certain lab or field data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.217,
    "end": 4447.287,
    "text": "It's like, well, there's there could be a difference, but it would require getting 10 to the five foraging runs by the same nest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.307,
    "end": 4449.29,
    "text": "Yeah, but it may never take that many.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4449.791,
    "end": 4456.941,
    "text": "And so that also kind of talks back into the evolutionary priors and the distributional starting position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.495,
    "end": 4460.959,
    "text": " which is like always a problem in applying Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.979,
    "end": 4465.083,
    "text": "And then there's like a kind of neat fitness oriented way to give the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.885,
    "end": 4467.205,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4467.446,
    "end": 4472.671,
    "text": "I mean, and also, I mean, use the nest mate language, which is a fun thing to talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4472.691,
    "end": 4481.521,
    "text": "I mean, in our sense, like one single ant alone is pretty useless because it can never live long enough to get 10 to the five things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4481.581,
    "end": 4486.506,
    "text": "But if it's got a bunch of nest mates and they can communicate with their pheromones and so forth,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4487.043,
    "end": 4493.034,
    "text": " then maybe 10 to the 5 isn't a lot when you have a bunch of agents interacting and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4495.038,
    "end": 4499.466,
    "text": "It's a great, interesting debate with the ant colony world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4499.526,
    "end": 4505.237,
    "text": "And what's interesting about ants, I mean, among things is they're obligately colony living.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4505.588,
    "end": 4515.982,
    "text": " Whereas other hymenopteran, like even the bees and the wasps, they have a lot more variability with different life histories, but then the ants have the obligate eusociality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.483,
    "end": 4533.165,
    "text": "So that kind of like the termites are different than those other ones, like in both those or any obligately social form, then the unit of fitness can be kind of targeted as, and so it sets a norm for,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.55,
    "end": 4557.094,
    "text": " not the only possible norm but it's like optimal foraging theory it's like is about one nestmate getting the most food per unit time it's like maybe if that were a special special case of water loss and time and colony hunger and the seasonality then it could be considered optimal but if the optimal strategy is not then the sheer amount of foraging activity or type of it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4557.817,
    "end": 4562.283,
    "text": " It can't be considered like it's only optimal within an evolutionary context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.343,
    "end": 4564.205,
    "text": "Otherwise, you're just saying, who is foraging more?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.687,
    "end": 4565.948,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.07,
    "end": 4568.491,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4568.531,
    "end": 4582.189,
    "text": "This is a bit off topic, but it's a wild idea that just kind of popped into my head now that we're talking about actual organisms like ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.349,
    "end": 4584.752,
    "text": "It occurs to me that most of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.677,
    "end": 4613.136,
    "text": " living creatures that we could think of off the top of our heads so far as we know are not specifically sensitive to quantum effects i know there is a literature on quantum effects in biology but it's usually really down at the chemical level like in photosynthesis um or uh but you know i wonder like there's work that you know the human eye",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4613.656,
    "end": 4635.732,
    "text": " is it they know that the the cells in the retina are sensitive down to the single photon level like in principle just that a handful of photons can trigger a retinal cell to fire and there are experiments kind of working on i know because my wife who's also one of the co-workers on this paper is working on this stuff here in brazil um but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4636.37,
    "end": 4656.775,
    "text": " uh it makes me wonder if like maybe there are because there are creatures out there with some pretty amazing capabilities like there's the mantis shrimp which has these crazy eyes that have trinocular vision and i don't know what else you know maybe there's some living creatures that we could actually get into a controlled lab environment and have them actually interacting with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4656.755,
    "end": 4676.13,
    "text": " uh quantum stuff you know if they're photon sensitive you could kind of see if you can fire photons at them and get them to behave in in a responsive way i don't know that just seems like it might be really cool i'm just throwing that out what would it like mean or show if there was a way to do it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.933,
    "end": 4706.033,
    "text": " would just be cool man that made me think of having a photon instead of killing a hypothetical cat it releases one like pheromone for a moth or one molecule of glucose for a bacteria so and that's kind of what the synapse does with the discretization into the packets and then to the neurotransmitter discretization level with release",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.603,
    "end": 4725.244,
    "text": " And that also relates to something that came up a lot in the Chris Fields was the interplay of kind of classical and non-classical state spaces and the interface as being like the more classical barrier and then different aspects of that when it's interacting with the quantum Alice and quantum Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.13,
    "end": 4732.492,
    "text": "Andrew, want to add any more?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4732.532,
    "end": 4734.754,
    "text": "Where else do you think it would like connect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4737.13,
    "end": 4739.377,
    "text": " Yeah, that was an interesting thought by Jax.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4740.36,
    "end": 4748.727,
    "text": "My question to you is, don't you think that the issue of agents being able to observe quantum effects",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4750.377,
    "end": 4754.085,
    "text": " you know, I see it related to the FEP in the following way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4754.145,
    "end": 4759.858,
    "text": "Like one of the latest papers, he talks about the FEP driving compartmentalization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4760.239,
    "end": 4768.116,
    "text": "And you can imagine that as an organism, you know, becomes larger and more sophisticated, we'll have more degrees of freedom",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4768.366,
    "end": 4794.002,
    "text": " available to be able to pick up very subtle quantum effects and an even more outdoor idea you know it almost feels like no difference to how we need high energies in accelerators to observe real small stuff you know yeah one other kind of topic i'd love to hear more about was the fourfold nature of the experiment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4794.033,
    "end": 4803.691,
    "text": " because that made me think about a collision of the particles and how that's often thought of as like two interacting components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.653,
    "end": 4809.763,
    "text": "However, there's also like, let's just say that there are two real interacting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.929,
    "end": 4829.218,
    "text": " real question mark, then you have an interface and then like a S and an O, you have observation and then at least a measurement frame that's been learned to calibrate like the A matrix projecting onto like a P value or base factor, some other kind of other further downstream analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.719,
    "end": 4832.343,
    "text": "So it's like, are there four things there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.344,
    "end": 4835.768,
    "text": "And then what are those four",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.03,
    "end": 4849.026,
    "text": " And so what is it about the fourness of the empirical setup and how is it exactly two for the exponents or how does, is that variable or is that always an integer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.066,
    "end": 4857.598,
    "text": "That too is purely from Hilbert space geometry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4858.519,
    "end": 4866.109,
    "text": "And so insofar as we use quantum theory and well, insofar as the model is right,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4867.169,
    "end": 4879.832,
    "text": " and associated to any system, you can always write down a Hilbert space of some dimension, then it's just a matter of mathematical fact that the state space only spans a d squared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4879.852,
    "end": 4882.116,
    "text": "Well, actually, d squared minus 1 because there's a normalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.136,
    "end": 4890.19,
    "text": "But anyway, it's a d squared dimensional operator space, which is where quantum states live.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4891.098,
    "end": 4896.643,
    "text": " Yeah, it can't be d squared plus one or d squared minus one unless you're talking about something other than quantum theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4896.663,
    "end": 4901.227,
    "text": "And so far, we don't seem to have anything other than quantum theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4901.267,
    "end": 4911.436,
    "text": "So yeah, that empirical part, I mean, we call it empirical, but it's empirical at the level of, is this theory we've been using for 100 years actually right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4912.137,
    "end": 4917.241,
    "text": "Not empirical at the, well, we measured this mass, and it looks like it's within this and this, and it's plus or minus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4917.842,
    "end": 4919.063,
    "text": "So it's like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4919.735,
    "end": 4926.105,
    "text": " It's a bit of a lie to call it, it's not purely empirical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4926.546,
    "end": 4942.992,
    "text": "It's meta-empirical and it's pragmatic in the sense of pragmatism, which isn't some kind of pure utilitarianism, but pragmatism just deals with the pragmatic aspects of operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4943.208,
    "end": 4944.031,
    "text": " Mm-hmm, OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.713,
    "end": 4952.498,
    "text": "Yeah, like, mathematically, if you want to do state tomography, you're going to need at least d squared outcomes, and they better be good ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4953.0,
    "end": 4953.401,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4954.324,
    "end": 4954.585,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.459,
    "end": 4973.367,
    "text": " and then an interesting extension into the behavioral space where neither kind of i mean mass-based classical models but even kind of classical inspired models don't describe all behavioral data and then like if the observation has dimensionality n",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.347,
    "end": 5000.13,
    "text": " like n sensors for sensor fusion then a has n squared because it's square or second powered to to map all the matrix mapping all by all observations to hidden states and then b which is what the control policy is exerted as a slice from which is like a behavioral collapse from makes it another power because there's how the the s vector",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.887,
    "end": 5001.368,
    "text": " changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.868,
    "end": 5005.833,
    "text": "So a kind of balloons it out, but then projects it back down to some other possible space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.334,
    "end": 5012.782,
    "text": "And then B, it squares us because it's a transition selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.665,
    "end": 5019.671,
    "text": "And so then there's a lot of interesting traces to follow there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.691,
    "end": 5025.799,
    "text": "I confess that mostly went over my head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5026.1,
    "end": 5028.683,
    "text": "But yeah, it's not Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5030.063,
    "end": 5031.726,
    "text": " What about the plus or minus 1?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.309,
    "end": 5035.191,
    "text": "Which plus or minus 1?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5035.231,
    "end": 5037.354,
    "text": "From the d squared plus or minus 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.856,
    "end": 5040.719,
    "text": "Why could it be plus or minus?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5042.442,
    "end": 5044.104,
    "text": "Oh, no, I was saying it couldn't be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5044.625,
    "end": 5045.947,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5045.967,
    "end": 5047.69,
    "text": "Yeah, yeah, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5047.73,
    "end": 5050.154,
    "text": "Yeah, if it were different, it would be a different theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5050.214,
    "end": 5050.915,
    "text": "That's what I'm saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5051.576,
    "end": 5055.742,
    "text": "Yeah, so it looks like it has to be d squared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5055.762,
    "end": 5056.223,
    "text": "Yeah, I mean...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5057.789,
    "end": 5060.252,
    "text": " it's something that would be nice to explore one day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.853,
    "end": 5066.782,
    "text": "Like what what are these theories that have different numbers that are not just the squared?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5067.042,
    "end": 5072.93,
    "text": "But yeah, too many questions too little time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5072.95,
    "end": 5074.593,
    "text": "We're only on a 4d live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5075.214,
    "end": 5075.614,
    "text": "You can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.256,
    "end": 5079.299,
    "text": "Well, what happens next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5079.74,
    "end": 5079.78,
    "text": "Or"
  },
  {
    "start": 5080.925,
    "end": 5084.69,
    "text": " Where should others, or what are you going to explore?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5085.091,
    "end": 5092.401,
    "text": "I think, you know, based on this conversation, the thing that sounds most promising to me, if we were going to take this further is the multi-scale part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5092.461,
    "end": 5107.322,
    "text": "Like I think really we want to model agents or an agent or the, the, the, the, the target of Bayesian agent has to be sort of the emergent property of many little guys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5107.642,
    "end": 5109.565,
    "text": "I think that's, that's probably.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5110.0,
    "end": 5119.695,
    "text": " the most pertinent thing to take from your kind of community and what we totally ignored in this work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5120.236,
    "end": 5132.835,
    "text": "And so we barely mentioned that in the paper, but I think, personally, that feels like the most exciting possible way to push this direction further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5133.811,
    "end": 5134.613,
    "text": " I don't know about Jacques.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5135.655,
    "end": 5137.999,
    "text": "I think, John, I think you're probably right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5139.081,
    "end": 5148.299,
    "text": "Just pragmatically speaking, that seems like something that's concrete and well-defined enough that one could actually make progress in that direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5148.64,
    "end": 5150.183,
    "text": "And it would be interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.737,
    "end": 5173.453,
    "text": " but you know just speaking from like what what is like the deep question that i would really like to know the answer to but i'm not even sure how to formulate it in a way that could be attacked with research is you know there's this idea that quantum theory is a bit weird because of this you know like the non-contextuality thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5174.412,
    "end": 5182.363,
    "text": " And the world that we live in and that so far as we know all living creatures live in is not a quantum world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5182.684,
    "end": 5187.611,
    "text": "We're macroscopic, thermal, completely decoherent creatures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.113,
    "end": 5194.26,
    "text": "Decoherent in the sense that quantum theory just isn't important to our everyday",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5194.24,
    "end": 5195.884,
    "text": " interactions with our world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5196.766,
    "end": 5209.718,
    "text": "And I guess I'm wondering whether that's just an accident of the fact that life evolved in a very hot, wet regime where quantum coherence doesn't survive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5210.069,
    "end": 5224.365,
    "text": " or whether there might be a deeper reason behind it, that somehow if you try to create life under really controlled conditions where you enabled quantum coherence to survive and quantum coherence to be really strong in the environment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5224.666,
    "end": 5254.538,
    "text": " know imagine like if if Planck's constant were just some really large value in a hypothetical universe could life evolve in that universe or is there something about the weirdness of quantum theory that that forces life to only exist in in effectively in decoherent regimes you know that's kind of a deep question I have I'm sure that our very preliminary work hasn't shed any light on it but I think it did",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.125,
    "end": 5257.868,
    "text": " do the valuable job of raising it as a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5259.951,
    "end": 5260.231,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5260.251,
    "end": 5269.161,
    "text": "I mean, cause what could have happened was we could have just immediately found that even in the first attempt to weaken the Bayesian agent thing, it just gets the born role immediately.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5269.201,
    "end": 5281.876,
    "text": "And then you can say, well, probably, well, but it also would have, I mean, you know, it would have said, oh, well, we're sort of barking up the wrong tree with this high level Bayesian decision theory approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5282.056,
    "end": 5283.057,
    "text": "It's not necessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5283.442,
    "end": 5286.346,
    "text": " Um, so far as we know, it is necessary still.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5286.887,
    "end": 5289.751,
    "text": "Uh, but, um, anyway, we didn't rule it out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5290.932,
    "end": 5291.273,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5291.693,
    "end": 5292.875,
    "text": "An interesting thread there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5293.095,
    "end": 5312.942,
    "text": "It's the paper discussed in live stream number 49 with Ramstad and Saktive Devel with showing the kind of development and generalization of classical thermodynamic, infodynamic, and then quantum, and then getting into the cognitive like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5313.158,
    "end": 5336.972,
    "text": " a quantum observer or interface that being the bayesian mechanics which is the where the path of least action free energy principle all that is existing and it's like another generalization from the it's another degree of freedom which is the analytic aspect and the pragmatically constrained reality of it for the quantum investigator",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5342.403,
    "end": 5343.885,
    "text": " So you're doing it, so that's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5346.128,
    "end": 5346.929,
    "text": "We're on the path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5347.37,
    "end": 5348.051,
    "text": "We're doing something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5349.312,
    "end": 5352.176,
    "text": "Well, any last comments for anyone?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5355.36,
    "end": 5355.921,
    "text": "Read the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5359.486,
    "end": 5359.987,
    "text": "Read the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5360.067,
    "end": 5360.728,
    "text": "It's a classic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.632,
    "end": 5365.073,
    "text": "It will be when people read it, otherwise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5365.093,
    "end": 5365.554,
    "text": "Yeah, maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5365.574,
    "end": 5368.478,
    "text": "It will be a classic, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5369.656,
    "end": 5370.618,
    "text": " Looking forward to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.998,
    "end": 5372.741,
    "text": "We'd be happy to stay in touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.781,
    "end": 5378.65,
    "text": "And Ander and others and Chris Fields, we could explore a lot more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5379.031,
    "end": 5379.191,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5379.692,
    "end": 5382.396,
    "text": "And the measurements and the quantum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5382.556,
    "end": 5385.862,
    "text": "And we can explore with the AMP multi-agent frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5385.962,
    "end": 5386.062,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5386.042,
    "end": 5387.807,
    "text": " So there's a lot of great paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.988,
    "end": 5391.9,
    "text": "I think Jacques and I need to read up on that and then we'll come back to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5393.084,
    "end": 5395.07,
    "text": "That seems promising to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5395.11,
    "end": 5396.173,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5396.594,
    "end": 5396.915,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5397.577,
    "end": 5398.56,
    "text": "Thanks for having us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5398.58,
    "end": 5398.701,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5399.042,
    "end": 5399.764,
    "text": "Thanks for having us.",
    "speaker": "SPEAKER_03"
  }
]