[
  {
    "start": 2.883,
    "end": 3.264,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3.724,
    "end": 4.385,
    "text": "Hello, fellows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5.166,
    "end": 13.357,
    "text": "We are in, by all independent accounts, the last of the meetings of Cohort 7 in Chapter 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.24,
    "end": 20.607,
    "text": "We've already had some interesting sharings and consolidations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 21.769,
    "end": 26.615,
    "text": "So what would be interesting in this time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.478,
    "end": 32.383,
    "text": "If Chapter 10 is the takeoff...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.848,
    "end": 34.649,
    "text": " Where do we go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.669,
    "end": 38.073,
    "text": "Or where are we in our own chapter tens?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.545,
    "end": 50.749,
    "text": "Well, for me, for me, you say Steven, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.111,
    "end": 56.937,
    "text": "I was just gonna say it's model building is applying applications is where I'm at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 75.918,
    "end": 105.537,
    "text": " andrews um well for me um it's just an achievement to have finished reading the book i still have to read the appendices but uh upon reading the book i feel like i have a sense of the complete picture maybe in a murky way and then what it invites me is a couple of things one is to be able to tease out the flesh and the bones i guess or or to say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.259,
    "end": 109.69,
    "text": " like what is actually active inference saying?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.73,
    "end": 115.849,
    "text": "And then what is kind of like additional ideas that come out from applying active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.869,
    "end": 119.982,
    "text": "Cause those additional ideas, they could be brilliant or they could be just,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.468,
    "end": 141.396,
    "text": " not so brilliant but that's a separate thing so and you were just talking about that if you just look at the bare bones active inference that's actually a common theme across all different types of let's say I think it was like learning you know large language models or different types of AI approaches so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 141.983,
    "end": 149.071,
    "text": " What that means is that in order to really appreciate active inference, it's important to look at it minimalistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.832,
    "end": 154.637,
    "text": "Like not what are all people trying to do to apply, but really what is it like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.017,
    "end": 156.919,
    "text": "It's a little bit for me like calculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.019,
    "end": 161.504,
    "text": "Like calculus is absolutely important for modern physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.465,
    "end": 167.831,
    "text": "And so you wouldn't want to make calculus more physical than it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.931,
    "end": 171.535,
    "text": "It's just a mathematical way of thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.426,
    "end": 197.235,
    "text": " and then you wouldn't maybe want to say that the calculus is a theory of everything but to be able to really appreciate so what exactly is calculus and what is it contributing you know and how does that relate to linearity let's say or not and things like that uh i think that's where i'm at and i think like in order to do that maybe the next step for me is just to uh compute you know so uh to learn how to uh use the python",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.215,
    "end": 214.144,
    "text": " modules i guess and to compute things that would be relevant for me and get some hands-on experience i think that's probably the next step for me and then maybe after that like then to say okay take a fresh look at let's say what are bayesian statistics and the related math and stuff and work from there that's where i'm at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.172,
    "end": 247.224,
    "text": " Maybe to say like, what's attractive for me, it does seem to be very sweet in terms of putting perception and action in a unified footing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.905,
    "end": 253.75,
    "text": "But that's a very particular case where you're assuming that you're looking at the world with a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.631,
    "end": 259.916,
    "text": "And then from the point of view of that model, you know, you have this active look at perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.056,
    "end": 261.377,
    "text": "And so you have this active",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.948,
    "end": 276.308,
    "text": " look at action, let's say, and then you have this ability to quickly switch from one to the other based on, I guess, free energy, the free energy, I guess, maximizing or minimizing the free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.67,
    "end": 278.491,
    "text": "So that's all fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.511,
    "end": 282.196,
    "text": "But that's assuming a certain outlook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 282.536,
    "end": 286.582,
    "text": "And I don't think that every outlook is always based on a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.144,
    "end": 291.128,
    "text": "So there's alternative outlooks, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.154,
    "end": 293.656,
    "text": " So just to kind of tease that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.397,
    "end": 300.226,
    "text": "What kind of alternative outlooks, other than looking at systems in terms of their input and their output?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.389,
    "end": 308.198,
    "text": "Well, I just don't think necessarily the physical world is based on a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.559,
    "end": 313.346,
    "text": "Because a generative model is kind of like a symbolic assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.827,
    "end": 317.773,
    "text": "So in the way I would think about it, there's knowing versus not knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.113,
    "end": 319.275,
    "text": "So there's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.441,
    "end": 321.384,
    "text": " you know, maybe values and variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.464,
    "end": 329.615,
    "text": "And so the generative model presumes that you have this world of variables, of not knowing, of symbolic language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.977,
    "end": 334.442,
    "text": "But I think that something like a neural network doesn't have that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 334.522,
    "end": 338.687,
    "text": "I think it's not about having variables and slots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.727,
    "end": 346.057,
    "text": "I don't think that that's a good way to think of a neural network working or just all different kinds of wiring working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.199,
    "end": 347.98,
    "text": "There's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.28,
    "end": 353.446,
    "text": " There's a, and so I think more like a generative model is working on top of other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.547,
    "end": 361.275,
    "text": "But not, it wouldn't make sense, I think, to have like, so the notion that everything is a Markov blanket, I just don't think that that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.295,
    "end": 364.179,
    "text": "You can look at everything as if it's a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.219,
    "end": 365.681,
    "text": "But that's very peculiar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.841,
    "end": 368.684,
    "text": "That's, that's a peculiar, maybe important way of looking at things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.225,
    "end": 372.769,
    "text": "But that doesn't, that's not the only way that things would function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.55,
    "end": 376.751,
    "text": " And I don't think physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.871,
    "end": 385.441,
    "text": "I mean, it returns to kind of map territory there, because when you said that the neural network isn't just parameters and slots, I mean, on the first level, it literally is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.621,
    "end": 387.543,
    "text": "That is what the parameters of the neural network is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 387.603,
    "end": 389.065,
    "text": "They literally are parameters and slots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.125,
    "end": 399.837,
    "text": "And then even abstracting, if we couldn't look at those parameters in the slots, there's still an input output relationship which is modeled with an interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.711,
    "end": 406.907,
    "text": " That's kind of the surface, like the sort of cloud of unknowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.123,
    "end": 420.559,
    "text": " edge of our doors of perception that any modeler finds themselves in, which is the situation described by inferring latent states from observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 421.36,
    "end": 423.722,
    "text": "And then the special case of action is not acting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.323,
    "end": 432.152,
    "text": "So the passive case we get for free, and that's why we seek to study the possible joint",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.132,
    "end": 459.338,
    "text": " um co-action of perception and motor movements for example well i think maybe there's a two ways see i think it's more about i think your points are important and i guess they're probably correct but i think it's maybe then about interpretation like even with a neural network and i know very little bit a little bit about them but i think that there's two different ways to interpret them like you can interpret them in terms of like a hard wiring where like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.824,
    "end": 467.397,
    "text": " you're just getting signals that are coming together and they're, you know, at any instance, there's no notion of variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.478,
    "end": 468.542,
    "text": "I mean, it's just what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.663,
    "end": 469.868,
    "text": "It gives you what it gives you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.675,
    "end": 480.209,
    "text": " Now then you can say, okay, but let's make it, and maybe that's the point of the neuron nature is that let's make it more flexible where it could be rewired, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.229,
    "end": 481.851,
    "text": "It doesn't have to be just wired once, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.871,
    "end": 482.933,
    "text": "It could be rewired.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.714,
    "end": 490.303,
    "text": "So the notion that this is plastic and that this is a rewirable and that these are slots, let's say, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.283,
    "end": 516.645,
    "text": " that's almost like a different interpretation of what's going on it's saying well there's a different way of looking at the neural network where it's saying this is all plastic these are all arbitrary you see and i think the fact is that those both those interpretations are important and i my claim would be i think that both those interpretations are communicating with each other and there's a gap between those two communications and so so that's the gap in the action perception model like the action the i mean the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.625,
    "end": 517.206,
    "text": " I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.226,
    "end": 517.446,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.507,
    "end": 519.79,
    "text": "Well, the organism and the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.931,
    "end": 523.877,
    "text": "In the environment, you have one hardwired reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.599,
    "end": 530.489,
    "text": "And then in the organism, you have this idea that, oh, we can be flexible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.631,
    "end": 532.492,
    "text": "We can be flexible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.913,
    "end": 536.359,
    "text": "But whereas the environment's considered, it is what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.759,
    "end": 538.903,
    "text": "So I think that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.377,
    "end": 544.58,
    "text": " I think I see you on that view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.6,
    "end": 557.219,
    "text": "And we sometimes are thinking about that, like, it's a static room, and the agentic organism can navigate do the change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.4,
    "end": 563.167,
    "text": "But the whole point is, it's joint system modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.409,
    "end": 568.435,
    "text": "And it could be a super dynamic room with a metronome in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 569.41,
    "end": 572.514,
    "text": " Or it could just be two metronomes or it could be two really dynamic things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.574,
    "end": 581.305,
    "text": "It's like, so kind of making a qualitative assumption that the environment or the organism has any given structure or that one is larger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.826,
    "end": 583.928,
    "text": "They're just convenient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.709,
    "end": 585.77,
    "text": "It's like here and there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.951,
    "end": 590.676,
    "text": "Like there could be here and here could be there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.5,
    "end": 594.484,
    "text": " Well, or which is the context and which is the being?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.825,
    "end": 596.908,
    "text": "You know, I think like that's the kind of question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.948,
    "end": 600.673,
    "text": "And so the thing I'm researching, and you know a bit about this, I call it, you know, it's about periodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.693,
    "end": 606.602,
    "text": "It turns out that you have this oscillation between, well, who's the being and who's the context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.263,
    "end": 612.31,
    "text": "And so in quantum symmetries, you talk about the context of the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.897,
    "end": 619.347,
    "text": " which could be the being, you know, so it's kind of like you have a vector and you have what's called the dual space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.488,
    "end": 621.671,
    "text": "These are like functionals on the vector space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.152,
    "end": 627.58,
    "text": "But then the dual of the dual is typically the vector where like you just, it's the values I guess it could take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.761,
    "end": 639.259,
    "text": "So, and it turns out with a quantum symmetry, when you do the dual of the dual or you do the context of the context, you may get back to where you started, but you're also allowed to get back to the negative of where you started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.239,
    "end": 660.471,
    "text": " you know so it's kind of like the the in this case it'd be like the data became the slots and the slots became the data or like the particles became the holes and the holes became the particles and so and then ideas that there's this thing called periodicity where you can cycle through these things and there's like eight different possibilities and you just come back so the thing i realized yesterday was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.008,
    "end": 677.069,
    "text": " When you go from context and back and you look at this whole cycle, it looks like the database update problem where like you have two copies, we're kind of like looking at things from two copies, and then you want to be able them to be mismatched.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.129,
    "end": 685.8,
    "text": "Like if you want to, you're working with a database and it's giving you a presentation, you want to be able to edit that, but then it needs to be able to update its record.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.78,
    "end": 712.598,
    "text": " so there's going to be a mismatch and then there's going to be a re-synchronization and a mismatch and recent creation so there's an oscillation between are your two different ways of looking at them kind of meshed so nicely together there it's hard to distinguish or are you realizing no here's an instance and here's a general plastic you know ability let's say and they need to be kept separate and they actually mismatch right now but then they'll rematch am i kind of making sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.999,
    "end": 742.956,
    "text": " it seems like that it would be again a feature of the model that would employ the methods yeah so this is saying like active inference is a very nice beautiful or maybe even slick like a way of talking about one aspect of this and then you have to okay so what's what's the models that you're gonna think of this in terms of and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.628,
    "end": 744.89,
    "text": " And that's what I'm talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.27,
    "end": 754.683,
    "text": "And I think the idea is that between the organism and the environment, is there a third mind that is kind of like facilitating that or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.904,
    "end": 756.346,
    "text": "You know, is it needed or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.387,
    "end": 767.261,
    "text": "But if you have this kind of like database update problem where we have this kind of mismatch, like, or like, you know, I have this emotional situation where like, I don't feel things are right, let's say, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.281,
    "end": 768.623,
    "text": "And you're trying to model that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.649,
    "end": 774.995,
    "text": " it may suggest that there's above and beyond that these things are not self regulating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.076,
    "end": 780.762,
    "text": "There's a regulator on the side that's contributing to, you know, cybernetically managing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.463,
    "end": 783.446,
    "text": "That's what like full fledged consciousness would be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.347,
    "end": 785.047,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 785.068,
    "end": 790.995,
    "text": "This now is running up against something that I'm constantly struggling with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 791.015,
    "end": 797.142,
    "text": "Uh, this, um, free energy principle is a natural, uh, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 797.628,
    "end": 800.712,
    "text": " feature of existence, I feel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.752,
    "end": 820.294,
    "text": "And this framework is being applied to our framework, our human conceptual framework, which is completely ruled by our conceptualizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 820.494,
    "end": 826.521,
    "text": "I mean, nothing we do lives outside of the constraint of how our minds work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.328,
    "end": 837.082,
    "text": " We think the world works the way it does because of the nature of our construction, our bodily ability to conceptualize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 837.322,
    "end": 840.927,
    "text": "And these concepts are constrained by the way we're constructed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.289,
    "end": 845.353,
    "text": "And I run up against...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 845.873,
    "end": 849.864,
    "text": " working back and forth between these two realities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.965,
    "end": 852.291,
    "text": "The world is the way it is and works the way it does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 852.351,
    "end": 857.807,
    "text": "And we interpret it the way we do to the best of our ability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 859.12,
    "end": 864.927,
    "text": " I posted a reference to Handbook of Abduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 864.947,
    "end": 868.17,
    "text": "Do you remember, Daniel, the $700 book?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.211,
    "end": 869.632,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 870.133,
    "end": 873.717,
    "text": "Worth every penny.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 873.777,
    "end": 880.885,
    "text": "Which kind of confronts this problem of, it's basically an epistemological problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.905,
    "end": 881.806,
    "text": "How do we know what we know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.866,
    "end": 884.85,
    "text": "And what constrains what we can possibly know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 885.791,
    "end": 887.693,
    "text": "But again, everything I'm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.078,
    "end": 916.262,
    "text": " interested in with active inference is through the filter of how the brain works how the mind works and the i was just at a seminar yesterday on is it possible for machine intelligence to have meta awareness and that's something that that this lab is working on right now the pi is going to a conference in san diego of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.862,
    "end": 920.345,
    "text": " I don't know what it's called, but it's machine learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.586,
    "end": 946.502,
    "text": "It's some big league trying to address this problem of how can these deep learning models be aware of themselves to the point where they can filter out hallucinations themselves, where they can know or assess how good their reasoning is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 947.545,
    "end": 975.46,
    "text": " So again, in that vein, and Andreas, I thought of you when I read this paper that I posted in the chat, modeling meta-awareness, because I know you were working on this three minds, three brains issue, and it explicitly addresses that in a way, talking about hierarchical model of meta-awareness and attentional control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 976.823,
    "end": 983.654,
    "text": " perception, attentional states, and then meta awareness states, which I think is kind of like what you were describing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.079,
    "end": 987.5,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.341,
    "end": 990.685,
    "text": "Okay, that's how I'm glad I copied the link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.825,
    "end": 991.947,
    "text": "And I'm glad that you're here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.207,
    "end": 998.477,
    "text": "Yeah, it's funny that that had come up in some other who knows when chapter 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.643,
    "end": 1000.466,
    "text": " but I added it in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.367,
    "end": 1008.178,
    "text": "It was kind of a hallmark paper, certainly in terms of connecting multi-scale modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.799,
    "end": 1020.016,
    "text": "And then here's one that I put in the notes, too, from a few years ago with Lars Sandvitz-Smith, first author of that 2021 paper and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.837,
    "end": 1027.688,
    "text": "I mean, this gives some very interesting angles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.14,
    "end": 1031.436,
    "text": " And they do test out some things with LLMs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.702,
    "end": 1037.003,
    "text": "But when we kind of get against that doors of perception,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.152,
    "end": 1042.938,
    "text": " like beyond that classic Blake quote, I think of this letter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.958,
    "end": 1044.64,
    "text": "As a man is, so he sees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.38,
    "end": 1048.103,
    "text": "And it's like, okay, well then, you know, pack it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.824,
    "end": 1049.465,
    "text": "Nothing to see here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.905,
    "end": 1066.382,
    "text": "It's like, you know, everything to see here, but then how to balance like the world as it is, doors of perception being cleansed, seeing the world, you know, infinity and the flower and all of that with the solipsism of anthropocentrism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.362,
    "end": 1079.301,
    "text": " It's like, well, how could we escape anthropocentrism when we're our own egocentric navigational unit and we're seeing things through our own perception and cognition apparatus?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1080.222,
    "end": 1083.547,
    "text": "So it's like, what could be the escape from anthropocentrism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.029,
    "end": 1086.531,
    "text": "And then this part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.118,
    "end": 1110.021,
    "text": " um you certainly mistake when you say that the visions of fancy are not to be found in this world like i see that as the reality of cognitive science speculation counterfactuals like expected free energy rollouts those are in the world that doesn't mean that they're justified true belief doesn't mean that that the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.739,
    "end": 1140.379,
    "text": " parameters as they're estimated to be would be any level of accuracy but visions of fancy are found in the world and and that goes in so many different ways I mean taking us all the way up into sort of matter first ontologies which lead us to the hard question of consciousness or mind first ontologies that that have a uh countervailing narrative on the emergence of stability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1142.114,
    "end": 1151.845,
    "text": " So I have a question of something, whether it could be modeled naturally with active inference or if it's something different, you know, which relates to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.646,
    "end": 1157.111,
    "text": "And so, because I think of active inference as kind of like the second mind type of issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.951,
    "end": 1165.66,
    "text": "But the first mind would be just direct experience, whatever that means, like the answers that are coming out unconsciously, popping into my brain, let's say, whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.541,
    "end": 1171.627,
    "text": "And so there's these things I talk about as doubts and counter questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.047,
    "end": 1172.087,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.067,
    "end": 1176.594,
    "text": " Um, once I was given this question, well, how do you know you're not a robot?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.614,
    "end": 1176.834,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.555,
    "end": 1181.381,
    "text": "And so it's a difficult question because it puts everything in doubt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.401,
    "end": 1183.725,
    "text": "Like, you know, if I'm a robot, how can I trust anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.785,
    "end": 1184.005,
    "text": "I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.927,
    "end": 1189.013,
    "text": "And so I think that there's really only 1 way out of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.993,
    "end": 1191.296,
    "text": " Aside from just falling back to sleep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.437,
    "end": 1195.943,
    "text": "But if you really want to take that question seriously, you ask a counter question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.963,
    "end": 1198.587,
    "text": "You go, well, would it make any difference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.607,
    "end": 1198.847,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.047,
    "end": 1199.328,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.909,
    "end": 1204.836,
    "text": "And the way the counter question works, it says, look, I'm not going to rely on anything I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.617,
    "end": 1209.162,
    "text": "So the ability just kind of like clean the slate to say, look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.142,
    "end": 1212.868,
    "text": " And then it's kind of like, you tell me what a robot is, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.888,
    "end": 1219.659,
    "text": "Like, maybe I am a robot, you know, or maybe I'm not a robot, but you give me some criteria so that I could tell, like, you know, do robots bleed or do they not bleed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.699,
    "end": 1221.462,
    "text": "Or, you know, do robots have feelings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.542,
    "end": 1222.644,
    "text": "Can robots fall in love?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.664,
    "end": 1223.325,
    "text": "You know, what is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1223.405,
    "end": 1225.969,
    "text": "And then maybe I'm a robot, but maybe I'm not, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.949,
    "end": 1230.955,
    "text": " But I'm not going to rely on my I mean, I'm not going to I'm going to let go of my experience and build it back up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.635,
    "end": 1242.307,
    "text": "So what that does from the first mind's point of view, it's a way of letting go of itself and saying there's something maybe more out there like to get out of your context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.387,
    "end": 1246.472,
    "text": "And so the things I was talking about, how do you go from context to context to context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.492,
    "end": 1253.239,
    "text": "This is the way of letting go of your current context and being able to get into, you know, without a context and into another context, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.219,
    "end": 1261.812,
    "text": " I did 30 examples and it ended up being seven patterns of counter questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.994,
    "end": 1263.895,
    "text": "Do I truly like this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.935,
    "end": 1265.217,
    "text": "Well, how does it seem to me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.418,
    "end": 1266.299,
    "text": "Do I truly need this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.359,
    "end": 1267.341,
    "text": "What else should I be doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.641,
    "end": 1268.482,
    "text": "Is this truly real?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.522,
    "end": 1269.784,
    "text": "Would it make any difference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.804,
    "end": 1271.066,
    "text": "Is this truly problematic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.126,
    "end": 1272.128,
    "text": "What do I have control over?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.63,
    "end": 1274.852,
    "text": "Is this truly reasonable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.233,
    "end": 1276.635,
    "text": "Am I able to consider the question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.156,
    "end": 1278.798,
    "text": "Is this truly wrong?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.239,
    "end": 1281.302,
    "text": "Is this the way things should be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.282,
    "end": 1282.684,
    "text": " Am I truly anxious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.884,
    "end": 1284.085,
    "text": "Well, what am I doing about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.225,
    "end": 1287.449,
    "text": "Then there's an eighth one that just whenever you want, you say, well, what do I truly want?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.749,
    "end": 1290.432,
    "text": "There's this whole apparatus of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.113,
    "end": 1296.899,
    "text": "I'm just wondering, I think this is before you even get to having a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.34,
    "end": 1307.691,
    "text": "This is how you start to become letting go of yourself and starting to operate with a generative model that's abstract, that doesn't know anything, saying, I don't know anything, but what could I do with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.412,
    "end": 1310.935,
    "text": "This is the preliminary in order to build up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.096,
    "end": 1316.602,
    "text": " or to get back to thinking in terms of a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.622,
    "end": 1319.546,
    "text": "But where would this type of thinking fit with active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.607,
    "end": 1320.007,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.409,
    "end": 1323.332,
    "text": "Oh, I think there's no goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1324.153,
    "end": 1327.478,
    "text": "I think that it's... Yeah, it doesn't have a goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.778,
    "end": 1329.941,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.961,
    "end": 1337.932,
    "text": "That's completely compatible with the kind of model that uses active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1338.834,
    "end": 1339.875,
    "text": "There are no priors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1341.863,
    "end": 1346.085,
    "text": " And then all your clients with experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1346.105,
    "end": 1349.663,
    "text": "Well, so what if you don't have priors, then what happens with active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.145,
    "end": 1355.549,
    "text": " Daniel, you can answer that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.589,
    "end": 1365.377,
    "text": "There's the sort of substrate fabric of reality question, like what is the sound of the silent bell, like a koan?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.437,
    "end": 1369.1,
    "text": "Like if there really were no prior, what would there be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.061,
    "end": 1376.066,
    "text": "So that sort of fades into more axiomatical metaphysics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.727,
    "end": 1380.51,
    "text": "But let's just start with a case where there's a given prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.283,
    "end": 1385.895,
    "text": " but of a certain kinds, but it's a uniform within whatever kind it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.8,
    "end": 1392.131,
    "text": "And then popping up a level of context is like kind of structured learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.592,
    "end": 1396.542,
    "text": "Like is that prior modifiable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.677,
    "end": 1407.228,
    "text": " Well, I think what this is, maybe I didn't quite absorb what you're saying, but I think like what this is saying is like, I'm going to let go of all my priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.549,
    "end": 1409.252,
    "text": "Why don't you give me some priors, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.292,
    "end": 1418.766,
    "text": "Like, you know, but see, what happens there is that instead of saying I have natural priors, you know, I'm wired in with certain priors, like I'm saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.746,
    "end": 1420.047,
    "text": " my priors could be variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.087,
    "end": 1422.109,
    "text": "Let's go with any priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.25,
    "end": 1425.493,
    "text": "You see, and that's a huge shift all of a sudden because you're in a different realm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.533,
    "end": 1434.502,
    "text": "You're moving from the first mind where there's these things that are hardwired or like priors that are hardwired to saying, oh no, priors could be variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.263,
    "end": 1435.583,
    "text": "You see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.404,
    "end": 1444.332,
    "text": "Yeah, this is kind of addressed in the whole Buddhist tradition of developing a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.936,
    "end": 1465.945,
    "text": " along the spectrum of directed attention awareness to open attention, open awareness to non-duality where there are no subject-object differences, which is kind of like no priors in a way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.226,
    "end": 1474.217,
    "text": "It's like either there is only either one awareness or no",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1474.771,
    "end": 1504.778,
    "text": " separation between awarenesses this is sort of where this paper takes it with translating yes source of meditational prompts into um natural language and using that um in terms making parametric modifications like modifying the temperature value um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.095,
    "end": 1512.485,
    "text": " like in a sort of infinite temperature scenario, like just, you know, the ball is vibrating on the landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.026,
    "end": 1518.874,
    "text": "In the absolute zero context, it's gonna find a local minima or maybe even the global minima.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.396,
    "end": 1524.0,
    "text": "In the infinite temperature setting, the landscape is functionally flattened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.661,
    "end": 1530.73,
    "text": "So whatever structure the landscape had, as the temperature goes to infinity, it doesn't really matter what the temperature was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.29,
    "end": 1534.815,
    "text": "So there's those kinds of parametric manipulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.795,
    "end": 1551.7,
    "text": " And then there's this, like, uses of natural language as, I mean, delivering the payload itself within a given parametric configuration of the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.523,
    "end": 1556.748,
    "text": "But I mean, like, this is... What paper is this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.168,
    "end": 1558.39,
    "text": "This is the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.892,
    "end": 1566.558,
    "text": " I'll put it in the in the okay, zoom chat as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.578,
    "end": 1567.62,
    "text": "Like this is just from a few days ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.64,
    "end": 1572.027,
    "text": "I mean, I'm obviously with Lars with with chandaria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.548,
    "end": 1573.209,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.389,
    "end": 1575.953,
    "text": "Yeah, they're, they're, they're kind of going there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1577.055,
    "end": 1578.878,
    "text": "And I think it's inevitable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1578.898,
    "end": 1580.901,
    "text": "I think that all roads lead there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1581.742,
    "end": 1602.623,
    "text": " You look at the development of, for example, learning algorithms, machine learning algorithms, or there are machine learning architectures, cognitive architectures, different ways of approaching how to model cognition, lots of different models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1602.863,
    "end": 1608.829,
    "text": "And over the years, they basically all have been converging into the same general",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1609.72,
    "end": 1635.677,
    "text": " architecture as they modify themselves and as i say that there's probably an inevitable convergence of all these different approaches because it's all trying to approach the same thing the same truth i guess is what i would say yeah i mean there's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1635.758,
    "end": 1637.5,
    "text": " There's so many aspects on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.78,
    "end": 1649.131,
    "text": "And like, I think of mind and super minds, or bindo, and many different wisdom, cognitive methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.152,
    "end": 1665.748,
    "text": "And then it's like, and, and also, there's another, you know, from another vision or another perspective, it's purely quantitative, structured, formal accounting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.04,
    "end": 1669.322,
    "text": " for cognitive things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.163,
    "end": 1677.493,
    "text": "Yeah, it's like, it's that's the deflationary view is sort of it's just statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.513,
    "end": 1684.282,
    "text": "Now, Blake might call that Newton single vision, with like, the sort of sleep of technical expertise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.623,
    "end": 1691.331,
    "text": "And, and I mean, it's, it's embodied within our own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.8,
    "end": 1720.592,
    "text": " ability to to see it those multiple ways or oscillate or or hold both open certainly it's reflected in our communities where some people at the syntactic or the semantic level are going to have allergies to to these kinds of prompts as well as allergies to mathematical symbols so that's like so then that and then that goes to kind of like krishnamurti like truth is a pathless land",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.673,
    "end": 1725.992,
    "text": " But how could there be a place with no paths within or out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.495,
    "end": 1736.943,
    "text": " I put in a link in the chat to a presentation I gave about how we use variables in the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.243,
    "end": 1749.238,
    "text": "And so, like, yeah, if you look there like that, any any of those like they get the kind of idea that when we look at a variable, there's so much hidden there because it's subject to interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.258,
    "end": 1750.359,
    "text": "Like, is it constant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.46,
    "end": 1751.241,
    "text": "Is it variable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.401,
    "end": 1752.762,
    "text": "What does it mean for it to be fixed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.003,
    "end": 1753.243,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.263,
    "end": 1754.865,
    "text": "Like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.845,
    "end": 1755.929,
    "text": " Is it just a label?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.732,
    "end": 1762.493,
    "text": "There's so much loaded in there that if you try to tease it out, you get all these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.608,
    "end": 1783.517,
    "text": " you know, like 24 different possibilities or something like that, you know, there's this huge richness that's being hidden, let's say, so this idea, like, with the priors, are those priors, something that are fixed and constant, and just given, you know, personal, or are they become, all of a sudden, they become variables that you can play with, you know, that someone else could be filling in for you, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.537,
    "end": 1789.305,
    "text": "Like, and how do you what does it mean to switch back and forth between those types of ways of thinking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.407,
    "end": 1791.248,
    "text": "That's, I think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.548,
    "end": 1818.687,
    "text": " it's kind of there's this chasm that's kind of being glossed over um well we really come down to the topic of communication the how can the conceptualization yes but then communication of those concepts and this is why we always turn to rigorous mathematical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1820.27,
    "end": 1829.059,
    "text": " symbology because it's the least vague, the least imprecise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1834.425,
    "end": 1842.353,
    "text": "And yet we still have to know what are the appropriate symbols to use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1843.815,
    "end": 1847.138,
    "text": "We can inappropriately apply statistical methods",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1849.278,
    "end": 1857.611,
    "text": " and obscure the communication, even still.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1857.972,
    "end": 1859.574,
    "text": "And yet it's, I think, the best we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1862.238,
    "end": 1874.678,
    "text": "Or there is the extended mind idea that I can have my conceptualization communicated and because you're so similar to me in construction,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1875.248,
    "end": 1886.761,
    "text": " you can create your own conceptualization that is more or less similar to what mine is based on the means of communication we're employing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1887.482,
    "end": 1898.995,
    "text": "And because we live in a structured environment that's the same, it constrains our conceptualizations in a way that are most likely going to be most similar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1904.155,
    "end": 1906.358,
    "text": " Yeah, so many ways to take this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.4,
    "end": 1915.231,
    "text": "Just trying to triangulate it with the abductive work that you've shared and what they're discussing in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.553,
    "end": 1919.918,
    "text": "We're not imposing any single metaphysical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1920.919,
    "end": 1925.185,
    "text": "However, what if there's a single meta-metaphysical system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.734,
    "end": 1954.682,
    "text": " And it's like another, like the sort of show not tell realization of metacognitive science is like narrative and perspectival plurality as popping up a layer in the consideration of all of what had been considered at a cognitive layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1954.882,
    "end": 1982.172,
    "text": " yes i think this is approaching the best we can do so in trying to speak that language but um and i have i think you're all a little familiar with this what i call these three minds like uh so i would think like as a generative model as a type of metaphysics let's say or conceptual system and then the point being for for a conceptual system to really function well and do its job",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.35,
    "end": 1998.388,
    "text": " there needs to be a tiny and very clear, well, there just seem to be certain things that explain that it's, or that maybe amount to the fact that it's functioning, it's able to function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.888,
    "end": 2003.434,
    "text": "And those are the things that's able to be able to swap back and forth with the things it's trying to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.514,
    "end": 2007.298,
    "text": "Like, you know, if it's a good model, you can invert it and you can,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.7,
    "end": 2014.274,
    "text": " The context can be understood as the reality and the reality of the context and flip back and forth and all these symmetries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.314,
    "end": 2016.439,
    "text": "And there's very few symmetries you have to worry about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.98,
    "end": 2018.383,
    "text": "But there's so many, there's like eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.443,
    "end": 2022.492,
    "text": "And if you can do that, you have a metaphysics of the metaphysics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.512,
    "end": 2024.617,
    "text": "And if you can't do that, you simply don't have a function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.637,
    "end": 2026.08,
    "text": "You know, you have a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.06,
    "end": 2030.965,
    "text": " You have a generative model that's just not going to function very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.985,
    "end": 2032.066,
    "text": "It's just going to fall apart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.166,
    "end": 2046.781,
    "text": "So the fact that the generative model fits up with the things it's modeling is what the third mind is all about and the symmetries that need to be satisfied for that to happen, which are like updating symmetries, like the way a database would function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.422,
    "end": 2048.943,
    "text": "How does it update itself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.186,
    "end": 2053.688,
    "text": "So interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2053.82,
    "end": 2055.703,
    "text": " I totally agree with what you're saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.445,
    "end": 2070.931,
    "text": "As a side tangent, I'm always amazed at why distillations of truths always come down to three parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2071.633,
    "end": 2073.396,
    "text": "And I think that's got to be a natural principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2073.817,
    "end": 2076.181,
    "text": "Well, sorry, it's not a natural principle of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.221,
    "end": 2078.325,
    "text": "It's a natural principle of our",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.795,
    "end": 2104.026,
    "text": " conceptualizing mind there's this there's that and then there's the thing that's neither this nor that you know that's three parts yeah you have you come up with the three minds that's the most efficient way to communicate what you're trying to communicate with three parts i i just find that so interesting it always it's it's just a recurring theme in communicating features of reality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2105.103,
    "end": 2109.75,
    "text": " where I see that in terms of the blanket is first there's agent environment and blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.19,
    "end": 2114.757,
    "text": "That's the threesome or the threefold partition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.057,
    "end": 2116.439,
    "text": "Well, first there's this and that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.779,
    "end": 2120.104,
    "text": "That's the twofold agent environment just with the arrows connecting them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2120.124,
    "end": 2127.034,
    "text": "Then a blanket is interpolated and then the blanket is nuanced into incoming and outgoing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.215,
    "end": 2135.025,
    "text": "And so the two, the three and the four all represent this sort of canonical,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.777,
    "end": 2143.505,
    "text": " And also those two, three and four are part of the conceptual unity, which is the unity of that scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.266,
    "end": 2149.232,
    "text": "So it's like one, two, three, four as one, two, three and four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.214,
    "end": 2156.76,
    "text": "And I mean, it can go so many other ways with the with the numbers in the geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.221,
    "end": 2157.521,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.122,
    "end": 2161.726,
    "text": "But the low integer numbers are awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.746,
    "end": 2165.991,
    "text": "Yeah, I I of course, I have my own",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2166.376,
    "end": 2192.333,
    "text": " crude epistemology used with this tripart distillation that taken as a whole makes a fourth which is echoed in what you just showed on the screen it's just but what we always have to remember is this isn't a natural law of the world of the universe all of these you know low order",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.292,
    "end": 2212.11,
    "text": " uh descriptions uh numerical descriptions it's not a natural law of the universe it's a natural law of the way our minds work well and possibly the way generative models work so exactly well our minds you know so we will know best about our own minds let's say but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2213.305,
    "end": 2217.793,
    "text": " But then we can maybe see it in other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.133,
    "end": 2223.542,
    "text": "Well, we're going to create these generative models according to our conceptualizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2224.083,
    "end": 2224.303,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2224.504,
    "end": 2225.926,
    "text": "They will work that way too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2226.908,
    "end": 2234.2,
    "text": "Yeah, and then if they're useful in modeling different things, as sometimes they do seem to be, then that kind of gives some...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.787,
    "end": 2259.63,
    "text": " extension to it you know but but i think maybe to go beyond what daniel was saying uh like with this three minds approach i think daniel i think you're you're explaining like how it looks for the second mind and so like that would be like uh like the zeroth mind would be in terms of needs and responding to needs and you can see things like maslow's hierarchy etc and then but then the first mind although it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.673,
    "end": 2286.293,
    "text": " well it looks at things intellectually surprisingly because that's what it takes to get out of itself like it kind of to let go of itself it becomes intellectual so to speak but then when you have the generative model you have these two minds in ting like with action perception then it seems very emotional because that's what that's what the cognition that's what the organism reads uh from the first mind the first mind communicates in terms of emotion and the second mind",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.273,
    "end": 2289.458,
    "text": " responds with cognition that it imposes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.259,
    "end": 2298.812,
    "text": "But I think in terms of the third mind, see that the first mind doesn't see the second mind, the second mind doesn't see the third mind, but the third mind sees them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.972,
    "end": 2305.802,
    "text": "And the third mind is this willfulness, this cognizance to say, Hey, I have to actively relate to these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.744,
    "end": 2308.146,
    "text": "And then there may be like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.615,
    "end": 2315.341,
    "text": " a God or a default that is also actively somehow relating that I might just be an instrument of, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.322,
    "end": 2324.73,
    "text": "And then how do I fit with regards to, let's say, the default or the God or whatever, like, you know, so that I'm in sync or am I separate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.75,
    "end": 2325.971,
    "text": "You know, that type of question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.111,
    "end": 2328.753,
    "text": "That's not maybe coming up in these areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.833,
    "end": 2336.04,
    "text": "But, you know, so what's maybe that's to say, like, what's the role of a will related with God, you know, in terms of trying to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.02,
    "end": 2338.248,
    "text": " actively manage this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.336,
    "end": 2342.765,
    "text": "I don't think that that's maybe coming up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.106,
    "end": 2345.676,
    "text": "It's not mentioned in the textbook, I don't think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.208,
    "end": 2350.632,
    "text": " Well, you can map what you're saying onto what's said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2350.852,
    "end": 2351.072,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.073,
    "end": 2364.426,
    "text": "But it'd be an extension, I think it says that there's and so these symmetries, and those like, maybe just to add, like, I talked to my friend Thomas, he's a theoretical physicist I talked with, but it becomes about the conjugate transpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.446,
    "end": 2370.753,
    "text": "So like the Hamiltonian in these, and these are like, what they call a free fermionic non interacting system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.793,
    "end": 2375.798,
    "text": "So it's like a particle all by itself, like what are the pipe relationships it could have, like with its context,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.571,
    "end": 2384.981,
    "text": " But what's curious is that it has a Hamiltonian, which is what you need in order to have a notion of a coherent self that could evolve through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.061,
    "end": 2388.986,
    "text": "Because if you're going to evolve through time, you've got to be able to maintain what you are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.066,
    "end": 2393.851,
    "text": "If you're going to go through different dynamical modes, you have to be able to summarize that, which is what the Hamiltonian does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2394.612,
    "end": 2399.017,
    "text": "But the Hamiltonian has this thing where the self conjugate, it's equal to its own self conjugate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.077,
    "end": 2400.539,
    "text": "And so the question is, well, what is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.32,
    "end": 2403.102,
    "text": "And the idea is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.082,
    "end": 2427.57,
    "text": " it's the difference between a self as a being and a self as its context like your personality or everything that you've invested yourself in you know you can identify with either with the spirit you you are that you inhabit something or the context you've created for yourself to inhabit and then you can flip back and forth which is what these quantum symmetries do and if you as i'm studying it what happens and i'll conclude but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.55,
    "end": 2434.377,
    "text": " is that those two things which you're equating, you can strip them apart and say, oh, no, let's think of them separately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.517,
    "end": 2437.36,
    "text": "Me as a being and me as my context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.981,
    "end": 2440.103,
    "text": "And then let me fit them back together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.203,
    "end": 2443.446,
    "text": "But let's say swap them, kind of swap them around or make one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.247,
    "end": 2446.529,
    "text": "There's different ways you can try to put them together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.85,
    "end": 2448.631,
    "text": "But it's about how those two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.651,
    "end": 2457.22,
    "text": "So the generative model and the thing it's modeling, can they be inverted to say, oh, no, I'm a fact in the generative model of my environment, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.832,
    "end": 2487.662,
    "text": " You know, as you're speaking, and Daniel, as you're pointing out things in the textbook, and I've seen these things and had thoughts about them, but I'm seeing new things and having new thoughts about them, listening to this discussion and watching Daniel's mind at work pointing out different things in the textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.115,
    "end": 2504.554,
    "text": " And I'm struck by the reality of the mind being an interaction with other minds, just as much as self internally generated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.829,
    "end": 2522.347,
    "text": " And I think with that interaction, because I've never really thought much about that, but I think these games with other people that we play, we're like, you know, we switch from I to you and other and all, and it's such, like, who is the being and who's the context, let's say, or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.687,
    "end": 2522.967,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.328,
    "end": 2528.073,
    "text": "Like communicating, it kind of forces us to play all these games much more actively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.515,
    "end": 2536.583,
    "text": "But in reality, we can't play those games unless we're actually in the presence of other I's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2536.563,
    "end": 2538.787,
    "text": " Yeah, it may be very hard to play that right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.508,
    "end": 2540.429,
    "text": "Otherwise, it's internal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2547.421,
    "end": 2548.483,
    "text": "I think it certainly helps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.085,
    "end": 2555.534,
    "text": "There's compositionality internally, and there's compositionality externally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.496,
    "end": 2560.883,
    "text": "Like when they talk about these kind of rites of practice and passage,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.998,
    "end": 2566.767,
    "text": " it's like you write down the model, make a simulation and, and learn from, from what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.287,
    "end": 2567.888,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.908,
    "end": 2575.82,
    "text": "And that's similar to like, you, you expect that the restaurant's going to be tasty and maybe, maybe it's, it is exactly on point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.86,
    "end": 2576.861,
    "text": "Maybe it surprises you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.902,
    "end": 2578.764,
    "text": "It's like, you, you want a hot shower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.904,
    "end": 2582.55,
    "text": "It could be the perfect temp or you could update.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2582.57,
    "end": 2587.377,
    "text": "It's like, so, and then, um, you,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.846,
    "end": 2596.981,
    "text": " So there and then I but then the quote at the very beginning of 10 which is that we're least aware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.021,
    "end": 2600.968,
    "text": "In general, we are least aware of what our minds do best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.794,
    "end": 2608.961,
    "text": "And it's like, it is that or how is that true?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.081,
    "end": 2610.443,
    "text": "Why would that be true?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2610.463,
    "end": 2614.63,
    "text": "Why would awareness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.04,
    "end": 2623.768,
    "text": " You know, what is awareness and self-awareness such that it is like, it's like the joke of the party.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.41,
    "end": 2634.181,
    "text": "It's the least capable, but it's the aware one within an internal compositionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.221,
    "end": 2646.996,
    "text": "And then transposing that into the extended cognitive setting that you mentioned, Steven, it's like, we're least aware of what others are doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.347,
    "end": 2650.751,
    "text": " We don't know what others are thinking, maybe for the best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.816,
    "end": 2672.578,
    "text": "And certainly just looking at a tissue or looking at an ant colony, it's not that each cell or nestmate is solving the problem that the tissue is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2677.705,
    "end": 2685.473,
    "text": " You're putting this into that context of situational awareness or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.035,
    "end": 2689.378,
    "text": "It's situated awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2689.738,
    "end": 2696.265,
    "text": "The meta awareness is the awareness, but it can't be a thing itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2700.229,
    "end": 2705.535,
    "text": "Yeah, like, what is metacognition, but metacognition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.798,
    "end": 2717.334,
    "text": " It's like if you developed a software package with all these like runners, handlers, dispatchers, operators, all these kinds of apparatus, but then it's like, and then what is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2720.859,
    "end": 2725.426,
    "text": "Like what's the terminal rubber hits the road inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.629,
    "end": 2734.78,
    "text": "And it's like the whole metacognitive apparatus is just sort of waiting for the key in the ignition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.295,
    "end": 2764.21,
    "text": " for something even if it's just a binary signal coming in or even like a static signal coming in but but the whole but it's not but the gears don't turn unless something is is there and then it's like how slash can we introduce novelty within ourself because obviously in the social setting amongst",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.371,
    "end": 2791.75,
    "text": " bodied minds we can see how novelty could be introduced like you could tell me about a place that you went today that that I would have otherwise not have known of okay but then there's also the compositionality revealed through the novelty of just like I don't know what word I would think of if I were to think what word should I randomly think of it's like coffee cup or something you know again oh that's cliche or whatever it was like but I didn't I didn't know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2792.86,
    "end": 2794.421,
    "text": " And there's some latent distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.522,
    "end": 2797.404,
    "text": "It's not that I'm going to come up with a word from a language that I've never known.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.424,
    "end": 2804.451,
    "text": "So it's not a good random number generator for your cryptography per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.672,
    "end": 2808.315,
    "text": "But there is some distribution that's sampled from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.355,
    "end": 2812.399,
    "text": "But what's the status of that fancy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.939,
    "end": 2813.76,
    "text": "Okay, real quick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2813.86,
    "end": 2821.247,
    "text": "This is a... I want to ascribe a term to what you just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.56,
    "end": 2826.064,
    "text": " portrayed, trying to think of something that you don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.104,
    "end": 2829.487,
    "text": "That's a principle of something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2830.388,
    "end": 2831.85,
    "text": "I don't know the term to describe that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2839.197,
    "end": 2851.69,
    "text": "Somehow it's related to the end goal of awareness, non-awareness, non-duality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.94,
    "end": 2878.639,
    "text": " the goal, the process of meditation and escaping self is to get to this point of not trying, but being, of knowing what you don't know, just being awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.88,
    "end": 2887.25,
    "text": " which is the state one would have to be in to be able to think of something one doesn't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.27,
    "end": 2902.635,
    "text": "I mean, that does seem to describe what I've been trying to talk about with the third mind, to say like, if you let go of all the answers, you know, like everything you know, which would be all your prejudices,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.97,
    "end": 2909.898,
    "text": " And if I let go, let's say of all of my questions, everything I don't know, all these preconceptions, this whole generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.739,
    "end": 2912.181,
    "text": "And then I just what am I left with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.201,
    "end": 2917.267,
    "text": "Well, I'm left in this void, this abstract void of how things like that get connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.548,
    "end": 2923.294,
    "text": "You know, like what are the possible empty chambers and the doors and those chambers and things like that, like where.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.955,
    "end": 2927.88,
    "text": "So I'm in this kind of very abstract void that I can get to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.265,
    "end": 2936.738,
    "text": " and just, just be disconnected, I guess, from everything and just be but be in full cognizance, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.521,
    "end": 2943.168,
    "text": "But maybe so that's, that's the state I'm encouraging with an investigatory community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.248,
    "end": 2944.911,
    "text": "But, but maybe that's the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.171,
    "end": 2947.054,
    "text": "That's the state that Buddhism encourages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.134,
    "end": 2948.056,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.7,
    "end": 2951.421,
    "text": "It must be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.342,
    "end": 2966.882,
    "text": " If there's a long generational millennial tradition of keeping what's true and letting everything else go, it must be the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2968.424,
    "end": 2974.894,
    "text": "And the advantage of that state is that then you can rebuild everything, you know, like just kind of like with a new...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.971,
    "end": 2978.155,
    "text": " with a new sense of where is this coming from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.195,
    "end": 2981.38,
    "text": "Like either you accept it, or you or you've kind of reworked it or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.44,
    "end": 2989.713,
    "text": "And then you can have this harmony between the generative model, like second mind and the first mind reality, so to speak, or unconscious or, or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.66,
    "end": 2998.688,
    "text": "Well, all of all my takeaway from all of my interaction with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3000.187,
    "end": 3012.105,
    "text": " you know, variational free energy and active inference, the principle of active inference, my takeaway is this is a general framework that's universally applicable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3013.186,
    "end": 3023.762,
    "text": "And it can be applied appropriately or inappropriately depending on how it's put together, how the model is constructed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3025.024,
    "end": 3029.13,
    "text": "Its power is in its generality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3029.313,
    "end": 3033.554,
    "text": " and its disadvantage is its generality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3037.071,
    "end": 3038.277,
    "text": "It has to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3041.767,
    "end": 3045.775,
    "text": " I think it's begging the idea that it so beautifully gives us freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.795,
    "end": 3046.797,
    "text": "It models the freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.837,
    "end": 3048.039,
    "text": "Like, do you want to perceive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.059,
    "end": 3050.284,
    "text": "Do you want to act?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.384,
    "end": 3053.189,
    "text": "Well, we'll maximize, you know, I guess we'll minimize the free energy, whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.29,
    "end": 3062.728,
    "text": "And then but the idea is that, yeah, but there could be different solutions that are equally basically, you know, equal or equal within a very small, you know, error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.708,
    "end": 3070.337,
    "text": " And so it begs the opinion that there's somebody who gets to choose, or somebody who gets to say, hey, I'm going to make this ambiguous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.697,
    "end": 3075.322,
    "text": "And then given the ambiguity, then I'll choose which way I'm going to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3076.604,
    "end": 3083.532,
    "text": "But it's a very nice and rare model of freedom or the preconditions for freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.394,
    "end": 3091.821,
    "text": "Well, again, my conceptualization here is that it depends on the application.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3092.324,
    "end": 3093.425,
    "text": " the appropriateness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3093.605,
    "end": 3106.136,
    "text": "So if it's being applied to a natural system, that's pretty straightforward in terms of physics and physical constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3106.857,
    "end": 3108.878,
    "text": "Yeah, it doesn't require freedom, but yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.639,
    "end": 3122.23,
    "text": "But if it's being applied to a mind state, then it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3123.02,
    "end": 3128.327,
    "text": " then it's maybe harder to model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3128.447,
    "end": 3131.431,
    "text": "Always there has to be a behavior component.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3131.451,
    "end": 3136.078,
    "text": "I mean, that's inherent in this free energy principle, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3136.178,
    "end": 3137.56,
    "text": "There has to be an action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3139.362,
    "end": 3152.52,
    "text": "If the action is just a concept, then it's more difficult to construct the model properly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3153.496,
    "end": 3164.282,
    "text": " But if the action is interaction with the world, then it's a little bit easier, because we're talking about a physical system which is, we're going to say, a bounded system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3167.435,
    "end": 3178.068,
    "text": " Maybe I'll give my just concluding thought that for many systems, it does a wonderful job of uniting action and perception and basically saying things are going to be a certain way because of how they evolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.749,
    "end": 3182.093,
    "text": "And so that's very physical and maybe even deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.113,
    "end": 3195.028,
    "text": "But it opens up the idea that you can game this whole relationship where you can balance things out between, let's say, action or perception or different opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.008,
    "end": 3208.023,
    "text": " And then there could be something that just if it's able to alter the context, you know, to say, OK, I'm going to reinterpret the context and that'll force things to go one way as opposed another way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.123,
    "end": 3208.844,
    "text": "Like it does not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.964,
    "end": 3214.67,
    "text": "It sets things up at a tipping point where it's easy to tip, you know, so it's easy to model freedom in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.97,
    "end": 3216.212,
    "text": "It can't you can do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3216.312,
    "end": 3216.993,
    "text": "You can do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3217.273,
    "end": 3218.374,
    "text": "Make that application.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.735,
    "end": 3219.015,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3220.997,
    "end": 3223.48,
    "text": "And that's why they could be it can be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3223.831,
    "end": 3226.465,
    "text": " misleading if it's not constructed properly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3229.461,
    "end": 3230.325,
    "text": "So something to code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3231.21,
    "end": 3231.411,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.23,
    "end": 3260.976,
    "text": " so many great pieces so many more pieces in linear time that that i know we could add and discuss how can something mislead which does not claim to lead but i mean every single little reconfiguration is there when when we go to that sort of trilemma tetralemma",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.445,
    "end": 3267.992,
    "text": " unity, duality, one, two, three, four, one, two, three, four mode on viewing active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.373,
    "end": 3279.022,
    "text": "And I gather there's more pieces, but a good closure for the cohort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.663,
    "end": 3286.049,
    "text": "So thanks fellows for sticking out to the epistemically delightful culmination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.53,
    "end": 3289.613,
    "text": "And we'll discuss more in the coming weeks where we go from here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.964,
    "end": 3293.784,
    "text": " Thank you, Dave, for leading us on this journey in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.674,
    "end": 3295.996,
    "text": "Indeed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.117,
    "end": 3296.519,
    "text": "Peace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.539,
    "end": 3297.122,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]