[
  {
    "start": 0.489,
    "end": 17.479,
    "text": " hello this is a new year's eve 2023 video that's giving a bit of a look towards how we'll be doing projects and participation at the active inference institute in 2024. so i'm on the home page of the onboarding document and i'm going to head over to projects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.706,
    "end": 27.513,
    "text": " As Figure 1 from our recent 2023 paper shows, projects are at the heart of participating in the Institute and in the Act-Inf ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.293,
    "end": 39.002,
    "text": "Projects include the core Institute projects that are Commons-like or infrastructural, such as the Active Inference ontology, journal, productions and livestreams, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.702,
    "end": 50.189,
    "text": " And also, there are so many projects, learning, and application that people are working on in the Active Inference ecosystem and some that engage with or are hosted at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.829,
    "end": 66.92,
    "text": "So drawing on work in Quantum Active Inference, which the second half of this video is going to explore a little bit of, we're planning to structure project proposal and reporting at the Institute in 2024 according to these two stages and each stage with a form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.24,
    "end": 69.262,
    "text": "And the two stages are preparation and measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.202,
    "end": 91.554,
    "text": " For preparing a project, it's like proposing a project that could be informing the Institute about a project that is already going to be happening and doesn't require support, all the way up through requested support in the form of calendar events, Discord channels, funding, different kinds of support, and hosting at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.314,
    "end": 94.496,
    "text": "And then active projects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.296,
    "end": 114.399,
    "text": " will be found in the activities tab so that there can be this updated list of what is really living and ongoing at the institute how can one get involved what is that project looking to do and then what else has that project already done will be reflected by the always open measurement form",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.04,
    "end": 130.29,
    "text": " And this could be a project that was proposed initially to the Institute and carried out internally, or it could just be a research paper that somebody found or created and can be an opportunity for future preparation engagement or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.891,
    "end": 136.334,
    "text": "So here from this projects page, you can click into the project preparation form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.615,
    "end": 159.874,
    "text": " unfold and see the questions if you want to copy them out and then directly complete the form for project preparation here or click the form link and similarly for project measurement you can unfold what questions are on the form click the form link or you can fill it out directly on the CODA document",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.172,
    "end": 166.816,
    "text": " That's a little bit of the how, a little bit of the low road, and we hope to continue to fine tune and develop on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.496,
    "end": 173.16,
    "text": "In the second part of this video, I want to look a little bit to this part that was mentioned about the quantum active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.821,
    "end": 175.362,
    "text": "So clicking that link,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.394,
    "end": 186.537,
    "text": " We'll take you to the syllabus for the course Physics as Information Processing, which Chris Fields taught with the assistance of Andre Aguirre in 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.638,
    "end": 191.599,
    "text": "And we recently published just today the transcript from this course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.419,
    "end": 197.641,
    "text": "And so I'm gonna pull up in the transcript where preparation measurement was mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.441,
    "end": 205.524,
    "text": "So here's the quantum informatic Alice through time preparing and measuring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.284,
    "end": 229.573,
    "text": " a quantum reference frame everything not explicitly forbidden is mandatory all the paths and then what's really taken is measured so this is the proposal stage here's how it could go here's our situation in context and here's the kind of distributional or procedural approach that we're taking and then measurement empirically what happened and so here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.377,
    "end": 239.103,
    "text": " Basically, what Feynman realized was that in any physical process, the observer Alice prepares some state that she's interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.803,
    "end": 241.444,
    "text": "She prepares some input to an experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.145,
    "end": 245.107,
    "text": "Then she lets something happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.222,
    "end": 272.923,
    "text": " then she sees what the result of the experiment is and the canonical experiment in physics is scattering you know fire two protons at each other and they intersect someplace and stuff comes out and you measure the stuff that comes out so i'm sure there's many other areas where we can search for prepare and measure and find a lot of technical depth and a lot of discussion from this very interesting course but even from that short selection there's so many ways to think about preparation and measurement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.463,
    "end": 291.234,
    "text": " So it's really exciting that people on their own timelines, according to their own timescales and preferences, can propose things to the Institute, whether we could provide you the support that is going to make the project successful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.934,
    "end": 313.851,
    "text": " continue or not or whether we can help something get off the ground or just learn about what you're proposing we will try with this new system to stay on top of things stay responsive and we look forward to versioning all of this with everyone so email us at blanket active inference dot institute if you have any other thoughts or questions otherwise see you in 24 peace",
    "speaker": "SPEAKER_00"
  }
]