[
  {
    "start": 1.374,
    "end": 1.915,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2.517,
    "end": 3.218,
    "text": "It's October 14, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3.759,
    "end": 4.18,
    "text": "We're in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.993,
    "end": 40.633,
    "text": " meeting 20 we're in our second discussion of chapter 8 we have a few topics and points in chapter 8 and then maybe we can preview some chapter 9 and have a lot of space for any other thoughts or questions people are having so we can jump to the questions and look at the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.57,
    "end": 70.89,
    "text": " written chapter eight questions or does anyone want to suggest a point for us to go to last time we know that some of the areas we wanted to pick up on um involved learning and hierarchical modeling and hybrid modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.258,
    "end": 114.436,
    "text": " One question that came up, I think, here, but maybe we can revisit, is the birdsong model is widely pointed at as an example of how communication is modeled in active inference or for active inference entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.698,
    "end": 118.681,
    "text": "However, it's quite literally singing from the same hymn sheet,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.562,
    "end": 129.571,
    "text": " And the turn-taking is based upon a joint expectation of that song being sung that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.112,
    "end": 143.883,
    "text": "And then the actions that the birds can take, the kind of turn-taking that they enact is, again, it's related to whether it's like, well, somebody has to say it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.043,
    "end": 145.585,
    "text": "Is it going to be me or is it going to be them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.943,
    "end": 161.095,
    "text": " So how do you think we would broaden that scope of communication to account for situations where there isn't a pre-scripted song?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.779,
    "end": 172.925,
    "text": "How do other frameworks for communication, cybernetic-ish or otherwise,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.965,
    "end": 183.342,
    "text": " deal with the semantics of conversation, improvisation, open-endedness in conversation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.648,
    "end": 207.317,
    "text": " Actually, I had a somewhat more general question about the bird songs and its relation to these particular systems that they've developed in the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.838,
    "end": 209.118,
    "text": "You see,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.499,
    "end": 230.114,
    "text": " Some researchers believe that, I'm sure you're much qualified to talk about this than me, but there are lots of research going around about the territorialization function of birdsongs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.874,
    "end": 246.964,
    "text": " So if we take Birdsong as its territorializing mechanism, at least one of its territorializing mechanism, can we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.385,
    "end": 275.398,
    "text": " somehow put the dynamic I mean the dynamic boundary of the Markov blanket I think would be affected from this point of view and then I'm not sure how that would translate into this specific model if we take that dynamic nature of the Markov blanket boundary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 282.366,
    "end": 287.591,
    "text": " Yeah, I guess I would just build on that and say that communication serves a purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 287.991,
    "end": 297.019,
    "text": "And so I think a model should incorporate what that purpose is and how it's served by the communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 297.059,
    "end": 305.947,
    "text": "And then whether it happens to be, you know, syncing up with some predefined pattern or whatever is a follow-on consideration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 311.852,
    "end": 322.34,
    "text": " The generative model in the singing from the same hymn sheet is very much like the sheet music example provided in the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.121,
    "end": 336.25,
    "text": "There's a known sheet music script such that even when there's an error in the playing of the music, still the sheet music can be heard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.352,
    "end": 341.054,
    "text": "So just coarsely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.516,
    "end": 345.318,
    "text": " What generative models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.12,
    "end": 358.969,
    "text": "I think it's pretty straightforward to see how a generative model could have the notation or the sheet music and then use the sheet music as its prior to kind of converge reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.451,
    "end": 364.214,
    "text": "To what extent is communication that way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.273,
    "end": 371.235,
    "text": " Is it totally disparate and differently structured or is it a little bit like a hybrid?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.295,
    "end": 379.699,
    "text": "Like you're doing inference on the sheet music that they're about to say, and then you use your inference about what they're about to say to converge what they do say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.84,
    "end": 386.502,
    "text": "Well, you asked a good question, which is, well, what are some alternative frameworks?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 386.862,
    "end": 387.402,
    "text": "And, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 390.129,
    "end": 393.692,
    "text": " I know I know some or should know some, and they're not coming to mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 393.732,
    "end": 405.482,
    "text": "But what comes to mind most immediately in this example is a phase lock loop in electronics, which is simply a way of synchronizing one circuit's oscillation with another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 406.703,
    "end": 409.985,
    "text": "And this is like a phase lock loop with a bigger vocabulary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 410.886,
    "end": 417.992,
    "text": "So figure out where we are in the pattern and then synchronize with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 420.117,
    "end": 425.904,
    "text": " And but the question of what other frameworks?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.45,
    "end": 437.257,
    "text": "I mean, there's this whole field of conversation analysis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 439.764,
    "end": 462.061,
    "text": " which, well, the field's actually called CA, Conversation Analysis, and they have identified patterns of how people communicate through a certain structure of, I guess we call them rhetorical devices, for achieving the purpose of the conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.541,
    "end": 463.542,
    "text": "So the purpose is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 465.319,
    "end": 473.83,
    "text": " The communication is kind of bedrock, and there are multiple purposes, some of which are instrumental, some of which are social.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 477.675,
    "end": 486.067,
    "text": " And then they have identified patterns for the way human conversation tends to proceed, which are culturally influenced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.187,
    "end": 490.733,
    "text": "You know, there's some cross-cultural aspects, but then there's certain different cultures that have different takes on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 491.234,
    "end": 495.019,
    "text": "So they identify things like, okay, now we're in the conversation opening phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 495.788,
    "end": 500.889,
    "text": " Now we're in a phase where we're exchanging information and we have turn-taking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.369,
    "end": 508.371,
    "text": "Now we have notions of epistemic leadership or epistemic authority.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 509.531,
    "end": 511.332,
    "text": "Who's the person who's asking?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.372,
    "end": 516.153,
    "text": "Who's the person who's answering or taking those roles in the conversation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.173,
    "end": 519.554,
    "text": "And there's certain rhetorical stances that are taken.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 521.474,
    "end": 524.555,
    "text": "So that's a pretty well worked out",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.384,
    "end": 534.491,
    "text": " I guess even formalized system because there are well-identified patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 535.612,
    "end": 544.621,
    "text": "It's not strictly worked out because it seems like every domain a conversation analyst goes to and every group has their own kind of flavor of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.181,
    "end": 546.202,
    "text": "But it is kind of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 548.197,
    "end": 556.584,
    "text": " It does have this aspect of synchronizing with respect to the underlying known patterns of each of the parties in the conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 573.077,
    "end": 575.739,
    "text": "The third song is also... Ali, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.018,
    "end": 603.79,
    "text": " Sorry, adding to what Eric just mentioned, that reminded me of a mechanism on a much smaller scale, namely the scale of cells and so on, and particularly the model proposed by Stuart Kaufman, because he talks about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.79,
    "end": 614.704,
    "text": " the pluripotent nature of cells and how they communicate with each other in the context of phenomena of induction, biological induction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.504,
    "end": 632.429,
    "text": " I mean, in the embryological development stage of the cells, almost all cells are pluripotent and they're capable of becoming any of the different types of cells which characterize the adult individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.509,
    "end": 639.672,
    "text": "So that also, from Kaufman's model perspective,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 641.972,
    "end": 658.876,
    "text": " these kind of inductive signals or so to speak communicative signals between cells can act as a kind of non-specific stimulus which switch a cell among a variety of internally available stable states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.916,
    "end": 662.957,
    "text": "So I mean a cell",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.314,
    "end": 667.676,
    "text": " Or let's put it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 668.617,
    "end": 681.108,
    "text": "The basic idea in this model is that the regulatory genes within a cell form a complex network in which genes interacting by their products can turn one another on or off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.789,
    "end": 682.109,
    "text": " You see?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.65,
    "end": 694.16,
    "text": "So yeah, these patterns exhibit the kind of homeostatic stability associated with attractors of the systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.421,
    "end": 702.508,
    "text": "So I think that translates perfectly into this scale as well, this small scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.231,
    "end": 705.491,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.327,
    "end": 717.83,
    "text": " the mapping of communication as generalized synchrony may be compatible with a variety of communication mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 719.13,
    "end": 729.733,
    "text": "And so it abstracts us from the media of communication per se, because we can talk about the informational synchronizations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.731,
    "end": 741.101,
    "text": " between, for example, the two internal states of the two entities or multilateral synchronizations with environmental states or so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.087,
    "end": 755.215,
    "text": "Like thinking about the Bayesian mechanics, Bayesian physics, the synchronizing metronomes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.929,
    "end": 787.448,
    "text": " don't have a hymn sheet they don't have sheet music their embodiment and coupling um enables synchronization now one thing i might know you know you i i think you asked a good question here which is you know how would you transfer translate something like um um conversation analysis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.712,
    "end": 791.094,
    "text": " or human conversation into an active inference model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 791.754,
    "end": 809.865,
    "text": "So that kind of reminds me that the continuous valued models, because they're limited by what you can do in these differential equations, they seem to be fairly simple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.337,
    "end": 829.581,
    "text": " Whereas if I were to do something like thinking about human conversation in terms of active inference, I would want something more very highly high dimensional or multi-state type of system where I can have more complex patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.718,
    "end": 840.106,
    "text": " And they may not make these loops, these Volterra loops, or is that what they're called?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 840.166,
    "end": 841.027,
    "text": "Volterra, is that right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.127,
    "end": 844.511,
    "text": "Or is this Lawrence, something in the dynamics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 844.871,
    "end": 846.613,
    "text": "Yeah, Volterra and the Lawrence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.673,
    "end": 846.893,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.314,
    "end": 859.22,
    "text": " Yeah, so it may not make those continuous loops, but you'd still get good structured patterns out of discrete systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 859.6,
    "end": 875.748,
    "text": "So I'd kind of be curious, and I think this chapter would be cool if it had something about communication and synchrony, pattern synchrony, but in terms of discrete valued active inference models instead of the continuous valued ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.669,
    "end": 877.889,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.56,
    "end": 880.801,
    "text": " Yeah, very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.722,
    "end": 892.11,
    "text": "That's what I was wondering, which is why is communication... Continuous time models are argued to be a natural fit for motor control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.13,
    "end": 898.875,
    "text": "Are communication situations naturally fit for one or the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.757,
    "end": 904.801,
    "text": " seems like no, you could imagine it either way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.821,
    "end": 914.629,
    "text": "And then also like the synchronization means the internal state of one creature should come to resolve the, resemble internal states of another, a primitive kind of theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.37,
    "end": 926.139,
    "text": "I think not as a fatal critique, but these examples put the rabbit in the hat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.054,
    "end": 928.595,
    "text": " a little bit too keenly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.275,
    "end": 933.217,
    "text": "Like the planning example we explored wasn't truly planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.357,
    "end": 942.962,
    "text": "It was like a parameterized subspace where single step optimization emulated planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.382,
    "end": 950.686,
    "text": "And one could argue that they believe that that's actually like a better approach than true explicit planning, but that's not what was on the cover.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.206,
    "end": 952.047,
    "text": "And then similarly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.1,
    "end": 974.638,
    "text": " theory of mind though qualitatively may be a framing for communication we're talking still about the bird song where they have the same shared a priori generative model so this doesn't um in other words theory of mind is is um is axiomatically and implicitly embedded within this model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.788,
    "end": 996.173,
    "text": " rather than active inference being used as an a priori first principles to generate some realized computational theory of mind i feel like yeah yeah it's like um you know another aspect of this the continuous valued formulations is there's really not that many degrees of freedom",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.179,
    "end": 1003.701,
    "text": " But when you're communicating anything other than a fixed song, there's a lot of degrees of freedom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1004.001,
    "end": 1005.802,
    "text": "And that's why we have symbol systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.442,
    "end": 1012.604,
    "text": "But symbol systems is where you would use a discrete model framework for not a continuous value line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1018.286,
    "end": 1018.526,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.226,
    "end": 1024.808,
    "text": "Let's talk about hybrid models, discrete and continuous models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.741,
    "end": 1053.343,
    "text": " and learning and updating so these are two features um chapter eight is um within a continuous time framework just like chapter seven layered in these kind of patterns or archetypes of discrete time models in chapter eight analogously the most",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.858,
    "end": 1077.888,
    "text": " kernel continuous time formalism is introduced with movement control and then we're going to see some kind of extensive extensions or um patterns like design patterns that include continuous time this is the um message passing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.934,
    "end": 1099.204,
    "text": " Okay, so missing line here, but we have here, this top half is like the bottom of figure 4.3 or the top, I guess, discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.425,
    "end": 1102.706,
    "text": "So we have B matrix as a transition matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.766,
    "end": 1109.812,
    "text": "We have discrete time and we have, yeah, it's discrete time, T plus one, T minus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.472,
    "end": 1113.455,
    "text": "But within each time point,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.543,
    "end": 1141.839,
    "text": " we see the continuous time, E, whatever we want to call this motif, where the B transition matrix in discrete time is functionally substituted with a derivative map, such that rather than actually retro or forecasting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.422,
    "end": 1166.737,
    "text": " state values through time this is much more like a taylor series approximation where extrapolation from the present under the auspices of slower changing causes v which play a functional role of policies higher derivatives capture more and more variance further and further from the origin",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.188,
    "end": 1178.231,
    "text": " What is the ETA doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.156,
    "end": 1200.522,
    "text": "It's playing some functional role to G. Again, allowing for a line here in the sense that it is selecting policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.923,
    "end": 1209.851,
    "text": " But it's not policy that's being selected or discussed this way, but the slower changing factors that influence how the derivatives are made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.175,
    "end": 1216.258,
    "text": "But is eta a free energy variable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.261,
    "end": 1219.942,
    "text": "Let's just ask.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.295,
    "end": 1237.535,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.376,
    "end": 1242.798,
    "text": "What do people think about this type of hybrid modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.819,
    "end": 1264.928,
    "text": "How does this align with the previous decades of analog digital signals engineering and the interfaces, the digitalization of analog noise and signals and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.69,
    "end": 1276.253,
    "text": " Well, let me offer one thought, if it's all right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1280.035,
    "end": 1300.526,
    "text": "So one of the things that active inference lets you do is look at a past trajectory and figure out how to interpret it in terms of your state variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.029,
    "end": 1327.947,
    "text": " So you can essentially you look for the the probability distribution over variables that optimizes the free energy and that allows you to look back in time and reinterpret evidence because you get something new and you get in light of new evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1328.407,
    "end": 1332.11,
    "text": "And then some of the earlier chapters they had this kind of example and they had the example of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1332.754,
    "end": 1337.837,
    "text": " of a dynamic programming kind of a model for this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1338.417,
    "end": 1344.381,
    "text": "So I would expect that to be the case also in communication systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.401,
    "end": 1351.805,
    "text": "I guess I'm going back again to communication, where to some extent, you're able to reinterpret what you thought you heard before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1351.825,
    "end": 1356.948,
    "text": "It's kind of rare in language, but it happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1356.988,
    "end": 1359.009,
    "text": "There are garden path sentences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.344,
    "end": 1385.425,
    "text": " but usually you know you most communication systems try to be relatively hierarchical in that once you was once you interpret your continuous value signal then you don't leave a lot of ambiguity you kind of you know fix on that and then you have to deal with it later and sometimes you go back and do repair so i'm wondering if this figure 8.6 if that allows that kind of dynamics where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1386.793,
    "end": 1389.395,
    "text": " You know, you're kind of tracking something at the continuous value level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1389.415,
    "end": 1395.58,
    "text": "You're tracking a signal, Y effectively, by making predictions of what you're going to hear, what you observe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.142,
    "end": 1412.294,
    "text": "And then is that able, in this framework, to go and influence the symbol level, the S variables above, and how far back in time is it able to do that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.426,
    "end": 1443.123,
    "text": " nice that makes me think about phonemes down here and audio and then here are the um spellings so in a language or someone is speaking unclearly or you're not super familiar with the language um then you really are like doing inference on the on the whole time series like it's like that kind of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.968,
    "end": 1450.33,
    "text": " retrocasting, which can include even revisionism and delusions and false memories and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.99,
    "end": 1460.872,
    "text": "Now casting, including the tension between representing things, quote, as they are versus like having delusions in the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.472,
    "end": 1469.234,
    "text": "And then anticipation, which of course hasn't even happened unless you have a vision of time as, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.859,
    "end": 1473.34,
    "text": " something that always was or however.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.281,
    "end": 1484.226,
    "text": "So it's really interesting that although this time t is an index, we are doing inference across these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.286,
    "end": 1498.513,
    "text": "And maybe it would speak to some measure of information processing and memory and anticipation, the extent to which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.863,
    "end": 1526.262,
    "text": " um like meaning is able to be the closer meaning is to a critical point like the more this graph structure if someone says but i was just kidding you would want that to apply to to be like oh i didn't know i was in a parentheses and now that they were just kidding about that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.799,
    "end": 1546.109,
    "text": " So it's actually like delineating those structural markers and then reinterpreting meaning is perhaps moving towards the kind of linguistic modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.291,
    "end": 1550.132,
    "text": "So yeah, to come back to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.053,
    "end": 1554.134,
    "text": "So this could be a waveform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.578,
    "end": 1583.708,
    "text": " observables down here could could be just a four-year analysis or a pure auditory waveform yeah i think phonemes is that that's what comes to mind also okay okay ocular motor tasks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.157,
    "end": 1597.28,
    "text": " So selecting a target location and using motor behavior functionally eyes to foveate the target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.121,
    "end": 1600.941,
    "text": "Figure eight, seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.961,
    "end": 1606.283,
    "text": "Okay, so figure eight, seven is a hybrid or mixed generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.584,
    "end": 1615.446,
    "text": "Higher level, this is kind of like the decision-making motor active inference fusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.353,
    "end": 1635.015,
    "text": " Here we have a little bit of the italics and bold, which we could dive into but don't need to do so at this moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.776,
    "end": 1644.857,
    "text": "So my recollection for last week was that that corresponded to generative model versus process model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1645.697,
    "end": 1646.958,
    "text": "You think that might map again here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1647.018,
    "end": 1648.818,
    "text": "I know you didn't want to dive into it, but you did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1651.42,
    "end": 1678.348,
    "text": " i believe it does let's just remind ourselves where it came up earlier in the chapter yeah it was it was the very beginning right here yeah with italics versus process in bold model in italics okay so eight seven so now here the um discrete model is on a time period of 200 milliseconds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.834,
    "end": 1682.536,
    "text": " Continuous model operates continuously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.556,
    "end": 1693.21,
    "text": "I think this speaks to how biological knowledge can be encoded in the model structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.69,
    "end": 1702.014,
    "text": " I mean, a more comprehensive approach would have done parameter sweeps for what the optimal number of milliseconds is to do a discrete model on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.814,
    "end": 1712.22,
    "text": "However, one could say like, well, the physiology that we're interested in is accomplished with a gamma EEG cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.96,
    "end": 1715.621,
    "text": "The gamma EEG cycle is this many milliseconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.682,
    "end": 1718.323,
    "text": "So we're just going to treat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.353,
    "end": 1740.729,
    "text": " that as like a discrete rhythm like one can imagine if the discrete time were one millisecond here you would be losing computational advantage and you'd be kind of like over slicing because if eye movement does happen on a time scale of hundreds of milliseconds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.051,
    "end": 1745.252,
    "text": " discretizing to one millisecond is going to be too fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.712,
    "end": 1751.673,
    "text": "And discretizing to one second is not going to enable multiple actions to be taken within that frame.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.454,
    "end": 1768.297,
    "text": "So time scale and spatial scale of a system might be able to be encoded at the phase of its construction or structured learning more generally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.317,
    "end": 1771.478,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.902,
    "end": 1781.786,
    "text": " Gaussian mixture model and the hierarchical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.507,
    "end": 1782.687,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1783.007,
    "end": 1787.391,
    "text": "Sorry, before we move on, just about the isochodes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1788.632,
    "end": 1793.835,
    "text": "I don't understand what is gained by an active inference model for this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1793.855,
    "end": 1798.259,
    "text": "I mean, why not just say you've got a controller and it's a control loop and that's good enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1804.744,
    "end": 1804.984,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.875,
    "end": 1817.758,
    "text": " in live stream number 50, which we're just preparing for, it's like very classical cybernetic control loop, homeostatic dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.118,
    "end": 1827.001,
    "text": "And it's interesting to ask like, again, what makes the model active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.681,
    "end": 1835.163,
    "text": "One could say that there's a Markov blanket, but we're, you know, between every one of these variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.821,
    "end": 1841.164,
    "text": " It is a model of action and perception like so many other models of action and perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.105,
    "end": 1844.807,
    "text": "So what is being shown here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1845.127,
    "end": 1861.638,
    "text": "Is it that the single imperative, that energy-based imperatives, just speaking narrowly here, energy-based imperatives can mediate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.147,
    "end": 1868.35,
    "text": " decision-making in discrete continuous hybrid models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.799,
    "end": 1890.468,
    "text": "And that it's possible to have a categorical decision-making model in feedback with a continuous ocular motor model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.437,
    "end": 1911.132,
    "text": " At the very least, it places this type of model within the domain and grammar of active inference modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.128,
    "end": 1942.432,
    "text": " Okay, data clustering we may have touched upon, also hierarchical Gaussian filter that I know some people have worked on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.994,
    "end": 1950.136,
    "text": "Okay, let's look at some of the summary advances in continuous time models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.796,
    "end": 1954.077,
    "text": "Synthetic birdsong, we talked about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.898,
    "end": 1957.979,
    "text": "Ocular motor delays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.164,
    "end": 1965.165,
    "text": " Conditioned reflex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.025,
    "end": 1968.086,
    "text": "Okay, so this is in the chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.227,
    "end": 1970.027,
    "text": "This is in the chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.948,
    "end": 1974.25,
    "text": "I don't know about this exact paper perhaps, but ocular motor is in the chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.73,
    "end": 1975.63,
    "text": "And smooth eye pursuits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.472,
    "end": 1978.512,
    "text": "Conditioned reflexes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.273,
    "end": 1980.493,
    "text": "That is in this chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.953,
    "end": 1983.575,
    "text": "The blink, the conditioned and the unconditioned stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.097,
    "end": 1990.059,
    "text": "Building on the Songbird model, but the Songbird model was in 2015.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.721,
    "end": 1998.662,
    "text": " False inference from suboptimal prior beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.824,
    "end": 2002.685,
    "text": "Can prior beliefs be suboptimal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.107,
    "end": 2005.908,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.428,
    "end": 2013.814,
    "text": "Actually, Friston has talked about Birdsongs before 2015 in one of his papers, I think from 2013 or 12.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2013.854,
    "end": 2015.075,
    "text": "Yeah, it's from 2013, which is co-authored with...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.981,
    "end": 2048.202,
    "text": " uh his son i guess dominic a friston so yeah i mean the 2015 paper was not the first paper the name of the paper is the is the free energy formulation of music generation and perception thank you thank you yeah this one wow yeah good um fine reminder interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.495,
    "end": 2053.357,
    "text": " Looks very much like the textbook, you know, opening quotes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2055.659,
    "end": 2060.823,
    "text": "I can see how this is related to your researching too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.843,
    "end": 2063.885,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.126,
    "end": 2068.989,
    "text": "Oh, maybe even 2009, Birdsong, Chaotic Attractors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.049,
    "end": 2077.375,
    "text": "Wow, you know, it's 10 plus years on the Birdsong paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.496,
    "end": 2086.879,
    "text": " Okay, so deviations in perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.962,
    "end": 2092.363,
    "text": "More eye movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.363,
    "end": 2099.147,
    "text": "It's kind of fun, like how we've talked about babbling and that across different domains, like cicading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.868,
    "end": 2104.951,
    "text": "Now there's the ocular motor cicade, but are there other kinds of cicadings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.553,
    "end": 2109.774,
    "text": "For example, I think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.891,
    "end": 2133.429,
    "text": " knowledge management niches facilitate semantic circadian yes enabled by visual circadian as well because you have to be like looking around on the page but it's just like what was chapter four okay we were talking okay that's what we were talking about chapter four what's notation i think it's just sort of like the analog to scanning around a little bit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.731,
    "end": 2140.993,
    "text": " But just having conversation analysis, that's, you know, that's a very important topic is topic control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2142.273,
    "end": 2150.616,
    "text": "And, or, you know, if you're, if you look at any, you know, most conversations have multiple threads going.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.096,
    "end": 2156.958,
    "text": "So it's like a fugue in, you know, Bach, okay, you know, which voice is this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2157.438,
    "end": 2159.219,
    "text": "You know, every note is in a voice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2160.199,
    "end": 2163.1,
    "text": "And the voice has got some topic, and they intertwine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.026,
    "end": 2194.219,
    "text": " in girdle escherbach prelude ant fugue nice this is very um interesting i think it starts to um plant some seeds towards again semantic circadian computational conversation analysis and generation adaptive knowledge environments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.902,
    "end": 2199.605,
    "text": " like visual accessibility is one topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.066,
    "end": 2205.81,
    "text": "You know, if somebody has a visual difference, then making sure that they can see it is the enabling system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.671,
    "end": 2210.695,
    "text": "But let's just assume that we're within a space where we can talk about what is being seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.335,
    "end": 2217.781,
    "text": "So then how does someone get a clear picture of what we're talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.102,
    "end": 2221.404,
    "text": "That would be through some sort of saccade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.864,
    "end": 2227.065,
    "text": " where you'd recognize more uncertainty at the periphery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.405,
    "end": 2232.746,
    "text": "And like the fovea in this case is paying attention to the conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.847,
    "end": 2239.668,
    "text": "And that's why like with a language we're unfamiliar with, we get a little bit lost because like our saccade, we're too slow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.688,
    "end": 2241.808,
    "text": "We don't have the fluency to saccade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.848,
    "end": 2245.229,
    "text": "And so the video is moving too fast to track.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.169,
    "end": 2248.95,
    "text": "So we're just kind of like randomly listening and like trying to like compute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.596,
    "end": 2257.279,
    "text": " but what if somebody were on a guided, saccade journey through their semantic landscape?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.201,
    "end": 2265.745,
    "text": "I mean, just to take this a little bit further, this is also maybe, it's a critical element of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2266.907,
    "end": 2271.332,
    "text": " cognitive architecture, which is the ability to topic switch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2272.353,
    "end": 2276.717,
    "text": "And in psychology and cognitive science, there's this notion of executive control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.737,
    "end": 2281.882,
    "text": "And one of the fundamentals of executive control is to be able to topic switch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2282.042,
    "end": 2287.488,
    "text": "So you're on some task, you get an interrupt, you have to put that on a stack, deal with your interrupt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2288.028,
    "end": 2289.069,
    "text": "Then when you're done,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.97,
    "end": 2298.565,
    "text": " maybe the interrupt is a goal it could be a sub goal it could be some other topic that comes in something you have to deal with then when you're done you have to be able to pull that back push that back off the stack",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.648,
    "end": 2300.728,
    "text": " and get back to where you were.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2301.149,
    "end": 2305.43,
    "text": "So all that context switching is really, I mean, there's measures of how people do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2305.47,
    "end": 2320.394,
    "text": "And there's debates about whether people can multitask or not, whether they're actually really multitasking or they're just multi-threading, but they're dividing the amount of computational process by the number of processes you have going.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2320.434,
    "end": 2325.036,
    "text": "So you're actually not doing multiple things at once as effectively as if you just stuck with one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2325.536,
    "end": 2328.317,
    "text": "So yeah, anyway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2328.937,
    "end": 2355.065,
    "text": " and then it's like do we have that intel hyper threading capacity is it a virtualized hyper thread on one thread are there actually different threads yeah i mean the conversation analysis other than us being right in the thick of it and it being highly engaging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.916,
    "end": 2385.885,
    "text": " it's important area let's just continue through this cases here action observation okay mirror neurons this may be very much related to the um bird song singing from the same hymn sheet or whatever and then like you know doing the same dance okay attention this is a super fascinating area",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.529,
    "end": 2408.561,
    "text": " And I think a lot of notebooks and applications, like just taking a trace of somebody's browsing on Wikipedia or across websites and then reconstructing components of their generative model based upon their salience revealed choice is a huge area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.661,
    "end": 2412.123,
    "text": "And then doing again that with the ocular motor, with webcams,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.383,
    "end": 2441.916,
    "text": " uh and doing it with uh semantic landscapes hybrid modeling self-organization arguably with some pretty interesting advances in the last several months and days from fields and levin and others on the uh and four-staged earlier but on the morphogenesis as bayesian inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.749,
    "end": 2456.272,
    "text": " Okay, in our last few minutes here, let's just look ahead to nine because I think this is setting us up well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.392,
    "end": 2464.474,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.136,
    "end": 2477.439,
    "text": "Model-based data analysis or data-based modeling or however we want to say this is about parameterizing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.031,
    "end": 2497.728,
    "text": " structured models with observations so rather than just by fiat dictate saying this is the structure of the model and it spits out observations like so and so we want to be able to actually run it backwards not as a generative model but as a recognition model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.587,
    "end": 2508.072,
    "text": " so to speak in this expectation maximization framework and parameterize our generative model from sparse or dense observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.672,
    "end": 2520.678,
    "text": "And that's also called parametric empirical base because you're parameterizing the prior based upon the mean and variance and patterns of some empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.94,
    "end": 2525.861,
    "text": "Okay, the Metabasian approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.066,
    "end": 2558.203,
    "text": " base theorem this may even be something that could be introduced earlier even though it's also meta this is like the map territory fallacy fallacy graphical abstract which is we're making a map here's us in the bigger box even though there's a dashed box even beyond us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.238,
    "end": 2580.963,
    "text": " were making a map of a cognitive entity in its map making of its generative process and that was the subject also of some very rich discussion several days ago with Jakob and Ali and Dalton Ali anything to add on this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.611,
    "end": 2614.646,
    "text": " I know nothing much but one general comment I wanted to make about chapter nine is that you see because of my project that I've been working on for the past several months this chapter nine has been quite helpful in developing some of my ideas around how to how to exactly model my",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.428,
    "end": 2622.192,
    "text": " I mean, the music emotional recognition system that I've been working on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.793,
    "end": 2643.35,
    "text": "But I wanted to point out one small caveat here, which is that, you see, at least in my opinion, Chapter 9, or this so-called model-based data analysis, is not conducive to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.271,
    "end": 2659.024,
    "text": " generate every, I mean, on every model that's been described throughout the throughout the book, I mean, it's just focused on some specific kinds of models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.825,
    "end": 2667.672,
    "text": "So it might not be generalizable to every kind of model that we've seen throughout all the previous chapters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.311,
    "end": 2671.771,
    "text": " Good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.672,
    "end": 2683.636,
    "text": "Some models might be just plug and play, so to speak, and other ones might take a little bit more work to get to use empirically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.656,
    "end": 2688.838,
    "text": "Okay, let's just continue in our last minutes to scan through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.998,
    "end": 2693.36,
    "text": "So metabasian process, we're drawing inferences about an inferential process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.593,
    "end": 2725.409,
    "text": " it's a key point and that's the two levels of mapping it's like the map of the map variational applause variational base factorized models for computational simplicity and interpretability based upon the sparsity of coupling of variables in a base graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.758,
    "end": 2750.456,
    "text": " and laplace using a parabolic approximator of the mode and a variance to ensure a simple optimizable heuristic not that it perfectly recapitulates the shape of the posterior which doesn't have to be inverted quadratic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.454,
    "end": 2772.399,
    "text": " but the Laplace approximation is smoothly optimizable for both the mode and the variance and here's where they mentioned that's the parametric empirical Bayesian approach and basically Laplace approximation can be thought of as making a commitment to um the quadratic form",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.567,
    "end": 2777.728,
    "text": " So choosing the family that your prior is going to be of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.589,
    "end": 2784.27,
    "text": "And then bootstrapping your initial prior with your observed data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.511,
    "end": 2790.172,
    "text": "Bootstrapping not in the resampling sense, but in the starting oneself out sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.573,
    "end": 2800.055,
    "text": "This was explored more in other works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.598,
    "end": 2831.127,
    "text": " but you have some likelihood function of all the parameters L of data and optimizing action involves computing beliefs about policy such that policies are proportionally taking up slices of the pie monotonically with respect to their free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.392,
    "end": 2858.582,
    "text": " and then there's a precision on action parameter where you can turn it all the way down to sort of like don't know don't care where even large differences in free energy between policies get equilibrated out that's like hot decision making and then absolute zero decision making would be a policy that's even 51 more likely would be always selected",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.918,
    "end": 2870.743,
    "text": " So the variational free energy, expected free energy, it's a bound on surprise due to Jensen's inequality and evidence lower bound and all this other work in variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.884,
    "end": 2882.73,
    "text": "And then that pi slicing can be tuned up or down with a shaky hand parameter, soft max temperature parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.292,
    "end": 2889.273,
    "text": "If the soft max is one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.595,
    "end": 2919.533,
    "text": " the pie is undistorted if the softmax is large you have a relentless bias for better policies or it could be less than one here's some technical details of the Laplace approximation parametric empirical base generalized linear modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.601,
    "end": 2922.541,
    "text": " Hashtag SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.563,
    "end": 2927.303,
    "text": "Here's recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.483,
    "end": 2931.745,
    "text": "So this is kind of like chapter six, but now it's model-based data analysis, collect behavioral data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.666,
    "end": 2935.106,
    "text": "Maybe the data has already been collected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.186,
    "end": 2937.847,
    "text": "Maybe there's some data sets that we already can use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.628,
    "end": 2940.748,
    "text": "Formulate a POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.569,
    "end": 2944.29,
    "text": "I wonder if this is as chapter six, not as chapter seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.77,
    "end": 2947.931,
    "text": "It could be chapter seven as well, if it's discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.169,
    "end": 2981.822,
    "text": " specify likelihood perhaps we can um in the coming weeks check out spm mdp vbx and they mentioned the scripts data this is nice this will be fun chapter seven i mean it is the correct if they're using this type four chapter seven chapter four",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.556,
    "end": 2988.08,
    "text": " So this looks pretty cool, pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.6,
    "end": 2990.442,
    "text": "We could walk through some examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.669,
    "end": 2999.35,
    "text": "False inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.332,
    "end": 3002.573,
    "text": "Computational pathology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.593,
    "end": 3006.776,
    "text": "So it kind of ends like chapter eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.141,
    "end": 3025.091,
    "text": " a table of references and a summary so it's a pretty short chapter and has some formalisms but it's only from page 179 in the pdf to 196. so it's less than 20 pages",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.499,
    "end": 3038.181,
    "text": " The next chapter, I think, is the longest chapter in the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.861,
    "end": 3039.782,
    "text": "Which one is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.302,
    "end": 3040.542,
    "text": "Chapter 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.603,
    "end": 3041.763,
    "text": "Chapter 10, 197.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3041.823,
    "end": 3047.928,
    "text": "Yeah, that one's over 30 pages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.689,
    "end": 3049.91,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.693,
    "end": 3054.673,
    "text": "But it ends on a high note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.558,
    "end": 3060.818,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3061.599,
    "end": 3064.441,
    "text": "Well, interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.711,
    "end": 3090.882,
    "text": " conversations thanks for this we will come um back to chapter nine look through it and then peep into ten go through ten and really solidify our understanding of the map and i guess indirectly of the territory and then for those who want to join",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.162,
    "end": 3098.544,
    "text": " we'll probably continue the discussion and especially start looking towards those project ideas again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.644,
    "end": 3108.287,
    "text": "Like we talked just a little earlier about making a dot zero sessions for the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.607,
    "end": 3112.328,
    "text": "So I have to apologize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.748,
    "end": 3117.429,
    "text": "I'm traveling for a few weeks, so I'm going to miss the next several sessions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3118.59,
    "end": 3119.09,
    "text": "It's all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.13,
    "end": 3119.63,
    "text": "Thank you, Eric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.391,
    "end": 3123.856,
    "text": " Any other comments people want to make or I'll close the recording.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.728,
    "end": 3129.948,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.03,
    "end": 3131.291,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  }
]