[
  {
    "start": 2.748,
    "end": 10.718,
    "text": " Hello, it's July 18th and we're in our first discussion of chapter three in cohort four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 11.579,
    "end": 30.662,
    "text": "So before we go to any questions or anything, does anyone want to just bring up any overall thoughts they had on chapter three, just about the chapter, where it is in the book or what they remember or got from that chapter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 51.196,
    "end": 79.988,
    "text": " yeah i would add that i actually just generally think the chapter was written very well and it was very clear um i think the high road can be philosophically and mathematically very abstract so i personally appreciated the kind of clarity that the authors took to discussing things like markov blankets and um existential imperatives i guess it's it's a the high road",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 80.525,
    "end": 88.777,
    "text": " perhaps more than low road provokes further questions, further ontological and philosophical metaphysical questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.579,
    "end": 103.157,
    "text": "How deep does the hierarchy of Markov blankets run or what's the fundamental base layer of this whole system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.711,
    "end": 111.079,
    "text": " But on the whole, at least in so far as the free energy principle is a very simple explanation of something very fundamental.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.16,
    "end": 114.763,
    "text": "Yeah, I thought it did a really good job outlining that particular point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.832,
    "end": 123.092,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.192,
    "end": 123.592,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.953,
    "end": 124.413,
    "text": "Anyone else?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 124.854,
    "end": 126.255,
    "text": "Any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 127.056,
    "end": 128.898,
    "text": "Low road, high road, anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 129.219,
    "end": 129.399,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 130.2,
    "end": 131.541,
    "text": "Yeah, I really enjoyed it.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 131.926,
    "end": 161.241,
    "text": " this chapter probably because there's less equations to uh get hung up on but especially section 3.7 just the idea of using active inference to reconcile um different theoretical perspectives so in my reaction we have debates about whether uh movement commands are represented centrally versus self-organizing or are inactive this is hotly debated for decades now",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 161.947,
    "end": 172.003,
    "text": " And that's something that's really attracted me to active inference is to have more unifying view rather than keep going with debating.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 172.023,
    "end": 175.789,
    "text": "So I really appreciated section 3.7 for me personally.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 182.399,
    "end": 188.629,
    "text": "Any other thoughts on 3 or about how somebody is seeing the low road and the high road?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 194.718,
    "end": 199.023,
    "text": " But then I want to see about the figures.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 199.143,
    "end": 211.657,
    "text": "When I look at the figures, for example, figure 3.1, where the figure explains the blanket states.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 213.699,
    "end": 224.151,
    "text": "But in addition to those blanket states, there are many other notations and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 224.468,
    "end": 226.991,
    "text": " and formulas.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 228.833,
    "end": 234.539,
    "text": "So it seems quite intimidating, those formulas.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 234.559,
    "end": 245.65,
    "text": "Like, for example, the first equation on the left, you have x, you know, dot x equal to f of x, et cetera.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 246.111,
    "end": 250.155,
    "text": "So all this notation is not explained.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 250.456,
    "end": 263.072,
    "text": " that it seems to me that it creates blocks for understanding of the concepts.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 266.075,
    "end": 269.96,
    "text": "So basically, I found it is kind of a little bit incomplete.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 270.281,
    "end": 277.83,
    "text": "I know it's difficult, because in order to understand these concepts, you need more",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 278.519,
    "end": 281.042,
    "text": " background explanations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 286.569,
    "end": 294.9,
    "text": "So when I read those figures, I hope to understand all the information that contains in the figures.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 295.601,
    "end": 303.531,
    "text": "If there are things that are not understandable, that creates kind of a mental block in my mind.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 304.878,
    "end": 329.164,
    "text": " sure totally makes sense so and it's good to want to understand all the notation so this is a representation that is going to come up again and again um it's the markov blanket and there's kind of two uh types of notation happening here there's like the variables that are being locally assigned",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 329.583,
    "end": 353.11,
    "text": " and then there's some more conventional notation so like some of the conventional notation is f is a function of something and then omega is a noise term on something that's conventional and also the dot being a rate of change so it's kind of like having like a prime or a first derivative",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 353.191,
    "end": 355.735,
    "text": " And then there's the locally assigned variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.456,
    "end": 368.816,
    "text": "So external X, internal mu, active U, sensory Y. And then now there is a typo in this figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 368.836,
    "end": 372.542,
    "text": "A small one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 374.526,
    "end": 377.711,
    "text": "Just it's in the errata.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 377.731,
    "end": 379.534,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 379.554,
    "end": 379.654,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 380.512,
    "end": 384.036,
    "text": " But the visuals are correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 385.998,
    "end": 395.368,
    "text": "Each of these functions, the rates of change of each of these four kinds of states, we're describing the rate of change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 396.489,
    "end": 407.16,
    "text": "So it's kind of like a flow map for all four of these nodes on a graph for the internal, external states in the blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 407.495,
    "end": 408.056,
    "text": " Right.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 408.076,
    "end": 408.816,
    "text": "Rate of change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 409.497,
    "end": 409.837,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 409.857,
    "end": 415.663,
    "text": "And each of those rates of change is broken up into two components, kind of like a signal and a noise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 416.804,
    "end": 436.945,
    "text": "That's and noise could be zero or it could be all noise and the signal component on the rate of change of each of the, um, nodes in this particular partition, the signal component is a function of all the incoming arrows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 438.241,
    "end": 440.323,
    "text": " and itself at that time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 440.343,
    "end": 442.025,
    "text": "Right.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 442.265,
    "end": 454.839,
    "text": "So in chapter two, we understand the low road, we understand the active inference as a kind of an optimization problem where you have a choice of action and perception.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 455.379,
    "end": 467.252,
    "text": "So how does action and perception play a role in this figure, in this Markov blanket, in the figure you just showed?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 468.7,
    "end": 470.526,
    "text": " Yeah, good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.129,
    "end": 480.702,
    "text": "Well, we associate this incoming sensory state according to perception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 481.255,
    "end": 486.122,
    "text": " And then the outgoing statistical dependencies according to action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 487.163,
    "end": 496.215,
    "text": "And then what happens here, which could be nothing if it's a very simple system, or it could be sophisticated or unknown, same as external.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.078,
    "end": 499.86,
    "text": "We just call this the cognitive states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 500.441,
    "end": 505.347,
    "text": "So this is the perception, cognition, and action of the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 506.89,
    "end": 508.672,
    "text": "Blanket plus internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 509.193,
    "end": 510.975,
    "text": "That's the particular thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 511.833,
    "end": 515.678,
    "text": " insulated off from the external states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 518.101,
    "end": 541.35,
    "text": "So that's why this is like the minimal Bayes graph for the cybernetic agent is having the input cognition and output and the work of Isomura and Friston and others like maps this onto neural networks that have like an input processing and output layer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 541.904,
    "end": 571.202,
    "text": " right but i don't think what are the choices because in the chapter two it talks about the the perception and the action are the choices made by the agent right so those are the choices not the states it's a decision kind of decision can make you can choose to to to to percept this way or the other way you can choose to take that action or another action",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 571.756,
    "end": 594.456,
    "text": " so here you're you're are you seeing the action state is is the action is the choice two um ways to think about this first is that's why we talk about beliefs about action action prior uh policy prior policy posterior so because we're talking about our beliefs about action and the second thing is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 594.942,
    "end": 596.063,
    "text": " This is coming from a high road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 596.083,
    "end": 599.207,
    "text": "So this is kind of like a, forget what you knew about chapter one and two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 599.868,
    "end": 604.493,
    "text": "Start with just this particular partition on a Bayes graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 604.513,
    "end": 610.44,
    "text": "And then the chapter continues with connecting it more to perception and action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 611.581,
    "end": 618.969,
    "text": "But start with like, this is the topology of systems that can sense and act.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 620.311,
    "end": 623.835,
    "text": "Or you could propose a different topology of that system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 625.233,
    "end": 626.856,
    "text": " Um, younger than anyone else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 630.282,
    "end": 631.805,
    "text": "Yeah, I just wondered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.066,
    "end": 645.891,
    "text": "So the sensory states are the perception, and the active states are the action intuitively, and well, those 2 are directly connected to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.871,
    "end": 648.714,
    "text": " which means that they can bypass the cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.535,
    "end": 660.947,
    "text": "And it's really hard for me to imagine a state of active states just bypassing the cognition and just going directly to the sensory state and also vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.608,
    "end": 664.611,
    "text": "So can anyone come up with a good example of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.635,
    "end": 668.255,
    "text": "Awesome question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 668.495,
    "end": 671.278,
    "text": "Does anyone want to give a thought on that about this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 671.619,
    "end": 674.562,
    "text": "What is this double headed arrow in the center?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 682.253,
    "end": 694.831,
    "text": " So my understanding of this error means that the active state is affected by the sensory data you connect.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 695.051,
    "end": 710.573,
    "text": "So basically, you can see here, fu is a function of y. y is the sensory data that the agent gathered from the external world, gathered from there.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 710.924,
    "end": 712.806,
    "text": " The expectation.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 712.846,
    "end": 738.67,
    "text": "On the other hand, also the U is that your action also will affect your sensor data Y. For example, in the separate two, the apple and frog example, if you choose your action to look at apple tree, this U, if you move your eye towards apple tree,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 739.038,
    "end": 745.608,
    "text": " that will generate sensory data about Apple, you know, what do you observe will be Apple.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 745.628,
    "end": 755.141,
    "text": "So that will be the action will affect your sensory data Y. And your sensory data Y will affect your action.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 755.181,
    "end": 760.489,
    "text": "Yeah, I'm just thinking how that example.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 761.903,
    "end": 763.807,
    "text": " These are all true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 763.847,
    "end": 773.706,
    "text": "Another thing to keep in mind is like the effect of a given edge in a model or system of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 773.726,
    "end": 776.151,
    "text": "It might not be relevant, but it's kind of like in principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 776.591,
    "end": 783.625,
    "text": "So if you have a computer system where one computer is getting input and sending it to a second one, sending it to a third one and then emitting it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 783.605,
    "end": 785.267,
    "text": " there is no effect of this arrow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.089,
    "end": 790.575,
    "text": "Or if you have some other system where this in practice is zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 790.595,
    "end": 799.408,
    "text": "So just because there's an edge doesn't mean that in that simulation or that model, it's like it matters in a certain way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 800.19,
    "end": 813.409,
    "text": "And the reason why it's there in principle is because the definition of the Markov blanket for a given node is all the nodes that kind of insulate it and the co-parents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 813.963,
    "end": 828.942,
    "text": " And so just in principle, they could be connected under the Markov blanket definition, like the Markov blanket nodes could all be connected to each other and be connected into the node of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 829.803,
    "end": 839.415,
    "text": "And also these assignments of internal, external, active sensory, these are all relative to a given internal node of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 840.537,
    "end": 842.299,
    "text": "If you call this one internal,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.448,
    "end": 844.552,
    "text": " then this would be sensory and that would be active.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.293,
    "end": 847.337,
    "text": "Or if you picked one over here, it would be different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 847.959,
    "end": 850.283,
    "text": "So these are not like essential features of nodes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 850.704,
    "end": 856.535,
    "text": "These are just with respect to a chosen internal state on a created model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 857.878,
    "end": 858.259,
    "text": "Darius?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 861.264,
    "end": 865.232,
    "text": "Yeah, I mean, I'm just staying on the Markov blanket for a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.208,
    "end": 873.378,
    "text": " I've seen quite a lot of conflicting literature and opinions on to what degree it constitutes a metaphysical reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.419,
    "end": 884.694,
    "text": "So I think one can't help but think of a kind of cell when you think of a Markov blanket and the blanket states that are the boundary between the cell and the external environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.555,
    "end": 890.562,
    "text": "To what degree are Markov blankets from the biggest Markov blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.963,
    "end": 916.212,
    "text": " a universe within the universe all the way down to the smallest of markov blankets and all the ones embedded in between to what degree do current um free energy principle theorists believe that there's a genuine metaphysical reality or is it just a way of visualizing and understanding statistical regularities yeah big question what does anyone think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.177,
    "end": 928.139,
    "text": " Ajit or anyone else?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 931.866,
    "end": 935.232,
    "text": "Um, I guess like, I would think it would.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.737,
    "end": 945.031,
    "text": "So would that be connected to like, our subjective experience would be this statistical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 945.071,
    "end": 946.734,
    "text": "So that would be the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.297,
    "end": 948.477,
    "text": "Uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 951.393,
    "end": 952.174,
    "text": " Is that what you mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 952.334,
    "end": 958.522,
    "text": "I don't mean that it's observer relative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.625,
    "end": 971.9,
    "text": "You have the universe as is, and observations indicate to us that there are separate patterns of existence, things that are distinct from one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.92,
    "end": 979.51,
    "text": "All those boundaries which are defined by the Markov blanket, metaphysical as in they exist,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.726,
    "end": 986.176,
    "text": " I mean, I think the only way of kind of conceptualizing that is as a material distinction, or do they just exist?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.657,
    "end": 1000.659,
    "text": "Do they solely serve to be a statistical representation of the actual distinctions that we observe, but perhaps there is no physical substrate underlying those regularities?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.72,
    "end": 1004.164,
    "text": "That's my question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.713,
    "end": 1007.175,
    "text": " Yeah, it's a huge question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1007.635,
    "end": 1008.937,
    "text": "There's, there's a ton to say on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.997,
    "end": 1010.759,
    "text": "Definitely a lot of perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1010.86,
    "end": 1015.105,
    "text": "So like there there's a way broader range.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1016.246,
    "end": 1026.219,
    "text": "One topic that comes up in that setting is the different flavors of instrumentalism and realism and scientific realism pragmatism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1026.279,
    "end": 1032.447,
    "text": "So instrumentalism is like the least metaphysically committed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1033.861,
    "end": 1038.512,
    "text": " And just says, look, linear regressions help us understand the relationship between this and that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1039.554,
    "end": 1043.243,
    "text": "That gives a sort of cognitive realism to the linear regression.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1043.303,
    "end": 1045.348,
    "text": "It might influence someone's life, so it does matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.368,
    "end": 1051.262,
    "text": "So that doesn't mean that we don't take it seriously, but no one is going to mistake the map for the territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1051.613,
    "end": 1064.856,
    "text": " Then, for various reasons, there's also more of a realist, not necessarily like a platonic realist, but like a scientific realism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1065.437,
    "end": 1069.183,
    "text": "It's like, yeah, the objects that are under study are real.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1069.349,
    "end": 1070.771,
    "text": " Now the finger isn't the moon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1071.412,
    "end": 1074.135,
    "text": "So pointing at the phenomena, it's still like not map territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1074.155,
    "end": 1077.399,
    "text": "The model and the equations is not the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1078.18,
    "end": 1079.141,
    "text": "That's obvious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.181,
    "end": 1086.37,
    "text": "So just saying, but the model doesn't have this feature of the system is like, yes, but we're talking about the reality of this system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1087.351,
    "end": 1092.297,
    "text": "Six people and the elephant, they can still be talking about the reality of the elephant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1092.317,
    "end": 1094.8,
    "text": "So that's kind of a scientific realism thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1094.78,
    "end": 1112.569,
    "text": " um and uh mel andrews's work and the math is not the territory live stream 14 and a lot of other discussions on that and then um there's a lot more to say but that's a great question area brynn",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1114.912,
    "end": 1131.148,
    "text": " And I was when I read this chapter I I met the example that I thought I intuitively kind of found helpful was a playing the piano.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1131.297,
    "end": 1150.42,
    "text": " And I wondered if you could verify the veracity of that example if it doesn't indeed explain many of the dynamics between my internal states, my active states, the hidden states, and in turn the sensory states that I receive to complete an action kind of feedback loop.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1150.552,
    "end": 1152.554,
    "text": " And I think it also might explain the.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1154.276,
    "end": 1162.124,
    "text": "The edge is between and the active states in the example of playing the piano and.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1163.165,
    "end": 1178.061,
    "text": "The sensory state that might ensue should you take a particular action or, in this instance of that hope to explain not take a particular action, so I thought of the piano kind of sitting at the piano with the intention of playing and I.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1178.851,
    "end": 1187.761,
    "text": " The I believe I want to play piano i'm not 100% certain of what might be fall under you know what can.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1188.943,
    "end": 1189.203,
    "text": "would.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1190.644,
    "end": 1203.339,
    "text": "fall under the internal states, but other than a belief that I can play i'm sure there are many, many other factors there that would be necessary for one to play initiate the action, but then I touch a key.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1204.761,
    "end": 1207.744,
    "text": "A note, and that is that has.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1209.057,
    "end": 1217.207,
    "text": " that entrains an effect on the perception of the piano, which then in turn, I don't play that note directly.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1218.929,
    "end": 1230.103,
    "text": "I elicit sound from the piano, which then in turn gives me the noise, which hopefully sounds good.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1230.944,
    "end": 1237.933,
    "text": "And so I continue that effect by playing the next notes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1238.015,
    "end": 1265.203,
    "text": " accordance with the previous one and so i build the tune as i go hopefully and hopefully that's pleasing rather than full of kind of dissonance and off beats and and irregularities and i thought about the relationship between the active states and the and the the blanket states the sensory states if you were to omit a note thereby inhibiting the effect",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1265.386,
    "end": 1275.661,
    "text": " of the action on the piano, thereby, you won't perceive anything in its, you won't get anything in return, so to speak, from the piano because you have omitted a note.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1276.863,
    "end": 1281.41,
    "text": "So yeah, I kind of thought about this around playing the piano.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1282.331,
    "end": 1282.472,
    "text": "Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1285.756,
    "end": 1286.117,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.539,
    "end": 1288.901,
    "text": "That's a really cool example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.362,
    "end": 1294.87,
    "text": "And in chapter seven, there's going to be like a musical example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.423,
    "end": 1322.308,
    "text": " and music cognition there's a lot more um work on as well but in this example like the wrong note is played quote wrong note different than the expected tune but the expected the expected note is still heard because the prior is so strong and so like um ali and and several others have have a lot of interest in in that um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1322.828,
    "end": 1350.945,
    "text": " music perception it's like very rich with with music perception and generation improvisation it's a really cool area daniel if i can just ask if you can go back to diagram 3.1 i think it was i just wanted to clarify something that's just come to mind now i'm not very good at all the uh the technical uh details yet but how is a the noise from the external state how does that",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1351.482,
    "end": 1361.136,
    "text": " How does that relate to or how does it correlate to the impact or the effect of the noise at the sensory states?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1361.596,
    "end": 1364.38,
    "text": "How is that kind of transduced?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1364.5,
    "end": 1366.323,
    "text": "I'm thinking of the piano example again.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1366.383,
    "end": 1370.128,
    "text": "How does that dissipate through the system?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1371.59,
    "end": 1372.332,
    "text": "Is it equivalent?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1372.352,
    "end": 1380.443,
    "text": "So a particular noise at the external state, how is that experienced or understood as",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1382.093,
    "end": 1401.334,
    "text": " how is it similar or dissimilar from the the noise perceived at the um or generated in the sensory state yeah very interesting question so think about each of these four nodes as being like a sensor or a thermometer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1401.618,
    "end": 1406.986,
    "text": " in and of themselves, like there are probes that are tracking these flows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1407.066,
    "end": 1413.375,
    "text": "So what would it mean to have this be high and this below?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.935,
    "end": 1419.964,
    "text": "Well, maybe the temperature in the ecosystem is constant, but it has a lot of variability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1420.096,
    "end": 1444.568,
    "text": " there's like no signal really but there's a high variability but we have a very accurate thermometer that we're taking in information from or conversely maybe it's a deterministic temperature outside and our thermometer is highly variable so this is kind of just like the outline",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1445.358,
    "end": 1474.993,
    "text": " that gets filled in like a hundred percent during the modeling process but this is just extremely general outlining like where the same just saying that each of them are partitioned into a signal and noise component in principle but but that's why it really helps to also to think about specific examples and um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1482.972,
    "end": 1483.294,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1485.65,
    "end": 1488.308,
    "text": "Younghoon, go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1488.693,
    "end": 1490.475,
    "text": " Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.396,
    "end": 1503.43,
    "text": "Because I'm a psychiatrist, what keeps to my mind about this microplastic is that it's really a cool concept if you think of the process of psychoanalysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.151,
    "end": 1515.004,
    "text": "Because the therapist, by using his own internal state and inferring the internal state of the patient,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.984,
    "end": 1540.485,
    "text": " and then by uh making decisions and influencing these sensory states and these active states active states active states active states to change the internal state or the internal model of the patient so i mean that's quite interesting because like the basic concept of mark blanket is that you can't really have access to external states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.887,
    "end": 1545.151,
    "text": " which means that you don't have any access to the internal state of others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.972,
    "end": 1561.686,
    "text": "But you can change the internal state by having very good inference about it and doing the right active actions or providing good sensory states, like maybe making the patient comfortable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.186,
    "end": 1570.894,
    "text": "Or sometimes you use many different techniques with psychotherapy, such as hypnotics or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.874,
    "end": 1574.161,
    "text": " I don't know, maybe other relaxation techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.181,
    "end": 1579.613,
    "text": "So, well, the basic market bank is really cool for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.294,
    "end": 1583.12,
    "text": "So, like, it wasn't a question, it was just a comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.844,
    "end": 1585.525,
    "text": "That's awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1585.986,
    "end": 1587.87,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1589.588,
    "end": 1594.714,
    "text": " That is absolutely the core of the Markov blanket concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1595.295,
    "end": 1607.67,
    "text": "Definitely a lot of philosophical like smoke and fire is in that area for, I think, a variety of interesting reasons, partially because it touches upon like how things really are in some people's eyes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1607.73,
    "end": 1613.397,
    "text": "Or it's something that seems to explain like everything and nothing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1613.637,
    "end": 1618.583,
    "text": "But at the end of the day, it's just a description of the sensorium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1619.508,
    "end": 1633.983,
    "text": " And the real important missing, the missing piece or the missing edge, not missing piece, that really embodies the constraints here is the no telepathy, no telekinesis clause.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1635.165,
    "end": 1642.412,
    "text": "No edge between internal and external states except via insulating nodes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.974,
    "end": 1646.697,
    "text": "So by making the fully insulating nodes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1646.812,
    "end": 1655.626,
    "text": " shell, then you you don't need to make any claims about what's in the on the other side of the blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1656.968,
    "end": 1663.478,
    "text": "Now you could, you might happen to know, or you might have a really good model of what is happening or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1664.76,
    "end": 1667.223,
    "text": "But those models aren't free information takes energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1668.385,
    "end": 1674.895,
    "text": "And they're always understood as projections of onto hidden states or trackings of hidden states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1675.313,
    "end": 1691.903,
    "text": " So it's really just a recognition of the sensorium and the cybernetic system boundaries with actually a lot of generalizations that make it really exciting and even more flexible than people might initially consider just from looking at this relatively simple system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1692.324,
    "end": 1692.765,
    "text": "Darius?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1697.521,
    "end": 1708.216,
    "text": " Yeah, I was wondering, this makes perfect sense to me in terms of a sentient non-steady state equilibrium system like a human brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.118,
    "end": 1726.701,
    "text": "But if, in terms of this equation, in terms of the Markov blanket generally, but to what degree can we think that entities that don't act, that exist in steady state equilibria, so like Friston's classic example of a drop of oil in water,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.761,
    "end": 1736.691,
    "text": " I understand that you can't necessarily attribute action to the drop of oil, or at least purposeful action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.552,
    "end": 1745.301,
    "text": "When we look at that diagram in 3.1, do we have to think of it as if the drop of oil, it's as if they're behaving in this manner?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.743,
    "end": 1751.068,
    "text": "Or are we committed to some notion, of course, the external and the internal states,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.386,
    "end": 1757.194,
    "text": " but they are maximizing its model evidence, it actually is sensing and it is being active.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.254,
    "end": 1765.546,
    "text": "So where is the kind of dividing line here between sort of sentience and non-sentience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.626,
    "end": 1770.874,
    "text": "And to what degree, if there is one, is it just that the drop of oil basically exists?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1771.575,
    "end": 1777.984,
    "text": "It just seems to be maximizing its model evidence, but there's no real telos to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.538,
    "end": 1785.038,
    "text": " Yeah, because the action here, the act of inference seems to me to be very highly linked to sentience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1786.739,
    "end": 1789.502,
    "text": " Yeah, great, great questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1789.783,
    "end": 1801.316,
    "text": "Well, one angle is an instrumentalist goes into that area without feeling like they're taking on descriptions, like it's a sentient as they extract the signal of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.476,
    "end": 1816.273,
    "text": "So it's very like relational or sort of like perspectival view on sentience, whereas somebody taking on more ontological commitments would say that they are exploring or characterizing the true nature of sentience or intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1816.253,
    "end": 1821.822,
    "text": " Here's a really early 2006 or so image from a Friston paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1821.862,
    "end": 1824.065,
    "text": "This is the winged snowflake.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1824.807,
    "end": 1830.215,
    "text": "And it's like systems that persist conditioned on seeing this snowflake.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1830.656,
    "end": 1843.797,
    "text": "It's not conditioned upon all possible, you know, a room that's 100 degrees C. Conditioned on seeing this snowflake, there's going to be snowflakes that through wind blowing them around,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1843.945,
    "end": 1852.978,
    "text": " So just doing no better than you'd expect from the wind currents or doing better than the wind currents, they preclude phase transition of melting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1853.258,
    "end": 1855.641,
    "text": "Once they cease to exist, then they cease to exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1856.282,
    "end": 1856.903,
    "text": "So that's like one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1857.063,
    "end": 1862.01,
    "text": "And then because you asked about how to describe these simple systems too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1862.851,
    "end": 1873.446,
    "text": "And then this path integrals paper made the clearest taxonomy of systems from inert systems where like some of these nodes are trivial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.215,
    "end": 1880.4,
    "text": " So some of these nodes can be trivial or null in effect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1881.401,
    "end": 1885.305,
    "text": "And that's what gives the ability to model a really simple system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1887.468,
    "end": 1900.581,
    "text": "But then the composability of the Bayesian graph format allows the construction of also more sophisticated cognitive models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1902.603,
    "end": 1916.094,
    "text": " all keeping the Markov blanket condition, because you could have internal states could just be like a pass through, or you could like imagine they functionally didn't exist, or it could just, it could be this, or it could be that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1917.075,
    "end": 1918.096,
    "text": "Andrew?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1920.958,
    "end": 1932.508,
    "text": "I just wanted to add to that, that, I mean, in the chapter itself, later on, I guess, section 3.6, page 56, they attempt to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1933.045,
    "end": 1939.937,
    "text": " kind of provide their own answer to the distinction between like a sentient or perhaps non sentient.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1940.558,
    "end": 1957.787,
    "text": "Organism and they just say this is one answer so not you know, an exhaustive answer to the question, but like having the capacity for like for an organism to have the capacity to model alternative futures and to have that level of temporal depth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1958.122,
    "end": 1977.666,
    "text": " um that that's one answer that makes sense to me and thinking about like the drop of oil in the water like perhaps it is you know it's reacting to something like sensory input and acting but nonetheless like i can't imagine that the the oil is you know anticipating future",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1978.253,
    "end": 2004.936,
    "text": " um you know sensory information and and coming up with its own representation of the proper action to take in the future and what it should be moving towards so that's kind of how i viewed you know a way of deriving an answer for the sentience versus non-sentience question yeah cool thought and yeah",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2005.169,
    "end": 2026.073,
    "text": " like an inner object or even a simple active object may not provide any evidence, like you don't need to appeal to any counterfactual generation in order to explain even potentially lifelike behavior in certain, you know, basal cognitive behavior may not need explicit entertaining of alternatives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2027.334,
    "end": 2027.715,
    "text": "Wanshan?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2028.736,
    "end": 2033.201,
    "text": "Yes, I have the question about the figures, about the direction of the arrows.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2033.421,
    "end": 2034.923,
    "text": "Can you go back to the figures?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2042.8,
    "end": 2043.281,
    "text": " Ming Lei, Ph.D.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2043.221,
    "end": 2043.841,
    "text": ": Figure 3.1 right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2043.861,
    "end": 2049.168,
    "text": "Ming Lei, Ph.D.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2049.148,
    "end": 2049.449,
    "text": ": So.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2050.29,
    "end": 2050.81,
    "text": "Ming Lei, Ph.D.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2050.79,
    "end": 2060.283,
    "text": ": If you're looking here, there are on the upper right, there is a two direction figure between active states and internal states.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2061.084,
    "end": 2062.506,
    "text": "Ming Lei, Ph.D.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2062.486,
    "end": 2071.137,
    "text": ": What i'm thinking is that the internal state will affect the active states right, so what action you take depends on your internal state.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2072.163,
    "end": 2075.707,
    "text": " but how does active state actually change the internal states?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2079.953,
    "end": 2081.114,
    "text": "So- Does anyone want to directly?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2081.214,
    "end": 2083.137,
    "text": "Yeah, yeah, totally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2083.177,
    "end": 2095.592,
    "text": "The internal states will be affected by your sensory states, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2096.233,
    "end": 2098.456,
    "text": "This isn't what does happen in a given model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2099.297,
    "end": 2101.9,
    "text": "This is what can happen",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2102.082,
    "end": 2125.592,
    "text": " in one arrangement of an abstract base graph so don't connect it to the actual structure of causality even in the world this is just saying this is like a template sketch of a cybernetic agent with and what's mainly ruled out are the telepathy and telekinesis",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2125.572,
    "end": 2153.385,
    "text": " and the other one that you can think of as ruled out instead of asking why this is too edged in principle what's ruled out backwards causation of action we want to be entirely in control of action and backwards causation of sense states we don't want to have our thumb on the scale so there's just many many ways to think about it and in any actual modeling situation this level of abstraction is not engaged with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2153.922,
    "end": 2162.017,
    "text": " it becomes a lot clearer when you're talking about specific functions describing different states in a specific system of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2162.038,
    "end": 2162.378,
    "text": "Young-Hoon?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2164.402,
    "end": 2176.926,
    "text": "Oh yeah, it's a totally different question, but like considering the reinforcement learning, sometimes when you sample a lot of sequences and then like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.142,
    "end": 2189.312,
    "text": " There are some models like Thomann-Eichenbaum machine or successor representation, which actually updates the state to state transition based on the experience that you had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.528,
    "end": 2201.1,
    "text": " Um, it, it, even though you don't really perceive additional information, you can update the transition metrics based on your memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.12,
    "end": 2207.567,
    "text": "So you replay and playback the memory and it actually updates your, um, internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.647,
    "end": 2216.076,
    "text": "So, uh, considering that fact, um, where should be, where should we put the memory replay in that figure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.228,
    "end": 2227.576,
    "text": " Is it like, do we have to say that the memory replay is some kind of action or is there another alternative solution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.399,
    "end": 2231.36,
    "text": "Great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.262,
    "end": 2238.887,
    "text": "I'll just try to set it up indirectly because I think it's a real direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2238.947,
    "end": 2248.577,
    "text": "There's going to be kind of two ways, main families of ways of representing a cybernetic agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2249.165,
    "end": 2271.561,
    "text": " that we're going to see one of them is this Markov blanket type so here it's like a very physics based that's why we're coming from the high road with the free energy principle because it starts from this kind of like flow of physics space the other representation which we saw in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.469,
    "end": 2279.379,
    "text": " chapter two and gets used in chapter four and so on is this Bayesian generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2279.459,
    "end": 2295.403,
    "text": "But like, you don't see the internal, external and blanket states, though here's different notation, but they're both ostensibly about the same active inference agent, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2295.503,
    "end": 2298.207,
    "text": "Where one can view the observations here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2301.038,
    "end": 2329.628,
    "text": " as the sensory states and then one can understand that the actions taken have causal impact on the world but that's reflected by the b matrix and learning on the b matrix learning how actions are associated with changes in the world so when it's coming more from like a high road perspective that's more in the physics and that's where you see more of the physics type formalisms",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2330.958,
    "end": 2357.083,
    "text": " and then in more of the um uh decision making and signal processing area from the low road that's where we see more of these like just um not physics based in principle Bayesian methods there's probably a lot more to say about that in other ways to say it but um like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2358.177,
    "end": 2362.204,
    "text": " This representation is about a cybernetic agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2364.227,
    "end": 2367.292,
    "text": "Also, this representation is about a cybernetic agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2368.634,
    "end": 2373.462,
    "text": "And they meet in active inference where those models have some relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2377.749,
    "end": 2377.95,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2380.193,
    "end": 2383.138,
    "text": "Figure three point or does anyone else want to make a comment or question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.426,
    "end": 2395.797,
    "text": " Steve Grafton, I wanted to just follow up on that note, so we look at equation 3.2 very similar to equation 2.5 except in 3.2.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2395.817,
    "end": 2401.884,
    "text": "Steve Grafton, variational free energies contingent on a model.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2403.686,
    "end": 2412.396,
    "text": "Steve Grafton, So i'm trying to relate that with the previous comment about the cybernetic unit in the mark off blanket is that related to the model.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2413.817,
    "end": 2415.319,
    "text": "Steve Grafton, The contingent model.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2416.244,
    "end": 2437.155,
    "text": " yeah exactly so free energy like expected free energy variational free energy it's a quantity about a model like sum of squares is a quantity about a given linear regression that you might do as like an error term if you're fitting a regression",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2438.249,
    "end": 2443.817,
    "text": " variational free energy is like an error term that is about a specific model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2443.837,
    "end": 2449.786,
    "text": "I mean, if you put another node, you made a different model, the free energy would be a different number.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2450.887,
    "end": 2457.597,
    "text": "If you didn't have a model, a map, then you can't calculate a free energy for a model that doesn't exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2458.799,
    "end": 2460.802,
    "text": "So it's a descriptor of a map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2461.583,
    "end": 2464.948,
    "text": "So everything is really conditioned upon",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2466.346,
    "end": 2489.957,
    "text": " the parameters and the values that are in that specific model that that is yeah Darius yeah um just maybe a point of clarification for myself I presume it can't be entirely internalist um because at least just like looking at the KL divergence in the equation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.376,
    "end": 2503.39,
    "text": " the difference between the approximate posterior and the true posterior requires some commitment to there being an external state that you're trying to predict um so where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2504.433,
    "end": 2526.079,
    "text": " Is that just, you've got the variational model, so you've got the variational free energy, which is tied to your model, but ultimately it's also subserved by the fact that you are an agent in the world and that you're making Bayesian inferences about the world and it can be closer to the real world state or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.46,
    "end": 2528.382,
    "text": "I just don't know if I've got that the right way around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.804,
    "end": 2546.1,
    "text": " yes that's true and the kale divergence gives us this optimizable incremental way to update our beliefs cue",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2547.7,
    "end": 2568.658,
    "text": " to bring them to where they aren't moving anymore, just as a first approximation, where we can't believe any better about perception or action or cognition with respect to, as you pointed out, the underlying true distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2569.559,
    "end": 2576.425,
    "text": "But this can be understood in practice as just not wanting to update your belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2579.678,
    "end": 2601.687,
    "text": " and achieving preferred states which is the maximum evidence model for the incoming data if you literally knew where what photons were going to come at you next and that is um minimized surprise",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2603.354,
    "end": 2611.984,
    "text": " So this is kind of just like these three parts, they're being equated here, but they're different framings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2612.124,
    "end": 2617.15,
    "text": "This is saying, this is the most performant model, best model evidence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2618.311,
    "end": 2620.674,
    "text": "This is the least surprising model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2622.216,
    "end": 2624.759,
    "text": "If you knew how much to be surprised, you would have the best performing model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2626.4,
    "end": 2630.425,
    "text": "This is a well-understood relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2632.531,
    "end": 2650.579,
    "text": " This is saying because of how free energy is defined, which isn't invented by active inference, look up energy-based method or evidence lower bound, this quantity is tractably optimizable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.362,
    "end": 2654.826,
    "text": "And if we can reduce the divergence,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2656.156,
    "end": 2660.903,
    "text": " where there's the KL diversions shrinking, will be doing strictly better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.183,
    "end": 2667.633,
    "text": "That doesn't mean good enough necessarily, but strictly better towards this situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2668.334,
    "end": 2668.714,
    "text": "Wanshun?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.796,
    "end": 2673.882,
    "text": "Yes, I have the question about this model concept.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2674.422,
    "end": 2679.65,
    "text": "Does the model refer to all those dynamic equations in figure 3.1?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2681.212,
    "end": 2683.075,
    "text": "What do we mean by model here?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2687.071,
    "end": 2712.538,
    "text": " here yeah yeah the model we have about how wire generated so so it could relate to everything in in figure 3.1 including like the the because why is generated based on your internal state based on external state right also it's also affected by the x active state yeah um yeah",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2713.042,
    "end": 2734.813,
    "text": " if you had the total understanding of what photons would come next including how the world changes and how your action influences it that's the this is like an agent level loss function for understanding how wire generated but you could use energy-based methods on any bayesian distribution",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2735.35,
    "end": 2744.102,
    "text": " But this is just introducing an important relationship amongst surprise minimization equals model evidence maximization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2745.203,
    "end": 2746.105,
    "text": "That's the first part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2746.906,
    "end": 2758.962,
    "text": "And variational free energy is a well-used method to tractably optimize this interface.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2759.785,
    "end": 2760.546,
    "text": " Right.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2760.566,
    "end": 2765.294,
    "text": "So 3.2 QX is a decision variable.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2765.314,
    "end": 2770.843,
    "text": "So to minimize, I mean, or to maximize, you want to minimize, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2771.524,
    "end": 2773.568,
    "text": "QX is the total beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2774.149,
    "end": 2775.411,
    "text": "Those are the beliefs that we control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.012,
    "end": 2782.182,
    "text": "But take it again from just this level of the high road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2784.001,
    "end": 2789.769,
    "text": " So not explicit counterfactuals yet, just flow across these four states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2795.536,
    "end": 2802.926,
    "text": "So the generation of Y actually are connected in all those four equations or four states, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2802.946,
    "end": 2804.849,
    "text": "How those four states are changed.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2806.11,
    "end": 2810.136,
    "text": "How those four states changes.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2810.336,
    "end": 2812.759,
    "text": "So M refers to all the...",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2813.887,
    "end": 2840.637,
    "text": " on the this process how this process are described yeah M could be a linear regression and Y would be the data and then we'd say the surprise is minimized the evidence is maximized and the variational free energy is minimized when we have the model in the data and the model is as good as it can be for the data so it's the exact same thing like the two pieces that come into play here are the model and the data",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2841.629,
    "end": 2841.969,
    "text": " Right.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2842.19,
    "end": 2844.952,
    "text": "So, so the decision is your QX, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2844.972,
    "end": 2846.113,
    "text": "So it's a function.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2846.233,
    "end": 2847.414,
    "text": "It's not just the decision though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2849.016,
    "end": 2854.801,
    "text": "QX refers to all of the optimizable beliefs, not just about action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2856.142,
    "end": 2856.422,
    "text": "All right.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2856.442,
    "end": 2864.75,
    "text": "So it's, I mean, I mean, it's, it's a, that is, it's a belief that you, you may choose to minimize your total surprise, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2864.77,
    "end": 2867.132,
    "text": "Or to minimize your variation of free energy.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2868.353,
    "end": 2869.594,
    "text": "So am I all,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2870.502,
    "end": 2878.272,
    "text": " QX, you choose one to minimize this expression on the right side of 3.2.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2881.096,
    "end": 2881.676,
    "text": "Is that right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2884.039,
    "end": 2887.223,
    "text": "So QX, what is X here?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2887.504,
    "end": 2891.549,
    "text": "X, does it refer to the internal state of their mind?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2893.151,
    "end": 2894.252,
    "text": "X is the external states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2896.936,
    "end": 2900.34,
    "text": "Those are the hidden causes about how Y are generated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2901.029,
    "end": 2908.146,
    "text": " Figure 3.1x, external states, how sensory causes are generated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2908.867,
    "end": 2909.89,
    "text": "No thumb on the scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2910.932,
    "end": 2914.38,
    "text": "Only the external world causes sensory states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2914.985,
    "end": 2928.417,
    "text": " So the generative model of sensory states being produced as they are, maximize your evidence about incoming data, minimize your surprise about incoming data, minimize your variational free energy about incoming data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2929.277,
    "end": 2932.82,
    "text": "All of those are causal modeling of external states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2934.061,
    "end": 2939.046,
    "text": "Analogously to how internal states are like doing that for action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2939.846,
    "end": 2944.03,
    "text": "Because which one you call internal and external, you could flip and do the other one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2944.853,
    "end": 2955.194,
    "text": " At this level of generality, not when you actually build a model, but this is there's there's still nothing that's really fundamentally different between internal and external.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2956.357,
    "end": 2959.283,
    "text": "Other than which side the modeler chose to do internal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.846,
    "end": 2961.327,
    "text": "There is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.922,
    "end": 2965.524,
    "text": " This will be my final question, I promise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.105,
    "end": 2972.816,
    "text": "I just wanted to ask about the kind of architecture of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.677,
    "end": 2980.007,
    "text": "So the agent is constituted by the internal states and the Markov blanket and the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.987,
    "end": 2996.292,
    "text": " this was in Ben White's talk as well, this point of potential conflict or confusion that the agent has a generative model or the agent is a generative model, and that generative model has priors based on its optimism bias of the preferred states, the attractive states it wants to be in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3000.959,
    "end": 3007.429,
    "text": "Can we consider the generative model, therefore, the internal states which are encoding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.067,
    "end": 3010.995,
    "text": " beliefs about the world and the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.619,
    "end": 3018.674,
    "text": "And in that case, how could you say, if it is that, why would you say that the agent has a generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.775,
    "end": 3024.81,
    "text": "And if you do hold that claim, what's extra about the agent beyond the generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.22,
    "end": 3028.882,
    "text": " Yeah, those are great questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3029.523,
    "end": 3035.452,
    "text": "Well, what's extra about a person beyond their health record, which you do a linear regression on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3036.073,
    "end": 3037.796,
    "text": "I mean, the territory itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3038.136,
    "end": 3042.383,
    "text": "So that's the instrumentalist answer is this is all just about the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3042.403,
    "end": 3045.207,
    "text": "We're just talking about base graphs and statistics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3045.227,
    "end": 3047.31,
    "text": "So we're obviously talking about maps, not territories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.931,
    "end": 3051.336,
    "text": "So that's, again, trying to take on minimal commitments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3051.396,
    "end": 3056.063,
    "text": "But the question about like, does it have a generative model or is it a generative model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3056.043,
    "end": 3060.71,
    "text": " Well, if you're talking about a software agent you designed, they might be the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.05,
    "end": 3065.978,
    "text": "You might say it literally does active inference because I actually have it implementing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3066.138,
    "end": 3066.819,
    "text": "Here's the script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3067.68,
    "end": 3079.738,
    "text": "But if it isn't literally slash actually an active inference simulation, it seems like you're going to be in the situation described in figure 9.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3080.647,
    "end": 3089.019,
    "text": " So here you're building, this is the figure 4.3 generative model for the subject of a behavioral experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3089.039,
    "end": 3090.16,
    "text": "That's why it's subjective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3090.701,
    "end": 3098.231,
    "text": "It's their perspective as the mouse in the maze or whatever, but it's also like they are subject to the behavioral experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3098.852,
    "end": 3100.154,
    "text": "And then here's the outer loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3103.539,
    "end": 3106.603,
    "text": "So would you say that the mouse is subjective?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3106.702,
    "end": 3109.885,
    "text": " the cognitive model that the researcher made?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.506,
    "end": 3111.087,
    "text": "Probably not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3112.008,
    "end": 3115.952,
    "text": "So in practice, a lot of this like metaphysics doesn't come into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3116.513,
    "end": 3132.81,
    "text": "When you're talking about a specific generative model, it's a lot clearer that it's just like a very hopefully well designed, but just a reduced model of the system of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3135.912,
    "end": 3142.46,
    "text": " Chapter 9 is about this kind of empirical modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.48,
    "end": 3143.762,
    "text": "Minky?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3148.548,
    "end": 3149.569,
    "text": "Oh, I cannot hear you, actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3161.424,
    "end": 3162.125,
    "text": "Can you hear me now?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3162.365,
    "end": 3163.607,
    "text": "Yeah, yeah, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3163.975,
    "end": 3164.636,
    "text": " Okay, great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3165.316,
    "end": 3167.399,
    "text": "No, I have a question that's very much related to that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3167.439,
    "end": 3179.232,
    "text": "I think there are lots of sort of general comments about the systems to which we can apply active inference and what sort of the specific formal criteria are to describe a system as adaptive.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3181.334,
    "end": 3186.54,
    "text": "And I'm also very much interested in these philosophical perspectives and seeing sort of how",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3187.162,
    "end": 3216.021,
    "text": " um in which sense you can view could view a whole organism um as um as sort of following the principles that specify by active inference or in which sense you could sort of use active inference to describe maybe um systems that are lower um lowering within that hierarchy that are maybe like um smaller regulatory systems in the body",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3216.44,
    "end": 3219.006,
    "text": " So I was just wondering if there's any.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3220.89,
    "end": 3228.407,
    "text": "yeah sort of research on sort of the general applicability of active inference as sort of a way to analyze adaptive systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3229.309,
    "end": 3234.06,
    "text": "And I think it all comes down to the mathematics which I don't fully understand yet but.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3237.77,
    "end": 3251.732,
    "text": " Oh awesome question that's very cool one direction of research that comes to mind is like here's a 2019 paper so there's been a lot since then, and a lot more integration with with active inference to but.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3253.074,
    "end": 3257.882,
    "text": "Some of these representations of multi scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3259.344,
    "end": 3260.065,
    "text": "systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3261.58,
    "end": 3289.596,
    "text": " nested systems so being able to um unlike chapter five in the textbook there's going to be like a motor circuit that's influenced by a higher order decision making um circuit so then you you maybe you've been be able to to sketch out some of those lower level units okay what which paper was this again i'll put it into the um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3290.521,
    "end": 3320.258,
    "text": " put it into the chat thank you all right well cool um about chapter three i guess if uh next week or in in yeah next week at the other time we'll come back and if people can have added or voted on different questions and we'll talk more about the questions next week so thank you see you all thank you daniel",
    "speaker": "SPEAKER_03"
  }
]