[
  {
    "start": 7.403,
    "end": 8.063,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.143,
    "end": 11.844,
    "text": "Welcome to the Active Inference Lab, the Active Inference Livestream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.124,
    "end": 18.446,
    "text": "Today it is Active Inference Livestream 15.0, and it is January 27th, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.966,
    "end": 22.207,
    "text": "Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.827,
    "end": 28.189,
    "text": "We are an experiment in online team communication, learning, and practice related to Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.749,
    "end": 35.491,
    "text": "You can find us at our website, Twitter, email, YouTube, Keybase team, also with the Discord now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.214,
    "end": 42.953,
    "text": " And this is recorded in an archived live stream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.948,
    "end": 46.529,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.549,
    "end": 60.357,
    "text": "And this is going to be fun because it's a dialogue, which I'm not sure if it's a format we've tried before, but we'll abide by good video chat etiquette with Blue and I. So just to introduce ourselves before we jump into everything, I'm Daniel Friedman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.817,
    "end": 66.0,
    "text": "I'm a postdoctoral researcher in Davis, California, and I'm an insect biologist mostly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.16,
    "end": 67.121,
    "text": "What about yourself, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.479,
    "end": 69.4,
    "text": " My name is Blue Knight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.66,
    "end": 76.386,
    "text": "I am an independent research consultant based out of New Mexico, and my background is mostly in neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.307,
    "end": 77.607,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.827,
    "end": 80.029,
    "text": "Well, this is going to be a fun conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.19,
    "end": 87.315,
    "text": "These conversations are related to the Active Inference live stream group discussions that we do regularly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.516,
    "end": 91.519,
    "text": "And these discussions are every Tuesday from 7 to 9 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.619,
    "end": 91.94,
    "text": "Pacific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.6,
    "end": 95.723,
    "text": " And if you go to this red link, you'll find a spreadsheet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.264,
    "end": 102.129,
    "text": "And the spreadsheet shows the two participatory group discussions that we spend the time on with each paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.59,
    "end": 105.353,
    "text": "And so for February 2nd and 9th, 2021, for ACT-Infostream 15.1 and 15.2,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.096,
    "end": 137.992,
    "text": " we're going to be talking about this paper that we're going to discuss in 15.0 with a bigger group as well as with the authors in s and thomas so this is going to be a cool opportunity to hear a lot of perspectives of people who are just learning and also have the authors on for some long-form discussions with time to digest so the dot zero videos which is what this video is has the goal of setting the context for these group discussions because these are research papers and they're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.672,
    "end": 142.696,
    "text": " basically the form of the ideas as they're being worked with by researchers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.017,
    "end": 147.521,
    "text": "So it is something that might take a lot of background reading or thinking about to catch up with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.882,
    "end": 157.192,
    "text": "So the goal is maybe these videos in the dot zero can prepare someone to feel more comfortable participating in point one or point two, even participating as a listener.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.191,
    "end": 168.037,
    "text": " So, the paper we're going to be discussing for today and for the next two weeks is called Free Energy, Principle, Computationalism, and Realism, a Tragedy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.837,
    "end": 173.079,
    "text": "It's by Thomas Van Ness and Ines Hipolito, and the link is provided here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.68,
    "end": 177.162,
    "text": "The video is just an introduction to the context of the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.282,
    "end": 182.324,
    "text": "It's not a review or a final word, especially if you knew how much time we spent preparing for this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.545,
    "end": 191.377,
    "text": " And the punchline of the paper, if we could put it this way, is that realism is a tragedy and instrumentalism is no joke either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.218,
    "end": 194.361,
    "text": "The sections of today are going to go as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.642,
    "end": 198.067,
    "text": "In the introduction, we're going to go through the aims and the claims of the papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.968,
    "end": 220.917,
    "text": " then the keywords the abstract and the roadmap then there's one figure one table and a few key topics and quotations that really stand out as far as summarizing some of the bigger ideas that we've been talking about but also really crystallizing the arguments of the paper so good things to catch on to if you didn't highlight it or draw a circle around it when you were reading it earlier",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.952,
    "end": 241.524,
    "text": " then we'll close with a couple questions that we had just while making the slides and these aren't ones that we're going to address today but there are things that we're curious to hear what people think about and what other questions and methods they connect them out to so in 15.1 and point two we're going to be discussing this very same paper so just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.384,
    "end": 252.35,
    "text": " Submit your questions through the live chat or through YouTube comment or Twitter, however, and then if you want to participate live in these or a future discussion, then you're welcome to join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.37,
    "end": 255.331,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.292,
    "end": 258.813,
    "text": "So let's talk about the aims and the claims of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.074,
    "end": 266.978,
    "text": "Blue, do you want to start by saying anything about just your broad overview of what you thought about the aims and claims before we read some of the quotes from them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.989,
    "end": 269.95,
    "text": " Just that I liked the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.97,
    "end": 278.297,
    "text": "I thought it was really well written and made the FEP very approachable for a variety of different backgrounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.398,
    "end": 281.76,
    "text": "And I can read some of these off if you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.88,
    "end": 292.99,
    "text": "So the first aim is according to predictive processing theories, the generative model is literally implemented by a human brain to calculate the potential states of the environment, termed a realist approach,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.45,
    "end": 303.254,
    "text": " whereas other approaches take it to be an insightful statistical description that a non-scientifically trained organism has no access to, termed an instrumentalist approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 304.554,
    "end": 320.841,
    "text": "In this paper, we shall engage with both debates and argue that the representationalism debate is not relevant to the FEP, and realism is doomed to fail regardless of whether it is representationalist or not, and conversely, instrumentalism can thrive either way, or so we shall argue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.718,
    "end": 323.099,
    "text": " Thank you for reading it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.319,
    "end": 338.233,
    "text": "So it's saying this first selection is kind of laying out the spectrum or the battlefield or the continuum of approaches or understandings, whether we take the FEP to be more realist or more instrumentalist, and we're going to go into a lot more detail about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.913,
    "end": 363.062,
    "text": " and in the middle quote they basically write that this representationalism debate is important but it's not relevant to this realist instrumentalist contention which we're going to graphically see soon and then their conclusion is represented in the third part and their conclusion is that realism is doomed to fail independent of the representationalist question and instrumentalism can work so those are the aims and claims and the way that we're going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.542,
    "end": 374.679,
    "text": " understanding the paper's meaning and whether or not it makes sense or lives up to its claims so to understand whether it lives up to its claims and to understand how those implications would",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.95,
    "end": 397.184,
    "text": " be in our own lives as well as in the broader literature we kind of have to understand where this paper is situated so what is it related to what other areas of research is it going to be citing what else is it discussing in common with other areas so we know that this is a free energy principle related paper but also the keywords of the paper were provided as scientific models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.146,
    "end": 401.029,
    "text": " representationalism, realism, and instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.43,
    "end": 404.393,
    "text": "So these are some of the main keywords that we're going to be talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.954,
    "end": 412.342,
    "text": "And the goal of these keywords, which is just, again, you could take a course or do so much independent research on any of these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.742,
    "end": 413.423,
    "text": "So we're just going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.284,
    "end": 422.248,
    "text": " broadly going over these few different keywords, just very at the surface layer, but picking out a few good examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.768,
    "end": 438.616,
    "text": "And that's just to connect the Active Inference ideas and research community out with other areas that might be useful for applications or for insights, and then also provide accessible on-ramps into Active Inference for those who might be familiar with one of these keywords, but not with Active Inference itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.875,
    "end": 442.457,
    "text": " So first is the scientific models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.218,
    "end": 448.243,
    "text": "So scientific models, Blue, how would you describe a scientific model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.563,
    "end": 459.313,
    "text": "Because I was almost just tabula rasa with looking up images on image searches, because like, how does one go about saying what a scientific model is or how does it play out for you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.515,
    "end": 471.084,
    "text": " So a couple of things that I always think about when I think of a scientific model is the quote from George Box that all models are wrong, some are useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.024,
    "end": 477.529,
    "text": "And then I always go back to the book that I read that was a compilation called The Map is Not the Territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.329,
    "end": 486.176,
    "text": "And so this really plays out in the way that in constructing a model, what we are doing is essentially building a map, whether it's a map of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.676,
    "end": 492.599,
    "text": " you know, gene states or regulatory patterns or neural coding or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.659,
    "end": 499.243,
    "text": "It's a map and it's not ever directly the territory because if the map was the territory, it would not be useful, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 499.423,
    "end": 504.926,
    "text": "So you need to have like, so there has to be some dimension reduction in a scientific model, but not too much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.126,
    "end": 509.768,
    "text": "Otherwise it's overly simplistic and doesn't encompass all of the potential variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.848,
    "end": 512.53,
    "text": "So that's what modeling like really brings up for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.539,
    "end": 513.799,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.919,
    "end": 518.282,
    "text": "And there's a Borges story about the map that just pastes over everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.342,
    "end": 522.024,
    "text": "It goes into people's lungs and it kind of becomes one-to-one with the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.084,
    "end": 523.785,
    "text": "And then, you know, is it the real world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.105,
    "end": 532.529,
    "text": "So we're dealing with not that situation, but we want to be talking about things that we care about and want to explain, predict, design, control, perturb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.85,
    "end": 534.07,
    "text": "We want to be useful in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.51,
    "end": 541.034,
    "text": "So we want to generalize from our experiences and look at empirical observations in a way that's nuanced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.074,
    "end": 542.715,
    "text": "So that's kind of scientific modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.175,
    "end": 557.153,
    "text": " And if you look on search engines or in the Stanford Encyclopedia of Philosophy, you could get a few different distinctions like physical models, the kind of thing that a artist might use as a template, like a torso with some clothing on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.753,
    "end": 561.678,
    "text": "And then mathematical models, which are the kind that we're going to be talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.72,
    "end": 569.288,
    "text": " But also there might be qualitative models or models that don't use mathematical symbols, but are still conceptual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.829,
    "end": 579.321,
    "text": "So in the Stanford Encyclopedia of Philosophy, just table of contents at the sort of overview layer, we can see that there's several ongoing related fields of philosophy that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.282,
    "end": 590.293,
    "text": " talking about scientific modeling, ontology, what are models, epistemology, how do we learn about models, what do they do for us cognitively, and then how do we think about different kinds of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.733,
    "end": 596.299,
    "text": "And Mel Andrews's paper in Actim Stream 14 discussed a lot of these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.0,
    "end": 600.222,
    "text": " So let's talk about the scientific models of a few different types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.702,
    "end": 608.046,
    "text": "And this is pretty central to the discussion of paper today, which is the descriptive of scientific models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.086,
    "end": 612.969,
    "text": "We're talking about family of models, and you have the taller and the shorter within the family.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.249,
    "end": 618.512,
    "text": "So now we're going to talk about the more realism or more instrumentalism in terms of scientific models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.373,
    "end": 622.375,
    "text": "So, Blue, do you want to read the paragraph?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.038,
    "end": 623.338,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.678,
    "end": 650.595,
    "text": "Realism and instrumentalism here concern the models and statistical manipulations that make up the FEP and whether they are thought to be used and manipulated by the systems under scrutiny, independent of scientific inquiry, which is REA, or conversely, whether they are thought to be scientific tools wrought by humans in specific sociocultural environments to study particular systems, which is INS, with REA being realism and INS being instrumentalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.277,
    "end": 651.497,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.737,
    "end": 658.2,
    "text": "So there's a continuum from extreme realism with a RIA acronym to extreme instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.56,
    "end": 665.122,
    "text": "And then in the middle, you could imagine is something that draws insights or tries to be sort of like a compromise between the positions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.463,
    "end": 672.365,
    "text": "But we could ask whether a theory or whether a model were more amenable to one of these sides or another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.805,
    "end": 679.148,
    "text": "And the archetypal realist theory is saying that the model is what the system is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.468,
    "end": 693.22,
    "text": " So let's think if you had a pendulum, and your model had a gravity, force, and a hinge, and you might say, although these are just parameters with the angle and the force of gravity and the weight of the pendulum, it actually has a natural interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.24,
    "end": 698.905,
    "text": "I don't know, and I don't want to go too down the rabbit hole with what's realist or what's real, because...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.505,
    "end": 706.593,
    "text": " Blue, you know that it's an open-headed question, but the instrumentalist one would be more like I'm modeling the stock market.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.873,
    "end": 708.875,
    "text": "And so I'm going to model it like a pendulum with a weight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.436,
    "end": 714.021,
    "text": "And in that case, you wouldn't be saying the same kind of claim about the pendulum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.501,
    "end": 720.187,
    "text": "So if you have a full model of what you think is actually happening out there, it's more realistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.908,
    "end": 722.609,
    "text": " And that doesn't mean it's more accurate per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.649,
    "end": 724.409,
    "text": "It doesn't mean that it's cheaper to run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.429,
    "end": 727.65,
    "text": "It's always in balance with a lot of other features of modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.07,
    "end": 732.291,
    "text": "But this realist instrumentalist aspect has big implications for the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.431,
    "end": 737.833,
    "text": "But we're just bringing it up in the context of what the idea is by itself for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.153,
    "end": 740.314,
    "text": "And then we're going to connect it to the FEP with the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.774,
    "end": 741.594,
    "text": "Anything else to add there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.018,
    "end": 754.781,
    "text": " Just like in the author's interpretation of realism, or at least what I interpreted that the authors interpreted, the realism viewpoint or stance is actually, it seems very mechanistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.841,
    "end": 758.802,
    "text": "Like in science we're always, or especially in biology, like what is the underlying mechanism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.882,
    "end": 763.003,
    "text": "Instead of like building a big model, we're like, where is the, how does it work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.143,
    "end": 766.264,
    "text": "And so this realism claim is actually, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.244,
    "end": 769.525,
    "text": " it says that this is actually the mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.585,
    "end": 772.026,
    "text": "The model is the way that it is working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.506,
    "end": 787.932,
    "text": "So, you know, I think about gene regulatory networks and some things that might be amenable to that kind of like realistic representation as opposed to instrumental, which, you know, like there's a useful, you know, like a model of the stock market or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.752,
    "end": 788.972,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.953,
    "end": 792.234,
    "text": "So let's talk about this other axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.474,
    "end": 798.018,
    "text": "So we had sort of one continuum that categorizes or describes kinds of scientific models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.658,
    "end": 800.92,
    "text": "And then here is going to be another axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.06,
    "end": 805.903,
    "text": "And we're putting them orthogonal or just at 90 degree angles to each other because you could kind of pick and choose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.023,
    "end": 807.404,
    "text": "We're going to see how that plays out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.944,
    "end": 813.268,
    "text": "And this is a debate or a continuum known as representationalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.188,
    "end": 824.919,
    "text": " And it's related to a lot of other topics, and in earlier discussions with Alex Kiefer, with Maxwell, with others, we've broached this idea of what is a representation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.439,
    "end": 831.525,
    "text": "Is a representation mean that it has to be inside of the organism, or can it be a distributed representation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.545,
    "end": 831.605,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.507,
    "end": 840.891,
    "text": " That's kind of, again, what we're locking in on with this question is what exactly is a representation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.231,
    "end": 852.476,
    "text": "And does the theory highlight aspects of the world that are like representations, like a specific pattern of neural firing or a specific compound that signals or represents alarm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.657,
    "end": 856.738,
    "text": "Or do people take non-representationalist stances?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.518,
    "end": 862.721,
    "text": "Blue, what would you say is differentiating or relevant or what's on the table with this debate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.2,
    "end": 869.622,
    "text": " So I feel like I am like personally very, very biased here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.902,
    "end": 878.245,
    "text": "I think, you know, what's on the table is, is there, you know, are we perceiving the object in perception, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.285,
    "end": 887.508,
    "text": "I mean, as a neuroscience background, it's like, are we literally perceiving this orange, which is round, flavorful, juicy, cold, it might be lots of different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.688,
    "end": 890.629,
    "text": "Are we perceiving this orange or are we perceiving",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.289,
    "end": 897.712,
    "text": " whatever our mind represents as this orange, sweet, juicy, brightly colored, flavorful, scented, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.972,
    "end": 902.254,
    "text": "So are we perceiving some representation or actually the orange directly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.434,
    "end": 903.995,
    "text": "So I think that that's the debate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.963,
    "end": 910.647,
    "text": " The good news about this debate is that for this paper, it's going to turn out that we can be agnostic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.087,
    "end": 915.37,
    "text": "So if we're not sure, or we don't know, or we don't even care, it's going to be okay for this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.151,
    "end": 921.474,
    "text": "Let's look at the abstract of the paper with a picture by Sasha in the background of neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.395,
    "end": 923.355,
    "text": " The author is right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.755,
    "end": 929.037,
    "text": "The free energy principle provides an increasingly popular framework to biology and cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.677,
    "end": 942.78,
    "text": "However, it remains disputed whether its statistical models are scientific tools to describe non-equilibrium steady state systems, which we call the instrumentalist reading, or are literally implemented and utilized by those systems, the realist reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.54,
    "end": 948.781,
    "text": "We analyze the options critically with particular attention to the question of representationalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.798,
    "end": 953.651,
    "text": " Okay, blue, and then on the second part to that slide of the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.852,
    "end": 954.233,
    "text": "Can you read it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.952,
    "end": 955.132,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.693,
    "end": 968.461,
    "text": "However, it remains disputed whether its statistical models are scientific tools to describe non-equilibrium steady state systems, which we call the instrumentalist reading, or are literally implemented and utilized by the systems, the realist reading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.661,
    "end": 969.362,
    "text": "Sorry, you just read that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.902,
    "end": 973.504,
    "text": "We argue that realism is unwarranted and conceptually incoherent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.105,
    "end": 978.748,
    "text": "Conversely, instrumentalism is safer whilst remaining explanatorily powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.308,
    "end": 984.412,
    "text": "Moreover, we show that the representationalism debate loses relevance in an instrumentalist reading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.113,
    "end": 990.908,
    "text": " Finally, these findings could be generalized for our interpretation of models in cognitive science more generally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.691,
    "end": 997.154,
    "text": " Ooh, nice abstract and pretty interesting topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.935,
    "end": 1018.109,
    "text": "Let's look at the roadmap to see how do the authors take us from A to Z, and then we're going to go into the figure, the table, and go through a couple of the key quotations where if you read over it and you weren't sure, you know, what were the key turns, the parts on the actual road trip where someone says, make sure to take a left at the red barn or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.249,
    "end": 1021.091,
    "text": "What are the parts where you want to really evaluate these sections",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.491,
    "end": 1022.912,
    "text": " and ask how you feel about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.192,
    "end": 1031.035,
    "text": "So we're looking at the roadmap and it starts with an introduction before jumping right into the free energy principle essentials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.595,
    "end": 1039.559,
    "text": "And I think it will be fun to go over the quotation and the figure there because Blue, I know that you wanted to explain it and think about it in a few new ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.059,
    "end": 1041.18,
    "text": "And then in section three,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.84,
    "end": 1066.703,
    "text": " there's the discussion of representationalism so it starts off by discussing representational realism and then talking about non-representational realism we're going to look at all this quadrants all the two by two soon in table one we see a actual summary of the possibilities the two by two possibilities of instrumentalism versus realism and representationalist or not and then this is brought back to generative models in the free energy principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.364,
    "end": 1078.626,
    "text": " And then section four is sort of a plea for instrumentalism and talks about how independent of whatever we think about representationalism, instrumentalism can work for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.146,
    "end": 1081.987,
    "text": "And then we're going to talk a little bit about what that actually looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.567,
    "end": 1087.248,
    "text": "And then there's a conclusion with some really awesome philosophical and broader points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.788,
    "end": 1089.629,
    "text": "Any thoughts or comments on the roadmap?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.269,
    "end": 1091.509,
    "text": "No, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.967,
    "end": 1095.13,
    "text": " Let's do free energy principle essentials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.53,
    "end": 1100.636,
    "text": "So the free energy principle, according to the authors, this is the quote, is based on three aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.876,
    "end": 1103.339,
    "text": "Blue, how about go through the three aspects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.359,
    "end": 1104.401,
    "text": "Just what was interesting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.541,
    "end": 1106.083,
    "text": "What did you like about this layout?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.284,
    "end": 1111.608,
    "text": " The first aspect is the observation of self-organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.889,
    "end": 1120.137,
    "text": "And all biological systems are non-equilibrium steady state systems, because if we were in equilibrium, we would all be dead, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.177,
    "end": 1129.126,
    "text": "So we're maintaining this constant influx and efflux of nutrients and waste and all of the things that are necessary to keep us going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.867,
    "end": 1132.989,
    "text": " And so that is the first aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.029,
    "end": 1139.973,
    "text": "And then the second aspect is that living organisms can be described as stochastic dynamical systems possessing attractors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.413,
    "end": 1143.195,
    "text": "And it talks about gaining energy, which I thought this was cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.215,
    "end": 1145.877,
    "text": "So you have like the Lorenz attractor here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.557,
    "end": 1155.122,
    "text": " And in this space, if you add energy, it brings a different state that the organism can be in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.182,
    "end": 1159.384,
    "text": "So the addition of energy, you can start adding points in this space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1159.764,
    "end": 1164.406,
    "text": "And in infinite entropy, the whole trajectory would be black.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.626,
    "end": 1167.388,
    "text": "You could occupy any point in this phase space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.188,
    "end": 1172.712,
    "text": " So that is the expansion of the phase space by the addition of energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.873,
    "end": 1179.799,
    "text": "And then the reduction of that space is an increase in uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.099,
    "end": 1186.184,
    "text": "Once you start down a developmental trajectory, there's only so many paths you can follow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.545,
    "end": 1192.97,
    "text": "And so your trajectory has been reduced, contracted, your space has been reduced in that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.291,
    "end": 1210.365,
    "text": " And then the third essential point was that the states in which the self-organizing system is at a point in or are in at a point in time can be identified by the interactive role that they play within the multi-level self-organization scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.085,
    "end": 1220.892,
    "text": " And like you know, Daniel, that I'm very interested in the multi-scale possibility of agency and systemness and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.493,
    "end": 1233.722,
    "text": "So at every level, you know, from the molecular level to the cellular level, to the brain, to the organism, to groups of organisms and so forth, I think that that's all, you know, those are all self-organizing systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.279,
    "end": 1235.559,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.02,
    "end": 1238.882,
    "text": "Now, where does the free energy principle come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.242,
    "end": 1240.363,
    "text": "Or where do we go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.443,
    "end": 1244.526,
    "text": "Because those are three of the coolest aspects of complex systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.586,
    "end": 1264.241,
    "text": "It's probably what drew us both to complexity, where we met is through being attracted to these kinds of questions, because it's kind of like a community of people who like topics like self-organization, dynamical systems and chaotic systems, strange attractors, multi-scale systems, emergence, like those are kind of the key pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.941,
    "end": 1274.208,
    "text": " So I like that the FEP starts with, it's being based upon these observations and then it's gonna build on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.869,
    "end": 1279.492,
    "text": "So it's kind of like taking the complexity, not as an endpoint, but as a beginning point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.752,
    "end": 1282.675,
    "text": "So that's one thing that I think is really fun about FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.895,
    "end": 1289.16,
    "text": "So how are we gonna bring FEP into this specific setup as far as, here's what we know that we have to explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.42,
    "end": 1291.381,
    "text": "We don't have to explain a single or a double pendulum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.421,
    "end": 1292.402,
    "text": "We have to explain this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.656,
    "end": 1299.581,
    "text": " Where does figure one come into play in relationship to those aspects or anything else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.199,
    "end": 1301.6,
    "text": " Well, so let me add to this slide first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1301.94,
    "end": 1307.803,
    "text": "So the FEP, where it really comes into play is because it's focused on entropy reduction, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.863,
    "end": 1317.107,
    "text": "It's focusing on the state that the organism assumes is that of the reduced entropy, of the least entropy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.167,
    "end": 1320.869,
    "text": "So it's the minimization of free energy through entropy reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.069,
    "end": 1322.63,
    "text": "So that's that on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.67,
    "end": 1326.952,
    "text": "And then on the next slide, as we get into figure one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.033,
    "end": 1333.037,
    "text": " They talk about the active states and the sensory states of the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.117,
    "end": 1335.959,
    "text": "So this really will go into the free energy equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.039,
    "end": 1339.302,
    "text": "Although the equation is not discussed here, they do discuss some elements of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1340.183,
    "end": 1342.045,
    "text": "So there's internal states of the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.785,
    "end": 1347.331,
    "text": " active states, sensory states and external states of the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.431,
    "end": 1351.356,
    "text": "And so this is like really the patterned activity of every organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.476,
    "end": 1353.098,
    "text": "It's perceived through the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.979,
    "end": 1356.802,
    "text": "The the active states are really what the organism is doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1357.043,
    "end": 1359.586,
    "text": "And then the sensory states are what the organism is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.066,
    "end": 1362.99,
    "text": " And then there's blanket states, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1363.01,
    "end": 1370.861,
    "text": "So the blanket states are all the hidden states of the world, the active states, the noise of the random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.021,
    "end": 1377.67,
    "text": "And this is the internal states and the blanket states go to minimize the free energy, those two things together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.857,
    "end": 1391.852,
    "text": " So this is like how it's a formal way, the free energy is a formal way of measuring the surprise and surprise not in the information theory way, not surprise as in like an entropy reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.952,
    "end": 1394.214,
    "text": "So it's important, I think, to make that distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.715,
    "end": 1400.837,
    "text": " But it minimizes surprise between the prediction and the actual reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.437,
    "end": 1404.058,
    "text": "So the surprise is like that divergence, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.238,
    "end": 1416.321,
    "text": "The Kuglec-Leibler divergence between those two, you know, the surprise is that, the divergence between the posterior and the prior, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.554,
    "end": 1417.894,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.315,
    "end": 1418.995,
    "text": "Thank you for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.756,
    "end": 1421.218,
    "text": "Let me try from a different angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.278,
    "end": 1421.858,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.898,
    "end": 1427.964,
    "text": "So we're coming from the scientific modeling literature, not the graphical Bayesian literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.425,
    "end": 1436.512,
    "text": "Those are cited, but in this paper, it's being approached and kind of reflected upon from this philosophy of science and almost history of ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.133,
    "end": 1437.353,
    "text": " away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.014,
    "end": 1448.98,
    "text": "So last time in 14, we talked about wanting to cut nature at the joints because we wanted to understand what kind of things were and we wanted to be able to model them effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.46,
    "end": 1457.284,
    "text": "Now we're going to be thinking about using this Markov blanket formalism that partitions external and internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.364,
    "end": 1464.949,
    "text": "But that's kind of really like saying that we're defining an interface and there's two sides to the interface because it can be symmetrical in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.649,
    "end": 1469.951,
    "text": " So we're defining an interface, which implies an internal and an external partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.611,
    "end": 1480.855,
    "text": "And this is going to allow us to do modeling in a way that is multi-scale because different kinds of nodes can be internal to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.495,
    "end": 1485.277,
    "text": " So you can have hierarchy or nestedness of modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.637,
    "end": 1491.92,
    "text": "So it's kind of like having a ton of small little computers running and then another computer could be like on top of them coordinating them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.461,
    "end": 1496.623,
    "text": "So those kinds of hierarchical models can be done with this type of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.103,
    "end": 1504.326,
    "text": " Markov blanket interface definition framework because you can have internal states that consist of multiple things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.646,
    "end": 1505.846,
    "text": "So that's nesting hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.246,
    "end": 1518.351,
    "text": "You can also have heterarchy or collective behavior or interactions between subunits because the external states of agents or nodes can be other agents like themselves or different things like the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.851,
    "end": 1526.114,
    "text": "So there's this massive amount of systems such as interacting agents or agent environment feedbacks that you can think of with an interface",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.954,
    "end": 1556.714,
    "text": " in mind and then it lets you get at this question of modeling in a way that's multi-scale can deal with arbitrary dynamics you could have the internal states could be arbitrary it could be a flat wave it could be a sine wave it could be a jimmy hendrix song you know it could be anything because it's defined in kind of the most skeletal way so this is like the body plan for one layer but then in other papers by maxwell and ramsted and others we've seen how that kind of plays out in a multi-scale way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.334,
    "end": 1563.158,
    "text": " because that's like the beyond internalism and externalism paper where we talked about this in the multi-scale way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.499,
    "end": 1565.78,
    "text": "And then that was just on one slide ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.954,
    "end": 1569.996,
    "text": " on the bottom right was the multi-scale question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.236,
    "end": 1571.898,
    "text": "So we know that we're dealing with multi-scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.938,
    "end": 1587.909,
    "text": "So when you're looking at Figure 1, it's kind of like you're thinking about one ant interacting with the environment, but just know that we're fully taking into account this multi-scale approach that's also going to come along with the generative model and this action selection, the policy, and the surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.269,
    "end": 1591.111,
    "text": "So there's a lot of features to it, and this is a simple figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.492,
    "end": 1593.033,
    "text": "We've seen these kinds of figures before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.473,
    "end": 1610.916,
    "text": " there's always more things to say about it and also if people in the live chat have any thoughts or questions we can say those or anything anything else to say on one blue yeah i'm good nice it's just it speaks a lot that with one figure two very thoughtful authors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.312,
    "end": 1624.056,
    "text": " put this because there's a, I don't know if it's citable or not, but you know, data on how even one equation will reduce the amount of people who will like read a paper, sad but true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.677,
    "end": 1627.278,
    "text": "So when putting figures with math, it's just,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.138,
    "end": 1652.518,
    "text": " it really has to be done appropriately and this is an example of it's very elegant in what it conveys and in it what it opens the door to so whatever you're seeing in the figure it's what's there the caption just describes what the parameters are but again whether real systems are doing that realism or whether this is just a graphical model that we're applying like any other graphical model in statisticlandia",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.078,
    "end": 1668.929,
    "text": " that's the topic of this paper so if you want to learn more about the technical details then that's where the citations lead you but we're looking at this and we're asking what would it mean if the world was actually doing this what would it mean if this was how we could approach systems like a scientific instrument that's the discussion blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.208,
    "end": 1680.211,
    "text": " So I do think that this figure just takes all of everything that you've ever known about the free energy principle and puts it in front of you in a very simple and elegant way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.092,
    "end": 1687.153,
    "text": "You just want to unload, brain dump all of your FEP knowledge at a simple figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.233,
    "end": 1697.877,
    "text": "And so it's very minimalist, which makes it accessible for people, whatever their level of mathematical background, which I think is really cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.519,
    "end": 1702.101,
    "text": " if I were going to read this by the numbers, by the colors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.682,
    "end": 1705.303,
    "text": "So each of the things has a slightly different color.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.003,
    "end": 1712.167,
    "text": "So that's reflecting that they're similar, like they're squoval boxes, but they're different types of things, which is true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.308,
    "end": 1716.009,
    "text": "They have a single letter in the equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.069,
    "end": 1719.932,
    "text": "So each of them is defined by a single letter that's related to some other function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.292,
    "end": 1725.195,
    "text": "So it's kind of like, you know, X number of pizzas that we have to order equals dot, dot, dot, dot, dot, dot, dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.495,
    "end": 1729.039,
    "text": " It's like one of those things but it's related to that color of the squoval.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.559,
    "end": 1737.688,
    "text": "And then there's the same kind of relationship with a barbell that relates internal and active states as sensory and external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.168,
    "end": 1744.194,
    "text": "And then there's a similar kind of relationship how sensory states influence internal states and active states influence external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.815,
    "end": 1750.622,
    "text": " And then there's a sort of relationship between, with an arrow, a new kind of relationship between active and sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.083,
    "end": 1755.528,
    "text": "So this bi-headed arrow, to me, in the middle, is the definition of the interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.908,
    "end": 1760.193,
    "text": "Because as we talked about in 14, the Markov blanket earlier...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.354,
    "end": 1784.139,
    "text": " had the interpretation of just statistically insulating nodes, and then later on, Fristian separated that into incoming or sensory states, outgoing or active states, and then internal states impinge upon the interface's active states, like, that's sort of like, you know, the internal we can think of as the brain and the active states being the arm, the same way the brain sends signals to the arm,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.659,
    "end": 1789.381,
    "text": " That's the way that the ecosystem, the external states, is like sending signals to the sensory modality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.802,
    "end": 1794.044,
    "text": "So that's the trees green going into your retina just at a first pass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.444,
    "end": 1798.986,
    "text": "So the internal states influences action states just like external states influence sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.506,
    "end": 1800.547,
    "text": "What do sensory states do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.947,
    "end": 1802.088,
    "text": "They update internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.388,
    "end": 1803.569,
    "text": "And what do action states do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.849,
    "end": 1805.029,
    "text": "They update external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.71,
    "end": 1811.012,
    "text": "So there's so much that you can really say, and I agree, it's a minimal prompt that helps coalesce a lot of understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.492,
    "end": 1814.234,
    "text": "And there's just four boxes and a couple of lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.28,
    "end": 1841.582,
    "text": " okay table one so this is the kind of the crux of the debate and it's awesome to see a philosophy paper with a table because it lays it out starkly so instead of just saying this chapter or this subheader or this paragraph this is a and b this is a but not b so here we're just seeing it in a graphical way and with acronyms and the letters kind of look similar a little bit at least to me so we're gonna",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.162,
    "end": 1846.488,
    "text": " colorize them and also just make it very clear which one we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.948,
    "end": 1848.13,
    "text": "But basically it's a two by two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.39,
    "end": 1851.834,
    "text": "So kind of like a Punnett square and or an Eisenhower matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.076,
    "end": 1856.04,
    "text": "And it has the two options for each of the dimensions that we care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.561,
    "end": 1857.221,
    "text": "So on the top,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.782,
    "end": 1867.589,
    "text": " Columns are whether we're talking about realistic realism, theories, models that have realism, or an instrumentalism approach to modeling in the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.209,
    "end": 1872.552,
    "text": "And then the rows are whether we think about things representationalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.032,
    "end": 1876.875,
    "text": "So do we think there's representations occurring or non-representationist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.315,
    "end": 1882.739,
    "text": "And then you have the four combinations of the three-letter schemes, RAP, RIA, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.999,
    "end": 1887.542,
    "text": "So what would you say about that, Blue, before we look at it a little more visually?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.703,
    "end": 1902.91,
    "text": " Just that it's very cool how they restrict the representationalism and the non-representationalism because they're going to really take that out of the equation at a later time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.271,
    "end": 1916.058,
    "text": "Not really much else to say, but other than that there's different combinations that can exist, the representational realism, REP, REA, non-representational realism, which is NRP, REA,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.798,
    "end": 1921.263,
    "text": " representationalist instrumentalism and non-representationalist instrumentalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.383,
    "end": 1936.199,
    "text": "So the representational standpoint representing like where you're using a representation of the object as opposed to the object itself, like where you're perceiving the orange, like your mind map or your mental map of the orange versus the actual orange.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.2,
    "end": 1947.144,
    "text": " And then realism and instrumentalism being, you know, that realism is implemented directly and instrumentalism is implemented as a statistical tool or model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1947.944,
    "end": 1948.925,
    "text": "Something like that, simply.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.565,
    "end": 1953.967,
    "text": "And if it's too many syllables, just think realism, yes, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1954.787,
    "end": 1956.267,
    "text": "Representation, yes, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.208,
    "end": 1959.229,
    "text": "Or there's longer words on the other sides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.989,
    "end": 1962.09,
    "text": "Let's look at it in a graphical way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.19,
    "end": 1965.671,
    "text": "And also, it's not for granted that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.811,
    "end": 1969.155,
    "text": " that you can make a 2x2 or make an orthogonal axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.615,
    "end": 1974.24,
    "text": "Because there might be two philosophical ideas that are correlated, like one implies the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.7,
    "end": 1980.006,
    "text": "But for the purposes of a paper, sometimes what somebody will do will be lay out two options.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.486,
    "end": 1984.651,
    "text": "Like the plant could either be influenced by nitrogen or not, by light or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.051,
    "end": 1989.152,
    "text": " And then you use that to study what the plant needs or how two factors are related to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.172,
    "end": 1995.094,
    "text": "Well, here we're studying how two ideas, two continuums of ideas are related to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.434,
    "end": 2002.337,
    "text": "And so it might turn out that some quadrants or some combinations are mandated, some are prohibited, some are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.517,
    "end": 2005.538,
    "text": " not preferable or preferable for some other reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.919,
    "end": 2014.363,
    "text": "So you lay out the two by two, or you lay out the higher dimensions of combining thought, and then you ask what are the pros and cons of each of these areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.963,
    "end": 2024.969,
    "text": "So here we have the x-axis is the realist on the left, instrumentalist on the right, and then the FEP options for representationalism are the y-axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.369,
    "end": 2028.631,
    "text": "Representationalist higher and non-representationalist lower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.051,
    "end": 2030.412,
    "text": "And drumroll,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.491,
    "end": 2040.532,
    "text": " the contention of the authors as screenshotted in this section five conclusion so always awesome when the first sentence of like a section actually is a summary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.048,
    "end": 2052.433,
    "text": " In this paper, we have defended the instrumentalist take on the FEP, arguing that the realist approach is a non-starter, so it doesn't go, regardless of whether it is representationalist or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.973,
    "end": 2056.574,
    "text": "So these big Xs with a question mark, because we're not saying it's the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.834,
    "end": 2058.075,
    "text": "That's not our take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.135,
    "end": 2061.296,
    "text": "It's not even the end point for the authors or the community per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.336,
    "end": 2069.1,
    "text": "Just that's what the paper is about, is saying no matter what you think about representationalism, so no matter where you fall on the Y-axis,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.586,
    "end": 2072.247,
    "text": " Realism is a non-starter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.547,
    "end": 2073.768,
    "text": "So realism is not going to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.868,
    "end": 2076.13,
    "text": "Anything with REA is not going to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.57,
    "end": 2081.254,
    "text": "Anything to the left on over, this is not going to be a tenable approach for the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.034,
    "end": 2090.6,
    "text": "And we would do better off to hang out on the right side here with instrumentalism where there is a debate or there's more to be understood about representationalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.0,
    "end": 2099.947,
    "text": "But let's be clear that FEP is being approached instrumentally rather than with a realistic research agenda or interpretation paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.447,
    "end": 2102.069,
    "text": " what does that make you think about blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.753,
    "end": 2109.92,
    "text": "Just, um, you know, in some ways, like, like it just, it brings up a lot of stuff, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2109.94,
    "end": 2111.603,
    "text": "Everyone has like maybe what they think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.903,
    "end": 2114.306,
    "text": "So in the instrumentalist, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.188,
    "end": 2117.35,
    "text": " you know, from that framework, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.49,
    "end": 2123.255,
    "text": "It's a model or a tool that we can use, not something that's actually implemented, like say by the brain, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.315,
    "end": 2132.544,
    "text": "So the brain's not actually using the FEP to do thought like processes, but, you know, we can always make it real, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.584,
    "end": 2139.53,
    "text": "Like, so we can take the, you know, statistical tool or model and put it into a computer and then it actually does use that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.87,
    "end": 2151.267,
    "text": " right and so so then you know there's there's always ways to you know abstract realism from from the instrumentalism uh you know in constructing something that runs on the model maybe that's not biological",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.529,
    "end": 2179.032,
    "text": " very interesting question so it's almost like if you had a state machine um and then you had a mathematical model of it it would be almost a realistic mathematical model or it might be a comprehensive and then yeah when we um and we talked about the metaphor reification and about how sometimes when there's a conflation of the map in the territory or there's only one map for a territory so people start navigating off of that what does that do and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.832,
    "end": 2195.103,
    "text": " how do we know that we're in that situation, that we're in the epicycle situation, where there could be a breakout into a whole different way of thinking on a topic, but we're just seeing within the bounds of how we think about the system really being, or what instruments we really have access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.884,
    "end": 2205.59,
    "text": "Let's look at some of the quotes, because it's worth going into, if the FEP is an instrument shop, if it's more like a music shop, you know, than the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.551,
    "end": 2236.02,
    "text": " the hall of reality what are those instruments so what will the fep instrumentalize as how is it gonna gonna be manifested and then what will allow us to do why does that matter because if we were going down the realist rabbit hole we could ask questions like well what does that mean for the meaning of life or what does that say about how we should live a good life or how does that relate to the trolley car problem or something now we could still ask those questions but if we first go the instrumentalist route we'd be like saying okay let's model the trolley car problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.62,
    "end": 2239.681,
    "text": " not thinking that it's actually this way, but dot, dot, dot, dot, dot, dot, dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.981,
    "end": 2252.306,
    "text": "And then you could still be clear about where your non-FEP derived value system arose from, because just like any other model, linear regression, ANOVA, it's incomplete without a little bit more on that side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.586,
    "end": 2259.069,
    "text": "And that's really something that's coming more and more into focus with AI ethics and how data is being utilized in society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.529,
    "end": 2261.65,
    "text": "So it's pretty interesting to talk about those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.637,
    "end": 2269.484,
    "text": " All right, do you wanna read this full page quotation with the aim where the authors again, thankfully lay out the aim of their paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.805,
    "end": 2283.411,
    "text": " Sure, the aim of this paper is to show that philosophically, instrumentalist thinking is less controversial yet remains explanatorily powerful and can yield important insights in an organism environment dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.031,
    "end": 2289.214,
    "text": "An instrumentalist attitude about the FEP is a safer bet without losing the potentially high returns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.834,
    "end": 2297.498,
    "text": "After briefly describing the FEP in section two, we assess two proposals made in the realist logical space, that of representational realism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.218,
    "end": 2300.379,
    "text": " and non-representational realism in section three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2300.779,
    "end": 2307.361,
    "text": "We reject both of them and in section four, we proceed to offer positive reasons to embrace instrumentalism about the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2308.162,
    "end": 2316.705,
    "text": "Given the activity dependence feature of neuronal activity, dynamic causal modeling under the FEP seems to be the most suitable and promising set of instruments",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.205,
    "end": 2323.111,
    "text": " to preserve the character of neuronal activation as we empirically know it to be, activity in coupled systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.572,
    "end": 2331.08,
    "text": "From this angle, realist arguments look like forcing the world to conform with the anthropomorphic instrumental lens we use to make sense of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.227,
    "end": 2332.507,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.167,
    "end": 2338.108,
    "text": "So one note is the defining two kinds of realism, representational or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.248,
    "end": 2342.929,
    "text": "Again, we're kind of rehashing some of the same discussions because the strange attractor is the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.149,
    "end": 2346.07,
    "text": "We're going to keep returning to this because you could study your whole life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.57,
    "end": 2352.271,
    "text": "So if you think that you haven't heard the word enough in two hours, then wait till it's been thinking about it for two years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.911,
    "end": 2354.931,
    "text": "And this reminds me of just going to a restaurant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.231,
    "end": 2357.252,
    "text": "It's like, you could just say, no, I don't want soup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.012,
    "end": 2379.485,
    "text": " and then here it's like there's two kinds of soup and i don't want soup a or soup b it's like you divide to conquer instead of just saying we think instrumentalism is better than realism paper's done they actually said there's there's molt there's nuance to the realist position and we're going to give a strong presentation of why somebody would honestly believe that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.285,
    "end": 2404.665,
    "text": " realism works for various reasons and then we're going to individually respond to the unique realist perspectives maybe there's more than two there's other axes that you could go into defining but we're going to actually uniquely respond to why different kinds of realists are realists rather than just only looking at the realist instrumentalist number line and just saying instrumentalism is better because it's more useful duh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.546,
    "end": 2414.111,
    "text": " That's less nuanced paper and it's less useful because it doesn't really help us understand why realism is being dismissed unilaterally out of hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.511,
    "end": 2417.073,
    "text": "This is a much more nuanced way to deal with the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.713,
    "end": 2420.535,
    "text": "And then also I've highlighted the dynamic causal modeling,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.195,
    "end": 2424.719,
    "text": " because it's going to be discussed as kind of the leading instrument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.139,
    "end": 2433.167,
    "text": "So again, if the FEP is to be understood in an instrumentalist way, so it's the music shop with the instruments, what are the instruments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.728,
    "end": 2434.989,
    "text": "What have people done with them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.069,
    "end": 2435.81,
    "text": "Do they not exist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.311,
    "end": 2440.195,
    "text": "Is it an empty music shop where people are saying, just come and build music things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.315,
    "end": 2441.436,
    "text": "We don't know what it's going to look like yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.616,
    "end": 2443.017,
    "text": "Or is there something already there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.618,
    "end": 2444.959,
    "text": " And could there be something that looks different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.119,
    "end": 2446.4,
    "text": "Or is it going to only look similar?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.8,
    "end": 2451.624,
    "text": "Those are the kinds of questions that in early 2021 we're wondering, aren't we?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.984,
    "end": 2457.448,
    "text": "Any other questions or thoughts on this, Blue, before we go into dynamic causal modeling a little bit more in detail?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.489,
    "end": 2459.429,
    "text": "No, let's take it away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.589,
    "end": 2459.75,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.07,
    "end": 2460.29,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.87,
    "end": 2462.572,
    "text": "So dynamic causal modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.892,
    "end": 2467.835,
    "text": "We often hear things like, well, where's the textbook on FEP or active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.596,
    "end": 2471.178,
    "text": "Or what are the sections that are related to understand it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.94,
    "end": 2474.903,
    "text": " or it's something that we all want to improve the state of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.003,
    "end": 2480.628,
    "text": "And again, it's one of the main projects in our lab to be developing educational material, bodies of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.328,
    "end": 2490.596,
    "text": "That being said, if dynamic causal modeling as posited by the authors really is the leading implementation of the instrumentalist FEP,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.477,
    "end": 2507.63,
    "text": " then it would make sense to understand a little bit about what dynamic causal models are because these are ultimately the form or the type of models that you're going to be discussing so if we've dispensed with the fep as describing how the system is with a realist lens",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.07,
    "end": 2526.313,
    "text": " we're going to be modeling the stock market using active inference using the fep but we're going to be using it instrumentally we weren't saying that the stock market was linear aggressions or was arena models so we're not saying that it is fep we're just saying that we're going to explain variance we're going to explain design predict control better because the fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.074,
    "end": 2532.198,
    "text": " So what will it look like beyond the metaphor and just thinking about it in a cool way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.678,
    "end": 2535.28,
    "text": "Well, it's going to look like dynamic causal modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.661,
    "end": 2537.962,
    "text": "That's what is going to be discussed in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.443,
    "end": 2541.745,
    "text": "So this book from 2007, I think it might be the most recent version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.506,
    "end": 2554.094,
    "text": "Statistical Parametric Mapping or SPM is a long running toolkit that's been developed by Carl Friston and others in relationship to this dynamic causal modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.055,
    "end": 2555.455,
    "text": " framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.895,
    "end": 2563.099,
    "text": "So dynamic causal models are kind of the statistical family of models and statistical parametric mapping is first off SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.139,
    "end": 2564.879,
    "text": "That's the name of the toolkit in MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.44,
    "end": 2570.502,
    "text": "As we've discussed in the model streams, Python and other languages are being developed for this as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.802,
    "end": 2572.183,
    "text": "So we're not going to go into that right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.323,
    "end": 2589.419,
    "text": " it's called a statistical parametric map because given the dynamic causal model that's being inferred this spm package puts a layer of statistics over that and it asks from a parametric statistic perspective like a p-value perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.54,
    "end": 2594.243,
    "text": " Again, this is a whole 800-page textbook, so there's just two sentences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.723,
    "end": 2597.785,
    "text": "It does statistics on these kinds of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.825,
    "end": 2605.689,
    "text": "That entails not just specifying these models, but specifying what fields of models they exist within and a lot of other attributes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.749,
    "end": 2609.191,
    "text": "It's not the same just to write out one model to do statistics, but that's what this book is for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.612,
    "end": 2611.393,
    "text": "Now, what is the form of these models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.773,
    "end": 2616.776,
    "text": "There's other cousins and colleagues, but this is one of the core forms in DCM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.596,
    "end": 2619.356,
    "text": " There's two coupled equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.736,
    "end": 2623.837,
    "text": "The first top equation has Z, which is neural activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.357,
    "end": 2631.799,
    "text": "We can see from this caption that the change in neural activity, so it could be DZ or Z dot, just it's neural activity, is hidden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.179,
    "end": 2636.08,
    "text": "It cannot be directly observed using non-invasive functioning imaging modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.52,
    "end": 2642.501,
    "text": "So it could represent neural firing, but it can actually represent just any hidden underlying unobserved state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.221,
    "end": 2649.507,
    "text": " And that underlying hidden state is a function of itself at the prior moment and in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.747,
    "end": 2652.769,
    "text": "That's the previous Z, its own value, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.69,
    "end": 2656.012,
    "text": "Then U are the experimental inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.773,
    "end": 2660.296,
    "text": "So that's the things that you added nitrogen and you're inferring the ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.756,
    "end": 2661.877,
    "text": "So that's this kind of idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.177,
    "end": 2665.84,
    "text": "And then theta is the number of parameters in this fitted model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.361,
    "end": 2668.062,
    "text": "And again, we're not talking about reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.322,
    "end": 2669.123,
    "text": "We're instrumentalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.403,
    "end": 2670.965,
    "text": "So these parameters are just a heuristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.465,
    "end": 2686.335,
    "text": " eight is better fitting than 12 okay then that's how many we're going to use we're not making claims we're getting hung up on that this z hidden underlying equation that has to be fit just like you didn't observe the regression line you're not going to observe the dynamical z but you're fitting it with data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.176,
    "end": 2707.404,
    "text": " then what data are you fitting it with you're fitting it with with y which is the observe activity it can be unimodal or it could be multiple kinds of time series but it can handle multiple different types of time series together like eeg fmri meg different types of time series being overlaid",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.044,
    "end": 2712.187,
    "text": " with different types of dynamics and sampling rates and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.687,
    "end": 2724.815,
    "text": "And that observable Y function is a different function G related to inferring this underlying hidden neural state plus parameters of a statistical model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.755,
    "end": 2728.576,
    "text": " with a noise term that can be modality specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.117,
    "end": 2745.724,
    "text": "So that's almost like if it's really true that the FVP is instrumentalist, then it's really true that we should think about things this way with like a hidden component here with change in a hidden variable being related to the hidden variable state and other features, inputs and other features like attributes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.404,
    "end": 2747.705,
    "text": "And then we're observing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.385,
    "end": 2761.128,
    "text": " And it turns out that this minimal two equation set is going to be really helpful because it allows us to make an arbitrarily complex Z. Whether we know nothing or a ton about Z, we can arbitrarily lay that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.588,
    "end": 2767.47,
    "text": "And then we can have Y be very scarce or very noisy or just only have Y for 15 minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.45,
    "end": 2777.322,
    "text": " So it's going to open up a lot of types of models that are with one aspect that we didn't see and then a semi-related aspect that we did see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.862,
    "end": 2781.026,
    "text": "Okay, any thoughts on that, Blue, before we look at a few DCM examples?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.398,
    "end": 2783.099,
    "text": " No, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.119,
    "end": 2783.499,
    "text": "Let's go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.659,
    "end": 2783.879,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.6,
    "end": 2788.884,
    "text": "So this is an example of going even more one layer more specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.004,
    "end": 2793.508,
    "text": "Now we're looking at a DCM paper looking at specific brain regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.169,
    "end": 2799.513,
    "text": "So one thing that's really important about the DCM framework is where it had the experimental inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.154,
    "end": 2801.755,
    "text": " So again, we're instrumentalists, not realists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.795,
    "end": 2805.959,
    "text": "So we don't think that these connections reflect like where the neurons are touching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.159,
    "end": 2807.7,
    "text": "It doesn't say this is what causes what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.181,
    "end": 2810.182,
    "text": "It's parameters that were fitting in a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.723,
    "end": 2826.636,
    "text": "And so the way that you ask, does A influence B in the DCM framework is, is it a better model when I have a statistical influence between A and B rather than the statistical model where that's absent, which by definition is simpler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.236,
    "end": 2830.798,
    "text": " But so if it explains the same amount of variance, then the simpler model is preferred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.559,
    "end": 2842.506,
    "text": "However, if there's a significantly more amount of variance explained by the more nuanced model, then it's equivalent to saying there is statistical evidence that A and B are influencing each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.306,
    "end": 2849.951,
    "text": " And so this is something that's really cool in this textbook and in this paper, where they talk about psychophysical interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.491,
    "end": 2863.199,
    "text": "And so in this case, they're looking at a few different brain regions, which are the nodes like STG, superior temporal gyrus, and a couple of other visual areas and visual associated areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.76,
    "end": 2873.026,
    "text": "And then each of those underlying hidden actual neural regions are emitting a Y, which in this case is the voxel of data for fMRI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.486,
    "end": 2876.389,
    "text": " So there's like a time series of intensity with a bold signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.669,
    "end": 2888.962,
    "text": "We're not going into fMRI, but it's a time series of intensity that's emitted by an underlying something that could have a very, very different profile than the actual emitted signal because of how fMRI is measured and all these things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.813,
    "end": 2894.496,
    "text": " Then they can ask in two conditions where the same visual input is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.856,
    "end": 2898.679,
    "text": "So it will be like a field of things moving or there's different visual assays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.959,
    "end": 2900.039,
    "text": "Again, we're also not going into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.4,
    "end": 2901.34,
    "text": "You can have two conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.62,
    "end": 2911.527,
    "text": "One of them where the participant is told, look at the center and the other one where the participant is told, do this, something else, you know, look at the far side or track the moving dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.347,
    "end": 2920.009,
    "text": " That is going to be reflected by changes in the visual region, potentially, as well as in other regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.549,
    "end": 2929.65,
    "text": "And then they can look at two different instruction sets to highlight whether there's a statistical association between two other areas of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.191,
    "end": 2936.712,
    "text": "Again, that doesn't say anything about whether they're actually connected with neurons, but it highlights a dynamical or a functional dependency",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.452,
    "end": 2952.687,
    "text": " doing these kinds of nuanced statistical models so it's kind of like a structural equation model but with time series and dynamical series and partially observable states and bayesian networks and a few other things next slide blue any other thoughts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.366,
    "end": 2956.588,
    "text": " No, I'll have a thought at the end, but then you go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.028,
    "end": 2958.65,
    "text": "Okay, there's two more, I think, DCM slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.03,
    "end": 2960.631,
    "text": "This is just to, we're not going to go through this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.032,
    "end": 2967.097,
    "text": "This is just like saying that was the simple, that was 2003 DCM with the V1 region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.817,
    "end": 2973.562,
    "text": "This is 2019 DCM, Dynamic Causal Modeling Revisited Neuroimage, first in it all, 2019.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.982,
    "end": 2979.227,
    "text": "So it has become implemented with things that are very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.827,
    "end": 3009.267,
    "text": " and it's a very nuanced model so look at what the developmental trajectory has been and it kind of makes sense how more and more features like the presynaptic and the postsynaptic dynamics could be incorporated within this course scaffold so that's why it's really important to start with the right generalizations because then it can get nuanced you know 20 years down the line and then this paper just the last point on the dcms just to give one example of the applications of dcm because again if it's instrumentalist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.362,
    "end": 3015.266,
    "text": " then we want the instruments that are useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.586,
    "end": 3019.209,
    "text": "We want the financial instruments, musical instruments, carpentry instruments that work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.509,
    "end": 3021.571,
    "text": "So what can we actually do with DCM?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.211,
    "end": 3029.497,
    "text": "And papers like this one in 2013 and other more recent ones show how we can actually use free energy fitting of models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.137,
    "end": 3048.215,
    "text": " So when we talk about free energy minimization on big data sets, or we're talking about whether there's free energy minimization happening in the context of organismal behavior, again, instrumentally, not realistically, that free energy minimization can be understood as navigating this trade-off with accuracy minus complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.036,
    "end": 3078.576,
    "text": " And so we're going to use this free energy minimization on graphs of dynamically associating brain regions as assayed by neuroimaging, and then use free energy to fit this vast family of models down into something that's on that manifold that's kind of like Pareto optimal with respect to accuracy minus complexity, given the experimental design and the massive amount that we actually do know about things like hemodynamics and the bold responses error dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.317,
    "end": 3080.942,
    "text": " So I'm gonna just stop there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.062,
    "end": 3082.526,
    "text": "Blue, what do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.857,
    "end": 3097.202,
    "text": " So I just wanted to say when we're talking about fMRI, I don't know if everyone has seen pictures of fMRI and what that looks like, but it's essentially like a black and white picture of the brain with little areas of the brain that are lit up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.863,
    "end": 3108.647,
    "text": "And in those fMRI pictures, when you take that into this realism versus instrumentalism kind of framework, I was thinking of this specifically as I was reading this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3109.587,
    "end": 3118.614,
    "text": " it really literally says that the fMRI, which is like the model of how the brain perceives the world, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.094,
    "end": 3127.82,
    "text": "So in this fMRI scan, somehow like, you know, the Jennifer Aniston neuron, like it should be like a tiny little picture of Jennifer Aniston.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3127.86,
    "end": 3132.964,
    "text": "I just like kept thinking about that, like inside the brain, in the fMRI scan, we should literally be able to see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.064,
    "end": 3143.731,
    "text": " this realist representationalist, like the representation of the tree we see outside should be there in the fMRI scan if it's really like falls into that framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3143.751,
    "end": 3147.334,
    "text": "And I just, I kept having that thought and it was like recurring and silly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3148.328,
    "end": 3163.823,
    "text": " nice the the jennifer aniston neural distributed activation pattern that was the longer article the editor scrapped the headline so somebody in the youtube chat wrote this and just great to hear another perspective on free energy while we're here they wrote hi i'm a student in math",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.383,
    "end": 3169.266,
    "text": " Free energy to me is just a moment generating function for a probability distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.886,
    "end": 3172.867,
    "text": "In Feynman's path integration, it is a generating functional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.468,
    "end": 3178.75,
    "text": "In geometry, free energy is a generating function for yet more probabilistic information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.291,
    "end": 3183.153,
    "text": "Does this free energy principle relate to specific probabilistic information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.127,
    "end": 3189.491,
    "text": " So let me, while Blue, you can prepare anything if you want, but let me just work backwards through a few of these terms just really quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.011,
    "end": 3195.034,
    "text": "Yes, I would say it relates to probabilistic information because it's very closely related to information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.195,
    "end": 3197.876,
    "text": "Like we're seeing maths on this y-axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.976,
    "end": 3203.92,
    "text": "So we're talking about model fitting, reduction of uncertainty, model fitting of probabilistic and stochastic variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.821,
    "end": 3219.867,
    "text": " instrumentally so we're in that territory and then um there's i know a lot of detail that others with a lot more mathematical background could add to how the trajectory the path integration and how the free energy is like a path",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.447,
    "end": 3227.811,
    "text": " integral that's being optimized as far as policy because you're not just doing the instantaneous static optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.152,
    "end": 3229.452,
    "text": "So it's not like just that first moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.532,
    "end": 3231.654,
    "text": "It's more like a trajectory of a dynamical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.094,
    "end": 3235.896,
    "text": "And then you mentioned it's a generating function for more probabilistic information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.916,
    "end": 3248.123,
    "text": "There's probably multiple ways to take that, but it seems like we're talking about generative models and the way that generative models, even in feedback with their environment, could be generating more information and doing behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.444,
    "end": 3249.024,
    "text": "What do you think, Lou?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.74,
    "end": 3253.562,
    "text": " I think that you summarized it quite well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.682,
    "end": 3269.796,
    "text": "And I also, I do think that it's important to, you know, distinguish the surprise as the authors did in this paper, that surprise in the free energy principle is not the surprise from information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.976,
    "end": 3276.082,
    "text": "Just make that one kind of distinction because it's easy to conflate those two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.562,
    "end": 3304.65,
    "text": " yep and as far as feynman specifically i know that's the variational principle and so we're heavily in the variational territory and variational bays vb but it would be awesome to have somebody with a little more background to answer it more speaking of bays and of models and also of everyone learning and continuing to be on their active inference journey how are we all going to be challenged learning because there's so much to learn in philosophy and in math",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.83,
    "end": 3328.672,
    "text": " well it's awesome when the paper can give us both philosophy and math together so even though this is a simple equation for some for the two equations that are in this paper we're just going to look at them and understand what they're actually doing in the context of the paper because again they're speaking to an audience including philosophers and they've gone out of the way to include equations because this is the clearest way to signal what they're thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.272,
    "end": 3335.637,
    "text": " So here they're talking about REPRIA, so representations and realism, so yes for both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.578,
    "end": 3348.046,
    "text": "And they write that this REPRIA view comes in the form of process theory offshoots of the FEP, such as predictive coding, predictive processing, or more generally, PEM, theories of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.526,
    "end": 3349.207,
    "text": "What is PEM?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.707,
    "end": 3351.469,
    "text": "Prediction Error Minimization, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.924,
    "end": 3353.144,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.584,
    "end": 3363.706,
    "text": "By employing Bayesian epistemology or using Bayesian ways of looking at things, scientists refer to the model of the nervous system by using technical terms pertaining to the Bayes' theorem, as shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.126,
    "end": 3367.467,
    "text": "So, Blue, what would you say about Bayes' theorem here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.007,
    "end": 3375.449,
    "text": "So just to your point about philosophy and math, I think that really this equation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3376.975,
    "end": 3382.66,
    "text": " even for someone like, you know, I am teaching my nine-year-old daughter how to do math and she would be like, that's not math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3384.001,
    "end": 3394.35,
    "text": "So really like there's, they both come down philosophy and math to formal logic, which is really kind of highlighted in Bayes' theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.47,
    "end": 3396.651,
    "text": "So the theorem really to read it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3397.492,
    "end": 3416.767,
    "text": " it's the probability of a given b which is the left side of the equation is equal to the probability of b given a like you know if this then that right the probability of um you know one event in occurrence with another uh times the probability of a divided by the probability of of b",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.447,
    "end": 3421.291,
    "text": " So that is the reading of the equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.351,
    "end": 3423.453,
    "text": "And it is formal logic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.374,
    "end": 3427.558,
    "text": "What are the chances of, I'm trying to think of a good example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.5,
    "end": 3432.623,
    "text": "If the Eagles win the Super Bowl,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.624,
    "end": 3436.026,
    "text": " then their quarterback goes to the Pro Bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3436.186,
    "end": 3437.166,
    "text": "Like what, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.186,
    "end": 3444.371,
    "text": "Like, so what are the chances of, what is the probability of that quarterback going to the Pro Bowl given that team winning the Super Bowl?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3444.531,
    "end": 3446.532,
    "text": "Like what are the chances of this given that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3446.853,
    "end": 3455.919,
    "text": "And what are the, you know, and it's the probability of, what's the probability of the Eagles winning the Super Bowl divided by the probability of the quarterback going to the Pro Bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.059,
    "end": 3459.321,
    "text": "So those kinds of things, like if one event than another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3459.926,
    "end": 3465.108,
    "text": " Here's another take on that is when events are independent, we know that they shouldn't impinge on each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.208,
    "end": 3468.25,
    "text": "Like flip a coin, you get heads, you roll the dice, you get a six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3468.69,
    "end": 3473.932,
    "text": "So it's like one half chance of it getting a heads and then one in six of getting a six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3474.232,
    "end": 3475.153,
    "text": "So it's like a 12th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.173,
    "end": 3476.433,
    "text": "You just multiply them together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.673,
    "end": 3484.457,
    "text": "So that's regular probability numbers between zero and one, nothing happening or unlikely to happen and extremely likely or must happen with one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.037,
    "end": 3487.018,
    "text": " So if they're independent, you just multiply them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.518,
    "end": 3491.719,
    "text": "But this is actually for cases where it's not quite so clear that there's independence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.319,
    "end": 3499.062,
    "text": "So it's more for the case in real life where things are associated, even if for spurious reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.722,
    "end": 3504.824,
    "text": "That's why the instrumentalist reading is so important, because just finding that there's some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.024,
    "end": 3510.288,
    "text": " correlation in the real world doesn't entail any specific underlying model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.688,
    "end": 3513.631,
    "text": "It's just a statistical association between different variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.072,
    "end": 3517.335,
    "text": "And so here we're studying the set of all interacting factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.355,
    "end": 3522.74,
    "text": "There's two here, but there can be way more than two in large Bayesian models for just things that influence each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.26,
    "end": 3533.084,
    "text": " So we're thinking from the simplest case with just two non-interacting events, and then you could think about more than two non-interacting events, and then you might want to ask how events interacting makes it more complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.424,
    "end": 3539.887,
    "text": "And of course, it does make it more complicated, but that's why there are good instruments to deal with it, like SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.507,
    "end": 3543.368,
    "text": " and the dynamical equation modeling approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.768,
    "end": 3550.932,
    "text": "So that's Bayesian approach, and you could learn a lot, and there's courses and lectures and stuff on Bayesian statistics, but this is kind of the core of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3551.192,
    "end": 3560.916,
    "text": "And the point is that the terms and the frameworks that are used in the raparia camp involve this equation in spirit and in code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.556,
    "end": 3574.296,
    "text": " So they use terms like the prior and updating the prior and calculating the posterior, which is a few sections of these equations, which we're not gonna worry about, but also they implement scaled versions of these equations on empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.997,
    "end": 3576.159,
    "text": "Let's go to the second equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3576.92,
    "end": 3603.648,
    "text": " so the previous equation was about updating with new information based upon priors just taking what you knew about how the world was associated implementing information that's gained from experiments or observations and updating your model of the world in some way now we're going to be talking about a kind of different area of math a different feature that equations are helping us understand so do you want to read the equations or anything else you want to say on it go ahead blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.745,
    "end": 3607.246,
    "text": " Yeah, I'll read the quote if you want, and then you can explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3608.606,
    "end": 3614.068,
    "text": "I do want to say that the probability of the Eagles winning the Super Bowl this year is zero, so just by the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.848,
    "end": 3620.549,
    "text": "Notably, noise can drastically modify the even deterministic dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.049,
    "end": 3630.212,
    "text": "Importantly, this means that stochastic dynamical systems accounting for noise are equipped, at least in principle, to capture how existing states contribute to adaptation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.859,
    "end": 3645.106,
    "text": " State space models are among the most suitable set of techniques from Rossi and Frist in 2016 to model the unfolding activity or behavior of a system subject to fluctuations in noise described by an ordinary differential equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.087,
    "end": 3647.348,
    "text": "And then I'll let you take it from here, Dan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3647.588,
    "end": 3647.748,
    "text": "Here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.968,
    "end": 3653.251,
    "text": "So in the previous equation, we were thinking about systems that change through time when new information comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.991,
    "end": 3682.924,
    "text": " now we're thinking about other aspects of systems that we care about specifically fluctuations and noise so that's kind of like change through time so it's another way to say that it's changing and developing through time in a way that either oscillates very cleanly or it could just be all over the place it could be any kind of rough path or any kind of signal anything in the signal processing domain is going to be considered a fluctuation it's just not a flat line or that could be considered a very small fluctuation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.624,
    "end": 3686.806,
    "text": " So things that are changing through time and noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.226,
    "end": 3697.972,
    "text": "So we're kind of getting the basics of statistics, things that influence each other, things that change through time and things that have noise, which is to say that in the measurement or any other step,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.732,
    "end": 3721.993,
    "text": " between the system occurring and you modeling it which is to say everything there's some lossiness and therefore there's some noise term that has to be modeled so again the instrumentalist take isn't that the noise is like in the world doing something the noise term is a parameter in our instrument that's defined in relationship to the variance left unexplained by the rest of our model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.234,
    "end": 3728.776,
    "text": " Depending on what you do include in your model and how you calculate it, what datasets you use, your noise estimates can be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.257,
    "end": 3737.96,
    "text": "Just like depending on what variables you include in a regression, which interactions you allow for, you're going to even estimate the sign of different associations to be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.141,
    "end": 3747.17,
    "text": " So if one country has younger people, another country has older people, and then you do a regression, you might think that age was associated when actually it was country or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.69,
    "end": 3756.961,
    "text": "So that's why it's really important to take an approach that looks at the whole phase space to understand how to fit these dynamical models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.501,
    "end": 3760.003,
    "text": " So instead of descriptive, we're looking at underlying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.503,
    "end": 3762.924,
    "text": "Instead of static systems, we're looking at changing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.325,
    "end": 3767.727,
    "text": "Instead of perfect measurement, we're allowing for noise to be included.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.747,
    "end": 3780.776,
    "text": "So there's a few dimensions where it's like we're thinking mathematically, but we're also relaxing it in key aspects that help us deal with philosophically and just practically important aspects of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3781.616,
    "end": 3783.998,
    "text": " So the kinds of things we want to use the FEP instrument on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.358,
    "end": 3790.942,
    "text": "Because if someone says, I made an instrument, but like, no, you can't play it because it's like very large or it takes 25 people to play or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.362,
    "end": 3792.863,
    "text": "We don't want to make that kind of an instrument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.003,
    "end": 3794.925,
    "text": "So what kind of instrument do we have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.385,
    "end": 3797.666,
    "text": "It draws upon these types of mathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.968,
    "end": 3800.188,
    "text": "Okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.109,
    "end": 3802.329,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.59,
    "end": 3804.551,
    "text": "Let's look at a few more quotations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.571,
    "end": 3807.493,
    "text": "Do you want to read this quote on yet from the fact?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.84,
    "end": 3809.12,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.86,
    "end": 3817.902,
    "text": "Yeah, from the fact that it is possible to model a process, it does not necessarily follow that the target phenomenon represents the intellectual tools we use to model it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.502,
    "end": 3822.443,
    "text": "Consider a moving object that can be explained by Newton's laws of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.263,
    "end": 3830.105,
    "text": "That we can model the movement by that formalism does not follow that object represents the law by which it falls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3830.985,
    "end": 3838.09,
    "text": " Few people would claim that the object represents or embodies, instantiates, implements, employs, leverages the laws by which it moves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3838.65,
    "end": 3856.922,
    "text": "Because science does not back this up, those who wish to do so are committed to a philosophical assumption that moving objects, like cells or organs in the nervous system, represent laws, principles, or the intellectual tools we use to describe processes conforming to laws or principles, posteriors, likelihoods, and priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.742,
    "end": 3871.498,
    "text": " Friston, Weiss, and Hobson, 2020, are on the guard on this matter, pointing that from the fact that it is possible to map states does not mean that the resulting descriptions refer to entities that actually exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3872.459,
    "end": 3872.539,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3873.019,
    "end": 3875.361,
    "text": " I love this Newton's law of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.961,
    "end": 3878.222,
    "text": "I loved this excerpt from the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.542,
    "end": 3882.725,
    "text": "I was thinking about the apple, the classic apple that falls on Newton's head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3883.345,
    "end": 3888.088,
    "text": "Does that apple actually embody or represent the laws of motion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.128,
    "end": 3890.909,
    "text": "Does that apple represent gravity in and of itself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3891.41,
    "end": 3893.451,
    "text": "I thought that was a really nice way to put it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3894.071,
    "end": 3903.014,
    "text": " And it also highlights why the examples are important of the example theory of Newton's law of motion and also the example within that of the apple falling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.315,
    "end": 3910.357,
    "text": "Because if you go up to someone on the street and you say, you know, our scientific models, realistic something, you explain them what realism was and said yes or no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.877,
    "end": 3916.62,
    "text": "Some people might say, yeah, I mean, it's the best shot or it really is that way, or that's really how the clouds form or that's really how the climate changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.06,
    "end": 3921.061,
    "text": "But then when you say, right, but then the apple isn't gravity, it's not the idea of gravity, it's an apple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3921.522,
    "end": 3921.842,
    "text": "So then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.702,
    "end": 3927.146,
    "text": " doesn't that make you rethink where you are on the realist spectrum?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.646,
    "end": 3932.75,
    "text": "So this is part of the author's argument from a philosophical perspective against realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.191,
    "end": 3940.036,
    "text": "They're saying the commitments that you make by taking the realist stance on Newton's law of motion are kind of crazy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.236,
    "end": 3940.777,
    "text": "It's like not...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.357,
    "end": 3959.829,
    "text": " good stances that you're taking on this example agree or disagree if you agree you continue forward and then saying well then that is a commitment to also these other implications that maybe are you still on board but somebody might say yeah i'm still on board the cell is just the intellectual idea of a cell it's really nothing more than that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.729,
    "end": 3973.974,
    "text": " And then somebody would say, right, but then at some point, you're going to be instrumentally wanting to do something pragmatic, and then you're going to have your front of house be realism, but then actually be acting like an instrumentalist, because in the end, you care about useful models too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.234,
    "end": 3977.495,
    "text": "So this is a long-running debate, but it's just really captured here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.176,
    "end": 3982.257,
    "text": "Let's go to the conclusion, and then we have a few more things that we'll talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.797,
    "end": 3984.578,
    "text": "So do you want to read it, or I can't?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.378,
    "end": 3985.959,
    "text": "You can go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.999,
    "end": 3986.219,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.679,
    "end": 3988.38,
    "text": "They... Let me just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.688,
    "end": 3999.3,
    "text": " In this paper, we have defended the instrumentalist take on the free energy principle, arguing that the realist approach is a non-starter regardless of whether it is representationalist or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.72,
    "end": 4007.891,
    "text": "Crucially, the question as to whether systems do or do not model their environment will not be decided by neuroimaging studies or the models we employ in interpreting the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.351,
    "end": 4009.071,
    "text": " So this is awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4009.211,
    "end": 4015.874,
    "text": "It's going to entail data and research and empirical studies, but there is no neuroimaging dataset that's going to resolve it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.334,
    "end": 4020.015,
    "text": "This paper and following discussions are how we get at this issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.156,
    "end": 4021.576,
    "text": "There isn't a dataset that exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.976,
    "end": 4023.497,
    "text": "There isn't a dataset that could exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.857,
    "end": 4025.498,
    "text": "It's actually a philosophical question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4025.878,
    "end": 4034.321,
    "text": "So this is why we want to have participation from different perspectives, because it's not a machine learning question whether the FEP is realist or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.901,
    "end": 4036.082,
    "text": " and it does have implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4036.542,
    "end": 4038.464,
    "text": "So that's really a great conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4038.904,
    "end": 4042.646,
    "text": "This is a philosophical matter that should be dealt with by way of philosophical argumentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.817,
    "end": 4066.677,
    "text": " have argued that the representationalist realist rep ria position does not hold up because of the as of yet missing naturalistic grounding of representations independent of sociocultural practices including structural representations citations the non-representationalist realist position nrp ria purports to solve the issues of raparia by removing representational content from the story",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.318,
    "end": 4071.501,
    "text": " Yet it does not hold up because without content, there is no model and no Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.081,
    "end": 4078.085,
    "text": "The instrumentalist does not face the same problems as they do not ascribe the modeling activity to the organism under scrutiny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.865,
    "end": 4084.909,
    "text": "So that's why they first went to the repria position and introduced the Bayes equation because it's really important to understand repria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4085.209,
    "end": 4086.99,
    "text": "This is sort of like the first take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.291,
    "end": 4091.533,
    "text": "You say, yeah, the FEP is literally representing what the organism literally does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4092.094,
    "end": 4094.275,
    "text": "It's a Markov blanket and it's dissipating a gradient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4094.435,
    "end": 4095.176,
    "text": "What else is there to say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.036,
    "end": 4112.025,
    "text": " that is critiqued for reasons of representationalism so then people moved from the repria to the nrp ria non-representational realism which like okay well yeah fep is still really what the organism is doing literally realistically however it's not representing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.885,
    "end": 4131.499,
    "text": " it's just a representationalist realistic model and then according to the authors take it or leave it or discuss it with them later they're saying that that reparia is a contentless model because it's basically saying you can't have this kind of a combination of a contentless model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.119,
    "end": 4159.037,
    "text": " so that's the approach the philosophical argumentation approaches they divide into the quadrant say you know it could be anywhere we don't really know start with one quadrant say that it's not good move into another quadrant say it's also not good and then in doing so realize that they've eradicated both interpretations of realism on the representationalism spectrum maybe there's another spectrum that you want to bring into the picture but that's the way that you actually go about asking whether another idea bears upon this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4160.1,
    "end": 4161.121,
    "text": " the way that they've laid it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.582,
    "end": 4164.424,
    "text": "So such a great approach and really clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.544,
    "end": 4166.146,
    "text": "What would you add to the conclusion, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4168.689,
    "end": 4176.677,
    "text": "I don't really have anything to add except it was really a good paper and I really liked the examples and the way that they laid it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.797,
    "end": 4182.542,
    "text": "It's kind of like you can't, you know, they presented the argument in such a way that you can't really argue with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.143,
    "end": 4183.904,
    "text": "So I liked that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4184.671,
    "end": 4187.053,
    "text": " Or if you wanted to argue, you'd know where to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.934,
    "end": 4191.457,
    "text": "Let's just go through a couple of these questions that you raised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.757,
    "end": 4198.844,
    "text": "Let's just, we're not gonna address them, but like, what is a cool example of each of these points or questions, or what do you think is exciting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.484,
    "end": 4204.589,
    "text": "What kind of project does it bear upon that these are the questions that we're asking in relationship to this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.869,
    "end": 4208.753,
    "text": "So first with the process theories and the FEP, what was interesting to you there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.619,
    "end": 4223.768,
    "text": " So this, I just highlighted this because this was something that the authors highlighted and not really with a question, but they highlighted that the free energy principle is a principle, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.808,
    "end": 4225.069,
    "text": "It's not a process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.109,
    "end": 4228.351,
    "text": "And this kind of, we discussed this really in Mel's paper in 14.0, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4230.279,
    "end": 4254.879,
    "text": " so um but but that these process theories such as bayesian brain hypothesis predictive coding active inference really explain how the fep is is actualized right um where the fep you know targets reduction of of entropy the bayesian brain hypothesis and predict predictive coding focus on maximizing the hypothesis likelihood given the sensory input and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.94,
    "end": 4264.227,
    "text": " And that the FEP really doesn't imply or require any specific representational tools that are implemented by these process theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.327,
    "end": 4281.963,
    "text": "And really going back to 14.0 and one, which I attended, but going back to that, it's, you know, Mel really described it in her paper, how the FEP fits into scientific theory and, you know, active inference and such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.443,
    "end": 4290.551,
    "text": " Yep, within the MEL, so demarcation boundary, we're saying, yes, FEP is within science, but what is it if not one of these process theories?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.051,
    "end": 4297.978,
    "text": "And it's almost like FEP is the music shop, and then the process theories are like the actual instruments that are being played.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4298.358,
    "end": 4302.623,
    "text": "And so maybe one of them is useful for one setting, or it's useful at a certain...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.263,
    "end": 4306.566,
    "text": " range of volumes or it's useful in a certain ensemble size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.006,
    "end": 4308.187,
    "text": "Those are the instruments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4308.688,
    "end": 4324.101,
    "text": "So that's the instrumentalist understanding of the FEP approach, which is why we can say that the FEP is doing things that's differentiated from other ideas, like it's a different focus on the reduction of entropy rather than the maximization of likelihood or other attributes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4324.442,
    "end": 4328.165,
    "text": "But what it's doing, it's like a workshop that's a generator in some ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.285,
    "end": 4328.745,
    "text": "And we're also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.406,
    "end": 4344.232,
    "text": " constructing the workshop along the way but what it's making actually are instruments and by clarifying that there's a workshop or an approach and the instruments that are being utilized instrumentally and then making it clear that it's a no realism zone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4344.932,
    "end": 4357.419,
    "text": " We're actually sidestepping a lot of the questions and moving straight to the utility and the ability to translate and apply instead of waiting for something that can't be resolved empirically, as we're seeing from this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.459,
    "end": 4358.56,
    "text": "So that's pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4359.0,
    "end": 4361.902,
    "text": "And the process theories in the FEP has come up in a few previous ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4362.442,
    "end": 4371.487,
    "text": "Let's go to ideas and questions that you had ever thought about related to reparia and the prediction error minimization theories of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.28,
    "end": 4384.285,
    "text": " So just some of the questions that were raised by the author, but I think that some things that are interesting to think about, like does the brain actually perform probabilistic inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4385.025,
    "end": 4390.208,
    "text": "And does it represent probability distributions in this variational base kind of way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.168,
    "end": 4410.932,
    "text": " uh and really what is what is the agent here or like the the huge the unit of agency is it like the brain or the organism or you know going to the multi-scale is it subcellular like the neuron or the or the cell or the molecule or also like groups of systems ant colonies and so forth like where is where is the agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4411.553,
    "end": 4415.318,
    "text": " there and our agents prediction machines, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4415.418,
    "end": 4426.813,
    "text": "I mean, it really like, this is the repria kind of take on this, but I think it's interesting to think about, like, does the brain really do, like, do I think I do probabilistic inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4426.874,
    "end": 4427.534,
    "text": "Maybe sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4429.076,
    "end": 4433.361,
    "text": " But do science possess the perspective of an external observer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4434.022,
    "end": 4436.004,
    "text": "This is another question that the authors raised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4436.044,
    "end": 4437.706,
    "text": "What about organisms or brains?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4438.487,
    "end": 4440.669,
    "text": "Are we observers or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4440.889,
    "end": 4442.03,
    "text": "So what do you think, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.05,
    "end": 4443.933,
    "text": "Do you have any ideas on these?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.174,
    "end": 4445.434,
    "text": "I think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.317,
    "end": 4454.22,
    "text": " It's the perfect paper to read as a starting point for the discussion, because it really does depend on whether we're a realist or an instrumentalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4454.74,
    "end": 4467.005,
    "text": "Because let's just think about computationalism, like the idea that the brain is anything like a computer or a calculator, has like anything to do with numbers, just the idea of even talking about math in relationship to the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.825,
    "end": 4475.008,
    "text": "If it's realism, like the brain is a computer versus instrumentalism, it's just a lens that we're using to apply onto the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.486,
    "end": 4492.591,
    "text": " It makes all the difference in the world because it's the difference between investigating the world and trying to decipher what it is, quote, versus knowing how to work with the world and then actually focusing our attention on the integration of our preferences and affordances with our models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.351,
    "end": 4496.292,
    "text": " So it's like a totally different mode of doing research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.652,
    "end": 4506.715,
    "text": "It's almost like in entomology, it's like the difference between doing the basic research, going out there in the desert and observing the ants versus like pest control or integrated pest management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4507.395,
    "end": 4510.896,
    "text": "It's like you do need to know about the basic biology to be effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4511.396,
    "end": 4515.898,
    "text": "So it's not just as simple as observe carefully and think carefully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4515.918,
    "end": 4519.019,
    "text": "It's like thinking carefully and observing the system are intrinsic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4519.599,
    "end": 4522.38,
    "text": "But when there's this integrated pest management mindset,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.22,
    "end": 4546.249,
    "text": " then there's a different timeline there's a different approach different way of thinking you might make a model at a different level of agency and just say yeah philosophy aside i'm going to model it as if the group of colonies is related i'm not making a claim about how they are i'm just saying this is how i have to model it because of xyz constraint so just like the instrumentalism clarifies some philosophical debates on these cognitive sciences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.446,
    "end": 4555.929,
    "text": " but it brings us right to the doorstep of other questions like our own unit of cognition, our roles and cognitive networks and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.409,
    "end": 4562.671,
    "text": "So it's a suite of questions that I like it clarified with a realism instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.971,
    "end": 4571.193,
    "text": "And it just really shows again how many downstream consequences there are of taking a research agenda that's realist versus instrumentalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.673,
    "end": 4574.154,
    "text": "But this time it's cognitive and that means it really matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.164,
    "end": 4589.032,
    "text": " So in my like background being neuroscience, I really think fundamentally like we have to understand the tools that we are working with in order to be able to do good science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4589.292,
    "end": 4592.534,
    "text": "Like, you know, coming from a bench science aspect, like you have to know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.354,
    "end": 4598.939,
    "text": " the detectable limits of your spectrophotometer if you want to measure the concentration of protein in a sample.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.999,
    "end": 4607.106,
    "text": "So it's like you need to know these limits of your machine and what exactly your machine is capable of and also what it's not capable of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4607.407,
    "end": 4616.275,
    "text": "Because you could be generating data with your instrument, but the data is not valid for one reason or another outside the limits of detection or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4616.895,
    "end": 4628.388,
    "text": " So I think that understanding the brain and what the brain does and how it works is fundamental to doing good science because that's ultimately our instrument of detection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4629.809,
    "end": 4630.83,
    "text": "Very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4630.85,
    "end": 4636.136,
    "text": "Nice to bring it to the brain as both the instrument of our detection and really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.065,
    "end": 4651.544,
    "text": " what it is like it is both and that's why and we're it and related to it or something so that's why it's kind of at this strange loop intersection let's go to the cognition in general slide so the working definition that you added was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.205,
    "end": 4658.189,
    "text": " Cognition is the mental action or process of acquiring knowledge and understanding through thought, experience, and the senses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.669,
    "end": 4667.254,
    "text": "And what were your questions or kind of prompts for those who would want to come on and participate, or what was exciting about how the paper rose these questions up for you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4671.137,
    "end": 4680.302,
    "text": "Just the whole idea of, you know, this, from, again, like the realism aspect, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.362,
    "end": 4680.723,
    "text": "Like the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.077,
    "end": 4689.283,
    "text": " Is there some way, or is it even possible, is cognition done in this Bayesian framework?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4690.104,
    "end": 4700.012,
    "text": "I know that there are ways to artificially implement this framework in a system, like in artificial intelligence or some other thing, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.572,
    "end": 4703.535,
    "text": "But do we have any of this actually going on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4703.615,
    "end": 4706.237,
    "text": "And I just wonder what other people think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4707.038,
    "end": 4709.079,
    "text": "After reading this paper that's so heavily...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4711.457,
    "end": 4713.183,
    "text": " locked us into the instrumentalist",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4715.286,
    "end": 4716.767,
    "text": " stance or perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4717.167,
    "end": 4720.107,
    "text": "I just would like to hear people's counterpoints to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4720.147,
    "end": 4724.048,
    "text": "Like I can see why the Bayesian framework is attractive for cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4724.508,
    "end": 4729.849,
    "text": "I can see that we definitely, but not always, like we don't always learn from our mistakes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.669,
    "end": 4733.23,
    "text": "We tend to like repeat the same mistake again and again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.31,
    "end": 4737.731,
    "text": "And so it's not always, there's not always, we don't always update the prior, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4737.811,
    "end": 4741.612,
    "text": "So, you know, we might miss a data point or six or 12.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4743.112,
    "end": 4757.818,
    "text": " And I just wanted to know what people's general thoughts are on whether cognition is Bayesian, what that would mean, and if it's not Bayesian, then is it anything that we can ever model mathematically, statistically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.838,
    "end": 4759.578,
    "text": "Is that a possibility?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4761.232,
    "end": 4764.774,
    "text": " Yeah, and then it's cool because the first question is Cognition Bayesian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.134,
    "end": 4765.855,
    "text": "What's the alternative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.935,
    "end": 4768.156,
    "text": "Frequentism or some other statistical?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4768.576,
    "end": 4770.798,
    "text": "And then it's like, whoa, what if it were statistical?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4770.858,
    "end": 4773.019,
    "text": "What if there was something even beyond that clade?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4773.479,
    "end": 4777.742,
    "text": "Like, that's an alternative that's local, but... And then how do we even pull back that far?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.802,
    "end": 4784.926,
    "text": "And you really raised it with this piece here, which is that language and formal logic, whether philosophical logics...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.646,
    "end": 4794.04,
    "text": " or mathematical formulas or any other type of quantitative model, it's powerful for communication, especially in our current",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4795.006,
    "end": 4817.425,
    "text": " niche but that's us today in this moment and you wrote not everyone has an internal monologue and i mean it's like not every species communicates the same way and different people have different experiences so how will we tap into all of these what if the logical is only the tip of the iceberg or just a total disinfo relative to the totality of what needs to be understood",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.655,
    "end": 4830.243,
    "text": " for effective action and that it's even local optimization to be in the linguistic or the formal domain, or it's predicated deep on assumptions that potentially are unwarranted or inaccurate themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.469,
    "end": 4833.15,
    "text": " Yeah, definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4833.31,
    "end": 4845.739,
    "text": "And I think that the authors mentioned that also, like, or maybe not language specifically, but they mentioned, you know, scientists, is this the gloss that we're, or is this like actually the meat of what we're working with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4845.799,
    "end": 4848.801,
    "text": "I don't remember like the exact line from the paper, but I'll look it up for next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4849.562,
    "end": 4854.966,
    "text": "The theory is called the Bayesian brain, not the, I use Bayesian statistics R package to study the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.706,
    "end": 4857.787,
    "text": " But that's what it would be in the instrumentalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.887,
    "end": 4864.852,
    "text": "And I think that for people will say it's for reasons of clarity will say, well, the system is doing this or this is what this protein wants to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4864.912,
    "end": 4870.035,
    "text": "It's really easy to confuse the map with the territory to go from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.055,
    "end": 4876.459,
    "text": "I'm using Bayesian equations or formats that remind me of Bayesian statistics or something I learned in a Bayesian course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.259,
    "end": 4878.64,
    "text": " I'm using that to model data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.8,
    "end": 4879.881,
    "text": "It's the Bayesian brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.301,
    "end": 4883.503,
    "text": "But again, we didn't have the linear regression brain when it was a linear regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.084,
    "end": 4887.446,
    "text": "And in some senses, that's even what DCM has underlying it as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4887.986,
    "end": 4894.711,
    "text": "And so it's really something to think about about, yeah, what are the alternatives here and how do we model it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.175,
    "end": 4896.355,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.435,
    "end": 4904.298,
    "text": "And so the authors like really provide a fresh, I thought it was refreshing anyway, because people do, they take the, you know, it's the Bayesian brain, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4904.338,
    "end": 4905.599,
    "text": "Like this is how the brain works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4905.659,
    "end": 4906.479,
    "text": "It's Bayesian, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4908.02,
    "end": 4912.182,
    "text": "And, you know, it's just like our tendency to be so anthropocentric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4912.242,
    "end": 4913.182,
    "text": "I think like we do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4913.662,
    "end": 4916.644,
    "text": " even within our, our scientific, you know, niche, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4916.804,
    "end": 4922.588,
    "text": "We take what we're studying or what we're focused on and kind of make it the center of everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4922.608,
    "end": 4930.414,
    "text": "I mean, the brain is like, in my opinion, at like the center of our universe, it is the instrument by which we detect what is going on in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.854,
    "end": 4934.757,
    "text": "So, I mean, just even at the fundamental individual unit level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4934.777,
    "end": 4935.457,
    "text": "So, so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4937.218,
    "end": 4941.66,
    "text": " if we're gonna say like, oh, this is my work and now it's the brain, this is how the brain works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4941.88,
    "end": 4956.604,
    "text": "So I think that the brain has been, you know, dissected and re, you know, imposed on so many frameworks, like going back to like Broca's area and the different like phenomenology, you know, positions in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.664,
    "end": 4962.806,
    "text": "And so everyone has kind of taken their own thing and tried to say, this is how it is and the way that the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.906,
    "end": 4965.567,
    "text": "And, you know, maybe it's not as simple as that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4967.0,
    "end": 4984.729,
    "text": " Agreed, but it's just such a more helpful framing to say, well, my model of the world versus your model of the world, and then my values are ABC in that order, and you explain this fraction of the variance with this input, and here's your values, and let's figure out what model is going to be tractable for all of us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.249,
    "end": 4996.315,
    "text": "Versus worldview versus worldview, it's even without going down the Goodell incompleteness rabbit hole, worldview versus worldview is a difficult discussion to have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4996.875,
    "end": 5004.322,
    "text": " because you're talking past one another with the vocabulary, with the narrative, with so many other aspects, but modeling is a shared framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5004.722,
    "end": 5014.891,
    "text": "Now, the question is, does that artificially or unduly constrain the discussion in a way where leaving the worldview level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.897,
    "end": 5017.718,
    "text": " Who really knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5017.758,
    "end": 5019.399,
    "text": "These are like some of the coolest things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.439,
    "end": 5021.12,
    "text": "So I think let's go to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.18,
    "end": 5022.521,
    "text": "Well, we have a few more slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.541,
    "end": 5023.762,
    "text": "So let's kind of go through it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5023.822,
    "end": 5029.066,
    "text": "Like that's a perfect segue right to the next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5029.266,
    "end": 5031.448,
    "text": "And this is I put this in here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5032.128,
    "end": 5033.749,
    "text": "This is the brain versus the mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.809,
    "end": 5033.99,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5034.07,
    "end": 5039.454,
    "text": "And I think that the authors here use that term at least in this place interchangeably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5040.314,
    "end": 5041.415,
    "text": " And I'll just read this really quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.816,
    "end": 5043.117,
    "text": "One must be on the guard in this respect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5043.197,
    "end": 5048.683,
    "text": "Organisms or brains, unlike scientists, do not possess a perspective of an external observer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5049.784,
    "end": 5053.487,
    "text": "Thinking that it does requires a sound argument that is not yet offered in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5053.608,
    "end": 5060.094,
    "text": "In fact, the hypothesis for the brain as an ideal observer has been often rejected in the literature most recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5062.176,
    "end": 5065.439,
    "text": " Brett 2019, Hippolyto et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.459,
    "end": 5066.42,
    "text": "2020 as a bad metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5066.44,
    "end": 5073.045,
    "text": "And then another group of citations, Murski and Burkhardt, Reek 2019.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.646,
    "end": 5076.208,
    "text": "In agreement with this, Murski et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5076.228,
    "end": 5078.83,
    "text": "2020 called for encultured minds in replacement",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5079.29,
    "end": 5080.791,
    "text": " of error reduction minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5081.931,
    "end": 5095.295,
    "text": "And that like just totally ties back to what you were just saying, you know, the different worldview, like the encultured mind, it's gotta be from which culture and, you know, can we speak the same language if we're not both enculturated in the same way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5095.555,
    "end": 5101.576,
    "text": " And also the encultured mind can be carrying out error reduction or surprise residual reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5101.897,
    "end": 5108.718,
    "text": "But error reduction as the number one leading point is like, well, who is anyone to know what the gold standard is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5109.318,
    "end": 5111.899,
    "text": "Whereas when you start with encultured minds, like what are minds?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5111.979,
    "end": 5112.879,
    "text": "Well, they're encultured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.959,
    "end": 5113.739,
    "text": "It's developmental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5113.819,
    "end": 5114.66,
    "text": "It's very specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.12,
    "end": 5115.74,
    "text": "What are they doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.84,
    "end": 5123.882,
    "text": "Well, among other things, they're balancing error and surprise, not down to zero, but they're balancing it because they're encultured in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.542,
    "end": 5127.103,
    "text": " So we've started from how things kind of actually are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5127.123,
    "end": 5141.011,
    "text": "So it's almost starting with realism or naivety and then just asking whether the instruments can cover the space rather than thinking we're going to have the realism and like the scope to describe how it really is across the space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5141.031,
    "end": 5147.434,
    "text": "And some cultures really are this way and other cultures are really that way versus I made a model and this parameter ranges from 12 to 50.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.474,
    "end": 5147.874,
    "text": "So continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5150.906,
    "end": 5153.408,
    "text": " And then I just pulled these definitions out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5153.528,
    "end": 5166.016,
    "text": "Mind is defined as, I think Google or someone, the element of a person that enables them to be aware of their world and their experiences, to think and to feel, the faculty of consciousness and thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.877,
    "end": 5173.241,
    "text": "And then the brain is an organ of soft nervous tissue contained in the skull of animals functioning as the coordinating center of sensation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.721,
    "end": 5175.923,
    "text": " and intellectual and nervous activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.943,
    "end": 5182.31,
    "text": "And I would be curious to hear whether people think that these are the same thing, are they related?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5182.53,
    "end": 5184.012,
    "text": "Is the brain where the mind is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5184.032,
    "end": 5189.117,
    "text": "And is it okay to use these two terms interchangeably?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.137,
    "end": 5195.664,
    "text": "And what is, yeah, I think we've talked about error reducing mind versus injured mind, so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5196.084,
    "end": 5197.185,
    "text": " Are they one kind of thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5197.405,
    "end": 5197.906,
    "text": "Monism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5198.146,
    "end": 5199.387,
    "text": "Are they two kinds of things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5199.667,
    "end": 5200.168,
    "text": "Dualism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5200.468,
    "end": 5203.21,
    "text": "Is there a qualification of monism or dualism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5204.251,
    "end": 5212.098,
    "text": "I also remember just in the past few days, forget where, heard something like the roots in the mind and the fruits in the brain or it was vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5212.118,
    "end": 5219.045,
    "text": "And I thought, well, it could go either way because that's really the debate is whether matter generates mind or whether mind generates matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5219.525,
    "end": 5223.928,
    "text": " But Blue, we're a co-determination, but another day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5224.428,
    "end": 5227.85,
    "text": "Let's go to this kind of closing section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.37,
    "end": 5229.271,
    "text": "So it's written here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5229.591,
    "end": 5236.035,
    "text": "The FVP is thus best seen as a research heuristic, a particular lens through which we can view and carve up the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5236.835,
    "end": 5252.181,
    "text": " associated process theories is like we'll make our joints as we go associated process theories then are concerned with how the fep is realized in real world systems this crucial distinction sets us to realize that the fep the fep does not imply process aspects or features",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5253.803,
    "end": 5261.151,
    "text": " tandem duplication, paralogue, such as representations pertaining to the theoretical processes that aim to explain how the principle is realized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.751,
    "end": 5266.756,
    "text": "Yet the FEP does not in itself imply the representational tools implied by these process theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5267.197,
    "end": 5270.32,
    "text": "So again, there's a distinction between the principle and the process theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5270.48,
    "end": 5274.684,
    "text": "So the instrument shop and the instruments themselves, that's like the principle to the process theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5275.105,
    "end": 5275.385,
    "text": "And then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.326,
    "end": 5284.615,
    "text": " Again, the representational dimension is take it or leave it, and it turns out that neither form of representationalism is going to save realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5285.335,
    "end": 5291.822,
    "text": "And whatever you think about representationalism, as long as you're on the instrumentalist side, it's all good, and there's a debate to be had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.663,
    "end": 5295.986,
    "text": "And then, the bottom quote, there is within this more modest framework...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.88,
    "end": 5316.362,
    "text": " of FEP, still plenty of insight to be gained into the workings of life and cognition by way of dynamic causal modeling, which is why we spent the time to go through it and why it's worth it to read the textbook, because if this paper is on the right track, then take it seriously what it says, which is that dynamic causal modeling is underlying the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.023,
    "end": 5322.746,
    "text": " So metaphors, you plow through them and you're going to get to something that has to be modeled like the DCM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5323.306,
    "end": 5328.648,
    "text": "In sum, we argue that the modesty and ambition go hand in hand when it comes to models and the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.328,
    "end": 5329.608,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.989,
    "end": 5330.789,
    "text": "Great closing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.249,
    "end": 5339.573,
    "text": "So Blue, any thoughts on this or what are these insights that we can gain into life and mind and brain cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.073,
    "end": 5342.314,
    "text": "And what else are you curious or excited about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5345.927,
    "end": 5353.332,
    "text": " So I'm curious and excited to hear really what people think about the mind, the brain, cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5353.472,
    "end": 5354.652,
    "text": "Is cognition done in the mind?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5354.732,
    "end": 5355.933,
    "text": "Is cognition done in the brain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5356.754,
    "end": 5357.674,
    "text": "Where does that happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5358.035,
    "end": 5361.577,
    "text": "Where does an activism fit into this kind of framework?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5362.398,
    "end": 5364.099,
    "text": "It is another like parting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5364.699,
    "end": 5368.642,
    "text": "And so I'm excited really to hear what people have to say in the dialogue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.722,
    "end": 5374.726,
    "text": "I could talk about what I think all day long, but I really would like to listen to what others have to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5375.686,
    "end": 5376.227,
    "text": " I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5377.447,
    "end": 5385.07,
    "text": "Also, getting into the 16.0, I think this is a fabulous lead up to discussing consciousness in 16.0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5386.091,
    "end": 5386.471,
    "text": "Agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5386.491,
    "end": 5388.051,
    "text": "It's all part of a sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.071,
    "end": 5388.732,
    "text": "I would say I'm...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5389.912,
    "end": 5396.593,
    "text": " excited for both the authors to join for both weeks and also for hopefully new and old participants to join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5397.293,
    "end": 5403.495,
    "text": "And just to hear everyone's perspective, like before I read the paper, I felt this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5404.075,
    "end": 5410.856,
    "text": "Then when I was reading the paper, I thought I stopped here and I took a break here and I took a week off here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5410.876,
    "end": 5416.537,
    "text": "I thought about this part and I cut out this part and I highlighted this part, like what this question arose, just,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5416.977,
    "end": 5417.758,
    "text": " What was the before?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5418.178,
    "end": 5420.399,
    "text": "What happened during working through the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5420.94,
    "end": 5423.401,
    "text": "If you had 20 minutes before the meeting, it's chill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.441,
    "end": 5424.942,
    "text": "You can still read a few sentences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5425.042,
    "end": 5426.203,
    "text": "Something will still pop out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5426.783,
    "end": 5436.049,
    "text": "And then we capture that as it's happening with our discussions and we bring out things that people can't bring out alone or in dialogue with the paper itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5436.79,
    "end": 5438.951,
    "text": "And then it's like how we're going to move forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.051,
    "end": 5444.815,
    "text": "And so how does it change how we work with the FEP and active inference, how we communicate it and do it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5445.515,
    "end": 5473.875,
    "text": " to be instrumentalist how do we be instrumentalist through and through so that we don't put out the realist bait and tell people the fep is a grand unifying theory of how things are okay well that's a realist claim so how do we start with the instrumentalist approach in our minds understanding this paper and conversing with the authors and hearing from those who are just learning at all different stages and then imbue that into our full stack approach to making tools",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5475.345,
    "end": 5483.888,
    "text": " onboarding and accessibility, just all these other aspects of what we do related to FEP and active inference, what are the implications for instrumentalism in those cases?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5484.528,
    "end": 5486.709,
    "text": "And that will be pretty fun to find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5486.729,
    "end": 5489.229,
    "text": "Definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5489.449,
    "end": 5492.03,
    "text": "Oh, then let's close with a tragedy because this is the denouement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5495.543,
    "end": 5498.664,
    "text": " I control F'd, but I didn't find tragedy in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5499.324,
    "end": 5506.406,
    "text": "So thinking it's, you know, it's the dog that doesn't bark in the night because it's the tragedy is the title of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5506.626,
    "end": 5507.766,
    "text": "But what is the tragedy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.346,
    "end": 5514.668,
    "text": "And so this quote, they write, the difference between realism and instrumentalism is primarily ontological in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5515.168,
    "end": 5519.329,
    "text": "In realism, there's an ontological claim with regards to the status of models and living systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5519.689,
    "end": 5523.29,
    "text": "In instrumentalism, there's no such ontological claim about how things are, ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5523.83,
    "end": 5531.174,
    "text": " This may be seen as a weakness as though it looks as though the instrumentalist position only gives up explanatory ambitions relative to the FEP realist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5531.534,
    "end": 5537.356,
    "text": "So in other words, is the instrumentalist just picking a lower target, an easier target?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.376,
    "end": 5539.537,
    "text": "And so like, yay, we did it, but it's like too easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.577,
    "end": 5540.318,
    "text": "It's not useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.478,
    "end": 5543.059,
    "text": "Actually, we need full-blown realism to be effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5543.719,
    "end": 5544.2,
    "text": "This is true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5545.18,
    "end": 5545.98,
    "text": " Devastating, true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5546.401,
    "end": 5549.942,
    "text": "However, the ambitions given up on, we argue, are never gonna be met.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5550.362,
    "end": 5559.587,
    "text": "So it was a delusion for the first thought or for those who were aiming, it's great, shoot for the moon, end up in the stars or whatever, but that was not the right target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5560.487,
    "end": 5564.829,
    "text": " If this is going on the right track, the realist's ambition is a fata morgana, if you will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.429,
    "end": 5569.831,
    "text": "As such, instead of chasing ghosts, the instrumentalist's position is more realistic in their ambition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5570.412,
    "end": 5571.272,
    "text": "And so that was pretty fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5571.292,
    "end": 5582.057,
    "text": "I had to look up what it was, but it's this visual illusion on the horizon over water or over the desert that does all different kinds of visual effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5582.397,
    "end": 5585.718,
    "text": "Blue, you probably see it in the southwest in the desert when you're driving and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5586.039,
    "end": 5588.72,
    "text": "It could look like a boat or a car or a river or mercury.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5589.46,
    "end": 5591.322,
    "text": " And so it's kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5591.342,
    "end": 5593.564,
    "text": "It's like we're in a desert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5593.945,
    "end": 5596.107,
    "text": "There's a real niche that is challenging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5596.627,
    "end": 5603.594,
    "text": "Either there's relative competition within the niche or all the agents in the niche just get wiped off the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5603.854,
    "end": 5606.817,
    "text": "So we're in a scenario that involves doing inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5607.558,
    "end": 5607.678,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5608.639,
    "end": 5616.565,
    "text": " It might feel good to have a delusional target, but in the end, we need policy that works and keeps us alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5617.045,
    "end": 5621.888,
    "text": "And so we don't want to get tied up with illusions of what things could be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5622.289,
    "end": 5628.253,
    "text": "We want to be on a path towards utility, but also bringing in all these other nuanced characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5628.573,
    "end": 5632.215,
    "text": "So it's a tough question, and it's a beautiful illusion and allegory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5632.235,
    "end": 5635.217,
    "text": "And so I was just wondering, what is the tragedy or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.178,
    "end": 5639.361,
    "text": " Is realism a tragedy or what is the tragedy in this case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5639.702,
    "end": 5641.504,
    "text": "Blue, before we look at the definition of tragedy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5643.506,
    "end": 5650.132,
    "text": "In this case, I think that the tragedy is that representationalism is not even applicable in the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5650.493,
    "end": 5657.18,
    "text": "So in the end, that's my tragedy because I'm so attached to my representationalist standpoint, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5657.97,
    "end": 5661.651,
    "text": " Let's go to what the final slide here is, just the definition of tragedy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5662.331,
    "end": 5669.452,
    "text": "We won't read it, but it was just pretty interesting to see that tragedy has meant different things over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.272,
    "end": 5677.934,
    "text": "Of course, it's been used in different ways, but it's sort of like an inciting incident, a plot reversal, and then there's the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5678.074,
    "end": 5680.214,
    "text": "And then there's a catharsis and a new resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5680.435,
    "end": 5682.195,
    "text": "Melt, thaw, resolve itself into a dew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5682.995,
    "end": 5685.796,
    "text": " Except in this case, it's DO because it's doing stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.197,
    "end": 5690.899,
    "text": "So it's sort of like the prior and then the update or the stimuli or the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.919,
    "end": 5692.42,
    "text": "And then there's something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5693.56,
    "end": 5702.285,
    "text": "The resolution could be the same as the beginning or the person could have resolved and everyone could have gone home with a different set of whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5702.885,
    "end": 5705.927,
    "text": "But it has this format that's the minimal resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5706.647,
    "end": 5728.67,
    "text": " problem reaction solution or prior update posterior so pretty interesting to see how tragedy has a connotation of like sad it was a tragedy what happened it's like oh something sad must have happened but this is almost neutral and it's like saying oh it's a tragedy what happened it's like what happened what was the update what was the plot reversal that led to the outcome so very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5729.753,
    "end": 5732.535,
    "text": " nuanced reference and very interesting by the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5733.175,
    "end": 5735.337,
    "text": "So here are the final questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5735.377,
    "end": 5737.778,
    "text": "Blue, any last thoughts on anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.838,
    "end": 5738.799,
    "text": "Otherwise, we'll close it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5740.134,
    "end": 5741.295,
    "text": " No, I think we're good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5741.455,
    "end": 5742.796,
    "text": "I'm excited for the dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5742.936,
    "end": 5746.959,
    "text": "Thanks so much for joining, for participating, being the live participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5747.479,
    "end": 5754.424,
    "text": "Everyone's welcome to follow up, add comments on any platform or get in touch with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5755.084,
    "end": 5756.865,
    "text": "It's just going to be a good conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5757.826,
    "end": 5758.326,
    "text": "Thanks again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5758.486,
    "end": 5763.89,
    "text": "Really special to have our first .0 dialogue and everyone's welcome on .0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5764.05,
    "end": 5766.251,
    "text": "Everyone's welcome on .1, .2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5766.752,
    "end": 5768.453,
    "text": "Just get in touch if you want to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5770.598,
    "end": 5772.955,
    "text": " see you later bye bye thanks",
    "speaker": "SPEAKER_00"
  }
]