[
  {
    "start": 26.701,
    "end": 26.981,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.461,
    "end": 32.344,
    "text": "Hello and welcome everyone to ACT-INF Lab live stream number 39.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.904,
    "end": 36.466,
    "text": "It's February 25th, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.347,
    "end": 39.807,
    "text": "Welcome to the ACT-INF Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.428,
    "end": 46.27,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.791,
    "end": 49.052,
    "text": "You can find us at the links here on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.012,
    "end": 55.435,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.417,
    "end": 62.38,
    "text": " All backgrounds and perspectives are welcome, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.681,
    "end": 76.467,
    "text": "If you want to learn more about .coms, which is the organizational unit that puts on all these live streams and many other products or any of the other activities in the Actinf lab, go to actininference.org.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.028,
    "end": 78.268,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.588,
    "end": 78.708,
    "text": "Well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.424,
    "end": 92.0,
    "text": " Today, in Act-Inf Stream number 39.0, the goal is to learn and discuss this really awesome paper called Morphogenesis as Bayesian Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.24,
    "end": 99.305,
    "text": " A Variational Approach to Pattern Formation and Control in Complex Biological Systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.086,
    "end": 105.47,
    "text": "It's by Franz Kuchling, Karl Fristen, Georgi Georgiev, and Michael Levin from 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.351,
    "end": 113.376,
    "text": "And just like all the .Zero videos, and indeed all our videos, it's just an introduction to some of these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.497,
    "end": 115.638,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.559,
    "end": 123.522,
    "text": " That being said, we're going to go over the aims, claims, abstract, roadmap, keyword, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.622,
    "end": 124.123,
    "text": "of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.643,
    "end": 134.388,
    "text": "And then with a focus on the first parts of the paper and less so on the formalism and more on the big ideas, we're going to go over the paper and the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.288,
    "end": 162.048,
    "text": " that will put us in a good position cognitively or morphologically we might even say for the discussions in the coming weeks 39.1 and 39.2 when we'll get to unpack this so if you would like to it'd be awesome to have you participate live or if it's past 39.2 you can still ask questions all right we'll start with introductions and warm-ups we can each",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.365,
    "end": 175.096,
    "text": " say hi, and maybe one thing that was exciting or interesting about the paper, which I'll reserve for after you, but I'm Daniel, I'm a researcher in California, and Dean, thanks a ton for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.008,
    "end": 200.908,
    "text": " thanks Natalie I'm Dean I'm here in Calgary and what really got me excited about this was the idea that they talked a little bit later closer to the end we may not even talk about it today is the role that epigenetics might play in terms of how cells behave and and what sorts of things we might be able to turn in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.974,
    "end": 220.906,
    "text": " simply what we see in biological form into some sort of static statistical prediction device so i'm really excited about that awesome yeah it's a complex paper about complex systems so we'll see what we can get done today but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.642,
    "end": 234.35,
    "text": " I'm really excited to bring active inference into this domain, at least as far as our discussions go into the morphological and the morphogenetic areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.271,
    "end": 248.92,
    "text": "And it's just bringing like another lens, another way that we can apply active inference as a filter, another set of phenomena that we're bringing into this active inference realm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.841,
    "end": 277.479,
    "text": " so we'll just go right into the big question so i'll read this and then feel free to give a thought the big question or at least one way to put one of the questions is how can we find an integrative path between math and morphogenesis morphogenesis means form like physical form morpho and genesis meaning how it arises so how does physical form arise and how is that related to math",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.627,
    "end": 280.529,
    "text": " And to kind of unpack that, here's some quotes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.59,
    "end": 297.926,
    "text": "The molecular mechanisms, which are like signaling pathways of all different kinds, underlying development and regeneration in biological organisms have undergone a tremendous amount of knowledge gain in the last several years due to genomics and biotechnology advances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.192,
    "end": 302.134,
    "text": " So that's kind of the one side with the biological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.534,
    "end": 324.11,
    "text": "And then from the mathematical and the formal, the emerging field of the free energy principle in pattern formation, not always morphogenetic patterns, but could be cognitive patterns, rhythmic patterns, provides an essential quantitative formalism for understanding cellular decision-making in the context of embryogenesis, regeneration, and cancer suppression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.291,
    "end": 326.292,
    "text": "So if that's the if,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.611,
    "end": 338.902,
    "text": " Then how might the mathematical formalism reveal new understandings about developmental change in evolution and for designing new interventions in regenerative medicine settings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.423,
    "end": 340.784,
    "text": "So what did you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.22,
    "end": 352.287,
    "text": " Well, I just love any time that two things that seem disparate or distant are brought together, because I think all sorts of good things can happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 352.788,
    "end": 354.009,
    "text": "And I'm going to do a little shout out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 354.069,
    "end": 367.099,
    "text": "That's kind of what I would like to see if we can organize in August with a couple of other papers that don't start out necessarily appearing to be close or proximal, but by bringing them together, all kinds of interesting things can happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.675,
    "end": 368.935,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.276,
    "end": 373.839,
    "text": "Okay, to the main aims and claims of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.5,
    "end": 380.685,
    "text": "So the paper is in Physics of Life Reviews 2020, and we already mentioned the title and the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.766,
    "end": 389.272,
    "text": "Just to select a few aims that the authors represent, and then a couple of key claims that are relevant for the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.992,
    "end": 401.36,
    "text": " So as far as aims go, one of their aims is to introduce an overarching concept that can predict the emergence of form and the robust maintenance of complex anatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.982,
    "end": 403.942,
    "text": "Another aim is to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.236,
    "end": 420.989,
    "text": " derive the mathematics behind Bayesian inference and use simulations to show, simulations that are consistent and within the Bayesian framework, to show that the formalism can reproduce experimental top-down manipulations of complex morphogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.51,
    "end": 427.334,
    "text": "And then just a few of their claims, more of which we'll be unpacking in the coming minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.375,
    "end": 430.197,
    "text": "Classic, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.257,
    "end": 432.479,
    "text": "dynamical systems and analytical mechanics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.276,
    "end": 445.023,
    "text": " Approaches such as last least action principles are difficult to use when characterizing open, far from equilibrium systems that predominate in biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.603,
    "end": 458.492,
    "text": "So that's kind of a big challenge that's come up again and again, which is we might have really great equations for a pendulum, maybe even a pendulum with friction, but how about an active pendulum that's doing strategy and trying to run away from you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.972,
    "end": 460.774,
    "text": "A bit harder to put those same equations on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.196,
    "end": 480.621,
    "text": " The Bayesian inference framework treats cells as information processing agents, where the driving force behind morphogenesis is the maximization of a cell's model evidence, which is to say it's reduction of uncertainty relative to a generative model, which is what we're gonna be unpacking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.561,
    "end": 490.224,
    "text": "And we had previously read this about how they're applying free energy principle to morphogenesis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.209,
    "end": 511.595,
    "text": " when it goes well, like during embryogenesis and results in a zygote becoming like an adult life form, as well as all of the ways that it's maintained during that stationarity of healthy life and including cases where it might be relevant to even think about making interventions like medical settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.315,
    "end": 513.855,
    "text": "So those are a few of the aims and claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.956,
    "end": 515.716,
    "text": "Anything to add on it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.738,
    "end": 517.499,
    "text": " Yeah, just real quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.619,
    "end": 527.168,
    "text": "It's really interesting that they said top-down, and then we're going to see some slides where there's a top-top and a down-down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.549,
    "end": 533.614,
    "text": "So stick around, because there's actually going to be something kind of interesting happening here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 534.996,
    "end": 535.276,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.177,
    "end": 541.302,
    "text": "How about you read the first half of the top half of this abstract slide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.11,
    "end": 542.55,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.93,
    "end": 564.237,
    "text": "Recent advances in molecular biology, such as gene editing, bioelectric recording and manipulation, and live cell microscopy, using fluorescent reporters, especially with the advent of light-controlled protein activation through optogenetics, have provided the tools to measure and manipulate molecular signaling pathways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.755,
    "end": 567.436,
    "text": " with unprecedented spatial temporal precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.976,
    "end": 575.478,
    "text": "This has produced ever increasing detail about the molecular mechanisms underlying development and regeneration in biological organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.558,
    "end": 587.282,
    "text": "However, an overarching concept that can predict the emergence of form and the robust maintenance of complex anatomy is largely missing in the field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.396,
    "end": 589.837,
    "text": " Classic, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.897,
    "end": 604.768,
    "text": "dynamic systems and analytical mechanics, approaches such as least action principles are difficult to use when characterizing open, far from equilibrium systems that predominate in biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.808,
    "end": 610.532,
    "text": "Similar issues arise in neuroscience when trying to understand neuronal dynamics from first principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.572,
    "end": 616.917,
    "text": "So they're basically covering their basis here by making sure that we understand this is open systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.076,
    "end": 619.356,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.137,
    "end": 635.952,
    "text": "Increases in tools in biological systems like genomics, microscopy, optogenetics are helping us reduce our uncertainty about the what, but without a bit more information about the how and the why, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.572,
    "end": 639.114,
    "text": "That's the overarching concept that's largely missing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.815,
    "end": 642.396,
    "text": " So we can grind up the cells and sequence the genome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.896,
    "end": 647.058,
    "text": "We can extract the RNA and we can even tell what the ratio of different RNA molecules is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.578,
    "end": 663.525,
    "text": "But it turns out that that type of information alone doesn't help us understand why two related species or the same species in two different contexts or the same genome in two different tissues or the same tissue in two different environments has such different morphology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.685,
    "end": 666.406,
    "text": " Okay, and then the second half.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.006,
    "end": 675.55,
    "text": "In this neurobiology setting, a variational free energy principle has emerged based upon a formulation of self-organization in terms of active Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.69,
    "end": 681.913,
    "text": "The free energy principle has recently been applied to biological self-organization beyond the neurosciences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.873,
    "end": 696.199,
    "text": " For biological processes that underwrite development or regeneration, the Bayesian inference framework treats cells as information processing agents, where the driving force behind morphogenesis is the maximization of a cell's model evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.279,
    "end": 703.482,
    "text": "This is realized by the appropriate expression of receptors and other signals that correspond to the cell's internal, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.542,
    "end": 709.245,
    "text": "generative, model of what type of receptors and other signals it should express.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.155,
    "end": 739.908,
    "text": " emerging field of the free energy principle in pattern formation provides an essential quantitative formalism for understanding cellular decision making in the context of embryogenesis regeneration and cancer suppression okay and then if you read the first um two parts here on the second slide yeah no problem in this paper we derive the mathematics behind bayesian inference as understood in this framework and use simulations to show that formalism can reproduce",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.041,
    "end": 741.501,
    "text": " Interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 742.081,
    "end": 746.503,
    "text": "Experimental top-down manipulations of complex morphogenesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.224,
    "end": 758.028,
    "text": "First, we illustrate the first principle approach to morphogenesis through simulated alterations of anterior-posterior axial polarity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.729,
    "end": 764.051,
    "text": "The induction of two heads or two tails, ah, spoiler alert, as a planarian regeneration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.492,
    "end": 768.453,
    "text": "Don't you hate it when the abstract spoils the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.795,
    "end": 786.132,
    "text": " Then we consider aberrant signaling and functional behavior of a single cell within a cellular ensemble as a first step in carcinogenesis, the formation of cancer, as false beliefs about what a cell should sense and do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.912,
    "end": 789.816,
    "text": "Inference, perception, action, inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.848,
    "end": 806.212,
    "text": " we further show that simple modifications of the inference process can cause and rescue mis-patterning of developmental and regenerative events without changing the implicit generative model of a cell as specified, for example, by its DNA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.292,
    "end": 817.795,
    "text": "This formalism offers a new roadmap for understanding developmental change in evolution and for designing new interventions in regenerative medicine settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.944,
    "end": 823.346,
    "text": " Speaking of the new roadmap, let's look at the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.346,
    "end": 828.748,
    "text": "Kind of cool that they actually say that it is providing a roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 828.808,
    "end": 831.169,
    "text": "So we've talked about guides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.189,
    "end": 833.77,
    "text": "We've talked about roadmaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.93,
    "end": 836.691,
    "text": "Where do you see all of that before we look at the section titles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 839.893,
    "end": 846.555,
    "text": "Well, where a guide, I think, basically gives sort of gives you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.732,
    "end": 856.519,
    "text": " The parameters, I think a roadmap is a lot more specific in terms of the sequencing, but that's just my interpretation of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.539,
    "end": 866.348,
    "text": "I think other people can interpret roadmap differently in terms of sort of the relational aspect of how the different parts come together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.368,
    "end": 873.415,
    "text": "And we've talked about that in other live streams, but I don't want to get bogged down in this part right now because I think we got a lot of stuff to cover here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.434,
    "end": 874.594,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.994,
    "end": 875.234,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.575,
    "end": 879.176,
    "text": "So the paper begins with an introduction to Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.517,
    "end": 887.54,
    "text": "Section two is mathematical foundations that are building on Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.18,
    "end": 897.704,
    "text": "So going from kind of Bayes' theorem to several dynamical systems representations, some of which we've discussed before, others which will push it into a little bit of a new area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.325,
    "end": 900.625,
    "text": "Then the key",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.492,
    "end": 925.063,
    "text": " contribution and the focus of the paper is modeling morphogenesis and so instead of just presenting bays and then variational bays and then free energy minimization on a bacterium like we saw axel constant do in live stream number 34 we're going to take that momentum and move it towards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.38,
    "end": 951.169,
    "text": " application of modeling in morphogenesis and that's where we'll talk about like what model they construct and how it relates to some of the formalisms that were brought up earlier and then there's a discussion and conclusion section which we won't go too much into today in the dot zero but it's going to be awesome to go into it in the dot one and dot two because there's a ton of awesome content and material",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.817,
    "end": 964.462,
    "text": " So here's the keywords that were listed and we won't go into most of them just to say that they're gonna come up in this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.963,
    "end": 971.246,
    "text": "We have free energy principle, Bayesian inference, morphogenesis and developmental biology regeneration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.267,
    "end": 974.908,
    "text": " Kind of got some mathematical stuff we've seen before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.588,
    "end": 993.074,
    "text": "We have a triad of developmental biology, which broadly understood includes embryogenesis, as well as aging and cancer and all these other developmental things that happen during biology and top-down modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.515,
    "end": 996.276,
    "text": "And maybe we'll see what that means coming up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.376,
    "end": 999.717,
    "text": "Okay, well, to get right into it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.061,
    "end": 1004.524,
    "text": " Section one is an introduction to Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.205,
    "end": 1011.709,
    "text": "So here's a nice picture by Sasha and here are the opening lines of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.09,
    "end": 1015.692,
    "text": "They wrote, and then feel free to give a thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.472,
    "end": 1022.117,
    "text": "Evolutionary change results from mutations in DNA and selection acting on functional bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.137,
    "end": 1033.902,
    "text": " Thus, it is essential to understand how the hardware encoded by the genome enables the behavioral plasticity of cells that can cooperate to build and repair complex anatomies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.983,
    "end": 1052.812,
    "text": "Indeed, most problems of biomedicine, repair of birth defects, regeneration of traumatic injury, tumor reprogramming, et cetera, could be addressed if prediction and control could be gained over the processes by which cells implement dynamic pattern homeostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.49,
    "end": 1081.336,
    "text": " fundamental knowledge gap and opportunity of the next decades in the biosciences is to complement bottom-up molecular understanding of mechanisms with a top-down computational theory of cellular decision making and info taxes movement towards information so dean what do you think what should we study and why and how is this related to active and fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.629,
    "end": 1087.131,
    "text": " Okay, well, my background in genetics is near zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.572,
    "end": 1097.438,
    "text": "But what I did come away from with that last bullet in particular was one of the things that I beat like a dead animal, which is that you need a minimum of two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.959,
    "end": 1111.368,
    "text": "And I think that the bottom-up sort of building blocks aspect of it with the top down, how do we get a better grip on what the signals are that are passing between all of those bricks was really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.528,
    "end": 1113.369,
    "text": "And so carrying on through,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.771,
    "end": 1119.157,
    "text": " I kind of wanted to open that up and see what that marriage looked like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.34,
    "end": 1121.64,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.982,
    "end": 1128.43,
    "text": "So speaking as someone who started in the science journey with genetics, pretty much,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.835,
    "end": 1137.96,
    "text": " It always was so interesting how genetics would frame itself as if the bottom-up information flow could just simply replace theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.28,
    "end": 1146.126,
    "text": "We'll sequence so many genomes, we won't need to speculate about evolution, or we'll have your genome, so we won't even need to ask about what medicine is best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.066,
    "end": 1155.472,
    "text": "And that's kind of this bottom-up molecular understanding, which is vital, it's essential, it's important, it's changing a lot, but it's this bottom-up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.412,
    "end": 1161.434,
    "text": " subunit description, the what and the where of the subunits and how they touch and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.114,
    "end": 1170.576,
    "text": "And that is always met implicitly and increasingly explicitly with a top-down theory of cellular decision-making and infotaxis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.117,
    "end": 1178.359,
    "text": "And so we're always kind of meeting in the middle with empirical wet lab biology, revealing these mechanisms and these findings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.239,
    "end": 1188.161,
    "text": " and we're meeting that as researchers doing model-based science with what are being called here top-down modeling, top-down computational theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.522,
    "end": 1194.663,
    "text": "Okay, that's just how they open up and also set a challenge for the coming decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.383,
    "end": 1198.164,
    "text": "It's their expectation of the next few decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.564,
    "end": 1204.786,
    "text": "Then they provide a math roadmap, which is an awesome paragraph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.788,
    "end": 1213.572,
    "text": " So they write, we lay out the mathematical foundations of a type of Bayesian modeling that they're going to use to simulate pattern formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.252,
    "end": 1216.313,
    "text": "So red, Bayesian modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.294,
    "end": 1227.058,
    "text": "Orange, we start by identifying a Lyapunov function that can be used to analyze and solve any dynamic system using the fundamental theorem of vector calculus, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.078,
    "end": 1228.299,
    "text": "the Helmholtz decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.179,
    "end": 1234.142,
    "text": "So we're using Bayesian modeling and layering in what we'll talk about soon, the Lyapunov function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.282,
    "end": 1235.522,
    "text": " green.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.062,
    "end": 1245.905,
    "text": "We use it to characterize the generalized flow of systemic states of the whole system in terms of conversions to a non-equilibrium steady state, a NES.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.405,
    "end": 1248.125,
    "text": "Next layer, blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.606,
    "end": 1254.227,
    "text": "We then introduce the notion of a Markov blanket that separates the external and internal states of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.108,
    "end": 1257.408,
    "text": "And finally, purple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.348,
    "end": 1260.869,
    "text": "We can then replace the Lyapunov function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.486,
    "end": 1280.399,
    "text": " with a variational free energy function to solve for the evolution of internal and active states, that's of the particle, and thereby characterize self-organization in far from equilibrium systems that can be partitioned into a cell and an external milieu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.923,
    "end": 1284.045,
    "text": " That's the math that they go through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.645,
    "end": 1285.626,
    "text": "That's the math rainbow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.246,
    "end": 1298.796,
    "text": "Then sections after that apply this formalism to illustrate morphogenesis and neoplasia, which is the growth of new forms, neoplasia, using simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.577,
    "end": 1305.021,
    "text": "And what's so cool is this trajectory from 400 to 700 nanometers, from the base,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1309.07,
    "end": 1331.588,
    "text": " through the vector calculus and flow states to the finding or the figuring out of a Markov blanket and then the usage of the Markov partitioning legitimated by the orange and the green steps to find a heuristic way to go about solving what was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.714,
    "end": 1334.875,
    "text": " needing to be addressed right in the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.615,
    "end": 1339.117,
    "text": "We've seen some variants of this trajectory multiple times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.778,
    "end": 1343.019,
    "text": "And then in this paper, they study morphogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.66,
    "end": 1345.581,
    "text": "And so then they model morphogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.281,
    "end": 1361.709,
    "text": "But save for a couple of words, a different paper could have said, we do the Bayes thing, the Lyapunov thing, the Helmholtz, the Ness, the Markov, and then we're back to doing far from equilibrium strategy in online teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.799,
    "end": 1364.58,
    "text": " And then we applied it to online teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.18,
    "end": 1368.241,
    "text": "And so let's keep in mind, like the paper can be long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.381,
    "end": 1382.725,
    "text": "There are a lot of equations, but where is this broader trajectory that's helping us fine tune our regime of attention and update our generative model about what we are doing here and how it's different than other approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.465,
    "end": 1387.306,
    "text": "And then where is the part that's actually studying morphogenesis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.207,
    "end": 1390.627,
    "text": "Just things to keep in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.907,
    "end": 1391.068,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.568,
    "end": 1392.348,
    "text": "Anything to add on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.653,
    "end": 1403.616,
    "text": " Well, correct me if I'm wrong on this, but I think what we're doing is essentially taking, as you said, we can look at a variety of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.656,
    "end": 1406.117,
    "text": "We can look at the physical nature of ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.177,
    "end": 1407.017,
    "text": "We can look at cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.077,
    "end": 1409.618,
    "text": "We can look at online teams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.258,
    "end": 1418.381,
    "text": "Whatever we're looking at, what they basically said is there is a parallel way of looking at the formalisms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.0,
    "end": 1424.403,
    "text": " that exist in those contexts with that type of content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.043,
    "end": 1426.904,
    "text": "That's essentially what this said to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.245,
    "end": 1431.888,
    "text": "There's a way of bumping it up into that sort of statistical mathematical realm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.208,
    "end": 1434.249,
    "text": "And now we're going to walk you through what that is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.89,
    "end": 1436.07,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.731,
    "end": 1436.911,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.171,
    "end": 1442.074,
    "text": "So into the Bay, the Bay's area where I grew up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.555,
    "end": 1444.375,
    "text": "Down by the Bay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.36,
    "end": 1473.033,
    "text": " sitting by the dock of the bays all right oh i thought it's gonna say where the water well where the watermelons grow carry on base theorem rests on three basic axioms of probability theory and is used to relate the conditional probability of an unobservable event a okay so the vertical bar means conditioned upon or given and so what we really want to know is like the probability of something that we cannot observe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.264,
    "end": 1487.226,
    "text": " conditioned on what we did observe B. So you're never observing the lightning strike, you're observing photons on your receptor, and then you want to know about whether there was lightning in that cloud over a few miles away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.846,
    "end": 1494.108,
    "text": "So we want to know the conditional probability of an unobservable event A, that's this left-hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.108,
    "end": 1501.769,
    "text": "We want to relate that to an observable quantity B, that's what the data are,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.847,
    "end": 1514.738,
    "text": " And that's going to be calculated using the Bayes theorem as the probability of the data given the unobservable state, which is called a prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.318,
    "end": 1528.671,
    "text": "So that's like had to do with cats and meowing or in a previous example, or it has to do with like, if there were lightning, yes or no, what would be the likelihood of me observing photons?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.054,
    "end": 1546.763,
    "text": " multiplied by the probability of those unobservable states happening, which is of course a prior about them, but it could be set with empirical data, divided by how likely the data are, which is called P of B, the marginal likelihood or evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.714,
    "end": 1563.524,
    "text": " Okay, so P of A given B is called the posterior because it's like after you've done your inference, you want the correct posterior, which is like updated beliefs about how likely the thing that you care about A is given what has come in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.665,
    "end": 1568.207,
    "text": "Priors are like prior to this round of inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.568,
    "end": 1572.369,
    "text": "What are your beliefs about how likely A is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.23,
    "end": 1576.012,
    "text": "And then the evidence coming in is B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.823,
    "end": 1584.689,
    "text": " Okay, and the likelihood is how likely the data are under the prior distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.55,
    "end": 1593.137,
    "text": "So that's Bayes' theorem, and we've talked about it multiple times, and I'm sure there's other awesome videos and courses that can explain it even better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.198,
    "end": 1595.059,
    "text": "How are they using it here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.36,
    "end": 1618.175,
    "text": " describe the dynamics of an ensemble of information processing agent like cells as a process of bayesian belief updating we need to relate the stochastic differential equations governing newtonian motion and biochemical activity to the probabilistic quantities above long sentence but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.286,
    "end": 1628.855,
    "text": " it's kind of saying we need to connect these variables, which are informational, they're probabilistic, they're statistical, to movement in space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.516,
    "end": 1638.784,
    "text": "Movement in a Newtonian coordinate system, because we need these variables to measure spatial movement so we can study morphogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.285,
    "end": 1642.127,
    "text": "This is fairly straightforward to do if we...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.789,
    "end": 1653.377,
    "text": " associate biophysical states with the parameters of a probability density and ensure their dynamics perform a gradient flow on a quantity called variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.638,
    "end": 1662.223,
    "text": "Variational free energy is a quantity in Bayesian statistics that, when minimized, ensures the parameterized density",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.069,
    "end": 1680.014,
    "text": " converges to the posterior belief as we will see below so yes this is our first slide on bayes theorem and we did just kind of go from the total description of the variables and what is bayes theorem at a first pass to this introduction of the variational free energy so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.894,
    "end": 1684.096,
    "text": " It can be accordioned out and unpacked a lot more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.516,
    "end": 1694.202,
    "text": "But what variational free energy is doing is helping us tractably converge to the appropriate posterior belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.163,
    "end": 1697.704,
    "text": "And that's its role here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.545,
    "end": 1699.765,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.565,
    "end": 1701.646,
    "text": "Anything to add on this one, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1703.336,
    "end": 1704.296,
    "text": " Well, I'll ask you a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.456,
    "end": 1727.841,
    "text": "So if you were to talk to this to somebody for the first time, not people who've probably listened to other of our live streams, would you say that it would be dangerous to say that we're taking something that's kind of ratio-based and now using that to try to build a model of what our predictions are going to be based on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.482,
    "end": 1730.622,
    "text": "Is that fair to say?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1733.945,
    "end": 1734.586,
    "text": " I believe so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.587,
    "end": 1738.37,
    "text": "It's like one way to approach that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.251,
    "end": 1740.833,
    "text": "I hope this would be accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.933,
    "end": 1742.875,
    "text": "The ratio based part is on the right hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.676,
    "end": 1755.709,
    "text": "And one could say, depending on like how much data you're getting and what you're trying to estimate, it could be very hard to go from observations to inference on hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.889,
    "end": 1757.929,
    "text": " pretty fair conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.91,
    "end": 1776.115,
    "text": "So what we could do would be construct a smooth approximatable model so that when we slide to the bottom of our model, just like the ball sliding down the hill, we would actually be doing the same thing as fitting this effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.875,
    "end": 1786.478,
    "text": "So instead of like number crunching and putting everything into this equation and running the calculation, we're going to construct a bowl",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.523,
    "end": 1794.507,
    "text": " which is the variational free energy that we can do gradient descent on that is going to converge to a really good solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.688,
    "end": 1801.771,
    "text": "Do we construct it or do they kind of tell us that we should assume it if we want to make it tractable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.313,
    "end": 1805.093,
    "text": "Assume the bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.096,
    "end": 1813.999,
    "text": "When we pick up this instrument, we're making variational free energy bowls.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.979,
    "end": 1816.2,
    "text": "Yeah, okay, good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.993,
    "end": 1819.454,
    "text": " And we've seen this before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.696,
    "end": 1842.833,
    "text": "In live streams 26, 32, and 34, we did some variance on moving from Bayes theorem and exact Bayes to variational inference, which uses this variational free energy value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.474,
    "end": 1846.256,
    "text": "So those are a few times that we've seen this discussed before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.089,
    "end": 1855.053,
    "text": " In neuroscience, the minimization of variational free energy is referred to as active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.433,
    "end": 1861.176,
    "text": "We will see that when the basic condition for an inference type description of a system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.614,
    "end": 1883.12,
    "text": " namely the existence of a Markov blanket separating external and internal states, is satisfied, agents such as biological cells form into organized conglomerations based on their generative model of how their blanket states influence and are influenced by external states in the external milieu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.133,
    "end": 1890.623,
    "text": " So the connection between Bayes' theorem and Markov blankets is the unobservables are external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.304,
    "end": 1893.467,
    "text": "The observables are blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.531,
    "end": 1901.654,
    "text": " It's a pretty fair model, whether it also provides like strong guarantees on optimal perception or optional action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.134,
    "end": 1908.237,
    "text": "That's another discussion, but at the very least, it's a fair framing that external states are unobserved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.637,
    "end": 1910.498,
    "text": "If you could observe them, they'd be observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.078,
    "end": 1920.182,
    "text": "Then they'd be more like B than A. So we're talking about a situation where we have some A's and we have some B's, and we're going to think about that in terms of a blanket formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.994,
    "end": 1932.339,
    "text": " The dynamics of a system with a Markov blanket that self-organizes to non-equilibrium steady states can be described as a gradient flow on this computable variational free energy bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.72,
    "end": 1938.803,
    "text": "So we can set up the blanket and it turns out that we don't have to do the ratio number crunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1939.303,
    "end": 1941.384,
    "text": "We can do the bowl gliding down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.08,
    "end": 1960.824,
    "text": " That's the beginning part on just Bayes that takes us from Bayes theorem to introducing variational free energy and doing gradient descent on variational free energy so that one can effectively essentially perform Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.945,
    "end": 1963.185,
    "text": "Cool?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.745,
    "end": 1965.065,
    "text": "Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.565,
    "end": 1965.745,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.305,
    "end": 1967.966,
    "text": "Section two, mathematical foundations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.886,
    "end": 1969.106,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.805,
    "end": 1975.286,
    "text": " So section 2.1, stability and convergence in coupled dynamical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.146,
    "end": 1978.546,
    "text": "And subsection 1, the Helmholtz decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.047,
    "end": 1985.007,
    "text": "So they write, the Helmholtz decomposition states that any sufficiently smooth, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.267,
    "end": 2000.03,
    "text": "possessing continuous derivatives, vector field F can be decomposed into an irrotational curl-free, so kind of straight up and down, putting the ruler and finding the slope of a hill, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.366,
    "end": 2024.54,
    "text": " solenoidal divergence free vector field the divergence free solenoidal is like putting the ruler at ground level and then being able to make an iso contour around a hill because an irrotational vector field has only a scalar potential and the solenoidal vector field has only a vector potential we can express the vector field as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.383,
    "end": 2027.664,
    "text": " insert formalism two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.384,
    "end": 2035.527,
    "text": "And just so people know, the upside-down triangle is called del or nabla, which means harp due to the shape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.008,
    "end": 2044.131,
    "text": "So del phi is the irrotational vector field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.611,
    "end": 2048.293,
    "text": "Del A is the solenoidal field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.913,
    "end": 2052.214,
    "text": "We talked about this mostly in...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.956,
    "end": 2068.161,
    "text": " number 26 and 32, where we talked about the partition or the decomposition into a solenoidal and a gradient, as well as this housekeeping term, which was everyone's favorite housekeeping term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.521,
    "end": 2079.885,
    "text": "So we're not having a housekeeping term here, but we're keeping in mind that it's not implausible that it's still there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.539,
    "end": 2090.033,
    "text": " It's just that there was a whole paper coming out after this morphogenesis paper that talked about the housekeeping, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.133,
    "end": 2094.68,
    "text": "So again, it wouldn't be surprising if a future morphogenesis paper or project",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.629,
    "end": 2100.532,
    "text": " did have this housekeeping term, but 32 was actually a later paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.112,
    "end": 2112.578,
    "text": "So that might be a more advanced place or updated place to check out how the partition, I'm sorry, the Helmholtz decomposition works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.319,
    "end": 2119.002,
    "text": "And here was a image from 26, just showing how you could have like a kind of hill",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.949,
    "end": 2132.214,
    "text": " And in physics, you could have hill climbing and trying to get to the top, or sometimes it's easier to think about that as like the flip and the ball rolling to the bottom of the hill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.734,
    "end": 2149.242,
    "text": "So whether it's the optimistic biologists talking about going up to the fitness peak, or whether it's the pessimistic physicists talking about going to the bottom of the energy well, it's the same idea that there's a particle on a landscape",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.387,
    "end": 2153.788,
    "text": " And there's been a ton of work on passive particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.348,
    "end": 2159.01,
    "text": "That's not to say immobile particles, but particles that roll and get trapped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.17,
    "end": 2163.071,
    "text": "And then once they're trapped, they stay, or they jiggle stochastically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.971,
    "end": 2166.332,
    "text": "We're studying active particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.952,
    "end": 2169.533,
    "text": "And so that's where action selection comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.113,
    "end": 2176.575,
    "text": "Landscapes of energy with balls rolling down them, but they're kind of like jumping beans where they also have a few tricks that they can play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.235,
    "end": 2178.696,
    "text": "Okay, anything to add here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.253,
    "end": 2190.675,
    "text": " Just a reminder to people that that's a density that we're looking at, not a vacuum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.915,
    "end": 2205.898,
    "text": "I know most people, like if I was to talk to younger people and they started imagining a ball rolling down a hill, they wouldn't necessarily confirm that it's an actual density that we're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.998,
    "end": 2207.678,
    "text": "So just reinforce that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2208.393,
    "end": 2222.278,
    "text": " yeah like the bottom right here it's kind of like you're looking down at an ink drop and that's where it's densest is where it's darkest and then that is like a landscape where where it's darkest is highest right okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.067,
    "end": 2228.029,
    "text": " Section 212, Lyopinib functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.569,
    "end": 2238.678,
    "text": "Okay, so Lyopinib functions have been used extensively in dynamical systems theory and engineering to characterize the stability of fixed points of a dynamical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.678,
    "end": 2244.903,
    "text": "Lyopinib functions are generally defined for smooth systems through the following conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.764,
    "end": 2252.129,
    "text": "So L is going to be the Lyopinib function and X is going to be a point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.461,
    "end": 2270.273,
    "text": " So a fixed point is going to be x star and a non-fixed point is going to be just regular x. So x star, the special points where if you are there, you're perfectly balanced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.274,
    "end": 2282.904,
    "text": "So this is saying that at fixed points, the Lyapunov function evaluates as zero and it's not zero if it's not a fixed point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.145,
    "end": 2284.285,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.01,
    "end": 2289.632,
    "text": " the Lyapunov function change in L with respect to time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.632,
    "end": 2302.298,
    "text": "It's below zero for all x. Equation 3a requires the Lyapunov function to be minimal for fixed points x star, representing local minima,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.211,
    "end": 2323.901,
    "text": " and b denotes conversions to these fixed points over time so what does it mean to have a lyopin value of zero above zero or below zero so if you're at zero just like it said with the fixed points that means that it's not moving at all a lyopin of exponent below zero means that things are converging towards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.509,
    "end": 2329.45,
    "text": " Lyopinib bigger than zero means diverging away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.211,
    "end": 2333.772,
    "text": "Specifically, what it means is two points that are really, really close to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.592,
    "end": 2337.253,
    "text": "Do they stay exactly the same distance away?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.654,
    "end": 2338.354,
    "text": "That's zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.434,
    "end": 2343.136,
    "text": "A negative lyopinib means that two points close to each other will converge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.616,
    "end": 2345.136,
    "text": "So that's a convergence attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.817,
    "end": 2354.82,
    "text": "And then positive lyopinib exponents, lyopinib values, mean that two points that are placed very close to each other will diverge away from each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.773,
    "end": 2365.139,
    "text": " I hope I have not oversimplified or made unforced errors about Lyapunov functions because it's obviously a really technical area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.227,
    "end": 2389.537,
    "text": " and they write following 16 we can generalize this local lyapunov function of stability so zero equal fixed point positive equals divergence negative equals conversions to a global lyapunov function that plays the role of a potential function of any dynamical system and we won't go into it but it is the citation to this real she",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.629,
    "end": 2396.314,
    "text": " paper from 2013, and they do some pretty interesting math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.914,
    "end": 2400.498,
    "text": "So if somebody is more familiar with this, it would be awesome to hear about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.178,
    "end": 2414.43,
    "text": "But what this is doing is it's taking the same dynamical systems perspective that we've been thinking about, about things changing through time, and then overlaying on that landscape",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.461,
    "end": 2416.703,
    "text": " a stability landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.384,
    "end": 2427.159,
    "text": "And so if we think about this hill on the top right, again, hopefully not being wrong or misleading here, at the very top of the hill,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.263,
    "end": 2454.514,
    "text": " it's like a fixed point it's an unstable fixed point but if one were perfectly balanced there we could just say um it could get knocked off by stochastic things which will come back later but it's perfectly balanced it's like a fixed point two points that were very close to each other on a hill two balls placed right next to each other would start to diverge as they rolled down the hill so that would be like a slight divergence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.643,
    "end": 2460.444,
    "text": " And so that is what the Lyapunov function as potential function is allowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.045,
    "end": 2466.286,
    "text": "It's allowing us to take the landscape of ball rolling, where gravity is the potential function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.087,
    "end": 2471.748,
    "text": "The higher up, the more potential you have, and then it rolls down because of the dissipation of potential energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.708,
    "end": 2473.469,
    "text": "And they're going to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.945,
    "end": 2500.139,
    "text": " show that any dynamics with lyapunov function so any smooth differentiable etc landscape has a corresponding physical realization a friction force a lorentz force and a potential function so we can think about this lyapunov function being related to potential functions like something that draws the system back that's where the negative lyapunov comes into play okay dean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.519,
    "end": 2502.739,
    "text": " Just a quick thing, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.619,
    "end": 2510.921,
    "text": "When we were setting up the slides, between those two bullets, they talked about something called a saddle point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.981,
    "end": 2515.702,
    "text": "Did you understand what a saddle point was previous to reading this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.902,
    "end": 2518.022,
    "text": "Or do you know what a saddle point is now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2519.323,
    "end": 2520.063,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.483,
    "end": 2524.124,
    "text": "I'm just pulling up the paper in the window.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.524,
    "end": 2524.724,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.744,
    "end": 2525.604,
    "text": "So people can see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.364,
    "end": 2527.544,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.704,
    "end": 2530.545,
    "text": "So yeah, the stability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.565,
    "end": 2530.925,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.492,
    "end": 2533.553,
    "text": " So it's the following sentence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.593,
    "end": 2538.716,
    "text": "So we can generalize the Lyapunov function to a global function that plays the role of a potential function of any system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.076,
    "end": 2545.319,
    "text": "This follows by generalizing condition A to allow for saddle points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.04,
    "end": 2558.067,
    "text": "So a saddle point is when the landscape is shaped like a saddle and there's like, so if it were on top of a hill, the curvature is negative with respect to all directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.952,
    "end": 2568.416,
    "text": " In a saddle point, the curvature is negative with respect to one of the dimensions, but it's positive with respect to another dimension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.677,
    "end": 2571.938,
    "text": "And so it's like... Just like a saddle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.158,
    "end": 2572.418,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.118,
    "end": 2573.338,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.039,
    "end": 2574.899,
    "text": "Why do they call it that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.96,
    "end": 2576.28,
    "text": "And so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.58,
    "end": 2582.985,
    "text": " The ball on the top of the hill is like an infinite multifurcator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.746,
    "end": 2588.73,
    "text": "Like a little jiggle, it could go any direction because it's unstable in every direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.511,
    "end": 2595.877,
    "text": "Saddle points induce a symmetry where that ball is never going to roll up the hill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.557,
    "end": 2599.68,
    "text": "It's going to fall to one side of the saddle or the other side of the saddle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.581,
    "end": 2606.284,
    "text": " And one of those could be like a certain attractor and the other one could be like another elevation basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.045,
    "end": 2613.808,
    "text": "Though I don't know the details of how the saddle point is related to some of this Lyapunov stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.629,
    "end": 2615.849,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.691,
    "end": 2620.931,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.232,
    "end": 2627.635,
    "text": "So following 16, so this is, they're showing that the Lyapunov is equivalent to a potential function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.42,
    "end": 2639.649,
    "text": " In physics, a potential function, psi, can be constructed to describe the flow of or forces acting on a particle through a potential energy gradient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.629,
    "end": 2646.254,
    "text": "So the potential energy function, F, is del psi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.976,
    "end": 2653.46,
    "text": "So here's just one way to state the big idea of equations five through nine, which are not discussed here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.161,
    "end": 2656.623,
    "text": "So the idea is create a potential function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.246,
    "end": 2667.632,
    "text": " And when you think of potential function, think it's like kinetic energy based upon elevation, but it's not for gravity and elevation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.292,
    "end": 2677.718,
    "text": "It's like balls falling down tall buildings, but for not gravity, for something that's related to dynamical conversions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.619,
    "end": 2682.602,
    "text": "So if you were like at the bottom of the bowl, you'd only have a little bit of potential energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.527,
    "end": 2684.968,
    "text": " the potential function would be low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.508,
    "end": 2689.93,
    "text": "If you are really far up the wall, you'd have a high potential function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.21,
    "end": 2691.31,
    "text": "You'd have a long way to fall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.051,
    "end": 2706.297,
    "text": "That is going to be reflected by a balance of forces, namely in a tractor force, which is the combination of the Lorenz force and the potential energy induced force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.017,
    "end": 2712.88,
    "text": "And then there's the dissipative force, and that's the frictional force due to dissipative random fluctuations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.062,
    "end": 2717.293,
    "text": " So that's like the Velcro ball on the Velcro bowl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.653,
    "end": 2726.938,
    "text": " the friction is so high that it still is being kept on the side or it's rolling down very slowly or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.059,
    "end": 2733.864,
    "text": "Combining these definitions, we can express the total balance, total force as a balance of the forces defined above resulting in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.864,
    "end": 2747.834,
    "text": "And so just like if it was two colliding vectors and then we were going to express the outcome resultant as like the total forces being applied on something, it's like that, but it's not about the physical forces and the gravity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.034,
    "end": 2749.055,
    "text": "It's like more about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.277,
    "end": 2753.018,
    "text": " these forces abstractly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.778,
    "end": 2762.203,
    "text": "And so equation 10 is expressing this balance of forces on x using a gradient landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.644,
    "end": 2772.87,
    "text": "So there's that del psi, and here's the combination of forces being expressed as del psi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.11,
    "end": 2773.25,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.853,
    "end": 2780.555,
    "text": " So they use the word tensor here, and when I was reading this, I didn't see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.775,
    "end": 2789.097,
    "text": "I mean, okay, so if we're having a tug-of-war on a rope, it might appear to the outsider, the outside observer, that there's a balance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.178,
    "end": 2799.92,
    "text": "But really what I read into this, and maybe I'm wrong, was that there's a tension between these two forces, between the attractor force and the dissipative force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.501,
    "end": 2801.541,
    "text": "Am I misinterpreting that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.557,
    "end": 2805.839,
    "text": " Someone has a different answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.859,
    "end": 2807.26,
    "text": "It would be awesome to hear it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.701,
    "end": 2810.904,
    "text": "A tensor is like a generalization of a matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.185,
    "end": 2812.706,
    "text": "It's like a matrix through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.888,
    "end": 2819.394,
    "text": "I don't think that it is directly related to tensile or tensegrity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.495,
    "end": 2820.675,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.856,
    "end": 2822.978,
    "text": "That being said, you're right that there is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.335,
    "end": 2845.337,
    "text": " a tension between these forces or there can be and then they like tension can reflect like a compromised position like if you have a rope with tension on it then the ending of the rope is going to be like some compromise between the various forces and so we're thinking about like the various forces",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.789,
    "end": 2850.991,
    "text": " And then we're expressing it as like this matrix through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.711,
    "end": 2857.034,
    "text": "That's what makes it a tensor, not the fact that the forces are in tension or opposition with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.074,
    "end": 2857.274,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.254,
    "end": 2859.135,
    "text": "I hope that's accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.215,
    "end": 2859.455,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.096,
    "end": 2873.542,
    "text": "And then they follow 16 again and transform that expression in 10 into a more standard form using the diffusion tensor gamma and a tensor Q.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.872,
    "end": 2884.299,
    "text": " This is like a rewriting that helps them get to this format where f of x is describing the flow of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.859,
    "end": 2887.001,
    "text": "So that's the change in states through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.162,
    "end": 2889.403,
    "text": "And it's like a vector field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.264,
    "end": 2892.166,
    "text": "And it is going to be q minus gamma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.966,
    "end": 2896.75,
    "text": "So tensor minus diffusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.351,
    "end": 2903.796,
    "text": "Both of that, so that multiplied by that landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.17,
    "end": 2911.813,
    "text": " So that's kind of like the decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.275,
    "end": 2917.917,
    "text": "But if someone could explain this more, let's hear it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.498,
    "end": 2919.598,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2919.658,
    "end": 2929.384,
    "text": "And my simple words, this is where I, I keep bringing up the idea that maybe when we're looking at these things through an active inference lens, we're not just looking through a frame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.888,
    "end": 2934.489,
    "text": " we're also looking through and they talk about filters later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.349,
    "end": 2950.331,
    "text": "So, so like, how do we, how do we make sure that we're including both and the, and sort of the tension between both of those views working together and being in tension with one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2950.431,
    "end": 2960.033,
    "text": "So, yeah, this is very, this is very formal, but I think it kind of reinforces that there there's what's inside the, the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.258,
    "end": 2963.841,
    "text": " the partitions and then what's going on within them as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.421,
    "end": 2965.622,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.383,
    "end": 2970.607,
    "text": "So it's describing the flow of states resulting from these conservative and dissipative forces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.207,
    "end": 2975.471,
    "text": "So if Q and gamma were the same, then the flow would be zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.478,
    "end": 2985.422,
    "text": " If one is larger than the other, then it's going to be dominated by that component with respect to being multiplied by this landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.283,
    "end": 2988.804,
    "text": "So we'll return to it many times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.225,
    "end": 2990.445,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.165,
    "end": 2992.105,
    "text": "Variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.027,
    "end": 2997.008,
    "text": "What did you want to add on this slide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.093,
    "end": 3010.002,
    "text": " Well, I don't know that there's any... I mean, most people already know what we're talking about in terms of variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.142,
    "end": 3020.393,
    "text": "What they're doing is introducing it in terms of, so now where does the model of a biological entity, where is that sourced from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.473,
    "end": 3022.175,
    "text": "And it's this sort of idea of these...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.946,
    "end": 3034.794,
    "text": " these things like posterior beliefs, the foundation or the idea that we don't walk into a situation completely blind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.814,
    "end": 3042.5,
    "text": "We have some sort of prior and we're modeling situations where internal states can be interpreted and framed as a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.54,
    "end": 3048.285,
    "text": "So it's not, they're focusing on the model aspect of this as opposed to the generative processing side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3048.865,
    "end": 3054.73,
    "text": "They're going to talk about what the external milieu is and where the generative process is here shortly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.397,
    "end": 3056.597,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.057,
    "end": 3062.201,
    "text": "So good point to pause the video and read this because we're not going to read it out here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.441,
    "end": 3063.441,
    "text": "But you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.481,
    "end": 3069.305,
    "text": "They're focusing on the generative model of the agent of the cell, not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.848,
    "end": 3074.549,
    "text": " doing that analysis on the niche, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3076.45,
    "end": 3076.79,
    "text": "Section 2.2.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.11,
    "end": 3080.311,
    "text": "Okay, so this is a fun part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.491,
    "end": 3086.493,
    "text": "We can describe dynamics in generalized coordinates of motion denoted with a tilde.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.278,
    "end": 3098.849,
    "text": " where X tilde is defined as X tilde equals X. That's like the absolute state of X. And then X with a dot is the first derivative of X. That's called velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.57,
    "end": 3105.556,
    "text": "X with two dots is, or a two double prime, depending on the notation, is the acceleration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.693,
    "end": 3110.694,
    "text": " what people don't always know is that there are higher derivatives and they also have names.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.214,
    "end": 3115.895,
    "text": "So the third derivative is the jerk, and then the fourth, fifth, and sixth are the snap, crackle, and pop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.715,
    "end": 3131.579,
    "text": "So that's just kind of funny, but the generalized coordinates of motion, which came up in number 26, have to do with doing prediction on not just, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.501,
    "end": 3136.602,
    "text": " how high or low something is, or like on the number line left and right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.722,
    "end": 3138.623,
    "text": "That would be like if X were just one number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.423,
    "end": 3154.968,
    "text": "But even if it's just one number that we're tracking, like body temperature, for example, we might be interested in kind of unpacking that into this generalized coordinate where we wanna know body temperature and how fast it's changing and how fast that is changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.649,
    "end": 3159.97,
    "text": "And so one can imagine that once a zero has been achieved,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.751,
    "end": 3164.692,
    "text": " the higher derivatives are also zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.353,
    "end": 3168.575,
    "text": "If it's zero through time, the higher derivatives are also zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.396,
    "end": 3171.657,
    "text": "If it's zero instantaneously, that's not always the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.338,
    "end": 3177.001,
    "text": "But if it's zero through time, then it's kind of like you've cashed out the derivatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.441,
    "end": 3179.282,
    "text": "The derivative of zero just stays at zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.043,
    "end": 3185.126,
    "text": "And so it's like, if the position is unchanging, the velocity is zero, end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.127,
    "end": 3190.13,
    "text": "If the position is five miles an hour going in the same direction,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.797,
    "end": 3213.673,
    "text": " velocity is constant but the acceleration is zero so keep on carrying that out to how fast things are changing how fast they change etc etc um and then they're going to take that x tilde how x tilde changes with time x tilde dot equals the flow on tilde plus",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.365,
    "end": 3241.383,
    "text": " a variance so a noise or fluctuation a random fluctuation term this is the form of the langfine equation generalized coordinates of motion plus a random fluctuation term um any of the mathematical colleagues would be awesome to hear how this is related to the wiener assumptions etc but we're going to continue so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.326,
    "end": 3272.292,
    "text": " Using the Helmholtz decomposition, we can now express steady state flow in terms of a divergence-free component and a curl-free descent on a scalar Lyapunov function, L of x tilde, to obtain F of x tilde equals, there's the Q minus gamma that we saw a few slides ago, multiplied by now the L. So here we had F of x, not generalized coordinates of motion,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.427,
    "end": 3279.588,
    "text": " Q minus gamma del psi of X. That was the potential function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.688,
    "end": 3298.432,
    "text": "Now, because the potential function and Lyapunov are related to each other, we're looking at the generalized coordinates of motion using the same Q minus gamma Helmholtz decomposition, but multiplying it now by Lyapunov exponent, or I'm sorry, the Lyapunov function on X tilde.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.154,
    "end": 3309.143,
    "text": " It's the solution at non-equilibrium steady state and is exactly the same solution for the flow of particles in the classical treatment above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.085,
    "end": 3317.832,
    "text": "Crucially, we can now see the Lopunov function is the negative log probability of finding the system in any generalized state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.68,
    "end": 3326.345,
    "text": " The Lyapunov of X tilde is the negative natural log of how surprised one should be, P of X tilde.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.745,
    "end": 3331.088,
    "text": "This is known as self-information of a state in information theory, surprisal or surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.649,
    "end": 3333.89,
    "text": "In Bayesian statistics, it is the negative log evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.15,
    "end": 3346.699,
    "text": "So the change in the generalized coordinates of motion, F of X tilde, breathe, is an irrotational solenoidal decomposition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.186,
    "end": 3357.715,
    "text": " that's the left part of the right-hand side, multiplied by a Lyapunov function, which also has the interpretation of surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.157,
    "end": 3365.323,
    "text": "So if you were exactly resting, so to speak, you'd be totally unsurprised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3367.312,
    "end": 3381.043,
    "text": " In summary, any weakly mixing dynamical system at non-equilibrium steady state will evince, give us evidence for, or look like it is, a flow that can be decomposed into a gradient flow on surprise and an accompanying solenoidal flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.304,
    "end": 3388.929,
    "text": "Because we can associate the Lyapunov function in 18 with a free energy, the system is effectively minimizing the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.12,
    "end": 3406.17,
    "text": " free energy in its conversions to a set of attracting states which have a high probability of being occupied so it's a little circular it's like we're finding ourselves where we expect to find ourself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.574,
    "end": 3410.015,
    "text": " And so if we just said, well, how surprised are we?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3410.635,
    "end": 3414.136,
    "text": "And let's gradient descend towards not being surprised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3414.957,
    "end": 3416.417,
    "text": "Just at a first approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3417.097,
    "end": 3420.939,
    "text": "We would find ourselves in regions of low surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.32,
    "end": 3427.581,
    "text": "And we would be surprised to find ourselves in regions of high surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.601,
    "end": 3429.322,
    "text": "Hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.707,
    "end": 3438.708,
    "text": " Is it circular or is it kind of the byproduct of a recursive process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.089,
    "end": 3442.709,
    "text": "Again, I'm asking, I'm not questioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3444.249,
    "end": 3445.81,
    "text": "It's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.09,
    "end": 3454.431,
    "text": "In like a really meta way, all of math is circular once the axioms have been stated because like the equal sign is there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.571,
    "end": 3457.272,
    "text": "So we're just, you could add one to both sides and it would still be equal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.352,
    "end": 3458.112,
    "text": "So is that circular?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.132,
    "end": 3458.572,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.402,
    "end": 3485.882,
    "text": " um it's useful and that's what matters for this paper okay yeah um we're not going to talk about it too much but in a dot one we absolutely will and that's this least action principles in two two two um and they even give the example we love to see for example in colonies ants find the path of least action to harvest food and bring it to the colony",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.142,
    "end": 3489.685,
    "text": " citation needed slash let's see that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.786,
    "end": 3493.268,
    "text": "But conceptually, no problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.249,
    "end": 3503.678,
    "text": "This example considers their paths as flow channels or trajectories, finding the least average action for each instance of foraging given available resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.559,
    "end": 3507.382,
    "text": "So what does least action principle mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.629,
    "end": 3528.818,
    "text": " does least action mean and what is it necessary or sufficient for because certainly foraging is not the least biochemical expenditure of energy that's like the sort of naive interpretation of least action meaning just stay where you are but we're thinking about a usage of least action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3530.08,
    "end": 3544.145,
    "text": " that impels this ant to forage in an adaptive way, such that even when its foraging trip is hard and the seed is heavy and it gets like lost or something, that is still a realization of a least action on something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.465,
    "end": 3549.947,
    "text": "It's still a ball rolling down a hill as efficiently as it can in a space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.256,
    "end": 3561.898,
    "text": " So it's a nuanced topic that it will be great to discuss because they also write, minimization of action in an open system leads to structure formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.178,
    "end": 3564.379,
    "text": "So that'd be a good thing to unpack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.819,
    "end": 3565.839,
    "text": "Okay, carrying on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3569.36,
    "end": 3580.542,
    "text": "In dissipative random dynamical systems, action is not minimized for each element of the system, but on average over an ensemble of elements or repeated trajectories of the same element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.53,
    "end": 3605.455,
    "text": " since self-organizing open systems are not conservative their structured flow is quintessentially dissipative good to think about that and hear many perspectives and questions on it classically for a conservative system the lagrangian is defined as l",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.718,
    "end": 3609.318,
    "text": " This is L, not the operative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.378,
    "end": 3610.299,
    "text": "Now it's Lagrangian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.099,
    "end": 3617.62,
    "text": "Equals T minus V. So T is the kinetic energy of the particles and V is the potential energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3622.281,
    "end": 3632.662,
    "text": "And so that's how the trajectory of system states could be solved for a conservative system where the total energy is going to be conserved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.743,
    "end": 3634.823,
    "text": "But there...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.831,
    "end": 3660.752,
    "text": " opening up into this dissipative and open scenario where this is not going to cut it um a little bit more detail on least action which we're not going to go into okay continuing on two two three markov blanket okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3662.338,
    "end": 3672.161,
    "text": " A robust literature is developing about around the ability of cells and other a neural non neural systems measuring aspects of their environment via specific sensors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.342,
    "end": 3685.645,
    "text": "They introduce here the Markov partition as this general case of separation of states into four categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.868,
    "end": 3700.95,
    "text": " E, external states, sensory states S, active states A, internal states I. And so the little E is like, it's a realization of big E. That's the bigger space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.85,
    "end": 3716.913,
    "text": "And then X tilde comes back and the generalized coordinates are going to be a realization of values of those partitioned states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.703,
    "end": 3728.989,
    "text": " So we've talked about the Markov blanket before, but now we're interested in the generalized flow on the blanket partition states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.209,
    "end": 3733.551,
    "text": "So here's what the Markov blanket looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.972,
    "end": 3735.172,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.342,
    "end": 3741.123,
    "text": " We'll talk more about it in the dot one and dot two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.623,
    "end": 3745.265,
    "text": "What do the arrows mean and why are sense and action connected?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.286,
    "end": 3748.146,
    "text": "What part of the cell are we looking at?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3748.467,
    "end": 3749.567,
    "text": "Is it a part of the cell?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.707,
    "end": 3751.028,
    "text": "Is it a model of a cell?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.768,
    "end": 3758.031,
    "text": "All these things that have come up before, but just to say that's their figure one and table one gives the math formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.272,
    "end": 3762.453,
    "text": "Okay, anything to add on Markov before we continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.751,
    "end": 3766.191,
    "text": " No, because we'll unpack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.651,
    "end": 3766.831,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.532,
    "end": 3771.472,
    "text": "So this is where they apply the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.452,
    "end": 3778.774,
    "text": "So M is describing the Markov partition that defines the underlying random dynamical system such the cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.814,
    "end": 3785.775,
    "text": "So that is like the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.175,
    "end": 3788.475,
    "text": "It's the partition, Markov partition of the cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3789.135,
    "end": 3792.516,
    "text": "So inserting C into A and B is going to give",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.973,
    "end": 3797.654,
    "text": " There's A is actions and I is internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3798.455,
    "end": 3811.239,
    "text": "So the top equation is basically saying the flow on action is a function of sense action and internal, and then it has a right-hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.299,
    "end": 3818.522,
    "text": "So the flow on action, the performance of action is, and then there's that gamma minus Q,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.889,
    "end": 3839.324,
    "text": " but now they have a subscript A because it's those about the action landscape, multiplied by del triangle on action tilde, generalized action, and then a self-surprisal, looking like the self-surprise of sense, action, and internal conditioned on M partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3840.064,
    "end": 3847.45,
    "text": "And the bottom equation in 30B is basically the same, but it's the flow on internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.892,
    "end": 3874.118,
    "text": " f sub i on generalized states of sense action and i and that same gamma minus q del self-surprise condition on model so we're seeing some patterns come up and even if um it's like confusing and we all definitely are confused by it to some extent we're starting to see like some patterns why does it matter to focus so much on a and i the action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.396,
    "end": 3878.94,
    "text": " and the internal states, because those are like the ones we control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.64,
    "end": 3882.103,
    "text": "We know we don't control external states directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.864,
    "end": 3886.247,
    "text": "Maybe we can intervene so that they change differently, but we know we don't control them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.168,
    "end": 3890.131,
    "text": "We also don't directly control sense states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.471,
    "end": 3893.554,
    "text": "We're getting dealt this hand every second by the niche",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3894.435,
    "end": 3923.164,
    "text": " generative process and so we can take action so that we can expect different sensory outcomes but even then we wouldn't be controlling sensory outcomes and so a lot of active inference comes down to doing inference on internal model internal states generative model learning and action action selection flows on action um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.239,
    "end": 3940.909,
    "text": " This bounds the surprise on the particular states, which is the internal and the blanket states, through control of the autonomous states, which is just the action and internal states, the states we control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3945.091,
    "end": 3950.875,
    "text": "Because of the sparsity of the blanket, not every node is connected to every node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.341,
    "end": 3975.312,
    "text": " there might be a factorized and tractable form to bound our surprise about the particular states in general it would be very difficult problem to solve however we can replace the lagrangian that's the one here that was like going to be used for conservative systems but it didn't really apply",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.417,
    "end": 3986.484,
    "text": " with a variational free energy functional or of a probabilistic model of how a system thinks it should behave or how we think the system should think it should behave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.925,
    "end": 3994.81,
    "text": "So it's hard to solve these generally, but in practice, there are heuristics such that these are approximatable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.452,
    "end": 4001.936,
    "text": "Section 2.4 goes like one layer deeper into KL divergence in the VFE, but we're not going to go into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4003.672,
    "end": 4006.874,
    "text": " Okay, we're just going to keep on plowing through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.535,
    "end": 4010.877,
    "text": "Two, three is Bayesian filtering and self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.938,
    "end": 4017.362,
    "text": "We're not going to talk about it now, but the big questions here are like, how does Bayesian statistics relate to identity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.543,
    "end": 4020.204,
    "text": "And what is self-evidencing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.165,
    "end": 4024.027,
    "text": "And there's probably a lot of other good questions we could ask.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.267,
    "end": 4028.37,
    "text": "Like, why does Bayesian filtering and self-organization come here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.292,
    "end": 4030.472,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.717,
    "end": 4034.939,
    "text": " Modeling morphogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.999,
    "end": 4041.268,
    "text": "So now we actually get to the contribution of the paper, which is the modeling of morphogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.388,
    "end": 4047.738,
    "text": "So they're going to illustrate self-organization to Ness using the variational principles above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4049.687,
    "end": 4058.156,
    "text": " by trying to explain the behavior of a model of pattern regulation by consideration of information processing and error minimization with respect to a specific target morphology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.757,
    "end": 4062.061,
    "text": "In this setting, the game changes subtly but profoundly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.802,
    "end": 4064.323,
    "text": "It's a Dean line if I ever read one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.292,
    "end": 4080.356,
    "text": " Above, which is what we've reviewed, the dynamics of any random dynamical system equipped with a Markov blanket can be formulated in terms of a gradient flow on variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.597,
    "end": 4086.879,
    "text": "That was just here, the flow on action and the flow on internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.519,
    "end": 4102.064,
    "text": " Here, we turn this formulation on its head by specifying a generative model and implicit VFE function and simulate self-organization by solving the equations of motion in equation 34.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.105,
    "end": 4113.369,
    "text": "So they're going to specify the form of the attracting set, V, the generative model, and then they're going to let it ride.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.89,
    "end": 4116.67,
    "text": "So we have to specify-",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.305,
    "end": 4130.927,
    "text": " They specify the external dynamics as the generative process, that's the niche, and the generative model of that process, which is being described by the flow of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.107,
    "end": 4136.568,
    "text": "Okay, so we're gonna look at the figures and then we're not going to even like go into the details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4136.628,
    "end": 4138.529,
    "text": "So let's just look at the figures and see what they're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.669,
    "end": 4145.91,
    "text": "So here's some empirical biology happening in the lab of Mike Levin and others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.891,
    "end": 4148.091,
    "text": "So in A,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.406,
    "end": 4157.513,
    "text": " It turns out that when you dissect out the center of a flatworm, a planarian, those cells will remodel into a new worm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.654,
    "end": 4167.721,
    "text": "So cutting out the middle and it reforms into this new flatworm and red is the head and then like blue is the tail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4168.762,
    "end": 4177.109,
    "text": "So there's a self-organization of this target morphology, even from an initially clumpy cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4179.298,
    "end": 4186.802,
    "text": " what they're going to do in B is showing like the final fixed point of these different cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.022,
    "end": 4189.223,
    "text": "So here we have like four different cell types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.704,
    "end": 4195.287,
    "text": "There's like the red neural or head cells, then yellow cells, green cells, and blue cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4195.967,
    "end": 4202.151,
    "text": "And then basically like this, like three, two, one, one, and then the bottom one, it's this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.811,
    "end": 4204.612,
    "text": "Maybe they changed the green and the blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.196,
    "end": 4216.323,
    "text": " Like I think these two should be green and the bottom should be blue, but minor point, but it's an attractor on this target morphology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4219.205,
    "end": 4236.398,
    "text": "And then C is describing a little bit about how it happens, which is that cells are constantly comparing their sense signal concentration, like of a gradients of some morphogen to expectations by minimizing their free energy functional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.324,
    "end": 4261.371,
    "text": " so it's like what kind of a cell type am i and what should i be expecting right flip side what should i be surprised by because to say what i expect is the other side of the coin of what one is surprised by okay so they're modeling this empirical scenario where a flatworm can regenerate its form from just a clump of cells here and that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.231,
    "end": 4276.219,
    "text": " if we think about the location of these cells as being like a steady state attractor, like we want to have this body form last, then if all the cells just get in line like that, everything's going to work out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.48,
    "end": 4277.74,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.98,
    "end": 4287.886,
    "text": "How do we take this first jump that we made from the empirical biology to the state space framing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.226,
    "end": 4291.027,
    "text": " Here it is in XY state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.848,
    "end": 4295.41,
    "text": "And now take the next jump, one more mathematical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4297.311,
    "end": 4304.095,
    "text": "Here on the right side is that XY positioning of each cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4306.914,
    "end": 4328.871,
    "text": " this is reflected by the position in x and y of the cells so like negative nine and zero so that's like this top red one zero is the midline so it's like y and x and here like negative five it's a little lower and then like negative four and four it's like one is on they're on the same y elevation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.758,
    "end": 4333.141,
    "text": " but then one is four to the left and one is four to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.921,
    "end": 4339.005,
    "text": "And so this E star of X is the position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4340.667,
    "end": 4349.914,
    "text": "So it's a matrix of position because there's like eight cells and two location variables per cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.974,
    "end": 4353.557,
    "text": "So it's like a two by eight matrix and it changes through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.877,
    "end": 4354.478,
    "text": "So it's a tensor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4356.857,
    "end": 4360.361,
    "text": " The E star C is the external signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4361.483,
    "end": 4371.475,
    "text": "And so in this steady state attractor, all three red cells are getting like signal one, here it's a binary signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.298,
    "end": 4375.18,
    "text": " There are four signals, but they only have an on or an off state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4375.46,
    "end": 4383.605,
    "text": "In reality, there's many, many more signals than four, and there's a lot more nuance than just on or off, but it's a toy example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.466,
    "end": 4389.409,
    "text": "All three red cells are getting the exact same signaling milieu of 1100.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.47,
    "end": 4398.935,
    "text": "So factor A and B are diffusing near me, but not C and D. The yellow cells are experiencing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.467,
    "end": 4420.086,
    "text": " those two diffuses and one other one the blue cells are experiencing the first and the fourth and then the green one is another and so this is like the attractor state for a stable location and signaling expression",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.109,
    "end": 4425.513,
    "text": " So converging to this spatially makes your body look like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.973,
    "end": 4435.561,
    "text": "But the way that you get a beach ready planarian body like that is actually by reducing your surprise on signal expression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4438.703,
    "end": 4438.944,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.445,
    "end": 4442.627,
    "text": "So here's them running it through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.908,
    "end": 4448.852,
    "text": "So it's a time-lapse movie montage of simulations of morphogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.066,
    "end": 4457.11,
    "text": " And so here it is converging towards on the right side, the morphology that's been discussed here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.811,
    "end": 4461.012,
    "text": "And so the cells start out with undifferentiated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.533,
    "end": 4462.793,
    "text": "They know what they're sensing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.114,
    "end": 4468.437,
    "text": "They don't know what kind of cell they are and they don't know where they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.497,
    "end": 4475.461,
    "text": "And then they sharpen their expectations about what kind of cell they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.598,
    "end": 4482.921,
    "text": " while also moving into a different spatial niche, but they're not tracking their location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.961,
    "end": 4485.142,
    "text": "Like I'm at three comma two, where are you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.023,
    "end": 4488.644,
    "text": "It's like, this is what I'm biochemically sensing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.664,
    "end": 4495.407,
    "text": "And so it's a relational morphology that doesn't need the blueprint in the nucleus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.608,
    "end": 4498.208,
    "text": "So it's a lot like an ant colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.609,
    "end": 4501.43,
    "text": "There's not the nest architecture blueprint in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.55,
    "end": 4503.431,
    "text": "There's the process for stigmergy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.568,
    "end": 4523.037,
    "text": " And then they show that with some other changes in the generative process, positive squared gradient in the generative process, they get double head formation, which some modulations have been shown to empirically result in in the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.178,
    "end": 4526.879,
    "text": "And they can also make it so it gets double tail formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.577,
    "end": 4539.164,
    "text": " So it's just recapitulating this basic example and then showing that like modifying the external field changes the morphology that gets attracted to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.805,
    "end": 4543.467,
    "text": "So those are the key pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4543.587,
    "end": 4555.875,
    "text": "That's modeling morphogenesis as Bayesian inference, reducing surprise with a variational free energy flow on action and internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.115,
    "end": 4556.716,
    "text": "Action states...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.129,
    "end": 4558.749,
    "text": " internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.45,
    "end": 4561.851,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.532,
    "end": 4566.474,
    "text": "We're not gonna go into it here, definitely for the dot one and dot two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.974,
    "end": 4570.036,
    "text": "So 3.1 is the construction of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.178,
    "end": 4580.062,
    "text": "They then unpack that signal matrix, the combination of the signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4583.084,
    "end": 4583.424,
    "text": "And then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.969,
    "end": 4590.511,
    "text": " they give even more information about modeling signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4591.411,
    "end": 4605.377,
    "text": "And they also imbue it here with like this stemminess, which helps the cells start out with, I believe, a weaker prior about what kind of cell they are, which translates to where they should be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.018,
    "end": 4615.121,
    "text": "In figure five, they do a targeted intervention in their studying of anomalous cell behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.348,
    "end": 4628.674,
    "text": " And so basically they start off with these cells that have initially unspecified state and they converge in A, the panels on A, by 32 time points, they're converged to the target morphology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4629.934,
    "end": 4642.52,
    "text": "But in B, they show that if one of the cells that gets hit with a white arrow here has a perturbed signaling response, it fails to correctly infer its place in the ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.601,
    "end": 4650.303,
    "text": " So B could be like a genetic mutation or a targeted modification of the signaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4650.823,
    "end": 4655.004,
    "text": "And it's like that third red cell never forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4656.604,
    "end": 4671.168,
    "text": "And then in C, the same aberrant cell from B initially is rescued by an increased signaling sensitivity of other cells, leading another cell, green arrow, to switch position with the aberrant cell, pink arrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.697,
    "end": 4703.874,
    "text": " pretty cool okay yeah I wanted to come up with an analogy that would actually work that it would explain this like if you're out geocaching one afternoon and then all of a sudden some something was able to turn all the lights off and then the person that was geocaching beside you change their behavior but I couldn't even come up with a valid analogy to try to explain this how about um we're playing American football",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4704.821,
    "end": 4710.165,
    "text": " And so there's a plan and everyone's trying to reduce their uncertainty about how the plan is playing out from their perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4710.865,
    "end": 4714.728,
    "text": "And so if all goes to plan, we're all going to deploy into the exact right positions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.509,
    "end": 4718.591,
    "text": "But then somebody doesn't move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4720.62,
    "end": 4729.923,
    "text": " If each nestmate on the football team has low sensitivity, then they're going to continue in their own expected trajectory as if nothing had happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.983,
    "end": 4732.903,
    "text": "That's kind of like what we see in B. It's like a partial rollout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4733.544,
    "end": 4741.606,
    "text": "Whereas this is changing the environment, mixing our metaphors, et cetera, so that a high sensitivity teammate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4742.878,
    "end": 4754.107,
    "text": " fills in for that critical position so that the attractor state of the strategy can still be morphologically realized, even though there still is that one individual who's not moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.747,
    "end": 4759.091,
    "text": "But they're not interfering with the strategy's attraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4761.032,
    "end": 4764.515,
    "text": "But we'll come up with probably some other and better ways to talk about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.589,
    "end": 4793.623,
    "text": " okay and then they um just mention that this is something that can be modeled and it's in spm and also on franz kuchling's um github so maybe we will um look at the code and then just to say that we're not going to go into it at all today but all of section 4 is super interesting they review some of the mathematical assumptions and limitations of the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.568,
    "end": 4798.93,
    "text": " there's a really fascinating discussion about variational principles and open systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.57,
    "end": 4811.234,
    "text": "And so just to read, we have shown that the variational free energy minimization in active inference is related to the variational principle of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4812.254,
    "end": 4816.616,
    "text": "It is worth pointing out where these two approaches diverge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4819.457,
    "end": 4822.138,
    "text": "Two instruments in a wood diverged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4823.158,
    "end": 4846.78,
    "text": " then it's all about that divergence and the contrasting and so i think there's going to be a lot to unpack there and then they have some closing remarks on the applicability in biological systems and some of the predictive capacities of the simulations um in terms of like you could make a simulation of a healthy functioning tissue and then have predictive capacity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.081,
    "end": 4849.402,
    "text": " about asking counterfactuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.422,
    "end": 4850.542,
    "text": "Well, what if this happened?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.622,
    "end": 4851.523,
    "text": "What might I expect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.903,
    "end": 4856.105,
    "text": "So that is a lot of info.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.505,
    "end": 4868.831,
    "text": "So thanks to everybody who's been watching and again, hope that especially with some of these technical parts that we were able to represent it with high integrity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4869.512,
    "end": 4875.855,
    "text": "So you won't have the last word, but what would you say in closing as we move from the dot zero into the one, two and beyond?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.387,
    "end": 4883.29,
    "text": " Well, first of all, you went through a heck of a lot of stuff in a very short period of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4883.33,
    "end": 4886.012,
    "text": "So that's quite the gradient flow right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4886.072,
    "end": 4886.972,
    "text": "So that's impressive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.354,
    "end": 4894.197,
    "text": "I don't think much in terms of, I mean, this is a classic example of where you have to unpack",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.949,
    "end": 4906.684,
    "text": " as opposed to lots of the other papers that are maybe more philosophically based where you provision, like you pack a bunch of stuff and then you kind of go off on a bit of a journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.704,
    "end": 4913.173,
    "text": "And I think in the point one and the point two, we may still be doing a little bit more unpacking just because of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4914.416,
    "end": 4919.6,
    "text": " the density of this kind of information, but that doesn't, I mean, you want to be able to do both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4919.72,
    "end": 4930.228,
    "text": "So I think being able to cover this and hopefully we got it right, like I did my best to try to understand it and I think you did a good job of explaining it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.308,
    "end": 4936.213,
    "text": "So we'll see who shows up in the point one and two, whether the point one and two are more unpacking or maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.793,
    "end": 4957.678,
    "text": " starting to actually think of ways that we can employ this you already mentioned that we could we can apply it to digital teams but whether or not people have the confidence to be able to take this and apply it like they've done to morphogenesis maybe that's part of that conversation cool yeah i'll be looking forward to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.076,
    "end": 4980.241,
    "text": " going through with multiple concurrent regimes of attention some of the formalisms that we either um disgraced or skipped in this discussion and then keeping it open to think about morphogenesis like where has morphogenesis been in numbers one through 38.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.701,
    "end": 5010.482,
    "text": " why haven't we been talking about morphogenesis and if not morphogenesis then what else have we been focusing on um how does it relate to embodiment and to spatial and physical aspects of cognition there's so many interesting angles and uh i'm sure we'll have a lot to discuss so dean thanks a ton for all the help on the slides and for this discussion um hope to see you in the coming weeks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.778,
    "end": 5012.039,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5012.06,
    "end": 5012.662,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5012.682,
    "end": 5013.064,
    "text": "Take care.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.626,
    "end": 5013.847,
    "text": "Peace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.887,
    "end": 5014.209,
    "text": "See you later.",
    "speaker": "SPEAKER_01"
  }
]